{
  "id": "10907baa-70a4-456e-9413-590390f139db",
  "title": "New Nuclear Fuel Rods Endure 3,452F For 120-Day Test, Raising Hopes for Safer Reactors",
  "link": "https://hardware.slashdot.org/story/24/12/06/2233231/new-nuclear-fuel-rods-endure-3452f-for-120-day-test-raising-hopes-for-safer-reactors?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Nuclear rods are traditionally clad in metal. But a U.S. energy company wants to develop a better, safer alternative that instead uses silicon carbide composites. Working with America's Energy Department, General Atomics Electromagnetic Systems just completed a 120-day irradiation testing period simulating the intense radiation and extreme temperatures (3,452F) of a pressurized water reactor in a real-world nuclear power plant. And the tests \"showed no significant mass change, indicating promising performance,\" the company said in a statement. \"This indicates that the SiGA cladding is exceptionally resistant to the damaging effects of radiation.\" Long-time Slashdot reader fahrbot-bot shared this report from the Interesting Engineering blog: \"This success is a key milestone on SiGA cladding's development path to enhance the safety of the existing U.S. fleet of light water reactors,\" added Scott Forney, president of GA-EMS. \"It could also do the same for the future generation of advanced nuclear power systems.\" This advanced material offers significant advantages over traditional metal cladding. It can withstand temperatures up to 1900 degreesC (3452 degreesF), far exceeding the limits of current materials. This enhanced heat resistance is crucial for improving safety margins in nuclear reactors. Moreover, the company claims that in case of any accident, SiGA cladding is designed to maintain its integrity at temperatures where traditional cladding might fail. This could prevent the release of radioactive materials and significantly improve overall reactor safety. Furthermore, SiGA cladding offers performance benefits. It enables higher power operation and longer fuel lifetimes. This translates to increased efficiency and reduced costs for nuclear power plants... The design, safety, and installation of new nuclear reactors have been a prime subject for research. Recently, France-based Newcleo applied to the United Kingdom's Department of Energy Security and Net Zero (DESNZ) to enter its lead-cooled small modular reactor for generating fission energy in the generic design assessment phase. Newcleo's SMR can operate at atmospheric pressure, and the company also states that no significant energy release occurs in cases of vessel failure. This also eliminates the need for high-pressure-resistant containment. The article notes that General Atomics's collaboration with the U.S. Energy Department is \"part of the Accident Tolerant Fuel Program, a national effort to improve the safety and performance of nuclear reactors.\" Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2024-12-06T22:35:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "power"
  ],
  "byline": "",
  "length": 2576,
  "excerpt": "Nuclear rods are traditionally clad in metal. But a U.S. energy company wants to develop a better, safer alternative that instead uses silicon carbide composites. Working with America's Energy Department, General Atomics Electromagnetic Systems just completed a 120-day irradiation testing period ...",
  "siteName": "",
  "favicon": "",
  "text": "Nuclear rods are traditionally clad in metal. But a U.S. energy company wants to develop a better, safer alternative that instead uses silicon carbide composites. Working with America's Energy Department, General Atomics Electromagnetic Systems just completed a 120-day irradiation testing period simulating the intense radiation and extreme temperatures (3,452F) of a pressurized water reactor in a real-world nuclear power plant. And the tests \"showed no significant mass change, indicating promising performance,\" the company said in a statement. \"This indicates that the SiGA cladding is exceptionally resistant to the damaging effects of radiation.\" Long-time Slashdot reader fahrbot-bot shared this report from the Interesting Engineering blog: \"This success is a key milestone on SiGA cladding's development path to enhance the safety of the existing U.S. fleet of light water reactors,\" added Scott Forney, president of GA-EMS. \"It could also do the same for the future generation of advanced nuclear power systems.\" This advanced material offers significant advantages over traditional metal cladding. It can withstand temperatures up to 1900 degreesC (3452 degreesF), far exceeding the limits of current materials. This enhanced heat resistance is crucial for improving safety margins in nuclear reactors. Moreover, the company claims that in case of any accident, SiGA cladding is designed to maintain its integrity at temperatures where traditional cladding might fail. This could prevent the release of radioactive materials and significantly improve overall reactor safety. Furthermore, SiGA cladding offers performance benefits. It enables higher power operation and longer fuel lifetimes. This translates to increased efficiency and reduced costs for nuclear power plants... The design, safety, and installation of new nuclear reactors have been a prime subject for research. Recently, France-based Newcleo applied to the United Kingdom's Department of Energy Security and Net Zero (DESNZ) to enter its lead-cooled small modular reactor for generating fission energy in the generic design assessment phase. Newcleo's SMR can operate at atmospheric pressure, and the company also states that no significant energy release occurs in cases of vessel failure. This also eliminates the need for high-pressure-resistant containment. The article notes that General Atomics's collaboration with the U.S. Energy Department is \"part of the Accident Tolerant Fuel Program, a national effort to improve the safety and performance of nuclear reactors.\"",
  "image": "https://a.fsdn.com/sd/topics/power_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175606927\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tNuclear rods are traditionally clad in metal.  But a U.S. energy company wants to develop a better, safer alternative that instead uses silicon carbide composites.  Working with America\u0026#39;s Energy Department, General Atomics Electromagnetic Systems just completed a  120-day irradiation testing period simulating the intense radiation and extreme temperatures (3,452F) of a pressurized water reactor in a real-world nuclear power plant.\u003c/p\u003e\u003cp\u003e \n\nAnd the tests \u0026#34;showed no significant mass change, indicating promising performance,\u0026#34; the company \u003ca href=\"https://www.ga.com/ga-completes-siga-cladded-nuclear-fuel-rod-irradiation-testing\"\u003esaid in a statement\u003c/a\u003e.  \u0026#34;This indicates that the SiGA cladding is exceptionally resistant to the damaging effects of radiation.\u0026#34;\n\nLong-time Slashdot reader \u003ca href=\"https://www.slashdot.org/~fahrbot-bot\"\u003efahrbot-bot\u003c/a\u003e shared \u003ca href=\"https://interestingengineering.com/energy/nuclear-fuel-rods-raise-safety-standards\"\u003ethis report from the \u003cem\u003eInteresting Engineering\u003c/em\u003e blog\u003c/a\u003e:\n\u003ci\u003e\n\u0026#34;This success is a key milestone on SiGA cladding\u0026#39;s development path to enhance the safety of the existing U.S. fleet of light water reactors,\u0026#34; added Scott Forney, president of GA-EMS. \u0026#34;It could also do the same for the future generation of advanced nuclear power systems.\u0026#34;      This advanced material offers significant advantages over traditional metal cladding.  It can withstand temperatures up to 1900 degreesC (3452 degreesF), far exceeding the limits of current materials. This enhanced heat resistance is crucial for improving safety margins in nuclear reactors. Moreover, the company claims that in case of any accident, SiGA cladding is designed to maintain its integrity at temperatures where traditional cladding might fail.  This could prevent the release of radioactive materials and significantly improve overall reactor safety.\u003cp\u003e \n\nFurthermore, SiGA cladding offers performance benefits. It enables higher power operation and longer fuel lifetimes. This translates to increased efficiency and reduced costs for nuclear power plants...\u003c/p\u003e\u003cp\u003e \n\nThe design, safety, and installation of new nuclear reactors have been a prime subject for research. Recently, France-based Newcleo applied to the United Kingdom\u0026#39;s Department of Energy Security and Net Zero (\u003ca href=\"https://interestingengineering.com/energy/smr-design-for-nuclear-fission\"\u003eDESNZ\u003c/a\u003e) to enter its lead-cooled small modular reactor for generating fission energy in the generic design assessment phase. Newcleo\u0026#39;s SMR can operate at atmospheric pressure, and the company also states that no significant energy release occurs in cases of vessel failure. This also eliminates the need for high-pressure-resistant containment.\n\u003c/p\u003e\u003c/i\u003e \u003cbr/\u003e\nThe article notes that General Atomics\u0026#39;s collaboration with the U.S. Energy Department is \u0026#34;part of the Accident Tolerant Fuel Program, a national effort to improve the safety and performance of nuclear reactors.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
