{
  "id": "14eb667d-7ae7-477b-a939-c64ba51ee2de",
  "title": "SCOTUS upholds part of ACA that makes preventive care fully covered",
  "link": "https://arstechnica.com/health/2025/06/critical-preventive-care-will-remain-free-under-aca-health-plans-scotus-rules/",
  "description": "Cancer screenings, statins, vaccines, PrEP, will continue to be covered in full.",
  "author": "Beth Mole",
  "published": "Fri, 27 Jun 2025 21:49:19 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "ACA",
    "preventive services",
    "US Supreme Court",
    "USPSTF"
  ],
  "byline": "Beth Mole",
  "length": 1505,
  "excerpt": "Cancer screenings, statins, vaccines, PrEP, will continue to be covered in full.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The USPSTF is made up of 16 medical experts who carefully review scientific data and run models to assess what preventive health interventions are best, using a framework of recommendation gradings from A to F. Any recommendations graded A or B by the task force are required by the ACA to be covered by health plans at no cost to patients. The US health department argued that the task force members are, in fact, appointed, and under control of the health secretary, a role currently filled by anti-vaccine advocate Robert F. Kennedy Jr. Two lower courts in Texas sided with the Christian group, saying that the government violated the appointments clause. But today, in a 6–3 ruling, the Supreme Court disagreed. Chief Justice John Roberts and Justices Amy Coney Barrett, Brett Kavanaugh, Elena Kagan, Ketanji Brown Jackson, and Sonia Sotomayor made up the majority. Writing on their behalf, Kavanaugh explained: \"Task Force members are supervised and directed by the Secretary, who in turn answers to the President, preserving the chain of command in Article II.\" While the ruling means that coverage of preventive health care is no longer under threat, the ruling clarifies that the health secretary has direct authority over the USPSTF. The clarification raises concern that the current secretary, Kennedy, could remove task force members and/or undo recommendations to suit his personal ideology, as he is now doing with the vaccine advisory board at the Centers for Disease Control and Prevention.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eThe USPSTF is made up of 16 medical experts who carefully review scientific data and run models to assess what preventive health interventions are best, using a framework of recommendation gradings from A to F. Any recommendations graded A or B by the task force are required by the ACA to be covered by health plans at no cost to patients.\u003c/p\u003e\n\u003cp\u003eThe US health department argued that the task force members are, in fact, appointed, and under control of the health secretary, a role currently filled by anti-vaccine advocate Robert F. Kennedy Jr.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.npr.org/2025/06/27/nx-s1-5430393/supreme-court-obamacare-preventive-care\"\u003eTwo lower courts in Texas\u003c/a\u003e sided with the Christian group, saying that the government violated the appointments clause.\u003c/p\u003e\n\u003cp\u003eBut today, in \u003ca href=\"https://www.supremecourt.gov/opinions/24pdf/24-316_869d.pdf\"\u003ea 6–3 ruling\u003c/a\u003e, the Supreme Court disagreed. Chief Justice John Roberts and Justices Amy Coney Barrett, Brett Kavanaugh, Elena Kagan, Ketanji Brown Jackson, and Sonia Sotomayor made up the majority.\u003c/p\u003e\n\u003cp\u003eWriting on their behalf, Kavanaugh explained: \u0026#34;Task Force members are supervised and directed by the Secretary, who in turn answers to the President, preserving the chain of command in Article II.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhile the ruling means that coverage of preventive health care is no longer under threat, the ruling clarifies that the health secretary has direct authority over the USPSTF. The clarification \u003ca href=\"https://www.statnews.com/2025/06/27/supreme-court-decision-braidwood-rfk-jr-more-power-over-obamacare-coverage-free-preventive-services/\"\u003eraises concern\u003c/a\u003e that the current secretary, Kennedy, could \u003ca href=\"https://arstechnica.com/health/2025/06/all-17-fired-vaccine-advisors-unite-to-blast-rfk-jr-s-destabilizing-decisions/\"\u003eremove task force members\u003c/a\u003e and/or undo recommendations to suit his personal ideology, as he is now doing with the \u003ca href=\"https://arstechnica.com/health/2025/06/rfk-jr-s-cdc-panel-ditches-some-flu-shots-based-on-anti-vaccine-junk-data/\"\u003evaccine advisory board\u003c/a\u003e at the Centers for Disease Control and Prevention.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-27T21:49:19Z",
  "modifiedTime": "2025-06-27T22:00:18Z"
}
