{
  "id": "16e21b0a-02f4-44d9-8e95-dc912c6ac520",
  "title": "Startup necromancy: Dead Google Apps domains can be compromised by new owners",
  "link": "https://arstechnica.com/security/2025/01/startup-necromancy-dead-google-apps-domains-can-be-compromised-by-new-owners/",
  "description": "Improperly winding down a Google Apps domain can leave logins accessible.",
  "author": "Kevin Purdy",
  "published": "Wed, 15 Jan 2025 19:51:08 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Google",
    "Security",
    "authentication",
    "google",
    "google account",
    "google workspace",
    "OAuth",
    "security",
    "slack",
    "startups",
    "zoom"
  ],
  "byline": "Kevin Purdy",
  "length": 2652,
  "excerpt": "Improperly winding down a Google Apps domain can leave logins accessible.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Lots of startups use Google's productivity suite, known as Workspace, to handle email, documents, and other back-office matters. Relatedly, lots of business-minded webapps use Google's OAuth, i.e. \"Sign in with Google.\" It's a low-friction feedback loop—up until the startup fails, the domain goes up for sale, and somebody forgot to close down all the Google stuff. Dylan Ayrey, of Truffle Security Co., suggests in a report that this problem is more serious than anyone, especially Google, is acknowledging. Many startups make the critical mistake of not properly closing their accounts—on both Google and other web-based apps—before letting their domains expire. Given the number of people working for tech startups (6 million), the failure rate of said startups (90 percent), their usage of Google Workspaces (50 percent, all by Ayrey's numbers), and the speed at which startups tend to fall apart, there are a lot of Google-auth-connected domains up for sale at any time. That would not be an inherent problem, except that, as Ayrey shows, buying a domain with a still-active Google account can let you re-activate the Google accounts for former employees. With admin access to those accounts, you can get into many of the services they used Google's OAuth to log into, like Slack, ChatGPT, Zoom, and HR systems. Ayrey writes that he bought a defunct startup domain and got access to each of those through Google account sign-ins. He ended up with tax documents, job interview details, and direct messages, among other sensitive materials. You have to close up shop, not just abandon it Reached for comment, a Google spokesperson provided a statement: We appreciate Dylan Ayrey’s help identifying the risks stemming from customers forgetting to delete third-party SaaS services as part of turning down their operation. As a best practice, we recommend customers properly close out domains following these instructions to make this type of issue impossible. Additionally, we encourage third-party apps to follow best-practices by using the unique account identifiers (sub) to mitigate this risk. Google's instructions note that canceling a Google Workspace \"doesn't remove user accounts,\" which remain until an organization's Google account is deleted. Notably, Ayrey's methods were not able to access data stored inside each re-activated Google account, but on third-party platforms. While Ayrey's test cases and data largely concern startups, any domain that used Google Workspace accounts to authenticate with third-party services and failed to delete their Google account to remove its domain link before selling the domain could be vulnerable.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/zombie-apps-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eLots of startups use Google\u0026#39;s productivity suite, known as Workspace, to handle email, documents, and other back-office matters. Relatedly, lots of business-minded webapps use Google\u0026#39;s OAuth, i.e. \u0026#34;Sign in with Google.\u0026#34; It\u0026#39;s a low-friction feedback loop—up until the startup fails, the domain goes up for sale, and somebody forgot to close down all the Google stuff.\u003c/p\u003e\n\u003cp\u003eDylan Ayrey, of Truffle Security Co., \u003ca href=\"https://trufflesecurity.com/blog/millions-at-risk-due-to-google-s-oauth-flaw\"\u003esuggests in a report\u003c/a\u003e that this problem is more serious than anyone, especially Google, is acknowledging. Many startups make the critical mistake of not properly closing their accounts—on both Google and other web-based apps—before letting their domains expire.\u003c/p\u003e\n\u003cp\u003eGiven the number of people working for tech startups (6 million), the failure rate of said startups (90 percent), their usage of Google Workspaces (50 percent, all by Ayrey\u0026#39;s numbers), and the speed at which startups tend to fall apart, there are a lot of Google-auth-connected domains up for sale at any time. That would not be an inherent problem, except that, as Ayrey shows, buying a domain with a still-active Google account can let you re-activate the Google accounts for former employees.\u003c/p\u003e\n\u003cp\u003eWith admin access to those accounts, you can get into many of the services they used Google\u0026#39;s OAuth to log into, like Slack, ChatGPT, Zoom, and HR systems. Ayrey writes that he bought a defunct startup domain and got access to each of those through Google account sign-ins. He ended up with tax documents, job interview details, and direct messages, among other sensitive materials.\u003c/p\u003e\n\u003ch2\u003eYou have to close up shop, not just abandon it\u003c/h2\u003e\n\u003cp\u003eReached for comment, a Google spokesperson provided a statement:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eWe appreciate Dylan Ayrey’s help identifying the risks stemming from customers forgetting to delete third-party SaaS services as part of turning down their operation. As a best practice, we recommend customers properly close out domains following \u003ca href=\"https://support.google.com/a/answer/1257646?sjid=344813928108938010-NC#zippy=%2Ccancel-a-domain-verified-subscription\"\u003ethese instructions\u003c/a\u003e to make this type of issue impossible. Additionally, we encourage third-party apps to follow best-practices by using the unique account identifiers (sub) to mitigate this risk.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eGoogle\u0026#39;s instructions note that canceling a Google Workspace \u0026#34;doesn\u0026#39;t remove user accounts,\u0026#34; which remain until \u003ca href=\"https://support.google.com/a/answer/9468554?sjid=12779802837482984927-NA\"\u003ean organization\u0026#39;s Google account is deleted\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNotably, Ayrey\u0026#39;s methods were not able to access data stored inside each re-activated Google account, but on third-party platforms. While Ayrey\u0026#39;s test cases and data largely concern startups, any domain that used Google Workspace accounts to authenticate with third-party services and failed to delete their Google account to remove its domain link before selling the domain could be vulnerable.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-15T19:51:08Z",
  "modifiedTime": "2025-01-15T21:01:01Z"
}
