{
  "id": "2890be5b-3638-4b39-8d3f-bcc64de0424f",
  "title": "How Strawberry Shortcake Introduced Me to the Conundrum of Cartoons on DVD",
  "link": "https://gizmodo.com/why-is-animation-on-dvd-blu-ray-physical-media-strawberry-shortcake-2000581825",
  "description": "Trying to find alternatives to 24/7 streaming channels has lead to a realization: just why is so much classic animation stuck on DVD?",
  "author": "Sabina Graves",
  "published": "Mon, 31 Mar 2025 23:21:06 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Bluey",
    "Disney Plus",
    "Looney Tunes",
    "Max",
    "PlutoTV",
    "Strawberry Shortcake"
  ],
  "byline": "Sabina Graves",
  "length": 5322,
  "excerpt": "Trying to find alternatives to 24/7 streaming channels has lead to a realization: just why is so much classic animation stuck on DVD?",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The advent of streaming wars has built a physical media scarcity in a very specific medium: animation. One of the headaches of Disney+ is having to sit through copious credits from all over the world between episodes of Bluey, and then having to deal with the background ambient binge of episodes stopping abruptly. Then there’s the matter of trying to restart the cycle-through of episodes when it just pops you back to the main series menu. And no, watching Disney’s live cartoon stream so it can push other shows among Bluey episodes doesn’t cut it. It’s why I found myself going out and just buying season one and two on DVD. In the baby trenches, having something on in the background while feeding and nurturing a growing tiny human has been super important. After getting tired of the constant “Are you still watching?” messages, we switched over to live channels including PlutoTV. Quickly my kid’s attention was grabbed by Strawberry Shortcake on the free platform, and not being a part of that fandom I was excited to dive in with her. The ease of watching it on live television like we had growing up and carving out times to show it to her while feeding or to have her watch something with cute music and colors was so effortlessly freeing.  It made us want to go out and buy the Y2K years of Strawberry Shortcake shows on physical media to add to her library and hunt down pop culture kids clothes from that era on resale sites like Depop. And that’s when the scarcity struck yet again! Sure, you can find specials with episode bundles through re-sellers and limited online supply at retailers. But it’s once again adding more work, when before you could just go into Best Buy or Target and easily get your hands on the what you wanted. What’s even more surprising is that Strawberry Shortcake and her bitty world of magical friends and sentient fruit creatures is currently hugely popular. During PlutoTV’s recent battle of fandoms bracket that included a pretty solid line-up of 16 free-to-watch shows from all television mediums, Strawberry Shortcake beat out Big Brother on probably the most accessible live streaming platform. And I can’t go into the store and buy the season? That’s so weird. Even with the growth in production of animation—which we saw get more interest during 2020 for entertainment that’s been released since—it’s still strange to see animated properties, even popular ones like Bluey, we only see DVD releases. There is the possibility that the Blu-ray format could deteriorate the animation coloring by pushing the presentation too much, and that studios see it as too costly to honor preservation of the art form. The intricacies of printing DVDs has recently hit the news with reports that disc rot is a very real thing. But the most recent culprit? Warner Bros. As the Verge has reported, WB Home Entertainment did make DVDs that were found to be deteriorating, and that it’s now replacing or offering titles of equal value in exchange for out of print movies. DVDs are supposed to last 100 years if taken care of, according to Ars Technica. But of course it had to be Warner Bros. specifically for certain DVDs released from 2006-2008. Then there’s scarcity when it comes to a platform like Max, where Looney Tunes, another iconic cartoon, constantly gets pulled from the library in favor of adding more crappy reality shows to the streamer. The Looney Tunes cartoons have had a long history of being available in physical formats; years of the Golden Collection were made available on DVD as part of a six-case set individually sold to build your library over the years. The first Blu-rays were released as the Platinum Collection from 2011 to 2014; after that came the Collector’s Choice re-issues, which ended last year. This year the vault (physical media’s favorite word for gatekeeping, thanks Disney) box set is to be released this June. This scarcity is beginning to feel created in merchandise and physical releases all around. At least Looney Tunes is one of the few animated franchises to get Blu-ray releases like this, alongside the likes of The Simpsons, Adventure Time, and Rick and Morty. But for the most part those shows are for adult audiences, and their releases in the format likewise are to serve that particular audience. Kids-focused media, classic or otherwise, still has a much more prevalent home on DVD–a format that, while similarly prevalent, is increasingly playing second fiddle to the blu-ray standard. Companies have known for years at this point the lucrative power of nostalgia. But it shouldn’t take the exploitative nature of nostalgic resurgences to get them to capitalize on re-emergent fandoms. Access to the classics (and the not-so-classics) on the best quality physical media shouldn’t just be for the purview of premium collecting, but to maintain accessibility to these shows and these stories for generations to come in the best way possible. At least for now I can satisfy my daughter’s Strawberry Shortcake fix on a streamer that appreciates it. But as we’ve so often seen: just how long will that be the case? Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/03/Strawberry-shortcake.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe advent of streaming wars has built a \u003ca href=\"https://gizmodo.com/warner-bros-looney-tunes-loathing-has-leaped-from-the-digital-to-the-physical-world-2000581856\"\u003ephysical media scarcity in a very specific medium: animation\u003c/a\u003e. One of the headaches of \u003ca href=\"https://gizmodo.com/disney-shelves-the-princess-and-the-frog-sequel-series-tiana-2000571022\"\u003eDisney+\u003c/a\u003e is having to sit through copious credits from all over the world between episodes of \u003cem\u003e\u003ca href=\"https://gizmodo.com/bluey-2025-experiences-lego-theme-park-tv-show-movie-2000548796\"\u003eBluey\u003c/a\u003e\u003c/em\u003e, and then having to deal with the background ambient binge of episodes stopping abruptly. Then there’s the matter of trying to restart the cycle-through of episodes when it just pops you back to the main series menu. And no, watching Disney’s live cartoon stream so it can push other shows among \u003cem\u003eBluey\u003c/em\u003e episodes doesn’t cut it. It’s why I found myself going out and just buying season one and two on DVD.\u003c/p\u003e \u003cp\u003eIn the baby trenches, having something on in the background while feeding and nurturing a growing tiny human has been super important. After getting tired of the constant “Are you still watching?” messages, we switched over to live channels including PlutoTV. Quickly my kid’s attention was grabbed by \u003ca href=\"https://pluto.tv/us/on-demand/series/61b3e2f837f2a80013d8bb77/season/1\"\u003e\u003cem\u003eStrawberry Shortcake \u003c/em\u003eon the free platform\u003c/a\u003e, and not being a part of that fandom I was excited to dive in with her. The ease of watching it on live television like we had growing up and carving out times to show it to her while feeding or to have her watch something with cute music and colors was so effortlessly freeing.  It made us want to go out and buy the Y2K years of\u003cem\u003e Strawberry Shortcake\u003c/em\u003e shows on physical media to add to her library and hunt down pop culture kids clothes from that era on resale sites like Depop.\u003c/p\u003e \u003cp\u003eAnd that’s when the scarcity struck yet again! Sure, you can find specials with episode bundles through \u003ca href=\"https://www.amazon.com/s?tag=gizmodo08c-20\"\u003ere-sellers and limited online supply\u003c/a\u003e at retailers. But it’s once again adding more work, when before you could just go into Best Buy or Target and easily get your hands on the what you wanted. What’s even more surprising is that Strawberry Shortcake and her bitty world of magical friends and sentient fruit creatures is currently hugely popular. During PlutoTV’s recent battle of fandoms bracket that included a pretty solid line-up of 16 free-to-watch shows from all television mediums, \u003cem\u003eStrawberry Shortcake\u003c/em\u003e beat out \u003cem\u003eBig Brother\u003c/em\u003e on probably the most accessible live streaming platform. And I can’t go into the store and buy the season? That’s so weird.\u003c/p\u003e    \u003cp\u003eEven with the growth in production of animation—which we saw get more interest during 2020 for entertainment that’s been released since—it’s still strange to see animated properties, even popular ones like\u003cem\u003e Bluey\u003c/em\u003e, we only see DVD releases. There is the possibility that the Blu-ray format could deteriorate the animation coloring by pushing the presentation too much, and that studios see it as too costly to honor preservation of the art form. The intricacies of printing DVDs has recently hit the news with reports that disc rot is a very real thing. But the most recent culprit? Warner Bros. As \u003ca href=\"https://www.theverge.com/news/626482/warner-bros-dvd-disc-rot-failure-2006-2008-replacement\"\u003ethe Verge\u003c/a\u003e has reported, WB Home Entertainment did make DVDs that were found to be deteriorating, and that it’s now replacing or offering titles of equal value in exchange for out of print movies. DVDs are supposed to last 100 years if taken care of, according to \u003ca href=\"https://arstechnica.com/gadgets/2025/03/they-curdle-like-milk-wb-dvds-from-2006-2008-are-rotting-away-in-their-cases/\"\u003eArs Technica\u003c/a\u003e. But of course it had to be Warner Bros. specifically for certain DVDs released from 2006-2008.\u003c/p\u003e \u003cp\u003eThen there’s scarcity when it comes to a platform like Max, where \u003cem\u003eLooney Tunes\u003c/em\u003e, another iconic cartoon, constantly gets pulled from the library in favor of adding more crappy reality shows to the streamer. \u003cem\u003eThe Looney Tunes\u003c/em\u003e cartoons have had a long history of being available in physical formats; years of the Golden Collection were made available on DVD as part of a six-case set individually sold to build your library over the years. The first Blu-rays were released as the Platinum Collection from 2011 to 2014; after that came the \u003ca href=\"https://www.amazon.com/Looney-Tunes-Collectors-Choice-Coll/dp/B0DJL8NYC9/ref=asc_df_B0DJL8NYC9?tag=gizmodo08c-20\"\u003eCollector’s Choice re-issues\u003c/a\u003e, which ended last year. This year the vault (physical media’s favorite word for gatekeeping, thanks Disney) box set is to be released this June. This \u003ca href=\"https://gizmodo.com/why-is-disneys-new-snow-white-merch-the-rarest-of-them-all-2000577699\"\u003escarcity is beginning to feel created in merchandise\u003c/a\u003e and physical releases all around.\u003c/p\u003e\n\n \u003cp\u003eAt least \u003cem\u003eLooney Tunes\u003c/em\u003e is one of the few animated franchises to get Blu-ray releases like this, alongside the likes of \u003cem\u003eThe Simpsons\u003c/em\u003e, \u003cem\u003eAdventure Time\u003c/em\u003e, and \u003cem\u003eRick and Morty\u003c/em\u003e. But for the most part those shows are for adult audiences, and their releases in the format likewise are to serve that particular audience. Kids-focused media, classic or otherwise, still has a much more prevalent home on DVD–a format that, while similarly prevalent, is increasingly playing second fiddle to the blu-ray standard.\u003c/p\u003e \u003cp\u003eCompanies have known for years at this point the lucrative power of nostalgia. But it shouldn’t take the exploitative nature of nostalgic resurgences to get them to capitalize on re-emergent fandoms. Access to the classics (and the not-so-classics) on the best quality physical media shouldn’t just be for the purview of premium collecting, but to maintain accessibility to these shows and these stories for generations to come in the best way possible. At least for now I can satisfy my daughter’s \u003cem\u003eStrawberry Shortcake\u003c/em\u003e fix on a streamer that appreciates it. But as we’ve so often seen: just how long will that be the case?\u003c/p\u003e   \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-31T23:21:06Z",
  "modifiedTime": "2025-03-31T23:33:52Z"
}
