{
  "id": "2cb5a6ec-4d95-4379-bba1-c522460a954d",
  "title": "Pixel Phones Are Getting a New Scam Detection Tool",
  "link": "https://lifehacker.com/tech/scam-detection-pixel-phones?utm_medium=RSS",
  "description": "Google is rolling out real-time monitoring for calls and texts.",
  "author": "Emily Long",
  "published": "Wed, 26 Feb 2025 23:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Security"
  ],
  "byline": "Emily Long",
  "length": 2071,
  "excerpt": "Google is rolling out real-time monitoring for calls and texts.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Pixel users will soon get an extra layer of protection against malicious calls and texts, as Google's AI-powered, real-time scam detection is rolling out widely next month. The Gemini Nano feature, which is coming to both Google Messages and Phone by Google, runs in the background and will alert you mid-call if it identifies \"conversation patterns commonly associated with scammers.\" You'll hear a beep at the beginning of possible scam calls to indicate that the conversation is being monitored, with subsequent beeps sounding every few minutes. You'll also see an on-screen prompt when suspicious activity has been detected, with options to \"End call\" or mark \"Not a scam.\" For messages, possible scam texts will be automatically moved to your Spam \u0026 blocked folder. Google says that the feature works on-device only and will not save or record any call or message content. Google rolled out live threat detection for spotting malicious apps on your Pixel late last year (the same time that Scam Detection launched in a public beta). That feature alerts you to suspicious apps—specifically, \"stalkerware\" that scrapes your personal data—in real time so you can evaluate and delete them if needed. How to enable scam detection on your PixelOnce scam detection is widely available in March, you can activate the feature for calls in your settings. Open Phone by Google Settings \u003e Scam Detection and toggle scam detection on. To enable detection and filtering for spam texts in Google Messages, go to Messages Settings \u003e Spam protection.Of course, threat and scam detection features don't absolve users of the responsibility to follow basic security best practices when it comes to calls, messages, and apps. Be wary of calls and texts from numbers you don't know, and don't engage with anyone requesting urgent action, such as providing sensitive information, sending money, or downloading software or apps to your devices. Don't click links in suspicious texts or emails, and always go directly to the website for the bank or institution to locate contact information.",
  "image": "https://lifehacker.com/imagery/articles/01JN1NACPZ1Z2YQ7M3D622THNN/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003ePixel users will soon get an extra layer of protection against malicious calls and texts, as Google\u0026#39;s AI-powered, real-time \u003ca href=\"https://store.google.com/intl/en/ideas/articles/gemini-nano-offline/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003escam detection is rolling out widely next month\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eThe Gemini Nano feature, which is coming to both Google Messages and Phone by Google, runs in the background and will alert you mid-call if it identifies \u0026#34;conversation patterns commonly associated with scammers.\u0026#34; You\u0026#39;ll hear a beep at the beginning of possible scam calls to indicate that the conversation is being monitored, with subsequent beeps sounding every few minutes. You\u0026#39;ll \u003ca href=\"https://9to5google.com/2025/02/26/pixel-scam-detection-messages-phone/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ealso see an on-screen prompt\u003c/a\u003e when suspicious activity has been detected, with options to \u0026#34;End call\u0026#34; or mark \u0026#34;Not a scam.\u0026#34; For messages, possible scam texts will be automatically moved to your Spam \u0026amp; blocked folder. \u003c/p\u003e\u003cp\u003eGoogle says that the feature works on-device only and will not save or record any call or message content. \u003c/p\u003e\u003cp\u003eGoogle rolled out \u003ca href=\"https://lifehacker.com/tech/your-pixel-can-spot-malicious-apps-on-your-phone\" target=\"_blank\"\u003elive threat detection\u003c/a\u003e for spotting malicious apps on your Pixel late last year (the same time that Scam Detection launched in a public beta). That feature alerts you to suspicious apps—specifically, \u0026#34;stalkerware\u0026#34; that scrapes your personal data—in real time so you can evaluate and delete them if needed. \u003c/p\u003e\u003ch2 id=\"how-to-enable-scam-detection-on-your-pixel\"\u003eHow to enable scam detection on your Pixel\u003c/h2\u003e\u003cp\u003eOnce scam detection is widely available in March, you can activate the feature for calls in your settings. Open \u003cstrong\u003ePhone by Google Settings \u0026gt; Scam Detection\u003c/strong\u003e and toggle scam detection on. To enable detection and filtering for spam texts in Google Messages, go to \u003cstrong\u003eMessages Settings \u0026gt; Spam protection\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eOf course, threat and scam detection features don\u0026#39;t absolve users of the responsibility to follow basic security best practices when it comes to calls, messages, and apps. Be wary of calls and texts from numbers you don\u0026#39;t know, and don\u0026#39;t engage with anyone requesting urgent action, such as providing sensitive information, sending money, or downloading software or apps to your devices. Don\u0026#39;t click links in suspicious texts or emails, and always go directly to the website for the bank or institution to locate contact information. \u003c/p\u003e\n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-26T23:30:00Z",
  "modifiedTime": "2025-02-26T23:30:00Z"
}
