{
  "id": "336eccf7-d245-4bd5-95f4-82c000cb5176",
  "title": "Pentagon may put SpaceX at the center of a sensor-to-shooter targeting network",
  "link": "https://arstechnica.com/space/2025/07/pentagon-may-put-spacex-at-the-center-of-a-sensor-to-shooter-targeting-network/",
  "description": "Under this plan, SpaceX's satellites would play a big role in the Space Force's kill chain.",
  "author": "Stephen Clark",
  "published": "Tue, 01 Jul 2025 21:51:52 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Science",
    "Space",
    "milnet",
    "space development agency",
    "space force",
    "spacex",
    "starlink",
    "starshield"
  ],
  "byline": "Stephen Clark",
  "length": 16616,
  "excerpt": "Under this plan, SpaceX’s satellites would play a big role in the Space Force’s kill chain.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Under this plan, SpaceX's satellites would play a big role in the Space Force's kill chain. The Trump administration plans to cancel a fleet of orbiting data relay satellites managed by the Space Development Agency and replace it with a secretive network that, so far, relies primarily on SpaceX's Starlink Internet constellation, according to budget documents. The move prompted questions from lawmakers during a Senate hearing on the Space Force's budget last week. While details of the Pentagon's plan remain secret, the White House proposal would commit $277 million in funding to kick off a new program called \"pLEO SATCOM\" or \"MILNET.\" The funding line for a proliferated low-Earth orbit satellite communications network hasn't appeared in a Pentagon budget before, but plans for MILNET already exist in a different form. Meanwhile, the budget proposal for fiscal year 2026 would eliminate funding for a new tranche of data relay satellites from the Space Development Agency. The pLEO SATCOM or MILNET program would replace them, providing crucial support for the Trump administration's proposed Golden Dome missile defense shield. \"We have to look at what are the other avenues to deliver potentially a commercial proliferated low-Earth orbit constellation,\" Gen. Chance Saltzman, chief of space operations, told senators last week. \"So, we are simply looking at alternatives as we look to the future as to what's the best way to scale this up to the larger requirements for data transport.\" What will these satellites do? For six years, the Space Development Agency's core mission has been to provide the military with a more resilient, more capable network of missile tracking and data relay platforms in low-Earth orbit. Those would augment the Pentagon's legacy fleet of large, billion-dollar missile warning satellites that are parked more than 20,000 miles away in geostationary orbit. These satellites detect the heat plumes from missile launches—and also large explosions and wildfires—to provide an early warning of an attack. The US Space Force's early warning satellites were critical in allowing interceptors to take out Iranian ballistic missiles launched toward Israel last month. Experts say there are good reasons for the SDA's efforts. One motivation was the realization over the last decade or so that a handful of expensive spacecraft make attractive targets for an anti-satellite attack. It's harder for a potential military adversary to go after a fleet of hundreds of smaller satellites. And if they do take out a few of these lower-cost satellites, it's easier to replace them with little impact on US military operations. Missile-tracking satellites in low-Earth orbit, flying at altitudes of just a few hundred miles, are also closer to the objects they are designed to track, meaning their infrared sensors can detect and locate dimmer heat signatures from smaller projectiles, such as hypersonic missiles. The military's Space Development Agency is in the process of buying, building, and launching a network of hundreds of missile-tracking and communications satellites. Credit: Northrop Grumman But tracking the missiles isn't enough. The data must reach the ground in order to be useful. The SDA's architecture includes a separate fleet of small communications satellites to relay data from the missile tracking network, and potentially surveillance spacecraft tracking other kinds of moving targets, to military forces on land, at sea, or in the air through a series of inter-satellite laser crosslinks. The military refers to this data relay component as the transport layer. When it was established in the first Trump administration, the SDA set out to deploy tranches of tracking and data transport satellites. Each new tranche would come online every couple of years, allowing the Pentagon to tap into new technologies as fast as industry develops them. The SDA launched 27 so-called \"Tranche 0\" satellites in 2023 to demonstrate the concept's overall viability. The first batch of more than 150 operational SDA satellites, called Tranche 1, is due to begin launching later this year. The SDA plans to begin deploying more than 250 Tranche 2 satellites in 2027. Another set of satellites, Tranche 3, would have followed a couple of years later. Now, the Pentagon seeks to cancel the Tranche 3 transport layer, while retaining the Tranche 3 tracking layer under the umbrella of the Space Development Agency. Out of the shadows While SpaceX's role isn't mentioned explicitly in the Pentagon's budget documents, the MILNET program is already on the books, and SpaceX is the lead contractor. It has been made public in recent months, after years of secrecy, although many details remain unclear. Managed in a partnership between the Space Force and the National Reconnaissance Office (NRO), MILNET is designed to use military-grade versions of Starlink Internet satellites to create a \"hybrid mesh network\" the military can rely on for a wide range of applications. The military version of the Starlink platform is called Starshield. SpaceX has already launched nearly 200 Starshield satellites for the NRO, which uses them for intelligence, surveillance, and reconnaissance missions. At an industry conference last month, the Space Force commander in charge of operating the military's communications satellites revealed new information about MILNET, according to a report by Breaking Defense. The network uses SpaceX-made user terminals with additional encryption to connect with Starshield satellites in orbit. Col. Jeff Weisler, commander of a Space Force unit called Delta 8, said MILNET will comprise some 480 satellites operated by SpaceX but overseen by a military mission director \"who communicates to the contracted workforce to execute operations at the timing and tempo of warfighting.\" The Space Force has separate contracts with SpaceX to use the commercial Starlink service. MILNET's dedicated constellation of more secure Starshield satellites is separate from Starlink, which now has more 7,000 satellites in space. \"We are completely relooking at how we’re going to operate that constellation of capabilities for the joint force, which is going to be significant because we’ve never had a DoD hybrid mesh network at LEO,\" Weisler said last month. So, the Pentagon already relies on SpaceX's communication services, not to mention the company's position as the leading launch provider for Space Force and NRO satellites. With MILNET's new role as a potential replacement for the Space Development Agency's data relay network, SpaceX's satellites would become a cog in combat operations. Gen. Chance Saltzman, chief of Space Operations in the US Space Force, looks on before testifying before a House Defense Subcommittee on May 6, 2025. Credit: Brendan Smialowski/AFP via Getty Images The data transport layer, whether it's SDA's architecture or a commercial solution like Starshield, will \"underpin\" the Pentagon's planned Golden Dome missile defense system, Saltzman said. But it's not just missiles. Data relay satellites in low-Earth orbit will also have a part in the Space Force's initiatives to develop space-based platforms to track moving targets on the ground and in the air. Eventually, all Space Force satellites could have the ability to plug into MILNET to send their data to the ground. A spokesperson for the Department of the Air Force, which includes the Space Force, told Air \u0026 Space Forces Magazine that the pLEO, or MILNET, constellation \"will provide global, integrated, and resilient capabilities across the combat power, global mission data transport, and satellite communications mission areas.\" That all adds up to a lot of bits and bytes, and the Space Force's need for data backhaul is only going to increase, according to Col. Robert Davis, head of the Space Sensing Directorate at Space Systems Command. He said the SDA's satellites will use onboard edge processing to create two-dimensional missile track solutions. Eventually, the SDA's satellites will be capable of 3D data fusion with enough fidelity to generate a full targeting solution that could be transmitted directly to a weapons system for it to take action without needing any additional data processing on the ground. \"I think the compute [capability] is there,\" Davis said Tuesday at an event hosted by the Mitchell Institute, an aerospace-focused think tank in Washington, DC. \"Now, it's a comm[unication] problem and some other technical integration challenges. But how do I do that 3D fusion on orbit? If I do 3D fusion on orbit, what does that allow me to do? How do I get low-latency comms to the shooter or to a weapon itself that's in flight? So you can imagine the possibilities there.\" The possibilities include exploiting automation, artificial intelligence, and machine learning to sense, target, and strike an enemy vehicle—a truck, tank, airplane, ship, or missile—nearly instantaneously. \"If I'm on the edge doing 3D fusion, I'm less dependent on the ground and I can get around the globe with my mesh network,\" Davis said. \"There's inherent resilience in the overall architecture—not just the space architecture, but the overall architecture—if the ground segment or link segment comes under attack.\" Questioning the plan Military officials haven't disclosed the cost of MILNET, either in its current form or in the future architecture envisioned by the Trump administration. For context, SDA has awarded fixed-price contracts worth more than $5.6 billion for approximately 340 data relay satellites in Tranches 1 and 2. That comes out to roughly $16 million per spacecraft, at least an order of magnitude more expensive than a Starlink satellite coming off of SpaceX's assembly line. Starshield satellites, with their secure communications capability, are presumably somewhat more expensive than an off-the-shelf Starlink. Some former defense officials and lawmakers are uncomfortable with putting commercially operated satellites in the \"kill chain,\" the term military officials use for the process of identifying threats, making a targeting decision, and taking military action. It isn't clear yet whether SpaceX will operate the MILNET satellites in this new paradigm, but the company has a longstanding preference for doing so. SpaceX built a handful of tech demo satellites for the Space Development Agency a few years ago, but didn't compete for subsequent SDA contracts. One reason for this, sources told Ars, is that the SDA operates its satellite constellation from government-run control centers. Instead, the SDA chose L3Harris, Lockheed Martin, Northrop Grumman, Rocket Lab, Sierra Space, Terran Orbital, and York Space Systems to provide the next batches of missile tracking and data transport satellites. RTX, formerly known as Raytheon, withdrew from a contract after the company determined it couldn't make money on the program. The tracking satellites will carry different types of infrared sensors, some with wide fields of view to detect missile launches as they happen, and others with narrow-angle sensors to maintain custody of projectiles in flight. The data relay satellites will employ different frequencies and anti-jam waveforms to supply encrypted data to military forces on the ground. This frame from a SpaceX video shows a stack of Starlink Internet satellites attached to the upper stage of a Falcon 9 rocket, moments after the launcher's payload fairing is jettisoned. Credit: SpaceX The Space Development Agency's path hasn't been free of problems. The companies the agency selected to build its spacecraft have faced delays, largely due to supply chain issues, and some government officials have worried the Army, Navy, Air Force, and Marine Corps aren't ready to fully capitalize on the information streaming down from the SDA's satellites. The SDA hired SAIC, a government services firm, earlier this year with a $55 million deal to act as a program integrator with responsibility to bring together satellites from multiple contractors, keep them on schedule, and ensure they provide useful information once they're in space. SpaceX, on the other hand, is a vertically integrated company. It designs, builds, and launches its own Starlink and Starshield satellites. The only major components of SpaceX's spy constellation for the NRO that the company doesn't build in-house are the surveillance sensors, which come from Northrop Grumman. Buying a service from SpaceX might save money and reduce the chances of further delays. But lawmakers argued there's a risk in relying on a single company for something that could make or break real-time battlefield operations. Sen. Chris Coons (D-Del.), ranking member of the Senate Appropriations Subcommittee on Defense, raised concerns that the Space Force is canceling a program with \"robust competition and open standards\" and replacing it with a network that is \"sole-sourced to SpaceX.\" \"This is a massive and important contract,\" Coons said. \"Doesn't handing this to SpaceX make us dependent on their proprietary technology and avoid the very positive benefits of competition and open architecture?\" Later in the hearing, Sen. John Hoeven (R-N.D.) chimed in with his own warning about the Space Force's dependence on contractors. Hoeven's state is home to one of the SDA's satellite control centers. \"We depend on the Air Force, the Space Force, the Department of Defense, and the other services, and we can’t be dependent on private enterprise when it comes to fighting a war, right? Would you agree with that?\" Hoeven asked Saltzman. \"Absolutely, we can’t be dependent on it,\" Saltzman replied. Air Force Secretary Troy Meink said military officials haven't settled on a procurement strategy. He didn't mention SpaceX by name. As we go forward, MILNET, the term, should not be taken as just a system,\" Meink said. \"How we field that going forward into the future is something that’s still under consideration, and we will look at the acquisition of that.\" An Air Force spokesperson confirmed the requirements and architecture for MILNET are still in development, according to Air \u0026 Space Forces Magazine. The spokesperson added that the department is \"investigating\" how to scale MILNET into a \"multi-vendor satellite communication architecture that avoids vendor lock.\" This doesn't sound all that different than the SDA's existing technical approach for data relay, but it shifts more responsibility to commercial companies. While there's still a lot we don't know, contractors with existing mega-constellations would appear to have an advantage in winning big bucks under the Pentagon's new plan. There are other commercial low-Earth orbit constellations coming online, such as Amazon's Project Kuiper broadband network, that could play a part in MILNET. However, if the Space Force is looking for a turnkey commercial solution, Starlink and Starshield are the only options available today, putting SpaceX in a strong position for a massive windfall. Stephen Clark is a space reporter at Ars Technica, covering private space companies and the world’s space agencies. Stephen writes about the nexus of technology, science, policy, and business on and off the planet. 31 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/starshieldterminal1-999x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2103357\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Under this plan, SpaceX\u0026#39;s satellites would play a big role in the Space Force\u0026#39;s kill chain.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eThe Trump administration plans to cancel a fleet of orbiting data relay satellites managed by the Space Development Agency and replace it with a secretive network that, so far, relies primarily on SpaceX\u0026#39;s Starlink Internet constellation, according to budget documents.\u003c/p\u003e\n\u003cp\u003eThe move prompted questions from lawmakers during a Senate hearing on the Space Force\u0026#39;s budget last week. While details of the Pentagon\u0026#39;s plan remain secret, the White House proposal would commit $277 million in funding to kick off a new program called \u0026#34;pLEO SATCOM\u0026#34; or \u0026#34;MILNET.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe funding line for a proliferated low-Earth orbit satellite communications network hasn\u0026#39;t appeared in a Pentagon budget before, but plans for MILNET already exist in a different form. Meanwhile, the \u003ca href=\"https://comptroller.defense.gov/Portals/45/Documents/defbudget/FY2026/FY2026_r1.pdf\"\u003ebudget proposal for fiscal year 2026\u003c/a\u003e would eliminate funding for a new tranche of data relay satellites from the Space Development Agency. The pLEO SATCOM or MILNET program would replace them, providing crucial support for the Trump administration\u0026#39;s proposed Golden Dome missile defense shield.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We have to look at what are the other avenues to deliver potentially a commercial proliferated low-Earth orbit constellation,\u0026#34; Gen. Chance Saltzman, chief of space operations, told senators last week. \u0026#34;So, we are simply looking at alternatives as we look to the future as to what\u0026#39;s the best way to scale this up to the larger requirements for data transport.\u0026#34;\u003c/p\u003e\n\u003ch2\u003eWhat will these satellites do?\u003c/h2\u003e\n\u003cp\u003eFor six years, the Space Development Agency\u0026#39;s core mission has been to provide the military with a more resilient, more capable network of missile tracking and data relay platforms in low-Earth orbit. Those would augment the Pentagon\u0026#39;s legacy fleet of large, billion-dollar missile warning satellites that are parked more than 20,000 miles away in geostationary orbit.\u003c/p\u003e\n\u003cp\u003eThese satellites detect the heat plumes from missile launches—and also large explosions and wildfires—to provide an early warning of an attack. The US Space Force\u0026#39;s early warning satellites were critical in allowing interceptors to take out Iranian ballistic missiles launched toward Israel last month.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eExperts say there are good reasons for the SDA\u0026#39;s efforts. One motivation was the realization over the last decade or so that a handful of expensive spacecraft make attractive targets for an anti-satellite attack. It\u0026#39;s harder for a potential military adversary to go after a fleet of hundreds of smaller satellites. And if they do take out a few of these lower-cost satellites, it\u0026#39;s easier to replace them with little impact on US military operations.\u003c/p\u003e\n\u003cp\u003eMissile-tracking satellites in low-Earth orbit, flying at altitudes of just a few hundred miles, are also closer to the objects they are designed to track, meaning their infrared sensors can detect and locate dimmer heat signatures from smaller projectiles, such as hypersonic missiles.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"1320\" height=\"793\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda.jpg 1320w, https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda-300x180.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda-640x384.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda-768x461.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2023/07/northropsda-980x589.jpg 980w\" sizes=\"auto, (max-width: 1320px) 100vw, 1320px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      The military\u0026#39;s Space Development Agency is in the process of buying, building, and launching a network of hundreds of missile-tracking and communications satellites.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Northrop Grumman\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eBut tracking the missiles isn\u0026#39;t enough. The data must reach the ground in order to be useful. The SDA\u0026#39;s architecture includes a separate fleet of small communications satellites to relay data from the missile tracking network, and potentially surveillance spacecraft tracking other kinds of moving targets, to military forces on land, at sea, or in the air through a series of inter-satellite laser crosslinks.\u003c/p\u003e\n\u003cp\u003eThe military refers to this data relay component as the transport layer. When it was established in the first Trump administration, the SDA set out to deploy tranches of tracking and data transport satellites. Each new tranche would come online every couple of years, allowing the Pentagon to tap into new technologies as fast as industry develops them.\u003c/p\u003e\n\u003cp\u003eThe SDA launched 27 so-called \u0026#34;Tranche 0\u0026#34; satellites in 2023 to demonstrate the concept\u0026#39;s overall viability. The first batch of more than 150 operational SDA satellites, called Tranche 1, is due to begin launching later this year. The SDA plans to begin deploying more than 250 Tranche 2 satellites in 2027. Another set of satellites, Tranche 3, would have followed a couple of years later. Now, the Pentagon seeks to cancel the Tranche 3 transport layer, while retaining the Tranche 3 tracking layer under the umbrella of the Space Development Agency.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\n\u003ch2\u003eOut of the shadows\u003c/h2\u003e\n\u003cp\u003eWhile SpaceX\u0026#39;s role isn\u0026#39;t mentioned explicitly in the Pentagon\u0026#39;s budget documents, the MILNET program is already on the books, and SpaceX is the lead contractor. It has been made public in recent months, after years of secrecy, although many details remain unclear. Managed in a partnership between the Space Force and the National Reconnaissance Office (NRO), MILNET is designed to use military-grade versions of Starlink Internet satellites to create a \u0026#34;hybrid mesh network\u0026#34; the military can rely on for a wide range of applications.\u003c/p\u003e\n\u003cp\u003eThe military version of the Starlink platform is called Starshield. SpaceX has already launched nearly 200 Starshield satellites for the NRO, which uses them for intelligence, surveillance, and reconnaissance missions.\u003c/p\u003e\n\u003cp\u003eAt an industry conference last month, the Space Force commander in charge of operating the military\u0026#39;s communications satellites revealed new information about MILNET, according to a \u003ca href=\"https://breakingdefense.com/2025/06/space-force-is-contracting-with-spacex-for-new-secretive-milnet-satcom-network/\"\u003ereport by Breaking Defense\u003c/a\u003e. The network uses SpaceX-made user terminals with additional encryption to connect with Starshield satellites in orbit.\u003c/p\u003e\n\u003cp\u003eCol. Jeff Weisler, commander of a Space Force unit called Delta 8, said MILNET will comprise some 480 satellites operated by SpaceX but overseen by a military mission director \u0026#34;who communicates to the contracted workforce to execute operations at the timing and tempo of warfighting.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Space Force has separate contracts with SpaceX to use the commercial Starlink service. MILNET\u0026#39;s dedicated constellation of more secure Starshield satellites is separate from Starlink, which now has more 7,000 satellites in space.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We are completely relooking at how we’re going to operate that constellation of capabilities for the joint force, which is going to be significant because we’ve never had a DoD hybrid mesh network at LEO,\u0026#34; Weisler said last month.\u003c/p\u003e\n\u003cp\u003eSo, the Pentagon already relies on SpaceX\u0026#39;s communication services, not to mention the company\u0026#39;s position as the leading launch provider for Space Force and NRO satellites. With MILNET\u0026#39;s new role as a potential replacement for the Space Development Agency\u0026#39;s data relay network, SpaceX\u0026#39;s satellites would become a cog in combat operations.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"1500\" height=\"1060\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009.jpg 1500w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009-640x452.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009-1024x724.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009-768x543.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009-980x693.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2213189009-1440x1018.jpg 1440w\" sizes=\"auto, (max-width: 1500px) 100vw, 1500px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Gen. Chance Saltzman, chief of Space Operations in the US Space Force, looks on before testifying before a House Defense Subcommittee on May 6, 2025.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Brendan Smialowski/AFP via Getty Images\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eThe data transport layer, whether it\u0026#39;s SDA\u0026#39;s architecture or a commercial solution like Starshield, will \u0026#34;underpin\u0026#34; the Pentagon\u0026#39;s planned Golden Dome missile defense system, Saltzman said.\u003c/p\u003e\n\u003cp\u003eBut it\u0026#39;s not just missiles. Data relay satellites in low-Earth orbit will also have a part in the Space Force\u0026#39;s initiatives to develop space-based platforms to track moving targets on the ground and in the air. Eventually, all Space Force satellites could have the ability to plug into MILNET to send their data to the ground.\u003c/p\u003e\n\u003cp\u003eA spokesperson for the Department of the Air Force, which includes the Space Force, \u003ca href=\"https://www.airandspaceforces.com/data-transport-satellites-tranche-3-sda/\"\u003etold Air \u0026amp; Space Forces Magazine\u003c/a\u003e that the pLEO, or MILNET, constellation \u0026#34;will provide global, integrated, and resilient capabilities across the combat power, global mission data transport, and satellite communications mission areas.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThat all adds up to a lot of bits and bytes, and the Space Force\u0026#39;s need for data backhaul is only going to increase, according to Col. Robert Davis, head of the Space Sensing Directorate at Space Systems Command.\u003c/p\u003e\n\u003cp\u003eHe said the SDA\u0026#39;s satellites will use onboard edge processing to create two-dimensional missile track solutions. Eventually, the SDA\u0026#39;s satellites will be capable of 3D data fusion with enough fidelity to generate a full targeting solution that could be transmitted directly to a weapons system for it to take action without needing any additional data processing on the ground.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I think the compute [capability] is there,\u0026#34; Davis said Tuesday at an event hosted by the Mitchell Institute, an aerospace-focused think tank in Washington, DC. \u0026#34;Now, it\u0026#39;s a comm[unication] problem and some other technical integration challenges. But how do I do that 3D fusion on orbit? If I do 3D fusion on orbit, what does that allow me to do? How do I get low-latency comms to the shooter or to a weapon itself that\u0026#39;s in flight? So you can imagine the possibilities there.\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe possibilities include exploiting automation, artificial intelligence, and machine learning to sense, target, and strike an enemy vehicle—a truck, tank, airplane, ship, or missile—nearly instantaneously.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If I\u0026#39;m on the edge doing 3D fusion, I\u0026#39;m less dependent on the ground and I can get around the globe with my mesh network,\u0026#34; Davis said. \u0026#34;There\u0026#39;s inherent resilience in the overall architecture—not just the space architecture, but the overall architecture—if the ground segment or link segment comes under attack.\u0026#34;\u003c/p\u003e\n\n\u003ch2\u003eQuestioning the plan\u003c/h2\u003e\n\u003cp\u003eMilitary officials haven\u0026#39;t disclosed the cost of MILNET, either in its current form or in the future architecture envisioned by the Trump administration. For context, SDA has awarded fixed-price contracts worth more than $5.6 billion for approximately 340 data relay satellites in Tranches 1 and 2.\u003c/p\u003e\n\u003cp\u003eThat comes out to roughly $16 million per spacecraft, at least an order of magnitude more expensive than a Starlink satellite coming off of SpaceX\u0026#39;s assembly line. Starshield satellites, with their secure communications capability, are presumably somewhat more expensive than an off-the-shelf Starlink.\u003c/p\u003e\n\u003cp\u003eSome former defense officials and lawmakers are uncomfortable with putting commercially operated satellites in the \u0026#34;kill chain,\u0026#34; the term military officials use for the process of identifying threats, making a targeting decision, and taking military action.\u003c/p\u003e\n\u003cp\u003eIt isn\u0026#39;t clear yet whether SpaceX will operate the MILNET satellites in this new paradigm, but the company has a longstanding preference for doing so. SpaceX built a handful of tech demo satellites for the Space Development Agency a few years ago, but didn\u0026#39;t compete for subsequent SDA contracts. One reason for this, sources told Ars, is that the SDA operates its satellite constellation from government-run control centers.\u003c/p\u003e\n\u003cp\u003eInstead, the SDA chose L3Harris, Lockheed Martin, Northrop Grumman, Rocket Lab, Sierra Space, Terran Orbital, and York Space Systems to provide the next batches of missile tracking and data transport satellites. RTX, formerly known as Raytheon, withdrew from a contract after the company determined it couldn\u0026#39;t make money on the program.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003eThe tracking satellites will carry different types of infrared sensors, some with wide fields of view to detect missile launches as they happen, and others with narrow-angle sensors to maintain custody of projectiles in flight. The data relay satellites will employ different frequencies and anti-jam waveforms to supply encrypted data to military forces on the ground.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cp\u003e\u003cimg width=\"1800\" height=\"1017\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks.jpg\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks.jpg 1800w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-300x170.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-640x362.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-768x434.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-1536x868.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-384x216.jpg 384w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-980x554.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2024/11/f9_starlinks-1440x814.jpg 1440w\" sizes=\"auto, (max-width: 1800px) 100vw, 1800px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      This frame from a SpaceX video shows a stack of Starlink Internet satellites attached to the upper stage of a Falcon 9 rocket, moments after the launcher\u0026#39;s payload fairing is jettisoned.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          SpaceX\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eThe Space Development Agency\u0026#39;s path hasn\u0026#39;t been free of problems. The companies the agency selected to build its spacecraft have faced delays, largely due to supply chain issues, and some government officials have worried the Army, Navy, Air Force, and Marine Corps aren\u0026#39;t ready to fully capitalize on the information streaming down from the SDA\u0026#39;s satellites.\u003c/p\u003e\n\u003cp\u003eThe SDA hired SAIC, a government services firm, earlier this year with a $55 million deal to act as a program integrator with responsibility to bring together satellites from multiple contractors, keep them on schedule, and ensure they provide useful information once they\u0026#39;re in space.\u003c/p\u003e\n\u003cp\u003eSpaceX, on the other hand, is a vertically integrated company. It designs, builds, and launches its own Starlink and Starshield satellites. The only major components of SpaceX\u0026#39;s spy constellation for the NRO that the company doesn\u0026#39;t build in-house are the surveillance sensors, which come from Northrop Grumman.\u003c/p\u003e\n\u003cp\u003eBuying a service from SpaceX might \u003ca href=\"https://arstechnica.com/space/2025/05/space-force-official-commercial-satellites-can-do-a-lot-more-than-we-thought/\"\u003esave money and reduce the chances of further delays\u003c/a\u003e. But lawmakers argued there\u0026#39;s a risk in relying on a single company for something that could make or break real-time battlefield operations.\u003c/p\u003e\n\u003cp\u003eSen. Chris Coons (D-Del.), ranking member of the Senate Appropriations Subcommittee on Defense, raised concerns that the Space Force is canceling a program with \u0026#34;robust competition and open standards\u0026#34; and replacing it with a network that is \u0026#34;sole-sourced to SpaceX.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a massive and important contract,\u0026#34; Coons said. \u0026#34;Doesn\u0026#39;t handing this to SpaceX make us dependent on their proprietary technology and avoid the very positive benefits of competition and open architecture?\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eLater in the hearing, Sen. John Hoeven (R-N.D.) chimed in with his own warning about the Space Force\u0026#39;s dependence on contractors. Hoeven\u0026#39;s state is home to one of the SDA\u0026#39;s satellite control centers.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We depend on the Air Force, the Space Force, the Department of Defense, and the other services, and we can’t be dependent on private enterprise when it comes to fighting a war, right? Would you agree with that?\u0026#34; Hoeven asked Saltzman.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Absolutely, we can’t be dependent on it,\u0026#34; Saltzman replied.\u003c/p\u003e\n\u003cp\u003eAir Force Secretary Troy Meink said military officials haven\u0026#39;t settled on a procurement strategy. He didn\u0026#39;t mention SpaceX by name.\u003c/p\u003e\n\u003cp\u003eAs we go forward, MILNET, the term, should not be taken as just a system,\u0026#34; Meink said. \u0026#34;How we field that going forward into the future is something that’s still under consideration, and we will look at the acquisition of that.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAn Air Force spokesperson confirmed the requirements and architecture for MILNET are still in development, according to Air \u0026amp; Space Forces Magazine. The spokesperson added that the department is \u0026#34;investigating\u0026#34; how to scale MILNET into a \u0026#34;multi-vendor satellite communication architecture that avoids vendor lock.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis doesn\u0026#39;t sound all that different than the SDA\u0026#39;s existing technical approach for data relay, but it shifts more responsibility to commercial companies. While there\u0026#39;s still a lot we don\u0026#39;t know, contractors with existing mega-constellations would appear to have an advantage in winning big bucks under the Pentagon\u0026#39;s new plan.\u003c/p\u003e\n\u003cp\u003eThere are other commercial low-Earth orbit constellations coming online, such as Amazon\u0026#39;s Project Kuiper broadband network, that could play a part in MILNET. However, if the Space Force is looking for a turnkey commercial solution, Starlink and Starshield are the only options available today, putting SpaceX in a strong position for a massive windfall.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/stephenclark/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/clarkstephenheadshot-md.jpg\" alt=\"Photo of Stephen Clark\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Stephen Clark is a space reporter at Ars Technica, covering private space companies and the world’s space agencies. Stephen writes about the nexus of technology, science, policy, and business on and off the planet.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/space/2025/07/pentagon-may-put-spacex-at-the-center-of-a-sensor-to-shooter-targeting-network/#comments\" title=\"31 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    31 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/ai/2025/06/half-a-million-spotify-users-are-unknowingly-grooving-to-an-ai-generated-band/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/spotify-headphones-768x432.jpg\" alt=\"Listing image for first story in Most Read: Half a million Spotify users are unknowingly grooving to an AI-generated band\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2025-07-01T21:51:52Z",
  "modifiedTime": "2025-07-01T21:51:52Z"
}
