{
  "id": "35c37ce6-49d8-49e3-8355-51a5d9402e9c",
  "title": "What the Post-Credit Scenes for 'Superman' Mean for the Future of DC's Cinematic Universe",
  "link": "https://www.cnet.com/tech/services-and-software/what-the-post-credit-scenes-for-superman-mean-for-the-future-of-dcs-cinematic-universe/#ftag=CAD590a51e",
  "description": "Don't miss the scenes at the end of the superhero movie for clues to what's coming next.",
  "author": "Meara Isenberg",
  "published": "Tue, 15 Jul 2025 22:45:03 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Meara Isenberg, Aaron Pruner",
  "length": 6456,
  "excerpt": "Don't miss the scenes at the end of the superhero movie for clues to what's coming next.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Don't miss the scenes at the end of the superhero movie for clues to what's coming next. Meara covers streaming service news for CNET. She graduated from the University of Texas at Austin with a degree in journalism. When she's not writing, she likes to dote over her cat, sip black coffee and try out new horror movies. Aaron Pruner Writer Aaron covers what's exciting and new in the world of home entertainment and streaming TV. Previously, he wrote about entertainment for places like Rotten Tomatoes, Inverse, TheWrap and The Hollywood Reporter. Aaron is also an actor and stay-at-home dad, which means coffee is his friend. It's official -- James Gunn's new Superman movie is officially a blockbuster hit, earning $125 million in the US during its first weekend. If you're a fan of other Gunn movies like Suicide Squad or Guardians of the Galaxy, you'd best grab your tickets for this relaunch of this new DC Universe before they're all sold out.Superman stars Rachel Brosnahan as Lois Lane, Nicholas Hoult as Lex Luthor and David Corenswet as the Man of Steel. The movie isn't an origin story; it picks up when Superman is already well-known (and moments after he loses any fight-winning streak he previously had). I won't provide any more details than that, though.This Superman presents a wholesome hero who inherently believes in humankind. CNET reviewer Aaron Pruner found the film to be \"extremely fun, uplifting and filled with joy.\" The cast also includes Edi Gathegi, Nathan Fillion, Isabela Merced, Anthony Carrigan, Skyler Gisondo, Sara Sampaio and María Gabriela de Faría. Keep reading if you want a spoiler-free answer to your post-credit queries (and then a spoiler-packed explanation of what happens after the movie).Are there post-credits scenes in Superman?James Gunn's film includes two additional scenes after the end of the movie. You should plan to stick around for about 10 minutes to catch both.If you missed the clips or just want all the spoilers, we'll unpack what happened below. Don't read any more unless you want to know what happens in the bonus scenes. While Superman has mid- and post-credits scenes, they're similar to Deadpool and Wolverine's after-credits scene in that they don't provide a big tease of future projects. However, that might not matter to you as the movie devotes plenty of time to characters we'll undoubtedly see down the line. Superman showcases piles of heroes outside of Clark Kent's alter ego, including the Justice Gang: Mister Terrific (Gathegi), Green Lantern (Fillion), Hawkgirl (Merced) and the latest member, Metamorpho (Carrigan). Milly Alcock even briefly appears as Supergirl before the end of the movie. She's the star of the next DC Studios movie, due out in June 2026.The mid-credit scene in Superman is brief and appears slightly more than two minutes after the film ends. The wordless clip captures a sweet moment between Superman and his disobedient pal Krypto the Superdog. Superman, with his back to the camera and arms around Krypto, looks at Earth from the moon. Krypto and Superman have had some rocky interactions, but some moments -- like when Clark wakes up and finds the pooch lying on top of him, and this little interlude -- are just adorable. Warner Bros. PicturesWait seven or so minutes more and you'll catch the post-credits scene, which includes a comedic exchange between Mister Terrific and Superman. During the film, the heroes teamed to reverse damage to Metropolis caused by Lex Luthor and a dimensional rift. The post-credits scene finds them staring at a wonky-looking building after the ordeal. Superman points out that \"it's just a little off,\" causing Terrific to storm off. The ever-humble Superman reflects, \"I can be such a jerk sometimes.\"What do the Superman mid-credit and post-credit scenes mean?That image of Kal-El and Krypto on the moon, aside from being peaceful and cute as all get out, is a reference to one of the Superman comic storylines that informed James Gunn's movie. That visual refers to All-Star Superman No. 6, from Grant Morrison and Frank Quitely. This isn't the only comic book iteration of the Man of Steel that Gunn pays homage to in the movie. That said, production designer Beth Mickle revealed to IGN that it is the movie's \"guiding light.\" From the color palette to the movie's overall vibe, look no further than All-Star Superman.Cut to the movie's end. This post-credits scene finds Superman and Mister Terrific bantering over the state of Metropolis after Mister Terrific saves humanity, thwarting an attempt by Luthor to destroy the world -- and Superman.It's a fun interaction that further colors these characters in Gunn's unique vision of the world. Does this scene set up any bits for the future of the DCU? Not really, at least not specifically. From the opening moments of the movie, it was clear that this was a standalone story for Superman. The post-credits scene gives no hint as to what iconic DC hero or villain will appear in the next project or how it will connect to this one, and that's by design.  Simply put, Gunn is cautious about using a tag at the end of his movies that teases what comes next, until the next script is completely finished. He explained his philosophy to EW, saying this stance is \"somewhat related to my own mistakes in my time with Marvel.\"He points to the tease of Will Poulter's Adam Warlock at the end of Guardians of the Galaxy Vol. 2 as a big reason for this. There was all this setup, which led to fan expectation, that, as he revealed, he \"didn't necessarily plan on.\"Putting the proverbial cart before the horse is no longer a choice Gunn wants to make with his movies. He's the head honcho of DC Studios and has, on more than one occasion, stated no further DC projects will be greenlit until its script is finished. So, throwing in a big tease at the end of Superman, just for the sake of building buzz, was never in the cards. It takes the pressure off, creatively. Back to the sequence between Superman and Terrific. Considering the explanation I just laid out, it's pretty easy to see that Gunn is telling the audience that this DC film universe will be different from what was built before. It's a subversive way for the filmmaker, the new Commander in Chief of the DCU, if you will, to tell the audience to buckle up. We don't know where things will go, but by the looks of things, it's sure going to be fun. Other Services \u0026 Software",
  "image": "https://www.cnet.com/a/img/resize/c564213840f42d3ab3c03dc96a7edaea73cb3e79/hub/2025/07/10/5274ac44-4cab-49fe-8c91-b4f4d0aa9e99/rev-1-spmn-cc-trl-0027-high-res-jpeg-1.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e \u003cp\u003e\n    Don\u0026#39;t miss the scenes at the end of the superhero movie for clues to what\u0026#39;s coming next.\n  \u003c/p\u003e \u003cdiv\u003e\u003cdiv data-cy=\"globalAuthorImage\"\u003e\u003cdiv\u003e\u003cpicture\u003e \u003cimg src=\"https://www.cnet.com/a/img/resize/2d0a06ed591bf442237ac30b3f9475c7942adf2e/hub/2021/06/15/8a67f50d-eae8-4cf2-b842-32fe8263f75f/meara-isenberg-headshot.png?auto=webp\u0026amp;fit=crop\u0026amp;height=96\u0026amp;width=96\" alt=\"Headshot of Meara Isenberg\" height=\"96\" width=\"96\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cdiv section=\"authorCard\" id=\"author-card-0\"\u003e \u003cp\u003eMeara covers streaming service news for CNET. She graduated from the University of Texas at Austin with a degree in journalism. When she\u0026#39;s not writing, she likes to dote over her cat, sip black coffee and try out new horror movies.\u003c/p\u003e   \u003c/div\u003e\u003c/div\u003e\u003cdiv data-cy=\"globalAuthorImage\"\u003e\u003cdiv\u003e\u003cpicture\u003e \u003cimg src=\"https://www.cnet.com/a/img/resize/ed813e6994fdcc7d4700ce7bc42b82d8e2a15169/hub/2025/06/04/f63c774e-0177-4822-b088-4636d5d5376d/img-3873-cropped.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=96\u0026amp;width=96\" alt=\"Headshot of Aaron Pruner\" height=\"96\" width=\"96\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cdiv section=\"authorCard\" id=\"author-card-1\"\u003e\u003cdiv\u003e\u003cdiv section=\"author_headshot\"\u003e\u003cpicture\u003e \u003cimg src=\"https://www.cnet.com/a/img/resize/c9ac11d127db1394ec3294c2033c99e5d6e8794c/hub/2025/06/04/f63c774e-0177-4822-b088-4636d5d5376d/img-3873-cropped.jpg?auto=webp\u0026amp;fit=crop\u0026amp;height=84\u0026amp;width=84\" alt=\"Headshot of Aaron Pruner\" height=\"84\" width=\"84\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cp\u003e\u003cspan\u003eAaron Pruner\u003c/span\u003e \u003cspan\u003eWriter\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e \u003cp\u003eAaron covers what\u0026#39;s exciting and new in the world of home entertainment and streaming TV. Previously, he wrote about entertainment for places like Rotten Tomatoes, Inverse, TheWrap and The Hollywood Reporter. Aaron is also an actor and stay-at-home dad, which means coffee is his friend.\u003c/p\u003e   \u003c/div\u003e\u003c/div\u003e \u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"article-8c4ae4ba-a8bb-4316-a854-ce4decf817bd\"\u003e \u003cdiv\u003e\u003carticle\u003e\u003cp\u003eIt\u0026#39;s official -- James Gunn\u0026#39;s new \u003ca href=\"https://www.cnet.com/tech/services-and-software/james-gunns-superman-trailer-pits-the-son-of-krypton-against-lex-luthor/\" target=\"_self\"\u003eSuperman movie\u003c/a\u003e is officially a blockbuster hit, earning \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/superman-box-office-opening-1236312672/\" target=\"_self\"\u003e$125 million\u003c/a\u003e in the US during its first weekend. If you\u0026#39;re a fan of other Gunn movies like Suicide Squad or Guardians of the Galaxy, you\u0026#39;d best grab your tickets for this relaunch of this \u003ca href=\"https://www.cnet.com/culture/entertainment/james-gunn-is-taking-charge-of-dc-movies/\" target=\"_self\"\u003enew DC Universe\u003c/a\u003e before they\u0026#39;re all sold out.\u003c/p\u003e\u003cp\u003eSuperman stars Rachel Brosnahan as Lois Lane, Nicholas Hoult as Lex Luthor and David Corenswet as the Man of Steel. The movie isn\u0026#39;t an origin story; it picks up when Superman is already well-known (and moments after he loses any fight-winning streak he previously had). I won\u0026#39;t provide any more details than that, though.\u003c/p\u003e\u003cp\u003eThis Superman presents a wholesome hero who inherently believes in humankind. CNET reviewer Aaron Pruner found the film to be \u0026#34;\u003ca href=\"https://www.cnet.com/tech/services-and-software/james-gunns-superman-review-it-isnt-a-comic-book-movie-its-a-punk-rock-victory-lap/\" target=\"_self\"\u003eextremely fun, uplifting and filled with joy\u003c/a\u003e.\u0026#34; The cast also includes Edi Gathegi, Nathan Fillion, Isabela Merced, Anthony Carrigan, Skyler Gisondo, Sara Sampaio and María Gabriela de Faría. Keep reading if you want a spoiler-free answer to your post-credit queries (and then a spoiler-packed explanation of what happens after the movie).\u003c/p\u003e\u003ch2\u003eAre there post-credits scenes in Superman?\u003c/h2\u003e\u003cp\u003eJames Gunn\u0026#39;s film includes \u003cstrong\u003etwo additional scenes\u003c/strong\u003e after the end of the movie. You should plan to stick around for about 10 minutes to catch both.\u003c/p\u003e\u003cp\u003eIf you missed the clips or just want all the spoilers, we\u0026#39;ll unpack what happened below. \u003cstrong\u003eDon\u0026#39;t read any more\u003c/strong\u003e unless you want to know what happens in the bonus scenes.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/2dbcf6a1877a5cf81a68b9365ee5d1ca34a5098d/hub/2017/10/17/371c7e5e-7934-4f36-ba03-850014a868ac/spoiler-warning.jpg?auto=webp\u0026amp;width=768\" alt=\"spoiler alert\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/de0cfe05bee60d7cc1afa25fa16cf1388a9710c4/hub/2017/10/17/371c7e5e-7934-4f36-ba03-850014a868ac/spoiler-warning.jpg?auto=webp\u0026amp;width=1024\" alt=\"spoiler alert\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/58aab0f0e99276c2b7b52179e42387f8dd8593ba/hub/2017/10/17/371c7e5e-7934-4f36-ba03-850014a868ac/spoiler-warning.jpg?auto=webp\u0026amp;width=1200\" alt=\"spoiler alert\"/\u003e \u003cimg src=\"\" alt=\"spoiler alert\" height=\"128.0295047418335\" width=\"1200\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003c/figure\u003e\u003cp\u003eWhile Superman has mid- and post-credits scenes, they\u0026#39;re similar to \u003ca href=\"https://www.cnet.com/tech/services-and-software/deadpool-wolverine-does-it-have-a-post-credits-scene/\" target=\"_self\"\u003eDeadpool and Wolverine\u0026#39;s after-credits scene\u003c/a\u003e in that they don\u0026#39;t provide a big tease of future projects. However, that might not matter to you as the movie devotes plenty of time to characters we\u0026#39;ll undoubtedly see down the line. Superman showcases piles of heroes outside of Clark Kent\u0026#39;s alter ego, including the Justice Gang: Mister Terrific (Gathegi), Green Lantern (Fillion), Hawkgirl (Merced) and the latest member, Metamorpho (Carrigan). \u003c/p\u003e\u003cp\u003eMilly Alcock even briefly appears as Supergirl before the end of the movie. She\u0026#39;s the star of the next DC Studios movie, \u003ca href=\"https://variety.com/2024/film/news/supergirl-release-date-1235894795/\" target=\"_self\"\u003edue out in June 2026\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe mid-credit scene in Superman is brief and appears slightly more than two minutes after the film ends. The wordless clip captures a sweet moment between Superman and his disobedient pal Krypto the Superdog. Superman, with his back to the camera and arms around Krypto, looks at Earth from the moon. Krypto and Superman have had some rocky interactions, but some moments -- like when Clark wakes up and finds the pooch lying on top of him, and this little interlude -- are just adorable.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/88577ab66587ba5c6b9c97e094aa55e50723f830/hub/2025/05/13/b4a128a2-3129-4e84-86e6-c37d15f54c0a/sprman-vert-main-2764x4096-dom.jpg?auto=webp\u0026amp;width=768\" alt=\"Superman 2025\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/3b089bc08f3fd5a14dbc18e7f7451252496ef856/hub/2025/05/13/b4a128a2-3129-4e84-86e6-c37d15f54c0a/sprman-vert-main-2764x4096-dom.jpg?auto=webp\u0026amp;width=1024\" alt=\"Superman 2025\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/c450bc934e683d8adccb761b11c3d48d5214ea17/hub/2025/05/13/b4a128a2-3129-4e84-86e6-c37d15f54c0a/sprman-vert-main-2764x4096-dom.jpg?auto=webp\u0026amp;width=1200\" alt=\"Superman 2025\"/\u003e \u003cimg src=\"\" alt=\"Superman 2025\" height=\"675.1940850277264\" width=\"1200\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cfigcaption\u003e \u003cspan\u003eWarner Bros. Pictures\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWait seven or so minutes more and you\u0026#39;ll catch the post-credits scene, which includes a comedic exchange between Mister Terrific and Superman. During the film, the heroes teamed to reverse damage to Metropolis caused by Lex Luthor and a dimensional rift. The post-credits scene finds them staring at a wonky-looking building after the ordeal. Superman points out that \u0026#34;it\u0026#39;s just a little off,\u0026#34; causing Terrific to storm off. The ever-humble Superman reflects, \u0026#34;I can be such a jerk sometimes.\u0026#34;\u003c/p\u003e\u003ch2\u003eWhat do the Superman mid-credit and post-credit scenes mean?\u003c/h2\u003e\u003cp\u003eThat image of Kal-El and Krypto on the moon, aside from being peaceful and cute as all get out, is a reference to one of the Superman comic storylines that informed James Gunn\u0026#39;s movie. \u003ca href=\"https://www.reddit.com/r/superman/comments/ghor8y/clark_and_krypto_sitting_on_the_moon_from_all/#link={%22linkText%22:%22All-Star Superman No. 6%22,%22target%22:%22_blank%22,%22href%22:%22https://www.reddit.com/r/superman/comments/ghor8y/clark_and_krypto_sitting_on_the_moon_from_all/%22,%22role%22:%22standard%22,%22absolute%22:%22%22}\" target=\"_self\"\u003eThat visual refers to All-Star Superman No. 6\u003c/a\u003e, from Grant Morrison and Frank Quitely. This isn\u0026#39;t the only comic book iteration of the Man of Steel that Gunn pays homage to in the movie. \u003c/p\u003e\u003cp\u003eThat said, production designer Beth Mickle revealed \u003ca href=\"https://www.ign.com/articles/why-all-star-superman-was-a-massive-influence-on-james-gunns-movie\" target=\"_self\"\u003eto IGN\u003c/a\u003e that it is the movie\u0026#39;s \u0026#34;guiding light.\u0026#34; From the color palette to the movie\u0026#39;s overall vibe, look no further than All-Star Superman.\u003c/p\u003e\u003cp\u003eCut to the movie\u0026#39;s end. This post-credits scene finds Superman and Mister Terrific bantering over the state of Metropolis after Mister Terrific saves humanity, thwarting an attempt by Luthor to destroy the world -- and Superman.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s a fun interaction that further colors these characters in Gunn\u0026#39;s unique vision of the world. Does this scene set up any bits for the future of the DCU? Not really, at least not specifically. \u003c/p\u003e\u003cp\u003eFrom the opening moments of the movie, it was clear that this was a standalone story for Superman. The post-credits scene gives no hint as to what iconic DC hero or villain will appear in the next project or how it will connect to this one, and that\u0026#39;s by design.  \u003c/p\u003e\u003cp\u003eSimply put, Gunn is cautious about using a tag at the end of his movies that teases what comes next, until the next script is completely finished. He explained his philosophy to \u003ca href=\"https://ew.com/superman-post-credits-scene-confirmed-james-gunn-explains-ethos-exclusive-11750634\" target=\"_self\"\u003eEW\u003c/a\u003e, saying this stance is \u0026#34;somewhat related to my own mistakes in my time with Marvel.\u0026#34;\u003c/p\u003e\u003cp\u003eHe points to the tease of Will Poulter\u0026#39;s Adam Warlock at the end of Guardians of the Galaxy Vol. 2 as a big reason for this. There was all this setup, which led to fan expectation, that, as he revealed, he \u0026#34;didn\u0026#39;t necessarily plan on.\u0026#34;\u003c/p\u003e\u003cp\u003ePutting the proverbial cart before the horse is no longer a choice Gunn wants to make with his movies. He\u0026#39;s the head honcho of DC Studios and has, on more than one occasion, stated no further DC projects will be greenlit until its script is finished. So, throwing in a big tease at the end of Superman, just for the sake of building buzz, was never in the cards. It takes the pressure off, creatively. \u003c/p\u003e\u003cp\u003eBack to the sequence between Superman and Terrific. Considering the explanation I just laid out, it\u0026#39;s pretty easy to see that Gunn is telling the audience that this DC film universe will be different from what was built before. \u003c/p\u003e\u003cp\u003eIt\u0026#39;s a subversive way for the filmmaker, the new Commander in Chief of the DCU, if you will, to tell the audience to buckle up. We don\u0026#39;t know where things will go, but by the looks of things, it\u0026#39;s sure going to be fun.\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e \u003cdiv data-cy=\"articleLinkBlock\"\u003e\u003cp\u003e\u003cspan\u003e\n      Other Services \u0026amp; Software\n    \u003c/span\u003e \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-15T22:45:03Z",
  "modifiedTime": null
}
