{
  "id": "375266b4-c38d-4f3c-93e7-62df2bf3595d",
  "title": "YouTube TV, Wiz, and Why Monopolies Buy Innovation",
  "link": "https://stratechery.com/2025/youtube-tv-wiz-and-why-monopolies-buy-innovation/",
  "description": "Google could aggregate TV, but it might not have the product capability; that's a convoluted way of explaining why buying Wiz is a good idea",
  "author": "Ben Thompson",
  "published": "Mon, 24 Mar 2025 15:02:47 +0000",
  "source": "http://stratechery.com/feed/",
  "categories": [
    "Articles"
  ],
  "byline": "",
  "length": 18002,
  "excerpt": "Google could aggregate TV, but it might not have the product capability; that’s a convoluted way of explaining why buying Wiz is a good idea",
  "siteName": "Stratechery by Ben Thompson",
  "favicon": "https://i0.wp.com/stratechery.com/wp-content/uploads/2018/03/cropped-android-chrome-512x512-1.png?fit=180%2C180\u0026ssl=1",
  "text": "While “March Madness” refers to the NCAA basketball tournaments, the maddest weekend of all is the first one, when fields of 641 are trimmed down to the Sweet 16; this means there are 16 games a day the first two days, and 8 games a day for the next two. Inevitably this means that multiple games are on at the same time, and Max has a solution for you; from The Streamable: The 2025 NCAA Men’s Basketball Tournament starts today, and just in time, Warner Bros. Discovery has announced the addition of some very modern features for games that stream on its on-demand service Max. Fans can use Max to stream all March Madness games on TNT, TBS, and truTV, and that viewing experience is about to improve in a big way. The new Max feature that fans will likely appreciate most while watching NCAA Men’s Basketball Tournament games is a multiview. This will allow fans to watch up to three games at once, ensuring they never miss a single bucket, block, or steal from the tournament. Except that’s not correct; Warner Bros. Discovery shares the rights to the NCAA Men’s Basketball Tournament with CBS, and there were times over the weekend when there were games on CBS and a Warner Bros. Discovery property — sometimes four at once. That means that Max multiview watchers were in fact missing buckets, blocks, and steals, and likely from the highest profile games, which were more likely to be on the broadcast network. Notice, however, that I specified Max multiview watchers; YouTube TV has offered multiview for the NCAA Tournament since last year. Critically, YouTube TV’s offering includes CBS, and, starting this upcoming weekend, will also let you watch the women’s tournament as well; from Sportico: Generally, events from the same leagues are kept together. On Friday, for instance, men’s and women’s multiviews will be offered separately. If you truly want to watch all of March Madness live, it’ll be time to break out that second screen again. However, in part due to user demand, YouTube TV says mixed gender multiviews will be available starting with the Sweet 16. The job of prioritizing selections has only gotten more complicated as interest in women’s hoops has boomed. Through the first two rounds in 2024, viewership of the women’s tourney was up 108% over the year prior. Though the “March Madness” brand is now used for both men’s and women’s competitions, separate media deals dictate their distribution. CBS and TNT Sports networks split the men’s games, including streaming on March Madness Live apps, while ESPN’s channels host women’s action. Disney+ will also carry the Final Four. Cable providers, then, are required for fans hoping to seamlessly hop back and forth between the two brackets, even as fans shift to a streaming-first future. That last sentence is the key: Warner Bros. Discovery only has access to the games it owns rights to; YouTube TV, by virtue of being a virtual Multichannel Video Programming Distributor (vMVPD), has access to every game that is on cable, which is all of them. That lets the service offer an objectively better multiview experience. YouTube TV’s Virtual Advantage Multiview isn’t a new idea; in 1983 George Schnurle III invented the MultiVision: Mrmazda, CC-SA This image is of the MultiVision 1.1, which took in four composite inputs; the 3.1 model included two built-in tuners — you provided the antenna. The Multivision didn’t provide multiview a la YouTube TV, but rather picture-in-picture, support for which was eventually built into TVs directly. Picture-in-picture, however, assumed that consumers had easy access to TV signals; this was a reasonable assumption when signals came in over-the-air or via basic cable. That changed in the late 1990s with the shift to digital cable, which required a set-top box to decrypt; most TVs only had one, and the picture-in-picture feature faded away. This loss was made up in part by the addition of DVR functionality to most of those set-top boxes; with time-shifting you couldn’t watch two things at once, but you could watch two things that aired at the same time. Cable companies offered DVR functionality in response to the popularity of TiVo; when the first model launched in 1999 it too relied on the relative openness of TV signals. Later models needed cable cards, which were mandated by the FCC in 2007; that mandate was repealed in 2020, as the good-enough nature of cable set-top boxes effectively killed the market for TiVo and other 3rd-party tuners. The first vMVPD, meanwhile, was Sling TV, which launched in 2015.2 YouTube TV launched two years later, with an old Google trick: unlimited storage for your cloud DVR, which you could watch anywhere in the U.S. on any device. That was possible because the point of integration for YouTube TV, unlike traditional cable, was on Google’s servers, not a set-top box (which itself was a manifestation of traditional MVPD’s point of integration being the cable into your house). This point of integration also explains why it was YouTube TV that came up with the modern implementation of multiview: Google could create this new feature centrally and make it available to everyone without needing to install high-powered set-top boxes in people’s homes. Indeed, this explains one of the shortcomings of multiview: because Google can not rely on viewers having high powered devices capable of showing four independent video streams, Google actually pre-mixes the streams into a single video feed on their servers. YouTube TV + NFL Sunday Ticket I mentioned above that YouTube TV offered multiview for March Madness starting last year, but that’s not quite right: a subset of the consumer base actually got access for March Madness in 2023; that was a beta test for the real launch, which was the 2023 NFL season. That was the first year that Google had the rights to NFL Sunday Ticket, which lets subscribers view out-of-market games. NFL Sunday Ticket was a prerequisite for multiview, because without it you would have access to at most two football games at a time; once you could watch all of the games, the utility was obvious. The point of this Article is not multiview; it’s a niche use case for events like March Madness or football fanatics on Sunday afternoons. What is notable about the latter example, however, is that Google needed to first secure the rights to NFL Sunday Ticket. This, unlike March Madness, wasn’t a situation where every game was already on cable, and thus accessible to YouTube TV; Google needed to pay $2 billion/year to secure the necessary rights to make multiview work. That’s a high price, even if multiview is cool; it seems unlikely that Google will ever make its money back directly. That, though, is often the case with the NFL. Back in 1993 Rupert Murdoch shocked the world by buying NFL broadcasting rights for a then-unprecedented $395 million/year, $100 million/year more than CBS was offering for the same package. Sports Illustrated explained his reasoning: There are skeptics who think that Murdoch will lose his custom-made shirt over the NFL deal; one estimate has him losing $500 million over the next four years. Says Murdoch, “I’ve seen those outrageous numbers. We’ll lose a few million in the first year, but even if it was 40 or 50 million, it would be tax deductible. It was a cheap way of buying a network.” What Murdoch meant was that demand for the NFL — which had already built ESPN — would get Fox into the cities where it didn’t yet exist, and improve its affiliate station’s standing (many of which Murdoch owned) in cities where they were weak and buried on the inferior UHF band. And, of course, that is exactly what happened. NFL Sunday Ticket is not, to be sure, the same as regular NFL rights; it is much more of a niche product with a subscription business model. That, though, is actually a good thing from Google’s perspective: the company’s opportunity is not to build a TV station, but rather a TV Aggregator. YouTube TV’s Aggregation Potential Google announced the NFL deal a month after it launched Primetime Channels, a marketplace for streaming services along the lines of Amazon’s Prime Video Channels or Apple TV Channels; I wrote in early 2023: The missing piece has been — in contrast to Apple and Amazon in particular — other streaming services. Primetime Channels, though, is clearly an attempt to build up YouTube’s own alternative to the Apple TV App Store or Amazon Prime Video Marketplace. This, as I noted last month, is why I think YouTube’s extravagant investment in NFL Sunday Ticket makes sense: it is a statement of intent and commitment that the service wants to use to convince other streaming services to come on board. The idealized future is one where YouTube is the front-door of all video period, whether that be streaming, linear, or user-generated. YouTube’s big advantage, as I noted in that Update, is that it has exclusive access to YouTube content; it is the only service that can offer basically anything you might want to watch on TV: YouTube TV has linear television, which remains important for sports YouTube proper dominates user-generated content Primetime Channels is a way to bring other streaming services on board The real potential with streaming channels, however, is to go beyond selling subscriptions on an ad-hoc basis and actually integrating them into a single interface to drive discoverability and on-demand conversions. How useful would it be to see everything that is on in one place, and be able to either watch with one click, or subscribe with two? This is going to be an increasingly pressing need as sports in particular move to streaming. It used to be that all of the sports you might watch were in a centralized place: the channel guide on your set-top box. Today, however, many sports are buried in apps. Prominent examples include Amazon Thursday Night Football and Peacock’s exclusive NFL playoff games, but as a Wisconsin fan I’ve already experienced the challenge of an increasing number of college basketball games being exclusively streamed on Peacock; the problem is only going to get worse next season when an increasing number of NBA games are on Amazon and Peacock, and when ESPN releases a standalone streaming app with all of its games. The challenge for any one of these services is the same one seen with Max’s multiview offering: any particular streaming service is limited to its own content. Sure, any one of these services could try and build this offering anyways — ESPN is reportedly considering it — but then they run into the problem of not being a platform or marketplace with a massive audience already in place. The reason why that is an essential prerequisite is that executing on this vision will require forming partnerships with all of the various streamers — or at least those with live events like sports. On one hand, of course each individual streamer wants to own the customer relationship; on the other hand, sports rights both cost a lot of money and also lose their value the moment an event happens. That means they are motivated to trade away customer control and a commission for more subscribers, which works to the benefit of whoever can marshal the most demand, and YouTube, thanks primarily to its user-generated content, has the largest audience of all, and thanks to YouTube TV, is the only service that can actually offer everything. Google’s Product Problem Two quick questions for the audience: Did you know that Primetime Channels existed? How do you subscribe to Primetime Channels? The answer to number 2 is convoluted, to say the least; on a PC, you click the hamburger button in the upper left, then click “Your movies \u0026 TV”, then click the “Browse” tab, and there you will finally find Primetime channels; on mobile the “Your movies \u0026 TV” is found by clicking your profile photo on the bottom right. And, once you finally figure this out, you see a pretty pathetic list: As the arrow indicates, there are more options, but the only one of prominence is Paramount+; there is no Disney+, Peacock, Amazon Prime Video, Apple TV+, or Netflix. Netflix’s resistance to being aggregated is long-running; they were the stick in the mud when Apple tried to aggregate streaming a decade ago. The company gets away with it — and are right to resist — because they have the largest user base amongst subscription platforms. The biggest bull case for Netflix is that many of the other streamers throw in the towel and realize they are better off just selling content to Netflix. Disney+ actually could pull off a fair bit of what YouTube is primed to do: no, Disney doesn’t have YouTube’s user-generated content, but the company does have Hulu Live, which gives a potential Aggregation offering access to content still on linear TV. Amazon and Apple are Google’s most obvious competitors when it comes to building an Aggregator for streaming services, and they have the advantage of owning hardware to facilitate transactions. That leaves Peacock, and this is where I hold Google responsible. Peacock has large bills and a relatively small userbase; there is also a Peacock app for both Amazon devices (although you have to subscribe to Peacock directly) and Apple devices (where Apple enforces an in-app subscription offering). If Google is serious about Primetime Channels specifically, and being a streaming and sports Aggregator generally, then it should have Peacock available as an offering. That’s the thing, though: it’s not clear that Google has made any sort of progress in achieving the vision I perceived two years ago in the wake of the launch of Primetime Channels and the NFL Sunday Ticket deal. Yes, YouTube continues to grow, particularly on TVs, and yes, multivision is slowly getting better, but both of those are products of inertia; is Google so arthritic that it can’t make a play to dominate an entertainment industry that is getting religion about the need to acquire and keep customers profitably? That’s exactly why Aggregators gain power over suppliers: they solve their demand problem. And yet Primetime Channels might as well not even exist, given how buried it is, and it might as well be, given that Google hasn’t signed a meaningful new deal since launch. Google’s Wiz Acquisition This is all convoluted way to explain why I approve of Google’s decision to pay $32 billion in cash for Wiz, a cybersecurity firm that has absolutely nothing to do with the future of TV. From Bloomberg: Google parent Alphabet Inc. agreed to acquire cybersecurity firm Wiz Inc. for $32 billion in cash, reaching a deal less than a year after initial negotiations fell apart because the cloud-computing startup wanted to stay independent. Wiz will join the Google Cloud business once the deal closes, the companies said in a statement on Tuesday. The takeover is subject to regulatory approvals and is likely to close next year, they said. The deal, which would be Alphabet’s largest to date, comes after Wiz turned down a $23 billion bid from the internet search leader last year after several months of discussions. At the time, Wiz walked away after deciding it could ultimately be worth more by pursuing an initial public offering company. Concerns about regulatory challenges also influenced the decision. The companies have agreed to a breakup fee of about 10% of the deal value, or $3.2 billion, if the deal doesn’t close, according to a person familiar with the matter. Shares of Alphabet fell nearly 3% in New York on Tuesday. Wiz provides cybersecurity solutions for multi-cloud environments, and is growing fast. This makes it a natural fit for Google Cloud, which is a distant third place to AWS and Microsoft Azure. Google Cloud’s biggest opportunity for growth is to be a service that is used in addition to a large corporation’s existing cloud infrastructure, and Wiz provides both a beachhead into those organizations and also a solution to managing a multi-cloud setup. Google Cloud’s selling point — the reason it might expand beyond a Wiz beachhead — are Google’s AI offerings. Google continues to have excellent AI research and the best AI infrastructure; where the company is struggling is product, particularly in the consumer space, thanks to some combination of fear of disruption and, well, the fact that product capability seems to be the first casualty of a monopoly (Apple’s declining product chops, particularly in software and obviously AI, is another example). The company’s tortoise-like approach to TV lends credence to the latter explanation: Google is in an amazing position in TV, thanks to the long-ago acquisition of YouTube and the launch of YouTube TV, but it has accomplished little since then beyond agreeing to pay the NFL a lot of money. Arguably the ideal solution to this sort of malaise, at least from a shareholder perspective, would be to simply collect monopoly rents and return the money to shareholders at a much higher rate than Google has to date; absent that, buying product innovation seems like the best way to actually accomplish anything. In other words, while I understand the theory of people who think that Google ought to just build Wiz’s functionality instead of paying a huge revenue multiple for a still-unprofitable startup, I think the reality of a company like Google is that said theory would run into the morass that is product development in a monopoly. It simply would not ship, and would suck if it did. Might as well pay up for momentum in a market that has some hope of leveraging the still considerable strengths that exist beneath the flab. Technically 68; there are four games on Tuesday that trim the field to 64 ↩The original Sling TV was a cable card device that allowed you to watch your TV from anywhere in the world; it was massively popular amongst expats here in Taiwan ↩",
  "image": "https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-2.png?fit=1200%2C751\u0026ssl=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\u003cp\u003eWhile “March Madness” refers to the NCAA basketball tournaments, the maddest weekend of all is the first one, when fields of 64\u003csup id=\"rf1-15348\"\u003e\u003ca href=\"#fn1-15348\" title=\"Technically 68; there are four games on Tuesday that trim the field to 64\" rel=\"footnote\"\u003e1\u003c/a\u003e\u003c/sup\u003e are trimmed down to the Sweet 16; this means there are 16 games a day the first two days, and 8 games a day for the next two. Inevitably this means that multiple games are on at the same time, and Max has a solution for you; from \u003ca href=\"https://thestreamable.com/max-multiview-march-madness-2025\"\u003eThe Streamable\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" width=\"1330\" height=\"748\" src=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-3.png?resize=1330%2C748\u0026amp;ssl=1\" alt=\"Max\u0026#39;s March Madness multiview\" srcset=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-3.png?w=1330\u0026amp;ssl=1 1330w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-3.png?resize=300%2C169\u0026amp;ssl=1 300w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-3.png?resize=768%2C432\u0026amp;ssl=1 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe 2025 NCAA Men’s Basketball Tournament starts today, and just in time, Warner Bros. Discovery has announced the addition of some very modern features for games that stream on its on-demand service Max. Fans can use Max to stream all March Madness games on TNT, TBS, and truTV, and that viewing experience is about to improve in a big way.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe new Max feature that fans will likely appreciate most while watching NCAA Men’s Basketball Tournament games is a multiview. This will allow fans to watch up to three games at once, ensuring they never miss a single bucket, block, or steal from the tournament.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eExcept that’s not correct; Warner Bros. Discovery shares the rights to the NCAA Men’s Basketball Tournament with CBS, and there were times over the weekend when there were games on CBS and a Warner Bros. Discovery property — sometimes four at once. That means that Max multiview watchers were in fact missing buckets, blocks, and steals, and likely from the highest profile games, which were more likely to be on the broadcast network.\u003c/p\u003e\n\n\n\n\u003cp\u003eNotice, however, that I specified \u003cem\u003eMax\u003c/em\u003e multiview watchers; YouTube TV has offered multiview for the NCAA Tournament since last year. Critically, YouTube TV’s offering includes CBS, and, starting this upcoming weekend, will also let you watch the women’s tournament as well; from \u003ca href=\"https://www.sportico.com/business/tech/2025/youtube-tv-march-madness-streaming-multiview-mens-womens-1234844217/\"\u003eSportico\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eGenerally, events from the same leagues are kept together. On Friday, for instance, men’s and women’s multiviews will be offered separately. If you truly want to watch all of March Madness live, it’ll be time to break out that second screen again. However, in part due to user demand, YouTube TV says mixed gender multiviews will be available starting with the Sweet 16.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe job of prioritizing selections has only gotten more complicated as interest in women’s hoops has boomed. Through the first two rounds in 2024, viewership of the women’s tourney was up 108% over the year prior. Though the “March Madness” brand is now used for both men’s and women’s competitions, separate media deals dictate their distribution. CBS and TNT Sports networks split the men’s games, including streaming on March Madness Live apps, while ESPN’s channels host women’s action. Disney+ will also carry the Final Four. Cable providers, then, are required for fans hoping to seamlessly hop back and forth between the two brackets, even as fans shift to a streaming-first future.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThat last sentence is the key: Warner Bros. Discovery only has access to the games it owns rights to; YouTube TV, by virtue of being a virtual Multichannel Video Programming Distributor (vMVPD), has access to every game that is on cable, which is all of them. That lets the service offer an objectively better multiview experience.\u003c/p\u003e\n\n\n\n\u003ch3\u003eYouTube TV’s Virtual Advantage\u003c/h3\u003e\n\n\n\n\u003cp\u003eMultiview isn’t a new idea; in 1983 George Schnurle III invented the MultiVision:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ca href=\"https://en.wikipedia.org/wiki/File:Multivision11-1680x1050.jpg\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1330\" height=\"832\" src=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-2.png?resize=1330%2C832\u0026amp;ssl=1\" alt=\"The Multivision 1.1\" srcset=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-2.png?w=1330\u0026amp;ssl=1 1330w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-2.png?resize=300%2C188\u0026amp;ssl=1 300w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-2.png?resize=768%2C480\u0026amp;ssl=1 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eMrmazda, CC-SA\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThis image is of the MultiVision 1.1, which took in four composite inputs; the 3.1 model included two built-in tuners — you provided the antenna. The Multivision didn’t provide multiview a la YouTube TV, but rather picture-in-picture, support for which was eventually built into TVs directly.\u003c/p\u003e\n\n\n\n\u003cp\u003ePicture-in-picture, however, assumed that consumers had easy access to TV signals; this was a reasonable assumption when signals came in over-the-air or via basic cable. That changed in the late 1990s with the shift to digital cable, which required a set-top box to decrypt; most TVs only had one, and the picture-in-picture feature faded away. This loss was made up in part by the addition of DVR functionality to most of those set-top boxes; with time-shifting you couldn’t watch two things at once, but you could watch two things that aired at the same time.\u003c/p\u003e\n\n\n\n\u003cp\u003eCable companies offered DVR functionality in response to the popularity of TiVo; when the first model launched in 1999 it too relied on the relative openness of TV signals. Later models needed cable cards, which were mandated by the FCC in 2007; that mandate was repealed in 2020, as the good-enough nature of cable set-top boxes effectively killed the market for TiVo and other 3rd-party tuners.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe first vMVPD, meanwhile, was Sling TV, \u003ca href=\"https://stratechery.com/2015/daily-update-sling-tv-interview-makes-15-million-rokus-smart-tv-play/\"\u003ewhich launched in 2015\u003c/a\u003e.\u003csup id=\"rf2-15348\"\u003e\u003ca href=\"#fn2-15348\" title=\"The original Sling TV was a cable card device that allowed you to watch your TV from anywhere in the world; it was massively popular amongst expats here in Taiwan\" rel=\"footnote\"\u003e2\u003c/a\u003e\u003c/sup\u003e YouTube TV launched two years later, with an old Google trick: unlimited storage for your cloud DVR, which you could watch anywhere in the U.S. on any device. That was possible because the point of integration for YouTube TV, unlike traditional cable, was on Google’s servers, not a set-top box (which itself was a manifestation of traditional MVPD’s point of integration being the cable into your house).\u003c/p\u003e\n\n\n\n\u003cp\u003eThis point of integration also explains why it was YouTube TV that came up with the modern implementation of multiview: Google could create this new feature centrally and make it available to everyone without needing to install high-powered set-top boxes in people’s homes. Indeed, this explains one of the shortcomings of multiview: because Google can not rely on viewers having high powered devices capable of showing four independent video streams, Google actually pre-mixes the streams into a single video feed on their servers.\u003c/p\u003e\n\n\n\n\u003ch3\u003eYouTube TV + NFL Sunday Ticket\u003c/h3\u003e\n\n\n\n\u003cp\u003eI mentioned above that YouTube TV offered multiview for March Madness starting last year, but that’s not quite right: a subset of the consumer base actually got access for March Madness in 2023; that was a beta test for the real launch, which was the 2023 NFL season. That was the first year that Google had the rights to NFL Sunday Ticket, which lets subscribers view out-of-market games. NFL Sunday Ticket was a prerequisite for multiview, because without it you would have access to at most two football games at a time; once you could watch all of the games, the utility was obvious.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe point of this Article is not multiview; it’s a niche use case for events like March Madness or football fanatics on Sunday afternoons. What is notable about the latter example, however, is that Google needed to first secure the rights to NFL Sunday Ticket. This, unlike March Madness, wasn’t a situation where every game was already on cable, and thus accessible to YouTube TV; Google needed to pay $2 billion/year to secure the necessary rights to make multiview work.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s a high price, even if multiview is cool; it seems unlikely that Google will ever make its money back directly. That, though, is often the case with the NFL. Back in 1993 Rupert Murdoch shocked the world by buying NFL broadcasting rights for a then-unprecedented $395 million/year, $100 million/year more than CBS was offering for the same package. \u003ca href=\"https://web.archive.org/web/20160403093658/https://www.si.com/vault/1993/12/27/130193/out-foxed-rupert-murdochs-upstart-network-snatched-the-nfl-from-cbs-in-a-coup-that-will-change-the-face-of-televised-sports\"\u003eSports Illustrated explained his reasoning\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThere are skeptics who think that Murdoch will lose his custom-made shirt over the NFL deal; one estimate has him losing $500 million over the next four years. Says Murdoch, “I’ve seen those outrageous numbers. We’ll lose a few million in the first year, but even if it was 40 or 50 million, it would be tax deductible. It was a cheap way of buying a network.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWhat Murdoch meant was that demand for the NFL — \u003ca href=\"https://stratechery.com/2023/the-rise-and-fall-of-espns-leverage/\"\u003ewhich had already built ESPN\u003c/a\u003e — would get Fox into the cities where it didn’t yet exist, and improve its affiliate station’s standing (many of which Murdoch owned) in cities where they were weak and buried on the inferior UHF band. And, of course, that is exactly what happened.\u003c/p\u003e\n\n\n\n\u003cp\u003eNFL Sunday Ticket is not, to be sure, the same as regular NFL rights; it is much more of a niche product with a subscription business model. That, though, is actually a good thing from Google’s perspective: the company’s opportunity is not to build a TV station, but rather a TV Aggregator.\u003c/p\u003e\n\n\n\n\u003ch3\u003eYouTube TV’s Aggregation Potential\u003c/h3\u003e\n\n\n\n\u003cp\u003eGoogle announced the NFL deal a month after \u003ca href=\"https://support.google.com/youtube/thread/186700907/%F0%9F%93%BA-youtube-primetime-channels-are-here?hl=en\"\u003eit launched Primetime Channels\u003c/a\u003e, a marketplace for streaming services along the lines of Amazon’s Prime Video Channels or Apple TV Channels; I wrote in \u003ca href=\"https://stratechery.com/2023/google-earnings-youtubes-aggregation-bid-youtube-shorts-monetization/\"\u003eearly 2023\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe missing piece has been — in contrast to Apple and Amazon in particular — other streaming services. Primetime Channels, though, is clearly an attempt to build up YouTube’s own alternative to the Apple TV App Store or Amazon Prime Video Marketplace. This, \u003ca href=\"https://stratechery.com/2022/ftc-fines-epic-netflix-ads-youtube-and-the-nfl/\"\u003eas I noted last month\u003c/a\u003e, is why I think YouTube’s extravagant investment in NFL Sunday Ticket makes sense: it is a statement of intent and commitment that the service wants to use to convince other streaming services to come on board. The idealized future is one where YouTube is the front-door of all video period, whether that be streaming, linear, or user-generated.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eYouTube’s big advantage, as I noted in that Update, is that it has exclusive access to YouTube content; it is the only service that can offer basically anything you might want to watch on TV:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eYouTube TV has linear television, which remains important for sports\u003c/li\u003e\n\n\n\n\u003cli\u003eYouTube proper dominates user-generated content\u003c/li\u003e\n\n\n\n\u003cli\u003ePrimetime Channels is a way to bring other streaming services on board\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThe real potential with streaming channels, however, is to go beyond selling subscriptions on an ad-hoc basis and actually integrating them into a single interface to drive discoverability and on-demand conversions. How useful would it be to see everything that is on in one place, and be able to either watch with one click, or subscribe with two?\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is going to be an increasingly pressing need as sports in particular move to streaming. It used to be that all of the sports you might watch were in a centralized place: the channel guide on your set-top box. Today, however, many sports are buried in apps. Prominent examples include Amazon Thursday Night Football and Peacock’s exclusive NFL playoff games, but as a Wisconsin fan I’ve already experienced the challenge of an increasing number of college basketball games being exclusively streamed on Peacock; the problem is only going to get worse next season when an increasing number of NBA games are on Amazon and Peacock, and when ESPN releases a standalone streaming app with all of its games.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe challenge for any one of these services is the same one seen with Max’s multiview offering: any particular streaming service is limited to its own content. Sure, any one of these services could try and build this offering anyways — \u003ca href=\"https://stratechery.com/2023/an-espn-aggregator-google-magic-eraser-bing-chat-monetization/\"\u003eESPN is reportedly considering it\u003c/a\u003e — but then they run into the problem of not being a platform or marketplace with a massive audience already in place.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe reason why that is an essential prerequisite is that executing on this vision will require forming partnerships with all of the various streamers — or at least those with live events like sports. On one hand, of course each individual streamer wants to own the customer relationship; on the other hand, sports rights both cost a lot of money and also lose their value the moment an event happens. That means they are motivated to trade away customer control and a commission for more subscribers, which works to the benefit of whoever can marshal the most demand, and YouTube, thanks primarily to its user-generated content, has the largest audience of all, and thanks to YouTube TV, is the only service that can actually offer everything.\u003c/p\u003e\n\n\n\n\u003ch3\u003eGoogle’s Product Problem\u003c/h3\u003e\n\n\n\n\u003cp\u003eTwo quick questions for the audience:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eDid you know that Primetime Channels existed?\u003c/li\u003e\n\n\n\n\u003cli\u003eHow do you subscribe to Primetime Channels?\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eThe answer to number 2 is convoluted, to say the least; on a PC, you click the hamburger button in the upper left, then click “Your movies \u0026amp; TV”, then click the “Browse” tab, and there you will finally find Primetime channels; on mobile the “Your movies \u0026amp; TV” is found by clicking your profile photo on the bottom right.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd, once you finally figure this out, you see a pretty pathetic list:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1330\" height=\"276\" src=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-1.png?resize=1330%2C276\u0026amp;ssl=1\" alt=\"YouTube Primetime Channels offerings\" srcset=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-1.png?w=1330\u0026amp;ssl=1 1330w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-1.png?resize=300%2C62\u0026amp;ssl=1 300w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/03/google-youtube-wiz-1.png?resize=768%2C159\u0026amp;ssl=1 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAs the arrow indicates, there are more options, but the only one of prominence is Paramount+; there is no Disney+, Peacock, Amazon Prime Video, Apple TV+, or Netflix.\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eNetflix’s resistance to being aggregated is long-running; they were the stick in the mud when Apple tried to aggregate streaming \u003ca href=\"https://stratechery.com/2016/apple-should-buy-netflix/\"\u003ea decade ago\u003c/a\u003e. The company gets away with it — and are right to resist — because they have the largest user base amongst subscription platforms. The biggest bull case for Netflix is that many of the other streamers throw in the towel and realize they are better off just selling content to Netflix.\u003c/li\u003e\n\n\n\n\u003cli\u003eDisney+ actually could pull off a fair bit of what YouTube is primed to do: no, Disney doesn’t have YouTube’s user-generated content, but the company does have Hulu Live, which gives a potential Aggregation offering access to content still on linear TV.\u003c/li\u003e\n\n\n\n\u003cli\u003eAmazon and Apple are Google’s most obvious competitors when it comes to building an Aggregator for streaming services, and they have the advantage of owning hardware to facilitate transactions.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThat leaves Peacock, and this is where I hold Google responsible. Peacock has large bills and a relatively small userbase; there is also a Peacock app for both Amazon devices (although you have to subscribe to Peacock directly) and Apple devices (where Apple enforces an in-app subscription offering). If Google is serious about Primetime Channels specifically, and being a streaming and sports Aggregator generally, then it should have Peacock available as an offering.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat’s the thing, though: it’s not clear that Google has made any sort of progress in achieving the vision I perceived two years ago in the wake of the launch of Primetime Channels and the NFL Sunday Ticket deal. Yes, YouTube continues to grow, particularly on TVs, and yes, multivision is slowly getting better, but both of those are products of inertia; is Google so arthritic that it can’t make a play to dominate an entertainment industry that is getting religion about the need to acquire and keep customers profitably? That’s exactly why Aggregators gain power over suppliers: they solve their demand problem. And yet Primetime Channels might as well not even exist, given how buried it is, and it might as well be, given that Google hasn’t signed a meaningful new deal since launch.\u003c/p\u003e\n\n\n\n\u003ch3\u003eGoogle’s Wiz Acquisition\u003c/h3\u003e\n\n\n\n\u003cp\u003eThis is all convoluted way to explain why I approve of Google’s decision to pay $32 billion in cash for Wiz, a cybersecurity firm that has absolutely nothing to do with the future of TV. From \u003ca href=\"https://www.bloomberg.com/news/articles/2025-03-18/google-agrees-to-buy-cloud-security-firm-wiz-for-32-billion\"\u003eBloomberg\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eGoogle parent Alphabet Inc. agreed to acquire cybersecurity firm Wiz Inc. for $32 billion in cash, reaching a deal less than a year after initial negotiations fell apart because the cloud-computing startup wanted to stay independent. Wiz will join the Google Cloud business once the deal closes, the companies said in a statement on Tuesday. The takeover is subject to regulatory approvals and is likely to close next year, they said.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe deal, which would be Alphabet’s largest to date, comes after Wiz turned down a $23 billion bid from the internet search leader last year after several months of discussions. At the time, Wiz walked away after deciding it could ultimately be worth more by pursuing an initial public offering company. Concerns about regulatory challenges also influenced the decision. The companies have agreed to a breakup fee of about 10% of the deal value, or $3.2 billion, if the deal doesn’t close, according to a person familiar with the matter. Shares of Alphabet fell nearly 3% in New York on Tuesday.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWiz provides cybersecurity solutions for multi-cloud environments, and is growing fast. This makes it a natural fit for Google Cloud, which is a distant third place to AWS and Microsoft Azure. Google Cloud’s biggest opportunity for growth is to be a service that is used in addition to a large corporation’s existing cloud infrastructure, and Wiz provides both a beachhead into those organizations and also a solution to managing a multi-cloud setup.\u003c/p\u003e\n\n\n\n\u003cp\u003eGoogle Cloud’s selling point — the reason it might expand beyond a Wiz beachhead — are Google’s AI offerings. Google continues to have excellent AI research and \u003ca href=\"https://stratechery.com/2024/gemini-1-5-and-googles-nature/\"\u003ethe best AI infrastructure\u003c/a\u003e; \u003ca href=\"https://stratechery.com/2025/more-chip-curbs-google-llm-status-check/\"\u003ewhere the company is struggling is product\u003c/a\u003e, particularly in the consumer space, thanks to some combination of fear of disruption and, well, the fact that product capability seems to be the first casualty of a monopoly (Apple’s declining product chops, particularly in software and \u003ca href=\"https://stratechery.com/2025/apple-ais-platform-pivot-potential/\"\u003eobviously AI\u003c/a\u003e, is another example).\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company’s tortoise-like approach to TV lends credence to the latter explanation: Google is in an amazing position in TV, thanks to the long-ago acquisition of YouTube and the launch of YouTube TV, but it has accomplished little since then beyond agreeing to pay the NFL a lot of money. Arguably the ideal solution to this sort of malaise, at least from a shareholder perspective, would be to simply collect monopoly rents and return the money to shareholders at a much higher rate than Google has to date; absent that, buying product innovation seems like the best way to actually accomplish anything.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn other words, while I understand the theory of people who think that Google ought to just build Wiz’s functionality instead of paying a huge revenue multiple for a still-unprofitable startup, I think the reality of a company like Google is that said theory would run into the morass that is product development in a monopoly. It simply would not ship, and would suck if it did. Might as well pay up for momentum in a market that has some hope of leveraging the still considerable strengths that exist beneath the flab.\u003c/p\u003e\n\u003chr/\u003e\u003col\u003e\u003cli id=\"fn1-15348\"\u003e\u003cp\u003eTechnically 68; there are four games on Tuesday that trim the field to 64 \u003ca href=\"#rf1-15348\" title=\"Return to footnote 1.\"\u003e↩\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003cli id=\"fn2-15348\"\u003e\u003cp\u003eThe original Sling TV was a cable card device that allowed you to watch your TV from anywhere in the world; it was massively popular amongst expats here in Taiwan \u003ca href=\"#rf2-15348\" title=\"Return to footnote 2.\"\u003e↩\u003c/a\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "19 min read",
  "publishedTime": "2025-03-24T15:02:47Z",
  "modifiedTime": "2025-03-24T16:10:40Z"
}
