{
  "id": "39d058b2-545d-40a9-8a3e-0796266f726f",
  "title": "Trump says he’s open to Musk or Ellison buying TikTok",
  "link": "https://www.theverge.com/2025/1/21/24349011/trump-elon-musk-larry-ellison-oracle-tiktok-ban",
  "description": "",
  "author": "Lauren Feiner",
  "published": "2025-01-21T18:44:24-05:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Lauren Feiner",
  "length": 1889,
  "excerpt": "President Donald Trump said he’s open to billionaire friends Elon Musk or Larry Ellison buying TikTok as part of a joint venture meant to save the app from a ban.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "President Donald Trump says he’d be open to his buddies Elon Musk or Larry Ellison buying TikTok.“Larry, let’s negotiate in front of the media,” Trump said at a press conference with the Oracle co-founder, SoftBank CEO Masa Son, and OpenAI CEO Sam Altman to announce a $500 billion artificial intelligence infrastructure investment. “What I’m thinking about saying to somebody is, buy it, and give half to the United States of America. Half, and we’ll give you the permit. And they’ll have a great partner, the United States.”“Sounds like a good deal to me, Mr. President,” Ellison said.It’s still not entirely clear how all of this would work, or how the US could legally operate a speech platform without violating the First Amendment. But it’s one of the earliest examples of how Silicon Valley’s coziness with Trump could manifest over the next four years. Trump signed an executive order on Monday instructing his administration not to enforce the law on service providers covered by the forced divestiture bill — which include Oracle, Apple, and Google — for 75 days. But legal experts say the action provides hardly any legal cover for those companies to violate federal law and risk $850 billion in penalties. Even so, Oracle has appeared to rely on Trump’s assurances to help TikTok run in the US after the January 19th sale deadline, though the company has not yet commented on it directly. TikTok’s China-based parent company ByteDance still has other offers on the table, including from billionaire Frank McCourt’s Project Liberty and now, apparently, from YouTube creator MrBeast — whose investor group is receiving legal counsel from a team that includes the brother of Trump’s attorney general pick.As he was leaving the briefing, a reporter asked Trump if he has TikTok on his phone. “No, but I think I might put it there,” Trump responded. “I think I’ll get it right now.”",
  "image": "https://cdn.vox-cdn.com/thumbor/6IjoHeLrDij-euj5asjzkzRik9M=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/25406817/STK051_TIKTOK_CVirginia_B.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003ePresident Donald Trump says he’d be open to his buddies Elon Musk or Larry Ellison buying TikTok.\u003c/p\u003e\u003cp\u003e“Larry, let’s negotiate in front of the media,” Trump said at a press conference with the Oracle co-founder, SoftBank CEO Masa Son, and OpenAI CEO Sam Altman to announce \u003ca href=\"https://www.theverge.com/2025/1/21/24348816/openai-softbank-ai-data-center-stargate-project\"\u003ea $500 billion artificial intelligence infrastructure investment\u003c/a\u003e. “What I’m thinking about saying to somebody is, buy it, and give half to the United States of America. Half, and we’ll give you the permit. And they’ll have a great partner, the United States.”\u003c/p\u003e\u003cp\u003e“Sounds like a good deal to me, Mr. President,” Ellison said.\u003c/p\u003e\u003cp\u003eIt’s still not entirely clear how \u003ca href=\"https://www.theverge.com/2025/1/19/24347463/trump-plan-to-save-tiktok-from-ban\"\u003eall of this would work\u003c/a\u003e, or how the US could legally operate a speech platform without violating the First Amendment. But it’s one of the earliest examples of how \u003ca href=\"https://www.theverge.com/2025/1/20/24346317/trump-gangster-tech-regulation-corruption-grift\"\u003eSilicon Valley’s coziness with Trump\u003c/a\u003e could manifest over the next four years. \u003c/p\u003e\u003cp\u003eTrump \u003ca href=\"https://www.theverge.com/2025/1/20/24348213/trump-tiktok-ban-executive-order-sale-delay-china\"\u003esigned an executive order\u003c/a\u003e on Monday instructing his administration not to enforce the law on service providers covered by the forced divestiture bill — which include Oracle, Apple, and Google — for 75 days. But legal experts say the action provides hardly any legal cover for those companies to \u003ca href=\"https://www.theverge.com/2025/1/19/24347325/tiktok-service-providers-penalties-apple-google-orcale-trump\"\u003eviolate federal law and risk $850 billion in penalties\u003c/a\u003e. Even so, Oracle has \u003ca href=\"https://www.theverge.com/2025/1/19/24347280/tiktok-ban-shutdown-ends\"\u003eappeared to rely on Trump’s assurances\u003c/a\u003e to help TikTok run in the US after the January 19th sale deadline, though the company has not yet commented on it directly. \u003c/p\u003e\u003cp\u003eTikTok’s China-based parent company ByteDance still has other offers on the table, including from billionaire Frank McCourt’s Project Liberty and now, apparently, from YouTube creator MrBeast — whose investor group is receiving legal counsel from a \u003ca href=\"https://www.paulhastings.com/news/paul-hastings-advises-investor-group-on-all-cash-bid-for-tiktoks-u-s-operations\"\u003eteam that includes\u003c/a\u003e \u003ca href=\"https://www.bloomberg.com/news/articles/2025-01-21/mrbeast-internet-s-top-creator-joins-new-bid-to-buy-tiktok?srnd=undefined\"\u003ethe brother of Trump’s attorney general pick\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAs he was leaving the briefing, a reporter asked Trump if he has TikTok on his phone. “No, but I think I might put it there,” Trump responded. “I think I’ll get it right now.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-21T23:44:20.792Z",
  "modifiedTime": "2025-01-21T23:44:20.792Z"
}
