{
  "id": "3bac48e8-0270-4aac-92a3-dff2d5c04534",
  "title": "Return of the dire wolf? More like a Colossal case of conservation-washing",
  "link": "https://thenextweb.com/news/return-of-dire-wolf-colossal-case-of-conservation-washing",
  "description": "US biotech startup Colossal Biosciences has resurrected the dire wolf — or at least that’s what the company would like you to believe. Social media is abuzz with viral videos, memes, and images of fluffy white wolf puppies. The Game of Thrones references are — predictably — omnipresent. The news even made it to Time magazine’s latest cover.  But behind the hype lies a dangerous de-extinction delusion that could distract from proven solutions to the biodiversity crisis. The Trump administration is already using Colossal’s claims as an excuse to slash endangered species protections. First, let’s set something straight — Colossal…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Thu, 10 Apr 2025 18:10:45 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Insider",
    "Startups and technology",
    "Sustainability",
    "Next Featured"
  ],
  "byline": "Siôn Geschwindt",
  "length": 4044,
  "excerpt": "While the internet fawns over Colossal's \"de-extinct\" dire wolves, real species are dying out.",
  "siteName": "TNW | Sustainability",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "US biotech startup Colossal Biosciences has resurrected the dire wolf — or at least that’s what the company would like you to believe. Social media is abuzz with viral videos, memes, and images of fluffy white wolf puppies. The Game of Thrones references are — predictably — omnipresent. The news even made it to Time magazine’s latest cover.  But behind the hype lies a dangerous de-extinction delusion that could distract from proven solutions to the biodiversity crisis. The Trump administration is already using Colossal’s claims as an excuse to slash endangered species protections. First, let’s set something straight — Colossal didn’t bring back the dire wolf. It took DNA from ancient dire wolves’ remains and then edited a handful of those genes into the genomes of modern grey wolves to give them larger bodies, broader skulls, and specific coat colours. It’s an impressive feat of tech-wizardry, but these fluffy white cubs are, at best, mutations. The 💜 of EU techThe latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now! George R.R. Martin holds the first new dire wolf born in 10,000 years pic.twitter.com/5JPepJK8k1 — Winter is Coming (@WiCnet) April 8, 2025 Colossal claims it has “successfully restored a once-eradicated species through the science of de-extinction” for the “first time in human history”. That’s factually incorrect, as many scientists have already pointed out. As University of Maine paleoecologist Jacquelyn Gill wrote on Bluesky on Monday, “To see this work being done with such a casual disregard not only for the truth but for life itself is genuinely abhorrent to me.” But Colossal shows no signs of slowing down. Last month, the $10bn company used a similar technique to create a wooly mouse — a rodent genetically engineered to have mammoth-like pelts. In the future, Colossal plans to “resurrect” other extinct creatures, including the dodo, Tasmanian tiger, and the giant mammoth. The company says that these projects serve as proof of concepts for de-extinction technologies, which could aid in bringing back lost species and restoring ecological balance. It’s the flagbearer of a growing de-extinction movement in the US, joined by organisations like Revive \u0026 Restore and Re:Wild. Europe, in contrast, has focused its rewilding efforts more on bringing back existing species, like bison, wolves, and beavers, to regions where they were hunted to extinction.  While genetically engineered “dire wolves” are going viral, the extant Iberian wolf is endangered. Credit: Animal Record/Creative Commons Meanwhile, an emerging cohort of biodiversity-focused startups is tapping tech to restore nature in more sane ways. For instance, Stream Ocean from Switzerland has developed a face recognition technology for fish that helps scientists monitor species numbers. Germany’s Soilytix tracks soil health using environmental DNA, while UK startup Pivotal Earth connects corporate funding to credited conservation projects.   This is where technology can find its use in biodiversity restoration, not in Frankensteinian conservation attempts, which aren’t just over-hyped but present a dangerous distraction from proven measures.  Colossal has broadcast the message that extinction is reversible — but it is not. While the public fawns over adorable mutated “dire wolves” on Instagram, biodiversity loss is snowballing. One million (known) species are threatened with extinction, with extinction rates now occurring up to 1,000 times the rate pre-humans. We need to mobilise resources to protect the species that we still have left, like the Iberian wolf. Once widespread, the canid is now confined to mountainous regions of Portugal and Spain. Only around 2,200 individuals remain.  Humanity’s top priority should be to safeguard existing biodiversity and restore what’s been damaged. Instead of playing God with long-extinct creatures, we must fight for the endangered species we still have left.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F04%2FUntitled-design-11.jpg\u0026signature=f2991c18f2f637757727aafdc7eb1301",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003eUS biotech startup Colossal Biosciences has resurrected the dire wolf — or at least that’s what the company would like you to believe.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSocial media is abuzz with viral videos, memes, and images of fluffy white wolf puppies. The \u003c/span\u003e\u003ci\u003e\u003cspan\u003eGame of Thrones\u003c/span\u003e\u003c/i\u003e\u003cspan\u003e references are — predictably — omnipresent. The news even made it to Time magazine’s \u003c/span\u003e\u003ca href=\"https://x.com/TIME/status/1909228793048277480\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003elatest cover\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eBut behind the hype lies a dangerous de-extinction delusion that could distract from proven solutions to the biodiversity crisis. The Trump administration is already \u003ca href=\"https://www.yahoo.com/news/trump-team-cites-wolf-extinction-170504444.html\" target=\"_blank\" rel=\"nofollow noopener\"\u003eusing Colossal’s claims\u003c/a\u003e as an excuse to slash endangered species protections.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eFirst, let’s set something straight — Colossal didn’t bring back the dire wolf. It took DNA from ancient dire wolves’ remains and then edited a handful of those genes into the genomes of modern grey wolves to give them larger bodies, broader skulls, and specific coat colours. It’s an impressive feat of tech-wizardry, but these fluffy white cubs are, at best, mutations.\u003c/span\u003e\u003c/p\u003e\n\u003cdiv id=\"hs-embed-tnw\"\u003e\u003cp\u003e\u003cimg src=\"https://s3.eu-west-1.amazonaws.com/tnw.events/hardfork-2018/uploads/visuals/tnw-newsletter.png\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe 💜 of EU tech\u003c/p\u003e\u003cp\u003eThe latest rumblings from the EU tech scene, a story from our wise ol\u0026#39; founder Boris, and some questionable AI art. It\u0026#39;s free, every week, in your inbox. Sign up now!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eGeorge R.R. Martin holds the first new dire wolf born in 10,000 years \u003ca href=\"https://t.co/5JPepJK8k1\" target=\"_blank\" rel=\"nofollow noopener\"\u003epic.twitter.com/5JPepJK8k1\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Winter is Coming (@WiCnet) \u003ca href=\"https://twitter.com/WiCnet/status/1909636583742947605?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow noopener\"\u003eApril 8, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003cp\u003e\u003cspan\u003eColossal claims it has “successfully restored a once-eradicated species through the science of de-extinction” for the “first time in human history”. That’s factually incorrect, as many scientists have already pointed out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs University of Maine paleoecologist Jacquelyn Gill wrote on \u003c/span\u003e\u003ca href=\"https://bsky.app/profile/jacquelyngill.bsky.social/post/3lmat3rkswk24\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eBluesky\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e on Monday, “To see this work being done with such a casual disregard not only for the truth but for life itself is genuinely abhorrent to me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBut Colossal shows no signs of slowing down. Last month, the $10bn company used a similar technique to create a wooly mouse — a rodent genetically engineered to have mammoth-like pelts. In the future, Colossal plans to “resurrect” other extinct creatures, including the dodo, Tasmanian tiger, and the giant mammoth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe company says that these projects serve as proof of concepts for de-extinction technologies, which could aid in bringing back lost species and restoring ecological balance. It’s the flagbearer of a growing de-extinction movement in the US, joined by organisations like Revive \u0026amp; Restore and Re:Wild.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEurope, in contrast, has focused its rewilding efforts more on bringing back existing species, like bison, wolves, and beavers, to regions where they were hunted to extinction. \u003c/span\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" alt=\"As Iberian wolf\" width=\"1600\" height=\"1067\" data-src=\"https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2025/04/iberian-wolf.webp\" src=\"https://cdn0.tnwcdn.com/wp-content/blogs.dir/1/files/2025/04/iberian-wolf.webp\"/\u003e\u003cfigcaption\u003eWhile genetically engineered “dire wolves” are going viral, the extant Iberian wolf is endangered. Credit: \u003cspan\u003eAnimal Record/Creative Commons\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eMeanwhile, an emerging cohort of biodiversity-focused \u003ca href=\"https://thenextweb.com/topic/startups\" target=\"_blank\" rel=\"noopener\"\u003estartups\u003c/a\u003e is tapping tech to restore nature in more sane ways. \u003c/span\u003e\u003cspan\u003eFor instance, \u003c/span\u003e\u003cspan\u003eStream Ocean from Switzerland has developed a face recognition technology for fish that helps scientists monitor species numbers. Germany’s Soilytix tracks soil health using environmental DNA, while UK startup Pivotal Earth connects corporate funding to credited conservation projects.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis is where technology can find its use in biodiversity restoration, not in Frankensteinian conservation attempts, which aren’t just over-hyped but present a dangerous distraction from proven measures. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eColossal has broadcast the message that extinction is reversible — but it is not.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWhile the public fawns over adorable mutated “dire wolves” on Instagram, biodiversity loss is snowballing. One million (known) species are \u003c/span\u003e\u003ca href=\"https://www.reuters.com/lifestyle/science/extinction-crisis-puts-1-million-species-brink-2022-12-23/#:~:text=As%20species%20vanish%20at%20a,fuel%20global%20warming%2C%20scientists%20say.\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ethreatened\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e with extinction, with extinction rates now occurring up to \u003c/span\u003e\u003ca href=\"https://conbio.onlinelibrary.wiley.com/doi/abs/10.1111/cobi.12380\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003e1,000 times\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e the rate pre-humans.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWe need to mobilise resources to protect the species that we still have left, like the Iberian wolf. Once widespread, the canid is now confined to mountainous regions of Portugal and Spain. Only around 2,200 individuals remain. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHumanity’s top priority should be to safeguard existing biodiversity and restore what’s been damaged. Instead of playing God with long-extinct creatures, we must fight for the endangered species we still have left.\u003c/span\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-10T18:10:45Z",
  "modifiedTime": "2025-04-11T11:22:34Z"
}
