{
  "id": "3bf709f4-c9fd-4bd5-91b1-85e79bacbd16",
  "title": "Don't Ignore These 10 Wi-Fi Network Security Tips",
  "link": "https://www.cnet.com/home/internet/dont-ignore-these-10-wi-fi-network-security-tips/#ftag=CAD590a51e",
  "description": "We'll show you some easy steps to keep your Wi-Fi network shielded from unwanted eyes.",
  "author": "David Anders",
  "published": "Sat, 04 Jan 2025 00:00:03 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "David Anders",
  "length": 9520,
  "excerpt": "We'll show you some easy steps to keep your Wi-Fi network shielded from unwanted eyes.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "If you're hosting a party and expecting a lot of guests, your priority is probably making sure there's enough food and drink to go around. But have you considered how many unfamiliar devices will be joining your Wi-Fi network? If those devices are infected with malware, or any of your guests unintentionally download a virus while connected to your main network, it could compromise your security.Once someone with ill intent gains access to your network, they could potentially access and control any of your connected devices, install malicious software and spy on sensitive data like credit card numbers and live camera feeds. A secure home network will help reduce the risk of getting hacked and having someone access your sensitive information. It will also keep away unwanted or unauthorized users and devices that would slow down your connection or freeload on the internet service you pay for. Below, you will find 10 simple and quick steps to secure your home network. Some are more effective than others at keeping hackers and freeloaders at bay, but all are useful in their own way.  It's worth noting that nothing can guarantee absolute security from hacking attempts. These tips only make it much harder for anyone to compromise your network and data. (For more Wi-Fi tips, check out how to tell if your internet provider is throttling your Wi-Fi and our tips on how to speed up your Wi-Fi connection).  Tips to secure your Wi-Fi network at homeHere are the basics for protecting your home Wi-Fi network. Keep reading for more information on each below. Place your router in a central location.Create a strong Wi-Fi password and change it often.Change the default router login credentials.Turn on firewall and Wi-Fi encryption.Create a guest network.Use a VPN.Keep your router and devices up to date.Disable remote router access.Verify connected devices.Upgrade to a WPA3 router. 1. Place your router in a central location Strong network security starts with an optimized setup. If possible, place your router near the center of your home. Routers send wireless signals in all directions, so strategically placing your router in a central location will help keep your connection to the confines of your home. As a bonus, it will likely also make for the best connection quality. For example, if you have internet in an apartment where neighbors are immediately to the left and right of you, placing your router next to a shared wall could send a strong and tempting signal their way. A good router can cast signals next door or across the street, even if you aren't in an apartment. Placing your router in a central location reduces how far those signals travel outside your home. CNET recommends the TP-Link Archer AX21, which performed well in terms of speeds and range and featured a low latency when we tested it. 2. Create a strong Wi-Fi password and change it often This should go without saying, but I'm still going to cover it to emphasize its importance: Creating a unique password for your Wi-Fi network is essential to maintaining a secure connection. Avoid easily guessed passwords or phrases, such as someone's name, birthday, phone number or other common information. While simple Wi-Fi passwords are easier to remember, they're also easier for others to guess. You can easily access your router settings to update your Wi-Fi password. Oh and be sure to change your password every six months or so, or whenever you suspect your network security may have been compromised. The more frequently you change your password, the less compromised it will be. Chris Monroe/CNET 3. Change the default router login credentials Along the same lines of password-protecting your Wi-Fi network, you'll also want to keep anyone from being able to directly access your router settings.  To do so, go ahead and change your router's admin name and password. You can log in to your router settings by typing its IP address into the URL bar, but most routers and providers have an app that lets you access the same settings and information. If you're unsure how to determine your IP address, read our guide.Your router login credentials are separate from your Wi-Fi network name and password. If you aren't sure what the default is, you should be able to find it on the bottom of the router. Or, if it's been changed from the default somewhere along the way, here's how to access your router settings to update the username and password. 4. Turn on the firewall and Wi-Fi encryption Most routers have a firewall to prevent outside hacking and Wi-Fi encryption to keep anyone from eavesdropping on the data sent back and forth between your router and connected devices. Both are typically active by default, but you should check to ensure they're enabled in your router settings. Now that you know how to log in to your router settings, check to make sure the firewall and Wi-Fi encryption are enabled. If they're off for whatever reason, turn them on. Your network security will thank you. 5. Create a guest Wi-Fi network Before sharing access to your main home network, consider creating a separate guest network for visitors. I'm not suggesting your guests will attempt anything nefarious with your main Wi-Fi connection, but their devices or anything they download while connected to your network could be infected with malware or viruses that target your network without them knowing it. A guest network is also ideal for your IoT devices, such as Wi-Fi cameras, smart thermostats and smart speakers -- devices that may not hold a lot of sensitive information and are perhaps more easily hackable than a smarter device such as a computer or phone. 6. Use a VPN Getty Images/Viva Tung/CNETThere are a few reasons to use a good VPN, and network security is one of them. A virtual private network hides your IP address and Wi-Fi activity, including browsing data. VPNs are most useful when connected to a public network, but they can still add a level of security and privacy to your home network. Some VPNs are better than others, but like anything, you often get what you pay for. Free VPN services are available, but if you pay a few extra bucks a month, you can get a much more secure service. Other perks of using a VPN are that it can be great for streaming and for online gaming. 7. Keep your router and devices up to date Software updates can be annoying, but they often include security updates. When companies become aware of potential or exposed security vulnerabilities, they release updates and patches to minimize or eliminate the risk. Stay updated on downloading those regularly. Keeping your router and connected devices current with the latest updates will help ensure you have the best protection against known malware and hacking attempts. Set your router to automatically update in the admin settings, if possible, and periodically check to make sure your router is up to date. 8. Disable remote router access Remote router access allows anyone not directly connected to your Wi-Fi network to access the router settings. Unless you need to access your router while away from home (to check or change the configuration of a child's connected device, for example), there should be no reason to have remote access enabled. You can disable remote access under the router's admin settings. Unlike other security measures, disabled remote router access may not be the default. 9. Verify connected devices Frequently inspect the devices connected to your network and verify that you know what they are. If anything on there looks suspicious, disconnect it and change your Wi-Fi password. After changing your password, you'll have to reconnect all your previously connected devices, but any users or devices that are not authorized to use your network will get the boot. Some devices, especially obscure IoT ones, may have odd default names of random numbers and letters you don't immediately recognize. If you encounter something like that when auditing your connected devices, disconnect them. Later on, when you can't start your robot vacuum cleaner from your phone, you'll know that's what it was. 10. Upgrade to a WPA3 router WPA3 is the latest security protocol for routers. All new routers should be equipped with WPA3, so if you buy a new router, there should be nothing to worry about. Many people rent their routers directly from the provider, which may not include the most up-to-date equipment. If your router was made before 2018, you might have a WPA2 device, which lacks the same security protocols as newer WPA3 devices. A quick search of your device's model should tell you when it came out and any specific features, such as whether it has WPA2 or WPA3. If you've got a router with WPA2, call your provider and negotiate for a better, more recent router. Bottom line? Network security is not guaranteed Again, even with the most recent and effective methods of protecting your home network, security will never be 100% certain. As long as there is the internet, hackers and cybercriminals will find ways to exploit it. With the tips above, you can better keep your network secure from anyone trying to use your connection or access your data. For more tips, check out how to find free Wi-Fi anywhere in the world and the ideal location for your router.",
  "image": "https://www.cnet.com/a/img/resize/2b91fb7df1c1771384faa0b3647661d1526f1d4a/hub/2022/03/16/d367595a-b106-4c7c-b302-e302c313e57d/hackers-security-safety-7195.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIf you\u0026#39;re hosting a party and expecting a lot of guests, your priority is probably making sure there\u0026#39;s enough food and drink to go around. But have you considered how many unfamiliar devices will be joining your Wi-Fi network? If those devices are infected with malware, or any of your guests unintentionally download a virus while connected to your main network, it could compromise your security.\u003c/p\u003e\u003cp\u003eOnce someone with ill intent gains access to your network, they could potentially access and control any of your connected devices, install malicious software and spy on sensitive data like credit card numbers and live camera feeds. \u003c/p\u003e\u003cp\u003eA secure home network will help reduce the risk of getting hacked and having someone access your sensitive information. It will also keep away unwanted or unauthorized users and devices that would \u003ca href=\"https://www.cnet.com/home/internet/even-gig-internet-can-only-handle-so-much-this-cut-my-speed-in-half/\" target=\"_self\"\u003eslow down your connection\u003c/a\u003e or freeload on the internet service you pay for.   \u003c/p\u003e\u003cp\u003eBelow, you will find 10 simple and quick steps to secure your home network. Some are more effective than others at keeping hackers and freeloaders at bay, but all are useful in their own way.  \u003c/p\u003e\u003cp\u003eIt\u0026#39;s worth noting that nothing can guarantee absolute security from hacking attempts. These tips only make it much harder for anyone to compromise your network and data. (For more Wi-Fi tips, check out \u003ca href=\"https://www.cnet.com/home/internet/stop-internet-throttling-by-using-a-vpn/\" target=\"_self\"\u003ehow to tell if your internet provider is throttling your Wi-Fi\u003c/a\u003e and our \u003ca href=\"https://www.cnet.com/home/internet/get-faster-wi-fi-4-essential-steps-for-speeding-up-your-internet-connections/\" target=\"_self\"\u003etips on how to speed up your Wi-Fi connection\u003c/a\u003e).  \u003c/p\u003e\u003ch2\u003eTips to secure your Wi-Fi network at home\u003c/h2\u003e\u003cp\u003eHere are the basics for protecting your home Wi-Fi network. Keep reading for more information on each below.     \u003c/p\u003e\u003cul\u003e\u003cli\u003ePlace your router in a central location.\u003c/li\u003e\u003cli\u003eCreate a strong Wi-Fi password and change it often.\u003c/li\u003e\u003cli\u003eChange the default router login credentials.\u003c/li\u003e\u003cli\u003eTurn on firewall and Wi-Fi encryption.\u003c/li\u003e\u003cli\u003eCreate a guest network.\u003c/li\u003e\u003cli\u003eUse a VPN.\u003c/li\u003e\u003cli\u003eKeep your router and devices up to date.\u003c/li\u003e\u003cli\u003eDisable remote router access.\u003c/li\u003e\u003cli\u003eVerify connected devices.\u003c/li\u003e\u003cli\u003eUpgrade to a WPA3 router.\u003c/li\u003e\u003c/ul\u003e\u003ch2\u003e    1. Place your router in a central location \t\t \t\t    \u003c/h2\u003e\u003cp\u003eStrong network security starts with an optimized setup. If possible, place your router near the center of your home. Routers send wireless signals in all directions, so strategically placing your router in a central location will help keep your connection to the confines of your home. As a bonus, it will likely also make for the \u003ca href=\"https://www.cnet.com/home/internet/tips-for-overcoming-internet-outages/\" target=\"_self\"\u003ebest connection quality\u003c/a\u003e.       \u003c/p\u003e\u003cp\u003eFor example, if you have \u003ca href=\"https://www.cnet.com/home/internet/need-internet-for-your-apartment-heres-how-to-get-the-best-service/\" target=\"_self\"\u003einternet in an apartment\u003c/a\u003e where neighbors are immediately to the left and right of you, placing your router next to a shared wall could send a strong and tempting signal their way. A \u003ca href=\"https://www.cnet.com/home/internet/best-wi-fi-router/\" target=\"_self\"\u003egood router\u003c/a\u003e can cast signals next door or across the street, even if you aren\u0026#39;t in an apartment. Placing your router in a central location reduces how far those signals travel outside your home. CNET recommends the TP-Link Archer AX21, which performed well in terms of speeds and range and featured a low latency when we tested it. \u003c/p\u003e\u003ch2\u003e    2. Create a strong Wi-Fi password and change it often \t\t \t\t    \u003c/h2\u003e\u003cp\u003eThis \u003cem\u003eshould\u003c/em\u003e go without saying, but I\u0026#39;m still going to cover it to emphasize its importance: Creating a unique password for your Wi-Fi network is essential to maintaining a secure connection. Avoid easily guessed passwords or phrases, such as someone\u0026#39;s name, birthday, phone number or other common information. While simple Wi-Fi passwords are easier to remember, they\u0026#39;re also easier for others to guess. You can easily \u003ca href=\"https://www.cnet.com/home/internet/yes-you-should-be-changing-your-wi-fi-password-regularly-heres-how-to-do-it/\" target=\"_self\"\u003eaccess your router settings to update your Wi-Fi password\u003c/a\u003e.  \u003c/p\u003e\u003cp\u003eOh and be sure to change your password every six months or so, or whenever you suspect your network security may have been compromised. The more frequently you change your password, the less compromised it will be.\u003c/p\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/cdf6558b29af31cf550c735b0197ae570b18beee/hub/2018/04/20/0e7d00df-d348-4af1-8130-5d3766a09fd6/tp-link-router-9.jpg?auto=webp\u0026amp;width=768\" alt=\"Bottom of a router\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/cdf6558b29af31cf550c735b0197ae570b18beee/hub/2018/04/20/0e7d00df-d348-4af1-8130-5d3766a09fd6/tp-link-router-9.jpg?auto=webp\u0026amp;width=768\" alt=\"Bottom of a router\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/cdf6558b29af31cf550c735b0197ae570b18beee/hub/2018/04/20/0e7d00df-d348-4af1-8130-5d3766a09fd6/tp-link-router-9.jpg?auto=webp\u0026amp;width=768\" alt=\"Bottom of a router\"/\u003e \u003cimg src=\"\" alt=\"Bottom of a router\" height=\"432.0525969756739\" width=\"768\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cfigcaption\u003e \u003cspan\u003eChris Monroe/CNET\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2\u003e    3. Change the default router login credentials \t\t \t\t    \u003c/h2\u003e\u003cp\u003eAlong the same lines of password-protecting your Wi-Fi network, you\u0026#39;ll also want to keep anyone from being able to directly access your router settings.  \u003c/p\u003e\u003cp\u003eTo do so, go ahead and change your router\u0026#39;s admin name and password. You can log in to your router settings by typing its IP address into the URL bar, but most routers and providers have an app that lets you access the same settings and information. \u003ca href=\"https://www.cnet.com/home/internet/how-to-find-your-ip-address/\" target=\"_self\"\u003eIf you\u0026#39;re unsure how to determine your IP address, read our guide.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eYour router login credentials are separate from your Wi-Fi network name and password. If you aren\u0026#39;t sure what the default is, you should be able to find it on the bottom of the router. Or, if it\u0026#39;s been changed from the default somewhere along the way, \u003ca href=\"https://www.cnet.com/home/internet/yes-you-should-be-changing-your-wi-fi-password-regularly-heres-how-to-do-it/\" target=\"_self\"\u003ehere\u0026#39;s how to access your router settings\u003c/a\u003e to update the username and password.       \u003c/p\u003e\u003ch2\u003e    4. Turn on the firewall and Wi-Fi encryption \t\t \t\t    \u003c/h2\u003e\u003cp\u003eMost routers have a firewall to prevent outside hacking and Wi-Fi encryption to keep anyone from eavesdropping on the data sent back and forth between your router and connected devices. Both are typically active by default, but you should check to ensure they\u0026#39;re enabled in your router settings.      \u003c/p\u003e\u003cp\u003eNow that you know how to log in to your router settings, check to make sure the firewall and Wi-Fi encryption are enabled. If they\u0026#39;re off for whatever reason, turn them on. Your network security will thank you.      \u003c/p\u003e\u003ch2\u003e    5. Create a guest Wi-Fi network \t\t \t\t    \u003c/h2\u003e\u003cp\u003eBefore sharing access to your main home network, consider \u003ca href=\"https://www.cnet.com/home/internet/how-to-set-up-guest-wi-fi/\" target=\"_self\"\u003ecreating a separate guest network\u003c/a\u003e for visitors. I\u0026#39;m not suggesting your guests will attempt anything nefarious with your main Wi-Fi connection, but their devices or anything they download while connected to your network could be infected with malware or viruses that target your network without them knowing it.       \u003c/p\u003e\u003cp\u003eA guest network is also ideal for your IoT devices, such as \u003ca href=\"https://www.cnet.com/home/security/best-wireless-home-security-cameras/\" target=\"_self\"\u003eWi-Fi cameras\u003c/a\u003e, \u003ca href=\"https://www.cnet.com/home/energy-and-utilities/best-smart-thermostats/\" target=\"_self\"\u003esmart thermostats\u003c/a\u003e and \u003ca href=\"https://www.cnet.com/home/smart-home/best-smart-speaker/\" target=\"_self\"\u003esmart speakers\u003c/a\u003e -- devices that may not hold a lot of sensitive information and are perhaps more easily hackable than a smarter device such as a computer or phone.      \u003c/p\u003e\u003ch2\u003e    6. Use a VPN \t\t \t\t    \u003c/h2\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/b8e2fb6383ba44688bf0468dd0b644f160d1e046/hub/2024/05/11/dcf2a2b5-3f38-49fe-902d-6d74ee0e1262/vpn-general.jpg?auto=webp\u0026amp;width=768\" alt=\"VPN shield on a purple background with an open lock and glowing checkmark\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/b8e2fb6383ba44688bf0468dd0b644f160d1e046/hub/2024/05/11/dcf2a2b5-3f38-49fe-902d-6d74ee0e1262/vpn-general.jpg?auto=webp\u0026amp;width=768\" alt=\"VPN shield on a purple background with an open lock and glowing checkmark\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/b8e2fb6383ba44688bf0468dd0b644f160d1e046/hub/2024/05/11/dcf2a2b5-3f38-49fe-902d-6d74ee0e1262/vpn-general.jpg?auto=webp\u0026amp;width=768\" alt=\"VPN shield on a purple background with an open lock and glowing checkmark\"/\u003e \u003cimg src=\"\" alt=\"VPN shield on a purple background with an open lock and glowing checkmark\" height=\"432\" width=\"768\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cfigcaption\u003e \u003cspan\u003eGetty Images/Viva Tung/CNET\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThere are a few reasons to use a \u003ca href=\"https://www.cnet.com/tech/services-and-software/best-vpn/\" target=\"_self\"\u003egood VPN\u003c/a\u003e, and network security is one of them. A virtual private network hides your IP address and Wi-Fi activity, including browsing data.       \u003c/p\u003e\u003cp\u003eVPNs are most useful when connected to a public network, but they can still add a level of security and privacy to your home network. Some VPNs are better than others, but like anything, you often get what you pay for. Free VPN services are available, but if you pay a few extra bucks a month, you can get a much more secure service. Other perks of using a VPN are that it can be great for \u003ca href=\"https://www.cnet.com/tech/services-and-software/best-vpn-for-streaming/\" target=\"_self\"\u003estreaming\u003c/a\u003e and for \u003ca href=\"https://www.cnet.com/home/internet/im-an-avid-gamer-so-i-turn-off-my-vpn-when-i-play-online/\" target=\"_self\"\u003eonline gaming\u003c/a\u003e. \u003c/p\u003e\u003ch2\u003e    7. Keep your router and devices up to date \t\t \t\t    \u003c/h2\u003e\u003cp\u003eSoftware updates can be annoying, but they often include security updates. When companies become aware of potential or exposed security vulnerabilities, they release updates and patches to minimize or eliminate the risk. Stay updated on downloading those regularly. \u003c/p\u003e\u003cp\u003eKeeping your router and connected devices current with the latest updates will help ensure you have the best protection against known malware and hacking attempts. Set your router to automatically update in the admin settings, if possible, and periodically check to make sure your router is up to date.      \u003c/p\u003e\u003ch2\u003e    8. Disable remote router access \t\t \t\t    \u003c/h2\u003e\u003cp\u003eRemote router access allows anyone not directly connected to your Wi-Fi network to access the router settings. Unless you need to access your router while away from home (to check or change the configuration of a child\u0026#39;s connected device, for example), there should be no reason to have remote access enabled.       \u003c/p\u003e\u003cp\u003eYou can disable remote access under the router\u0026#39;s admin settings. Unlike other security measures, disabled remote router access may not be the default.      \u003c/p\u003e\u003ch2\u003e    9. Verify connected devices \t\t \t\t    \u003c/h2\u003e\u003cp\u003eFrequently inspect the devices connected to your network and verify that you know what they are. If anything on there looks suspicious, disconnect it and change your Wi-Fi password. After changing your password, you\u0026#39;ll have to reconnect all your previously connected devices, but any users or devices that are not authorized to use your network will get the boot.      \u003c/p\u003e\u003cp\u003eSome devices, especially obscure IoT ones, may have odd default names of random numbers and letters you don\u0026#39;t immediately recognize. If you encounter something like that when auditing your connected devices, disconnect them. Later on, when you can\u0026#39;t start your \u003ca href=\"https://www.cnet.com/home/kitchen-and-household/best-robot-vacuum/\" target=\"_self\"\u003erobot vacuum cleaner\u003c/a\u003e from your phone, you\u0026#39;ll know that\u0026#39;s what it was.      \u003c/p\u003e\u003ch2\u003e    10. Upgrade to a WPA3 router \t\t \t\t    \u003c/h2\u003e\u003cp\u003eWPA3 is the latest security protocol for routers. All new routers should be equipped with WPA3, so if you buy a new router, there should be nothing to worry about. \u003ca href=\"https://www.cnet.com/home/internet/buy-your-own-router-for-an-easy-way-to-save-money-on-your-internet-bill/\" target=\"_self\"\u003eMany people rent their routers directly from the provider\u003c/a\u003e, which may not include the most up-to-date equipment.      \u003c/p\u003e\u003cp\u003eIf your router was made before 2018, you might have a WPA2 device, which lacks the same security protocols as newer WPA3 devices. A quick search of your device\u0026#39;s model should tell you when it came out and any specific features, such as whether it has WPA2 or WPA3. If you\u0026#39;ve got a router with WPA2, \u003ca href=\"https://www.cnet.com/home/internet/negotiating-your-monthly-internet-bill-could-lower-expenses-for-better-deals/\" target=\"_self\"\u003ecall your provider and negotiate\u003c/a\u003e for a better, more recent router.       \u003c/p\u003e\u003ch2\u003e   Bottom line? Network security is not guaranteed      \u003c/h2\u003e\u003cp\u003eAgain, even with the most recent and effective methods of protecting your home network, security will never be 100% certain. As long as there is the internet, hackers and cybercriminals will find ways to exploit it. With the tips above, you can better keep your network secure from anyone trying to use your connection or access your data.      \u003c/p\u003e\u003cp\u003eFor more tips, check out \u003ca href=\"https://www.cnet.com/home/internet/need-to-stay-connected-while-traveling-heres-how-to-find-free-wi-fi/\" target=\"_self\"\u003ehow to find free Wi-Fi anywhere in the world\u003c/a\u003e and \u003ca href=\"https://www.cnet.com/home/internet/home-wi-fi-issues-check-your-router-location/\" target=\"_self\"\u003ethe ideal location for your router\u003c/a\u003e.  \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-04T00:00:03Z",
  "modifiedTime": null
}
