{
  "id": "3c7e0dcc-7a31-4d7f-8417-bf3cb80dea3a",
  "title": "To 'Reclaim Future-Making', Amazon Workers Published a Collection of Science Fiction Stories",
  "link": "https://news.slashdot.org/story/25/04/27/2336243/to-reclaim-future-making-amazon-workers-published-a-collection-of-science-fiction-stories?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Its goal was to \"support workers to reclaim the power of future-making\". A 2022 pilot project saw over 25 Amazon workers meeting online \"to discuss how science fiction shed light on their working conditions and futures.\" 13 of them then continued meeting regularly in 2023 with the \"Worker as Futurist\" project (funded by Canada's Social Sciences and Humanities Research Council, according to an article by the project's leaders in the socialist magazine Jacobin). \"Our team of scholars, teachers, writers, and activists has been able to pay Amazon workers (warehouse workers, drivers, copy editors, MTurk workers, and more) to participate in a series of skill-building writing workshops and information sessions....\" And when it was over, \"the participants were supported to draft the stories they wanted to tell about The World After Amazon....\" Six months ago they held the big launch event for the book's print edition, while also promising that \"you can read the workers' stories online, or download the book as a PDF or an ebook, all for free.\" The Amazon-worker stories have tempting titles like \"The Museum of Prime\", \"The Dark Side of Convenience\", and even \"The Iron Uprising.\" (\"In a dystopian future of corporate power, humans and robots come together in resistance and in love.\") And the project also created a 13-episode podcast offering \"interviews with experts on Amazon, activists and organizers, science fiction writers and others dedicated to reclaiming the future from corporate control.\" As they wrote in Jacbon: This isn't finding individual commercial or literary success, but dignity, imagination, and common struggle... Our \"Worker as Futurist\" project returns the power of the speculative to workers, in the name of discovering something new about capitalism and the struggle for something different... We must envision the futures we want in order to mobilize and fight for them together, rather than cede that future to those who would turn the stars into their own private sandbox... The rank-and-file worker — the target of daily exploitation, forced to build their boss's utopia — may have encrypted within them the key to destroying his world and building a new one. Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2025-04-27T23:38:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "books"
  ],
  "byline": "",
  "length": 2216,
  "excerpt": "Its goal was to \"support workers to reclaim the power of future-making\". A 2022 pilot project saw over 25 Amazon workers meeting online \"to discuss how science fiction shed light on their working conditions and futures.\" 13 of them then continued meeting regularly in 2023 with the \"Worker as Futuri...",
  "siteName": "",
  "favicon": "",
  "text": "Its goal was to \"support workers to reclaim the power of future-making\". A 2022 pilot project saw over 25 Amazon workers meeting online \"to discuss how science fiction shed light on their working conditions and futures.\" 13 of them then continued meeting regularly in 2023 with the \"Worker as Futurist\" project (funded by Canada's Social Sciences and Humanities Research Council, according to an article by the project's leaders in the socialist magazine Jacobin). \"Our team of scholars, teachers, writers, and activists has been able to pay Amazon workers (warehouse workers, drivers, copy editors, MTurk workers, and more) to participate in a series of skill-building writing workshops and information sessions....\" And when it was over, \"the participants were supported to draft the stories they wanted to tell about The World After Amazon....\" Six months ago they held the big launch event for the book's print edition, while also promising that \"you can read the workers' stories online, or download the book as a PDF or an ebook, all for free.\" The Amazon-worker stories have tempting titles like \"The Museum of Prime\", \"The Dark Side of Convenience\", and even \"The Iron Uprising.\" (\"In a dystopian future of corporate power, humans and robots come together in resistance and in love.\") And the project also created a 13-episode podcast offering \"interviews with experts on Amazon, activists and organizers, science fiction writers and others dedicated to reclaiming the future from corporate control.\" As they wrote in Jacbon: This isn't finding individual commercial or literary success, but dignity, imagination, and common struggle... Our \"Worker as Futurist\" project returns the power of the speculative to workers, in the name of discovering something new about capitalism and the struggle for something different... We must envision the futures we want in order to mobilize and fight for them together, rather than cede that future to those who would turn the stars into their own private sandbox... The rank-and-file worker — the target of daily exploitation, forced to build their boss's utopia — may have encrypted within them the key to destroying his world and building a new one.",
  "image": "https://a.fsdn.com/sd/topics/books_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-177180337\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tIts goal was to \u0026#34;\u003ca href=\"https://afteramazon.world/\"\u003esupport workers to reclaim the power of future-making\u003c/a\u003e\u0026#34;.  A 2022 pilot project saw over 25 Amazon workers meeting online \u0026#34;to discuss how science fiction shed light on their working conditions and futures.\u0026#34; 13 of them then continued meeting regularly in 2023 with the \u0026#34;Worker as Futurist\u0026#34; project (funded by Canada\u0026#39;s Social Sciences and Humanities Research Council, according to \u003ca href=\"https://jacobin.com/2023/09/amazon-workers-sci-fi-writing-bezos-imagination-speculative-future\"\u003ean article by the project\u0026#39;s leaders in the socialist magazine \u003cem\u003eJacobin\u003c/em\u003e\u003c/a\u003e).    \u0026#34;Our team of scholars, teachers, writers, and activists has been able to pay Amazon workers (warehouse workers, drivers, copy editors, MTurk workers, and more) to participate in a series of skill-building writing workshops and information sessions....\u0026#34;\u003c/p\u003e\u003cp\u003e \nAnd when it was over, \u0026#34;the participants were supported to draft the stories they wanted to tell about \u003cem\u003eThe World After Amazon\u003c/em\u003e....\u0026#34;\u003c/p\u003e\u003cp\u003e \n\nSix months ago they held the big launch event for the book\u0026#39;s print edition, while also promising that \u0026#34;you can \u003ca href=\"https://afteramazon.world/#read\"\u003eread the workers\u0026#39; stories online\u003c/a\u003e, or download the book as a \u003ca href=\"https://drive.google.com/drive/folders/19eFEhRZiV-8i4czwIr9EW1eh67Gqig3U?usp=sharing\"\u003ePDF\u003c/a\u003e or an \u003ca href=\"https://drive.google.com/drive/folders/19eFEhRZiV-8i4czwIr9EW1eh67Gqig3U?usp=sharing\"\u003eebook\u003c/a\u003e, all for free.\u0026#34;   The Amazon-worker stories have tempting titles like \u0026#34;The Museum of Prime\u0026#34;, \u0026#34;The Dark Side of Convenience\u0026#34;, and even \u0026#34;The Iron Uprising.\u0026#34;  (\u0026#34;In a dystopian future of corporate power, humans and robots come together in resistance and in love.\u0026#34;)\u003c/p\u003e\u003cp\u003e \nAnd the project also created a 13-episode podcast offering \u0026#34;interviews with experts on Amazon, activists and organizers, science fiction writers and others dedicated to reclaiming the future from corporate control.\u0026#34;  As they wrote in \u003cem\u003eJacbon\u003c/em\u003e:\n\n\u003ci\u003e\nThis isn\u0026#39;t finding individual commercial or literary success, but dignity, imagination, and common struggle... Our \u0026#34;Worker as Futurist\u0026#34; project returns the power of the speculative to workers, in the name of discovering something new about capitalism and the struggle for something different...  \u003cp\u003e \n\nWe \u003cem\u003emust\u003c/em\u003e envision the futures we want in order to mobilize and fight for them together, rather than cede that future to those who would turn the stars into their own private sandbox... The rank-and-file worker — the target of daily exploitation, forced to build their boss\u0026#39;s utopia — may have encrypted within them the key to destroying his world and building a new one.\u003c/p\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
