{
  "id": "3c81a8f3-7397-43bd-886c-fe4236f086b8",
  "title": "Discord user data leak resurfaces on hacker forum as third-party service disputes breach",
  "link": "https://mashable.com/article/discord-restorecord-data-breach-leak",
  "description": "Discord users that signed up for a third-party backup service called RestoreCord may have previously had some data leaked in a breach.",
  "author": "",
  "published": "Mon, 03 Feb 2025 21:20:38 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Matt Binder",
  "length": 2957,
  "excerpt": "RestoreCord, a Discord backup service, previously suffered a data breach, but wants to dispel current reports about a new leak.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "UPDATE: Feb. 3, 2025, 3:59 p.m. EST RestoreCord has responded to Mashable regarding the data leak recently posted on the popular hacker forum BreachForums. The story and headline have been updated to reflect the new information. According to the third-party Discord backup service, the breach originally reported today by Leakd is \"not accurate.\" RestoreCord says that there was a \"small incident in November 2023 where a staff member improperly shared a limited number of IP addresses.\" RestoreCord also disputes the severity of one of the datapoints in the leak, saying that the IP addresses in the leak are \"randomly generated IPs rather than actual user information.\"The company also disputes the number of IP addresses that were leaked, saying there were fewer than 5,000 total.In addition, based on this new information, Mashable was able to find that the \"Restorecord 840K Records Database\" file containing the stolen data had been posted on other hacker forums last year.However, the data leak has since resurfaced today on BreachForums, so Discord users previously affected by the breach should remain vigilante.The original article appears below. Mashable Light Speed Nearly one million Discord users just had their account details – including usernames, IP addresses, and Discord IDs – exposed in a hacking forum.However, Discord, the popular chat room service, doesn't appear to have suffered from a data breach directly. Instead, a third-party backup solution known as RestoreCord has been breached.As first noticed by cybersecurity website Leakd, a file containing a massive leak of Discord user data was posted freely on a popular hacking forum called BreachForums. The data, which includes users' Discord IDs, IP addresses, and usernames, was posted by a BreachForums user with the handle \"Sythe.\"RestoreCord is a service used by some Discord users to backup their servers on the platform. RestoreCord says on its website that it is \"the only Discord Bot that you will ever need to protect and recover your server from raids, nukes, and more.\" RestoreCord boasts that it serves 99 million members, including 100,000 paying customers, and backs up 55,000 Discord servers.The FBI seized BreachForums last year after the site became a well-known haven for buying and selling stolen data. However, one of BreachForums' domains popped back up just a few weeks after the May 2024 takedown.BreachForums' founder Conor Fitzpatrick was arrested in 2023 on a range of charges connected to the site. However, Fitzpatrick just recently made news a few weeks ago after a U.S. appeals court overturned the lenient sentence he originally received.It is unclear as of publishing as to how the data was obtained or if there has been any malicious activity connected to what's included in the leak. Mashable has reached out to RestoreCord for more information and will update this piece when we hear back.",
  "image": "https://helios-i.mashable.com/imagery/articles/077ViUpXuRwg864QEh9sgiP/hero-image.fill.size_1200x675.v1738610518.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003e\n   \u003cem\u003e\u003cstrong\u003eUPDATE: Feb. 3, 2025, 3:59 p.m. EST \u003c/strong\u003eRestoreCord has responded to Mashable regarding the data leak recently posted on the popular hacker forum BreachForums. The story and headline have been updated to reflect the new information.\u003c/em\u003e\n\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAccording to the third-party Discord backup service, the breach originally reported today by Leakd is \u0026#34;not accurate.\u0026#34; RestoreCord says that there was a \u0026#34;small incident in November 2023 where a staff member improperly shared a limited number of IP addresses.\u0026#34; RestoreCord also disputes the severity of one of the datapoints in the leak, saying that the IP addresses in the leak are \u0026#34;randomly generated IPs rather than actual user information.\u0026#34;\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe company also disputes the number of IP addresses that were leaked, saying there were fewer than 5,000 total.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eIn addition, based on this new information, Mashable was able to find that the \u0026#34;Restorecord 840K Records Database\u0026#34; file containing the stolen data had been posted on other hacker forums last year.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eHowever, the data leak has since resurfaced today on BreachForums, so Discord users previously affected by the breach should remain vigilante.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe original article appears below.\u003c/em\u003e\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"mashablelightspeed\"\u003e\n        \u003cp\u003e\n            Mashable Light Speed\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003chr/\u003e\u003cp\u003eNearly one million Discord users just had their account details – including usernames, IP addresses, and Discord IDs – exposed in a hacking forum.\u003c/p\u003e\u003cp\u003eHowever, Discord, the popular chat room service, doesn\u0026#39;t appear to have suffered from a data breach directly. Instead, a third-party backup solution known as RestoreCord has been breached.\u003c/p\u003e\u003cp\u003eAs first noticed by cybersecurity website \u003ca href=\"https://leakd.com/leaks/massive-discord-data-breach-nearly-1-million-users-exposed-in-restorecord-leak/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eLeakd\u003c/u\u003e\u003c/a\u003e, a file containing a massive leak of Discord user data was posted freely on a popular hacking forum called BreachForums. The data, which includes users\u0026#39; Discord IDs, IP addresses, and usernames, was posted by a BreachForums user with the handle \u0026#34;Sythe.\u0026#34;\u003c/p\u003e\u003cp\u003eRestoreCord is a service used by some Discord users to backup their servers on the platform. RestoreCord says on its website that it is \u0026#34;the only Discord Bot that you will ever need to protect and recover your server from raids, nukes, and more.\u0026#34; RestoreCord boasts that it serves 99 million members, including 100,000 paying customers, and backs up 55,000 Discord servers.\u003c/p\u003e\u003cp\u003eThe FBI \u003ca href=\"https://www.bleepingcomputer.com/news/security/fbi-seize-breachforums-hacking-forum-used-to-leak-stolen-data/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eseized\u003c/u\u003e\u003c/a\u003e BreachForums last year after the site became a well-known haven for buying and selling stolen data. However, one of BreachForums\u0026#39; domains popped \u003ca href=\"https://www.malwarebytes.com/blog/news/2024/05/data-leak-site-breachforums-is-back-boasting-live-nation-ticketmaster-user-data-but-is-it-a-trap\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eback up\u003c/u\u003e\u003c/a\u003e just a few weeks after the May 2024 takedown.\u003c/p\u003e\u003cp\u003eBreachForums\u0026#39; founder Conor Fitzpatrick was arrested in 2023 on a range of charges connected to the site. However, Fitzpatrick just recently made news a few weeks ago after a U.S. appeals court \u003ca href=\"https://therecord.media/breachforums-resentenced-supervised-release-admin\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003e\u003cu\u003eoverturned\u003c/u\u003e\u003c/a\u003e the lenient sentence he originally received.\u003c/p\u003e\u003cp\u003eIt is unclear as of publishing as to how the data was obtained or if there has been any malicious activity connected to what\u0026#39;s included in the leak. Mashable has reached out to RestoreCord for more information and will update this piece when we hear back.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-03T21:20:38Z",
  "modifiedTime": "2025-02-03T21:20:38Z"
}
