{
  "id": "400099f8-1e67-4146-9ee2-ab7b9b1d1a21",
  "title": "SEC Sues Crypto Startup Unicoin and Its Executives For Fraud",
  "link": "https://yro.slashdot.org/story/25/05/21/2055220/sec-sues-crypto-startup-unicoin-and-its-executives-for-fraud?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "The SEC on Wednesday said it has charged cryptocurrency startup Unicoin and three of its top executives for false and misleading statements that raised more than $100 million from thousands of investors. \"We allege that Unicoin and its executives exploited thousands of investors with fictitious promises that its tokens, when issued, would be backed by real-world assets including an international portfolio of valuable real estate holdings,\" said Mark Cave, Associate Director in the SEC's Division of Enforcement. \"But as we allege, the real estate assets were worth a mere fraction of what the company claimed, and the majority of the company's sales of rights certificates were illusory. Unicoin's most senior executives are alleged to have perpetuated the fraud, and today's action seeks accountability for their conduct.\" From the release: The SEC alleges that Unicoin broadly marketed rights certificates to the public through extensive promotional efforts, including advertisements in major airports, on thousands of New York City taxis, and on television and social media. Among other things, Unicoin and its executives are alleged to have convinced more than 5,000 investors to purchase rights certificates through false and misleading statements that portrayed them as investments in safe, stable, and profitable \"next generation\" crypto assets, including claims that: - Unicoin tokens underlying the rights certificates were \"asset-backed\" by billions of dollars of real estate and equity interests in pre-IPO companies, when Unicoin's assets were never worth more than a small fraction of that amount; - the company had sold more than $3 billion in rights certificates, when it raised no more than $110 million; and - the rights certificates and Unicoin tokens were \"SEC-registered\" or \"U.S. registered\" when they were not. According to the SEC's complaint, Unicoin and Konanykhin also violated the federal securities laws by engaging in unregistered offers and sales of rights certificates. Konanykhin offered and sold over 37.9 million of his rights certificates to offer better pricing and target investors the company had prohibited from participating in the offering to avoid jeopardizing its exemption to registration requirements, as alleged. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-05-22T00:02:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "crime"
  ],
  "byline": "",
  "length": 2268,
  "excerpt": "The SEC on Wednesday said it has charged cryptocurrency startup Unicoin and three of its top executives for false and misleading statements that raised more than $100 million from thousands of investors. \"We allege that Unicoin and its executives exploited thousands of investors with fictitious prom...",
  "siteName": "",
  "favicon": "",
  "text": "The SEC on Wednesday said it has charged cryptocurrency startup Unicoin and three of its top executives for false and misleading statements that raised more than $100 million from thousands of investors. \"We allege that Unicoin and its executives exploited thousands of investors with fictitious promises that its tokens, when issued, would be backed by real-world assets including an international portfolio of valuable real estate holdings,\" said Mark Cave, Associate Director in the SEC's Division of Enforcement. \"But as we allege, the real estate assets were worth a mere fraction of what the company claimed, and the majority of the company's sales of rights certificates were illusory. Unicoin's most senior executives are alleged to have perpetuated the fraud, and today's action seeks accountability for their conduct.\" From the release: The SEC alleges that Unicoin broadly marketed rights certificates to the public through extensive promotional efforts, including advertisements in major airports, on thousands of New York City taxis, and on television and social media. Among other things, Unicoin and its executives are alleged to have convinced more than 5,000 investors to purchase rights certificates through false and misleading statements that portrayed them as investments in safe, stable, and profitable \"next generation\" crypto assets, including claims that: - Unicoin tokens underlying the rights certificates were \"asset-backed\" by billions of dollars of real estate and equity interests in pre-IPO companies, when Unicoin's assets were never worth more than a small fraction of that amount; - the company had sold more than $3 billion in rights certificates, when it raised no more than $110 million; and - the rights certificates and Unicoin tokens were \"SEC-registered\" or \"U.S. registered\" when they were not. According to the SEC's complaint, Unicoin and Konanykhin also violated the federal securities laws by engaging in unregistered offers and sales of rights certificates. Konanykhin offered and sold over 37.9 million of his rights certificates to offer better pricing and target investors the company had prohibited from participating in the offering to avoid jeopardizing its exemption to registration requirements, as alleged.",
  "image": "https://a.fsdn.com/sd/topics/crime_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-177680583\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tThe SEC on Wednesday \u003ca href=\"https://www.sec.gov/newsroom/press-releases/2025-75\"\u003esaid\u003c/a\u003e it has charged cryptocurrency startup Unicoin and three of its top executives for \u003ca href=\"https://www.reuters.com/sustainability/boards-policy-regulation/sec-charges-unicoin-executives-fraud-2025-05-21/\"\u003efalse and misleading statements that raised more than $100 million from thousands of investors\u003c/a\u003e. \u0026#34;We allege that Unicoin and its executives exploited thousands of investors with fictitious promises that its tokens, when issued, would be backed by real-world assets including an international portfolio of valuable real estate holdings,\u0026#34; said Mark Cave, Associate Director in the SEC\u0026#39;s Division of Enforcement. \u0026#34;But as we allege, the real estate assets were worth a mere fraction of what the company claimed, and the majority of the company\u0026#39;s sales of rights certificates were illusory. Unicoin\u0026#39;s most senior executives are alleged to have perpetuated the fraud, and today\u0026#39;s action seeks accountability for their conduct.\u0026#34; From the release: \u003ci\u003e The SEC alleges that Unicoin broadly marketed rights certificates to the public through extensive promotional efforts, including advertisements in major airports, on thousands of New York City taxis, and on television and social media. Among other things, Unicoin and its executives are alleged to have convinced more than 5,000 investors to purchase rights certificates through false and misleading statements that portrayed them as investments in safe, stable, and profitable \u0026#34;next generation\u0026#34; crypto assets, including claims that:\n\u003cp\u003e \n- Unicoin tokens underlying the rights certificates were \u0026#34;asset-backed\u0026#34; by billions of dollars of real estate and equity interests in pre-IPO companies, when Unicoin\u0026#39;s assets were never worth more than a small fraction of that amount;\u003cbr/\u003e\n- the company had sold more than $3 billion in rights certificates, when it raised no more than $110 million; and\u003cbr/\u003e\n- the rights certificates and Unicoin tokens were \u0026#34;SEC-registered\u0026#34; or \u0026#34;U.S. registered\u0026#34; when they were not.\n\u003c/p\u003e\u003cp\u003e \nAccording to the SEC\u0026#39;s complaint, Unicoin and Konanykhin also violated the federal securities laws by engaging in unregistered offers and sales of rights certificates. Konanykhin offered and sold over 37.9 million of his rights certificates to offer better pricing and target investors the company had prohibited from participating in the offering to avoid jeopardizing its exemption to registration requirements, as alleged. \u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
