{
  "id": "40bceab7-6dd7-4e85-95f7-c4795f19493c",
  "title": "HPE Investigating Breach Claims After Hacker Offers To Sell Data",
  "link": "https://it.slashdot.org/story/25/01/20/2359234/hpe-investigating-breach-claims-after-hacker-offers-to-sell-data?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "The notorious hacker IntelBroker claims to have stolen data from HPE systems, including source code, private repositories, digital certificates, and access to certain services. SecurityWeek reports: The compromised data allegedly includes source code for products such as Zerto and iLO, private GitHub repositories, digital certificates, Docker builds, and even some personal information that the hacker described as \"old user PII for deliveries.\" IntelBroker is also offering access to some services used by HPE, including APIs, WePay, GitHub and GitLab. Contacted by SecurityWeek, HPE said it's aware of the breach claims and is conducting an investigation. \"HPE became aware on January 16 of claims being made by a group called IntelBroker that it was in possession of information belonging to HPE. HPE immediately activated our cyber response protocols, disabled related credentials, and launched an investigation to evaluate the validity of the claims,\" said HPE spokesperson Adam R. Bauer. \"There is no operational impact to our business at this time, nor evidence that customer information is involved,\" Bauer added. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-01-21T00:50:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "security"
  ],
  "byline": "",
  "length": 1126,
  "excerpt": "The notorious hacker IntelBroker claims to have stolen data from HPE systems, including source code, private repositories, digital certificates, and access to certain services. SecurityWeek reports: The compromised data allegedly includes source code for products such as Zerto and iLO, private GitH...",
  "siteName": "",
  "favicon": "",
  "text": "The notorious hacker IntelBroker claims to have stolen data from HPE systems, including source code, private repositories, digital certificates, and access to certain services. SecurityWeek reports: The compromised data allegedly includes source code for products such as Zerto and iLO, private GitHub repositories, digital certificates, Docker builds, and even some personal information that the hacker described as \"old user PII for deliveries.\" IntelBroker is also offering access to some services used by HPE, including APIs, WePay, GitHub and GitLab. Contacted by SecurityWeek, HPE said it's aware of the breach claims and is conducting an investigation. \"HPE became aware on January 16 of claims being made by a group called IntelBroker that it was in possession of information belonging to HPE. HPE immediately activated our cyber response protocols, disabled related credentials, and launched an investigation to evaluate the validity of the claims,\" said HPE spokesperson Adam R. Bauer. \"There is no operational impact to our business at this time, nor evidence that customer information is involved,\" Bauer added.",
  "image": "https://a.fsdn.com/sd/topics/security_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175983329\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tThe notorious hacker IntelBroker \u003ca href=\"https://www.securityweek.com/hpe-investigating-breach-claims-after-hacker-offers-to-sell-data/\"\u003eclaims to have stolen data from HPE systems\u003c/a\u003e, including source code, private repositories, digital certificates, and access to certain services. SecurityWeek reports: \u003ci\u003e The compromised data allegedly includes source code for products such as Zerto and iLO, private GitHub repositories, digital certificates, Docker builds, and even some personal information that the hacker described as \u0026#34;old user PII for deliveries.\u0026#34; IntelBroker is also offering access to some services used by HPE, including APIs, WePay, GitHub and GitLab. Contacted by SecurityWeek, HPE said it\u0026#39;s aware of the breach claims and is conducting an investigation.\n\u003cp\u003e \n\u0026#34;HPE became aware on January 16 of claims being made by a group called IntelBroker that it was in possession of information belonging to HPE. HPE immediately activated our cyber response protocols, disabled related credentials, and launched an investigation to evaluate the validity of the claims,\u0026#34; said HPE spokesperson Adam R. Bauer. \u0026#34;There is no operational impact to our business at this time, nor evidence that customer information is involved,\u0026#34; Bauer added.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
