{
  "id": "509be1b5-468c-442c-b0d8-d4e5346ec8b1",
  "title": "How we built Pixel Buds Pro 2 for even better sound and comfort",
  "link": "https://blog.google/products/pixel/pixel-buds-pro-2-design-google/",
  "description": "Learn more about how Google teams designed Pixel Buds Pro 2 for even audio with a more comfortable fit than the first generation.",
  "author": "Joel MearesContributor, The Keyword",
  "published": "Fri, 22 Nov 2024 17:00:00 +0000",
  "source": "https://www.blog.google/rss/",
  "categories": [
    "Pixel Buds",
    "Design",
    "Pixel"
  ],
  "byline": "Joel Meares",
  "length": 9819,
  "excerpt": "Learn more about how Google teams designed Pixel Buds Pro 2 for even audio with a more comfortable fit than the first generation.",
  "siteName": "Google",
  "favicon": "https://blog.google/static/blogv2/images/apple-touch-icon.png?version=pr20241113-1756",
  "text": "Nov 22, 2024 [[read-time]] min read Consider them your new best buds. General summary The Pixel Buds Pro 2 are smaller, lighter, and have improved noise cancellation thanks to a new custom chip called Tensor A1. The team focused on comfort and fit, conducting extensive user research and testing to ensure a secure and comfortable fit for all ear shapes. The new buds also feature Gemini integration, allowing you to use voice commands and chat conversationally without touching your phone. Summaries were generated by Google AI. Generative AI is experimental. Bullet points Pixel Buds Pro 2 are smaller, lighter, and offer better sound and noise cancellation than their predecessors. A custom Tensor A1 chip powers the new Buds, enabling faster audio processing and improved noise cancellation. The Buds were designed with comfort in mind, with a new stabilizer that can be adjusted for different activities. The team behind the Buds conducted extensive user testing to ensure the best possible audio quality and fit. Pixel Buds Pro 2 are the first to integrate Gemini, allowing for hands-free directions and conversational chat. Summaries were generated by Google AI. Generative AI is experimental. Basic explainer The new Pixel Buds Pro 2 are smaller, lighter, and have better noise cancellation than the old ones. They're more comfortable to wear because they have a new stabilizer that you can adjust. Google made a special chip called Tensor A1 just for these earbuds, which makes the sound even better. The new earbuds can also use Google's Gemini AI to help you with things like directions and talking to people. Summaries were generated by Google AI. Generative AI is experimental. Explore other styles: For the last two years, my trusty Pixel Buds Pro have kept me motivated with crisp and bassy beats while I run, blocked out the noise of subways and streets and silenced the clickety-clack of my colleagues’ keyboards when I need to focus on writing one of these stories. And they’ve stayed put in my ears.So, when we unveiled Pixel Buds Pro 2 at Made by Google this year, I was pumped — I had to have them — and also curious. How much could a device so small improve in a single generation?It turns out: a lot. Snug as a Bud… the author’s Pixel Buds Pro 2s, in Hazel, are perfect for running. I took my Pixel Buds Pro 2 out for their first ride, and the enhancements came as advertised. Twenty-seven percent smaller and 24% lighter than my former Buds, they sat comfortably in the ear, held firmly there by a new twist-to-adjust stabilizer even as I lumbered inelegantly around a Sydney Harbor running track. Screeching gulls and ferry horns were no match for the twice-as-strong Advanced Noise Cancellation (ANC) — all I could hear were crystal-clear pop gems.How had the Buds come so far between generations? I decided to ask around.“Building Pixel Buds Pro 2 was about removing the need for compromises,” says Pixel Buds Pro Product Manager Colin Billings. “It used to be that if you wanted a bud that was light, you had to have a bud with a shorter battery life. If you were athletic and wanted buds that would stay on, you needed clips. Here you have a bud that is comfortable, secure and delivers great sound and noise cancellation. All in one.”Powering that no-compromise approach is a custom chip called the Tensor A1. “After we launched the first Pixel Buds Pro in 2022, we knew we wanted to push the boundaries of noise cancellation and audio quality, in a smaller package,” says Audio Technology Development Director Michael Pate. “Off-the-shelf solutions wouldn’t meet those needs, so we followed the strategy used for Pixel phones and developed our own engine.” Video format not supported The custom Tensor A1 chip powers a number of enhancements for Pixel Buds Pro 2. The Buds team collaborated with the Silicon team early, outlining their final performance goals — from the computational demands of ANC to power consumption targets — and the algorithms that would be involved in achieving them. From there, the Silicon team began designing the architecture of the chip, and after rounds of testing, prototyping and validating performance, sent their final design to be fabricated. It arrived with the Buds team in 2023 ready to unlock new possibilities.Tensor A1 chips feature ultra low-latency audio processing engines, pivotal to pushing noise-canceling bandwidth higher. “In the previous generation, we were processing audio inputs at five or six times the speed of sound,” Michael says. “With these latest Buds, we’re processing at 90 times the speed of sound.” That means as a soundwave hits the outside microphone and journeys towards your eardrum, the new Buds can perform more processes more quickly along the way — isolating sounds, canceling them and even creating “anti-noise” for sound that leaks through the earbud, all before you can hear it. And because Tensor A1 has multipath processing, the continuous work being done for ANC is separated from the processes driving what you’re actually listening to. (No wonder my running playlist sounded so good: It had its own dedicated highway lane to my eardrums.)Of course, none of these enhancements would be worth much if the buds were uncomfortable to wear. Which is why the team took a meticulous approach to their design.A user experience research (UXR) team scanned the ears of people of various ages and backgrounds to generate a representative sample of multi-dimensional scans. “We wanted to get smaller and more comfortable, so we looked at places where buds might push against the ear and where they might slot in more naturally, and designed for that,” says Frances Kwee, who leads Pixel Buds hardware engineering.To help figure out fit, Googlers lent their ears to the UXR team for scanning and then for testing different prototypes. “Early in the design process, the UXR team sent people home with dummy pieces of plastic and asked them to do jumping jacks, go for runs and wear them for several hours, just to report back on how stable and comfortable they were,” Frances says.The team ultimately landed on adding a stabilizer to the design. This new small fin on the side of the bud can be adjusted to suit your use: Twist it to fit snugly against the bottom of your ear when exercising, or twist the other way for a looser fit. Video format not supported You can twist the stabilizer on your Pixel Buds Pro 2 to adjust the fit. Testing for audio quality was more challenging. Everyone’s hearing is different, impacted by biology, our exposure to loud noises and more. What sounds good or clear to one person might not sound the same to another. For that reason, the team increased the number of Googler testers they used compared to other audio products and standardized surveys for more consistent data and to eliminate as much bias as possible.“We learned a lot from Googlers,” Colin says. “Take transparency mode, for example, which uses microphones to collect sound from the outside environment and replicate it in your ear — like you’re listening to music but can hear your surroundings. We thought people would be very concerned with all aspects of that experience, including how their own voices sounded when they spoke. Our learnings showed us that users were much more concerned about sound artifacts like amplifying natural ambient sounds. Based on this, we shifted our near-term focus to tuning the experience for those factors and plan to focus on aspects like self-voice, which we believe will become more important in the future, later.”For the team behind Pixel Buds Pro 2, the future of the line lies not just in making pop tunes sound great — and canceling out anything that might get in the way of that. The new buds are also the first to integrate Gemini, allowing you to ask for directions without unlocking your phone and to chat conversationally through Gemini Live.“We work hard to understand our customers and know what they want, and each successor generation builds from that,” Colin says. “As we look forward, we’re thinking about how we can use sound to go beyond listening, to bring you even more helpful services from Google without touching another device.”Consider me pumped. Related Article Related Article My favorite Pixel Buds Pro 2 features Learn more about Google’s new Pixel Buds Pro 2.",
  "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pb_hero_2.width-1300.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\n    \n    \n\n\n\n\n\n    \n\n    \n      \n\n\u003cdiv data-analytics-module=\"{\n    \u0026#34;module_name\u0026#34;: \u0026#34;Hero Menu\u0026#34;,\n    \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n  }\"\u003e\n  \n  \u003cdiv\u003e\n      \u003cdiv\u003e\n          \n            \u003cp\u003eNov 22, 2024\u003c/p\u003e\n          \n          \n            \u003cp data-reading-time-render=\"\"\u003e[[read-time]] min read\u003c/p\u003e\n          \n        \u003c/div\u003e\n      \n        \u003cp\u003e\n          Consider them your new best buds.\n        \u003c/p\u003e\n      \n    \u003c/div\u003e\n  \n  \u003cdiv data-component=\"uni-ai-generated-summary\" data-analytics-module=\"{\n    \u0026#34;event\u0026#34;: \u0026#34;module_impression\u0026#34;,\n    \u0026#34;module_name\u0026#34;: \u0026#34;ai_summary\u0026#34;,\n    \u0026#34;section_header\u0026#34;: \u0026#34;CTA\u0026#34;\n  }\"\u003e\n      \n        \u003cdiv data-summary-id=\"ai_summary_1\"\u003e\n          \u003ch2\u003eGeneral summary\u003c/h2\u003e\n          \u003cp\u003eThe Pixel Buds Pro 2 are smaller, lighter, and have improved noise cancellation thanks to a new custom chip called Tensor A1. The team focused on comfort and fit, conducting extensive user research and testing to ensure a secure and comfortable fit for all ear shapes. The new buds also feature Gemini integration, allowing you to use voice commands and chat conversationally without touching your phone.\u003c/p\u003e\n          \n          \u003cp\u003e\u003csmall\u003e\n            Summaries were generated by Google AI. Generative AI is experimental.\n          \u003c/small\u003e\n        \u003c/p\u003e\u003c/div\u003e\n      \n        \u003cdiv data-summary-id=\"ai_summary_2\"\u003e\n          \u003ch2\u003eBullet points\u003c/h2\u003e\n          \u003cul\u003e\n\u003cli\u003ePixel Buds Pro 2 are smaller, lighter, and offer better sound and noise cancellation than their predecessors.\u003c/li\u003e\n\u003cli\u003eA custom Tensor A1 chip powers the new Buds, enabling faster audio processing and improved noise cancellation.\u003c/li\u003e\n\u003cli\u003eThe Buds were designed with comfort in mind, with a new stabilizer that can be adjusted for different activities.\u003c/li\u003e\n\u003cli\u003eThe team behind the Buds conducted extensive user testing to ensure the best possible audio quality and fit.\u003c/li\u003e\n\u003cli\u003ePixel Buds Pro 2 are the first to integrate Gemini, allowing for hands-free directions and conversational chat.\u003c/li\u003e\n\u003c/ul\u003e\n          \n          \u003cp\u003e\u003csmall\u003e\n            Summaries were generated by Google AI. Generative AI is experimental.\n          \u003c/small\u003e\n        \u003c/p\u003e\u003c/div\u003e\n      \n        \u003cdiv data-summary-id=\"ai_summary_3\"\u003e\n          \u003ch2\u003eBasic explainer\u003c/h2\u003e\n          \u003cp\u003eThe new Pixel Buds Pro 2 are smaller, lighter, and have better noise cancellation than the old ones. They\u0026#39;re more comfortable to wear because they have a new stabilizer that you can adjust. Google made a special chip called Tensor A1 just for these earbuds, which makes the sound even better. The new earbuds can also use Google\u0026#39;s Gemini AI to help you with things like directions and talking to people.\u003c/p\u003e\n          \n          \u003cp\u003e\u003csmall\u003e\n            Summaries were generated by Google AI. Generative AI is experimental.\n          \u003c/small\u003e\n        \u003c/p\u003e\u003c/div\u003e\n      \n\n      \n      \u003cdiv\u003e\n        \u003ch4\u003e\n          Explore other styles:\n        \u003c/h4\u003e\n        \n      \u003c/div\u003e\n      \n\n      \u003c/div\u003e\n\u003c/div\u003e\n\n    \n\n    \n      \n\n\n\n\n\n\n\n\u003cdiv\u003e\n    \u003cfigure\u003e\n      \u003cdiv\u003e\n  \u003cp\u003e\u003cimg srcset=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pb_hero_2.width-600.format-webp.webp 600w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pb_hero_2.width-1200.format-webp.webp 1200w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pb_hero_2.width-1600.format-webp.webp 1600w\" sizes=\"(max-width: 599px) 100vw, (max-width: 1023px) 600px, 1024px\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pb_hero_2.width-1200.format-webp.webp\" fetchpriority=\"high\" alt=\"A person with brown skin and locs in side profile. In their right ear, they have a Pixel Buds Pro 2 earbud.\"/\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n      \n    \u003c/figure\u003e\n  \u003c/div\u003e\n\n\n    \n\n    \n    \u003cdiv data-reading-time=\"true\" data-component=\"uni-article-body\"\u003e\n\n            \n              \n\n\n\u003cgoogle-read-aloud-player data-analytics-module=\"{\n        \u0026#34;event\u0026#34;: \u0026#34;module_impression\u0026#34;,\n        \u0026#34;module_name\u0026#34;: \u0026#34;ai_audio\u0026#34;,\n        \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n    }\" data-date-modified=\"2024-11-22T20:10:25.257350+00:00\" data-progress-bar-style=\"half-wave\" data-api-key=\"AIzaSyBLT6VkYe-x7sWLZI2Ep26-fNkBKgND-Ac\" data-article-style=\"style9\" data-tracking-ids=\"G-HGNBTNCHCQ,G-6NKTLKV14N\" data-voice-list=\"en.ioh-pngnat:Cyan,en.usb-pngnat:Lime\" data-layout-style=\"style1\" data-highlight-mode=\"word-over-paragraph\" data-highlight-text-color=\"#000000\" data-highlight-word-background=\"#8AB4F8\" data-highlight-paragraph-background=\"#D2E3FC\" data-background=\"linear-gradient(180deg, #F1F3F4 0%, #F8F9FA 100%)\" data-foreground-color=\"#202124\" data-font=\"600 16px Google Sans, sans-serif\" data-box-shadow=\"0px 1px 3px 1px rgba(60, 64, 67, 0.15)\"\u003e\n\u003c/google-read-aloud-player\u003e\n\n\n\n\n            \n\n            \n            \n\n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"0tz70\"\u003eFor the last two years, my trusty Pixel Buds Pro have kept me motivated with crisp and bassy beats while I run, blocked out the noise of subways and streets and silenced the clickety-clack of my colleagues’ keyboards when I need to focus on writing one of these stories. And they’ve stayed put in my ears.\u003c/p\u003e\u003cp data-block-key=\"a9ie7\"\u003eSo, when we unveiled \u003ca href=\"https://store.google.com/product/pixel_buds_pro_2?utm_source=keyword\u0026amp;utm_medium=google_oo\u0026amp;utm_campaign=GS108187\"\u003ePixel Buds Pro 2\u003c/a\u003e at \u003ca href=\"https://blog.google/products/pixel/google-pixel-buds-pro-2/\"\u003eMade by Google\u003c/a\u003e this year, I was pumped — I had to have them — and also curious. How much could a device so small improve in a single generation?\u003c/p\u003e\u003cp data-block-key=\"bfhv8\"\u003eIt turns out: a lot.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\n\n\n\n\n\n  \n      \u003cdiv data-analytics-module=\"{\n          \u0026#34;module_name\u0026#34;: \u0026#34;Inline Images\u0026#34;,\n          \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n        }\"\u003e\n  \n\n  \u003cp\u003e\u003cimg alt=\"A close-up on a Pixel bud in a man’s right ear.\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Pixel_Buds_Pro_2_Dtm5eZ8.width-100.format-webp.webp \" loading=\"lazy\" data-loading=\"{\n                \u0026#34;mobile\u0026#34;: \u0026#34;https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Pixel_Buds_Pro_2_Dtm5eZ8.width-500.format-webp.webp\u0026#34;,\n                \u0026#34;desktop\u0026#34;: \u0026#34;https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Pixel_Buds_Pro_2_Dtm5eZ8.width-1000.format-webp.webp\u0026#34;\n              }\"/\u003e\n        \n      \n    \n    \u003c/p\u003e\n    \n      \u003cfigcaption\u003e\u003cp data-block-key=\"6k1nt\"\u003eSnug as a Bud… the author’s Pixel Buds Pro 2s, in Hazel, are perfect for running.\u003c/p\u003e\u003c/figcaption\u003e\n    \n  \n    \u003c/div\u003e\n  \n\n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"0tz70\"\u003eI took my Pixel Buds Pro 2 out for their first ride, and the enhancements came as advertised. Twenty-seven percent smaller and 24% lighter than my former Buds, they sat comfortably in the ear, held firmly there by a new twist-to-adjust stabilizer even as I lumbered inelegantly around a Sydney Harbor running track. Screeching gulls and ferry horns were no match for the twice-as-strong Advanced Noise Cancellation (ANC) — all I could hear were crystal-clear pop gems\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\u003cp data-block-key=\"2rej\"\u003eHow had the Buds come so far between generations? I decided to ask around.\u003c/p\u003e\u003cp data-block-key=\"a99bu\"\u003e“Building Pixel Buds Pro 2 was about removing the need for compromises,” says Pixel Buds Pro Product Manager Colin Billings. “It used to be that if you wanted a bud that was light, you had to have a bud with a shorter battery life. If you were athletic and wanted buds that would stay on, you needed clips. Here you have a bud that is comfortable, secure and delivers great sound and noise cancellation. All in one.”\u003c/p\u003e\u003cp data-block-key=\"api56\"\u003ePowering that no-compromise approach is a custom chip called the Tensor A1. “After we launched the first Pixel Buds Pro in 2022, we knew we wanted to push the boundaries of noise cancellation and audio quality, in a smaller package,” says Audio Technology Development Director Michael Pate. “Off-the-shelf solutions wouldn’t meet those needs, so we followed the strategy used for Pixel phones and developed our own engine.”\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\n\n\n\n\n\n  \n      \u003cdiv data-analytics-module=\"{\n          \u0026#34;module_name\u0026#34;: \u0026#34;Inline Images\u0026#34;,\n          \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n        }\"\u003e\n  \n\n  \u003cp\u003e\n\n      \n      \n        \n          \u003cvideo tabindex=\"0\" autoplay=\"\" loop=\"\" muted=\"\" playsinline=\"\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/original_videos/Pixel_Buds_Pro_2.mp4\" type=\"video/mp4\" title=\"A GIF shows an interior cross-section of a Pixel Bud Pro 2. As the device is pulled apart, a square microchip with the label A1 emerges from the center and stays in frame as the rest of the material moves away.\" alt=\"Pixel Buds Pro 2\"\u003e\n            Video format not supported\n          \u003c/video\u003e\n        \n      \n    \n    \u003c/p\u003e\n    \n      \u003cfigcaption\u003e\u003cp data-block-key=\"6k1nt\"\u003eThe custom Tensor A1 chip powers a number of enhancements for Pixel Buds Pro 2.\u003c/p\u003e\u003c/figcaption\u003e\n    \n  \n    \u003c/div\u003e\n  \n\n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"0tz70\"\u003eThe Buds team collaborated with the Silicon team early, outlining their final performance goals — from the computational demands of ANC to power consumption targets — and the algorithms that would be involved in achieving them. From there, the Silicon team began designing the architecture of the chip, and after rounds of testing, prototyping and validating performance, sent their final design to be fabricated. It arrived with the Buds team in 2023 ready to unlock new possibilities.\u003c/p\u003e\u003cp data-block-key=\"1r7dk\"\u003eTensor A1 chips feature ultra low-latency audio processing engines, pivotal to pushing noise-canceling bandwidth higher. “In the previous generation, we were processing audio inputs at five or six times the speed of sound,” Michael says. “With these latest Buds, we’re processing at 90 times the speed of sound.” That means as a soundwave hits the outside microphone and journeys towards your eardrum, the new Buds can perform more processes more quickly along the way — isolating sounds, canceling them and even creating “anti-noise” for sound that leaks through the earbud, all before you can hear it.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n  \n    \n\n\u003cdiv data-component=\"uni-article-yt-player\" data-page-title=\"How we built Pixel Buds Pro 2 for even better sound and comfort\" data-video-id=\"ki3yV9etpxg\" data-index-id=\"6\" data-type=\"video\" data-analytics-module=\"{\n    \u0026#34;module_name\u0026#34;: \u0026#34;Youtube Video\u0026#34;,\n    \u0026#34;section_header\u0026#34;: \u0026#34;undefined\u0026#34;\n  }\" data-yt-video=\"module\"\u003e\n\n    \n\n    \u003ca role=\"video\" tabindex=\"0\"\u003e\n      \u003cdiv\u003e\n        \n          \n          \u003cp\u003e\u003cimg alt=\"A YouTube Short showing someone flipping the Pixel Buds Pro 2 case open and shut multiple times. Each time the case opens, new text appears on the screen to explain the Buds\u0026#39; features.\" src=\"https://i.ytimg.com/vi_webp/ki3yV9etpxg/default.webp\" loading=\"lazy\" data-loading=\"{\n                \u0026#34;mobile\u0026#34;: \u0026#34;//i.ytimg.com/vi_webp/ki3yV9etpxg/sddefault.webp\u0026#34;,\n                \u0026#34;desktop\u0026#34;: \u0026#34;https://i.ytimg.com/vi_webp/ki3yV9etpxg/maxresdefault.webp\u0026#34;\n              }\"/\u003e\u003c/p\u003e\n\n        \n        \u003csvg role=\"presentation\"\u003e\n  \u003cuse xmlns:xlink=\"http://www.w3.org/1999/xlink\" href=\"/static/blogv2/images/icons.svg?version=pr20241113-1756#mi-keyboard-arrow-right\"\u003e\u003c/use\u003e\n\u003c/svg\u003e\n\n\n        \u003csvg role=\"presentation\"\u003e\n          \n          \u003cuse href=\"/static/blogv2/images/icons.svg?version=pr20241113-1756#yt_video_shorts_play_button_no_hole\"\u003e\u003c/use\u003e\n          \n        \u003c/svg\u003e\n        \u003csvg role=\"img\"\u003e\n          \n          \u003cuse href=\"/static/blogv2/images/icons.svg?version=pr20241113-1756#yt_video_shorts_play_button\"\u003e\u003c/use\u003e\n          \n        \u003c/svg\u003e\n\n        \n        \n      \u003c/div\u003e\n    \u003c/a\u003e\n\n    \n\n    \n  \u003c/div\u003e\n\n  \n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"4ler1\"\u003eAnd because Tensor A1 has multipath processing, the continuous work being done for ANC is separated from the processes driving what you’re actually listening to. (No wonder my running playlist sounded so good: It had its own dedicated highway lane to my eardrums.)\u003c/p\u003e\u003cp data-block-key=\"8lcbe\"\u003eOf course, none of these enhancements would be worth much if the buds were uncomfortable to wear. Which is why the team took a meticulous approach to their design.\u003c/p\u003e\u003cp data-block-key=\"3macc\"\u003eA user experience research (UXR) team scanned the ears of people of various ages and backgrounds to generate a representative sample of multi-dimensional scans. “We wanted to get smaller and more comfortable, so we looked at places where buds might push against the ear and where they might slot in more naturally, and designed for that,” says Frances Kwee, who leads Pixel Buds hardware engineering.\u003c/p\u003e\u003cp data-block-key=\"2mv2r\"\u003eTo help figure out fit, Googlers lent their ears to the UXR team for scanning and then for testing different prototypes. “Early in the design process, the UXR team sent people home with dummy pieces of plastic and asked them to do jumping jacks, go for runs and wear them for several hours, just to report back on how stable and comfortable they were,” Frances says.\u003c/p\u003e\u003cp data-block-key=\"a5hun\"\u003eThe team ultimately landed on adding a stabilizer to the design. This new small fin on the side of the bud can be adjusted to suit your use: Twist it to fit snugly against the bottom of your ear when exercising, or twist the other way for a looser fit.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\n\n\n\n\n\n  \n      \u003cdiv data-analytics-module=\"{\n          \u0026#34;module_name\u0026#34;: \u0026#34;Inline Images\u0026#34;,\n          \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n        }\"\u003e\n  \n\n  \u003cp\u003e\n\n      \n      \n        \n          \u003cvideo tabindex=\"0\" autoplay=\"\" loop=\"\" muted=\"\" playsinline=\"\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/original_videos/Stabilizer_ZUU6P5h.mp4\" type=\"video/mp4\" title=\"Gif showing twist-to-adjust stabilizer on Pixel Buds Pro 2 in Wintergreen.\" alt=\"Stabilizer\"\u003e\n            Video format not supported\n          \u003c/video\u003e\n        \n      \n    \n    \u003c/p\u003e\n    \n      \u003cfigcaption\u003e\u003cp data-block-key=\"6k1nt\"\u003eYou can twist the stabilizer on your Pixel Buds Pro 2 to adjust the fit.\u003c/p\u003e\u003c/figcaption\u003e\n    \n  \n    \u003c/div\u003e\n  \n\n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;How we built Pixel Buds Pro 2 for even better sound and comfort\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"lxy2l\"\u003eTesting for audio quality was more challenging. Everyone’s hearing is different, impacted by biology, our exposure to loud noises and more. What sounds good or clear to one person might not sound the same to another. For that reason, the team increased the number of Googler testers they used compared to other audio products and standardized surveys for more consistent data and to eliminate as much bias as possible.\u003c/p\u003e\u003cp data-block-key=\"9g6vp\"\u003e“We learned a lot from Googlers,” Colin says. “Take transparency mode, for example, which uses microphones to collect sound from the outside environment and replicate it in your ear — like you’re listening to music but can hear your surroundings. We thought people would be very concerned with all aspects of that experience, including how their own voices sounded when they spoke. Our learnings showed us that users were much more concerned about sound artifacts like amplifying natural ambient sounds. Based on this, we shifted our near-term focus to tuning the experience for those factors and plan to focus on aspects like self-voice, which we believe will become more important in the future, later.”\u003c/p\u003e\u003cp data-block-key=\"cpp6n\"\u003eFor the team behind Pixel Buds Pro 2, the future of the line lies not just in making pop tunes sound great — and canceling out anything that might get in the way of that. The new buds are also the first to integrate Gemini, allowing you to ask for directions without unlocking your phone and to chat conversationally through Gemini Live.\u003c/p\u003e\u003cp data-block-key=\"fotqr\"\u003e“We work hard to understand our customers and know what they want, and each successor generation builds from that,” Colin says. “As we look forward, we’re thinking about how we can use sound to go beyond listening, to bring you even more helpful services from Google without touching another device.”\u003c/p\u003e\u003cp data-block-key=\"agec\"\u003eConsider me pumped.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\u003csection data-analytics-module=\"{\n  \u0026#34;module_name\u0026#34;: \u0026#34;Related Content Tout\u0026#34;,\n  \u0026#34;section_header\u0026#34;: \u0026#34;My favorite Pixel Buds Pro 2 features\u0026#34;\n}\"\u003e\n  \u003ca href=\"https://blog.google/products/pixel/pixel-buds-pro-2-hands-on/\" data-ga4-analytics-cta-click=\"{\n  \u0026#34;event\u0026#34;: \u0026#34;cta_click\u0026#34;,\n  \u0026#34;link_text\u0026#34;: \u0026#34;See more\u0026#34;\n}\" data-ga4-analytics-lead-click=\"{\n  \u0026#34;event\u0026#34;: \u0026#34;article_lead_click\u0026#34;,\n  \u0026#34;link_text\u0026#34;: \u0026#34;7 of my favorite things about the new Pixel Buds Pro 2\u0026#34;,\n  \u0026#34;link_type\u0026#34;: \u0026#34;internal\u0026#34;,\n  \u0026#34;article_name\u0026#34;: \u0026#34;7 of my favorite things about the new Pixel Buds Pro 2\u0026#34;,\n  \u0026#34;author_name\u0026#34; : \u0026#34;Molly McHugh-Johnson\u0026#34;,\n  \u0026#34;page_name\u0026#34;: \u0026#34;pixel-buds-pro-2-hands-on\u0026#34;,\n  \u0026#34;position\u0026#34;: \u0026#34;1 of 1\u0026#34;,\n  \u0026#34;click_location\u0026#34;: \u0026#34;undefined\u0026#34;,\n  \u0026#34;primary_tag\u0026#34;: \u0026#34;Products - Pixel\u0026#34;,\n  \u0026#34;secondary_tags\u0026#34;: \u0026#34;Pixel Buds\u0026#34;,\n  \u0026#34;publish_date\u0026#34;: \u0026#34;2024-10-02|16:00\u0026#34;,\n  \u0026#34;hero_media\u0026#34;: \u0026#34;image\u0026#34;,\n  \u0026#34;days_since_published\u0026#34;: \u0026#34;52\u0026#34;,\n  \u0026#34;content_category\u0026#34;: \u0026#34;Editorial feature\u0026#34;,\n  \u0026#34;word_count\u0026#34;: \u0026#34;965\u0026#34;,\n  \u0026#34;has_audio\u0026#34;: \u0026#34;no\u0026#34;,\n  \u0026#34;has_video\u0026#34;: \u0026#34;yes\u0026#34;,\n  \u0026#34;has_image\u0026#34;: \u0026#34;no\u0026#34;,\n  \u0026#34;has_carousel\u0026#34;: \u0026#34;no\u0026#34;\n}\"\u003e\n    \u003cp\u003eRelated Article\u003c/p\u003e\n    \u003cdiv\u003e\n      \n        \n    \u003cfigure\u003e\n        \u003cpicture\u003e\n            \n\n\n    \n\n    \n        \u003csource media=\"(max-resolution: 1.5dppx)\" sizes=\"300px\" srcset=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pixel_buds.width-300.format-webp.webp 300w\"/\u003e\n    \n        \u003csource media=\"(min-resolution: 1.5dppx)\" sizes=\"600px\" srcset=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pixel_buds.width-600.format-webp.webp 600w\"/\u003e\n    \n\n    \u003cimg src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pixel_buds.width-600.format-webp.webp\" alt=\"Photo of a close-up of the side of a person’s head, revealing their ear featuring two small golden earrings and their hairline behind their ear. Their hand is reaching to place a pink Pixel Bud into their ear; the Google “G” icon is visible on the front.\" sizes=\" 300px,  600px\" srcset=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pixel_buds.width-300.format-webp.webp 300w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/pixel_buds.width-600.format-webp.webp 600w\" data-target=\"image\" loading=\"lazy\"/\u003e\n    \n\n\n        \u003c/picture\u003e\n    \u003c/figure\u003e\n\n\n      \n      \u003cdiv\u003e\n        \u003cp\u003eRelated Article\u003c/p\u003e\n        \u003cp\u003eMy favorite Pixel Buds Pro 2 features\u003c/p\u003e\n        \u003cp\u003eLearn more about Google’s new Pixel Buds Pro 2.\u003c/p\u003e\n        \n      \u003c/div\u003e\n    \u003c/div\u003e\n  \u003c/a\u003e\n\u003c/section\u003e\n\n  \n\n\n            \n            \n\n            \n              \n\n\n\n\n            \n          \u003c/div\u003e\n  \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-11-22T17:00:00Z",
  "modifiedTime": null
}
