{
  "id": "5606accd-9d60-403d-9773-f45e99a36d54",
  "title": "Jupiter's Moon Callisto Probably Has an Ocean Under Its Surface",
  "link": "https://www.cnet.com/science/jupiters-moon-callisto-probably-has-an-ocean-under-its-surface/#ftag=CAD590a51e",
  "description": "Researchers took a second look at data collected from the Galileo mission, which originally launched in 1989.",
  "author": "Joe Hindy",
  "published": "Thu, 13 Mar 2025 23:36:00 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Joe Hindy",
  "length": 5817,
  "excerpt": "Researchers took a second look at data collected from the Galileo mission, which originally launched in 1989.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Researchers took a second look at data collected from the Galileo mission, which originally launched in 1989. If there was a contest for the most interesting moon in our solar system, Callisto would be a contender. Jupiter's second-largest moon has more impact craters on its surface than any other planetary body in the solar system, and it has tons of ice on its surface as well. For decades. researchers have theorized that resting beneath Callisto's pockmarked surface is a liquid saltwater ocean that spans the entire moon. After taking a closer look at data from 30 years ago, researchers now have stronger evidence that such an ocean really does exist.A team, led by Corey J. Cochrane of the Planetary Interiors and Geophysics Group at NASA's JPL, didn't start out looking for an ocean on Callisto. According to Cochrane, the team was working on a different project, involving scanning Neptune's moon Triton to see if it has a subsurface ocean. This presented a challenge, because of Triton's intense ionosphere, which is the last layer of the atmosphere before space begins. Since Callisto also has an intense ionosphere, the team decided to test their methods on 30-year-old measurements taken by NASA's Galileo mission. That mission launched in 1989 and scanned Jupiter and its moons between 1995 and 2003. \"Our conclusions were enabled by analyzing measurements that were acquired from a flyby of Callisto that has typically been neglected in the community due to the presence of increased 'noise' attributed to the plasma environment,\" Cochrane told CNET in an email. \"We were able to leverage previously developed plasma simulations to remove this obscuring plasma noise source from the measurement so that the signal from the ocean could be analyzed independently,\" Cochrane said.In short, Galileo's readings were initially difficult to interpret because of Callisto's strong ionosphere. Once Cochrane and his team cleaned up the readings, they were able to consider the data, and it strongly suggests there's an ocean under the moon's rocky exterior. The ionosphere looks like an oceanIt's taking so long to prove the existence of a subsurface ocean on Callisto because a strong ionosphere mimics the readings you'd get if there were such an ocean. \"A fundamental physical law of nature (Faraday's Law of Magnetic Induction) indicates that if you move a magnet with respect to any conductive material, like a copper wire, you will create an electrical current within that wire that is synchronized to the movement of the magnet,\" Cochrane explained. \"That current will then create a secondary magnetic field (due to the movement of the electrons in the wire) which is called an induced magnetic field, which exhibits properties of the conductive material.\"Cochrane said this works with planetary bodies as well. Moons or planets with enough internal heat can have a liquid saltwater ocean beneath the surface. These oceans are electrically conductive thanks to the salt in the water. Thus, scientists can use magnetometers to measure an induced magnetic field that \"retains properties of the ocean,\" Cochrane said. In other words, oceans can be found based on the magnetic fields they generate. Since moons like Jupiter's Callisto and Neptune's Triton have very strong ionospheres, readings with a magnetometer become so noisy that researchers have trouble figuring out whether what they're looking at is an ocean or just random noise from the extra energy in the ionosphere. That's why researchers have been stuck on Callisto's potential underground ocean for decades. The next stepsScience won't have to wait another 30 years to find proof. NASA's Europa Clipper mission set sail last year and should reach Jupiter and its moons in 2030, while the European Space Agency's JUICE mission should arrive in 2031. Both missions will almost certainly provide more research data for Callisto. In terms of the information they'll be collecting, Cochrane told us it's not necessarily different data. Rather, it's more data. \"Proving the existence of Callisto's ocean from new measurements simply comes down to the fact that there are more measurements available to analyze,\" Cochrane said. \"For every flyby that occurs for each of these missions, only a very small snapshot in time of the magnetic field environment is captured by the magnetometer.\"Cochrane said the data from the Europe Clipper and JUICE missions will help \"fill in the holes\" from the Galileo mission, hopefully letting researchers finally prove whether an ocean exists on Callisto. The extra data will also help researchers estimate how thick Callisto's ocean layer is, as well as the thickness of the ice shell that rests on top of it. Could there be life on Callisto?NASA and the European Space Agency wouldn't have sent missions to Jupiter without good reasons to do so. And one is this: Europa's hidden waters are the front-runner for extraterrestrial life. \"It is possible that Europa's ocean can support life because we know that it hosts the key ingredients to support it, those being water, essential chemical elements, and energy (e.g. heat source from within) over a time span long enough for life to evolve,\" Cochrane said. \"Europa Clipper is actually a habitability mission (not to be confused with life detection) which will provide the data required to better help us answer this question. Until that time, it's hard to comment on whether it is probable.\"But there's a growing case for life on Callisto. It has a surprising amount of oxygen, and no one can figure out where most of it came from. Pair that with the increasing likelihood of a subsurface ocean, and though it's still far from a sure thing, that's enough evidence to justify taking a closer look at the Jupiter moon when the missions arrive in 2030 and 2031.",
  "image": "https://www.cnet.com/a/img/resize/2d9873cd13b415fa29972fab1cc5244100cb725e/hub/2025/02/28/a39fe94f-b777-47ba-bd9e-81463bf78c7d/callisto-layers.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e \u003cp\u003e\n    Researchers took a second look at data collected from the Galileo mission, which originally launched in 1989.\n  \u003c/p\u003e \u003c/div\u003e\u003cdiv id=\"article-0553f158-81e9-4f6c-83f3-70fc93b8e045\"\u003e\u003cp\u003eIf there was a contest for the most interesting moon in our solar system, Callisto would be a contender. Jupiter\u0026#39;s second-largest moon has more impact craters on its surface than any other planetary body in the solar system, and it has tons of ice on its surface as well. \u003c/p\u003e\u003cp\u003eFor decades. researchers have theorized that resting beneath \u003ca href=\"https://solarsystem.nasa.gov/moons/jupiter-moons/callisto/galleries/?page=0\u0026amp;per_page=25\u0026amp;order=created_at+desc\u0026amp;search=\u0026amp;href_query_params=category%3Dmoons%2Fjupiter-moons_callisto\u0026amp;button_class=big_more_button\u0026amp;tags=callisto\u0026amp;condition_1=1%3Ais_in_resource_list\u0026amp;category=51\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eCallisto\u0026#39;s pockmarked surface\u003c/a\u003e is a liquid saltwater ocean that spans the entire moon. After taking a closer look at data from 30 years ago, researchers now have stronger evidence that such an ocean really does exist.\u003c/p\u003e\u003cp\u003eA team, led by Corey J. Cochrane of the Planetary Interiors and Geophysics Group at NASA\u0026#39;s JPL, didn\u0026#39;t start out looking for an ocean on Callisto. According to Cochrane, the team was working on \u003ca href=\"https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2021EA002034\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003ea different project\u003c/a\u003e, involving \u003ca href=\"https://www.nasa.gov/centers-and-facilities/jpl/proposed-nasa-mission-would-visit-neptunes-curious-moon-triton/\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003escanning Neptune\u0026#39;s moon Triton\u003c/a\u003e to see if it has a subsurface ocean. \u003c/p\u003e\u003cp\u003eThis presented a challenge, because of Triton\u0026#39;s intense ionosphere, which is the last layer of the atmosphere before space begins. Since Callisto also has an intense ionosphere, the team decided to test their methods on 30-year-old measurements taken by NASA\u0026#39;s Galileo mission. That mission launched in 1989 and scanned Jupiter and its moons between 1995 and 2003. \u003c/p\u003e\u003cp\u003e\u0026#34;Our conclusions were enabled by analyzing measurements that were acquired from a flyby of Callisto that has typically been neglected in the community due to the presence of increased \u0026#39;noise\u0026#39; attributed to the plasma environment,\u0026#34; Cochrane told CNET in an email. \u003c/p\u003e\u003cp\u003e\u0026#34;We were able to leverage previously developed plasma simulations to remove this obscuring plasma noise source from the measurement so that the signal from the ocean could be analyzed independently,\u0026#34; Cochrane said.\u003c/p\u003e\u003cp\u003eIn short, Galileo\u0026#39;s readings were initially difficult to interpret because of Callisto\u0026#39;s strong ionosphere. Once Cochrane and his team cleaned up the readings, they were able to consider the data, and it strongly suggests there\u0026#39;s an ocean under the moon\u0026#39;s rocky exterior. \u003c/p\u003e\u003ch2\u003eThe ionosphere looks like an ocean\u003c/h2\u003e\u003cp\u003eIt\u0026#39;s taking so long to prove the existence of a subsurface ocean on Callisto because a strong ionosphere mimics the readings you\u0026#39;d get if there were such an ocean. \u003c/p\u003e\u003cp\u003e\u0026#34;A fundamental physical law of nature (Faraday\u0026#39;s Law of Magnetic Induction) indicates that if you move a magnet with respect to any conductive material, like a copper wire, you will create an electrical current within that wire that is synchronized to the movement of the magnet,\u0026#34; Cochrane explained. \u0026#34;That current will then create a secondary magnetic field (due to the movement of the electrons in the wire) which is called an induced magnetic field, which exhibits properties of the conductive material.\u0026#34;\u003c/p\u003e\u003cp\u003eCochrane said this works with planetary bodies as well. Moons or planets with enough internal heat can have a liquid saltwater ocean beneath the surface. These oceans are electrically conductive thanks to the salt in the water. Thus, scientists can use magnetometers to measure an induced magnetic field that \u0026#34;retains properties of the ocean,\u0026#34; Cochrane said. In other words, oceans can be found based on the magnetic fields they generate. \u003c/p\u003e\u003cp\u003eSince moons like Jupiter\u0026#39;s Callisto and Neptune\u0026#39;s Triton have very strong ionospheres, readings with a magnetometer become so noisy that researchers have trouble figuring out whether what they\u0026#39;re looking at is an ocean or just random noise from the extra energy in the ionosphere. That\u0026#39;s why researchers have been stuck on Callisto\u0026#39;s potential underground ocean for decades. \u003c/p\u003e\u003ch2\u003eThe next steps\u003c/h2\u003e\u003cp\u003eScience won\u0026#39;t have to wait another 30 years to find proof. \u003ca href=\"https://www.cnet.com/science/space/nasa-and-spacexs-jupiter-moon-mission-europa-clipper-lifts-off/\" target=\"_self\"\u003eNASA\u0026#39;s Europa Clipper mission set sail\u003c/a\u003e last year and should reach Jupiter and its moons in 2030, while the European Space Agency\u0026#39;s \u003ca href=\"https://www.cnet.com/science/space/esas-mission-to-find-life-near-jupiter-gets-set-for-april-launch/\" target=\"_self\"\u003eJUICE mission\u003c/a\u003e should arrive in 2031. Both missions will almost certainly provide more research data for Callisto. \u003c/p\u003e\u003cp\u003eIn terms of the information they\u0026#39;ll be collecting, Cochrane told us it\u0026#39;s not necessarily different data. Rather, it\u0026#39;s more data. \u003c/p\u003e\u003cp\u003e\u0026#34;Proving the existence of Callisto\u0026#39;s ocean from new measurements simply comes down to the fact that there are more measurements available to analyze,\u0026#34; Cochrane said. \u0026#34;For every flyby that occurs for each of these missions, only a very small snapshot in time of the magnetic field environment is captured by the magnetometer.\u0026#34;\u003c/p\u003e\u003cp\u003eCochrane said the data from the Europe Clipper and JUICE missions will help \u0026#34;fill in the holes\u0026#34; from the Galileo mission, hopefully letting researchers finally prove whether an ocean exists on Callisto. The extra data will also help researchers estimate how thick Callisto\u0026#39;s ocean layer is, as well as the thickness of the ice shell that rests on top of it. \u003c/p\u003e\u003ch2\u003eCould there be life on Callisto?\u003c/h2\u003e\u003cp\u003eNASA and the European Space Agency wouldn\u0026#39;t have sent missions to Jupiter without good reasons to do so. And one is this: \u003ca href=\"https://www.cnet.com/science/signs-of-europa-space-geyser-seen-in-decades-old-nasa-galileo-jupiter-data/\" target=\"_self\"\u003eEuropa\u0026#39;s hidden waters are the front-runner\u003c/a\u003e for extraterrestrial life. \u003c/p\u003e\u003cp\u003e\u0026#34;It is possible that Europa\u0026#39;s ocean can support life because we know that it hosts the key ingredients to support it, those being water, essential chemical elements, and energy (e.g. heat source from within) over a time span long enough for life to evolve,\u0026#34; Cochrane said. \u0026#34;Europa Clipper is actually a habitability mission (not to be confused with life detection) which will provide the data required to better help us answer this question. Until that time, it\u0026#39;s hard to comment on whether it is probable.\u0026#34;\u003c/p\u003e\u003cp\u003eBut there\u0026#39;s a growing case for life on Callisto. It has \u003ca href=\"https://www.cnet.com/science/space/jupiters-moon-callisto-has-a-whole-lot-of-oxygen-scientists-struggle-to-explain/\" target=\"_self\"\u003ea surprising amount of oxygen\u003c/a\u003e, and no one can figure out where most of it came from. Pair that with the increasing likelihood of a subsurface ocean, and though it\u0026#39;s still far from a sure thing, that\u0026#39;s enough evidence to justify taking a closer look at the Jupiter moon when the missions arrive in 2030 and 2031. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-13T23:36:00Z",
  "modifiedTime": null
}
