{
  "id": "567e3c99-6288-4db4-90dc-643239da8a48",
  "title": "Why Is Disney Burying Snow White?",
  "link": "https://gizmodo.com/why-is-disney-burying-snow-white-2000574472",
  "description": "As Disney looks to stage a diminished premiere for its latest live-action adaptation, it marks the end of a long and winding road of the studio's similarly long-and-winding lack of confidence in the film.",
  "author": "Sabina Graves",
  "published": "Tue, 11 Mar 2025 23:20:55 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "disney",
    "Rachel Zegler",
    "Snow White"
  ],
  "byline": "Sabina Graves",
  "length": 7123,
  "excerpt": "As Disney looks to stage a diminished premiere for its latest live-action adaptation, it marks the end of a long and winding road of the studio's similarly long-and-winding lack of confidence in the film.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "When Disney has a new live-action adaptation on the way, it’s usually accompanied by a live performance in front of a Disney castle, with the newest live-action princess singing their respective iconic song for an audience of fans. It’s what was gorgeously done for The Little Mermaid‘s Halle Bailey, but as the release date for Snow White gets closer, it would appear at least stateside that star Rachel Zegler is not getting the same treatment. It’s the latest in a long line of changes Disney has made with its approach to Snow White. Zegler, who is playing the first fairytale heroine who helped build the company—and who was plucked into the limelight by Steven Spielberg for West Side Story, with a voice that was meant for a Disney Princess—will apparently not be getting her big Hollywood premiere, either. A report from Variety revealed that after the film’s Japan stop, which was filled with magical performances by the actress and her dub counterparts, the Hollywood premiere will lock out journalists and will be more of a scaled-down event. “The afternoon festivities will include a pre-party and screening at the El Capitan Theatre with titular star Rachel Zegler and Gal Gadot, who plays the Evil Queen, expected to attend. However, the red carpet will not include the dozens of media outlets usually invited by Disney to interview the cast and creatives at its premieres,” the trade reported. “Instead, coverage will be limited to photographers and a house crew.” The theme of people rising to stand up for each another appears to be a main plot point in the Snow White adaptation, which also brings in another concern about the film. Could Disney possibly be hiding to play it safe amid the current political climate in the U.S., with conservatives easily alarmed by anything perceived to be too “woke”? Is standing up against tyranny through kindness for one another, no matter our backgrounds, too “negative” to publicly endorse? It’s beginning to feel like just another thing Disney has rolled back on to capitulate to conservatives, not unlike Pixar’s Win or Lose trans storyline erasure. We’ve seen Disney carefully allow Zegler to participate in pre-planned interviews where she’s described those Snow White fans—the ones who reacted in very clearly racist and bigoted ways to some of her early, PR-approved talking points about the new film differing from the original’s outdated story. She continued to face ire after sharing her valid reaction to Trump’s election, something that she later apologized for. The scaled-back premiere feels like way for Disney to avoid even more public scrutiny, especially considering the political controversy surrounding the stars of the film, including Gadot’s support for Israel and Zegler’s support for Palestine. Politics aside, Snow White hasn’t been without other controversies, including both backlash to the film’s approach to the seven dwarfs and Zegler’s own casting. The change to have CG dwarfs over human actors was due in part to Game of Thrones actor Peter Dinklage advocating for Disney to step away from stereotypical depictions on a podcast with Marc Maron back in 2022. He praised Disney for casting a Latina as Snow White but added, “You’re progressive in one way and you’re still making that f***ing backward story about seven dwarfs living in a cave together, what the f*** are you doing, man?” And the hair, well let’s just say if a woman was directing the film, that hair would not look like Lord Farquaad’s—but since it does, the internet has gleefully ganged up on Zegler over it. Again, if the movie is bad that’s not the lead’s fault; she has no creative say, but it’s she who’s been subject to that backlash, itself carrying a racial undertone from conservative critics. This is the same Disney that stays radio silent whenever one of their major franchise players of color speaks out—like John Boyega, who took a stand after years of facing racism online for being Black leading man in Star Wars. I guess we’re adding Rachel Zegler to the list alongside Boyega and his fellow Star Wars veterans Kelly Marie Tran, Moses Ingram, Ahmed Best, and Amandla Stenberg. And yet Zegler, who’s had to shake off the hate from “passionate fans”, as she described them to Vogue, is being treated as a prop during a PR campaign where her voice should be celebrated for all the brown girls looking up to her. Girls who should most definitely not have those around them pushing to separate their families and villainizing marginalized identities as just “passionate.” The fault doesn’t just lie with Disney silence. Even culturally inspired films like Mufasa, which was a box office success, get heat from the same homogenous critical gazes on both sides of the spectrum, including those that the film might not have been made for. So instead of allowing a “mid” film shaped by intrusive studio-exec hands to take up space to build on by allowing more diverse voices to make and critique their art, it’s simply pushed out of the zeitgeist. And Snow White feels like that, more pomp and circumstance internationally to bank on the Snow White IP in other markets that simply wouldn’t necessarily care to reject a movie based on the actors’ politics or race. However the film performs even with Disney’s seeming hesitance to show it off remains to be seen—its prior live-action remakes, for better or worse, have often weathered critical tepidness to achieve box office success. But just as it was with the reaction to Halle Berry’s Little Mermaid, to the audience in America who Zegler’s time in the Disney spotlight matters, this apprehension on Disney’s part feels like a letdown. Speaking as a Latina writer with a daughter, it’s a shame that our closest representation on screen doesn’t appear to be having the moment she deserves. Where’s her Disney Parks counterpart? The movie is just days away and there’s hardly any merchandise. Wicked‘s merch game started months before the release—and that film, starring a Black Elphaba, was a massive hit. It’s so wild that for a Latina Snow White, we’re all of a sudden expected to accept this subdued of an effort. Meanwhile, the Latino audience makes up a powerful wing of the broader moviegoer market, according to a recent UCLA Hollywood Diversity report— “Among young female moviegoers, women of color, particularly Latinas, are key to driving ticket sales”—but it seems Disney is all too eager to ignore them. And yet, if Snow White doesn’t match Disney’s financial expectations, it’ll be those audiences, or talent like Zegler, who are blamed rather than the studio that’s been seemingly setting it up for failure. Is Disney too scared to stand on its choices once an anti-DEI leader gets in office? The decline in diversity on film, or rather not standing by casting and creative choices, speaks to taking a step forward but two steps back—clearly a feature, not a bug, at Disney. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/03/Snow-White-Walt-Disney-Pictures-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eWhen Disney has a new live-action adaptation on the way, it’s usually accompanied by a live performance in front of a Disney castle, with the newest live-action princess singing their respective iconic song for an audience of fans. It’s what was gorgeously done for \u003cem\u003eThe Little Mermaid\u003c/em\u003e‘s Halle Bailey, but as the release date for \u003ca href=\"https://gizmodo.com/the-most-exciting-details-and-easter-eggs-we-noticed-in-snow-whites-music-videos-2000572226\"\u003e\u003cem\u003eSnow White\u003c/em\u003e\u003c/a\u003e gets closer, it would appear at least stateside that star \u003ca href=\"https://gizmodo.com/snow-whites-first-full-song-solidifies-rachel-zegler-as-a-disney-princess-2000571727\"\u003eRachel Zegler\u003c/a\u003e is not getting the same treatment. It’s the latest in a long line of changes Disney has made with its approach to \u003cem\u003eSnow White\u003c/em\u003e.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://gizmodo.com/can-snow-white-learn-from-wickeds-success-2000566641\"\u003eZegler, who is playing the first fairytale heroine\u003c/a\u003e who helped build the company—and who was plucked into the limelight by Steven Spielberg for \u003cem\u003eWest Side Story\u003c/em\u003e, with a voice that was meant for a Disney Princess—will apparently not be getting her big Hollywood premiere, either. A report from \u003ca href=\"https://variety.com/2025/film/columns/disney-snow-white-premiere-zegler-gadot-controversies-1236333285/\"\u003eVariety\u003c/a\u003e revealed that after the film’s Japan stop, which was filled with magical performances by the actress and her dub counterparts, the Hollywood premiere will lock out journalists and will be more of a scaled-down event.\u003c/p\u003e \u003cp\u003e“The afternoon festivities will include a pre-party and screening at the El Capitan Theatre with titular star Rachel Zegler and Gal Gadot, who plays the Evil Queen, expected to attend. However, the red carpet will not include the dozens of media outlets usually invited by Disney to interview the cast and creatives at its premieres,” the trade reported. “Instead, coverage will be limited to photographers and a house crew.”\u003c/p\u003e \u003cp\u003eThe theme of people rising to stand up for each another appears to be a main plot point in the \u003cem\u003eSnow White\u003c/em\u003e adaptation, which also brings in another concern about the film. Could Disney possibly be hiding to play it safe amid the current political climate in the U.S., with conservatives easily alarmed by anything perceived to be too “woke”? Is standing up against tyranny through kindness for one another, no matter our backgrounds, too “negative” to publicly endorse?\u003c/p\u003e \u003cp\u003eIt’s beginning to feel like just another thing Disney has rolled back on to capitulate to conservatives, not unlike \u003ca href=\"https://gizmodo.com/pixars-upcoming-disney-show-win-or-lose-removed-a-transgender-storyline-2000540042\"\u003ePixar’s \u003cem\u003eWin or Lose\u003c/em\u003e trans storyline erasure\u003c/a\u003e. We’ve seen Disney carefully allow Zegler to participate in pre-planned interviews where she’s described\u003cem\u003e those\u003c/em\u003e Snow White fans—the ones who reacted in very clearly racist and bigoted ways to some of her early, PR-approved talking points about the new film differing from the original’s outdated story. She continued to face ire after sharing her valid reaction to Trump’s election, something that she later apologized for. The scaled-back premiere feels like way for Disney to avoid even more public scrutiny, especially considering the political controversy surrounding the stars of the film, including Gadot’s support for Israel and Zegler’s support for Palestine.\u003c/p\u003e\n\n \u003cp\u003ePolitics aside, \u003cem\u003eSnow White\u003c/em\u003e hasn’t been without other controversies, including both backlash to the film’s approach to the seven dwarfs and Zegler’s own casting. The change to have CG dwarfs over human actors was due in part to \u003cem\u003eGame of Thrones\u003c/em\u003e actor Peter Dinklage advocating for Disney to step away from stereotypical depictions on a \u003ca href=\"https://www.npr.org/2022/01/26/1075761231/peter-dinklage-disney\"\u003epodcast with Marc Maron back in 2022.\u003c/a\u003e He praised Disney for casting a Latina as Snow White but added, “You’re progressive in one way and you’re still making that f***ing backward story about seven dwarfs living in a cave together, what the f*** are you doing, man?”\u003c/p\u003e \u003cp\u003eAnd the hair, well let’s just say if a woman was directing the film, that hair would not look like Lord Farquaad’s—but since it does, the internet has gleefully ganged up on Zegler over it. Again, if the movie is bad that’s not the lead’s fault; she has no creative say, but it’s she who’s been subject to that backlash, itself carrying a racial undertone from conservative critics.\u003c/p\u003e\n\n \u003cp\u003eThis is the same Disney that stays radio silent whenever one of their \u003ca href=\"https://gizmodo.com/star-wars-racism-fandom-moses-ingram-obi-wan-kenobi-rev-1849040150\"\u003emajor franchise players of color speaks out—like John Boyega,\u003c/a\u003e who took a stand after years of facing racism online for being Black leading man in \u003cem\u003eStar Wars\u003c/em\u003e. I guess we’re adding Rachel Zegler to the list alongside Boyega and his fellow \u003cem\u003eStar Wars\u003c/em\u003e veterans Kelly Marie Tran, Moses Ingram, Ahmed Best, and Amandla Stenberg.\u003c/p\u003e \u003cp\u003eAnd yet Zegler, who’s had to shake off the hate from “passionate fans”, as she \u003ca href=\"https://www.vogue.mx/articulo/rachel-zegler-portada-vogue-marzo-2025\"\u003edescribed them to Vogue\u003c/a\u003e, is being treated as a prop during a PR campaign where her voice should be celebrated for all the brown girls looking up to her. Girls who should most definitely not have those around them pushing to separate their families and villainizing marginalized identities as just “passionate.”\u003c/p\u003e \u003cp\u003eThe fault doesn’t just lie with Disney silence. Even culturally inspired films like \u003cem\u003eMufasa\u003c/em\u003e, which was a box office success, get heat from the same homogenous critical gazes on both sides of the spectrum, including those that the film might not have been made for. So instead of allowing a “mid” film shaped by intrusive studio-exec hands to take up space to build on by allowing more diverse voices to make and critique their art, it’s simply pushed out of the zeitgeist. And\u003cem\u003e Snow White\u003c/em\u003e feels like that, more pomp and circumstance internationally to bank on the \u003cem\u003eSnow White\u003c/em\u003e IP in other markets that simply wouldn’t necessarily care to reject a movie based on the actors’ politics or race.\u003c/p\u003e\n\n \u003cp\u003eHowever the film performs even with Disney’s seeming hesitance to show it off remains to be seen—its prior live-action remakes, for better or worse, have often weathered critical tepidness to achieve box office success. But just as it was with the reaction to Halle Berry’s \u003cem\u003eLittle Mermaid\u003c/em\u003e, to the audience in America who Zegler’s time in the Disney spotlight matters, this apprehension on Disney’s part feels like a letdown. Speaking as a Latina writer with a daughter, it’s a shame that our closest representation on screen doesn’t appear to be having the moment she deserves. Where’s her Disney Parks counterpart? The movie is just days away and there’s hardly any merchandise. \u003cem\u003eWicked\u003c/em\u003e‘s merch game started months before the release—and that film, starring a Black Elphaba, was a massive hit. It’s so wild that for a Latina Snow White, we’re all of a sudden expected to accept this subdued of an effort.\u003c/p\u003e \u003cp\u003eMeanwhile, the Latino audience makes up a powerful wing of the broader moviegoer market, according to a recent \u003ca href=\"https://socialsciences.ucla.edu/2025/02/27/hollywood-diversity-report-2025-part-1-theatrical/\"\u003eUCLA Hollywood Diversity\u003c/a\u003e report— “Among young female moviegoers, women of color, particularly Latinas, are key to driving ticket sales”—but it seems Disney is all too eager to ignore them. And yet, if \u003cem\u003eSnow White\u003c/em\u003e doesn’t match Disney’s financial expectations, it’ll be those audiences, or talent like Zegler, who are blamed rather than the studio that’s been seemingly setting it up for failure. Is Disney too scared to stand on its choices once an anti-DEI leader gets in office? The decline in diversity on film, or rather not standing by casting and creative choices, speaks to taking a step forward but two steps back—clearly a feature, not a bug, at Disney.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-11T23:20:55Z",
  "modifiedTime": "2025-03-11T23:20:55Z"
}
