{
  "id": "59fc9ed5-501e-4e45-b9d4-f3eb05c6e99a",
  "title": "These sensors ‘listen with light’ to guard Europe from subsea sabotage",
  "link": "https://thenextweb.com/news/startups-sensors-optics11-light-europe-seabed-sabotage",
  "description": "Dutch tech scaleup Optics11 has launched an underwater monitoring system that uses light waves to “listen” for the presence of foreign objects. Called OptiBarrier, the system can detect enemy submarines, drones, and surface vessels from up to 150km away — without revealing its own position. “We listen with light,” the company’s CEO, Paul Heiden, told TNW. “That means our technology is entirely undetectable and can’t be jammed.”  The standard method for listening underwater is through electromagnetic fields. Devices emit electromagnetic pulses and detect the presence of an object, such as a ship or submarine, based on the waves that bounce…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Tue, 24 Jun 2025 12:28:58 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Deep tech",
    "Tech"
  ],
  "byline": "Siôn Geschwindt",
  "length": 2723,
  "excerpt": "The system can detect enemy submarines, drones, and surface vessels from up to 150km away — without revealing its own position.",
  "siteName": "TNW | Deep-Tech",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "Dutch tech scaleup Optics11 has launched an underwater monitoring system that uses light waves to “listen” for the presence of foreign objects. Called OptiBarrier, the system can detect enemy submarines, drones, and surface vessels from up to 150km away — without revealing its own position. “We listen with light,” the company’s CEO, Paul Heiden, told TNW. “That means our technology is entirely undetectable and can’t be jammed.”  The standard method for listening underwater is through electromagnetic fields. Devices emit electromagnetic pulses and detect the presence of an object, such as a ship or submarine, based on the waves that bounce back. That works, but it’s detectable to enemy vessels and can be jammed.  OptiBarrier takes a different approach. Sound waves — such as those from a passing ship or submarine — cause tiny pressure changes in the underwater fibre optic sensors, altering how the light moves.  These minute changes are transmitted via cable to land. There, specialised software interprets the disturbances, turning photonic pulses into meaningful acoustic data.  According to Heiden, the system automatically compares the noise to an extensive military database of vessel sounds. “From the sound pattern alone, we can often tell what kind of ship is approaching. In some cases, we can identify the exact make and model,” he said.  That level of intelligence could give navies and coastal authorities a major tactical advantage, offering early warnings of approaching threats while remaining invisible to the enemy.  OptiBarrier has already been tested at the Seabed Security Experimentation Centre (SeaSEC) in The Hague, Netherlands. The company plans to roll it out in Europe first, but is hush-hush about the timeline. The system launches amid growing concerns over maritime security. Since Russia’s full-scale invasion of Ukraine in 2022, fears have intensified over the vulnerability of subsea infrastructure such as subsea cables, offshore wind farms, and gas pipelines.  The war and broader geopolitical tensions are pushing European governments to invest in maritime defence tech, including deploying autonomous ocean surveillance drones and building new submarines.  Optics11 has also developed a second product, OptiArray, tailored specifically for submarines and underwater drones. Using the same fibre optic technology, this version is designed not for the seafloor but as an antenna mounted directly on the vessel’s exterior. It allows these underwater vehicles to detect nearby threats while remaining completely undetectable themselves.  The Royal Netherlands Navy is already testing OptiArray, and plans to integrate it into its new class of submarines, set for roll-out in 2032.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F06%2Foptibarrier-optics11-.jpg\u0026signature=2730d25ee6eb631a39b9e4b2ac4eae61",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eDutch tech scaleup Optics11 has launched an underwater monitoring system that uses light waves to “listen” for the presence of foreign objects.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eCalled OptiBarrier, the system can detect enemy submarines, drones, and surface vessels from up to 150km away — without revealing its own position.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“We listen with light,” the company’s CEO, Paul Heiden, told TNW. “That means our technology is entirely undetectable and can’t be jammed.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe standard method for listening underwater is through electromagnetic fields. Devices emit electromagnetic pulses and detect the presence of an object, such as a ship or submarine, based on the waves that bounce back. That works, but it’s detectable to enemy vessels and can be jammed. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOptiBarrier takes a different approach. Sound waves — such as those from a passing ship or submarine — cause tiny pressure changes in the underwater fibre optic sensors, altering how the light moves. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThese minute changes are transmitted via cable to land. There, specialised software interprets the disturbances, turning photonic pulses into meaningful acoustic data. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAccording to Heiden, the system automatically compares the noise to an extensive military database of vessel sounds. “From the sound pattern alone, we can often tell what kind of ship is approaching. In some cases, we can identify the exact make and model,” he said. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThat level of intelligence could give navies and coastal authorities a major tactical advantage, offering early warnings of approaching threats while remaining invisible to the enemy. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOptiBarrier has already been tested at the Seabed Security Experimentation Centre (SeaSEC) in The Hague, Netherlands. The company plans to roll it out in Europe first, but is hush-hush about the timeline.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe system launches amid growing concerns over maritime security. \u003c/span\u003e\u003cspan\u003eSince Russia’s full-scale invasion of Ukraine in 2022, fears have intensified over the vulnerability of subsea infrastructure such as subsea cables, offshore wind farms, and gas pipelines. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe war and broader geopolitical tensions are pushing European governments to invest in maritime defence tech, including deploying autonomous ocean \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/helsings-ai-submarine-lura-europe-ocean-drone-defence\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003esurveillance drones\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e and building \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/rolls-royce-lands-record-nuclear-submarine-contract\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003enew submarines\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOptics11 has also developed a second product, OptiArray, tailored specifically for submarines and underwater drones. Using the same fibre optic technology, this version is designed not for the seafloor but as an antenna mounted directly on the vessel’s exterior. It allows these underwater vehicles to detect nearby threats while remaining completely undetectable themselves. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe Royal Netherlands Navy is already testing \u003c/span\u003e\u003cspan\u003eOptiArray\u003c/span\u003e\u003cspan\u003e, and plans to integrate it into its new class of submarines, set for roll-out in 2032.  \u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-24T12:28:58Z",
  "modifiedTime": "2025-06-24T12:28:58Z"
}
