{
  "id": "5f7f4d1b-b88e-42c4-9ba6-57c86c5ee30f",
  "title": "ChatGPT Will Soon Remember Everything You've Ever Told It",
  "link": "https://lifehacker.com/tech/chatgpt-memory-remembers-everything-youve-said?utm_medium=RSS",
  "description": "A chatbot never forgets.",
  "author": "Jake Peterson",
  "published": "Thu, 10 Apr 2025 20:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "AI"
  ],
  "byline": "Jake Peterson",
  "length": 7640,
  "excerpt": "A chatbot never forgets.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Credit: Tada Images/Shutterstock Be careful what you share with ChatGPT these days: It'll remember everything you say. That's because OpenAI is rolling out a new update to ChatGPT's memory that allows the bot to access the contents of all of your previous chats. The idea is that by pulling from your past conversations, ChatGPT will be able to offer more relevant results to your questions, queries, and overall discussions. Sam Altman, CEO of OpenAI, announced the changes on X, touting the usefulness of AI systems that know everything about you: This Tweet is currently unavailable. It might be loading or has been removed. ChatGPT's memory feature is a little over a year old at this point, but its function has been much more limited than the update OpenAI is rolling out today. ChatGPT could remember preferences or requests of yours—perhaps you have a favorite formatting style for summaries, or a nickname you want the bot to call you—and carry those memories along from chat to chat. However, it wasn't perfect, and couldn't naturally pull from past conversations, as a feature like \"memory\" might imply.Previously, the bot stored those data points in a bank of \"saved memories.\" You could access this memory bank at any time and see what the bot had stored based on your conversations. It's a bit weird to see these entries when you didn't specifically ask ChatGPT to remember something for you—as if you found out a new friend was jotting down \"useful facts\" about you from past conversations. It's weird. As this feature is rolling out now, it isn't clear yet how it will affect these saved memories. In all likelihood, they'll disappear, as there's no need for a bank of specific memories when ChatGPT can simply pull from everything you've ever said to the bot. I don't personally use ChatGPT all that much outside testing new features to cover here, so I can't say whether I find this feature particularly useful or not. I can imagine how it might be helpful to be able to reference something you told the bot in a past conversation, especially without needing to establish the bot actually remembers that fact first, but I also don't love the idea of a chatbot \"remembering\" everything I've ever told it. Maybe that's because I'm not sold on the idea of generative AI as a personal assistant, or maybe it's because I'm sick of tech companies scooping so much of my data. We'll just have to see how useful this expanded memory turns out to be as users get their hands on it. This feature will roll out first to ChatGPT Plus and Pro subscribers, but there's no word at this time as to when free users can expect to try it out. Users in the U.K., EU, Iceland, Liechtenstein, Norway, and Switzerland will need to wait to use the feature as well, as local laws force extra reviews before it can launch. (Maybe all countries should force AI companies through extra reviews before shipping features.) What do you think so far? How to disable ChatGPT's memoryIf you, like me, have reservations about your chatbot accessing every word of your past conversations, there is a way to disable this memory feature. I don't have the new feature yet, so it's possible this might change slightly. But at the moment, you can head to Settings \u003e Personalization \u003e Memory, then disable the toggle next to Reference saved memories. If you want to keep the memory feature on, but don't want ChatGPT to remember one chat in particular, you can launch a \"temporary chat\" to make sure the conversation is quarantined. (Just know OpenAI may still hold onto the transcript for up to 30 days.) Jake Peterson Senior Technology Editor Jake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026 TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut. Read Jake's full bio Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better. Our Mission Our Team Newsletter © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED. Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate any affiliation or the endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.",
  "image": "https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_1248x702.v1744315022.jpg\" alt=\"chatgpt icon on iphone\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_400x225.v1744315022.jpg 400w, https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_800x450.v1744315022.jpg 800w, https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_1248x702.v1744315022.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Tada Images/Shutterstock\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eBe careful what you share with ChatGPT these days: It\u0026#39;ll remember everything you say. \u003c/p\u003e\u003cp\u003eThat\u0026#39;s because OpenAI is rolling out a new update to ChatGPT\u0026#39;s memory that allows the bot to access the contents of all of your previous chats. The idea is that by pulling from your past conversations, ChatGPT will be able to offer more relevant results to your questions, queries, and overall discussions. Sam Altman, CEO of OpenAI, \u003ca href=\"https://x.com/sama/status/1910380643772665873\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eannounced the changes on X\u003c/a\u003e, touting the usefulness of AI systems that know everything about you:\u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/sama/status/1910380643772665873\" title=\"open in a new window\" target=\"_blank\" rel=\"noopener\"\u003e\n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eChatGPT\u0026#39;s memory feature is \u003ca href=\"https://lifehacker.com/tech/chatgpt-is-getting-long-term-memory\" target=\"_blank\"\u003ea little over a year old at this point\u003c/a\u003e, but its function has been much more limited than the update OpenAI is rolling out today. ChatGPT could remember preferences or requests of yours—perhaps you have a favorite formatting style for summaries, or a nickname you want the bot to call you—and carry those memories along from chat to chat. However, it wasn\u0026#39;t perfect, and couldn\u0026#39;t naturally pull from past conversations, as a feature like \u0026#34;memory\u0026#34; might imply.\u003c/p\u003e\u003cp\u003ePreviously, the bot stored those data points in a bank of \u0026#34;saved memories.\u0026#34; You could access this memory bank at any time and see what the bot had stored based on your conversations. It\u0026#39;s a bit weird to see these entries when you didn\u0026#39;t specifically ask ChatGPT to remember something for you—as if you found out a new friend was jotting down \u0026#34;useful facts\u0026#34; about you from past conversations. It\u0026#39;s weird.  \u003c/p\u003e\u003cp\u003eAs this feature is rolling out now, it isn\u0026#39;t clear yet how it will affect these saved memories. In all likelihood, they\u0026#39;ll disappear, as there\u0026#39;s no need for a bank of specific memories when ChatGPT can simply pull from everything you\u0026#39;ve ever said to the bot.  \u003c/p\u003e\u003cp\u003eI don\u0026#39;t personally use ChatGPT all that much outside testing new features to cover here, so I can\u0026#39;t say whether I find this feature particularly useful or not. I can imagine how it might be helpful to be able to reference something you told the bot in a past conversation, especially without needing to establish the bot actually remembers that fact first, but I also don\u0026#39;t love the idea of a chatbot \u0026#34;remembering\u0026#34; \u003cem\u003eeverything\u003c/em\u003e I\u0026#39;ve ever told it. Maybe that\u0026#39;s because I\u0026#39;m not sold on the idea of generative AI as a personal assistant, or maybe it\u0026#39;s because I\u0026#39;m sick of tech companies scooping so much of my data. We\u0026#39;ll just have to see how useful this expanded memory turns out to be as users get their hands on it. \u003c/p\u003e\u003cp\u003eThis feature \u003ca href=\"https://techcrunch.com/2025/04/10/openai-updates-chatgpt-to-reference-your-other-chats/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ewill roll out first to ChatGPT Plus and Pro subscribers\u003c/a\u003e, but there\u0026#39;s no word at this time as to when free users can expect to try it out. Users in the U.K., EU, Iceland, Liechtenstein, Norway, and Switzerland will need to wait to use the feature as well, as local laws force extra reviews before it can launch. (Maybe all countries should force AI companies through extra reviews before shipping features.) \u003c/p\u003e\u003cdiv x-cloak=\"\" x-data=\"{ commentsCount: null }\" x-init=\"commentsCount = await window.openweb.getMessagesCount(01JRGHJ1GA4K6X2VYXMKMS7XC4)\" x-show=\"commentsCount !== null \u0026amp;\u0026amp; commentsCount \u0026gt; 0\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003eWhat do you think so far? \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003ch2 id=\"how-to-disable-chatgpts-memory\"\u003eHow to disable ChatGPT\u0026#39;s memory\u003c/h2\u003e\u003cp\u003eIf you, like me, have reservations about your chatbot accessing every word of your past conversations, there is a way to disable this memory feature. \u003c/p\u003e\u003cp\u003eI don\u0026#39;t have the new feature yet, so it\u0026#39;s possible this might change slightly. But at the moment, you can head to \u003cstrong\u003eSettings \u0026gt; Personalization \u0026gt; Memory\u003c/strong\u003e, then disable the toggle next to \u003cstrong\u003eReference saved memories\u003c/strong\u003e.  \u003c/p\u003e\u003cp\u003eIf you want to keep the memory feature on, but don\u0026#39;t want ChatGPT to remember one chat in particular, you can launch a \u0026#34;temporary chat\u0026#34; to make sure the conversation is quarantined. (Just know OpenAI may still hold onto the transcript for up to 30 days.) \u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBCM600PS5NXSJXJA1AKJ/image.fill.size_150x150.v1704301306.png\" alt=\"artist rendition of Jake Peterson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eJake Peterson\u003c/p\u003e\n                                    \u003cp\u003eSenior Technology Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026amp; TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the \u003ca href=\"https://lifehacker.com/tech/living-with-ai\" target=\"_blank\"\u003ebest uses of AI in your daily life\u003c/a\u003e to \u003ca href=\"https://lifehacker.com/okay-which-macbook-should-you-buy-1849330413\" target=\"_blank\"\u003ewhich MacBook to buy\u003c/a\u003e. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/jakepeterson\"\u003eRead Jake\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                                                                            \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#dab0aabfaebfa8a9b5b49ab6b3bcbfb2bbb9b1bfa8f4b9b5b7\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Jake an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"WhatsApp Just Announced a Dozen New Features\" href=\"https://lifehacker.com/tech/whatsapp-just-announced-a-bunch-of-new-features\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JRG57FHRQBHTYRJW4FWGHGHY/hero-image.fill.size_75x75.v1744303041.jpg\" alt=\"whatsapp icon on iphone\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"Why You Shouldn’t ‘Panic Buy’ in the Face of Tariffs\" href=\"https://lifehacker.com/tech/should-you-buy-new-tech-before-tariffs-raise-prices\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JRDRMXWV3V24A258DFPW1RAB/hero-image.fill.size_75x75.v1744229722.png\" alt=\"Row of iPhones in an Apple store\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n\n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003cdiv data-ga-module=\"footer-nav\" data-ga-action=\"footer-nav-link\"\u003e\n\n        \n        \u003cdiv role=\"region\" aria-label=\"Our Mission \u0026amp; Social Network\"\u003e\n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-element=\"nav-logo\" data-ga-action=\"nav-logo\" data-ga-item=\"logo\" href=\"https://lifehacker.com\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/images/lifehacker-logo.svg\" alt=\"Lifehacker Logo\" loading=\"lazy\" width=\"256\" height=\"71\"/\u003e\n                \u003c/a\u003e\u003c/p\u003e\u003cp\u003eLifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \u003c/p\u003e\n                \u003cdiv data-ga-element=\"social-link\" data-ga-action=\"social-link\" data-ga-item=\"title\"\u003e\n                    \u003cul\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/our-mission\" aria-label=\"Our Mission\"\u003eOur Mission\u003c/a\u003e\u003c/li\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/our-team\" aria-label=\"Our Team\"\u003eOur Team\u003c/a\u003e\u003c/li\u003e\n                        \u003cli\u003e\u003ca data-ga-click=\"\" data-ga-label=\"$text\" href=\"https://lifehacker.com/newsletters\" aria-label=\"Newsletter\"\u003eNewsletter\u003c/a\u003e\u003c/li\u003e\n                    \u003c/ul\u003e\n                    \u003cul\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"facebook\" href=\"https://facebook.com/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-facebook\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"twitter\" href=\"https://twitter.com/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-twitter\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"instagram\" href=\"https://instagram.com/lifehackerdotcom\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-instagram\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                        \u003cli\u003e\n                            \u003ca data-ga-click=\"\" data-ga-label=\"youtube\" href=\"https://www.youtube.com/user/lifehacker\" title=\"(opens in a new window)\" rel=\"noopener\" target=\"_blank\"\u003e\n                                \u003csvg\u003e\n                                    \u003cuse href=\"/images/icons/spritemap.svg#sprite-social-youtube\"\u003e\u003c/use\u003e\n                                \u003c/svg\u003e\n                            \u003c/a\u003e\n                        \u003c/li\u003e\n                    \u003c/ul\u003e\n                \u003c/div\u003e\n            \u003c/div\u003e\n\n        \n        \u003cdiv data-ga-element=\"zd-copyright\" data-ga-action=\"zd-copyright\" data-ga-item=\"title\" role=\"region\" aria-label=\"Ziff Davis Copyright\"\u003e\n                \u003cp\u003e© 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. \u003cspan\u003eALL RIGHTS RESERVED.\u003c/span\u003e\u003c/p\u003e\n                \u003cp\u003eLifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee \u003cspan\u003eby that merchant.\u003c/span\u003e\u003c/p\u003e\n            \u003c/div\u003e\n\n        \n        \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-10T20:30:00Z",
  "modifiedTime": "2025-04-10T20:30:00Z"
}
