{
  "id": "691e4d72-bbcc-45ae-aebd-8209b046f739",
  "title": "Meta Apps Have Been Covertly Tracking Android Users' Web Activity for Months",
  "link": "https://lifehacker.com/tech/meta-apps-have-been-covertly-tracking-android-users-web-activity-for-months?utm_medium=RSS",
  "description": "The Russian company Yandex has been doing it for years.",
  "author": "Jake Peterson",
  "published": "Wed, 04 Jun 2025 20:56:52 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Privacy"
  ],
  "byline": "Jake Peterson",
  "length": 4984,
  "excerpt": "The Russian company Yandex has been doing it for years.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Credit: Bloomberg via Getty Images I don't expect Meta to respect my data or my privacy, but the company continues to surprise me with how low they're willing to go in the name of data collection. The latest such story comes to us from a report titled \"Disclosure: Covert Web-to-App Tracking via Localhost on Android.\" In short, Meta and Yandex (a Russian technology company) have been tracking potentially billions of Android users by abusing a security loophole in Android. That loophole allows the companies to access identifying browsing data from your web browser as long as you have their Android apps installed. How does this tracking work?As the report explains, Android allows any installed app with internet permissions to access the \"loopback address\" or localhost, an address a device uses to communicate with itself. As it happens, your web browser also has access to the localhost, which allows JavaScripts embedded on certain websites to connect to Android apps and share browsing data and identifiers.What are those JavaScripts, you might ask? In this case, that's Meta Pixel and Yandex Metrica, scripts that let companies track users on their sites. Trackers are an unfortunate part of the modern internet, but Meta Pixel is only supposed to be able to follow you while you browse the web. This loop lets Meta Pixel scripts send your browsing data, cookies, and identifiers back to installed Meta apps like Facebook and Instagram. The same goes for Yandex with its apps like Maps and Browser.You certainly didn't sign up for that when you installed Instagram on your Android device. But once you logged in, the next time you visited a website that embedded Meta Pixel, the script beamed your information back to the app. All of a sudden, Meta had identifying browsing data from your web activity, not via the browsing itself, but from the \"unrelated\" Instagram app. Chrome, Firefox, and Edge were all affected in these findings. DuckDuckGo blocked some but not all of the domains here, so it was \"minimally affected.\" Brave does block requests to the localhost if you don't consent to it, so it did successfully protect users from this tracking.Researchers say Yandex has been doing this since February of 2017 on HTTP sites, and May of 2018 on HTTPS sites. Meta Pixel, on the other hand, hasn't been tracking this way for long: It only started September of 2024 for HTTP, and ended that practice in October. It started via Websocket and WebRTC STUN in November, and WebRTC TURN in May. Website owners apparently complained to Meta starting in September, asking why Meta Pixel communicates with the localhost. As far as researchers could find, Meta never responded. What do you think so far? Researchers make it clear that the type of tracking is possible on iOS, as developers can establish localhost connections and apps can \"listen in\" too. However, they found no evidence of this tracking on iOS devices, and hypothesize that it has to do with how iOS restricts native apps running in the background.The good news is, as of June 3, researchers say they have not observed Meta Pixel communicating with the localhost. They didn't say the same for Yandex Metrika, though Yandex told Ars Technica it was \"discontinuing the practice.\" Ars Technica also reports that Google has opened an investigation into these actions that \"blatantly violate our security and privacy principles.\"However, even if Meta has stopped this tracking following the report, the damage could be widespread. As highlighted in the report, estimates put Meta Pixel adoption anywhere from 2.4 million to 5.8 million sites. From here, researchers found that just over 17,000 Meta Pixel sites in the U.S. attempt to connect to the localhost, and over 78% of those do so without any user consent needed, including sites like AP News, Buzzfeed, and The Verge. That's a lot of websites that could have been sending your data back to your Facebook and Instagram apps. The report features a tool that you can use to look for affected sites, but notes the list is not exhaustive, and absence doesn't mean the site is safe.Meta sent me the following statement in response to my request for comment: “We are in discussions with Google to address a potential miscommunication regarding the application of their policies. Upon becoming aware of the concerns, we decided to pause the feature while we work with Google to resolve the issue.” The Download Never miss a tech story Jake Peterson Get the latest tech news, reviews, and advice from Jake and the team. The Download Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.",
  "image": "https://lifehacker.com/imagery/articles/01JWY7H556BG93MV6ZG6SKFFHM/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\" data-seamless-scroll-item=\"\" data-status=\"loaded\" data-content-slug=\"meta-apps-have-been-covertly-tracking-android-users-web-activity-for-months\" data-content-qualified-slug=\"/tech/meta-apps-have-been-covertly-tracking-android-users-web-activity-for-months\" data-content-toc-items=\"[{\u0026#34;text\u0026#34;:\u0026#34;How does this tracking work?\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;how-does-this-tracking-work\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;Meta has officially stopped this tracking \u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;meta-has-officially-stopped-this-tracking\u0026#34;}]\" data-max-scrolled-percentage=\"0\" data-index=\"0\" data-ga-module=\"content-body\"\u003e\n        \n\n        \u003cdiv\u003e\n    \n\n    \n            \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JWY7H556BG93MV6ZG6SKFFHM/hero-image.fill.size_1248x702.v1749070321.png\" alt=\"sign outside of Meta Platforms Headquarters\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JWY7H556BG93MV6ZG6SKFFHM/hero-image.fill.size_400x225.v1749070321.png 400w, https://lifehacker.com/imagery/articles/01JWY7H556BG93MV6ZG6SKFFHM/hero-image.fill.size_800x450.v1749070321.png 800w, https://lifehacker.com/imagery/articles/01JWY7H556BG93MV6ZG6SKFFHM/hero-image.fill.size_1248x702.v1749070321.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: Bloomberg via Getty Images\u003c/span\u003e\n                            \u003c/p\u003e\n            \n            \n    \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eI don\u0026#39;t expect Meta to respect my data or my privacy, but the company continues to surprise me with how low they\u0026#39;re willing to go in the name of data collection. The latest such story comes to us from \u003ca href=\"https://localmess.github.io/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ea report\u003c/a\u003e titled \u0026#34;Disclosure: Covert Web-to-App Tracking via Localhost on Android.\u0026#34; In short, Meta and Yandex (a Russian technology company) have been tracking potentially billions of Android users by abusing a security loophole in Android. That loophole allows the companies to access identifying browsing data from your web browser as long as you have their Android apps installed. \u003c/p\u003e\u003ch2 id=\"how-does-this-tracking-work\"\u003eHow does this tracking work?\u003c/h2\u003e\u003cp\u003eAs the report explains, Android allows any installed app with internet permissions to access the \u0026#34;\u003ca href=\"https://www.hostwinds.com/blog/loopback-address\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eloopback address\u003c/a\u003e\u0026#34; or localhost, an address a device uses to communicate with itself. As it happens, your web browser also has access to the localhost, which allows JavaScripts embedded on certain websites to connect to Android apps and share browsing data and identifiers.\u003c/p\u003e\u003cp\u003eWhat are those JavaScripts, you might ask? In this case, that\u0026#39;s Meta Pixel and Yandex Metrica, scripts that let companies track users on their sites. Trackers are an unfortunate part of the modern internet, but Meta Pixel is only supposed to be able to follow you while you browse the web. This loop lets Meta Pixel scripts send your browsing data, cookies, and identifiers back to installed Meta apps like Facebook and Instagram. The same goes for Yandex with its apps like Maps and Browser.\u003c/p\u003e\u003cp\u003eYou certainly didn\u0026#39;t sign up for that when you installed Instagram on your Android device. But once you logged in, the next time you visited a website that embedded Meta Pixel, the script beamed your information back to the app. All of a sudden, Meta had identifying browsing data from your web activity, not via the browsing itself, but from the \u0026#34;unrelated\u0026#34; Instagram app.  \u003c/p\u003e\u003cp\u003eChrome, Firefox, and Edge were all affected in these findings. DuckDuckGo blocked some but not all of the domains here, so it was \u0026#34;minimally affected.\u0026#34; Brave does block requests to the localhost if you don\u0026#39;t consent to it, so it did successfully protect users from this tracking.\u003c/p\u003e\u003cp\u003eResearchers say Yandex has been doing this since February of 2017 on HTTP sites, and May of 2018 on HTTPS sites. Meta Pixel, on the other hand, hasn\u0026#39;t been tracking this way for long: It only started September of 2024 for HTTP, and ended that practice in October. It started via Websocket and WebRTC STUN in November, and WebRTC TURN in May.  \u003c/p\u003e\u003cp\u003eWebsite owners apparently complained to Meta starting in September, asking why Meta Pixel communicates with the localhost. As far as researchers could find, Meta never responded.\u003c/p\u003e\u003cdiv data-ga-click=\"\" data-ga-template=\"News\" data-ga-module=\"openweb_widget\" data-ga-element=\"openweb_scroll\" data-ga-item=\"openweb_scroll_midpage\" x-data=\"{\n         commentsCount: null,\n         hasComments: false,\n         async fetchCommentsCount() {\n             try {\n                 if (window.openweb \u0026amp;\u0026amp; typeof window.openweb.getMessagesCount === \u0026#39;function\u0026#39;) {\n                     this.commentsCount = await window.openweb.getMessagesCount(\u0026#39;01JWY7H556BG93MV6ZG6SKFFHM\u0026#39;);\n                     this.hasComments = this.commentsCount !== null \u0026amp;\u0026amp; this.commentsCount \u0026gt; 0;\n                 }\n             } catch (e) {\n                 console.warn(\u0026#39;Failed to fetch comment count:\u0026#39;, e);\n             }\n         }\n     }\" x-init=\"fetchCommentsCount()\" x-cloak=\"\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003e\n                What do you think so far?\n                \n            \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eResearchers make it clear that the type of tracking is possible on iOS, as developers can establish localhost connections and apps can \u0026#34;listen in\u0026#34; too. However, they found no evidence of this tracking on iOS devices, and hypothesize that it has to do with how iOS restricts native apps running in the background.\u003c/p\u003e\u003cp\u003eThe good news is, as of June 3, researchers say they have not observed Meta Pixel communicating with the localhost. They didn\u0026#39;t say the same for Yandex Metrika, \u003ca href=\"https://arstechnica.com/security/2025/06/meta-and-yandex-are-de-anonymizing-android-users-web-browsing-identifiers/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ethough Yandex told Ars Technica\u003c/a\u003e it was \u0026#34;discontinuing the practice.\u0026#34; Ars Technica also reports that Google has opened an investigation into these actions that \u0026#34;blatantly violate our security and privacy principles.\u0026#34;\u003c/p\u003e\u003cp\u003eHowever, even if Meta has stopped this tracking following the report, the damage could be widespread. As highlighted in the report, estimates put Meta Pixel adoption anywhere from 2.4 million to 5.8 million sites. From here, researchers found that just over 17,000 Meta Pixel sites in the U.S. attempt to connect to the localhost, and over 78% of those do so without any user consent needed, including sites like AP News, Buzzfeed, and The Verge. That\u0026#39;s a \u003cem\u003elot\u003c/em\u003e of websites that could have been sending your data back to your Facebook and Instagram apps. The report features a tool that you can use to look for affected sites, but notes the list is not exhaustive, and absence doesn\u0026#39;t mean the site is safe.\u003c/p\u003e\u003cp\u003eMeta sent me the following statement in response to my request for comment: “We are in discussions with Google to address a potential miscommunication regarding the application of their policies. Upon becoming aware of the concerns, we decided to pause the feature while we work with Google to resolve the issue.”\u003c/p\u003e\n            \u003c/article\u003e\n\n    \u003c/div\u003e\n\n\u003cdiv data-newsletter-key=\"the-download\"\u003e\n    \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003eThe Download\u003c/span\u003e\n            \u003cspan\u003eNever miss a tech story\u003c/span\u003e\n        \u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\"/\u003e\n            \u003cspan\u003eJake Peterson\n                \n            \u003c/span\u003e\n            \n        \u003c/p\u003e\n\n        \u003cp\u003e\u003cspan\u003eGet the latest tech news, \u003cspan\u003e\u003c/span\u003ereviews, \u003cspan\u003e\u003c/span\u003eand advice from Jake and the team.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003eThe Download\u003c/span\u003e\n            \u003cspan\u003e\u003cspan\u003eNever miss a tech story.\u003c/span\u003e Get the latest tech news, \u003cspan\u003e\u003c/span\u003ereviews, \u003cspan\u003e\u003c/span\u003eand advice from Jake and the team.\u003c/span\u003e\n        \u003c/p\u003e\n\n        \n    \u003c/div\u003e\n\u003c/div\u003e\n\n    \n    \n\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-04T20:56:52Z",
  "modifiedTime": "2025-06-04T21:30:07Z"
}
