{
  "id": "6d00d0b2-fba2-4ad6-b978-ef0b56118edb",
  "title": "Kia Is Bringing an Electric Truck to the US: What We Know So Far",
  "link": "https://www.cnet.com/roadshow/news/kia-is-bringing-an-electric-truck-to-the-us-what-we-know-so-far/#ftag=CAD590a51e",
  "description": "Kia is joining the EV pickup segment. Here's everything you need to know right now.",
  "author": "Joe Hindy",
  "published": "Fri, 18 Apr 2025 21:54:03 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Joe Hindy",
  "length": 2664,
  "excerpt": "Kia is joining the EV pickup segment. Here's everything you need to know right now.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Kia Is Bringing an Electric Truck to the US: What We Know So Far Will a Kia EV pickup succeed in the US? Kia is upping the number of pickup truck models it makes, taking it from one to two. Last year, the company announced its plucky Kia Tasman, which it considers a success, despite the polarizing design. And Kia is celebrating by releasing a second pickup: an electric vehicle that, unlike the Tasman, is coming to North America.\"Kia plans to introduce an EV pickup truck based on a new EV platform designed for both urban and outdoor use,\" the company said in a statement last week. \"The vehicle will feature best-in-class interior and cargo space, a robust towing system, off-road capabilities and advanced infotainment and safety features.\"Details right now are fairly slim, but some conclusions can be drawn from Kia's statements: The inclusion of off-road capabilities will set the upcoming EV apart from the Hyundai Santa Fe, which is currently the only pickup truck Kia or its sister company sells in the US right now. It'll be on a new EV platform, so it'll also be set apart from the company's existing EV offerings, like the Kia EV6. The infotainment will likely be similar to current model Kia EVs and vehicles, like the dual-display technology in the more recent Kia Sportage SUVs. Will a Kia EV pickup succeed in the US?Per the press release, Kia is expecting to sell roughly 90,000 of these new EV pickups per year, a lofty goal in a market where the Ford F-150 Lightning is barely hitting 30,000 units sold. By most accounts, it's an ambitious sales goal to hit for a vehicle that'll represent Kia's first attempt at appeasing the US truck buyer market. However, there is still room for optimism. \"The models built on the eGMP line sold over 100K units in 2024,\" said Liz Najman, director of market insights at Recurrent, a company that offers independent insights on EV performance. \"Moreover, like the EV6, Kia pickups will likely be made in the US, helping avoid costly tariffs that will drive up prices for consumers. It is likely that price will be a major factor for consumers in the coming years.\"Najman also said that trucks were the two top-selling vehicles in 2024, so it's possible that Kia can reach its sales goals, provided that the automaker can hit that sweet spot of competitive pricing and capability. \"When you look at electric car sales, both the Ford Mustang Mach-E and the Jeep Wrangler PHEV sold over 50K units in 2024, and of course the Model 3 and the Model Y sold 150K+ and 370K+ units,\" Najman said. \"Electric vehicles are seeing strong sales numbers when they deliver on what customers want.\"",
  "image": "https://www.cnet.com/a/img/resize/c03e235fe2865d4eec1bf936c097debb0433ceb7/hub/2025/04/11/4128d485-fa11-4d26-a698-8721bf39727b/kia-tasman.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cnav\u003e \u003cul\u003e\u003cli\u003e\u003ca href=\"#toc-76f175c1-b6ca-4afc-a6da-b6ebb93250e6-item-0\" data-cy=\"globalToc_link\"\u003e\n        Kia Is Bringing an Electric Truck to the US: What We Know So Far\n      \u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"#toc-76f175c1-b6ca-4afc-a6da-b6ebb93250e6-item-1\" data-cy=\"globalToc_link\"\u003e\n        Will a Kia EV pickup succeed in the US?\n      \u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/nav\u003e\u003cp\u003eKia is upping the number of pickup truck models it makes, taking it from one to two. Last year, the company announced its plucky \u003ca href=\"https://worldwide.kia.com/int/tasman\" target=\"_self\"\u003eKia Tasman\u003c/a\u003e, which it considers a success, despite the polarizing design. And Kia is celebrating by releasing a second pickup: an \u003ca href=\"https://www.cnet.com/home/electric-vehicles/best-ev-electric-car/\" target=\"_self\"\u003eelectric vehicle\u003c/a\u003e that, unlike the Tasman, is \u003ca href=\"https://www.kiamedia.com/us/en/media/pressreleases/23078/2025-kia-ceo-investor-day-kia-to-strengthen-growth-engine-through-launch-of-new-ev-pbv-and-pickup-mo\" target=\"_self\"\u003ecoming to North America\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;Kia plans to introduce an EV pickup truck based on a new EV platform designed for both urban and outdoor use,\u0026#34; the company said in a statement last week. \u0026#34;The vehicle will feature best-in-class interior and cargo space, a robust towing system, off-road capabilities and advanced infotainment and safety features.\u0026#34;\u003c/p\u003e\u003cp\u003eDetails right now are fairly slim, but some conclusions can be drawn from Kia\u0026#39;s statements: The inclusion of off-road capabilities will set the upcoming EV apart from the Hyundai Santa Fe, which is currently the only pickup truck Kia or its sister company sells in the US right now.  \u003c/p\u003e\u003cp\u003eIt\u0026#39;ll be on a new EV platform, so it\u0026#39;ll also be set apart from the company\u0026#39;s \u003ca href=\"https://www.cnet.com/home/electric-vehicles/the-most-affordable-electric-cars/\" target=\"_self\"\u003eexisting EV offerings\u003c/a\u003e, like the \u003ca href=\"https://www.cnet.com/home/electric-vehicles/long-term-2022-kia-ev6-4000-mile-update/\" target=\"_self\"\u003eKia EV6\u003c/a\u003e. The infotainment will likely be similar to current model Kia EVs and vehicles, like the dual-display technology in the more \u003ca href=\"https://www.cnet.com/roadshow/reviews/2023-kia-sportage-hybrid-review/\" target=\"_self\"\u003erecent Kia Sportage SUVs\u003c/a\u003e.  \u003c/p\u003e\u003ch2 id=\"toc-76f175c1-b6ca-4afc-a6da-b6ebb93250e6-item-1\" data-id=\"toc-76f175c1-b6ca-4afc-a6da-b6ebb93250e6-item-1\"\u003eWill a Kia EV pickup succeed in the US?\u003c/h2\u003e\u003cp\u003ePer the press release, Kia is expecting to sell roughly 90,000 of these new EV pickups per  year, a lofty goal in a market where the Ford F-150 Lightning is \u003ca href=\"https://fordauthority.com/fmc/ford-motor-company-sales-numbers/ford-sales-numbers/ford-f-series-sales-numbers/ford-f-150-lightning-sales-numbers/\" target=\"_self\"\u003ebarely hitting\u003c/a\u003e 30,000 units sold.   By most accounts, it\u0026#39;s an ambitious sales goal to hit for a vehicle that\u0026#39;ll represent Kia\u0026#39;s first attempt at appeasing the US truck buyer market. However, there is still room for optimism. \u003c/p\u003e\u003cp\u003e\u0026#34;The models built on the eGMP line sold over 100K units in 2024,\u0026#34; said Liz Najman, director of market insights at Recurrent, a company that offers independent insights on EV performance. \u0026#34;Moreover, like the EV6, Kia pickups will likely be made in the US, helping avoid costly tariffs that will drive up prices for consumers. It is likely that price will be a major factor for consumers in the coming years.\u0026#34;\u003c/p\u003e\u003cp\u003eNajman also said that trucks were the two top-selling vehicles in 2024, so it\u0026#39;s possible that Kia can reach its sales goals, provided that the automaker can hit that sweet spot of competitive pricing and capability. \u003c/p\u003e\u003cp\u003e\u0026#34;When you look at electric car sales, both the Ford Mustang Mach-E and the Jeep Wrangler PHEV sold over 50K units in 2024, and of course the Model 3 and the Model Y sold 150K+ and 370K+ units,\u0026#34; Najman said. \u0026#34;Electric vehicles are seeing strong sales numbers when they deliver on what customers want.\u0026#34;\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-18T21:54:03Z",
  "modifiedTime": null
}
