{
  "id": "6da6df0c-d3ea-402c-b03a-ca5d532886b1",
  "title": "Did Apple Kill Liquid Glass in the Third iOS 26 Developer Beta?",
  "link": "https://lifehacker.com/tech/the-biggest-features-and-changes-in-ios-26-beta-3?utm_medium=RSS",
  "description": "Liquid Glass doesn't look so glassy anymore.",
  "author": "Jake Peterson",
  "published": "Mon, 14 Jul 2025 21:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Tech"
  ],
  "byline": "Jake Peterson",
  "length": 5230,
  "excerpt": "Liquid Glass doesn't look so glassy anymore.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Credit: Yalcin Sonat / Shutterstock.com Last week, Apple dropped the third developer beta for iOS 26. It's the first major update to the beta since June, and it's clear that we're getting closer to the public version of the beta (even if Apple hadn't already confirmed it's coming in July). The third beta has fewer features and changes than the second, as Apple presumably focuses on improving the stability of the OS before unleashing it to public testers. But while there aren't a ton of new features and changes in this beta, there are some interesting highlights to report, as initially found by MacRumors. Here's what's new with this latest beta:Liquid Glass looks way less strikingWhile iOS 26 is full of new features and changes, arguably the defining characteristic of this update cycle is Liquid Glass, Apple's big design overhaul that stretches across all of its operating systems. Liquid Glass envisions Apple's UI as, well, glass: Menus, buttons, app icons, and more are all designed with clear transparency in mind, as if each were made of actual glass. The \"liquid\" aspect comes into play with motion, as the glassy elements can shift and warp as you interact with them, and adjust their reflections accordingly.While the design as it appeared in the first beta certainly had its fans, it also had many detractors, some of whom called out the effect for its lack of readability and visibility. In turn, Apple toned down Liquid Glass' transparency with its second beta, which made each individual element easier to see—especially when there was a lot going on behind it—but compromised the original vision Apple sold during WWDC.With beta 3, it seems Apple's designers are still feeling the pressure to make Liquid Glass more legible, to the point where it hardly seems anything like its original design. In some cases, I wouldn't blame you if you thought there was zero transparency at all: Many of the elements have a \"frosted\" appearance, which makes them easy to read in all situations, but certainly doesn't evoke \"glass\" upon first glance. This Tweet is currently unavailable. It might be loading or has been removed. Proving you can't please everyone, many are lamenting the loss of iOS 26's boldest new characteristic. One user even made a hypothetical Liquid Glass slider for Apple, which I think is a great idea. If Apple can't decide on the transparency for its Liquid Glass design, let users decide for themselves. This Tweet is currently unavailable. It might be loading or has been removed. New wallpaper colorsiOS 26's default wallpaper shipped only in a blue option. But with beta 3, there are now four versions of the wallpaper. That includes three different versions of the blue color—Halo, Sky, and Shadow—as well as a new Dusk option that's more purple and pink. What do you think so far? This Tweet is currently unavailable. It might be loading or has been removed. iPadOS 26 While not technically iOS 26, iPadOS 26's third beta gets an interesting feature from macOS: When you shake the cursor, it'll temporarily get larger, just as it does on a Mac. This makes it much easier to find if you've lost it.MapsIf you use offline maps in Apple Maps, you'll notice you now have access to fog advisories in beta 3. In addition, MacRumors found that this update continues to add to the new \"commute delays\" feature.Control Center has new colorsThe blues and greens in Control Center's connectivity toggles (wifi, Bluetooth, AirDrop, and Cellular) are now brighter. It's a subtle change, but Apple is clearly interested in adjusting them. Who should run the developer beta?As previously mentioned, iOS 26 is still in developer beta. While anyone can technically install the developer beta these days, as long as they register their Apple Account with Apple's developer program, I strongly encourage you to wait at least until the public beta drops. Developer betas are meant for developers to test their software on Apple's newest OS, and since Apple is giving these developers such early access, the OS is in its least stable phase, even after three iterations. As such, there could be bugs and glitches that mess with your overall iOS experience, and could even lead to data loss if you didn't properly back up ahead of time. Similar risks apply to running a public beta too, but at least in that case, Apple has taken the time to root out the worst of them. If you're interested in seeing Liquid Glass' current iteration, or trying any of iOS 26's new features, I advise you wait until the public beta, which is promised to drop sometime this month. The Download Newsletter Never miss a tech story Jake Peterson Get the latest tech news, reviews, and advice from Jake and the team. The Download Newsletter Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.",
  "image": "https://lifehacker.com/imagery/articles/01K0569Q15N9Z0PGDT9V491ZKM/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\" data-seamless-scroll-item=\"\" data-status=\"loaded\" data-content-slug=\"the-biggest-features-and-changes-in-ios-26-beta-3\" data-content-qualified-slug=\"/tech/the-biggest-features-and-changes-in-ios-26-beta-3\" data-content-canonical-url=\"https://lifehacker.com/tech/the-biggest-features-and-changes-in-ios-26-beta-3\" data-content-toc-items=\"[{\u0026#34;text\u0026#34;:\u0026#34;Liquid Glass looks way less striking\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;liquid-glass-looks-way-less-striking\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;New wallpaper colors\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;new-wallpaper-colors\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;iPadOS 26 \u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;ipados-26\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;Maps\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;maps\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;Control Center has new colors\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;control-center-has-new-colors\u0026#34;},{\u0026#34;text\u0026#34;:\u0026#34;Who should run the developer beta?\u0026#34;,\u0026#34;anchor\u0026#34;:\u0026#34;who-should-run-the-developer-beta\u0026#34;}]\" data-max-scrolled-percentage=\"0\" data-index=\"0\" data-ga-module=\"content-body\"\u003e\n        \n\n        \u003cdiv\u003e\n    \n\n    \n            \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01K0569Q15N9Z0PGDT9V491ZKM/hero-image.fill.size_1248x702.v1752528716.png\" alt=\"iPhone 16 Pro screen with new iOS 26 logo\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01K0569Q15N9Z0PGDT9V491ZKM/hero-image.fill.size_400x225.v1752528716.png 400w, https://lifehacker.com/imagery/articles/01K0569Q15N9Z0PGDT9V491ZKM/hero-image.fill.size_800x450.v1752528716.png 800w, https://lifehacker.com/imagery/articles/01K0569Q15N9Z0PGDT9V491ZKM/hero-image.fill.size_1248x702.v1752528716.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: Yalcin Sonat / Shutterstock.com\u003c/span\u003e\n                            \u003c/p\u003e\n            \n            \n    \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eLast week, Apple dropped the third developer beta for iOS 26. It\u0026#39;s the \u003ca href=\"https://lifehacker.com/tech/favorite-new-features-and-changes-in-the-second-ios-26-beta\" target=\"_blank\"\u003efirst major update to the beta since June\u003c/a\u003e, and it\u0026#39;s clear that we\u0026#39;re getting closer to the public version of the beta (even if Apple hadn\u0026#39;t already confirmed it\u0026#39;s coming in July). The third beta has fewer features and changes than the second, as Apple presumably focuses on improving the stability of the OS before unleashing it to public testers. \u003c/p\u003e\u003cp\u003eBut while there aren\u0026#39;t a ton of new features and changes in this beta, there are some interesting highlights to report, \u003ca href=\"https://www.macrumors.com/2025/07/07/ios-26-beta-3-everything-new/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eas initially found by MacRumors\u003c/a\u003e. Here\u0026#39;s what\u0026#39;s new with this latest beta:\u003c/p\u003e\u003ch2 id=\"liquid-glass-looks-way-less-striking\"\u003eLiquid Glass looks way less striking\u003c/h2\u003e\u003cp\u003eWhile iOS 26 is full of new features and changes, arguably \u003cem\u003ethe\u003c/em\u003e defining characteristic of this update cycle is \u003ca href=\"https://lifehacker.com/tech/first-look-at-apples-new-liquid-glass-style-wwdc-2025\" target=\"_blank\"\u003eLiquid Glass\u003c/a\u003e, Apple\u0026#39;s big design overhaul that stretches across all of its operating systems. \u003c/p\u003e\u003cp\u003eLiquid Glass envisions Apple\u0026#39;s UI as, well, glass: Menus, buttons, app icons, and more are all designed with clear transparency in mind, as if each were made of actual glass. The \u0026#34;liquid\u0026#34; aspect comes into play with motion, as the glassy elements can shift and warp as you interact with them, and adjust their reflections accordingly.\u003c/p\u003e\u003cp\u003eWhile the design as it appeared in the first beta certainly had its fans, it also had many detractors, some of whom called out the effect for its lack of readability and visibility. In turn, \u003ca href=\"https://lifehacker.com/tech/ios-26s-second-beta-tones-down-the-liquid-glass-effect\" target=\"_blank\"\u003eApple toned down Liquid Glass\u0026#39; transparency with its second beta\u003c/a\u003e, which made each individual element easier to see—especially when there was a lot going on behind it—but compromised the original vision \u003ca href=\"https://lifehacker.com/tech/apple-wwdc-2025-live-blog\" target=\"_blank\"\u003eApple sold during WWDC\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eWith beta 3, it seems Apple\u0026#39;s designers are still feeling the pressure to make Liquid Glass more legible, to the point where it hardly seems anything like its original design. In some cases, I wouldn\u0026#39;t blame you if you thought there was zero transparency at all: Many of the elements have a \u0026#34;frosted\u0026#34; appearance, which makes them easy to read in all situations, but certainly doesn\u0026#39;t evoke \u0026#34;glass\u0026#34; upon first glance.\u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/iupdate/status/1942299745105719795\" title=\"open in a new window\" target=\"_blank\" rel=\"noopener\"\u003e\n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eProving you can\u0026#39;t please everyone, many are lamenting the loss of iOS 26\u0026#39;s boldest new characteristic. \u003ca href=\"https://x.com/minimalnerd1/status/1943022489908711709\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eOne user even made a hypothetical Liquid Glass slider for Apple\u003c/a\u003e, which I think is a great idea. If Apple can\u0026#39;t decide on the transparency for its Liquid Glass design, let users decide for themselves.\u003c/p\u003e\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/minimalnerd1/status/1943022489908711709\" title=\"open in a new window\" target=\"_blank\" rel=\"noopener\"\u003e\n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"new-wallpaper-colors\"\u003eNew wallpaper colors\u003c/h2\u003e\u003cp\u003eiOS 26\u0026#39;s default wallpaper shipped only in a blue option. But with beta 3, there are now four versions of the wallpaper. That includes three different versions of the blue color—Halo, Sky, and Shadow—as well as a new Dusk option that\u0026#39;s more purple and pink.\u003c/p\u003e\u003cdiv data-ga-click=\"\" data-ga-template=\"News\" data-ga-module=\"openweb_widget\" data-ga-element=\"openweb_scroll\" data-ga-item=\"openweb_scroll_midpage\" x-data=\"{\n         commentsCount: null,\n         hasComments: false,\n         async fetchCommentsCount() {\n             try {\n                 if (window.openweb \u0026amp;\u0026amp; typeof window.openweb.getMessagesCount === \u0026#39;function\u0026#39;) {\n                     this.commentsCount = await window.openweb.getMessagesCount(\u0026#39;01K0569Q15N9Z0PGDT9V491ZKM\u0026#39;);\n                     this.hasComments = this.commentsCount !== null \u0026amp;\u0026amp; this.commentsCount \u0026gt; 0;\n                 }\n             } catch (e) {\n                 console.warn(\u0026#39;Failed to fetch comment count:\u0026#39;, e);\n             }\n         }\n     }\" x-init=\"fetchCommentsCount()\" x-cloak=\"\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003e\n                What do you think so far?\n                \n            \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003cblockquote\u003e\n    \u003ca href=\"https://twitter.com/theiosguy101/status/1942297965005320233\" title=\"open in a new window\" target=\"_blank\" rel=\"noopener\"\u003e\n        This Tweet is currently unavailable. It might be loading or has been removed.\n    \u003c/a\u003e\n\u003c/blockquote\u003e\n\n\u003ch2 id=\"ipados-26\"\u003eiPadOS 26 \u003c/h2\u003e\u003cp\u003eWhile not technically iOS 26, iPadOS 26\u0026#39;s third beta gets an interesting feature from macOS: When you shake the cursor, it\u0026#39;ll temporarily get larger, just as it does on a Mac. This makes it much easier to find if you\u0026#39;ve lost it.\u003c/p\u003e\u003ch2 id=\"maps\"\u003eMaps\u003c/h2\u003e\u003cp\u003eIf you use \u003ca href=\"https://lifehacker.com/you-can-finally-download-apple-maps-offline-in-ios-17-1850685430\" target=\"_blank\"\u003eoffline maps in Apple Maps\u003c/a\u003e, you\u0026#39;ll notice you now have access to fog advisories in beta 3. In addition, MacRumors found that this update continues to add to the new \u0026#34;commute delays\u0026#34; feature.\u003c/p\u003e\u003ch2 id=\"control-center-has-new-colors\"\u003eControl Center has new colors\u003c/h2\u003e\u003cp\u003eThe blues and greens in Control Center\u0026#39;s connectivity toggles (wifi, Bluetooth, AirDrop, and Cellular) are now brighter. It\u0026#39;s a subtle change, but Apple is clearly interested in adjusting them. \u003c/p\u003e\u003ch2 id=\"who-should-run-the-developer-beta\"\u003eWho should run the developer beta?\u003c/h2\u003e\u003cp\u003eAs previously mentioned, \u003ca href=\"https://lifehacker.com/tech/how-to-install-ios-26-right-now-wwdc-2025\" target=\"_blank\"\u003eiOS 26 is still in developer beta\u003c/a\u003e. While anyone can technically install the developer beta these days, as long as they register their Apple Account with Apple\u0026#39;s developer program, I strongly encourage you to wait at least until the public beta drops. Developer betas are meant for developers to test their software on Apple\u0026#39;s newest OS, and since Apple is giving these developers such early access, the OS is in its least stable phase, even after three iterations. As such, there could be bugs and glitches that mess with your overall iOS experience, and could even lead to data loss \u003ca href=\"https://lifehacker.com/tech/how-to-uninstall-the-ios-26-beta\" target=\"_blank\"\u003eif you didn\u0026#39;t properly back up ahead of time\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eSimilar risks apply to running a public beta too, but at least in that case, Apple has taken the time to root out the worst of them. If you\u0026#39;re interested in seeing Liquid Glass\u0026#39; current iteration, or \u003ca href=\"https://lifehacker.com/tech/all-the-ios-26-features-apple-barely-mentioned-at-wwdc-2025\" target=\"_blank\"\u003etrying any of iOS 26\u0026#39;s new features\u003c/a\u003e, I advise you wait until the public beta, which is promised to drop sometime this month.\u003c/p\u003e\n            \u003c/article\u003e\n\n    \u003c/div\u003e\n\n\u003cdiv data-newsletter-key=\"the-download\"\u003e\n    \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003eThe Download Newsletter\u003c/span\u003e\n            \u003cspan\u003eNever miss a tech story\u003c/span\u003e\n        \u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://lifehacker.com/images/team/Jake.png\" alt=\"Jake Peterson portrait\"/\u003e\n            \u003cspan\u003eJake Peterson\n                \n            \u003c/span\u003e\n            \n        \u003c/p\u003e\n\n        \u003cp\u003e\u003cspan\u003eGet the latest tech news, \u003cspan\u003e\u003c/span\u003ereviews, \u003cspan\u003e\u003c/span\u003eand advice from Jake and the team.\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003e\u003cspan\u003eThe Download Newsletter\u003c/span\u003e\n            \u003cspan\u003e\u003cspan\u003eNever miss a tech story.\u003c/span\u003e Get the latest tech news, \u003cspan\u003e\u003c/span\u003ereviews, \u003cspan\u003e\u003c/span\u003eand advice from Jake and the team.\u003c/span\u003e\n        \u003c/p\u003e\n\n        \n    \u003c/div\u003e\n\u003c/div\u003e\n\n    \n    \n\n    \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-14T21:30:00Z",
  "modifiedTime": "2025-07-14T21:32:10Z"
}
