{
  "id": "6ecf6c1b-6796-4649-8da1-36bd4b774d9f",
  "title": "Trump pulls Isaacman nomination for space. Source: “NASA is f***ed”",
  "link": "https://arstechnica.com/space/2025/05/trump-pulls-isaacman-nomination-for-space-source-nasa-is-fed/",
  "description": "\"NASA's budget request is just a going-out-of-business mode\" without Isaacman.",
  "author": "Eric Berger",
  "published": "Sat, 31 May 2025 21:22:08 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Space",
    "isaacman",
    "NASA",
    "Trump"
  ],
  "byline": "Eric Berger",
  "length": 1990,
  "excerpt": "“NASA’s budget request is just a going-out-of-business mode” without Isaacman.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Musk was a key factor behind Isaacman's nomination as NASA administrator, and with his backing, Isaacman was able to skip some of the party purity tests that have been applied to other Trump administration nominees. One mark against Isaacman is that he had recently donated money to Democrats. He also indicated opposition to some of the White House's proposed cuts to NASA's science budget. Musk's role in the government was highly controversial, winning him enemies both among opponents of Trump's \"Make America Great Again\" agenda as well as inside the administration. One source told Ars that, with Musk's exit, his opponents within the administration sought to punish him by killing Isaacman's nomination. The loss of Isaacman is almost certainly a blow to NASA, which faces substantial budget cuts. The Trump Administration's budget request for fiscal year 2026, released Friday, seeks $18.8 billion for the agency next year—a 24 percent cut from the agency's budget of $24.8 billion for FY 2025. Going out of business? Isaacman is generally well-liked in the space community and is known to care deeply about space exploration. Officials within the space agency—and the larger space community—hoped that having him as NASA's leader would help the agency restore some of these cuts. Now? \"NASA is f---ed,\" one current leader in the agency told Ars on Saturday. \"NASA's budget request is just a going-out-of-business mode without Jared there to innovate,\" a former senior NASA leader said. The Trump administration did not immediately name a new nominee, but two people told Ars that former US Air Force Lieutenant General Steven L. Kwast may be near the top of the list. Now retired, Kwast has a distinguished record in the Air Force and is politically loyal to Trump and MAGA. However, his background seems to be far less oriented toward NASA's civil space mission and far more focused on seeing space as a battlefield—decidedly not an arena for cooperation and peaceful exploration.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/52225129791_a35f106c0a_k-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eMusk was a key factor behind \u003ca href=\"https://arstechnica.com/space/2025/03/momentum-seems-to-be-building-for-jared-isaacman-to-become-nasa-administrator/\"\u003eIsaacman\u0026#39;s nomination as NASA administrator\u003c/a\u003e, and with his backing, Isaacman was able to skip some of the party purity tests that have been applied to other Trump administration nominees. One mark against Isaacman is that he had recently donated money to Democrats. He also indicated opposition to some of the \u003ca href=\"https://arstechnica.com/space/2025/04/trump-white-house-budget-proposal-eviscerates-science-funding-at-nasa/\"\u003eWhite House\u0026#39;s proposed cuts\u003c/a\u003e to NASA\u0026#39;s science budget.\u003c/p\u003e\n\u003cp\u003eMusk\u0026#39;s role in the government was highly controversial, winning him enemies both among opponents of Trump\u0026#39;s \u0026#34;Make America Great Again\u0026#34; agenda as well as inside the administration. One source told Ars that, with Musk\u0026#39;s exit, his opponents within the administration sought to punish him by killing Isaacman\u0026#39;s nomination.\u003c/p\u003e\n\u003cp\u003eThe loss of Isaacman is almost certainly a blow to NASA, which faces substantial budget cuts. The Trump Administration\u0026#39;s budget request for fiscal year 2026, \u003ca href=\"https://www.nasa.gov/fy-2026-budget-request/\"\u003ereleased Friday\u003c/a\u003e, seeks $18.8 billion for the agency next year—a 24 percent cut from the agency\u0026#39;s budget of $24.8 billion for FY 2025.\u003c/p\u003e\n\u003ch2\u003eGoing out of business?\u003c/h2\u003e\n\u003cp\u003eIsaacman is generally well-liked in the space community and is known to care deeply about space exploration. Officials within the space agency—and the larger space community—hoped that having him as NASA\u0026#39;s leader would help the agency restore some of these cuts.\u003c/p\u003e\n\u003cp\u003eNow? \u0026#34;NASA is f---ed,\u0026#34; one current leader in the agency told Ars on Saturday.\u003c/p\u003e\n\u003cp\u003e\u0026#34;NASA\u0026#39;s budget request is just a going-out-of-business mode without Jared there to innovate,\u0026#34; a former senior NASA leader said.\u003c/p\u003e\n\u003cp\u003eThe Trump administration did not immediately name a new nominee, but two people told Ars that former US Air Force Lieutenant General Steven L. Kwast may be near the top of the list. Now retired, Kwast has a distinguished record in the Air Force and is politically loyal to Trump and MAGA.\u003c/p\u003e\n\u003cp\u003eHowever, his background seems to be far less oriented toward NASA\u0026#39;s civil space mission and far more focused on \u003ca href=\"https://www.twz.com/31445/recently-retired-usaf-general-makes-eyebrow-raising-claims-about-advanced-space-technology\"\u003eseeing space as a battlefield\u003c/a\u003e—decidedly not an arena for cooperation and peaceful exploration.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-31T21:22:08Z",
  "modifiedTime": "2025-06-01T00:23:31Z"
}
