{
  "id": "6ee1c2a9-f769-439b-9217-51a423f6cc2f",
  "title": "David Harbour Is More Than Ready for ‘Stranger Things’ to Be Over",
  "link": "https://gizmodo.com/david-harbour-stranger-things-ending-netflix-2000614701",
  "description": "He's been playing Jim Hopper since 2016—and we'll see him do it one last time when the show's fifth and final season hits Netflix later this year.",
  "author": "Cheryl Eddy",
  "published": "Wed, 11 Jun 2025 22:30:10 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "David Harbour",
    "Stranger Things"
  ],
  "byline": "Cheryl Eddy",
  "length": 2959,
  "excerpt": "He's been playing Jim Hopper since 2016—and we'll see him do it one last time when the show's fifth and final season hits Netflix later this year.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "David Harbour has been acting professionally for over two decades—he was nominated for a Tony in 2005—but his big break came with Stranger Things. Harbour’s portrayal of Sheriff Jim Hopper immediately endeared him to viewers, and over the show’s run we’ve seen Hawkins, Indiana’s top cop morph from boozy sad sack to strict but loving dad to supernatural beastie-fighting hero to Siberian prison escapee, plus a little romantic tension with Winona Ryder’s character on the side. And since Stranger Things‘ debut in 2016, Harbour has parlayed his Netflix success to other starring roles; while his Hellboy was a bust, he also created a whole new kind of Santa Claus in the excellent Violent Night and entered the Marvel Cinematic Universe via Black Widow and Thunderbolts. He’s also found success on the DC side too, starring in animated series Creature Commandos. While it doesn’t seem like Stranger Things‘ filming schedule has held him back from adding to his filmography, he’s clearly ready for the freedom he’ll have once the show has aired its final batch of episodes. His schedule will be more open to new projects, of course, but he’ll also be able to put Jim Hopper to bed for good. In an Interview Magazine chat with Scarlett Johansson, his co-star in Black Widow, he sounded grateful but weary. “When I started I loved it so much. Buddies of mine who’d done TV shows for many years said, ‘By season three or four you’ll be running.’ And I was like, Never! I love all these guys so much,'” he recalled. “And then you get to a certain point where you’re like, ‘How much more story is there?’ You’re having to play a lot of the same beat, and there’s a feeling where you’re like, ‘I want to take a risk. I want to do something that people haven’t seen me do before.’ So yeah, after 10 years, it’s like, ‘Okay.'” Later, he elaborated more on what it felt like to be so committed to Jim Hopper, in response to Johansson speaking about being locked into her Marvel character for months at a time and not feeling challenged (or able to change anything about her appearance). “There’d be certain seasons where you feel like, ‘I’m going to go in this different direction.’ But … a piece of your psyche is occupied with this group of people and this storyline,” he said. “I don’t paint my nails, but I get that idea of ‘I can’t get a haircut’ or ‘I can’t shave this freaking mustache.'” One of the post-Stranger Things Harbour projects we’re most excited for is the Violent Night sequel, which Variety reported today just got a release date of December 4, 2026. Stranger Things returns November 26 to Netflix for the first four episodes of season five. The rest of the season rolls out December 25 (episodes 5-7) and December 31 (episode 8). Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/06/hopper-1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eDavid Harbour has been acting professionally for over two decades—he was nominated for a Tony in 2005—but his big break came with \u003cem\u003e\u003ca href=\"https://gizmodo.com/stranger-things-season-5-release-date-trailer-netflix-2000609596\"\u003eStranger Things\u003c/a\u003e. \u003c/em\u003eHarbour’s portrayal of Sheriff Jim Hopper immediately endeared him to viewers, and over the show’s run we’ve seen Hawkins, Indiana’s top cop morph from boozy sad sack to strict but loving dad to \u003ca href=\"https://gizmodo.com/stranger-things-season-4-release-date-season-5-final-1848554824\"\u003esupernatural beastie-fighting hero\u003c/a\u003e to \u003ca href=\"https://gizmodo.com/stranger-things-season-4-spoiler-discussion-netflix-hor-1848983546\"\u003eSiberian prison escapee\u003c/a\u003e, plus a little romantic tension with Winona Ryder’s character on the side.\u003c/p\u003e \u003cp\u003eAnd since \u003cem\u003eStranger Things\u003c/em\u003e‘ debut in 2016, Harbour has parlayed his Netflix success to other starring roles; while his\u003cem\u003e Hellboy\u003c/em\u003e was a bust, he also created a whole new kind of Santa Claus in the excellent \u003cem\u003eViolent Night\u003c/em\u003e and entered the Marvel Cinematic Universe via \u003cem\u003eBlack Widow\u003c/em\u003e and \u003ca href=\"https://gizmodo.com/thunderbolts-cinemacon-footage-description-marvel-mcu-2000585006\"\u003e\u003cem\u003eThunderbolts\u003c/em\u003e\u003c/a\u003e. He’s also found success on the DC side too, starring in animated series \u003cem\u003eCreature Commandos\u003c/em\u003e.\u003c/p\u003e \u003cp\u003eWhile it doesn’t seem like \u003cem\u003eStranger Things\u003c/em\u003e‘ filming schedule has held him back from adding to his filmography, he’s clearly ready for the freedom he’ll have once the show has aired its final batch of episodes. His schedule will be more open to new projects, of course, but he’ll also be able to put Jim Hopper to bed for good.\u003c/p\u003e\n\n \u003cp\u003eIn an \u003ca href=\"https://www.interviewmagazine.com/film/david-harbour-bares-his-soul-and-belly-to-scarlett-johansson\"\u003eInterview Magazine\u003c/a\u003e chat with Scarlett Johansson, his co-star in \u003cem\u003eBlack Widow\u003c/em\u003e, he sounded grateful but weary.\u003c/p\u003e \u003cp\u003e“When I started I loved it so much. Buddies of mine who’d done TV shows for many years said, ‘By season three or four you’ll be running.’ And I was like, Never! I love all these guys so much,\u0026#39;” he recalled. “And then you get to a certain point where you’re like, ‘How much more story is there?’ You’re having to play a lot of the same beat, and there’s a feeling where you’re like, ‘I want to take a risk. I want to do something that people haven’t seen me do before.’ So yeah, after 10 years, it’s like, ‘Okay.\u0026#39;”\u003c/p\u003e \u003cp\u003eLater, he elaborated more on what it felt like to be so committed to Jim Hopper, in response to Johansson speaking about being locked into her Marvel character for months at a time and not feeling challenged (or able to change anything about her appearance).\u003c/p\u003e\n\n \u003cp\u003e“There’d be certain seasons where you feel like, ‘I’m going to go in this different direction.’ But … a piece of your psyche is occupied with this group of people and this storyline,” he said. “I don’t paint my nails, but I get that idea of ‘I can’t get a haircut’ or ‘I can’t shave this freaking mustache.\u0026#39;”\u003c/p\u003e \u003cp\u003eOne of the post-S\u003cem\u003etranger Things\u003c/em\u003e Harbour projects we’re most excited for is the \u003cem\u003eViolent Night\u003c/em\u003e sequel, which \u003ca href=\"https://deadline.com/2025/06/violent-night-2-2026-release-date-1236431329/\"\u003eVariety\u003c/a\u003e reported today just got a release date of December 4, 2026.\u003c/p\u003e\n\n \u003cp\u003e\u003cem\u003eStranger Things\u003c/em\u003e returns November 26 to Netflix for the first four episodes of season five. The rest of the season rolls out December 25 (episodes 5-7) and December 31 (episode 8).\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-11T22:30:10Z",
  "modifiedTime": "2025-06-11T22:30:10Z"
}
