{
  "id": "73933ef8-8f73-4fdb-81f7-62ac40e38a11",
  "title": "Google and DOJ tussle over how AI will remake the web in antitrust closing arguments",
  "link": "https://arstechnica.com/gadgets/2025/05/google-and-doj-tussle-over-how-ai-will-remake-the-web-in-antitrust-closing-arguments/",
  "description": "Google and the DOJ get one last chance to make their cases.",
  "author": "Ryan Whitwam",
  "published": "Fri, 30 May 2025 21:40:05 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Google",
    "Tech",
    "antitrust",
    "google",
    "search"
  ],
  "byline": "Ryan Whitwam",
  "length": 2700,
  "excerpt": "Google and the DOJ get one last chance to make their cases.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "At the same time, Google is seeking to set itself apart from AI upstarts. \"Generative AI companies are not trying to out-Google Google,\" said Schmidtlein. Google's team contends that its actions have not harmed any AI products like ChatGPT or Perplexity, and at any rate, they are not in the search market as defined by the court. Mehta mused about the future of search, suggesting we may have to rethink what a general search engine is in 2025. \"Maybe people don’t want 10 blue links anymore,\" he said. The Chromium problem and an elegant solution At times during the case, Mehta has expressed skepticism about the divestment of Chrome. During closing arguments, Dahlquist reiterated the close relationship between search and browsers, reminding the court that 35 percent of Google's search volume comes from Chrome. Mehta now seems more receptive to a Chrome split than before, perhaps in part because the effects of the other remedies are becoming so murky. He called the Chrome divestment \"less speculative\" and \"more elegant\" than the data and placement remedies. Google again claimed, as it has throughout the remedy phase, that forcing it to give up Chrome is unsupported in the law and that Chrome's dominance is a result of innovation. Credit: Aurich Lawson Even if Mehta leans toward ordering this remedy, Chromium may be a sticking point. The judge seems unconvinced that the supposed buyers—a group which apparently includes almost every major tech firm—have the scale and expertise needed to maintain Chromium. This open source project forms the foundation of many other browsers, making its continued smooth operation critical to the web. If Google gives up Chrome, Chromium goes with it, but what about the people who maintain it? The DOJ contends that it's common for employees to come along with an acquisition, but that's far from certain. There was some discussion of ensuring a buyer could commit to hiring staff to maintain Chromium. The DOJ suggests Google could be ordered to provide financial incentives to ensure critical roles are filled, but that sounds potentially messy. A Chrome sale seems more likely now than it did earlier, but nothing is assured yet. Following the final arguments from each side, it's up to Mehta to mull over the facts before deciding Google's fate. That's expected to happen in August, but nothing will change for Google right away. The company has already confirmed it will appeal the case, hoping to have the original ruling overturned. It could still be years before this case reaches its ultimate conclusion.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/Google-sign-IO-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eAt the same time, Google is seeking to set itself apart from AI upstarts. \u0026#34;Generative AI companies are not trying to out-Google Google,\u0026#34; said Schmidtlein. Google\u0026#39;s team contends that its actions have not harmed any AI products like ChatGPT or Perplexity, and at any rate, they are not in the search market as defined by the court.\u003c/p\u003e\n\u003cp\u003eMehta mused about the future of search, suggesting we may have to rethink what a general search engine is in 2025. \u0026#34;Maybe people don’t want 10 blue links anymore,\u0026#34; he said.\u003c/p\u003e\n\u003ch2\u003eThe Chromium problem and an elegant solution\u003c/h2\u003e\n\u003cp\u003eAt times during the case, Mehta has expressed skepticism about the divestment of Chrome. During closing arguments, Dahlquist reiterated the close relationship between search and browsers, reminding the court that 35 percent of Google\u0026#39;s search volume comes from Chrome.\u003c/p\u003e\n\u003cp\u003eMehta now seems more receptive to a Chrome split than before, perhaps in part because the effects of the other remedies are becoming so murky. He called the Chrome divestment \u0026#34;less speculative\u0026#34; and \u0026#34;more elegant\u0026#34; than the data and placement remedies. Google again claimed, as it has throughout the remedy phase, that forcing it to give up Chrome is unsupported in the law and that Chrome\u0026#39;s dominance is a result of innovation.\u003c/p\u003e\n\u003cfigure\u003e\u003ca href=\"https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game.jpg\"\u003e\n    \u003cp\u003e\u003cimg width=\"2560\" height=\"1440\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game.jpg\" alt=\"Break up the company without touching the sides and getting shocked!\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game.jpg 2560w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-640x360.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-1024x576.jpg 1024w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-768x432.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-1536x864.jpg 1536w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-2048x1152.jpg 2048w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-384x216.jpg 384w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-1152x648.jpg 1152w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-980x551.jpg 980w, https://cdn.arstechnica.net/wp-content/uploads/2025/04/google-monoperation-game-1440x810.jpg 1440w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003e\n                  \u003c/p\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\u003cspan\u003e\n          Credit:\n\n          \n          Aurich Lawson\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003eEven if Mehta leans toward ordering this remedy, Chromium may be a sticking point. The judge seems unconvinced that the supposed buyers—a group which apparently \u003ca href=\"https://arstechnica.com/ai/2025/04/chatgpt-head-tells-court-openai-is-interested-in-buying-chrome/\"\u003eincludes almost every major tech firm\u003c/a\u003e—have the scale and expertise needed to maintain Chromium. This open source project forms the foundation of many other browsers, making its continued smooth operation critical to the web.\u003c/p\u003e\n\u003cp\u003eIf Google gives up Chrome, Chromium goes with it, but what about the people who maintain it? The DOJ contends that it\u0026#39;s common for employees to come along with an acquisition, but that\u0026#39;s far from certain. There was some discussion of ensuring a buyer could commit to hiring staff to maintain Chromium. The DOJ suggests Google could be ordered to provide financial incentives to ensure critical roles are filled, but that sounds potentially messy.\u003c/p\u003e\n\u003cp\u003eA Chrome sale seems more likely now than it did earlier, but nothing is assured yet. Following the final arguments from each side, it\u0026#39;s up to Mehta to mull over the facts before deciding Google\u0026#39;s fate. That\u0026#39;s expected to happen in August, but nothing will change for Google right away. The company has already confirmed it will appeal the case, hoping to have the original ruling overturned. It could still be years before this case reaches its ultimate conclusion.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-30T21:40:05Z",
  "modifiedTime": "2025-05-30T21:40:05Z"
}
