{
  "id": "855c8c3b-2213-4932-8752-871dbf7ee2eb",
  "title": "Anthropic’s Haiku 3.5 surprises experts with an “intelligence” price increase",
  "link": "https://arstechnica.com/ai/2024/11/anthropic-raises-eyebrows-with-haiku-price-hike-citing-increased-intelligence/",
  "description": "Anthropic’s smallest AI model now beats its older largest LLM, Opus, at some tasks.",
  "author": "Benj Edwards",
  "published": "Tue, 05 Nov 2024 22:50:48 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "AI",
    "Biz \u0026 IT",
    "AI pricing",
    "Anthropic",
    "Anthropic Claude",
    "API",
    "chatbots",
    "ChatGPT",
    "chatgtp",
    "Claude",
    "Claude 3.5",
    "Claude 3.5 Haiku",
    "Claude Haiku",
    "large language models",
    "machine learning"
  ],
  "byline": "Benj Edwards",
  "length": 2059,
  "excerpt": "Anthropic’s smallest AI model now beats its older largest LLM, Opus, at some tasks.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Speaking of Opus, Claude 3.5 Opus is nowhere to be seen, as AI researcher Simon Willison noted to Ars Technica in an interview. \"All references to 3.5 Opus have vanished without a trace, and the price of 3.5 Haiku was increased the day it was released,\" he said. \"Claude 3.5 Haiku is significantly more expensive than both Gemini 1.5 Flash and GPT-4o mini—the excellent low-cost models from Anthropic's competitors.\" Cheaper over time? So far in the AI industry, newer versions of AI language models typically maintain similar or cheaper pricing to their predecessors. The company had initially indicated Claude 3.5 Haiku would cost the same as the previous version before announcing the higher rates. \"I was expecting this to be a complete replacement for their existing Claude 3 Haiku model, in the same way that Claude 3.5 Sonnet eclipsed the existing Claude 3 Sonnet while maintaining the same pricing,\" Willison wrote on his blog. \"Given that Anthropic claim that their new Haiku out-performs their older Claude 3 Opus, this price isn’t disappointing, but it’s a small surprise nonetheless.\" Claude 3.5 Haiku arrives with some trade-offs. While the model produces longer text outputs and contains more recent training data, it cannot analyze images like its predecessor. Alex Albert, who leads developer relations at Anthropic, wrote on X that the earlier version, Claude 3 Haiku, will remain available for users who need image processing capabilities and lower costs. The new model is not yet available in the Claude.ai web interface or app. Instead, it runs on Anthropic's API and third-party platforms, including AWS Bedrock. Anthropic markets the model for tasks like coding suggestions, data extraction and labeling, and content moderation, though, like any LLM, it can easily make stuff up confidently. \"Is it good enough to justify the extra spend? It's going to be difficult to figure that out,\" Willison told Ars. \"Teams with robust automated evals against their use-cases will be in a good place to answer that question, but those remain rare.\"",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/11/claude_haiku_logo-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eSpeaking of Opus, Claude 3.5 Opus is nowhere to be seen, as \u003cspan\u003eAI researcher Simon Willison noted to Ars Technica in an interview. \u003c/span\u003e\u003cspan\u003e\u0026#34;All references to 3.5 Opus have vanished without a trace, and the price of 3.5 Haiku was increased the day it was released,\u0026#34; he said. \u0026#34;Claude 3.5 Haiku is significantly more expensive than both \u003ca href=\"https://arstechnica.com/information-technology/2024/09/major-ai-updates-from-meta-and-google-and-a-new-era-for-ai-designed-chips/\"\u003eGemini 1.5 Flash\u003c/a\u003e and \u003ca href=\"https://arstechnica.com/information-technology/2024/07/openai-launches-gpt-4o-mini-which-will-replace-gpt-3-5-in-chatgpt/\"\u003eGPT-4o mini\u003c/a\u003e—the excellent low-cost models from Anthropic\u0026#39;s competitors.\u0026#34;\u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eCheaper over time?\u003c/h2\u003e\n\u003cp\u003eSo far in the AI industry, newer versions of AI language models typically maintain similar or cheaper pricing to their predecessors. The company had initially indicated Claude 3.5 Haiku would cost the same as the previous version before announcing the higher rates.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I was expecting this to be a complete replacement for their existing Claude 3 Haiku model, in the same way that Claude 3.5 Sonnet eclipsed the existing Claude 3 Sonnet while maintaining the same pricing,\u0026#34; Willison \u003ca href=\"https://simonwillison.net/2024/Nov/4/haiku/\"\u003ewrote\u003c/a\u003e on his blog. \u0026#34;Given that Anthropic claim that their new Haiku out-performs their older Claude 3 Opus, this price isn’t disappointing, but it’s a small surprise nonetheless.\u0026#34;\u003c/p\u003e\n\u003cp\u003eClaude 3.5 Haiku arrives with some trade-offs. While the model produces longer text outputs and contains more recent training data, it cannot analyze images like its predecessor. Alex Albert, who leads developer relations at Anthropic, \u003ca href=\"https://x.com/alexalbert__/status/1853498575805968496\"\u003ewrote on X\u003c/a\u003e that the earlier version, Claude 3 Haiku, will remain available for users who need image processing capabilities and lower costs.\u003c/p\u003e\n\u003cp\u003eThe new model is not yet available in the Claude.ai web interface or app. Instead, it runs on Anthropic\u0026#39;s API and third-party platforms, including AWS Bedrock. Anthropic markets the model for tasks like coding suggestions, data extraction and labeling, and content moderation, though, like any LLM, it can easily make stuff up confidently.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Is it good enough to justify the extra spend? It\u0026#39;s going to be difficult to figure that out,\u0026#34; Willison told Ars. \u0026#34;Teams with robust automated evals against their use-cases will be in a good place to answer that question, but those remain rare.\u0026#34;\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-05T22:50:48Z",
  "modifiedTime": "2024-11-05T23:44:03Z"
}
