{
  "id": "8cd32872-e564-4d33-97e2-18711c8adab1",
  "title": "Justin Baldoni’s Lawyers Want Marvel Involved in His Lawsuit Against Blake Lively",
  "link": "https://gizmodo.com/justin-baldonis-lawyers-want-marvel-involved-in-his-lawsuit-against-blake-lively-2000550286",
  "description": "The actor's legal team is demanding all records related to the creation of 'Nicepool' in Deadpool \u0026 Wolverine, believing the character to be a slight against Baldoni.",
  "author": "Sabina Graves",
  "published": "Tue, 14 Jan 2025 23:45:55 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Deadpool and Wolverine",
    "disney",
    "Justin Baldoni",
    "marvel studios",
    "Ryan Reynolds"
  ],
  "byline": "Sabina Graves",
  "length": 2538,
  "excerpt": "The actor's legal team is demanding all records related to the creation of 'Nicepool' in Deadpool \u0026 Wolverine, believing the character to be a slight against Baldoni.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "After social media latched onto the theory that It Ends With Us director and co-lead Justin Baldoni inspired “Nicepool” in Deadpool \u0026 Wolverine—to the point that the actor’s legal team, led by Bryan Freedman, addressed it outright—there’s now a new strike back against Ryan Reynolds’ wife, Blake Lively, who was featured in the film as Ladypool. This time, Baldoni’s team is bringing Marvel’s Kevin Feige and Disney’s Bob Iger into the fray. According to Variety, Baldoni’s lawyers are using the accusation as grounds for issuing a litigation hold letter which calls on Disney and Marvel Studios to retain “documents and data” in regards to Baldoni and “Nicepool.” Over the course of the Deadpool \u0026 Wolverine and It Ends With Us press tours, the rift between Baldoni and Lively (who starred opposite Baldoni in the Baldoni-directed film) became laden with public shots at one another over visibly creative differences. It all led up to Lively filing a lawsuit against Baldoni last December over misconduct allegations on the set of their drama; then, Baldoni countersued both Lively and the New York Times alleging that the actress and newspaper purposefully misconstrued leaked texts to support Lively’s case. The particular moments in Deadpool \u0026 Wolverine that echo Lively’s claims against Baldoni include Nicepool’s lines about Ladypool “snapping back” into shape after having a baby and following that up with “It’s okay, I identify as a feminist”—since Baldoni touts his status as a feminist in his podcast. A deleted scene in Deadpool \u0026 Wolverine also saw Nicepool making reference to a feminist podcast; that latter scene in particular helped the “Baldoni is Nicepool?” theory go viral. The litigation letter presented by Baldoni’s team asks Marvel and Disney to preserve “any and all documents relating to the development of the ‘Nicepool’ character” in addition to “communications relating to the development, writing, and filming of storylines and scenes featuring ‘Nicepool'” and “all documents relating to or reflecting a deliberate attempt to mock, harass, ridicule, intimidate, or bully Baldoni through the character of ‘Nicepool.’” Variety notes the letter it viewed was dated January 7; amid the ongoing fires in Los Angeles, not much has moved on that front as neither side has commented on the case since. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/01/Nicepool-Ryan-Reynolds-Justin-Baldoni-Deadpool-and-Wolverine.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eAfter social media latched onto the theory that \u003cem\u003eIt Ends With Us \u003c/em\u003edirector and co-lead Justin Baldoni inspired “Nicepool” in \u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e—to the point that the actor’s legal team, led by Bryan Freedman, \u003ca href=\"https://gizmodo.com/justin-baldoni-blake-lively-lawsuit-deadpool-and-wolverine-nicepool-2000547935\"\u003eaddressed it outright\u003c/a\u003e—there’s now a new strike back against Ryan Reynolds’ wife, Blake Lively, who was \u003ca href=\"https://gizmodo.com/deadpool-and-wolverine-commentary-ryan-reynolds-levy-2000507752\"\u003efeatured in the film as Ladypool\u003c/a\u003e. This time, Baldoni’s team is bringing Marvel’s Kevin Feige and Disney’s Bob Iger into the fray.\u003c/p\u003e \u003cp\u003eAccording to \u003ca href=\"https://variety.com/2025/film/news/justin-baldoni-legal-letter-disney-marvel-nicepool-ryan-reynolds-1236274162/\"\u003eVariety\u003c/a\u003e, Baldoni’s lawyers are using the accusation as grounds for issuing a litigation hold letter which calls on Disney and Marvel Studios to retain “documents and data” in regards to Baldoni and “Nicepool.”\u003c/p\u003e \u003cp\u003eOver the course of the \u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e and \u003cem\u003eIt Ends With Us \u003c/em\u003epress tours, the rift between Baldoni and Lively (who starred opposite Baldoni in the Baldoni-directed film) became laden with public shots at one another over visibly creative differences. It all led up to Lively filing a lawsuit against Baldoni last December over misconduct allegations on the set of their drama; then, \u003cspan\u003eBaldoni \u003c/span\u003e\u003ca href=\"https://variety.com/2024/film/news/justin-baldoni-sues-new-york-times-blake-lively-allegations-story-1236263099/\" data-mrf-link=\"https://variety.com/2024/film/news/justin-baldoni-sues-new-york-times-blake-lively-allegations-story-1236263099/\"\u003ecountersued both Lively and the New York Times\u003c/a\u003e\u003cspan\u003e alleging that the actress and newspaper purposefully misconstrued leaked texts to support Lively’s case. \u003c/span\u003e\u003c/p\u003e \u003cp\u003eThe particular moments in \u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e that echo Lively’s claims against Baldoni include Nicepool’s lines about Ladypool “snapping back” into shape after having a baby and following that up with “It’s okay, I identify as a feminist”—since Baldoni touts his status as a feminist in his podcast. A deleted scene in \u003cem\u003eDeadpool \u0026amp; Wolverine\u003c/em\u003e also saw Nicepool making reference to a feminist podcast; that latter scene in particular helped the “Baldoni is Nicepool?” theory go viral.\u003c/p\u003e\n\n \u003cp\u003eThe litigation letter presented by Baldoni’s team asks Marvel and Disney to preserve “any and all documents relating to the development of the ‘Nicepool’ character” in addition to “communications relating to the development, writing, and filming of storylines and scenes featuring ‘Nicepool\u0026#39;” and “all documents relating to or reflecting a deliberate attempt to mock, harass, ridicule, intimidate, or bully Baldoni through the character of ‘Nicepool.’” Variety notes the letter it viewed was dated January 7; amid the ongoing fires in Los Angeles, not much has moved on that front as neither side has commented on the case since.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-14T23:45:55Z",
  "modifiedTime": "2025-01-14T23:45:55Z"
}
