{
  "id": "8ea8e8a1-2554-435d-bd9b-ee921750a368",
  "title": "The Live-Action ‘One Piece’ Has Found Its Tony Tony Chopper",
  "link": "https://gizmodo.com/netflix-one-piece-season-2-tony-chopper-first-look-2000609567",
  "description": "Mikaela Hoover will provide the voice and facial mocap for the Straw Hat's doctor in the Netflix adaptation's sophomore season.",
  "author": "James Whitbrook",
  "published": "Sun, 01 Jun 2025 00:48:55 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Television",
    "Netflix",
    "One Piece"
  ],
  "byline": "James Whitbrook",
  "length": 1875,
  "excerpt": "Mikaela Hoover will provide the voice and facial mocap for the Straw Hat's doctor in the Netflix adaptation's sophomore season.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "The Straw Hat crew will only continue to grow as Netflix sets sail on One Piece‘s second season, and now we’ve finally got our first glimpse at one of the most important additions of all: the arrival of the diminutive crew doctor, Tony Tony Chopper. During today’s Tudum livestream event, One Piece stars Iñaki Godoy, Mackenyu, Emily Rudd, Jacob Romero, and Taz Skylar took to the stage to reveal a special sneak peek at the upcoming season, which included the first look at the live-action series’ spin on Chopper. Check it out below! Chopper will be played by Guardians of the Galaxy Volume 3‘s Mikaela Hoover (she appeared there as Rocket Raccoon’s rabbit friend Floor, and will continue her professional relationship with James Gunn in Superman next month, where she’ll play media personality Cat Grant), who will provide both voicework and facial motion capture for the character. Introduced early on in One Piece after the events of the manga’s Drum Island arc, Chopper is an aspiring medic who wants to travel the world and expand his knowledge as a doctor. Oh, and he happens to be a reindeer who ate a devil fruit that turned him into a human-reindeer hybrid, which facilitated the whole interest in a career in medicine in the first place. Netflix is still staying mum about just when we’ll be able to see One Piece‘s return, beyond the fact that it’s coming next year, but Hoover is joining a veritable host of new faces that’ll appear in season two, including the likes of Katey Sagal, Joe Manganiello, David Dastmalchian, Clive Russell, James Hiroyuki Lio, and more. We’ll bring you more on Netflix’s plans for One Piece as and when we learn them. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/05/one-piece-netflix-season-2-tony-tony-chopper.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eThe Straw Hat crew will only continue to grow as \u003ca href=\"https://gizmodo.com/one-piece-live-action-review-manga-anime-fan-netflix-1850817576\"\u003eNetflix sets sail\u003c/a\u003e on \u003ca href=\"https://gizmodo.com/one-piece-season-2-finds-its-vivi-hints-at-yet-another-anime-timeline-wrinkle-2000490338\"\u003e\u003cem\u003eOne Piece\u003c/em\u003e‘s second season\u003c/a\u003e, and now we’ve finally got our first glimpse at one of the most important additions of all: the arrival of the diminutive crew doctor, Tony Tony Chopper.\u003c/p\u003e \u003cp\u003eDuring today’s Tudum livestream event, \u003cem\u003eOne Piece\u003c/em\u003e stars Iñaki Godoy, Mackenyu, Emily Rudd, Jacob Romero, and Taz Skylar took to the stage to reveal a special sneak peek at the upcoming season, which included the first look at the live-action series’ spin on Chopper. Check it out below!\u003c/p\u003e \u003cp\u003e\u003ciframe loading=\"lazy\" title=\"ONE PIECE: Season 2 | Chopper First Look | Netflix\" width=\"500\" height=\"281\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\" data-rocket-lazyload=\"fitvidscompatible\" data-lazy-src=\"https://www.youtube.com/embed/rT0r90co_EA?feature=oembed\"\u003e\u003c/iframe\u003e\u003c/p\u003e \u003cp\u003eChopper will be played by \u003cem\u003eGuardians of the Galaxy Volume 3\u003c/em\u003e‘s Mikaela Hoover (she appeared there as Rocket Raccoon’s rabbit friend Floor, and will continue her professional relationship with James Gunn in \u003cem\u003eSuperman\u003c/em\u003e next month, where she’ll play media personality Cat Grant), who will provide both voicework and facial motion capture for the character. Introduced early on in \u003cem\u003eOne Piece\u003c/em\u003e after the events of the manga’s Drum Island arc, Chopper is an aspiring medic who wants to travel the world and expand his knowledge as a doctor. Oh, and he happens to be a reindeer who ate a devil fruit that turned him into a human-reindeer hybrid, which facilitated the whole interest in a career in medicine in the first place.\u003c/p\u003e\n\n \u003cp\u003eNetflix is still staying mum about just when we’ll be able to see \u003cem\u003eOne Piece\u003c/em\u003e‘s return, beyond the fact that it’s coming next year, but Hoover is joining a veritable host of new faces that’ll appear in season two, including the likes of Katey Sagal, Joe Manganiello, David Dastmalchian, Clive Russell, James Hiroyuki Lio, and more.\u003c/p\u003e \u003cp\u003eWe’ll bring you more on Netflix’s plans for \u003cem\u003eOne Piece\u003c/em\u003e as and when we learn them.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-01T00:48:55Z",
  "modifiedTime": "2025-06-01T00:48:55Z"
}
