{
  "id": "8fce213f-ebbc-41ed-9280-85a3bac57a60",
  "title": "Microsoft Will Erase Your Passwords in 2 Weeks: What to Do Now",
  "link": "https://www.cnet.com/tech/microsoft-will-erase-your-passwords-in-2-weeks-what-to-do-now/#ftag=CAD590a51e",
  "description": "If the Authenticator app is your go-to password manager, you'll need to pick a new one soon.",
  "author": "Dashia Milden",
  "published": "Fri, 18 Jul 2025 23:00:00 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Dashia Milden",
  "length": 5266,
  "excerpt": "If the Authenticator app is your go-to password manager, you'll need to pick a new one soon.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Why You Can Trust CNET Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement If the Authenticator app is your go-to password manager, you'll need to pick a new one soon. Dashia is the consumer insights editor for CNET. She specializes in data-driven analysis and news at the intersection of tech, personal finance and consumer sentiment. Dashia investigates economic shifts and everyday challenges to help readers make well-informed decisions, and she covers a range of topics, including technology, security, energy and money. Dashia graduated from the University of South Carolina with a bachelor's degree in journalism. She loves baking, teaching spinning and spending time with her family. Microsoft is axing passwords starting in August -- and if you use its Authenticator app, you'll want to be prepared.For years, Microsoft Authenticator has been a go-to for managing multifactor authentication and saved passwords. However, starting next month, it will no longer support passwords and will move to passkeys instead. That means your logins will soon rely more on things like PINs, fingerprint scans or facial recognition. Using a passkey can make your account safer, and it's a move I'm excited about. I recently uncovered that 49% of US adults have risky password habits that can open the door to scammers getting access to your sensitive data.If you're a fan of Authenticator and not sure where to start before the switch, here are other password managers CNET recommends and steps you should take before August.When will Microsoft Authenticator stop supporting passwords?Microsoft Authenticator houses your passwords and lets you sign into all your Microsoft accounts using a PIN, facial recognition like Windows Hello, or other biometric data like a fingerprint. Authenticator can be used in other ways, such as verifying you're logging in if you forgot your password, or using two-factor authentication as an extra layer of security for your accounts. In June, the company stopped letting users add passwords to Authenticator.Starting this month, you won't be able to use the autofill password function. And next month, you'll no longer be able to use saved passwords.If you still want to use passwords instead of passkeys, you can store them in Microsoft Edge. However, CNET experts recommend adopting passkeys during this transition. \"Passkeys use public key cryptography to authenticate users, rather than relying on users themselves creating their own (often weak or reused) passwords to access their online accounts,\" Tomaschek said.Why are passkeys a better alternative to passwords?So what exactly is a passkey? It's a credential created by the Fast Identity Online Alliance that uses biometric data or a PIN to verify your identity and access your account. Think about using your fingerprint or Face ID to log into your account. That's generally safer than using a password that is easy to guess or susceptible to a phishing attack.\"Passwords can be cracked, whereas passkeys need both the public and the locally stored private key to authenticate users, which can help mitigate risks like falling victim to phishing and brute-force or credential-stuffing attacks,\" said Attila Tomaschek, CNET's software senior writer and digital security expert.Passkeys aren't stored on servers like passwords. Instead, they're stored only on your personal device. More conveniently, this takes the guesswork out of remembering your passwords and the need for a password manager.How to set up a passkey in Microsoft AuthenticatorMicrosoft said in a May 1 blog post that it will automatically detect the best passkey to set up and make that your default sign-in option. \"If you have a password and 'one-time code' set up on your account, we'll prompt you to sign in with your one-time code instead of your password. After you're signed in, you'll be prompted to enroll a passkey. Then the next time you sign in, you'll be prompted to sign in with your passkey,\" according to the blog post.To set up a new passkey, open your Authenticator app on your phone. Tap on your account and select \"Set up a passkey.\" You'll be prompted to log in with your existing credentials. After you're logged in, you can set up the passkey.Other password manager alternatives Since Microsoft will get rid of all of your passwords in two weeks, you'll need a new place to store your passwords safely. Tomaschek has a few of the best password manager recommendations after testing and reviewing several. The top recommendation is Bitwarden for its transparency. It's open-source and audited annually. From a price perspective, the free plan lets you store infinite passwords across unlimited devices. The free plan also includes features most password managers would charge for, including password sharing and a username and password generator. Bitwarden's upgraded plans have other upgraded features that could be worth the cost, too. Personally, Tomaschek has been using 1Password for a while, and he likes the interface and family plan. Even though it's second on the list, Tomaschek says it's just as good as Bitwarden.",
  "image": "https://www.cnet.com/a/img/resize/ba6cb5d2e0fe442bbcf800c794b4ceb426632b49/hub/2025/06/18/2fdc8606-3277-40bb-9392-ebc6fe4e994b/gettyimages-1296451468.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.cnet.com/a/neutron/images/logos/cnet-short.png\" alt=\"CNET logo\"/\u003e \u003cspan\u003eWhy You Can Trust CNET\u003c/span\u003e  \u003c/p\u003e \u003cp\u003e\u003cspan\u003eOur expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission.\u003c/span\u003e \u003cspan\u003e\u003ca href=\"https://www.cnet.com/tech/how-we-test-products-and-services/\"\u003eReviews ethics statement\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e \u003c/div\u003e    \u003cdiv\u003e \u003cp\u003e\n    If the Authenticator app is your go-to password manager, you\u0026#39;ll need to pick a new one soon.\n  \u003c/p\u003e \u003cdiv data-cy=\"globalAuthorImage\"\u003e\u003cdiv\u003e\u003cpicture\u003e \u003cimg src=\"https://www.cnet.com/a/img/resize/005a1b9473fab7a898c1589e1082580f33228199/hub/2024/04/17/64db3c1e-f925-4f30-9043-172acd8b6398/screenshot-2023-11-01-at-10-16-39-am.png?auto=webp\u0026amp;fit=crop\u0026amp;height=96\u0026amp;width=96\" alt=\"Headshot of Dashia Milden\" height=\"96\" width=\"96\"/\u003e\u003c/picture\u003e\u003c/div\u003e \u003cdiv section=\"authorCard\" id=\"author-card-0\"\u003e \u003cp\u003eDashia is the consumer insights editor for CNET. She specializes in data-driven analysis and news at the intersection of tech, personal finance and consumer sentiment. Dashia investigates economic shifts and everyday challenges to help readers make well-informed decisions, and she covers a range of topics, including technology, security, energy and money. Dashia graduated from the University of South Carolina with a bachelor\u0026#39;s degree in journalism. She loves baking, teaching spinning and spending time with her family.\u003c/p\u003e   \u003c/div\u003e\u003c/div\u003e\u003c/div\u003e \u003c/div\u003e\u003cdiv id=\"article-79df2b58-4b4e-4ef3-b173-9db4fbb34618\"\u003e\u003carticle\u003e\u003cp\u003eMicrosoft is axing passwords starting in August -- and if you use its Authenticator app, you\u0026#39;ll want to be prepared.\u003c/p\u003e\u003cp\u003eFor years, \u003ca href=\"https://www.microsoft.com/en-us/security/mobile-authenticator-app\" target=\"_self\"\u003eMicrosoft Authenticator\u003c/a\u003e has been a go-to for managing multifactor authentication and saved passwords. However, starting next month, it will no longer support passwords and will move to \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/google-moves-closer-to-a-future-without-passwords-with-passkey-syncing/\" rel=\"\"\u003e\u003cspan\u003epasskeys\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e instead. That means your logins will soon rely more on things like PINs, fingerprint scans or facial recognition. \u003c/p\u003e\u003cp\u003eUsing a passkey can make your account safer, and it\u0026#39;s a move I\u0026#39;m excited about. I recently uncovered that \u003ca href=\"https://www.cnet.com/tech/services-and-software/password-survey-2025/\" target=\"_self\"\u003e49% of US adults have risky password habits\u003c/a\u003e that can open the door to scammers getting access to your \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/scams-survey-2025/\" rel=\"\"\u003e\u003cspan\u003esensitive data\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;re a fan of Authenticator and not sure where to start before the switch, here are other \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/best-password-manager/\" rel=\"\"\u003e\u003cspan\u003epassword managers\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e CNET recommends and steps you should take before August.\u003c/p\u003e\u003ch2\u003eWhen will Microsoft Authenticator stop supporting passwords?\u003c/h2\u003e\u003cp\u003eMicrosoft Authenticator houses your passwords and lets you sign into all your Microsoft accounts using a PIN, facial recognition like Windows Hello, or other biometric data like a fingerprint. Authenticator can be used in other ways, such as verifying you\u0026#39;re logging in if you forgot your password, or using two-factor authentication as an extra layer of security for your accounts. In June, the company stopped letting users add passwords to Authenticator.\u003c/p\u003e\u003cp\u003eStarting this month, you won\u0026#39;t be able to use the autofill password function. And next month, you\u0026#39;ll no longer be able to use saved passwords.\u003c/p\u003e\u003cp\u003eIf you still want to use passwords instead of passkeys, you can store them in Microsoft Edge. However, CNET experts recommend adopting passkeys during this transition. \u0026#34;Passkeys use public key cryptography to authenticate users, rather than relying on users themselves creating their own (often weak or reused) passwords to access their online accounts,\u0026#34; Tomaschek said.\u003c/p\u003e\u003ch2\u003eWhy are passkeys a better alternative to passwords?\u003c/h2\u003e\u003cp\u003eSo what exactly is a \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/how-passkeys-will-usher-in-a-safer-passwordless-future/\" rel=\"\"\u003e\u003cspan\u003epasskey\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e? It\u0026#39;s a credential created by the Fast Identity Online Alliance that uses biometric data or a PIN to verify your identity and access your account. Think about using your fingerprint or Face ID to log into your account. That\u0026#39;s generally safer than using a password that is easy to guess or \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/phishing-emails-arent-as-obvious-anymore-heres-how-to-spot-them/\" rel=\"\"\u003e\u003cspan\u003esusceptible to a phishing attack\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;Passwords can be cracked, whereas passkeys need both the public and the locally stored private key to authenticate users, which can help mitigate risks like falling victim to phishing and brute-force or credential-stuffing attacks,\u0026#34; said Attila Tomaschek, CNET\u0026#39;s software senior writer and digital security expert.\u003c/p\u003e\u003cp\u003ePasskeys aren\u0026#39;t stored on servers like passwords. Instead, they\u0026#39;re stored only on your personal device. More conveniently, this takes the guesswork out of remembering your passwords and the need for a \u003cspan section=\"shortcodeLink\"\u003e\u003ca href=\"https://www.cnet.com/tech/services-and-software/best-password-manager/\" rel=\"\"\u003e\u003cspan\u003epassword manager\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\u003ch2\u003eHow to set up a passkey in Microsoft Authenticator\u003c/h2\u003e\u003cp\u003eMicrosoft said in a \u003ca href=\"https://www.microsoft.com/en-us/security/blog/2025/05/01/pushing-passkeys-forward-microsofts-latest-updates-for-simpler-safer-sign-ins/\" target=\"_self\"\u003eMay 1 blog post\u003c/a\u003e that it will automatically detect the best passkey to set up and make that your default sign-in option. \u0026#34;If you have a password and \u0026#39;one-time code\u0026#39; set up on your account, we\u0026#39;ll prompt you to sign in with your one-time code instead of your password. After you\u0026#39;re signed in, you\u0026#39;ll be prompted to enroll a passkey. Then the next time you sign in, you\u0026#39;ll be prompted to sign in with your passkey,\u0026#34; according to the blog post.\u003c/p\u003e\u003cp\u003eTo set up a new passkey, open your Authenticator app on your phone. Tap on your account and select \u0026#34;Set up a passkey.\u0026#34; You\u0026#39;ll be prompted to log in with your existing credentials. After you\u0026#39;re logged in, you can set up the passkey.\u003c/p\u003e\u003ch2\u003eOther password manager alternatives \u003c/h2\u003e\u003cp\u003eSince Microsoft will get rid of all of your passwords in two weeks, you\u0026#39;ll need a new place to store your passwords safely. Tomaschek has a few of the \u003ca href=\"https://www.cnet.com/tech/services-and-software/best-password-manager/\" target=\"_self\"\u003ebest password manager recommendations\u003c/a\u003e after testing and reviewing several. \u003c/p\u003e\u003cp\u003eThe top recommendation is \u003ca href=\"https://www.cnet.com/tech/services-and-software/bitwarden-review-the-best-free-password-manager-for-2022/\" target=\"_self\"\u003eBitwarden\u003c/a\u003e for its transparency. It\u0026#39;s open-source and audited annually. From a price perspective, the free plan lets you store infinite passwords across unlimited devices. The free plan also includes features most password managers would charge for, including password sharing and a username and password generator. \u003c/p\u003e\u003cp\u003eBitwarden\u0026#39;s upgraded plans have other upgraded features that could be worth the cost, too. \u003c/p\u003e\u003cp\u003ePersonally, Tomaschek has been using 1Password for a while, and he likes the interface and family plan. Even though it\u0026#39;s second on the list, Tomaschek says it\u0026#39;s just as good as Bitwarden. \u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-18T23:00:00Z",
  "modifiedTime": null
}
