{
  "id": "92512d44-bb48-47b3-91d8-07fedd50c5f3",
  "title": "Netflix Cracks Down on Discord to ID the Person Behind the ‘Worst Leak in Streaming History’",
  "link": "https://gizmodo.com/netflix-cracks-down-on-discord-to-id-the-person-behind-the-worst-leak-in-streaming-history-2000528713",
  "description": "Netflix issued Discord a subpoena asking the social platform to provide user information for suspects tied to its massive leak in August.",
  "author": "Isaiah Colbert",
  "published": "Fri, 22 Nov 2024 22:20:58 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Corporate Culture",
    "Arcane",
    "Netflix",
    "Ranma 1/2",
    "Squid Game"
  ],
  "byline": "Isaiah Colbert",
  "length": 3286,
  "excerpt": "Netflix issued Discord a subpoena asking the social platform to provide user information for suspects tied to its massive leak in August.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Back in August, Netflix suffered from a massive leak that saw full episodes of shows like Arcane, Terminator Zero, and Ranma 1/2 leak online ahead of their official release. At the time, Netflix released an official statement saying it was “actively taking action” against the perpetrator of the leaks, and now the streamer has set its sights on Discord to unveil the perpetrator behind the leaks. A new report from Polygon reveals that the Northern District of California court has issued a subpoena to Discord, demanding the social platform disclose information that could reveal the identity of a user implicated in the leak. According to Polygon, Netflix’s Discord subpoena earmarked an unreleased, copyrighted image from Squid Game season two, uploaded by user @jacejohns4n. In a now-deleted interview posted on Telegram, the leaker credited themselves with the person behind the “worst leak in streaming history.” “One of our post-production partners has been compromised and footage from several of our titles has unfortunately leaked online. Our team is aggressively taking action to have it taken down,” a Netflix spokesperson wrote to IGN at the time. As Polygon notes, the Netflix partner impacted is Lyuno, a California-based localization firm whose clients include major studios like Amazon Studios, BBC, Disney, DreamWorks, and HBO. At the time, IGN reported that the leaked shows populated on fringe websites like 4chan before circulating on other social media platforms like X/Twitter and TikTok. According to IGN, all of the aforementioned leaks featured burnt-in timestamps, watermarks, and unfinished animation renderings for Arcane‘s first and second act. Other Netflix series included in the leaks were animated films and TV shows like Plankton: The Movie, Spellbound, and Jentry Chau vs. The Underworld. A Lyuno spokesperson addressed the security breach and issued a statement on the company’s official website. “Protecting our clients’ confidentiality and ensuring the security of their content is our highest priority,” Lyuno wrote. “We are actively investigating this security breach to mitigate any potential risks and identify the responsible parties.” While Discord has yet to make an official statement on the matter, the Verge reports that Discord is already juggling a subpoena from MapleStory developer Nexon accusing the platform of refusing to comply with the Digital Millennium Copyright Act ordering it to disclose user information for folks sharing pirated copies of the game. “Discord is committed to fulfilling its obligations under the law, but acting as your copyright assertion partner is not one of them,” a lawyer representing Discord wrote in a letter regarding the Nexon case. As with most things, time will tell whether Netflix cracking down on Discord will unearth the identity of its leaker and what punishments will be doled out to them and other parties involved. Seeing as how much of the shows subjected to leaks are big marquee titles for Netflix, the streamer’s hammer of justice will likely be one for the ages. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/11/Netflix-Arcane-Caitlyn-Kiramman.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eBack in August, Netflix suffered from a massive leak that saw full episodes of shows like \u003cem\u003eArcane\u003c/em\u003e, \u003cem\u003eTerminator Zero\u003c/em\u003e, and \u003cem\u003eRanma 1/2\u003c/em\u003e leak online ahead of their official release. At the time, Netflix released an official statement saying it was \u003ca href=\"https://gizmodo.com/netflix-plans-to-take-action-after-major-animation-leak-2000485122\"\u003e“actively taking action”\u003c/a\u003e against the perpetrator of the leaks, and now the streamer has set its sights on Discord to unveil the perpetrator behind the leaks.\u003c/p\u003e \u003cp\u003eA new report from \u003ca href=\"https://www.polygon.com/entertainment/483584/netflix-squid-game-arcane-leaker-subpoena-discord\"\u003ePolygon\u003c/a\u003e reveals that the Northern District of California court has issued a \u003ca href=\"https://www.scribd.com/document/795644383/Discord-subpoena-via-Polygon\"\u003esubpoena\u003c/a\u003e to Discord, demanding the social platform disclose information that could reveal the identity of a user implicated in the leak. According to Polygon, Netflix’s Discord subpoena earmarked an unreleased, copyrighted image from \u003cem\u003eSquid Game \u003c/em\u003eseason two, uploaded by user @jacejohns4n. In a now-deleted interview \u003ca href=\"https://telegra.ph/Jace-Johnson-The-Man-who-Broke-the-Internet-09-10\"\u003eposted on Telegram\u003c/a\u003e, the leaker credited themselves with the person behind the “worst leak in streaming history.”\u003c/p\u003e \u003cp\u003e“One of our post-production partners has been compromised and footage from several of our titles has unfortunately leaked online. Our team is aggressively taking action to have it taken down,” a Netflix spokesperson wrote to \u003ca href=\"https://www.ign.com/articles/netflix-aggressively-taking-action-against-anime-leaks-crunchyroll-also-affected\"\u003eIGN\u003c/a\u003e at the time.\u003c/p\u003e\n\n \u003cp\u003eAs Polygon notes, the Netflix partner impacted is Lyuno, a California-based localization firm whose clients include major studios like Amazon Studios, BBC, Disney, DreamWorks, and HBO. At the time, IGN reported that the leaked shows populated on fringe websites like 4chan before circulating on other social media platforms like X/Twitter and TikTok. According to IGN, all of the aforementioned leaks featured burnt-in timestamps, watermarks, and unfinished animation renderings for \u003cem\u003eArcane\u003c/em\u003e‘s first and second act. Other Netflix series included in the leaks were animated films and TV shows like \u003cem\u003ePlankton: The Movie\u003c/em\u003e, \u003cem\u003eSpellbound\u003c/em\u003e, and\u003cem\u003e Jentry Chau vs. The Underworld\u003c/em\u003e.\u003c/p\u003e \u003cp\u003eA Lyuno spokesperson addressed the security breach and \u003ca href=\"https://iyuno.com/news/iyuno-security-incident-update\"\u003eissued a statement\u003c/a\u003e on the company’s official website.\u003c/p\u003e\n\n \u003cp\u003e“Protecting our clients’ confidentiality and ensuring the security of their content is our highest priority,” Lyuno wrote. “We are actively investigating this security breach to mitigate any potential risks and identify the responsible parties.”\u003c/p\u003e \u003cp\u003eWhile Discord has yet to make an official statement on the matter, \u003ca href=\"https://www.theverge.com/2024/10/16/24271854/discord-nexon-dmca-subpoena-copyright-piracy\"\u003ethe Verge\u003c/a\u003e reports that Discord is already \u003ca href=\"https://storage.courtlistener.com/recap/gov.uscourts.txnd.395421/gov.uscourts.txnd.395421.2.0.pdf\"\u003ejuggling a subpoena\u003c/a\u003e from \u003cem\u003eMapleStory\u003c/em\u003e developer Nexon accusing the platform of refusing to comply with the Digital Millennium Copyright Act ordering it to disclose user information for folks sharing pirated copies of the game.\u003c/p\u003e\n\n \u003cp\u003e“Discord is committed to fulfilling its obligations under the law, but acting as your copyright assertion partner is not one of them,” a lawyer representing Discord wrote in a letter \u003ca href=\"https://www.theverge.com/2024/10/16/24271854/discord-nexon-dmca-subpoena-copyright-piracy\"\u003eregarding the Nexon case\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eAs with most things, time will tell whether Netflix cracking down on Discord will unearth the identity of its leaker and what punishments will be doled out to them and other parties involved. Seeing as how much of the shows subjected to leaks are big marquee titles for Netflix, the streamer’s hammer of justice will likely be one for the ages.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-22T22:20:58Z",
  "modifiedTime": "2024-11-22T22:20:58Z"
}
