{
  "id": "9643889e-6d53-4aea-a480-6138397b5ec8",
  "title": "2025.22: What LLMs Could Be in the Workplace",
  "link": "https://stratechery.com/2025/what-llms-could-be-in-the-workplace/",
  "description": "The best Stratechery content from the week of May 26, 2025, including a human-agent epiphany, the danger of choosing to compete on the Internet, and the EU-China relationship.",
  "author": "Ben Thompson",
  "published": "Fri, 30 May 2025 10:00:00 +0000",
  "source": "http://stratechery.com/feed/",
  "categories": [
    "This Week in Stratechery"
  ],
  "byline": "",
  "length": 4291,
  "excerpt": "The best Stratechery content from the week of May 26, 2025, including a human-agent epiphany, the danger of choosing to compete on the Internet, and the EU-China relationship.",
  "siteName": "Stratechery by Ben Thompson",
  "favicon": "https://i0.wp.com/stratechery.com/wp-content/uploads/2018/03/cropped-android-chrome-512x512-1.png?fit=180%2C180\u0026ssl=1",
  "text": "Welcome back to This Week in Stratechery! As a reminder, each week, every Friday, we’re sending out this overview of content in the Stratechery bundle; highlighted links are free for everyone. Additionally, you have complete control over what we send to you. If you don’t want to receive This Week in Stratechery emails (there is no podcast), please uncheck the box in your delivery settings. On that note, here were a few of our favorites this week. A Human-Agent Epiphany. One of the things that is so exciting about AI isn’t just that it makes for a fascinating topic to write and talk about: it’s also a technology that actually impacts my day-to-day life. All of the consumer-facing AI apps, however, assume that one person is using AI, while many of the enterprise use cases are about replacing workers completely. What was genuinely thrilling to me was discovering a use-case in the middle: AI as collaboration tool. That’s exactly what I discovered while attending to Stratechery’s administrative side, and wrote about it in Tuesday’s Daily Update (and talked about it on Thursday’s Sharp Tech). — Ben Thompson The Danger of Choosing to Compete on the Internet. The end of Wednesday’s Daily Update is ostensibly about the sports streaming landscape, but it also probes at a theme that businesses have been learning over and over again for the past decade. Leaving the analog world and all the advantages it afforded incumbents — brick and mortar retail, movie theater distribution, cable bundles — means these businesses suddenly find themselves in a perpetual competition for customers in a landscape full of new rivals and devoid of any of the friction that once buttressed their dominance. In other words, leagues like the NBA want the audience that streaming platforms can deliver, but they may have the same, humbling experience that Nike’s had in e-commerce, or that HBO’s had in its competition with Netflix.— AS Et Tu, EU? The state of the US trade policy has been changing by the hour this week, but Thursday’s Sharp China shifted its focus to Europe, where reports indicate that EU leaders are open to working with the US government to develop China tariffs of their own. We talked about the challenges inherent to devising any such policies among 27 member countries with varied interests (and varied relationships with China), as well as core challenges in the EU-China relationship that have prevented the EU from deepening its trade alliances with the PRC. Get caught up on all of it here, where we also covered the legacy of China’s “Made in China 2025” policy and Xi Jinping’s approach to political rivals. — AS Stratechery Articles and Updates Claude 4, Anthropic Agents, Human-AI Agents — Anthropic is focused on the agent opportunity, which requires scaffolding; meanwhile, I think there is a huge underserved opportunity in multi-user AI chatbots. The ESPN Streaming Service, The Status of U.S. Sports Rights, The Danger of Intentionality— The ESPN streaming service is official, completing the transition of sports watching from inevitability to intentionality. An Interview with Plaid Founder and CEO Zach Perret About Plumbing Trust — An interview with Plaid co-founder and CEO Zach Perret about building trust as an ingredient brand in financial services. Dithering with Ben Thompson and Daring Fireball’s John Gruber Apple, Google, and AI Meta and the Military Asianometry with Jon Yu South Africa’s Crumbling, Corrupt Electricity Monopoly Sharp China with Andrew Sharp and Sinocism’s Bill Bishop Made in China 2025 and What Comes Next; EV Price Wars; The EU and Its China Dilemmas; Xi and His Rivals Greatest of All Talk with Andrew Sharp and WaPo’s Ben Golliver Shai Wins the MVP and Plays Like One, A Nationwide Referendum on Officiating, The Beginning of the Thunder Era A Classic Game 4 in Minneapolis, What Went Wrong for Anthony Edwards, Where to Rank Haliburton? Sharp Tech with Andrew Sharp and Ben Thompson The End of the Ad-Supported Internet, Imagining What Comes Next, A Human-AI Agent PSA This week’s Stratechery video is on The Agentic Web and Original Sin. Get notified about new Articles Please verify your email address to proceed.",
  "image": "https://149384716.v2.pressablecdn.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg data-recalc-dims=\"1\" fetchpriority=\"high\" decoding=\"async\" width=\"1700\" height=\"1190\" src=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356.jpg?resize=1700%2C1190\u0026amp;ssl=1\" alt=\"\" srcset=\"https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg?resize=1700%2C1190\u0026amp;ssl=1 1700w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg?resize=300%2C210\u0026amp;ssl=1 300w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg?resize=768%2C538\u0026amp;ssl=1 768w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg?resize=1536%2C1075\u0026amp;ssl=1 1536w, https://i0.wp.com/stratechery.com/wp-content/uploads/2025/05/GettyImages-2211086356-scaled.jpg?resize=2048%2C1434\u0026amp;ssl=1 2048w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWelcome back to This Week in Stratechery!\u003c/p\u003e\n\n\n\n\u003cp\u003eAs a reminder, each week, every Friday, we’re sending out this overview of content in the Stratechery bundle; \u003cspan\u003ehighlighted links are free for everyone\u003c/span\u003e. Additionally, you have complete control over what we send to you. If you don’t want to receive This Week in Stratechery emails (there is no podcast), please uncheck the box in \u003ca href=\"https://stratechery.passport.online/member/account/delivery\"\u003eyour delivery settings\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn that note, here were a few of our favorites this week.\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eA Human-Agent Epiphany. \u003c/strong\u003eOne of the things that is so exciting about AI isn’t just that it makes for a fascinating topic to write and talk about: it’s also a technology that actually impacts my day-to-day life. All of the consumer-facing AI apps, however, assume that one person is using AI, while many of the enterprise use cases are about replacing workers completely. What was genuinely thrilling to me was discovering a use-case in the middle: AI as collaboration tool. That’s exactly what I discovered while attending to Stratechery’s administrative side, and wrote about it in \u003ca href=\"https://stratechery.com/2025/claude-4-anthropic-agents-human-ai-agents/\"\u003eTuesday’s Daily Update\u003c/a\u003e (and talked about it on \u003ca href=\"https://sharptech.fm/member/episode/the-end-of-the-ad-supported-internet-imagining-what-comes-next-a-human-ai-agent-psa\"\u003eThursday’s Sharp Tech\u003c/a\u003e). — \u003cem\u003eBen Thompson\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThe Danger of Choosing to Compete on the Internet. \u003c/strong\u003eThe end of Wednesday’s Daily Update is \u003ca href=\"https://stratechery.com/2025/the-espn-streaming-service-the-status-of-u-s-sports-rights-the-danger-of-intentionality/\"\u003eostensibly about the sports streaming landscape\u003c/a\u003e, but it also probes at a theme that businesses have been learning over and over again for the past decade. Leaving the analog world and all the advantages it afforded incumbents — brick and mortar retail, movie theater distribution, cable bundles — means these businesses suddenly find themselves in a perpetual competition for customers in a landscape full of new rivals and devoid of any of the friction that once buttressed their dominance. In other words, leagues like the NBA want the audience that streaming platforms can deliver, but they may have the same, humbling experience that Nike’s had in e-commerce, or that HBO’s had in its competition with Netflix.\u003cem\u003e—\u003c/em\u003e \u003cem\u003eAS\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eEt Tu, EU? \u003c/strong\u003eThe state of the US trade policy has been changing by the hour this week, but \u003ca href=\"https://sharpchina.fm/member/episode/made-in-china-2025-and-what-comes-next-ev-price-wars-the-eu-and-its-china-dilemmas-xi-and-his-rivals\"\u003eThursday’s Sharp China shifted its focus to Europe\u003c/a\u003e, where reports indicate that EU leaders are open to working with the US government to develop China tariffs of their own. We talked about the challenges inherent to devising any such policies among 27 member countries with varied interests (and varied relationships with China), as well as core challenges in the EU-China relationship that have prevented the EU from deepening its trade alliances with the PRC. Get caught up on all of it here, where we also covered the legacy of China’s “Made in China 2025” policy and Xi Jinping’s approach to political rivals. \u003cem\u003e—\u003c/em\u003e \u003cem\u003eAS\u003c/em\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003ch3\u003eStratechery Articles and Updates\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://stratechery.com/2025/claude-4-anthropic-agents-human-ai-agents/\"\u003eClaude 4, Anthropic Agents, Human-AI Agents\u003c/a\u003e \u003cem\u003e— Anthropic is focused on the agent opportunity, which requires scaffolding; meanwhile, I think there is a huge underserved opportunity in multi-user AI chatbots.\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://stratechery.com/2025/the-espn-streaming-service-the-status-of-u-s-sports-rights-the-danger-of-intentionality/\"\u003eThe ESPN Streaming Service, The Status of U.S. Sports Rights, The Danger of Intentionality\u003c/a\u003e\u003cem\u003e— The ESPN streaming service is official, completing the transition of sports watching from inevitability to intentionality.\u003c/em\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://stratechery.com/2025/an-interview-with-plaid-founder-and-ceo-zach-perret-about-plumbing-trust/\"\u003eAn Interview with Plaid Founder and CEO Zach Perret About Plumbing Trust\u003c/a\u003e \u003cem\u003e— An interview with Plaid co-founder and CEO Zach Perret about building trust as an ingredient brand in financial services.\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eDithering with Ben Thompson and Daring Fireball’s John Gruber\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://dithering.passport.online/member/episode/apple-google-and-ai\" data-type=\"link\" data-id=\"https://dithering.passport.online/member/episode/apple-google-and-ai\"\u003eApple, Google, and AI\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://dithering.passport.online/member/episode/meta-and-the-military\" data-type=\"link\" data-id=\"https://dithering.passport.online/member/episode/meta-and-the-military\"\u003eMeta and the Military\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eAsianometry with Jon Yu\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://asianometry.passport.online/member/episode/south-africas-crumbling-corrupt-electricity-monopoly\" data-type=\"link\" data-id=\"https://asianometry.passport.online/member/episode/south-africas-crumbling-corrupt-electricity-monopoly\"\u003eSouth Africa’s Crumbling, Corrupt Electricity Monopoly\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eSharp China with Andrew Sharp and Sinocism’s Bill Bishop\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://sharpchina.fm/member/episode/made-in-china-2025-and-what-comes-next-ev-price-wars-the-eu-and-its-china-dilemmas-xi-and-his-rivals\" data-type=\"link\" data-id=\"https://sharpchina.fm/member/episode/made-in-china-2025-and-what-comes-next-ev-price-wars-the-eu-and-its-china-dilemmas-xi-and-his-rivals\"\u003eMade in China 2025 and What Comes Next; EV Price Wars; The EU and Its China Dilemmas; Xi and His Rivals\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eGreatest of All Talk with Andrew Sharp and WaPo’s Ben Golliver\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://goat.passport.online/member/episode/shai-wins-the-mvp-and-plays-like-one-a-nationwide-referendum-on-officiating-the-beginning-of-the-thunder-era\" data-type=\"link\" data-id=\"https://goat.passport.online/member/episode/shai-wins-the-mvp-and-plays-like-one-a-nationwide-referendum-on-officiating-the-beginning-of-the-thunder-era\"\u003eShai Wins the MVP and Plays Like One, A Nationwide Referendum on Officiating, The Beginning of the Thunder Era\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://goat.passport.online/member/episode/a-classic-game-4-in-minneapolis-what-went-wrong-for-anthony-edwards-where-to-rank-haliburton\" data-type=\"link\" data-id=\"https://goat.passport.online/member/episode/a-classic-game-4-in-minneapolis-what-went-wrong-for-anthony-edwards-where-to-rank-haliburton\"\u003eA Classic Game 4 in Minneapolis, What Went Wrong for Anthony Edwards, Where to Rank Haliburton?\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eSharp Tech with Andrew Sharp and Ben Thompson\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://sharptech.fm/member/episode/the-end-of-the-ad-supported-internet-imagining-what-comes-next-a-human-ai-agent-psa\" data-type=\"link\" data-id=\"https://sharptech.fm/member/episode/the-end-of-the-ad-supported-internet-imagining-what-comes-next-a-human-ai-agent-psa\"\u003eThe End of the Ad-Supported Internet, Imagining What Comes Next, A Human-AI Agent PSA\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis week’s Stratechery video is on \u003ca href=\"https://stratechery.com/2025/the-agentic-web-and-original-sin/\" data-tokenize=\"true\" data-tokenize-id=\"e9witydxb5\"\u003e\u003cspan\u003eThe Agentic Web and Original Sin\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"The Agentic Web and Original Sin\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Lf5wZ4ZxuSA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\u003c/div\u003e\u003cdiv\u003e\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eGet notified about new Articles\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\n\n\n\n\n\n\n\u003cp\u003ePlease verify your email address to proceed.\u003c/p\u003e\n\n\n\n\u003c/div\u003e\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-30T10:00:00Z",
  "modifiedTime": "2025-05-30T10:14:33Z"
}
