{
  "id": "987cfa4a-4106-4a21-8d7d-31ccd30f042d",
  "title": "Why Siri's AI Upgrades Keep Getting Pushed Back",
  "link": "https://lifehacker.com/tech/siris-apple-intelligence-upgrade-status?utm_medium=RSS",
  "description": "It's anyone's guess when we'll see these new features.",
  "author": "Jake Peterson",
  "published": "Fri, 11 Apr 2025 19:30:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Apple"
  ],
  "byline": "Jake Peterson",
  "length": 7731,
  "excerpt": "It's anyone's guess when we'll see these new features.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "It's anyone's guess when we'll see these new features. Credit: Apple/YouTube When Apple first revealed Apple Intelligence, its slate of generative AI features, a huge part of that announcement was a super-charged Siri. No longer would Apple's digital assistant be lagging behind competitors like Google: With the power of AI, the new Siri might actually be useful.When Apple Intelligence drops in full, Siri will reportedly be much more contextually aware, and be able to scan what's on your phone to understand and answer questions you ask. If your friend sends you their new address, you can ask Siri \"add this address to their contact card.\" You don't need to specify which address or which contact, because the assistant will, according to Apple, be able to understand that by what's currently on-screen. Another huge feature is the ability to ask Siri to take action for you: You can ask Siri to send an email you have in your drafts, edit an image on your behalf, or add a photo to a specific note. If your iPhone is compatible with Apple Intelligence, you might have assumed it supports this new Siri. iOS 18 has been out for a bit, after all, and Apple has been pushing Apple Intelligence (and the new Siri) hard, including with a campaign featuring Bella Ramsey. Some Apple Store employees even started a chant about AI during the iPhone 16 launch.A waiting gameThe thing is, the new Siri isn't here yet. Apple did upgrade Siri a bit with iOS 18.1, and its the first wave of new AI features: That includes Siri's new design, which glows around the edges of the display; the ability to type to Siri by double-tapping on the bottom of the screen; Siri's ability to understand requests even when you misspeak; and a new feature that turns Siri into impromptu tech support (e.g., \"How do I turn off Do Not Disturb?\").But iOS 18.1 came and went without any further updates to Siri. iOS 18.2 added more Apple Intelligence features, including ChatGPT integration, but no major Siri changes. iOS 18.3 was a smaller update (Apple even disabled notification summaries for certain alert types), but, again, skipped any upgrades for Siri. At one point, iOS 18.4 appeared to be the likeliest Siri update, but, alas, no dice. (It does bring a number of new features, though.)It's not clear when Siri's full form will arriveAnyone hotly anticipating Siri's AI promise will need to keep waiting. Bloomberg's Mark Gurman reported back in September that Apple was planning on rolling out most of Siri's big features by iOS 18.4. However, shortly before Apple dropped the first 18.4 beta in February, Gurman said issues and bugs are plaguing the engineering team, who are having trouble getting Siri's AI features working consistently. (More on that below.) As a result, Siri could be delayed even further. It turned out his reporting was correct.Back in February, Gurman's report said Apple hoped to ship these new AI Siri features with iOS 18.5, which will likely roll out sometime in May. Sadly, that doesn't appear to be the case: Apple rolled out the first iOS 18.5 beta at the beginning of April, with no new Siri features to be found—though you can bring the look of the old Mail app back.Now, the attention turns not to another version of iOS 18, but iOS 19 instead. The New York Times reports that Apple plans on introducing an AI-powered Siri capable of tasks like editing and sending a photo to a contact sometime in the fall. That would put the new Siri on track to release with Apple's next big operating system—one full year after AI Siri was originally supposed to launch. This tracks with some earlier reports from Gurman, who said Apple was planning a major Siri overhaul for iOS 19 (and likely iOS 19.4). To get Siri working with AI on iOS 18, Gurman says Apple has had to separate Siri into two parts—or brains, as he puts it: One brain handles the traditional Siri tasks we've come to know over the years (setting reminders, making calls, choosing a song, etc.), while the other handles the new AI features. Ideally, these two brains would be morphed into one, to offer the most complete Siri experience possible. That simply isn't ready yet. Whenever these Siri features do arrive, they'll be a bit underpowered compared to what Apple wants them to be—until it can roll out a rebuilt, unified Siri. Apple also reportedly wanted to make Siri more conversational, perhaps akin to ChatGPT's Voice Mode, but, like other Apple AI features, it's also delayed, and probably won't be shown off at WWDC. In fact, it might not arrive until iOS 20, as late as 2027. Who knows where competitors like ChatGPT will be by then. What do you think so far? Siri has been a disaster at Apple HQApple's digital assistant has had issues for years, but the current situation has been truly disastrous. Sources tell The Information (via MacRumors) that a lack of leadership within Apple has caused slowdowns and hiccups for both Siri and AI in general. Strategies—like whether to build two different AI models or stick with one—were repeatedly changed, causing staff to flee. Siri was passed around internally like a \"hot potato,\" while Apple's AI/ML program was nicknamed \"AIMless.\" The company didn't respond seriously to ChatGPT's launch, and by the time it did, its tech was way behind OpenAI's. Certain tasks, like dropping the \"Hey\" from \"Hey Siri,\" took two years to get right, while others, like voice commands to control apps in Vision Pro, were dropped altogether. The worst claim, however, was that the AI Siri demo that showed off these still in-the-works features was basically made up. Siri engineers had never even seen those features in action before Apple showed them off at WWDC.The good news is, under new leadership from Craig Federighi and Mike Rockwell, employee moral appears on the rise. Perhaps the change will push Apple to get Siri in shape for iOS 19, but only time will tell. Not all iPhones will get new Siri featuresWhile Apple supports iPhone as old as the XS with iOS 18, not many iPhones will actually get these new Siri features. That's because Apple Intelligence is limited to iPhone 15 Pro, iPhone 15 Pro Max, and the iPhone 16 series—including the new iPhone 16e. If you have an iPhone 15 or older, you won't see these new upgrades, even when you update to iOS 18.5, or whichever update contains the AI-overhauled Siri. Jake Peterson Senior Technology Editor Jake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026 TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut. Read Jake's full bio",
  "image": "https://lifehacker.com/imagery/articles/01J8FJNJS16CR1J5VK13Q09SM4/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eIt\u0026#39;s anyone\u0026#39;s guess when we\u0026#39;ll see these new features.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01J8FJNJS16CR1J5VK13Q09SM4/hero-image.fill.size_1248x702.v1727102735.jpg\" alt=\"Siri with Apple Intelligence\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01J8FJNJS16CR1J5VK13Q09SM4/hero-image.fill.size_400x225.v1727102735.jpg 400w, https://lifehacker.com/imagery/articles/01J8FJNJS16CR1J5VK13Q09SM4/hero-image.fill.size_800x450.v1727102735.jpg 800w, https://lifehacker.com/imagery/articles/01J8FJNJS16CR1J5VK13Q09SM4/hero-image.fill.size_1248x702.v1727102735.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Apple/YouTube\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eWhen Apple first revealed \u003ca href=\"https://lifehacker.com/tech/apple-bringing-ai-to-iphone-ipad-mac-wwdc\" target=\"_blank\"\u003eApple Intelligence\u003c/a\u003e, its slate of generative AI features, a huge part of that announcement was a super-charged Siri. No longer would Apple\u0026#39;s digital assistant be lagging behind competitors like Google: With the power of AI, the new Siri might actually be useful.\u003c/p\u003e\u003cp\u003eWhen Apple Intelligence drops in full, Siri will reportedly be much more contextually aware, and be able to scan what\u0026#39;s on your phone to understand and answer questions you ask. If your friend sends you their new address, you can ask Siri \u0026#34;add this address to their contact card.\u0026#34; You don\u0026#39;t need to specify which address or which contact, because the assistant will, according to Apple, be able to understand that by what\u0026#39;s currently on-screen. Another huge feature is the ability to ask Siri to take action for you: You can ask Siri to send an email you have in your drafts, edit an image on your behalf, or add a photo to a specific note. \u003c/p\u003e\u003cp\u003eIf your iPhone is compatible with Apple Intelligence, you might have assumed it supports this new Siri. \u003ca href=\"https://lifehacker.com/tech/customizations-you-should-make-ios-18\" target=\"_blank\"\u003eiOS 18\u003c/a\u003e has been out for a bit, after all, and Apple has been pushing Apple Intelligence (and the new Siri) hard, including with a campaign featuring Bella Ramsey. Some Apple Store employees even \u003ca href=\"https://x.com/9to5mac/status/1837100093905698884?s=46\u0026amp;t=tBuSe67d3hmxWnw3I8sPmg\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003estarted a chant about AI during the iPhone 16 launch\u003c/a\u003e.\u003c/p\u003e\u003ch2 id=\"a-waiting-game\"\u003eA waiting game\u003c/h2\u003e\u003cp\u003eThe thing is, the new Siri isn\u0026#39;t here yet. Apple did upgrade Siri a bit with iOS 18.1, and its \u003ca href=\"https://lifehacker.com/tech/how-to-try-apple-intelligence-right-now\" target=\"_blank\"\u003ethe first wave of new AI features\u003c/a\u003e: That includes Siri\u0026#39;s new design, which glows around the edges of the display; the ability to type to Siri by double-tapping on the bottom of the screen; Siri\u0026#39;s ability to understand requests even when you misspeak; and a new feature that turns Siri into impromptu tech support (e.g., \u0026#34;How do I turn off Do Not Disturb?\u0026#34;).\u003c/p\u003e\u003cp\u003eBut iOS 18.1 came and went without any further updates to Siri. \u003ca href=\"https://lifehacker.com/tech/ios-182-is-here-with-new-apple-intelligence-features\" target=\"_blank\"\u003eiOS 18.2 added more Apple Intelligence features\u003c/a\u003e, including ChatGPT integration, but no major Siri changes. \u003ca href=\"https://lifehacker.com/tech/whats-new-ios-183\" target=\"_blank\"\u003eiOS 18.3 was a smaller update\u003c/a\u003e (Apple even \u003ca href=\"https://lifehacker.com/tech/apples-latest-ios-beta-quietly-kills-ai-news-notifications\" target=\"_blank\"\u003edisabled notification summaries for certain alert types\u003c/a\u003e), but, again, skipped any upgrades for Siri. At one point, iOS 18.4 appeared to be the likeliest Siri update, but, alas, no dice. (\u003ca href=\"https://lifehacker.com/tech/here-are-all-the-new-features-in-ios-184\" target=\"_blank\"\u003eIt does bring a number of new features\u003c/a\u003e, though.)\u003c/p\u003e\u003ch2 id=\"its-not-clear-when-siris-full-form-will-arrive\"\u003eIt\u0026#39;s not clear when Siri\u0026#39;s full form will arrive\u003c/h2\u003e\u003cp\u003eAnyone hotly anticipating Siri\u0026#39;s AI promise will need to keep waiting. \u003ca href=\"https://www.techradar.com/phones/iphone/the-siri-apple-intelligence-overhaul-youve-been-waiting-for-could-come-sooner-than-expected\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eBloomberg\u0026#39;s Mark Gurman reported back in September\u003c/a\u003e that Apple was planning on rolling out most of Siri\u0026#39;s big features by iOS 18.4. However, shortly before Apple dropped the first 18.4 beta in February, \u003ca href=\"https://www.macrumors.com/2025/02/14/apple-intelligence-siri-overhaul-could-get-delayed/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eGurman said issues and bugs are plaguing the engineering team\u003c/a\u003e, who are having trouble getting Siri\u0026#39;s AI features working consistently. (More on that below.) As a result, Siri could be delayed even further. It turned out his reporting was correct.\u003c/p\u003e\u003cp\u003eBack in February, Gurman\u0026#39;s report said Apple hoped to ship these new AI Siri features with iOS 18.5, which will likely roll out sometime in May. Sadly, that doesn\u0026#39;t appear to be the case: Apple rolled out the first iOS 18.5 beta at the beginning of April, with no new Siri features to be found—though you can \u003ca href=\"https://lifehacker.com/tech/you-can-bring-back-minimal-apple-mail-iphone-layout\" target=\"_blank\"\u003ebring the look of the old Mail app back\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eNow, the attention turns not to another version of iOS 18, but iOS 19 instead. \u003ca href=\"https://www.nytimes.com/2025/04/11/technology/apple-issues-trump-tariffs.html\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eThe New York Times reports\u003c/a\u003e that Apple plans on introducing an AI-powered Siri capable of tasks like editing and sending a photo to a contact sometime in the fall. That would put the new Siri on track to release with Apple\u0026#39;s next big operating system—one full year after AI Siri was originally supposed to launch.  \u003c/p\u003e\u003cp\u003eThis tracks with some earlier reports from Gurman, who said Apple was planning a \u003cem\u003emajor\u003c/em\u003e Siri overhaul for iOS 19 (and likely iOS 19.4). To get Siri working with AI on iOS 18, Gurman says \u003ca href=\"https://www.bloomberg.com/news/newsletters/2025-03-02/apple-siri-compared-with-alexa-m4-macbook-air-and-ipad-air-2025-coming-soon-m7rn2k2y\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eApple has had to separate Siri into two parts\u003c/a\u003e—or brains, as he puts it: One brain handles the traditional Siri tasks we\u0026#39;ve come to know over the years (setting reminders, making calls, choosing a song, etc.), while the other handles the new AI features. Ideally, these two brains would be morphed into one, to offer the most complete Siri experience possible. That simply isn\u0026#39;t ready yet. Whenever these Siri features do arrive, they\u0026#39;ll be a bit underpowered compared to what Apple wants them to be—until it can roll out a rebuilt, unified Siri.  \u003c/p\u003e\u003cp\u003eApple also reportedly wanted to make Siri more conversational, perhaps akin to \u003ca href=\"https://lifehacker.com/tech/chatgpt-advanced-voice-mode-is-out-now\" target=\"_blank\"\u003eChatGPT\u0026#39;s Voice Mode\u003c/a\u003e, but, like other Apple AI features, it\u0026#39;s also delayed, and probably won\u0026#39;t be shown off at WWDC. In fact, it might not arrive until iOS 20, as late as 2027. Who knows where competitors like ChatGPT will be by then.  \u003c/p\u003e\u003cdiv x-cloak=\"\" x-data=\"{ commentsCount: null }\" x-init=\"commentsCount = await window.openweb.getMessagesCount(119755)\" x-show=\"commentsCount !== null \u0026amp;\u0026amp; commentsCount \u0026gt; 0\"\u003e\n            \n\n            \u003cp\u003e\u003cspan\u003eWhat do you think so far? \u003c/span\u003e\n        \u003c/p\u003e\u003c/div\u003e\n\u003ch2 id=\"siri-has-been-a-disaster-at-apple-hq\"\u003eSiri has been a disaster at Apple HQ\u003c/h2\u003e\u003cp\u003eApple\u0026#39;s digital assistant has had issues for years, but the current situation has been truly disastrous. Sources tell The Information (\u003ca href=\"https://www.macrumors.com/2025/04/10/chaos-behind-siri-revealed/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003evia MacRumors\u003c/a\u003e) that a lack of leadership within Apple has caused slowdowns and hiccups for both Siri and AI in general.    \u003c/p\u003e\u003cp\u003eStrategies—like whether to build two different AI models or stick with one—were repeatedly changed, causing staff to flee. Siri was passed around internally like a \u0026#34;hot potato,\u0026#34; while Apple\u0026#39;s AI/ML program was nicknamed \u0026#34;AIMless.\u0026#34; The company didn\u0026#39;t respond seriously to ChatGPT\u0026#39;s launch, and by the time it did, its tech was way behind OpenAI\u0026#39;s. Certain tasks, like dropping the \u0026#34;Hey\u0026#34; from \u0026#34;Hey Siri,\u0026#34; took two years to get right, while others, like voice commands to control apps in Vision Pro, were dropped altogether. \u003c/p\u003e\u003cp\u003eThe worst claim, however, was that the AI Siri demo that showed off these still in-the-works features was basically made up. Siri engineers had never even seen those features in action before Apple showed them off at WWDC.\u003c/p\u003e\u003cp\u003eThe good news is, under new leadership from Craig Federighi and Mike Rockwell, employee moral appears on the rise. Perhaps the change will push Apple to get Siri in shape for iOS 19, but only time will tell.    \u003c/p\u003e\u003ch2 id=\"not-all-iphones-will-get-new-siri-features\"\u003eNot all iPhones will get new Siri features\u003c/h2\u003e\u003cp\u003eWhile Apple supports iPhone as old as the XS with iOS 18, not many iPhones will actually get these new Siri features. That\u0026#39;s because Apple Intelligence is limited to iPhone 15 Pro, iPhone 15 Pro Max, and the iPhone 16 series—\u003ca href=\"https://lifehacker.com/tech/how-iphone-16e-compares-to-iphone-16\" target=\"_blank\"\u003eincluding the new iPhone 16e\u003c/a\u003e. If you have an iPhone 15 or older, you won\u0026#39;t see these new upgrades, even when you update to iOS 18.5, or whichever update contains the AI-overhauled Siri.\u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \u003cdiv\u003e\n                \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/authors/01HF2FBCM600PS5NXSJXJA1AKJ/image.fill.size_150x150.v1704301306.png\" alt=\"artist rendition of Jake Peterson\" width=\"150\" height=\"150\" loading=\"lazy\"/\u003e\n                                            \u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eJake Peterson\u003c/p\u003e\n                                    \u003cp\u003eSenior Technology Editor\u003c/p\u003e\n                                \u003cdiv\u003e\n                                            \u003cp\u003eJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film \u0026amp; TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the \u003ca href=\"https://lifehacker.com/tech/living-with-ai\" target=\"_blank\"\u003ebest uses of AI in your daily life\u003c/a\u003e to \u003ca href=\"https://lifehacker.com/okay-which-macbook-should-you-buy-1849330413\" target=\"_blank\"\u003ewhich MacBook to buy\u003c/a\u003e. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\u003c/p\u003e\n                                    \u003c/div\u003e\n                \u003cp\u003e\u003ca href=\"https://lifehacker.com/author/jakepeterson\"\u003eRead Jake\u0026#39;s full bio\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\n                                                                                                                            \u003cli\u003e\n                                \u003ca href=\"https://lifehacker.com/cdn-cgi/l/email-protection#d1bba1b4a5b4a3a2bebf91bdb8b7b4b9b0b2bab4a3ffb2bebc\" title=\"Send an Email (Opens in a new tab)\" aria-label=\"Send Jake an email\" rel=\"noopener\" target=\"_blank\"\u003e\n                                    \u003csvg\u003e\n                                        \u003cuse href=\"/images/icons/spritemap.svg#sprite-envelope\"\u003e\u003c/use\u003e\n                                    \u003c/svg\u003e\n                                \u003c/a\u003e\n                            \u003c/li\u003e\n                                            \u003c/ul\u003e\n                            \u003c/div\u003e\n        \u003c/div\u003e\n                \u003cdiv\u003e\n                                            \n                        \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"1\" data-ga-label=\"Microsoft Edge Recently Got a Speed Boost\" href=\"https://lifehacker.com/tech/microsoft-edge-just-got-a-speed-boost\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JRJR0JQNR5F9711V3K5CJ9ZF/hero-image.fill.size_75x75.v1744388848.png\" alt=\"microsoft edge logo\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                    \u003cdiv data-ga-module=\"latest-stories\" data-ga-element=\"latest-stories-stripe\" data-ga-action=\"latest-stories-stripe\"\u003e\n                \n                \u003cp\u003e\u003ca data-ga-click=\"\" data-ga-item=\"image\" data-ga-position=\"2\" data-ga-label=\"ChatGPT Will Soon Remember Everything You\u0026#39;ve Ever Told It\" href=\"https://lifehacker.com/tech/chatgpt-memory-remembers-everything-youve-said\"\u003e\n                    \u003cimg src=\"https://lifehacker.com/imagery/articles/01JRGHJ1GA4K6X2VYXMKMS7XC4/hero-image.fill.size_75x75.v1744315022.jpg\" alt=\"chatgpt icon on iphone\" width=\"75\" height=\"75\" loading=\"lazy\"/\u003e\n                \u003c/a\u003e\n            \u003c/p\u003e\u003c/div\u003e\n        \u003chr/\u003e\n                                        \u003c/div\u003e\n            \u003c/div\u003e\n            \n    \n    \n\n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-11T19:30:00Z",
  "modifiedTime": "2025-04-11T19:30:00Z"
}
