{
  "id": "989da88b-011e-46fa-a6c2-6968df0b556f",
  "title": "El Salvador abandons Bitcoin as legal tender after failed experiment",
  "link": "https://ticotimes.net/2025/02/02/el-salvador-abandons-bitcoin-as-legal-tender-after-failed-experiment",
  "description": "Comments",
  "author": "",
  "published": "Tue, 04 Feb 2025 00:00:13 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "AFP",
  "length": 4231,
  "excerpt": "Understand the implications of Bitcoin's downfall in El Salvador. Learn about the failed economic bet and its impact on the country's financial stability.",
  "siteName": "The Tico Times | Costa Rica News | Travel | Real Estate",
  "favicon": "https://ticotimes.net/wp-content/uploads/2022/09/16x16favicon.png",
  "text": "Bitcoin was never used by most Salvadorans, its modern city was never built, and now it will cease to be legal tender in El Salvador, the first country in the world to adopt it in 2021: a complete failed economic bet by President Nayib Bukele. Congress, dominated by the ruling party, approved last Wednesday a confusing reform to the Bitcoin Law at the request of Bukele’s government, which had no other option to receive the $1.4 billion credit agreed in December with the International Monetary Fund (IMF). The reform eliminated the word “currency” when referring to bitcoin, but says it is “legal tender.” Despite the lack of clarity, it lifts, as required by the IMF, the obligation to accept it in transactions or debt payments, a key condition for it to be “legal tender,” according to economic analysts. With the change, “if someone owes you money and wants to pay you in bitcoin, you can refuse to be paid in bitcoin, but you cannot refuse if it’s legal tender,” economist Carlos Acevedo explained. The use of bitcoin in El Salvador’s dollarized economy, according to the new rule, will be optional and will be at the discretion of the private sector to accept cryptocurrency payments for goods and services. Businesses are no longer required to convert dollar prices into this cryptocurrency. “Bitcoin no longer has that force of legal tender. That’s how it should have always remained, but the government wanted to force it and it didn’t work,” economist Rafael Lemus said. Very Complicated and Risky The Bitcoin Law reform will take effect 90 days after it’s published in the Official Gazette, which could happen in the coming days. For Acevedo, former president of the former Central Bank, “it makes no sense” to have left in the reformed law that it is “legal tender.” “It’s a monstrosity that’s not understood and that should be corrected and made clear that bitcoin is no longer legal tender,” the economist argues. But even being so, Salvadorans, with the exception of a few, never embraced Bukele’s initiative, who enjoys enormous popularity for his war against gangs, which dropped homicides to historic lows in El Salvador. A recent survey by the Central American University (UCA) revealed that 92% of Salvadorans did not use bitcoin in their transactions in 2024. “I used it and didn’t like it… Very complicated and risky. This is not for an employee who barely gets by on their salary,” Juana Henríquez, a 55-year-old nurse, said, saying she had tried to make some profit and instead lost money. Bukele also failed to achieve his project, which he announced with fireworks, to create Bitcoin City, a high-tech city that would be the capital of bitcoiners in the country and would take energy for mining from a volcano in Conchagua, about 200 km from Salvador. Berlin, a city 110 km east of San Salvador, and El Zonte beach (southwest) are two areas that concentrate bitcoiners, but many are foreign residents or tourists. Government Reserves Bitcoin’s biggest promoter in the country, Bukele, has not yet referred to the legal reform. But officials ensure that the government will continue betting on this cryptocurrency, whose price currently exceeds $100,000. El Salvador’s ambassador to the United States, Milena Mayorga, told journalists Thursday, during a bitcoin event in San Salvador, that the law reforms should be seen as an adaptation “to the circumstances.” The government, she assured, will continue buying bitcoin and having reserves in this cryptocurrency. According to the National Bitcoin Office, El Salvador has 6,050 bitcoins worth $634.8 million. “President Bukele continues buying bitcoin, we have a Bitcoin Office, we have the Bitcoin Law, bitcoin can be used in El Salvador. It hasn’t been an easy road,” Mayorga summarized. For Lemus, because “the government has its bitcoin reserve and will buy more” it is necessary “to have transparency, for citizens to know how public funds are being invested.” Bukele recently said he is convinced that with Donald Trump – whom he supports – in the White House there will be “an exponential revaluation” of the cryptocurrency. He frequently posts price increases on his social networks. For now, he remains silent.",
  "image": "https://ticotimes.net/wp-content/uploads/2025/02/tico2059_Bitcoin_halving_concept_b6d3be70-cdb6-4a62-a890-75bf37cc10bf.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-td-block-uid=\"tdi_70\"\u003e\n\u003cp\u003eBitcoin was never used by most Salvadorans, its modern city was never built, and now it will cease to be legal tender in El Salvador, the first country in the world to adopt it in 2021: a complete failed economic bet by President Nayib Bukele. Congress, dominated by the ruling party, approved last Wednesday a confusing reform to the Bitcoin Law at the request of Bukele’s government, which had no other option to receive the $1.4 billion credit agreed in December with the International Monetary Fund (\u003ca href=\"https://www.imf.org/en/home\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eIMF\u003c/a\u003e).\u003c/p\u003e\n\n\n\n\u003cp\u003eThe reform eliminated the word “currency” when referring to bitcoin, but says it is “\u003ca href=\"https://ticotimes.net/2021/09/07/in-world-first-bitcoin-becomes-legal-tender-in-el-salvador\" target=\"_blank\" rel=\"noreferrer noopener\"\u003elegal tender\u003c/a\u003e.” Despite the lack of clarity, it lifts, as required by the IMF, the obligation to accept it in transactions or debt payments, a key condition for it to be “legal tender,” according to economic analysts. With the change, “if someone owes you money and wants to pay you in bitcoin, you can refuse to be paid in bitcoin, but you cannot refuse if it’s legal tender,” economist Carlos Acevedo explained.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe use of bitcoin in El Salvador’s dollarized economy, according to the new rule, will be optional and will be at the discretion of the private sector to accept cryptocurrency payments for goods and services. Businesses are no longer required to convert dollar prices into this cryptocurrency. “Bitcoin no longer has that force of legal tender. That’s how it should have always remained, but the government wanted to force it and it didn’t work,” economist Rafael Lemus said.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-very-complicated-and-risky\"\u003e\u003cstrong\u003eVery Complicated and Risky\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe Bitcoin Law reform will take effect 90 days after it’s published in the Official Gazette, which could happen in the coming days. For Acevedo, former president of the former Central Bank, “it makes no sense” to have left in the reformed law that it is “legal tender.” “It’s a monstrosity that’s not understood and that should be corrected and made clear that bitcoin is no longer legal tender,” the economist argues.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut even being so, Salvadorans, with the exception of a few, never embraced Bukele’s initiative, who enjoys enormous popularity for his war against gangs, which dropped homicides to historic lows in El Salvador. A recent survey by the Central American University (UCA) revealed that 92% of Salvadorans did not use bitcoin in their transactions in 2024.\u003c/p\u003e\n\n\n\n\u003cp\u003e“I used it and didn’t like it… Very complicated and risky. This is not for an employee who barely gets by on their salary,” Juana Henríquez, a 55-year-old nurse, said, saying she had tried to make some profit and instead lost money. Bukele also failed to achieve his project, which he announced with fireworks, to create Bitcoin City, a high-tech city that would be the capital of bitcoiners in the country and would take energy for mining from a volcano in Conchagua, about 200 km from Salvador.\u003c/p\u003e\n\n\n\n\u003cp\u003eBerlin, a city 110 km east of San Salvador, and \u003ca href=\"https://ticotimes.net/2025/01/31/trump-effect-drives-bitcoin-growth-in-small-el-salvador-town\"\u003eEl Zont\u003c/a\u003e\u003ca href=\"https://ticotimes.net/2025/01/31/trump-effect-drives-bitcoin-growth-in-small-el-salvador-town\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ee beach\u003c/a\u003e (southwest) are two areas that concentrate bitcoiners, but many are foreign residents or tourists.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-government-reserves\"\u003e\u003cstrong\u003eGovernment Reserves\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eBitcoin’s biggest promoter in the country, Bukele, has not yet referred to the legal reform. But officials ensure that the government will continue betting on this cryptocurrency, whose price currently exceeds $100,000. El Salvador’s ambassador to the United States, Milena Mayorga, told journalists Thursday, during a bitcoin event in San Salvador, that the law reforms should be seen as an adaptation “to the circumstances.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe government, she assured, will continue buying bitcoin and having reserves in this cryptocurrency. According to the National Bitcoin Office, El Salvador has 6,050 bitcoins worth $634.8 million. “President Bukele continues buying bitcoin, we have a Bitcoin Office, we have the Bitcoin Law, bitcoin can be used in El Salvador. It hasn’t been an easy road,” Mayorga summarized.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor Lemus, because “the government has its bitcoin reserve and will buy more” it is necessary “to have transparency, for citizens to know how public funds are being invested.” Bukele recently said he is convinced that with Donald Trump – whom he supports – in the White House there will be “an exponential revaluation” of the cryptocurrency. He frequently posts price increases on his social networks. For now, he remains silent.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-02T23:27:00Z",
  "modifiedTime": "2025-02-02T14:35:25Z"
}
