{
  "id": "a5275aad-98c4-4b7e-909b-5b009e608c73",
  "title": "Drugmakers can keep making off-brand weight-loss drugs as FDA backpedals",
  "link": "https://arstechnica.com/health/2024/10/drugmakers-can-keep-making-off-brand-weight-loss-drugs-as-fda-backpedals/",
  "description": "FDA is reviewing its decision to remove tirzepatide drugs from the shortage list.",
  "author": "Beth Mole",
  "published": "Tue, 15 Oct 2024 21:53:57 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Health",
    "Science",
    "compounding pharmacies",
    "diabetes",
    "fda",
    "GLP-1",
    "lilly",
    "mounjaro",
    "OFA",
    "outsourcing facilities",
    "Tirzepatide",
    "weight loss",
    "zepbound"
  ],
  "byline": "Beth Mole",
  "length": 2463,
  "excerpt": "FDA is reviewing its decision to remove tirzepatide drugs from the shortage list.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The judge in the case, District Judge Mark Pittman, granted the FDA's request, canceling an October 15 hearing, and ordering the parties to submit a joint status report on November 21. Drugmakers respond The move was celebrated by the Outsourcing Facilities Association (OFA), which filed the lawsuit. \"We believe that this is a fair resolution in light of the agency’s rash decision to take the drug off of the list at a time when the agency has acknowledged 'supply disruptions,' which immediately created a major access issue for patients everywhere,\" OFA Chairperson Lee Rosebush said in a statement. \"Most important, should the FDA repeat its removal decision when a shortage still genuinely exists, we will return to court.\" The move is also likely to please patients who have come to rely on cheaper, more readily available compounded versions of the drugs. For some, compounded products may have been their only access to tirzepatide.  Still, those drugs are not without risk. The FDA has repeatedly emphasized that compounded drugs are not FDA-approved and do not go through the same safety, efficacy, and quality reviews. And the agency has warned of dosing errors and other safety concerns with compounded versions. The one party that is certainly unhappy with the FDA's move is Eli Lilly, which had reportedly sent cease-and-desist letters to compounders. In an emailed statement to Ars, a spokesperson for Lilly said that there was sufficient supply of the company's drug and continued use of compounded versions is unwarranted. \"Nothing changes the fact that, as FDA has recognized, Mounjaro and Zepbound are available and the shortage remains 'resolved,'\" the spokesperson said. Lilly also noted the FDA's safety concerns about the compounded versions, adding that its own examination of some compounded products found impurities, bacteria, strange coloring, incorrect potency, puzzling chemical structures, and, in one case, a product that was just sugar alcohol. \"All doses of Lilly’s FDA-approved medicines are available and it is important that patients not be exposed to the risks in taking untested, unapproved knockoffs,\" the spokesperson said. In terms of the supply \"disruptions\" the FDA mentioned and that some patients and pharmacies have reportedly experienced, Lilly said that the supply chain was complex and there are many reasons why a given pharmacy may not have a specific dose at hand, such as limited refrigerated storage space.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/GettyImages-2126120280-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eThe judge in the case, District Judge Mark Pittman, granted the FDA\u0026#39;s request, canceling an October 15 hearing, and ordering the parties to submit a joint status report on November 21.\u003c/p\u003e\n\u003ch2\u003eDrugmakers respond\u003c/h2\u003e\n\u003cp\u003eThe move was celebrated by the Outsourcing Facilities Association (OFA), which filed the lawsuit.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We believe that this is a fair resolution in light of the agency’s rash decision to take the drug off of the list at a time when the agency has acknowledged \u0026#39;supply disruptions,\u0026#39; which immediately created a major access issue for patients everywhere,\u0026#34; OFA Chairperson Lee Rosebush said in a statement. \u0026#34;Most important, should the FDA repeat its removal decision when a shortage still genuinely exists, we will return to court.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe move is also likely to please patients who have come to rely on cheaper, more readily available compounded versions of the drugs. For some, compounded products may have been their only access to tirzepatide.  Still, those drugs are not without risk. The FDA has repeatedly emphasized that compounded drugs are not FDA-approved and do not go through the same safety, efficacy, and quality reviews. And the agency has warned of \u003ca href=\"https://www.fda.gov/drugs/human-drug-compounding/fda-alerts-health-care-providers-compounders-and-patients-dosing-errors-associated-compounded\"\u003edosing errors\u003c/a\u003e and other \u003ca href=\"https://www.fda.gov/drugs/postmarket-drug-safety-information-patients-and-providers/fdas-concerns-unapproved-glp-1-drugs-used-weight-loss\"\u003esafety concerns\u003c/a\u003e with compounded versions.\u003c/p\u003e\n\u003cp\u003eThe one party that is certainly unhappy with the FDA\u0026#39;s move is Eli Lilly, which had \u003ca href=\"https://www.bloomberg.com/news/articles/2024-10-10/lilly-fires-warning-shot-at-copycat-drug-makers-after-shortage?embedded-checkout=true\"\u003ereportedly sent cease-and-desist letters to compounders\u003c/a\u003e. In an emailed statement to Ars, a spokesperson for Lilly said that there was sufficient supply of the company\u0026#39;s drug and continued use of compounded versions is unwarranted. \u0026#34;Nothing changes the fact that, as FDA has recognized, Mounjaro and Zepbound are available and the shortage remains \u0026#39;resolved,\u0026#39;\u0026#34; the spokesperson said.\u003c/p\u003e\n\u003cp\u003eLilly also noted the FDA\u0026#39;s safety concerns about the compounded versions, adding that its own examination of some compounded products found impurities, bacteria, strange coloring, incorrect potency, puzzling chemical structures, and, in one case, a product that was just sugar alcohol.\u003c/p\u003e\n\u003cp\u003e\u0026#34;All doses of Lilly’s FDA-approved medicines are available and it is important that patients not be exposed to the risks in taking untested, unapproved knockoffs,\u0026#34; the spokesperson said.\u003c/p\u003e\n\u003cp\u003eIn terms of the supply \u0026#34;disruptions\u0026#34; the FDA mentioned and that some patients and pharmacies have reportedly experienced, Lilly said that the supply chain was complex and there are many reasons why a given pharmacy may not have a specific dose at hand, such as limited refrigerated storage space.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-15T21:53:57Z",
  "modifiedTime": "2024-10-15T21:53:57Z"
}
