{
  "id": "a862400d-df42-4577-9c7e-0cc10bd99b1c",
  "title": "Scientists Develop Artificial Leaf, Uses Sunlight to Produce Valuable Chemicals",
  "link": "https://newscenter.lbl.gov/2025/04/24/scientists-develop-artificial-leaf-that-uses-sunlight-to-produce-valuable-chemicals/",
  "description": "Comments",
  "author": "",
  "published": "Thu, 24 Apr 2025 22:10:15 +0000",
  "source": "https://news.ycombinator.com/rss",
  "categories": null,
  "byline": "jennynuss",
  "length": 5850,
  "excerpt": "Researchers built a device made of perovskite and copper that mimics a green leaf.",
  "siteName": "Berkeley Lab News Center",
  "favicon": "https://newscenter.lbl.gov/wp-content/uploads/2022/09/cropped-favicon-copy-192x192.png",
  "text": "Key Takeaways The Liquid Sunlight Alliance is a multi-institutional collaboration working to develop the tools needed to use energy from sunlight to produce liquid fuels. Researchers built a perovskite and copper-based device that converts carbon dioxide into C2 products – precursory chemicals of innumerable products in our everyday lives, from plastic polymers to jet fuel. This proof-of-concept research opens new opportunities for energy research. Researchers from the Department of Energy’s Lawrence Berkeley National Laboratory (Berkeley Lab) along with international collaborators have brought us one step closer to harnessing the sun’s energy to convert carbon dioxide into liquid fuel and other valuable chemicals. In a recent publication in Nature Catalysis, the researchers debut a self-contained carbon-carbon (C2) producing system that combines the catalytic power of copper with perovskite, a material used in photovoltaic solar panels. This advance builds on over 20 years of research and brings the scientific community one step closer to replicating the productivity of a green leaf in nature.  This work is part of a larger initiative, the Liquid Sunlight Alliance (LiSA), which is a Fuels from Sunlight Energy Innovation Hub funded by the U.S. Department of Energy. Led by Caltech in close partnership with Berkeley Lab, LiSA brings together more than 100 scientists from national lab partners at SLAC and the National Renewable Energy Laboratory, and university partners at UC Irvine, UC San Diego, and the University of Oregon. Researchers involved in this multi-institutional collaboration have made advances in developing our understanding of and the tools needed to develop liquid fuels generated from sunlight, carbon dioxide, and water. (Learn more about the LiSA collaboration in this roundup, “Five Ways LiSA is Advancing Solar Fuels.”) “Nature was our inspiration,” said Peidong Yang, a senior faculty scientist in Berkeley Lab’s Materials Sciences Division and UC Berkeley professor of chemistry and materials science and engineering involved in the published work. “We had to work on the individual components first, but when we brought everything together and realized that it was successful, it was a very exciting moment.”  To build a system that mimics photosynthesis, Yang and his team followed the natural processes that occur in the leaf of a plant. Each individual component of a leaf’s photosynthesizing elements had to be replicated and refined. Tapping into the decades’ worth of research, the scientists used lead halide perovskite photoabsorbers to imitate a leaf’s light-absorbing chlorophyll. And inspired by enzymes that regulate photosynthesis in nature, they designed electrocatalysts made of copper that resemble tiny flowers. Previous experiments have successfully replicated photosynthesis through the use of biological materials, but this work incorporated an inorganic material, copper. While the selectivity of copper is lower than biological alternatives, the inclusion of copper presents a more durable, stable, and longer-lasting option for the artificial leaf system design. Work led by researchers in the LiSA project developed the cathode and anode components of the new device. Instruments at Berkeley Lab’s Molecular Foundry allowed Yang’s team to integrate the device with metal contacts. During the experiments in Yang’s lab, a solar simulator mimicking a consistently bright sun was used to test the selectivity of the new device.  Prior innovations across research groups enabled an organic oxidation reaction to take place in the photoanode chamber and created C2 products in the photocathode chamber. This breakthrough created a realistic artificial-leaf architecture in a device about the size of a postage stamp – it converts CO2 into a C2 molecule using only sunlight.  The C2 chemicals produced from this device are precursory ingredients for many industries that produce valuable products in our everyday lives – from plastic polymers to fuel for larger vehicles that can’t yet run off a battery, like an airplane. Building upon this fundamental research milestone, Yang is now aimed to increase the system’s efficiency and expand the size of the artificial leaf to begin increasing the scalability of the solution.  The Molecular Foundry is a user facility at Berkeley Lab.  This work was supported by the DOE Office of Science. ### Lawrence Berkeley National Laboratory (Berkeley Lab) is committed to groundbreaking research focused on discovery science and solutions for abundant and reliable energy supplies. The lab’s expertise spans materials, chemistry, physics, biology, earth and environmental science, mathematics, and computing. Researchers from around the world rely on the lab’s world-class scientific facilities for their own pioneering research. Founded in 1931 on the belief that the biggest problems are best addressed by teams, Berkeley Lab and its scientists have been recognized with 16 Nobel Prizes. Berkeley Lab is a multiprogram national laboratory managed by the University of California for the U.S. Department of Energy’s Office of Science.  DOE’s Office of Science is the single largest supporter of basic research in the physical sciences in the United States, and is working to address some of the most pressing challenges of our time. For more information, please visit energy.gov/science. ArticleAlternative Energy ArticleCarbon Management",
  "image": "https://newscenter.lbl.gov/wp-content/uploads/2025/04/Newscenter_featured_1190px_XBD-202503-035-001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-56089\" aria-label=\"Scientists Develop Artificial Leaf That Uses Sunlight to Produce Valuable Chemicals\"\u003e\n  \u003cdiv\u003e\n\n    \u003cdiv\u003e\n\n      \n\u003clbl-container wrapper-size=\"sm\" theme=\"white\"\u003e\n  \u003clbl-rich-text\u003e\n    \u003cdiv\u003e\n\u003ch4\u003eKey Takeaways\u003c/h4\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003eThe Liquid Sunlight Alliance is a multi-institutional collaboration working to develop the tools needed to use energy from sunlight to produce liquid fuels.\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003eResearchers built a perovskite and copper-based device that converts carbon dioxide into C\u003c/span\u003e\u003cspan\u003e2\u003c/span\u003e\u003cspan\u003e products \u003c/span\u003e\u003cspan\u003e–\u003c/span\u003e\u003cspan\u003e precursory chemicals of innumerable products in our everyday lives, from plastic polymers to jet fuel.\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003eThis proof-of-concept research opens new opportunities for energy research.\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cspan\u003eResearchers from the Department of Energy’s Lawrence Berkeley National Laboratory (Berkeley Lab) along with international collaborators have brought us one step closer to harnessing the sun’s energy to convert carbon dioxide into liquid fuel and other valuable chemicals. In a recent \u003c/span\u003e\u003ca href=\"https://www.nature.com/articles/s41929-025-01292-y\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003epublication\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e in \u003c/span\u003e\u003ci\u003e\u003cspan\u003eNature Catalysis\u003c/span\u003e\u003c/i\u003e\u003cspan\u003e, the researchers debut a self-contained carbon-carbon (C2) producing system that combines the catalytic power of copper with \u003c/span\u003e\u003ca href=\"https://www.energy.gov/eere/solar/perovskite-solar-cells#:~:text=Perovskites%20are%20a%20family%20of,as%20fuel%20cells%20and%20catalysts.\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eperovskite\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, a material used in photovoltaic solar panels. This advance builds on over 20 years of research and brings the scientific community one step closer to replicating the productivity of a green leaf in nature. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis work is part of a larger initiative, the Liquid Sunlight Alliance (\u003c/span\u003e\u003ca href=\"https://www.liquidsunlightalliance.org/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eLiSA\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e), which is a Fuels from Sunlight Energy Innovation Hub funded by the U.S. Department of Energy. Led by Caltech in close partnership with Berkeley Lab, LiSA brings together more than 100 scientists from national lab partners at SLAC and the National Renewable Energy Laboratory, and university partners at UC Irvine, UC San Diego, and the University of Oregon\u003c/span\u003e\u003cspan\u003e. \u003c/span\u003e\u003cspan\u003eResearchers involved in this multi-institutional collaboration have made advances in developing our understanding of and the tools needed to develop liquid fuels generated from sunlight, carbon dioxide, and water. (Learn more about the LiSA collaboration in this \u003c/span\u003e\u003ca href=\"https://newscenter.lbl.gov/2024/08/29/five-ways-lisa-is-advancing-solar-fuels/\"\u003e\u003cspan\u003eroundup\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, “Five Ways LiSA is Advancing Solar Fuels.”)\u003c/span\u003e\u003c/p\u003e\n  \u003c/lbl-rich-text\u003e\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container theme=\"white\"\u003e\n  \u003clbl-section-header title=\"\"\u003e\n      \u003c/lbl-section-header\u003e\n\u003c/lbl-container\u003e\n\n\u003clbl-container theme=\"white\"\u003e\n  \u003clbl-grid columns=\"2\" layout=\"grid-card\"\u003e\n\n\u003clbl-grid-card layout=\"gallery-card\" date=\"\" text=\"\" link-url=\"\" link-target=\"\" title=\"\"\u003e\n\n            \u003clbl-image slot=\"media\" img-caption=\"Closeup of the perovskite and copper-based devices developed by a multi-institutional collaboration working to develop the tools needed to turn sunlight into liquid fuel.\" img-credit=\"(Credit: Marilyn Sargent/Berkeley Lab)\"\u003e\n        \u003cimg decoding=\"async\" width=\"890\" height=\"665\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2025/04/Gallery1_890x665px_XBD-202503-035-015.jpg\" alt=\"A blue, gloved hands puts a perovskite and copper-based device in line with other copper-based devices.\" slot=\"media\"/\u003e      \u003c/lbl-image\u003e\n\n    \n    \n  \n  \n\u003c/lbl-grid-card\u003e\n\n\n\u003clbl-grid-card layout=\"gallery-card\" date=\"\" text=\"\" link-url=\"\" link-target=\"\" title=\"\"\u003e\n\n            \u003clbl-image slot=\"media\" img-caption=\"Artistic depiction of an artificial tree with copper nanoflowers wired to perovskite crystals. \" img-credit=\"(Credit: Virgil Andrei)\"\u003e\n        \u003cimg decoding=\"async\" width=\"500\" height=\"500\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2025/04/ezgif.com-optimize.gif\" alt=\"Artistic depiction of an artificial tree with copper nanoflowers wired to perovskite crystals.\" slot=\"media\"/\u003e      \u003c/lbl-image\u003e\n\n    \n    \n  \n  \n\u003c/lbl-grid-card\u003e\n\n  \u003c/lbl-grid\u003e\n\n\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container wrapper-size=\"sm\" theme=\"white\"\u003e\n  \u003clbl-rich-text\u003e\n    \u003cp\u003e\u003cspan\u003e“Nature was our inspiration,” said Peidong Yang, a senior faculty scientist in Berkeley Lab’s Materials Sciences Division and UC Berkeley professor of chemistry and materials science and engineering involved in the published work. “We had to work on the individual components first, but when we brought everything together and realized that it was successful, it was a very exciting moment.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eTo build a system that mimics photosynthesis, Yang and his team followed the natural processes that occur in the leaf of a plant. Each individual component of a leaf’s photosynthesizing elements had to be replicated and refined. Tapping into the decades’ worth of research, the scientists used lead halide perovskite photoabsorbers to imitate a leaf’s light-absorbing chlorophyll. And inspired by enzymes that regulate photosynthesis in nature, they designed electrocatalysts made of copper that resemble tiny flowers.\u003c/span\u003e\u003c/p\u003e\n  \u003c/lbl-rich-text\u003e\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container theme=\"white\" wrapper-size=\"sm\"\u003e\n  \u003clbl-audio episode=\"\" date=\"\" title=\"\" schema=\"{\n    \" @context\":=\"\" \"http:=\"\" schema.org\",=\"\" \"@type\":=\"\" \"audioobject\",=\"\" \"description\":=\"\" \"\",=\"\" \"duration\":=\"\" \"\",=\"\" \"uploaddate\":=\"\" \"\",=\"\" \"name\":=\"\" \"\",=\"\" \"publisher\":=\"\" {=\"\" \"@type\":=\"\" \"organization\",=\"\" \"name\":=\"\" \"berkeley=\"\" lab\",=\"\" \"logo\":=\"\" {=\"\" \"@type\":=\"\" \"imageobject\",=\"\" \"url\":=\"\" \"https:=\"\" www.buzzsprout.com=\"\" 2206573=\"\" episodes=\"\" 17016953\"=\"\" }=\"\" },=\"\" \"thumbnailurl\":=\"\" \"\"=\"\" }\"=\"\" header-type=\"h2\"\u003e\n        \u003clbl-rich-text slot=\"rich-text\"\u003e\n          \u003c/lbl-rich-text\u003e\n          \u003clbl-button link-target=\"_blank\" link-url=\"https://www.buzzsprout.com/2206573/episodes/17016953\" text=\"View the transcript\" slot=\"inline-go-btn\" type=\"inline-go\"\u003e\n      \u003c/lbl-button\u003e\n      \u003c/lbl-audio\u003e\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container wrapper-size=\"sm\" theme=\"white\"\u003e\n  \u003clbl-rich-text\u003e\n    \u003cp\u003e\u003cspan\u003ePrevious experiments have successfully replicated photosynthesis through the use of biological materials, but this work incorporated an inorganic material, copper. While the selectivity of copper is lower than biological alternatives, the inclusion of copper presents a more durable, stable, and longer-lasting option for the artificial leaf system design.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWork led by researchers in the LiSA project developed the cathode and anode components of the new device. Instruments at Berkeley Lab’s \u003c/span\u003e\u003ca href=\"https://foundry.lbl.gov/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eMolecular Foundry\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e allowed Yang’s team to integrate the device with metal contacts. During the experiments in Yang’s lab, a solar simulator mimicking a consistently bright sun was used to test the selectivity of the new device. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003ePrior innovations across research groups enabled an organic oxidation reaction to take place in the photoanode chamber and created C2 products in the photocathode chamber. This breakthrough created a realistic artificial-leaf architecture in a device about the size of a postage stamp \u003c/span\u003e\u003cspan\u003e–\u003c/span\u003e\u003cspan\u003e it converts CO\u003csub\u003e2\u003c/sub\u003e into a C2 molecule using only sunlight. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe C2 chemicals produced from this device are precursory ingredients for many industries that produce valuable products in our everyday lives \u003c/span\u003e\u003cspan\u003e–\u003c/span\u003e\u003cspan\u003e from plastic polymers to fuel for larger vehicles that can’t yet run off a battery, like an airplane. Building upon this fundamental research milestone, Yang is now aimed to increase the system’s efficiency and expand the size of the artificial leaf to begin increasing the scalability of the solution. \u003c/span\u003e\u003c/p\u003e\n  \u003c/lbl-rich-text\u003e\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container theme=\"white\"\u003e\n  \u003clbl-image img-caption=\"Lin uses an artificial light to activate the postage stamp-sized device to convert carbon dioxide into a C2, a valuable precursory chemical in everyday products.\" img-credit=\"(Credit: Marilyn Sargent/Berkeley Lab)\"\u003e\n    \u003cimg loading=\"lazy\" decoding=\"async\" width=\"1190\" height=\"795\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2025/04/Newscenter_1190px_XBD-202503-035-017.jpg\" alt=\"\" slot=\"media\"/\u003e  \u003c/lbl-image\u003e\n\u003c/lbl-container\u003e\n\n\n\n\u003clbl-container wrapper-size=\"sm\" theme=\"white\"\u003e\n  \u003clbl-rich-text\u003e\n    \u003cp\u003e\u003cspan\u003eThe \u003c/span\u003e\u003ca href=\"https://foundry.lbl.gov/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eMolecular Foundry\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e is a user facility at Berkeley Lab. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis work was supported by the \u003c/span\u003e\u003ca href=\"https://www.energy.gov/science/office-science\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eDOE Office of Science\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e###\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.lbl.gov/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eLawrence Berkeley National Laboratory\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e (Berkeley Lab) is committed to groundbreaking research focused on discovery science and solutions for abundant and reliable energy supplies. The lab’s expertise spans materials, chemistry, physics, biology, earth and environmental science, mathematics, and computing. Researchers from around the world rely on the lab’s world-class scientific facilities for their own pioneering research. Founded in 1931 on the belief that the biggest problems are best addressed by teams, Berkeley Lab and its scientists have been recognized with 16 Nobel Prizes. Berkeley Lab is a multiprogram national laboratory managed by the University of California for the U.S. Department of Energy’s Office of Science. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDOE’s Office of Science is the single largest supporter of basic research in the physical sciences in the United States, and is working to address some of the most pressing challenges of our time. For more information, please visit \u003ca href=\"http://energy.gov/science\" target=\"_blank\" rel=\"noopener\"\u003eenergy.gov/science\u003c/a\u003e.\u003c/span\u003e\u003c/p\u003e\n  \u003c/lbl-rich-text\u003e\n\u003c/lbl-container\u003e\n\n    \u003c/div\u003e\n\n    \n\n\n\n      \u003clbl-container no-container-padding-top=\"\" theme=\"white\"\u003e\n      \u003clbl-divider\u003e\u003c/lbl-divider\u003e\n    \u003c/lbl-container\u003e\n  \n  \u003clbl-container wrapper-size=\"sm\" theme=\"white\"\u003e\n\n    \n\n  \u003c/lbl-container\u003e\n\n\n  \u003clbl-container theme=\"cloud\"\u003e\n    \u003clbl-section-header layout=\"centered\" margin-bottom=\"\" text=\"You might also be interested in:\"\u003e\n    \u003c/lbl-section-header\u003e\n    \u003clbl-grid columns=\"3\" layout=\"grid-card\"\u003e\n\n      \u003clbl-grid-card link-target=\"_self\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=55099\" title=\"Five Ways LiSA is Advancing Solar Fuels\"\u003e\n      \u003clbl-image slot=\"media\"\u003e\n      \u003cimg width=\"890\" height=\"665\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2024/08/Newscenter_ALTLanding_890x665px_XBD-202406-103-032.jpg\" alt=\"Two researchers in lab coats and goggles work with outdoor scientific equipment near a modern building.\" slot=\"media\" decoding=\"async\" loading=\"lazy\"/\u003e    \u003c/lbl-image\u003e\n    \u003clbl-tags icon=\"article\" slot=\"byline\"\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://newscenter.lbl.gov/all-news/?type=article\" aria-label=\"View all articles of type: Article\"\u003eArticle\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://newscenter.lbl.gov/all-news/?topic=152620\" aria-label=\"View all articles of type: Alternative Energy\"\u003eAlternative Energy\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/lbl-tags\u003e  \u003clbl-button slot=\"btn\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=55099\" text=\"Read the article\" link-target=\"_self\" type=\"inline\"\u003e\n  \u003c/lbl-button\u003e\n\u003c/lbl-grid-card\u003e\n\u003clbl-grid-card link-target=\"_self\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=47329\" title=\"Berkeley Lab Part of Multi-Institutional Team Awarded $60M for Solar Fuels Research\"\u003e\n      \u003clbl-image slot=\"media\"\u003e\n      \u003cimg width=\"890\" height=\"623\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2020/07/JCAP_FundingRenewal-v3-1200px.png\" alt=\"LiSA JCAP renewal solar fuels hub\" slot=\"media\" decoding=\"async\" loading=\"lazy\"/\u003e    \u003c/lbl-image\u003e\n    \u003clbl-tags icon=\"\" slot=\"byline\"\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://newscenter.lbl.gov/all-news/?type=\" aria-label=\"View all articles of type: \"\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/lbl-tags\u003e  \u003clbl-button slot=\"btn\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=47329\" text=\"Read the article\" link-target=\"_self\" type=\"inline\"\u003e\n  \u003c/lbl-button\u003e\n\u003c/lbl-grid-card\u003e\n\u003clbl-grid-card link-target=\"_self\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=52821\" title=\"How a Record-Breaking Copper Catalyst Converts CO2 Into Liquid Fuels\"\u003e\n      \u003clbl-image slot=\"media\"\u003e\n      \u003cimg width=\"890\" height=\"611\" src=\"https://newscenter.lbl.gov/wp-content/uploads/2023/02/copper-nanoparticle-homepage-1720x1180-1.jpg\" alt=\"Artist’s rendering of a copper nanoparticle life cycle during CO2 electrolysis: Copper nanoparticles (left) combine into larger metallic copper “nanograins” (right) within seconds of the electrochemical reaction, reducing CO2 into new multicarbon products.\" slot=\"media\" decoding=\"async\" loading=\"lazy\"/\u003e    \u003c/lbl-image\u003e\n    \u003clbl-tags icon=\"article\" slot=\"byline\"\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://newscenter.lbl.gov/all-news/?type=article\" aria-label=\"View all articles of type: Article\"\u003eArticle\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://newscenter.lbl.gov/all-news/?topic=152612\" aria-label=\"View all articles of type: Carbon Management\"\u003eCarbon Management\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/lbl-tags\u003e  \u003clbl-button slot=\"btn\" link-url=\"https://newscenter.lbl.gov/?post_type=post\u0026amp;p=52821\" text=\"Read the article\" link-target=\"_self\" type=\"inline\"\u003e\n  \u003c/lbl-button\u003e\n\u003c/lbl-grid-card\u003e\n\n    \u003c/lbl-grid\u003e\n  \u003c/lbl-container\u003e\n\n  \u003c/div\u003e\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-24T15:00:00Z",
  "modifiedTime": null
}
