{
  "id": "a87ea20d-ea96-4fdb-b8ff-d3ea284155de",
  "title": "608: Boot to Toot",
  "link": "https://atp.fm/608",
  "description": "Follow-up: NotebookLM podcast Camera Control button material iPhone case suggestions Spigen Ultra Hybrid T MagFit Arc Pulse Leather backs Suti Nomad Atom Studios Sleep-tagging app suggestions Windows anti-malware app suggestions Adaptive Transparency report Wireless phone recovery 9to5Mac screenshot End ↔ end encryption coming for iPhone ↔ Android RCS messages More tweaks to screen recording prompts Jason’s toot Hotkey registration in Sequoia Response from Apple frameworks engineer Liquid detection in Sequoia Epic gets a win against Google Apple nopes out of OpenAI investment Ask ATP: Will John buy the new $700 Playstation Pro? Have the Vehicle Motion Cues helped John’s motion sickness? (via Justin Waring) When will the first true “built from the ground up for AI” phone be? (via Neil McGregor) Is it time to move to Passkeys? Ricky’s post Post-show: Adam’s gaming PC adventures Razer gaming laptops Marco’s “is this bad” post iFixit toolkit Members-only ATP Overtime: AI moats \u0026 trade secrets OpenAI doesn’t want anyone to know what o1 is “thinking” Sponsored by: DeleteMe: Making it quick, easy, and safe to remove your personal data online. Tailscale: A secure network that just works. Become a member for ATP Overtime, ad-free episodes, member specials, and our early-release, unedited “bootleg” feed!",
  "author": "ATP",
  "published": "Thu, 10 Oct 2024 20:03:30 +0000",
  "source": "https://atp.fm/rss",
  "categories": null,
  "byline": "",
  "length": 132,
  "excerpt": "Three nerds discussing tech, Apple, programming, and loosely related matters.",
  "siteName": "",
  "favicon": "https://cdn.atp.fm/images/20231026-favicon-180.png",
  "text": "Three nerds discussing tech, Apple, programming, and loosely related matters. Hosted by Marco Arment, Casey Liss, and John Siracusa.",
  "image": "https://cdn.atp.fm/artwork",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThree nerds discussing tech, Apple, programming, and loosely related matters. Hosted by \u003ca href=\"https://marco.org/\"\u003eMarco Arment\u003c/a\u003e, \u003ca href=\"https://www.caseyliss.com/\"\u003eCasey Liss\u003c/a\u003e, and \u003ca href=\"https://hypercritical.co/\"\u003eJohn Siracusa\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
