{
  "id": "a98933e0-92f7-4bd6-b618-5daf76cf1c6f",
  "title": "Companion’s Director and Cast on Its Gruesome Finish and Future",
  "link": "https://gizmodo.com/companions-director-and-cast-on-its-gruesome-finish-and-future-2000558094",
  "description": "Drew Hancock, Sophie Thatcher, and Jack Quaid tell all about Companion and setting up its bloody start and finish.",
  "author": "Justin Carter",
  "published": "Sun, 02 Feb 2025 21:15:35 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Movies",
    "Companion",
    "Drew Hancock",
    "Jack Quaid",
    "Sophie Thatcher"
  ],
  "byline": "Justin Carter",
  "length": 2779,
  "excerpt": "Drew Hancock, Sophie Thatcher, and Jack Quaid tell all about Companion and setting up its bloody start and finish.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Drew Hancock, Sophie Thatcher, and Jack Quaid tell all about Companion and setting up its bloody start and finish. Pre-release marketing for Warner Bros.’ Companion might’ve had you certain the entire game was given away. That is and isn’t true: yeah, Iris (Sophie Thatcher) learns she’s a robot, and you can make an educated guess what happens next. But for writer/director Drew Hancock and its two leads, getting there was a bit of a creative challenge. Shortly after the robot reveal, it turns out Iris is a pawn in a scheme by her boyfriend Josh (Jack Quaid) and his friend Kat (Megan Suri) to kill Kat’s boyfriend Sergey (Rupert Friend) and steal the cash in his vault. In an interview with Entertainment Weekly, Hancock revealed Iris would’ve originally killed Sergey with an automatic wine cork. A final Iris vs. Josh showdown was always in the cards, but when it came time to kill Josh, he was unable to top a wine cork to the brain, so he swapped things around: now Josh would get the wine cork, and Sergey took a pocket knife to the throat, a weapon Josh placed into Iris’ things. “Switching that was perfect,” said Hancock, “because then Jack could be complicit in the planting of the knife, so it all worked out.” As for Thatcher and Quaid, they both felt a bit nutty shooting Josh’s demise, which was done at 5 am. Thatcher admitted to EW she’d been “pretty fucking exhausted” by that point, which “added to the madness of it all. I think I had three Celsius cans, and it felt kind of out of body.” Quaid echoed that sentiment, and called it “one of the most creative ways I’ve ever died in something. It was our final scene we shot, and it was so funny to die in that way and then have everybody clap as the movie was over.” Companion ends with Iris driving off with Sergey’s money and now with full self-control thanks to a technician from her creator, Empathix. Hancock told Variety he’s got tiny ideas of a followup, but they’re just that: small thoughts about what Iris sees when she’s sleep, potentially finding love again, or giving human life a spin. (Owning a farm was one suggestion, or just “enjoying the sunset.”) Alternatively, there’s always the Smile route and focusing on a new protagonist—anything is on the table for Hancock, except for creating a Westworld scenario. But such plans will have to wait, as he’s now working on a reboot of The Faculty. Let us know what you thought about Companion, and if it should come back for more sci-fi thrills, in the comments below. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/10/sophie-thatcher-companion.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n                  Drew Hancock, Sophie Thatcher, and Jack Quaid tell all about \u003ci\u003eCompanion\u003c/i\u003e and setting up its bloody start and finish.\n                \u003c/p\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003ePre-release marketing for Warner Bros.’ \u003cem\u003e\u003ca href=\"https://gizmodo.com/companion-movie-review-jack-quaid-sophie-thatcher-2000553015\"\u003eCompanion\u003c/a\u003e \u003c/em\u003emight’ve had you certain the entire game was given away. That is and isn’t true: yeah, Iris (Sophie Thatcher) learns she’s a robot, and you can make an educated guess what happens next. But for writer/director \u003ca href=\"https://gizmodo.com/companion-director-drew-hancock-on-robots-relationships-and-sci-fi-thrills-2000555588\"\u003eDrew Hancock\u003c/a\u003e and its \u003ca href=\"https://gizmodo.com/companions-jack-quaid-and-sophie-thatcher-geek-out-about-blending-comedy-and-horror-2000556780\"\u003etwo leads\u003c/a\u003e, getting there was a bit of a creative challenge.\u003c/p\u003e \u003cp\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2024/07/io9Spoiler.png\" alt=\"io9 spoiler bar\" width=\"800\" height=\"88\" srcset=\"https://gizmodo.com/app/uploads/2024/07/io9Spoiler.png 800w, https://gizmodo.com/app/uploads/2024/07/io9Spoiler-300x33.png 300w, https://gizmodo.com/app/uploads/2024/07/io9Spoiler-768x84.png 768w, https://gizmodo.com/app/uploads/2024/07/io9Spoiler-680x75.png 680w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003c/p\u003e \u003cp\u003eShortly after the robot reveal, it turns out Iris is a pawn in a scheme by her boyfriend Josh (Jack Quaid) and his friend Kat (Megan Suri) to kill Kat’s boyfriend Sergey (Rupert Friend) and steal the cash in his vault. In an interview with \u003ca href=\"https://ew.com/companion-ending-explained-jack-quaid-sophie-thatcher-drew-hancock-spoilers-8783568\"\u003eEntertainment Weekly\u003c/a\u003e, Hancock revealed Iris would’ve originally killed Sergey with an automatic wine cork. A final Iris vs. Josh showdown was always in the cards, but when it came time to kill Josh, he was unable to top a wine cork to the brain, so he swapped things around: now Josh would get the wine cork, and Sergey took a pocket knife to the throat, a weapon Josh placed into Iris’ things. “Switching that was perfect,” said Hancock, “because then Jack could be complicit in the planting of the knife, so it all worked out.”\u003c/p\u003e\n\n \u003cp\u003eAs for Thatcher and Quaid, they both felt a bit nutty shooting Josh’s demise, which was done at 5 am. Thatcher admitted to EW she’d been “pretty fucking exhausted” by that point, which “added to the madness of it all. I think I had three Celsius cans, and it felt kind of out of body.” Quaid echoed that sentiment, and called it “one of the most creative ways I’ve ever died in something. It was our final scene we shot, and it was so funny to die in that way and then have everybody clap as the movie was over.”\u003c/p\u003e \u003cp\u003e\u003cem\u003eCompanion \u003c/em\u003eends with Iris driving off with Sergey’s money and now with full self-control thanks to a technician from her creator, Empathix. Hancock told \u003ca href=\"https://variety.com/2025/film/news/companion-ending-explained-director-final-scene-sequel-ideas-1236293516/\"\u003eVariety\u003c/a\u003e he’s got tiny ideas of a followup, but they’re just that: small thoughts about what Iris sees when she’s sleep, potentially finding love again, or giving human life a spin. (Owning a farm was one suggestion, or just “enjoying the sunset.”) Alternatively, there’s always the \u003cem\u003eSmile\u003c/em\u003e route and focusing on a new protagonist—anything is on the table for Hancock, except for creating a \u003cem\u003eWestworld \u003c/em\u003escenario. But such plans will have to wait, as he’s now working on a reboot of \u003ca href=\"https://gizmodo.com/stephen-king-is-already-full-of-praise-for-mike-flanagans-dark-tower-adaptation-2000557433\"\u003e\u003cem\u003eThe Faculty\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\n \u003cp\u003eLet us know what you thought about \u003cem\u003eCompanion, \u003c/em\u003eand if it should come back for more sci-fi thrills, in the comments below.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-02T21:15:35Z",
  "modifiedTime": "2025-02-02T21:15:35Z"
}
