{
  "id": "b8ae59fa-e8bd-4d3f-8903-b769e1b28f78",
  "title": "The Pacific Rim prequel series has reportedly found a home at Amazon",
  "link": "https://www.engadget.com/entertainment/tv-movies/the-pacific-rim-prequel-series-has-reportedly-found-a-home-at-amazon-213245776.html?src=rss",
  "description": "A live-action Pacific Rim TV series is in-development at Amazon, according to Variety. News of the project was first shared in 2024, when Variety reported that Arrival screenwriter Eric Heisserer was attached to develop and write the show. The new series will apparently be a prequel to Guillermo Del Toro's original Pacific Rim, a movie about Kaiju-fighting giant mechs and the humans that pilot them. Legendary, which produced Pacific Rim, is also backing the series alongside Amazon MGM. The studio appears to be using the same strategy with Pacific Rim that worked with its Godzilla-and-King-Kong-starring \"MonsterVerse\" franchise. Monarch: Legacy of Monsters streamed on Apple TV+ in 2023, and acted as both a prequel and sequel to the \"MonsterVerse\" films. Heisserer has plenty of experience adapting existing material. His Arrival script converted an experimental second-person short story into a (relatively) thoughtful blockbuster, and his work on Netflix's Shadow and Bone found a clever way to interweave the first book in Leigh Bardugo's series with characters from a later duology. Pacific Rim seems a lot more straightforward in comparison. There's yet to be an official announcement from Amazon, or any dates for when we can expect the series to be available, but there has been quite a bit of new Pacific Rim material since the first film came out in 2013. The live-action sequel Pacific Rim Uprising was released in 2018 and Netflix put out its anime sequel, Pacific Rim: The Black, in 2021.This article originally appeared on Engadget at https://www.engadget.com/entertainment/tv-movies/the-pacific-rim-prequel-series-has-reportedly-found-a-home-at-amazon-213245776.html?src=rss",
  "author": "Ian Carlos Campbell",
  "published": "Thu, 17 Apr 2025 21:32:45 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Movies",
    "Media",
    "Arts \u0026 Entertainment",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Ian Carlos Campbell"
  ],
  "byline": "Ian Carlos Campbell",
  "length": 1505,
  "excerpt": "A Pacific Rim TV series is reportedly in-development at Amazon.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "A live-action Pacific Rim TV series is in-development at Amazon, according to Variety. News of the project was first shared in 2024, when Variety reported that Arrival screenwriter Eric Heisserer was attached to develop and write the show.The new series will apparently be a prequel to Guillermo Del Toro's original Pacific Rim, a movie about Kaiju-fighting giant mechs and the humans that pilot them. Legendary, which produced Pacific Rim, is also backing the series alongside Amazon MGM. The studio appears to be using the same strategy with Pacific Rim that worked with its Godzilla-and-King-Kong-starring \"MonsterVerse\" franchise. Monarch: Legacy of Monsters streamed on Apple TV+ in 2023, and acted as both a prequel and sequel to the \"MonsterVerse\" films.Heisserer has plenty of experience adapting existing material. His Arrival script converted an experimental second-person short story into a (relatively) thoughtful blockbuster, and his work on Netflix's Shadow and Bone found a clever way to interweave the first book in Leigh Bardugo's series with characters from a later duology. Pacific Rim seems a lot more straightforward in comparison.There's yet to be an official announcement from Amazon, or any dates for when we can expect the series to be available, but there has been quite a bit of new Pacific Rim material since the first film came out in 2013. The live-action sequel Pacific Rim Uprising was released in 2018 and Netflix put out its anime sequel, Pacific Rim: The Black, in 2021.",
  "image": "https://s.yimg.com/ny/api/res/1.2/d2fLckSxzOSeP9j5Qms4VA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-04/7dce6b00-1bd1-11f0-9def-2111eb214c30",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eA live-action \u003cem\u003ePacific Rim \u003c/em\u003eTV series is in-development at Amazon, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1\" href=\"https://variety.com/2025/tv/news/pacific-rim-tv-series-legendary-eric-heisserer-amazon-1236371706/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:according to Variety;elm:context_link;elmt:doNotAffiliate;cpos:1;pos:1;itc:0;sec:content-canvas\"\u003eaccording to \u003cem\u003eVariety\u003c/em\u003e\u003c/a\u003e. News of the project was first shared in 2024, when \u003cem\u003eVariety\u003c/em\u003e reported that \u003cem\u003eArrival \u003c/em\u003escreenwriter Eric Heisserer was attached \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1\" href=\"https://www.engadget.com/entertainment/tv-movies/a-pacific-rim-prequel-series-is-being-developed-by-the-scriptwriter-of-bird-box-110043597.html\" data-ylk=\"slk:to develop and write the show;elm:context_link;elmt:doNotAffiliate;cpos:2;pos:1;itc:0;sec:content-canvas\"\u003eto develop and write the show\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe new series will apparently be a prequel to Guillermo Del Toro\u0026#39;s original \u003cem\u003ePacific Rim\u003c/em\u003e, a movie about Kaiju-fighting giant mechs and the humans that pilot them. Legendary, which produced \u003cem\u003ePacific Rim\u003c/em\u003e, is also backing the series alongside Amazon MGM. The studio appears to be using the same strategy with \u003cem\u003ePacific Rim \u003c/em\u003ethat worked with its Godzilla-and-King-Kong-starring \u0026#34;MonsterVerse\u0026#34; franchise. \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1\" href=\"https://www.engadget.com/apples-monarch-legacy-of-monsters-trailer-pits-kurt-russell-against-godzilla-154145455.html\" data-ylk=\"slk:Monarch: Legacy of Monsters;elm:context_link;elmt:doNotAffiliate;cpos:3;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003eMonarch: Legacy of Monsters \u003c/em\u003e\u003c/a\u003estreamed on Apple TV+ in 2023, and acted as both a prequel and sequel to the \u0026#34;MonsterVerse\u0026#34; films.\u003c/p\u003e\u003cp\u003eHeisserer has plenty of experience adapting existing material. His \u003cem\u003eArrival \u003c/em\u003escript converted an experimental second-person short story into a (relatively) thoughtful blockbuster, and his work on Netflix\u0026#39;s \u003cem\u003eShadow and Bone\u003c/em\u003e found a clever way to interweave the first book in Leigh Bardugo\u0026#39;s series with characters from a later duology. \u003cem\u003ePacific Rim \u003c/em\u003eseems a lot more straightforward in comparison.\u003c/p\u003e\u003cp\u003eThere\u0026#39;s yet to be an official announcement from Amazon, or any dates for when we can expect the series to be available, but there has been quite a bit of new \u003cem\u003ePacific Rim\u003c/em\u003e material since the first film came out in 2013. The live-action sequel \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1\" href=\"https://www.engadget.com/2017-10-06-pacific-rim-uprising-trailer.html\" data-ylk=\"slk:Pacific Rim Uprising;elm:context_link;elmt:doNotAffiliate;cpos:4;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003ePacific Rim Uprising\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003ewas released in 2018 and Netflix put out its anime sequel, \u003ca data-i13n=\"elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1\" href=\"https://www.engadget.com/2019-07-04-netflix-pacific-rim-anime-2020.html\" data-ylk=\"slk:Pacific Rim: The Black;elm:context_link;elmt:doNotAffiliate;cpos:5;pos:1;itc:0;sec:content-canvas\"\u003e\u003cem\u003ePacific Rim: The Black\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003ein 2021.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-17T21:32:45Z",
  "modifiedTime": null
}
