{
  "id": "baf95cce-0efc-406d-a289-3e0e659a9b2c",
  "title": "Reddit's AI Tool Will Give Speedier, More Accurate Answers With Google Gemini Boost",
  "link": "https://www.cnet.com/tech/services-and-software/reddits-ai-tool-will-give-speedier-more-accurate-answers-with-google-gemini-boost/#ftag=CAD590a51e",
  "description": "The popular social media forum will use Google's Cloud services, including Gemini for search, as part of its AI-powered Reddit Answers service.",
  "author": "Omar Gallaga",
  "published": "Wed, 09 Apr 2025 23:52:00 +0000",
  "source": "https://www.cnet.com/rss/news/",
  "categories": null,
  "byline": "Omar Gallaga",
  "length": 2857,
  "excerpt": "The popular social media forum will use Google's Cloud services, including Gemini for search, as part of its AI-powered Reddit Answers service.",
  "siteName": "CNET",
  "favicon": "https://www.cnet.com/favicon-480.png",
  "text": "Why You Can Trust CNET Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement The popular social media forum will use Google's Cloud services, including Gemini for search, as part of its AI-powered Reddit Answers service. Reddit is expanding a cloud computing partnership with Google to use its Gemini AI tools for Reddit Answers. Google said Wednesday it's helping Reddit manage information from 100,000 online communities and more than 400 million weekly active users, making their online conversations more searchable for Reddit Answers.For people, it could mean more accurate search in addition to summaries, follow-up questions and the ability to have an AI conversation about the content, not unlike what users of chatbot services such as ChatGPT would expect. Reddit unveiled Answers in late 2024, telling its users that it would be easier to search for content from Reddit, more often than not answers to questions, without the need to go to Google and use its search function. Reddit already had a $60 million deal with Google to help train generative AI models on its content. The company has also been expanding its translation services across its communities with the help of AI.Reddit's unique positionAlthough Reddit's AI efforts may be much more visible to people lately, the company has been positioning itself with the technology for a while, said Rowan Curran, a senior analyst at Forrester Research.\"Reddit's AI efforts have been ongoing for a number of years across a number of fronts,\" Curran said. \"For example, they were one of the early companies to develop their own model for code generation and assistance to support Reddit's developers.\"While the company is getting some outside assistance with AI, it's also attractive to companies such as Google and OpenAI because of how much content it owns and generates. \"Reddit's position as both a provider as well as a well of information puts them in a somewhat unique position to attempt to capitalize heavily both on the ingestion and preparation of data for AI use cases, as well as the serving of answers and information created from that data,\" he said.Reddit's position as an ongoing generator of deeply human discussion is something that shouldn't be lost in the rush to implement AI, says author Christine Lagorio, who wrote about the company in her book We Are the Nerds: The Birth and Tumultuous Life of Reddit, the Internet's Culture Laboratory.\"I certainly hope it doesn't diminish Reddit's strength, which is increasingly its ecosystem of real human answers to real human questions, a welcome contrast from the rest of the increasingly artificial (and artificial-sounding, and artificial-looking) web,\" Lagorio said.",
  "image": "https://www.cnet.com/a/img/resize/3ea49cf674cb6ceb4b4709fcee1225fa996a651e/hub/2022/03/01/bb1be5d6-bfba-4869-908a-f00cd4ea71ca/reddit-logo-6767.jpg?auto=webp\u0026fit=crop\u0026height=675\u0026width=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://www.cnet.com/a/neutron/images/logos/cnet-short.png\" alt=\"CNET logo\"/\u003e \u003cspan\u003eWhy You Can Trust CNET\u003c/span\u003e  \u003c/p\u003e \u003cp\u003e\u003cspan\u003eOur expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission.\u003c/span\u003e \u003cspan\u003e\u003ca href=\"https://www.cnet.com/tech/how-we-test-products-and-services/\"\u003eReviews ethics statement\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e \u003c/div\u003e   \u003cdiv\u003e \u003cp\u003e\n    The popular social media forum will use Google\u0026#39;s Cloud services, including Gemini for search, as part of its AI-powered Reddit Answers service.\n  \u003c/p\u003e \u003c/div\u003e \u003c/div\u003e\u003cdiv id=\"article-ec13e003-2101-4085-a18b-d934a9811a5c\"\u003e\u003carticle\u003e\u003cp\u003eReddit is \u003ca href=\"https://www.zdnet.com/article/reddits-new-google-powered-ai-search-tool-makes-finding-answers-faster-than-ever/\" target=\"_self\"\u003eexpanding a cloud computing partnership\u003c/a\u003e with Google to use its Gemini AI tools for Reddit Answers. \u003ca href=\"https://www.googlecloudpresscorner.com/2025-04-09-Google-Cloud-Powers-Part-of-Reddit-Answers,-On-Platform-Search-Experiences-with-Generative-AI\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eGoogle said\u003c/a\u003e Wednesday it\u0026#39;s helping Reddit manage information from 100,000 online communities and more than 400 million weekly active users, making their online conversations more searchable for Reddit Answers.\u003c/p\u003e\u003cp\u003eFor people, it could mean more accurate search in addition to summaries, follow-up questions and the ability to have an AI conversation about the content, not unlike what users of \u003ca href=\"https://www.cnet.com/tech/services-and-software/best-ai-chatbots/\" target=\"_self\"\u003echatbot\u003c/a\u003e services such as ChatGPT would expect.\u003c/p\u003e\u003cfigure\u003e\u003ca rel=\"\" href=\"https://www.cnet.com/ai-atlas/\" target=\"_blank\"\u003e \u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 767px)\" srcset=\"https://www.cnet.com/a/img/resize/6bd4587def86e9b1261141196ef1cac4f6209007/hub/2024/04/16/660f9254-c869-4a08-9ba6-93c16106b001/ai-atlas-tag.png?auto=webp\u0026amp;width=768\" alt=\"AI Atlas art badge tag\"/\u003e\u003csource media=\"(max-width: 1023px)\" srcset=\"https://www.cnet.com/a/img/resize/6bd4587def86e9b1261141196ef1cac4f6209007/hub/2024/04/16/660f9254-c869-4a08-9ba6-93c16106b001/ai-atlas-tag.png?auto=webp\u0026amp;width=768\" alt=\"AI Atlas art badge tag\"/\u003e\u003csource media=\"(max-width: 1440px)\" srcset=\"https://www.cnet.com/a/img/resize/6bd4587def86e9b1261141196ef1cac4f6209007/hub/2024/04/16/660f9254-c869-4a08-9ba6-93c16106b001/ai-atlas-tag.png?auto=webp\u0026amp;width=768\" alt=\"AI Atlas art badge tag\"/\u003e \u003cimg src=\"\" alt=\"AI Atlas art badge tag\" height=\"268.29694323144105\" width=\"768\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e  \u003c/a\u003e \u003c/figure\u003e\u003cp\u003eReddit \u003ca href=\"https://www.cnet.com/tech/services-and-software/reddits-new-tool-spits-out-ai-generated-answers-based-on-users-posts/\" target=\"_self\"\u003eunveiled Answers in late 2024\u003c/a\u003e, telling its users that it would be easier to search for content from Reddit, more often than not answers to questions, without the need to go to Google and use its search function. Reddit \u003ca href=\"https://www.cnet.com/tech/services-and-software/reddits-60-million-deal-with-google-will-feed-generative-ai/\" target=\"_self\"\u003ealready had a $60 million deal\u003c/a\u003e with Google to help train generative AI models on its content. \u003c/p\u003e\u003cp\u003eThe company has also been \u003ca href=\"https://www.cnet.com/tech/services-and-software/reddit-is-using-ai-to-expand-translation-services/\" target=\"_self\"\u003eexpanding its translation services\u003c/a\u003e across its communities with the help of AI.\u003c/p\u003e\u003ch2\u003eReddit\u0026#39;s unique position\u003c/h2\u003e\u003cp\u003eAlthough Reddit\u0026#39;s AI efforts may be much more visible to people lately, the company has been positioning itself with the technology for a while, said \u003ca href=\"https://www.forrester.com/analyst-bio/rowan-curran/BIO4966\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\"\u003eRowan Curran\u003c/a\u003e, a senior analyst at Forrester Research.\u003c/p\u003e\u003cp\u003e\u0026#34;Reddit\u0026#39;s AI efforts have been ongoing for a number of years across a number of fronts,\u0026#34; Curran said. \u0026#34;For example, they were one of the early companies to develop their own model for code generation and assistance to support Reddit\u0026#39;s developers.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile the company is getting some outside assistance with AI, it\u0026#39;s also attractive to companies such as Google and OpenAI because of how much content it owns and generates. \u003c/p\u003e\u003cp\u003e\u0026#34;Reddit\u0026#39;s position as both a provider as well as a well of information puts them in a somewhat unique position to attempt to capitalize heavily both on the ingestion and preparation of data for AI use cases, as well as the serving of answers and information created from that data,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eReddit\u0026#39;s position as an ongoing generator of deeply human discussion is something that shouldn\u0026#39;t be lost in the rush to implement AI, says author Christine Lagorio, who wrote about the company in her book \u003cspan\u003e\u003ca href=\"https://www.amazon.com/Are-Nerds-Tumultuous-Internets-Laboratory/dp/0316435376\" rel=\"noopener nofollow\" target=\"_blank\" title=\"(opens in a new window)\" data-aps-asin=\"0316435376\" data-aps-asc-tag=\"cnet-buy-button-20\" data-aps-asc-subtag=\"__COM_CLICK_ID__|-|mwb|cn\" section=\"transformed-regular-link\" data-location=\"BODY\"\u003eWe Are the Nerds: The Birth and Tumultuous Life of Reddit, the Internet\u0026#39;s Culture Laboratory\u003c/a\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;I certainly hope it doesn\u0026#39;t diminish Reddit\u0026#39;s strength, which is increasingly its ecosystem of real human answers to real human questions, a welcome contrast from the rest of the increasingly artificial (and artificial-sounding, and artificial-looking) web,\u0026#34; Lagorio said.\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-09T23:52:00Z",
  "modifiedTime": null
}
