{
  "id": "bb9a5f16-efcb-4641-a3fd-4e2a5ef13fa2",
  "title": "After a week, Trump Mobile drops claim that Trump phone is “made in the USA”",
  "link": "https://arstechnica.com/gadgets/2025/06/after-a-week-trump-mobile-drops-claim-that-trump-phone-is-made-in-the-usa/",
  "description": "Trump T1 phone isn't \"made in the USA\" but is \"designed with American values.\"",
  "author": "Jon Brodkin",
  "published": "Wed, 25 Jun 2025 22:39:33 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Policy",
    "Tech",
    "trump mobile",
    "trump phone"
  ],
  "byline": "Jon Brodkin",
  "length": 1894,
  "excerpt": "Trump T1 phone isn’t “made in the USA” but is “designed with American values.”…",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "The Trump phone was announced last week with a claim that the device would be made entirely in America, and people were rightly skeptical. Trump Mobile's $500 T1 Phone \"is a sleek, gold smartphone engineered for performance and proudly designed and built in the United States for customers who expect the best from their mobile carrier,\" the Trump Organization said in a press release. But with electronics supply chain experts casting doubt on the feasibility of designing and building an American-made phone in a short span of time, Trump Mobile's website doesn't currently promise an American-made phone. The website says the T1 is \"designed with American values in mind,\" that it is \"brought to life right here in the USA,\" and that there are \"American hands behind every device.\" The Trump Mobile website previously said, \"Our MADE IN THE USA 'T1 Phone' is available for pre-order now.\" The phone was initially supposed to be available in August, but the date was changed to September, and now the website simply says it will be available \"later this year.\" The Verge pointed out the website's vague claims in an article today. \"One of the phone's main selling points was that it was to be made in America,\" but \"sometime in the last several days, the Trump Mobile site appears to have been scrubbed of all language indicating the phone is to be made in the USA,\" the article said, adding that the website previously had a \"huge banner on the homepage that says the T1 is 'MADE IN THE USA.'\" When contacted by Ars today, a Trump Mobile spokesperson said, \"The T1 phones are proudly being made in America. Speculation to the contrary is simply inaccurate. We're excited to launch the phones later this year.\" Trump Mobile did not explain why it removed the \"made in the USA\" claim from its website. We also contacted the Trump organization and will update this article if we get a response.",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/trump-mobile-1152x648-1750889842.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eThe \u003ca href=\"https://arstechnica.com/tech-policy/2025/06/trump-org-launches-47-month-wireless-service-teases-odd-499-phone/\"\u003eTrump phone\u003c/a\u003e was announced last week with a claim that the device would be made entirely in America, and people were rightly skeptical. Trump Mobile\u0026#39;s $500 T1 Phone \u0026#34;is a sleek, gold smartphone engineered for performance and proudly designed and built in the United States for customers who expect the best from their mobile carrier,\u0026#34; the Trump Organization \u003ca href=\"https://www.trump.com/media/trump-mobile-launches-a-bold-new-wireless-service\"\u003esaid\u003c/a\u003e in a press release.\u003c/p\u003e\n\u003cp\u003eBut with electronics supply chain experts \u003ca href=\"https://www.pcmag.com/news/mobile-experts-skeptical-of-trump-t1-phone-made-in-america-claims\"\u003ecasting doubt\u003c/a\u003e on the feasibility of designing and building an American-made phone in a short span of time, Trump Mobile\u0026#39;s website doesn\u0026#39;t currently promise an American-made phone. The \u003ca href=\"https://trumpmobile.com/t1-phone\"\u003ewebsite\u003c/a\u003e says the T1 is \u0026#34;designed with American values in mind,\u0026#34; that it is \u0026#34;brought to life right here in the USA,\u0026#34; and that there are \u0026#34;American hands behind every device.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Trump Mobile website \u003ca href=\"https://web.archive.org/web/20250617004920/https://trumpmobile.com/\"\u003epreviously said\u003c/a\u003e, \u0026#34;Our MADE IN THE USA \u0026#39;T1 Phone\u0026#39; is available for pre-order now.\u0026#34; The phone was initially supposed to be available in August, but the date was changed to September, and now the website simply says it will be available \u0026#34;later this year.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Verge pointed out the website\u0026#39;s vague claims in an \u003ca href=\"https://www.theverge.com/gadgets/693080/trump-mobile-t1-phone-made-usa\"\u003earticle\u003c/a\u003e today. \u0026#34;One of the phone\u0026#39;s main selling points was that it was to be made in America,\u0026#34; but \u0026#34;sometime in the last several days, the Trump Mobile site appears to have been scrubbed of all language indicating the phone is to be made in the USA,\u0026#34; the article said, adding that the website previously had a \u0026#34;huge banner on the homepage that says the T1 is \u0026#39;MADE IN THE USA.\u0026#39;\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhen contacted by Ars today, a Trump Mobile spokesperson said, \u0026#34;The T1 phones are proudly being made in America. Speculation to the contrary is simply inaccurate. We\u0026#39;re excited to launch the phones later this year.\u0026#34; Trump Mobile did not explain why it removed the \u0026#34;made in the USA\u0026#34; claim from its website. We also contacted the Trump organization and will update this article if we get a response.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-25T22:39:33Z",
  "modifiedTime": "2025-06-25T23:15:40Z"
}
