{
  "id": "bc4b779e-222b-46f5-96f1-a6d8fc1a3584",
  "title": "American Sweatshop review: A cyberthriller for the doomscrolling age",
  "link": "https://mashable.com/article/american-sweatshop-review",
  "description": "\"Riverdale\" star Lili Reinhart stars as a content moderator whose contact with the dark side of the web will change her forever.",
  "author": "",
  "published": "Thu, 13 Mar 2025 21:00:00 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Kristy Puchko",
  "length": 7419,
  "excerpt": "\"Riverdale\" star Lili Reinhart goes down a dark web spiral.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "Lili Reinhart stars as Daisy in \"American Sweatshop.\" Credit: Guido Marx Have you ever seen something online you just couldn't shake? Sometimes a video rolls across our FYP or timeline that's inexplicably violent, and before we can blink or look away, it's scorched into our brains. Now, imagine if your job was to not look away. You'd be a content moderator, underpaid to watch one revolting video after another to determine if they meet your company's dubious user guidelines. This is the modern hell of the sharp and smart thriller American Sweatshop. Riverdale's Lili Reinhart stars as Daisy, a young woman whose days are spent approving or deleting videos shared on an unnamed social media website. Her work requires closely watching and judging videos of strangulations, fatal falls, and worse, to determine if they are within the bounds of that site's terms of service. Shaking it off is part of the job, or so says a corporate culture that treats humans like interchangeable machines. But once Daisy sees a particularly gruesome video involving a woman, a hammer, and a nail, she can't just bounce back. Plagued by the memory of what she saw, she needs to find out if the video was real and who's responsible — whatever it costs. Twisted and character-driven, American Sweatshop will have you sweating as you peek between your fingers for what happens next. American Sweatshop explores the inhumanity of the corporate internet. \"Remember, we're not censors; we're moderators,\" declares Daisy's boss (Christiane Paul), as she smoothly spouts the corporate speak that promises to promote freedom of expression while casually avoiding moral rigor. It's the kind of speech you might hear Mark Zuckerberg give on a podcast. But here she's coaching her room of agitated moderators, coolly laying out when some slurs can be approved instead of deleted, without daring to say a slur herself. And this reflects the clever trick American Sweatshop pulls, which keeps it from falling into the muck it criticizes.  Director Uta Briesewitz has a storied career as a TV helmer, working on such hit shows as Severance, Black Mirror, and Stranger Things. She understands tension, specifically what the audience must see and what they need not. Like the critically acclaimed horror thriller Red Rooms, American Sweatshop won't make a spectacle out of the inhumane videos found online. Instead, the script from Matthew Nemeth gets the idea across by revealing telling video titles like \"fetus in blender\" or showing office workers having raucous meltdowns, with one in particular saying they'd all be better off if he set the office building on fire. For the video that torments Daisy, Briesewitz will show glimpses, implying key details, like a woman on a dirty mattress and an old white man playing voyeur as an aggressor in snakeskin boots raises a hammer. We'll hear the woman scream. The horror comes not from seeing what happens in the video, but from witnessing the blasé response some characters have to watching the video — including a cop Daisy entreats for help. Mashable Top Stories American Sweatshop has a Severance sense of humor. Beyond the troubling mystery at their respective cores, Severance and American Sweatshop both wring dark laughs out of the corporate apathy that oppresses Daisy and her co-workers. However, this film is not as heightened as the popular Apple TV+ show, which makes it hit even harder. Beyond the snarling manager of this \"sweatshop,\" there's a futile counselor (Tim Plester) who has nothing to offer except nine minutes of break time and half-hearted coping tools. When there's a concern that too many of these employees are passing out or freaking out during their shifts — i.e. negatively impacting productivity — a surly exec scolds about a lack of resources before suggesting a morale-boosting event, like an after-work pub hang — with a cash bar. This is the kind of late-stage capitalism joke that cuts so deep because it feels too real. Walking this line of dark humor and mind-snapping tension, Reinhart's co-stars provide supreme support. Daisy experiences a steady, stressful psychological decline, as she goes from smoking pot and meditating to cope with the horrors she witnesses at work to vigilante justice. Meanwhile, Daniela Melchior plays her chicly stoic work bestie whose idea of real talk is often jolting. Bringing a volatile energy, Joel Fry plays the office bad boy who seems always on the brink of a blow-up. And Jeremy Ang Jones offers a wide-eyed naivete as the office newbie, so green and sweet that his co-workers are taking bets that he'll be the next to snap.  Thematically, they are a thoughtful progression chart of employee burnout. Yet, through whispered support at their desks, heart-to-hearts over hard-earned lunch breaks, or drunken confessions on the aforementioned night out, they knit a web of relationships slippery yet sturdy. This creates an authenticity to their work environment, urging the audience to understand how banal the setting for psyche-scarring trauma can be, with the worst of humanity just one click away. Through this cutting humor, American Sweatshop urges us not to look away from the nerve-fraying suspense as Daisy steps away from her keywords and chases down the evil rooted in the real world. Yet, Nemeth rejects the glossy Hollywood expectations of a vigilante justice tale. Daisy won't become abruptly a genius strategist or a master computer hacker, destined for an action-packed, explosive finale. She'll fumble and make glaringly bad decisions. And yet each feels natural, mimicking the slippery slope of a grim internet rabbit hole. One weird discovery just keeps pulling us in deeper and deeper, and we not only lose track of time but also what we sacrifice of ourselves as we keep digging. The final reveal is at once sickening and satisfying. American Sweatshop is a cool and riveting thriller that gets under your skin, creeping up your spine to bend your brain. Like the internet videos that are its grim inspiration, it's not easy to shake off the chills American Sweatshop triggers.American Sweatshop was reviewed out of its premiere at the 2025 SXSW Film Festival. Kristy Puchko is the Film Editor at Mashable. Based in New York City, she's an established film critic and entertainment reporter, who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, interviewed a wide array of performers and filmmakers, and had her work published on RogerEbert.com, Vanity Fair, and The Guardian. A member of the Critics Choice Association and GALECA as well as a Top Critic on Rotten Tomatoes, Kristy's primary focus is movies. However, she's also been known to gush over television, podcasts, and board games. You can follow her on Twitter. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/02xLVJpUKX1Vby8lEswmCAM/hero-image.fill.size_1200x675.v1740781126.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/02xLVJpUKX1Vby8lEswmCAM/hero-image.fill.size_1248x702.v1740781126.jpg\" alt=\"Lili Reinhart stars as Daisy in \u0026#34;American Sweatshop.\u0026#34; \" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/02xLVJpUKX1Vby8lEswmCAM/hero-image.fill.size_400x225.v1740781126.jpg 400w, https://helios-i.mashable.com/imagery/articles/02xLVJpUKX1Vby8lEswmCAM/hero-image.fill.size_800x450.v1740781126.jpg 800w, https://helios-i.mashable.com/imagery/articles/02xLVJpUKX1Vby8lEswmCAM/hero-image.fill.size_1248x702.v1740781126.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLili Reinhart stars as Daisy in \u0026#34;American Sweatshop.\u0026#34; \u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Guido Marx\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eHave you ever seen something online you just couldn\u0026#39;t shake? Sometimes a video rolls across our FYP or timeline that\u0026#39;s inexplicably violent, and before we can blink or look away, it\u0026#39;s scorched into our brains. Now, imagine if your job was to not look away. You\u0026#39;d be a content moderator, underpaid to watch one revolting video after another to determine if they meet your company\u0026#39;s dubious user guidelines. This is the modern hell of the sharp and smart thriller \u003cem\u003eAmerican Sweatshop. \u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cem\u003eRiverdale\u003c/em\u003e\u0026#39;s Lili Reinhart stars as Daisy, a young woman whose days are spent approving or deleting videos shared on an unnamed social media website. Her work requires closely watching and judging videos of strangulations, fatal falls, and worse, to determine if they are within the bounds of that site\u0026#39;s terms of service. Shaking it off is part of the job, or so says a corporate culture that treats humans like interchangeable machines. But once Daisy sees a particularly gruesome video involving a woman, a hammer, and a nail, she can\u0026#39;t just bounce back. Plagued by the memory of what she saw, she needs to find out if the video was real and who\u0026#39;s responsible — whatever it costs. \u003c/p\u003e\u003cp\u003eTwisted and character-driven, \u003cem\u003eAmerican Sweatshop \u003c/em\u003ewill have you sweating as you peek between your fingers for what happens next. \u003c/p\u003e\u003ch2\u003e\u003cem\u003eAmerican Sweatshop \u003c/em\u003eexplores the inhumanity of the corporate internet. \u003c/h2\u003e\u003cp\u003e\u0026#34;Remember, we\u0026#39;re not censors; we\u0026#39;re moderators,\u0026#34; declares Daisy\u0026#39;s boss (Christiane Paul), as she smoothly spouts the corporate speak that promises to promote freedom of expression while casually avoiding moral rigor. It\u0026#39;s the kind of speech you might hear Mark Zuckerberg give on a podcast. But here she\u0026#39;s coaching her room of agitated moderators, coolly laying out when some slurs can be approved instead of deleted, without daring to say a slur herself. And this reflects the clever trick \u003cem\u003eAmerican Sweatshop \u003c/em\u003epulls, which keeps it from falling into the muck it criticizes. \u003c/p\u003e\n\u003cp\u003eDirector Uta Briesewitz has a storied career as a TV helmer, working on such hit shows as \u003ca href=\"https://mashable.com/category/severance\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003eSeverance\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003ca href=\"https://mashable.com/category/black-mirror\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eBlack Mirror\u003c/a\u003e\u003c/em\u003e\u003cem\u003e, \u003c/em\u003eand \u003ca href=\"https://mashable.com/category/stranger-things\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003eStranger Things.\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003eShe understands tension, specifically what the audience must see and what they need not. Like the critically acclaimed horror thriller \u003ca href=\"https://mashable.com/article/red-room-review\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003eRed Rooms\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, American Sweatshop \u003c/em\u003ewon\u0026#39;t make a spectacle out of the inhumane videos found online. Instead, the script from Matthew Nemeth gets the idea across by revealing telling video titles like \u0026#34;fetus in blender\u0026#34; or showing office workers having raucous meltdowns, with one in particular saying they\u0026#39;d all be better off if he set the office building on fire. \u003c/p\u003e\u003cp\u003eFor the video that torments Daisy, Briesewitz will show glimpses, implying key details, like a woman on a dirty mattress and an old white man playing voyeur as an aggressor in snakeskin boots raises a hammer. We\u0026#39;ll hear the woman scream. The horror comes not from seeing what happens in the video, but from witnessing the blasé response some characters have to watching the video — including a cop Daisy entreats for help. \u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"top-stories\"\u003e\n        \u003cp\u003e\n            Mashable Top Stories\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003ch2\u003e\u003cem\u003eAmerican Sweatshop \u003c/em\u003ehas a \u003cem\u003eSeverance \u003c/em\u003esense of humor. \u003c/h2\u003e\u003cp\u003eBeyond the troubling mystery at their respective cores, \u003ca href=\"https://mashable.com/article/severance-season-2-episode-7-explained-gemma-lumon\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003e\u003cem\u003eSeverance\u003c/em\u003e\u003c/a\u003e and \u003cem\u003eAmerican Sweatshop \u003c/em\u003eboth wring dark laughs out of the corporate apathy that oppresses Daisy and her co-workers. However, this film is not as heightened as the popular Apple TV+ show, which makes it hit even harder. \u003c/p\u003e\u003cp\u003eBeyond the snarling manager of this \u0026#34;sweatshop,\u0026#34; there\u0026#39;s a futile counselor (Tim Plester) who has nothing to offer except nine minutes of break time and half-hearted coping tools. When there\u0026#39;s a concern that too many of these employees are passing out or freaking out during their shifts — i.e. negatively impacting productivity — a surly exec scolds about a lack of resources before suggesting a morale-boosting event, like an after-work pub hang — with a cash bar. This is the kind of late-stage capitalism joke that cuts so deep because it feels too real. \u003c/p\u003e\u003cp\u003eWalking this line of dark humor and mind-snapping tension, Reinhart\u0026#39;s co-stars provide supreme support. Daisy experiences a steady, stressful psychological decline, as she goes from smoking pot and meditating to cope with the horrors she witnesses at work to vigilante justice. Meanwhile, Daniela Melchior plays her chicly stoic work bestie whose idea of real talk is often jolting. Bringing a volatile energy, Joel Fry plays the office bad boy who seems always on the brink of a blow-up. And Jeremy Ang Jones offers a wide-eyed naivete as the office newbie, so green and sweet that his co-workers are taking bets that he\u0026#39;ll be the next to snap. \u003c/p\u003e\n\n\u003cp\u003eThematically, they are a thoughtful progression chart of employee burnout. Yet, through whispered support at their desks, heart-to-hearts over hard-earned lunch breaks, or drunken confessions on the aforementioned night out, they knit a web of relationships slippery yet sturdy. This creates an authenticity to their work environment, urging the audience to understand how banal the setting for psyche-scarring trauma can be, with the worst of humanity just one click away. \u003c/p\u003e\u003cp\u003eThrough this cutting humor, \u003cem\u003eAmerican Sweatshop \u003c/em\u003eurges us not to look away from the nerve-fraying suspense as Daisy steps away from her keywords and chases down the evil rooted in the real world. Yet, Nemeth rejects the glossy Hollywood expectations of a vigilante justice tale. Daisy won\u0026#39;t become abruptly a genius strategist or a master computer hacker, destined for an action-packed, explosive finale. She\u0026#39;ll fumble and make glaringly bad decisions. And yet each feels natural, mimicking the slippery slope of a grim internet rabbit hole. One weird discovery just keeps pulling us in deeper and deeper, and we not only lose track of time but also what we sacrifice of ourselves as we keep digging. The final reveal is at once sickening and satisfying. \u003c/p\u003e\u003cp\u003e\u003cem\u003eAmerican Sweatshop \u003c/em\u003eis a cool and riveting thriller that gets under your skin, creeping up your spine to bend your brain. Like the internet videos that are its grim inspiration, it\u0026#39;s not easy to shake off the chills \u003cem\u003eAmerican Sweatshop \u003c/em\u003etriggers.\u003c/p\u003e\u003cp\u003e\u003cem\u003eAmerican Sweatshop \u003c/em\u003ewas reviewed out of its premiere at the 2025 SXSW Film Festival. \u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/defaults/fallback-thumbnail.fill.size_100x100.1.png\" alt=\"Mashable Image\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cp\u003eKristy Puchko is the Film Editor at Mashable. Based in New York City, she\u0026#39;s an established film critic and entertainment reporter, who has traveled the world on assignment, covered a variety of film festivals, co-hosted movie-focused podcasts, interviewed a wide array of performers and filmmakers, and had her work published on RogerEbert.com, Vanity Fair, and The Guardian. A member of the Critics Choice Association and GALECA as well as a Top Critic on Rotten Tomatoes, Kristy\u0026#39;s primary focus is movies. However, she\u0026#39;s also been known to gush over television, podcasts, and board games. You can follow her on \u003ca href=\"https://twitter.com/KristyPuchko\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" target=\"_blank\" title=\"(opens in a new window)\"\u003eTwitter. \u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-13T21:00:00Z",
  "modifiedTime": "2025-03-13T21:00:02Z"
}
