{
  "id": "c1c382a2-8610-41e0-a626-ee181a4fa86c",
  "title": "Meet Wicked‘s Elphaba and Glinda at Universal Studios Hollywood’s Mega Movie Summer",
  "link": "https://gizmodo.com/meet-wickeds-elphaba-and-glinda-at-universal-studios-hollywoods-mega-movie-summer-2000600012",
  "description": "The opening of Epic Universe and Disneyland's 70th anniversary festivities are nearly here—get all the updates in this week's theme park news.",
  "author": "Sabina Graves",
  "published": "Fri, 09 May 2025 23:20:27 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "Theme Parks \u0026 Destinations",
    "Disneyland",
    "Universal Studios"
  ],
  "byline": "Sabina Graves",
  "length": 8947,
  "excerpt": "The opening of Epic Universe and Disneyland's 70th anniversary festivities are nearly here—get all the updates in this week's theme park news.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "Vacation season is on the horizon, and the latest news out of the theme parks sphere brings out the fun festivities just as May gets into the sizzle of things. Universal Studios Hollywood has Mega Movie Summer in store with Wicked characters becoming meet and greets outside of Fan Fest Nights. Epic Universe prepares to open its doors for guests this month in Orlando, with select preview days available to the public. Disneyland is set to kick off its 70th anniversary celebrations next week at the Disneyland resort, while over at Walt Disney World new villainous and sea-spirited experiences await with new shows and a pirate’s shack coming soon. New themed destinations are springing up with DC Comics getting into family experiences at Gaylord hotels, and Meow Wolf Dallas has been named the “Best Location-Based Experience” by the International Association of Amusement Parks and Attractions. Find out more on this week’s theme park news! Universal Studios Hollywood – Mega Movie Summer © Universal Studios Products and Experiences Celebrate blockbusters with a blast through the movies that made fandom, including Steven Spielberg’s Jaws—which turns 50 this year—and Back to the Future. The iconic hanging Jaws shark photo-op will make its return with meet and greet characters playing Quint and Brody, and the DeLorean will make a stop along with meet and greets for the Amblin classic. You’ll not only be able to meet Doc and Marty but Einstein the time-traveling dog will be there too. Additional new meet and greets include Wicked‘s Elphaba and Glinda, a new dino baby just in time for Jurassic World Rebirth, and Toothless from How to Train Your Dragon. Mega Movie Summer runs Friday, June 13 through Sunday, August 10. Universal Studios Hollywood – Film Foodie Fun © Universal Studios Products and Experiences A selection of themed film foods will be available for Mega Movie Summer. Here’s a listing of what’s been announced so far and where to find it: Hollywood \u0026 Dine – located just inside the theme park’s main entry, it will transform into “Amity Island Cafe,” serving up a menu fit for a Great White. Menu and beverage highlights will include Lobster Roll, Vegan Crab Cake Sandwich, Fish and Chips, Fish and Chicken Basket, Shark Bait Burger, Shark Fin Funnel Cake, Amity Island Parfait, and Amity Beach Lifesaver Donut, as well as the Shark Bite cocktail and Amity Open Water, a non-alcoholic beverage. Jurassic Cafe – on the lower lot, it will serve up a new prehistoric-themed delicacies. Isla Nubar – look for new cocktails the Jurassic Water Rebirth and Spicy Jurassic Pearadise. Mel’s Diner – idyllically captures the essence of Back to the Future, serving up such menu options as the Flux Capacitor Patty Melt, Time Machine Pastrami Melt, Doc Brown’s Chicken Pot Pie, Outatime Cookie, Time Traveler’s Milk Shake, Flux Capacitor Mocktail, and Wake Up Juice Cocktail. Meet One Piece‘s Straw Hat Crew and More at Universal Fan Fest Nights There’s a few more weeks left of the interactive and fandom-fueled fun at Universal Fan Fest Nights at Universal Studios Hollywood. Don’t miss out on meeting the Straw Hats, Wicked‘s witches, and exploring Hill Valley in a Back to the Future experience that’s out of time! Get tickets here. Epic Universe – Universal Studios Resorts Orlando, Florida Take a look at this POV of Hiccup’s Wing Gliders, a family coaster inspired by How to Train Your Dragon at Epic Universe’s Isle of Berk. Tickets for select preview dates are still available here. Meow Wolf “The Real Unreal” – Grapevine, Texas Meow Wolf’s Grapevine, Texas outpost has been named “the best location-based experience” by the International Association of Amusement Parks and Attractions. This honor includes competition from major studio driven parks and is a win for the immersive whimsical chaos of the Meow Wolf brand. For more info visit here. DC Comics Takeover at Gaylord Hotels Memorial Day weekend at Gaylord Resorts nationwide will mark the start of the brand’s foray into participatory entertainment in collaboration with DC. The official Warner Bros. partnership will include immersive experiences for those staying at select vacation resorts. A special walk-through exhibit will be featured at the Gaylord Texan in Grapevine, Texas, which will provide an interactive walk-through that boasts “multiple DC worlds and 40 iconic DC Super Heroes and Super-Villains in more than 1,000 glowing lanterns constructed by master artisans from Zigong, China.” More activations at the rest of the Gaylord hotels participating in DC Summer include: DC Super Hero’s Mission Checklist: Begin the adventure at check in with a Super Hero badge and a checklist of challenges to complete across the resort. Guests can celebrate their heroic feats with a Super Hero Certificate at check out. Revenge of the Riddler Scavenger Hunt: Work with the Justice League to solve the Riddler’s tricky puzzles scattered throughout the resort. DC Super Hero Craft Zone: Let the superhero within take shape by embracing creativity at this fun arts and crafts station. Every superhero should help shape their origin story. Hall of Justice Character Dining: Guests can fuel their inner powers at the Justice League’s dining hall. Wonder Woman, Batman, and Superman join guests at this one-of-a-kind dining experience packed with epic eats and gems of courage and truth. Character Dining with the Joker and Harley Quinn: Step into the twisted world of Gotham City, where danger and excitement await at every turn. While savoring a meal fit for heroes, guests will face a choice: help Batman bring the Super-Villains to justice or help Harley Quinn and the Joker with their secret plan. DC Super Secret Menu: Use a secret codeword to access a special menu. Super Hero-inspired cocktails, mighty appetizers and legendary desserts await—because saving the world works up an appetite. DC Super Hero Academy Live Show: Hear legendary tales straight from the comic books! But this isn’t just story time, it’s a chance for guests to jump into the action and flex their super powers. Solve puzzles, test heroic instincts and craft a personal adventure. Stay sharp —heroes may make a surprise appearance. DC Super Hero Sightings: A member of the Justice League is on a mission to thwart the Riddler’s latest nefarious plot right here and needs assistance. Snap a photo, lend a hand and be a part of the heroics. DC Super Hero Splash: Dive into an unforgettable poolside celebration packed with superhero games, DC trivia, epic waterslides and DJ-spun beats. It’s the ultimate splash bash for heroes of all ages. DC Movie Night Poolside: The pool offers guests a front-row seat to watch DC Super Heroes on the big screen. Featuring themed snacks and fellow fans all around, this outdoor movie night is a personal Super Hero escape, placing everyone in the middle of the action. DC Fun by the Pool: Relax by the water with fun facts, hero spotlights, specialty Super Hero inspired cocktails, and refreshing Icee drinks like Amazonian Freeze and Metropolis Chill to soak in the fun. Battle for Justice Light Show: Watch the mesmerizing clash between DC’s greatest Super Heroes and Super-Villains unfold across the night sky through electrifying visuals, stunning lighting effects and a cinematic musical score that will keep everyone glued to their seats until the thrilling finale. DC Super Hero Supply Pack: Start the adventure with a themed welcome pack featuring iconic DC Super Heroes. Inside: a cape, autograph book, projector pen, sticker, and bag to kick off a heroic journey. Book here. Disneyland Resort – Disneyland’s 70th Anniversary The Jonas Brothers will debut a new single to celebrate 70 years of Disneyland with an official album that will soundtrack the theme park’s milestone. Fans will be able to listen to their “Celebrate Happy” during a new park character cavalcade, along with new renditions of Disney faves and new original tracks starting May 16 at the Disneyland Resort. For more information visit here. Disney Villain and Mermaid Experiences – Walt Disney World Two new shows to beat the heat this summer in Orlando will be premiering May 27. There’s the revamped The Little Mermaid – A Musical Adventure and Villains: Unfairly Ever After at Disney’s Hollywood Studios. Coming Soon: Pirates of the Caribbean Lounge  – Walt Disney World At the Beak and Barrel we hope there’s no shortage of rum for the Disney adults. More looks at concept art for the lounge coming to the Magic Kingdom have been released, and it looks perfectly pirated-out. We can’t wait to see the level of interaction added to the in-park watering hole thats set to open at the end of summer. For more info visit here. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2025/05/wicked-elphaba-glinda-ush.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eVacation season is on the horizon, and the \u003ca href=\"https://gizmodo.com/new-disney-theme-park-abu-dhabi-2000599126\"\u003elatest news out of the theme parks sphere\u003c/a\u003e brings out the fun festivities just as May gets into the sizzle of things. Universal Studios Hollywood has Mega Movie Summer in store with \u003cem\u003eWicked\u003c/em\u003e characters becoming meet and greets outside of \u003ca href=\"https://gizmodo.com/universal-fan-fest-night-details-star-trek-dungeons-and-dragons-back-to-the-future-2000556203\"\u003eFan Fest Nights\u003c/a\u003e. Epic Universe prepares to open its doors for guests this month in Orlando, with select preview days available to the public.\u003c/p\u003e \u003cp\u003eDisneyland is set to kick off its \u003ca href=\"https://gizmodo.com/disney-says-it-made-its-walt-disney-robot-to-remind-fans-he-was-an-actual-person-2000597559\"\u003e70th anniversary\u003c/a\u003e celebrations next week at the Disneyland resort, while over at Walt Disney World new villainous and sea-spirited experiences await with new shows and a pirate’s shack coming soon. New themed destinations are springing up with DC Comics getting into family experiences at Gaylord hotels, and Meow Wolf Dallas has been named the “Best Location-Based Experience” by the International Association of Amusement Parks and Attractions.\u003c/p\u003e \u003cp\u003eFind out more on this week’s theme park news!\u003c/p\u003e \u003ch2\u003eUniversal Studios Hollywood – Mega Movie Summer\u003c/h2\u003e \u003cfigure id=\"attachment_2000600384\" aria-describedby=\"caption-attachment-2000600384\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-1024x789.jpg\" alt=\"Jaw Hanging Shark – Ush Summer 2025\" width=\"1024\" height=\"789\" srcset=\"https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-1024x789.jpg 1024w, https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-300x231.jpg 300w, https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-768x592.jpg 768w, https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-680x524.jpg 680w, https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025-896x690.jpg 896w, https://gizmodo.com/app/uploads/2025/05/Jaw-hanging-shark-–-USH-Summer-2025.jpg 1220w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000600384\"\u003e© Universal Studios Products and Experiences\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eCelebrate blockbusters with a blast through the movies that made fandom, including Steven Spielberg’s \u003cem\u003eJaws\u003c/em\u003e—which turns 50 this year—and \u003cem\u003eBack to the Future\u003c/em\u003e. The iconic hanging\u003cem\u003e Jaws\u003c/em\u003e shark photo-op will make its return with meet and greet characters playing Quint and Brody, and the DeLorean will make a stop along with meet and greets for the Amblin classic.\u003c/p\u003e\n\n \u003cp\u003eYou’ll not only be able to meet Doc and Marty but Einstein the time-traveling dog will be there too. Additional new meet and greets include \u003cem\u003eWicked\u003c/em\u003e‘s Elphaba and Glinda, a new dino baby just in time for \u003cem\u003eJurassic World Rebirth\u003c/em\u003e, and Toothless from \u003cem\u003eHow to Train Your Dragon\u003c/em\u003e. Mega Movie Summer runs Friday, June 13 through Sunday, August 10.\u003c/p\u003e \u003ch2\u003eUniversal Studios Hollywood – Film Foodie Fun\u003c/h2\u003e \u003cfigure id=\"attachment_2000600386\" aria-describedby=\"caption-attachment-2000600386\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-1024x683.jpg\" alt=\"Jaws Food (1) Mms At Ush 2025\" width=\"1024\" height=\"683\" srcset=\"https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-1024x683.jpg 1024w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-300x200.jpg 300w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-768x512.jpg 768w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-336x224.jpg 336w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-1400x932.jpg 1400w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-680x453.jpg 680w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-896x597.jpg 896w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025-1792x1195.jpg 1792w, https://gizmodo.com/app/uploads/2025/05/Jaws-Food-1-MMS-at-USH-2025.jpg 1920w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000600386\"\u003e© Universal Studios Products and Experiences\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eA selection of themed film foods will be available for Mega Movie Summer. Here’s a listing of what’s been announced so far and where to find it:\u003c/p\u003e \u003cul\u003e \u003cli\u003e\u003cstrong\u003eHollywood \u0026amp; Dine\u003c/strong\u003e \u003cstrong\u003e–\u003c/strong\u003e located just inside the theme park’s main entry, it will transform into “Amity Island Cafe,” serving up a menu fit for a Great White. Menu and beverage highlights will include Lobster Roll, Vegan Crab Cake Sandwich, Fish and Chips, Fish and Chicken Basket, Shark Bait Burger, Shark Fin Funnel Cake, Amity Island Parfait, and Amity Beach Lifesaver Donut, as well as the Shark Bite cocktail and Amity Open Water, a non-alcoholic beverage.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eJurassic Cafe\u003c/strong\u003e \u003cstrong\u003e–\u003c/strong\u003e on the lower lot, it will serve up a new prehistoric-themed delicacies.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eIsla Nubar –\u003c/strong\u003e look for new cocktails the Jurassic Water Rebirth and Spicy Jurassic Pearadise.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eMel’s Diner –\u003c/strong\u003e idyllically captures the essence of\u003cem\u003e Back to the Future,\u003c/em\u003e serving up such menu options as the Flux Capacitor Patty Melt, Time Machine Pastrami Melt, Doc Brown’s Chicken Pot Pie, Outatime Cookie, Time Traveler’s Milk Shake, Flux Capacitor Mocktail, and Wake Up Juice Cocktail.\u003c/li\u003e \u003c/ul\u003e \u003ch2\u003eMeet \u003cem\u003eOne Piece\u003c/em\u003e‘s Straw Hat Crew and More at Universal Fan Fest Nights\u003c/h2\u003e   \u003cp\u003eThere’s a few more weeks left of the interactive and fandom-fueled fun at Universal Fan Fest Nights at Universal Studios Hollywood. Don’t miss out on meeting the Straw Hats, \u003cem\u003eWicked\u003c/em\u003e‘s witches, and exploring Hill Valley in a \u003cem\u003eBack to the Future\u003c/em\u003e experience that’s out of time! Get tickets \u003ca href=\"https://www.universalstudioshollywood.com/hhn/en/us/things-to-do/events-and-seasonal-activities/fan-fest-nights?__source=PS_SQTW4SM7DH_3573:NoOfferTIX\u0026amp;gad_source=1\u0026amp;gad_campaignid=22130631253\u0026amp;gbraid=0AAAAAD7MCzu-XRLMLCQo7V1PKHIwB38ct\u0026amp;gclid=CjwKCAjwz_bABhAGEiwAm-P8YX0QbjW4gOn1zIe-dmVtEQQ1J4LmKiVCIBz7NTgGghoKAb7aMtBX9RoCZsEQAvD_BwE\u0026amp;gclsrc=aw.ds\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n \u003ch2\u003eEpic Universe – Universal Studios Resorts Orlando, Florida\u003c/h2\u003e   \u003cp\u003eTake a look at this POV of Hiccup’s Wing Gliders, a family coaster inspired by \u003cem\u003eHow to Train Your\u003c/em\u003e \u003cem\u003eDragon\u003c/em\u003e at Epic Universe’s Isle of Berk. Tickets for select preview dates are still available \u003ca href=\"https://www.universalorlando.com/web/en/us/plan-your-visit/hours-information/park-hours/epic-universe\"\u003ehere\u003c/a\u003e.\u003c/p\u003e \u003ch2\u003eMeow Wolf “The Real Unreal” – Grapevine, Texas\u003c/h2\u003e   \u003cp\u003eMeow Wolf’s Grapevine, Texas outpost has been named “the best location-based experience” by the International Association of Amusement Parks and Attractions. This honor includes competition from major studio driven parks and is a win for the immersive whimsical chaos of the Meow Wolf brand. For more info visit \u003ca href=\"https://meowwolf.com/visit/grapevine\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n \u003ch2\u003eDC Comics Takeover at Gaylord Hotels\u003c/h2\u003e   \u003cp\u003eMemorial Day weekend at Gaylord Resorts nationwide will mark the start of the brand’s foray into participatory entertainment in collaboration with DC. The official Warner Bros. partnership will include immersive experiences for those staying at select vacation resorts. A special walk-through exhibit will be featured at the Gaylord Texan in Grapevine, Texas, which will provide an interactive walk-through that boasts “multiple DC worlds and 40 iconic DC Super Heroes and Super-Villains in more than 1,000 glowing lanterns constructed by master artisans from Zigong, China.”\u003c/p\u003e \u003cp\u003eMore activations at the rest of the Gaylord hotels participating in DC Summer include:\u003c/p\u003e\n\n \u003cul\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero’s Mission Checklist:\u003c/strong\u003e Begin the adventure at check in with a Super Hero badge and a checklist of challenges to complete across the resort. Guests can celebrate their heroic feats with a Super Hero Certificate at check out.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eRevenge of the Riddler Scavenger Hunt:\u003c/strong\u003e Work with the Justice League to solve the Riddler’s tricky puzzles scattered throughout the resort.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero Craft Zone:\u003c/strong\u003e Let the superhero within take shape by embracing creativity at this fun arts and crafts station. Every superhero should help shape their origin story.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eHall of Justice Character Dining:\u003c/strong\u003e Guests can fuel their inner powers at the Justice League’s dining hall. Wonder Woman, Batman, and Superman join guests at this one-of-a-kind dining experience packed with epic eats and gems of courage and truth.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eCharacter Dining with the Joker and Harley Quinn:\u003c/strong\u003e Step into the twisted world of Gotham City, where danger and excitement await at every turn. While savoring a meal fit for heroes, guests will face a choice: help Batman bring the Super-Villains to justice or help Harley Quinn and the Joker with their secret plan.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Secret Menu:\u003c/strong\u003e Use a secret codeword to access a special menu. Super Hero-inspired cocktails, mighty appetizers and legendary desserts await—because saving the world works up an appetite.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero Academy Live Show:\u003c/strong\u003e Hear legendary tales straight from the comic books! But this isn’t just story time, it’s a chance for guests to jump into the action and flex their super powers. Solve puzzles, test heroic instincts and craft a personal adventure. Stay sharp —heroes may make a surprise appearance.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero Sightings:\u003c/strong\u003e A member of the Justice League is on a mission to thwart the Riddler’s latest nefarious plot right here and needs assistance. Snap a photo, lend a hand and be a part of the heroics.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero Splash:\u003c/strong\u003e Dive into an unforgettable poolside celebration packed with superhero games, DC trivia, epic waterslides and DJ-spun beats. It’s the ultimate splash bash for heroes of all ages.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Movie Night Poolside:\u003c/strong\u003e The pool offers guests a front-row seat to watch DC Super Heroes on the big screen. Featuring themed snacks and fellow fans all around, this outdoor movie night is a personal Super Hero escape, placing everyone in the middle of the action.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Fun by the Pool:\u003c/strong\u003e Relax by the water with fun facts, hero spotlights, specialty Super Hero inspired cocktails, and refreshing Icee drinks like Amazonian Freeze and Metropolis Chill to soak in the fun.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eBattle for Justice Light Show:\u003c/strong\u003e Watch the mesmerizing clash between DC’s greatest Super Heroes and Super-Villains unfold across the night sky through electrifying visuals, stunning lighting effects and a cinematic musical score that will keep everyone glued to their seats until the thrilling finale.\u003c/li\u003e \u003cli\u003e\u003cstrong\u003eDC Super Hero Supply Pack:\u003c/strong\u003e Start the adventure with a themed welcome pack featuring iconic DC Super Heroes. Inside: a cape, autograph book, projector pen, sticker, and bag to kick off a heroic journey.\u003c/li\u003e \u003c/ul\u003e \u003cp\u003eBook \u003ca href=\"https://www.gaylordhotels.com/dcsummer\"\u003ehere\u003c/a\u003e.\u003c/p\u003e \u003ch2\u003eDisneyland Resort – Disneyland’s 70th Anniversary\u003c/h2\u003e   \u003cp\u003eThe Jonas Brothers will debut a new single to celebrate 70 years of Disneyland with an official album that will soundtrack the theme park’s milestone. Fans will be able to listen to their “Celebrate Happy” during a new park character cavalcade, along with new renditions of Disney faves and new original tracks starting May 16 at the Disneyland Resort. For more information visit \u003ca href=\"https://disneyland.disney.go.com/events-tours/70th-anniversary/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e \u003ch2\u003eDisney Villain and Mermaid Experiences – Walt Disney World\u003c/h2\u003e   \u003cp\u003eTwo new shows to beat the heat this summer in Orlando will be premiering May 27. There’s the revamped \u003cem\u003eThe Little Mermaid – A Musical Adventure\u003c/em\u003e and \u003cem\u003eVillains: Unfairly Ever After\u003c/em\u003e at Disney’s Hollywood Studios.\u003c/p\u003e\n\n \u003ch2\u003eComing Soon: \u003cem\u003ePirates of the Caribbean\u003c/em\u003e Lounge  – Walt Disney World\u003c/h2\u003e   \u003cp\u003eAt the Beak and Barrel we hope there’s no shortage of rum for the Disney adults. More looks at concept art for the lounge coming to the Magic Kingdom have been released, and it looks perfectly pirated-out. We can’t wait to see the level of interaction added to the in-park watering hole thats set to open at the end of summer. For more info visit \u003ca href=\"https://disneyworld.disney.go.com/dining/magic-kingdom/beak-barrel/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-09T23:20:27Z",
  "modifiedTime": "2025-05-09T23:20:27Z"
}
