{
  "id": "c21085fa-5c30-425d-9026-56ae7a64fb29",
  "title": "You Can Use Gemini to Build Google Home Automations, but Should You?",
  "link": "https://lifehacker.com/tech/you-can-use-gemini-to-build-google-home-automations-but-should-you",
  "description": "Google's Gemini can now help you create advanced automation scripts in Google Home, but it's still complicated and riddled with errors.",
  "author": "Amanda Blum",
  "published": "Mon, 18 Nov 2024 23:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "AI"
  ],
  "byline": "Amanda Blum",
  "length": 9143,
  "excerpt": "Google's Gemini can now help you create advanced automation scripts in Google Home, but it's still complicated and riddled with errors.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Google's Gemini can now help you create advanced automation scripts in Google Home, but it's still complicated and riddled with errors. Credit: mindea/Shutterstock Smart devices, on their own, are nifty, but one-note. You can turn things on or off, adjust volume or brightness, or tell your vacuum where to go. But automations are what make smart homes awesome: you network your devices together, create dependencies, and set up if/this, then/that scenarios to automatically execute tasks. Building these automations always takes a little finesse, but now, Google's Gemini AI offers to set up automations for you. When I tested this new feature, I hoped it was for the layman who might be intimidated by the basic automation creation flow. What I found, instead, was a feature intended for advanced users who want to dive into using a new tool called the the script editor (Google's tool for writing custom automations). Most users won't have automations that require more than the standard home automation wizard that has always existed, meaning they won't need to crack open the script editor or get Gemini's help here—which is great, because the feature doesn't seem fully baked yet. These features could become useful in the future, as complicated smart home automations become more powerful and necessary, but for now, I found Gemini unable to offer error-free assistance. Google Home, Gemini, and the script editorThere are three key components to building automations through Google services. First, there's Google Home. This is a home base for all your smart home devices, the status and settings of your wifi, and best of all, automations. If you want to turn on a lightbulb, you can do that by tapping a button or asking Google Assistant. But if you don't want to ask, automations will turn the light on based on criteria you set up, like a time of day, activity of another device, or a certain phrase you tell Assistant. You simply have to create an automation in Google Home telling it to do so, and there's a straightforward setup wizard here to help you do so. Google Home recently added a desktop app, which is still in beta, but you can create automations and control your smart home from your computer, as well. Gemini, on the other hand, is Google's large language model and AI chatbot. The company has been integrating Gemini into all sorts of Google functionality, including a chatbot available on iPhone and Android. Right now, it's most useful as an assistant that opens in the sidebar of most Google apps and can respond to real language questions. It can already do this in Gmail, finding content or tightening up the language you use, and Google Meet, taking meeting notes on your behalf. Theoretically, using Gemini to create automations for users would be a great feature, but it turns out it is actually more complicated to use Gemini than to use the current wizard. Most Google products, including Sheets and Docs have had a script editor called Apps script for a while, but it's not used often. It's a feature targeted mostly for advanced users that allows you to create your own scripts, or paste scripts other people have written to do things your products don't do out of the box. The new script editor for Google Home is similar. Although it uses a different language (YAML) than Apps script, the purpose is the same: allow advanced users to do more than the automation wizard allows. How to set up automations in Google HomeThe current user flow to build automations in Google Home is straightforward for simple tasks, but any tasks that eclipse what the current Automations wizard will do, could, in theory, require the script editor. (For the record, I've been using Google Home prolifically for five years and never once needed to use the script editor for even one of my wacky automation ideas). If you're not a coder, the script editor in any Google product can be intimidating, so having Gemini handle this for you is a big lift, if it worked. But that wasn't my experience. To get Gemini's help, you'll need to sign up for servicesNow, some notes. This does, in fact, require that you give Google permission to activate Gemini on your phone. I've been avoiding this since I activated my new Pixel a few weeks ago, but for the purpose of this article, I decided it was time to dive in. While endlessly useful, Gemini isn't free in some cases. You'll also need to join the app's public preview to access the script editor. This was a few simple steps. Open the Google Home app, go to Settings, and then click on Join Public Preview. Go to settings, and then activate public preview Credit: Amanda Blum Accessing Gemini is easier on the desktop appGoogle calls this assistive lift from Gemini \"Help me script.\" To be abundantly clear, using the script editor on any day is not for the weak. Its a code language, YAML, is technically easier to write than other code bases like Php, Perl, Ruby, or Javascript. However, if you don't know YAML, there's a learning curve, and it is still code. Personally, I'd expect that if you pay for this Gemini assistance, you wouldn't need to know YAML. That is not the case, I found. Once you've signed up for preview, and Gemini is activated, you can open the script editor on your Google Home app or the web interface. How to access the script editor on the Google Home app Credit: Amanda Blum This was my first time using the web interface, but since there's copying and pasting involved, I'd suggest using it over the app. Plus, Gemini didn't want to pop up on the app for me, so all the more reason to use the desktop interface. On the right hand side of the script editor, you can see the Gemini prompt Credit: Amanda Blum Most scripts by Gemini had errorsTo start, I asked for help with simple automations that could be done in the wizard: tell me when it's sunset every day. This automation doesn't involve any devices, simply an out-of-the-box piece of data that Google already has. (\"What time is sunset?\") Gemini spit out the code, and instructed me to copy and paste it into the script editor and validate it, but warned it already had an error. The script editor confirmed this as well, and identified the problematic line of code. A mouseover explained why I was seeing the error so I could correct it. This happened over and over, where I would ask Gemini to create a script for something relatively easy (\"turn on backyard lights when backyard camera detects activity\") and I'd get errors. Sometimes, the script editor could explain them, sometimes it could not. But Gemini, an AI chatbot designed to answer questions from users, had no function to help me solve the problem. Some mild digging on the internet was unhelpful, since each kind of device has different possible commands, and everything I read suggested the commands Gemini wrote should work. Remember, I hadn't asked Gemini to do anything difficult yet, all the automations I asked for would have been very easy to do in the regular automation panel, without the script editor or Gemini. Errors are shown as rollover tips in the script editor Credit: Amanda Blum If you're successful with the script editor (I was able to clear some errors with a little help from the tool tips and some research), you save the script, and then it appears in your list of automations. You can turn it on and off at will, and when it is activated, you'll see it in automation history. Who is the script editor and \"Help Me Script\" for?As I said, I'm an automation enthusiast, and I have a ton of them running. I also code. Despite both of those facts, I maintain that most people won't need the script editor, but there are some examples where it would make sense. Anything with a double dependency would use the script editor. For instance, if I want a fan to turn on when it's over 80 degrees, I can do that in Google Home. I can also have the fan turn on if it's dark out. What I can't do is require both circumstances, unless I'm using the script editor. Additionally, the script editor would let me set conditionals, like, \"if it's over 80 degrees, turn on the fan, but if it's under 60, turn on the heater.\" You can hack these situations together using many automations that aren't connected in Google Home, but the script editor would be a more efficient way to do so in one clean user flow. Unfortunately, to make that happen, you're still going to need to learn YAML for now, because Gemini's help isn't going to do your homework for you: For the most part, and for most people, Gemini just isn't ready to script your automations for you.",
  "image": "https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/hero-image.fill.size_1200x675.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eGoogle\u0026#39;s Gemini can now help you create advanced automation scripts in Google Home, but it\u0026#39;s still complicated and riddled with errors.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/hero-image.fill.size_1248x702.v1731953276.jpg\" alt=\"macbook pro running Gemini logo\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/hero-image.fill.size_400x225.v1731953276.jpg 400w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/hero-image.fill.size_800x450.v1731953276.jpg 800w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/hero-image.fill.size_1248x702.v1731953276.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: mindea/Shutterstock\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eSmart devices, on their own, are nifty, but one-note. You can turn things on or off, adjust volume or brightness, or tell your vacuum where to go. But automations are what make smart homes awesome: you network your devices together, create dependencies, and set up if/this, then/that scenarios to automatically execute tasks. Building these automations always takes a little finesse, but now, Google\u0026#39;s Gemini AI offers to set up automations for you. \u003c/p\u003e\u003cp\u003eWhen I tested this new feature, I hoped it was for the layman who might be intimidated by the basic automation creation flow. What I found, instead, was a feature intended for advanced users who want to dive into using a new tool called the \u003ca href=\"https://support.google.com/googlenest/answer/13323253?sjid=55618428849603627-NA\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003ethe script editor\u003c/a\u003e (Google\u0026#39;s tool for writing custom automations). Most users won\u0026#39;t have automations that require more than the standard home automation wizard that has always existed, meaning they won\u0026#39;t need to crack open the script editor or get Gemini\u0026#39;s help here—which is great, because the feature doesn\u0026#39;t seem fully baked yet. These features could become useful in the future, as complicated smart home automations become more powerful and necessary, but for now, I found Gemini unable to offer error-free assistance. \u003c/p\u003e\u003ch2 id=\"google-home-gemini-and-the-script-editor\"\u003eGoogle Home, Gemini, and the script editor\u003c/h2\u003e\u003cp\u003eThere are three key components to building automations through Google services. First, there\u0026#39;s \u003ca href=\"https://home.google.com/welcome/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eGoogle Home\u003c/a\u003e. This is a home base for all your smart home devices, the status and settings of your wifi, and best of all, automations. If you want to turn on a lightbulb, you can do that by tapping a button or asking Google Assistant. But if you don\u0026#39;t want to ask, automations will turn the light on based on criteria you set up, like a time of day, activity of another device, or a certain phrase you tell Assistant. You simply have to create an automation in Google Home telling it to do so, and there\u0026#39;s a straightforward setup wizard here to help you do so. Google Home recently added a \u003ca href=\"https://home.google.com/\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003edesktop app\u003c/a\u003e, which is still in beta, but you can create automations and control your smart home from your computer, as well. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://lifehacker.com/tech/googles-gemini-advanced-ai-is-ready-to-take-on-chatgpt-plus\" target=\"_blank\"\u003eGemini\u003c/a\u003e, on the other hand, is Google\u0026#39;s \u003ca href=\"https://lifehacker.com/your-ultimate-ai-glossary-1850575803\" target=\"_blank\"\u003elarge language model\u003c/a\u003e and AI chatbot. The company has been integrating Gemini into all sorts of Google functionality, including a chatbot available on \u003ca href=\"https://lifehacker.com/tech/googles-gemini-finally-has-an-iphone-app\" target=\"_blank\"\u003eiPhone\u003c/a\u003e and \u003ca href=\"https://lifehacker.com/tech/how-to-use-gemini-live-on-your-android-phone\" target=\"_blank\"\u003eAndroid.\u003c/a\u003e Right now, it\u0026#39;s most useful as an \u003ca href=\"https://lifehacker.com/tech/gemini-coming-to-side-panel-of-google-apps\" target=\"_blank\"\u003eassistant that opens in the sidebar of most Google apps\u003c/a\u003e and can respond to real language questions. It can already do this in \u003ca href=\"https://lifehacker.com/tech/gemini-ask-about-gmail-inbox-on-android\" target=\"_blank\"\u003eGmail\u003c/a\u003e, finding content or tightening up the \u003ca href=\"https://lifehacker.com/tech/two-new-gemini-for-gmail-features\" target=\"_blank\"\u003elanguage\u003c/a\u003e you use, and \u003ca href=\"https://lifehacker.com/tech/gemini-take-notes-during-google-meet-calls\" target=\"_blank\"\u003eGoogle Meet\u003c/a\u003e, taking meeting notes on your behalf. Theoretically, using Gemini to create automations for users would be a great feature, but it turns out it is actually more complicated to use Gemini than to use the current wizard. \u003c/p\u003e\u003cp\u003eMost Google products, including Sheets and Docs have had a script editor called \u003ca href=\"https://developers.google.com/apps-script\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eApps script\u003c/a\u003e for a while, but it\u0026#39;s not used often. It\u0026#39;s a feature targeted mostly for advanced users that allows you to create your own scripts, or paste scripts other people have written to do things your products don\u0026#39;t do out of the box. The new script editor for Google Home is similar. Although it uses a different language (\u003ca href=\"https://support.google.com/googlenest/answer/13323253?sjid=574285567991437367-NC#zippy=%2Cyaml-quick-reference-guide\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003eYAML\u003c/a\u003e) than Apps script, the purpose is the same: allow advanced users to do more than the automation wizard allows. \u003c/p\u003e\u003ch2 id=\"how-to-set-up-automations-in-google-home\"\u003eHow to set up automations in Google Home\u003c/h2\u003e\u003cp\u003eThe current user flow to \u003ca href=\"https://lifehacker.com/tech/how-to-set-up-google-home-automations\" target=\"_blank\"\u003ebuild automations\u003c/a\u003e in Google Home is straightforward for simple tasks, but any tasks that eclipse what the current Automations wizard will do, could, in theory, require the script editor. (For the record, I\u0026#39;ve been using Google Home prolifically for five years and never once needed to use the script editor for even one of my wacky automation ideas). If you\u0026#39;re not a coder, the script editor in any Google product can be intimidating, so having Gemini handle this for you is a big lift, if it worked. But that wasn\u0026#39;t my experience. \u003c/p\u003e\u003ch2 id=\"to-get-geminis-help-youll-need-to-sign-up-for-services\"\u003eTo get Gemini\u0026#39;s help, you\u0026#39;ll need to sign up for services\u003c/h2\u003e\u003cp\u003eNow, some notes. This does, in fact, require that you give Google permission to activate Gemini on your phone. I\u0026#39;ve been avoiding this since I activated my new \u003ca href=\"https://lifehacker.com/tech/pixel-9-is-googles-best-phone-for-most-people\" target=\"_blank\"\u003ePixel\u003c/a\u003e a few weeks ago, but for the purpose of this article, I decided it was time to dive in. While endlessly useful, Gemini isn\u0026#39;t free in some cases. You\u0026#39;ll also need to join the app\u0026#39;s \u003ca href=\"https://support.google.com/googlenest/answer/12494697\" target=\"_blank\" title=\"open in a new window\" rel=\"noopener\"\u003epublic preview\u003c/a\u003e to access the script editor. This was a few simple steps. Open the \u003cstrong\u003eGoogle Home app\u003c/strong\u003e, go to \u003cstrong\u003eSettings\u003c/strong\u003e, and then click on \u003cstrong\u003eJoin Public Preview\u003c/strong\u003e.\u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-1.fill.size_336x750.v1731914854.jpg\" alt=\"public preview activation on Google home\" width=\"336\" height=\"750\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-1.fill.size_800x1785.v1731914854.jpg 800w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-1.fill.size_1400x3124.v1731914854.jpg 1400w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-1.fill.size_2000x4463.v1731914854.jpg 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003eGo to settings, and then activate public preview\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Amanda Blum\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003ch2 id=\"accessing-gemini-is-easier-on-the-desktop-app\"\u003eAccessing Gemini is easier on the desktop app\u003c/h2\u003e\u003cp\u003eGoogle calls this assistive lift from Gemini \u0026#34;Help me script.\u0026#34; To be abundantly clear, using the script editor on any day is not for the weak. Its a code language, YAML, is technically easier to write than other code bases like Php, Perl, Ruby, or Javascript. However, if you don\u0026#39;t know YAML, there\u0026#39;s a learning curve, and it is still code. Personally, I\u0026#39;d expect that if you pay for this Gemini assistance, you wouldn\u0026#39;t need to know YAML. That is not the case, I found. \u003c/p\u003e\u003cp\u003eOnce you\u0026#39;ve signed up for preview, and Gemini is activated, you can open the script editor on your Google Home app or the web interface. \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-4.fill.size_2000x1428.v1731914854.jpg\" alt=\"How to activate the script editor in the app\" width=\"2000\" height=\"1428\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-4.fill.size_800x571.v1731914854.jpg 800w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-4.fill.size_1400x1000.v1731914854.jpg 1400w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-4.fill.size_2000x1428.v1731914854.jpg 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003eHow to access the script editor on the Google Home app\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Amanda Blum\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eThis was my first time using the web interface, but since there\u0026#39;s copying and pasting involved, I\u0026#39;d suggest using it over the app. Plus, Gemini didn\u0026#39;t want to pop up on the app for me, so all the more reason to use the desktop interface. \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-2.fill.size_2000x1217.v1731914854.png\" alt=\"Script editor home with Gemini pane\" width=\"2000\" height=\"1217\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-2.fill.size_800x487.v1731914854.png 800w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-2.fill.size_1400x852.v1731914854.png 1400w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-2.fill.size_2000x1217.v1731914854.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003eOn the right hand side of the script editor, you can see the Gemini prompt\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Amanda Blum\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003ch2 id=\"most-scripts-by-gemini-had-errors\"\u003eMost scripts by Gemini had errors\u003c/h2\u003e\u003cp\u003eTo start, I asked for help with simple automations that could be done in the wizard: tell me when it\u0026#39;s sunset every day.  This automation doesn\u0026#39;t involve any devices, simply an out-of-the-box piece of data that Google already has. (\u0026#34;What time is sunset?\u0026#34;) Gemini spit out the code, and instructed me to copy and paste it into the script editor and validate it, but warned it already had an error. The script editor confirmed this as well, and identified the problematic line of code. A mouseover explained why I was seeing the error so I could correct it. \u003c/p\u003e\u003cp\u003eThis happened over and over, where I would ask Gemini to create a script for something relatively easy (\u0026#34;turn on backyard lights when backyard camera detects activity\u0026#34;) and I\u0026#39;d get errors. Sometimes, the script editor could explain them, sometimes it could not. But Gemini, an AI chatbot designed to answer questions from users, had no function to help me solve the problem. Some mild digging on the internet was unhelpful, since each kind of device has different possible commands, and everything I read suggested the commands Gemini wrote should work. Remember, I hadn\u0026#39;t asked Gemini to do anything difficult yet, all the automations I asked for would have been very easy to do in the regular automation panel, without the script editor or Gemini. \u003c/p\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-5.fill.size_2000x1212.v1731914854.png\" alt=\"errors in the script editor panel\" width=\"2000\" height=\"1212\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-5.fill.size_800x485.v1731914854.png 800w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-5.fill.size_1400x849.v1731914854.png 1400w, https://lifehacker.com/imagery/articles/01JCZ2PW0AA2R6FRDHQ25AXCH4/images-5.fill.size_2000x1212.v1731914854.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003eErrors are shown as rollover tips in the script editor\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Amanda Blum\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eIf you\u0026#39;re successful with the script editor (I was able to clear some errors with a little help from the tool tips and some research), you save the script, and then it appears in your list of automations. You can turn it on and off at will, and when it is activated, you\u0026#39;ll see it in automation history. \u003c/p\u003e\u003ch2 id=\"who-is-the-script-editor-and-help-me-script-for\"\u003eWho is the script editor and \u0026#34;Help Me Script\u0026#34; for?\u003c/h2\u003e\u003cp\u003eAs I said, I\u0026#39;m an automation enthusiast, and I have a ton of them running. I also code. Despite both of those facts, I maintain that most people won\u0026#39;t need the script editor, but there are some examples where it would make sense. Anything with a double dependency would use the script editor. For instance, if I want a fan to turn on when it\u0026#39;s over 80 degrees, I can do that in Google Home. I can also have the fan turn on if it\u0026#39;s dark out. What I can\u0026#39;t do is require both circumstances, unless I\u0026#39;m using the script editor. Additionally, the script editor would let me set conditionals, like, \u0026#34;if it\u0026#39;s over 80 degrees, turn on the fan, but if it\u0026#39;s under 60, turn on the heater.\u0026#34; \u003c/p\u003e\u003cp\u003eYou can hack these situations together using many automations that aren\u0026#39;t connected in Google Home, but the script editor would be a more efficient way to do so in one clean user flow. Unfortunately, to make that happen, you\u0026#39;re still going to need to learn YAML for now, because Gemini\u0026#39;s help isn\u0026#39;t going to do your homework for you: For the most part, and for most people, Gemini just isn\u0026#39;t ready to script your automations for you.\u003c/p\u003e\n    \u003c/article\u003e\n\n                        \n            \n    \n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-18T23:00:00Z",
  "modifiedTime": "2024-11-18T23:00:00Z"
}
