{
  "id": "c7a6bf85-a5d8-4c84-b566-3f7407b65e8c",
  "title": "First Electronic-Photonic Quantum Chip Created In Commercial Foundry",
  "link": "https://hardware.slashdot.org/story/25/07/20/0042202/first-electronic-photonic-quantum-chip-created-in-commercial-foundry?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "It's \"a milestone for scalable quantum technologies,\" according to the announcement from Boston University. Scientists from Boston University, UC Berkeley, and Northwestern University \"reported the world's first electronic-photonic-quantum system on a chip, according to a study published in Nature Electronics.\" Quantum computing is on \"a decades-long path from concept to reality,\" says Milos PopoviÄ, associate professor of electrical and computer engineering at BU and a senior author on the study. \"This is a small step on that path — but an important one, because it shows we can build repeatable, controllable quantum systems in commercial semiconductor foundries.\" The system combines quantum light sources and stabilizing electronics using a standard 45-nanometer semiconductor manufacturing process to produce reliable streams of correlated photon pairs (particles of light) — a key resource for emerging quantum technologies. The advance paves the way for mass-producible \"quantum light factory\" chips and large-scale quantum systems built from many such chips working together... Just as electronic chips are powered by electric currents, and optical communication links by laser light, future quantum technologies will require a steady stream of quantum light resource units to perform their functions. To provide this, the researchers' work created an array of \"quantum light factories\" on a silicon chip, each less than a millimeter by a millimeter in dimension... \"What excites me most is that we embedded the control directly on-chip — stabilizing a quantum process in real time,\" says Anirudh Ramesh, a PhD student at Northwestern who led the quantum measurements. \"That's a critical step toward scalable quantum systems.\" Thanks to long-time Slashdot reader fahrbot-bot for sharing the news. Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2025-07-20T00:44:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "hardware"
  ],
  "byline": "",
  "length": 1821,
  "excerpt": "It's \"a milestone for scalable quantum technologies,\" according to the announcement from Boston University. Scientists from Boston University, UC Berkeley, and Northwestern University \"reported the world's first electronic-photonic-quantum system on a chip, according to a study published in Nature E...",
  "siteName": "",
  "favicon": "",
  "text": "It's \"a milestone for scalable quantum technologies,\" according to the announcement from Boston University. Scientists from Boston University, UC Berkeley, and Northwestern University \"reported the world's first electronic-photonic-quantum system on a chip, according to a study published in Nature Electronics.\" Quantum computing is on \"a decades-long path from concept to reality,\" says Milos PopoviÄ, associate professor of electrical and computer engineering at BU and a senior author on the study. \"This is a small step on that path — but an important one, because it shows we can build repeatable, controllable quantum systems in commercial semiconductor foundries.\" The system combines quantum light sources and stabilizing electronics using a standard 45-nanometer semiconductor manufacturing process to produce reliable streams of correlated photon pairs (particles of light) — a key resource for emerging quantum technologies. The advance paves the way for mass-producible \"quantum light factory\" chips and large-scale quantum systems built from many such chips working together... Just as electronic chips are powered by electric currents, and optical communication links by laser light, future quantum technologies will require a steady stream of quantum light resource units to perform their functions. To provide this, the researchers' work created an array of \"quantum light factories\" on a silicon chip, each less than a millimeter by a millimeter in dimension... \"What excites me most is that we embedded the control directly on-chip — stabilizing a quantum process in real time,\" says Anirudh Ramesh, a PhD student at Northwestern who led the quantum measurements. \"That's a critical step toward scalable quantum systems.\" Thanks to long-time Slashdot reader fahrbot-bot for sharing the news.",
  "image": "https://a.fsdn.com/sd/topics/hardware_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178420658\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tIt\u0026#39;s \u0026#34;a milestone for scalable quantum technologies,\u0026#34; according to the \u003ca href=\"https://www.bu.edu/eng/2025/07/14/first-electronic-photonic-quantum-chip-created-in-commercial-foundry/\"\u003eannouncement from Boston University\u003c/a\u003e. Scientists from Boston University, UC Berkeley, and Northwestern University \u0026#34;reported the world\u0026#39;s first electronic-photonic-quantum system on a chip, according to a \u003ca href=\"https://www.nature.com/articles/s41928-025-01410-5\"\u003estudy published in \u003cem\u003eNature Electronics\u003c/em\u003e\u003c/a\u003e.\u0026#34;\u003c/p\u003e\u003cp\u003e \n\nQuantum computing is on \u0026#34;a decades-long path from concept to reality,\u0026#34; says Milos PopoviÄ, associate professor of electrical and computer engineering at BU and a senior author on the study.  \u0026#34;This is a small step on that path — but an important one, because it shows we can build repeatable, controllable quantum systems in commercial semiconductor foundries.\u0026#34;\n\u003ci\u003e\nThe system combines quantum light sources and stabilizing electronics using a standard 45-nanometer semiconductor manufacturing process to produce reliable streams of correlated photon pairs (particles of light) — a key resource for emerging quantum technologies.   The advance paves the way for mass-producible \u0026#34;quantum light factory\u0026#34; chips and large-scale quantum systems built from many such chips working together...\u003cp\u003e \n\nJust as electronic chips are powered by electric currents, and optical communication links by laser light, future quantum technologies will require a steady stream of quantum light resource units to perform their functions. To provide this, the researchers\u0026#39; work created an array of \u0026#34;quantum light factories\u0026#34; on a silicon chip, each less than a millimeter by a millimeter in dimension... \u0026#34;What excites me most is that we embedded the control directly on-chip — stabilizing a quantum process in real time,\u0026#34; says Anirudh Ramesh, a PhD student at Northwestern who led the quantum measurements. \u0026#34;That\u0026#39;s a critical step toward scalable quantum systems.\u0026#34;\n\u003c/p\u003e\u003c/i\u003e \u003cbr/\u003e\n\n\u003cem\u003eThanks to long-time Slashdot reader \u003ca href=\"https://hardware.slashdot.org/~fahrbot-bot\"\u003efahrbot-bot\u003c/a\u003e for sharing the news.\n\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
