{
  "id": "c929dc0e-c4b4-408b-bb0d-3079c7590923",
  "title": "Bob Dylan has some Dylanesque thoughts on the “sorcery” of technology",
  "link": "https://arstechnica.com/culture/2025/01/bob-dylan-wont-watch-dog-ass-tv-but-he-will-binge-the-twilight-zone/",
  "description": "Making high-tech resolutions for 2025 with the help of Bob Dylan.",
  "author": "Nate Anderson",
  "published": "Sat, 04 Jan 2025 12:00:34 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Culture",
    "Tech",
    "binge watching",
    "bob Dylan",
    "technology"
  ],
  "byline": "Nate Anderson",
  "length": 2381,
  "excerpt": "Making high-tech resolutions for 2025 with the help of Bob Dylan.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "We might expect someone like Dylan, immersed as he has always been in folk songs, old standards, and American history, to bemoan the corrupting influence of new technology. And he does offer up some quotes in that vein. For example: Everything’s become too smooth and painless… The earth could vomit up its dead, and it could be raining blood, and we’d shrug it off, cool as cucumbers. Everything’s too easy. Just one stroke of the ring finger, middle finger, one little click, that’s all it takes, and we’re there. Or again: Technology is like sorcery, it’s a magic show, conjures up spirits, it’s an extension of our body, like the wheel is an extension of our foot. But it might be the final nail driven into the coffin of civilization; we just don’t know. But Dylan's perspective is more nuanced than these quotes might suggest. While technology might doom our civilization, Dylan reminds us that it gave us our civilization—that is, \"science and technology built the Parthenon, the Egyptian pyramids, the Roman coliseum, the Brooklyn Bridge, the Eiffel Tower, rockets, jets, planes, automobiles, atom bombs, weapons of mass destruction.\" In the end, technology is a tool that can either decimate or stimulate human creativity. Keypads and joysticks can be like millstones around your neck, or they can be supporting players; either one, you’re the judge. Creativity is a mysterious thing. It visits who it wants to visit, when it wants to, and I think that that, and that alone, gets to the heart of the matter... [Technology] can hamper creativity, or it can lend a helping hand and be an assistant. Creative power can be dammed up or forestalled by everyday life, ordinary life, life in the squirrel cage. A data processing machine or a software program might help you break out of that, get you over the hump, but you have to get up early. Getting up early I've been thinking about these quotes over the recent Christmas and New Year's holidays, which I largely spent coughing on the couch with some kind of respiratory nonsense. One upside of this enforced isolation was that it gave me plenty of time to ponder my own goals for 2025 and how technology might help or hinder them. (Another was that I got to rewatch the first four Die Hard movies on Hulu; the fourth was \"dog ass\" enough that I couldn't bring myself to watch the final, roundly panned entry in the series.)",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/GettyImages-1698497901-scaled-1152x648-1735850061.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n          \n          \n\u003cp\u003eWe might expect someone like Dylan, immersed as he has always been in folk songs, old standards, and American history, to bemoan the corrupting influence of new technology. And he does offer up some quotes in that vein. For example:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eEverything’s become too smooth and painless… The earth could vomit up its dead, and it could be raining blood, and we’d shrug it off, cool as cucumbers. Everything’s too easy. Just one stroke of the ring finger, middle finger, one little click, that’s all it takes, and we’re there.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eOr again:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eTechnology is like sorcery, it’s a magic show, conjures up spirits, it’s an extension of our body, like the wheel is an extension of our foot. But it might be the final nail driven into the coffin of civilization; we just don’t know.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eBut Dylan\u0026#39;s perspective is more nuanced than these quotes might suggest. While technology might doom our civilization, Dylan reminds us that it \u003cem\u003egave\u003c/em\u003e us our civilization—that is, \u0026#34;science and technology built the Parthenon, the Egyptian pyramids, the Roman coliseum, the Brooklyn Bridge, the Eiffel Tower, rockets, jets, planes, automobiles, atom bombs, weapons of mass destruction.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn the end, technology is a tool that can either decimate or stimulate human creativity.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eKeypads and joysticks can be like millstones around your neck, or they can be supporting players; either one, you’re the judge. Creativity is a mysterious thing. It visits who it wants to visit, when it wants to, and I think that that, and that alone, gets to the heart of the matter...\u003c/p\u003e\n\u003cp\u003e[Technology] can hamper creativity, or it can lend a helping hand and be an assistant. Creative power can be dammed up or forestalled by everyday life, ordinary life, life in the squirrel cage. A data processing machine or a software program might help you break out of that, get you over the hump, but you have to get up early.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch2\u003eGetting up early\u003c/h2\u003e\n\u003cp\u003eI\u0026#39;ve been thinking about these quotes over the recent Christmas and New Year\u0026#39;s holidays, which I largely spent coughing on the couch with some kind of respiratory nonsense. One upside of this enforced isolation was that it gave me plenty of time to ponder my own goals for 2025 and how technology might help or hinder them. (Another was that I got to rewatch the first four Die Hard movies on Hulu; the fourth was \u0026#34;dog ass\u0026#34; enough that I couldn\u0026#39;t bring myself to watch the final, roundly panned entry in the series.)\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-04T12:00:34Z",
  "modifiedTime": "2025-01-04T12:11:31Z"
}
