{
  "id": "caeb68af-95a4-43c6-837f-377a61446fb9",
  "title": "Meta’s AI copyright win comes with a warning about fair use",
  "link": "https://www.theverge.com/news/693437/meta-ai-copyright-win-fair-use-warning",
  "description": "Meta won a major legal ruling in an AI copyright lawsuit brought by 13 authors alleging that the company illegally trained its AI systems on their work without permission. On Wednesday, Judge Vince Chhabria ruled in Meta’s favor, saying it is “entitled to summary judgment on its fair use defense to the claim that copying […]",
  "author": "Jay Peters",
  "published": "2025-06-25T20:13:44-04:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": [
    "AI",
    "Meta",
    "News",
    "Policy",
    "Tech"
  ],
  "byline": "Jay Peters",
  "length": 2069,
  "excerpt": "Another big AI copyright ruling.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/static-assets/icons/android-chrome-512x512.png",
  "text": "Jay Peters is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.Meta won a major legal ruling in an AI copyright lawsuit brought by 13 authors alleging that the company illegally trained its AI systems on their work without permission. On Wednesday, Judge Vince Chhabria ruled in Meta’s favor, saying it is “entitled to summary judgment on its fair use defense to the claim that copying these plaintiffs’ books for use as LLM training data was infringement.”However, the judge also pointed out some weak points in the ecosystem of Big Tech’s AI efforts and Meta’s arguments defending its actions as fair use. “This ruling does not stand for the proposition that Meta’s use of copyrighted materials to train its language models is lawful,” Judge Chhabria said. “It stands only for the proposition that these plaintiffs made the wrong arguments and failed to develop a record in support of the right one.” The ruling follows Anthropic’s major fair use victory it won from a separate federal judge yesterday, who ruled that training its models on legally purchased copies of books is fair use. Judge Chhabria says that two of the authors’ arguments about fair use were “clear losers:” the ability for Meta’s Llama AI to reproduce snippets of text from their books and that Meta using their works to train its AI models without permission diluted their ability to license their works for training. “Llama is not capable of generating enough text from the plaintiffs’ books to matter, and the plaintiffs are not entitled to the market for licensing their works as AI training data,” the judge wrote.The plaintiffs didn’t do enough for a “potentially winning argument” that Meta’s copying would create “a product that will likely flood the market with similar works, causing market dilution,” according to Judge Chhabria. He also discussed the Anthropic ruling, saying that Judge William Alsup brushed aside concerns about the harm generative AI could “inflict on the market for the works it gets trained on.”",
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/STK043_VRG_Illo_N_Barclay_2_Meta.jpg?quality=90\u0026strip=all\u0026crop=0%2C10.732984293194%2C100%2C78.534031413613\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Jay Peters\" data-chromatic=\"ignore\" loading=\"lazy\" width=\"36\" height=\"36\" decoding=\"async\" data-nimg=\"1\" srcset=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/author_profile_images/195819/JAY_PETERS.0.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=48 1x, https://platform.theverge.com/wp-content/uploads/sites/2/chorus/author_profile_images/195819/JAY_PETERS.0.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=96 2x\" src=\"https://platform.theverge.com/wp-content/uploads/sites/2/chorus/author_profile_images/195819/JAY_PETERS.0.jpg?quality=90\u0026amp;strip=all\u0026amp;crop=0%2C0%2C100%2C100\u0026amp;w=96\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.theverge.com/authors/jay-peters\"\u003eJay Peters\u003c/a\u003e \u003cspan\u003eis a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003eMeta won a major legal ruling in an AI copyright lawsuit brought by 13 authors alleging that the company illegally trained its AI systems on their work without permission. On Wednesday, Judge Vince Chhabria \u003ca href=\"https://www.documentcloud.org/documents/25984135-richard-kadrey-et-al-v-meta-partial-summary-judgment/\"\u003eruled in Meta’s favor, saying it\u003c/a\u003e is “entitled to summary judgment on its fair use defense to the claim that copying these plaintiffs’ books for use as LLM training data was infringement.”\u003c/p\u003e\u003cp\u003eHowever, the judge also pointed out some weak points in the ecosystem of Big Tech’s AI efforts and Meta’s arguments defending its actions as fair use. “This ruling does not stand for the proposition that Meta’s use of copyrighted materials to train its language models is lawful,” Judge Chhabria said. \u003c/p\u003e\u003cp\u003e“It stands only for the proposition that these plaintiffs made the wrong arguments and failed to develop a record in support of the right one.” The ruling follows Anthropic’s major fair use victory it won from a separate federal judge yesterday, who ruled that training its models on legally purchased copies of books \u003ca href=\"https://www.theverge.com/news/692015/anthropic-wins-a-major-fair-use-victory-for-ai-but-its-still-in-trouble-for-stealing-books\"\u003eis fair use\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eJudge Chhabria says that two of the authors’ arguments about fair use were “clear losers:” the ability for Meta’s Llama AI to reproduce snippets of text from their books and that Meta using their works to train its AI models without permission diluted their ability to license their works for training. “Llama is not capable of generating enough text from the plaintiffs’ books to matter, and the plaintiffs are not entitled to the market for licensing their works as AI training data,” the judge wrote.\u003c/p\u003e\u003cp\u003eThe plaintiffs didn’t do enough for a “potentially winning argument” that Meta’s copying would create “a product that will likely flood the market with similar works, causing market dilution,” according to Judge Chhabria. He also discussed the Anthropic ruling, saying that Judge William Alsup brushed aside concerns about the harm generative AI could “inflict on the market for the works it gets trained on.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-26T00:13:44Z",
  "modifiedTime": "2025-06-26T00:13:44Z"
}
