{
  "id": "cfd25f2c-b2be-4040-b976-5da28ffaf9e1",
  "title": "Europe’s $3.1B satellite merger won’t rival Musk’s Starlink",
  "link": "https://thenextweb.com/news/europes-3-1b-satellite-merger-wont-rival-musks-starlink",
  "description": "Two satellite heavyweights are about to form a European rival to Starlink. But they’ll face an uphill battle to compete with Elon Musk’s firm. Luxembourg-based SES’ proposed $3.1bn takeover of Intelsat is set to get the green light from EU officials, Reuters reports. A final verdict is expected by June 10.   SES first announced plans to acquire Luxembourgish-American rival Intelsat in April 2024, calling it a “transformational merger” that could reshape the satellite internet market. The merged company would have a fleet of more than 100 geostationary and 26 medium Earth orbit satellites. Intelsat would contribute 75 of those probes,…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Thu, 05 Jun 2025 14:49:51 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Startups and technology",
    "Space",
    "Ecosystems"
  ],
  "byline": "Siôn Geschwindt",
  "length": 3065,
  "excerpt": "Two satellite heavyweights are about to form a European rival to Starlink. But they’ll face an uphill battle to compete with Elon Musk’s firm.",
  "siteName": "TNW | Ecosystems",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "Two satellite heavyweights are about to form a European rival to Starlink. But they’ll face an uphill battle to compete with Elon Musk’s firm. Luxembourg-based SES’ proposed $3.1bn takeover of Intelsat is set to get the green light from EU officials, Reuters reports. A final verdict is expected by June 10.   SES first announced plans to acquire Luxembourgish-American rival Intelsat in April 2024, calling it a “transformational merger” that could reshape the satellite internet market. The merged company would have a fleet of more than 100 geostationary and 26 medium Earth orbit satellites. Intelsat would contribute 75 of those probes, which provide a range of services, including TV, radio, satellite internet, and secure communications for governments and militaries. A SES-Intelsat tie-up would create Europe’s second-largest satellite internet provider, after Franco-British firm Eutelsat. Smaller contenders include the UK’s Inmarsat and Spain’s Hisdesat.  Combined, Europe’s satellite firms could offer the continent much-sought alternatives to Musk’s Starlink or Amazon’s Project Kuiper, at a time when tech sovereignty is high on the political agenda.  European leaders are increasingly concerned about relying on Starlink. Their fears have been stoked by reports that US officials threatened to cut off the system in Ukraine if the country didn’t meet their demands on sharing its mineral wealth.   The situation raised doubts about the security implications of Ukraine — and broader Europe — relying on a single, privately owned network whose boss has direct ties to the Trump administration. Eustalstat, SES, Inmarsat, and Hisdesat reportedly entered talks with EU governments in March about providing back-up connectivity to Ukraine.  Despite the SES–Intelsat merger creating a more formidable European player, the new alliance will still face a daunting challenge against Starlink’s dominance.  Musk’s firm dwarfs its competitors in satellite numbers, with over 7,000 in low-Earth orbit (LEO). Its closest rival, Eutelsat, has around 600. Meanwhile, Amazon’s Project Kuiper is planning to deploy a constellation of 3,236 satellites.   Being part of SpaceX also affords Starlink direct access to satellite manufacturing and launch capacity. In contrast, SES and Intelsat depend on third-party launch providers and currently lack a proprietary low-Earth orbit network. While Intelsat has a $250mn agreement to access Eutelsat’s LEO capacity, this reliance on external constellations puts the merged entity at a disadvantage.  Even when combined with Europe’s other players — including Eutelsat, Inmarsat, and Hisdesat — the proposed merger pales in comparison. As European policymakers push for strategic autonomy in space, the SES–Intelsat merger may be a step in the right direction, but it’s still a far cry from a true Starlink rival. Europe’s tech sovereignty will be a hot topic at TNW Conference, which takes place on June 19-20 in Amsterdam. Tickets for the event are now on sale — use the code TNWXMEDIA2025 at the checkout to get 30% off.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2022%2F01%2FUntitled-design-4-1.jpg\u0026signature=13907d34c55aae9387d8276e6bc4fe43",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cspan\u003eTwo \u003ca href=\"https://thenextweb.com/topic/space\" target=\"_blank\" rel=\"noopener\"\u003esatellite\u003c/a\u003e heavyweights are about to form a European rival to Starlink. But they’ll face an uphill battle to compete with Elon Musk’s firm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLuxembourg-based SES’ proposed $3.1bn takeover of Intelsat is set to get the green light from EU officials, \u003c/span\u003e\u003ca href=\"https://www.reuters.com/sustainability/boards-policy-regulation/ses-31-billion-intelsat-deal-gain-unconditional-eu-antitrust-nod-sources-say-2025-06-04/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e reports. A final verdict is expected by June 10.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSES first announced plans to acquire Luxembourgish-American rival Intelsat in April 2024, calling it a “transformational merger” that could reshape the satellite internet market.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe merged company would have a fleet of more than 100 geostationary and 26 medium Earth orbit satellites. Intelsat would contribute 75 of those probes, which provide a range of services, including TV, radio, satellite internet, and secure communications for governments and militaries.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA SES-Intelsat tie-up would create Europe’s second-largest satellite internet provider, after Franco-British firm \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/what-is-eutelsat-european-starlink-alternative-ukraine\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eEutelsat\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. Smaller contenders include the \u003c/span\u003e\u003cspan\u003eUK’s Inmarsat and Spain’s Hisdesat. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eCombined, Europe’s satellite firms could offer the continent much-sought alternatives to Musk’s Starlink or Amazon’s Project Kuiper, at a time when \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/europe-must-get-real-on-tech-sovereignty-and-stay-open-warns-industry-group\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003etech sovereignty\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e is high on the political agenda. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEuropean leaders are increasingly concerned about relying on Starlink. Their fears have been stoked by \u003c/span\u003e\u003cspan\u003ereports\u003c/span\u003e \u003cspan\u003ethat US officials \u003c/span\u003e\u003ca href=\"https://www.reuters.com/business/us-could-cut-ukraines-access-starlink-internet-services-over-minerals-say-2025-02-22/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003ethreatened\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to cut off the system in Ukraine if the country didn’t meet their demands on sharing its mineral wealth.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe situation raised doubts about the security implications of Ukraine — and broader Europe — relying on a single, privately owned network whose boss has direct ties to the Trump administration. Eustalstat, SES, Inmarsat, and Hisdesat \u003c/span\u003e\u003ca href=\"https://thenextweb.com/news/4-european-satellite-firms-are-vying-to-replace-starlink-in-ukraine\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003ereportedly entered talks\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e with EU \u003c/span\u003e\u003cspan\u003egovernments in March about providing back-up connectivity to Ukraine.\u003c/span\u003e\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDespite the SES–Intelsat merger creating a more formidable European player, the new alliance will still face a daunting challenge against Starlink’s dominance. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMusk’s firm dwarfs its competitors in satellite numbers, with over 7,000 in low-Earth orbit (LEO). Its closest rival, Eutelsat, has around 600. Meanwhile, Amazon’s Project Kuiper is planning to deploy a constellation of 3,236 satellites.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBeing part of SpaceX also affords Starlink direct access to satellite manufacturing and launch capacity. In contrast, SES and Intelsat depend on third-party launch providers and currently lack a proprietary low-Earth orbit network. While Intelsat has a $250mn agreement to access Eutelsat’s LEO capacity, this reliance on external constellations puts the merged entity at a disadvantage. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eEven when combined with Europe’s other players — including Eutelsat, Inmarsat, and Hisdesat — the proposed merger pales in comparison. As European policymakers push for strategic autonomy in space, the SES–Intelsat merger may be a step in the right direction, but it’s still a far cry from a true Starlink rival.\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003eEurope’s tech sovereignty will be a hot topic at\u003cspan\u003e \u003c/span\u003e\u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://bit.ly/41IbD3D\" target=\"_blank\" rel=\"nofollow noopener\" data-stringify-link=\"https://bit.ly/41IbD3D\" data-sk=\"tooltip_parent\"\u003eTNW Conference\u003c/a\u003e\u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e, which takes place on June 19-20 in Amsterdam. Tickets for the event are\u003cspan\u003e \u003c/span\u003e\u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://bit.ly/4hueZwX\" target=\"_blank\" rel=\"nofollow noopener\" data-stringify-link=\"https://bit.ly/4hueZwX\" data-sk=\"tooltip_parent\"\u003enow on sale\u003c/a\u003e\u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003cspan\u003e \u003c/span\u003e— use the code TNWXMEDIA2025 at the checkout to get 30% off.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-05T14:49:51Z",
  "modifiedTime": "2025-06-05T15:59:14Z"
}
