{
  "id": "d2e20a54-6646-4610-b312-c01c53541d18",
  "title": "Horror’s Greatest Season 2 Brings More Genre Love to Shudder",
  "link": "https://gizmodo.com/horrors-greatest-season-2-brings-more-genre-love-to-shudder-2000543348",
  "description": "The clip show expands its focus to include more sci-fi this time around.",
  "author": "Cheryl Eddy",
  "published": "Tue, 31 Dec 2024 21:00:10 +0000",
  "source": "https://gizmodo.com/rss",
  "categories": [
    "io9 Reviews",
    "Horror's Greatest",
    "Shudder"
  ],
  "byline": "Cheryl Eddy",
  "length": 4254,
  "excerpt": "The clip show expands its focus to include more sci-fi this time around.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "It’s baaaack! After making its debut in August, Horror’s Greatest has returned for more clips and chat about horror’s most beloved sub-genres. Season one dug into Stephen King adaptations, giant monsters, Japanese horror, horror comedies, and tropes and clichés (with an emphasis on slasher films)—leaving plenty of room for more. This time, it’s animal attacks, film scores, hidden gems, space horror, and killer dates. A lot of the talking heads repeat; it’s pretty clear Horror’s Greatest filmed both (or who knows how many) seasons back to back, and the list of interviewees again includes David Dastmalchian, Kate Siegel, Joe Hill, Jonah Ray Rodrigues, Gigi Saul Guerrero, Alex Winter, Tananarive Due, and the Boulet Brothers, among others. It’s an engaging group of people involved in the actual creation of horror films and media, with scholars, authors, critics, and programmers sprinkled in. Everyone clearly shares a deep love and appreciation for the genre. As before, the editing is brisk and the clips well-curated, with stop-motion interludes and in-episode asides that break up the discussion in fun ways. One example is the dueling lists of best and worst horror-movie pets in the “Animal Attacks” episode; you can guess where Cujo falls on that ranking. Though there is some overlap between episodes—Jaws comes up a lot, for instance—there’s enough to cover that Horror’s Greatest doesn’t feel like it’s repeating itself or stretching itself too thin. Tananarive Due admits her admiration of Event Horizon in the “Space Horror” episode. Image: Shudder Since season one focused on slightly more obvious categories, season two is able to get even weirder, which allows Horror’s Greatest to traverse some less-familiar turf. This is a bonus for the viewer who gets the chance to learn about more offbeat films, as well as a bonus for the talking heads, who—especially in the “Hidden Gems” episode, which is a fun inclusion—get to enthuse about overlooked favorites, which include a lot of vintage and international selections, as well as should-be cult classics. The strongest episodes are probably “Animal Attacks,” which delves into how Jaws launched a wave of copycats but also inspired a taste for films that blend serious-minded environmental concerns and “nature strikes back” themes with, like, alligators leaping out of sewers and PCP-crazed zoo animals; and “Hidden Gems,” though that might just be my excitement over seeing praised heaped upon the relatively obscure likes of Let’s Scare Jessica to Death and The Psychic. That episode in particular feels like you’re getting can’t-fail viewing recommendations from a friend who has seen every movie, except that friend is Shudder (and indeed, a lot of the titles are available to stream there after you finish Horror’s Greatest). “Killer Dates” might be the least successful, just because it has the murkiest through-line. It bobs from Carrie‘s prom nightmare to Get Out‘s meet-the-parents nightmare to the fact that movies like Terror Train and Jennifer’s Body have… hook-ups and relationships and romance elements existing alongside their body counts. It just doesn’t feel as cohesive as the other episodes, which works against it. Along those lines, by widening its focus a bit, Horror’s Greatest season two does tend to drift beyond what many fans might consider strictly “horror.” There’s a lot more sci-fi included, even outside the “Space Horror” episode, and the show makes some assertions that might be controversial to some. You may be able to expand your definition of horror to include, as Horror’s Greatest would like you to, the 1985 Martin Scorsese film After Hours, about one man’s hellish night out in New York City. Or you may not, especially when there are so many “I’m horror, and proud of it” types of films left out of the conversation. Perhaps that’s why we’ve got fingers crossed for a third season? The five-episode second season of Horror’s Greatest begins today, December 31, on Shudder, with weekly rollouts Tuesdays through January 28. Want more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who.",
  "image": "https://gizmodo.com/app/uploads/2024/12/Audience_horrorsgreatest-2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \n              \n              \u003cp\u003eIt’s baaaack! After \u003ca href=\"https://gizmodo.com/shudder-horrors-greatest-review-godzilla-gremlins-stephen-king-2000488713\"\u003emaking its debut in August\u003c/a\u003e, \u003cem\u003eHorror’s Greatest\u003c/em\u003e has returned for more clips and chat about horror’s most beloved sub-genres. Season one dug into Stephen King adaptations, giant monsters, Japanese horror, horror comedies, and tropes and clichés (with an emphasis on slasher films)—leaving plenty of room for more. This time, it’s \u003ca href=\"https://gizmodo.com/grizzly-1978-animal-attack-horror-movie-retro-review-sh-1849047580\"\u003eanimal attacks\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/new-superman-music-james-gunn-john-williams-dc-comics-2000540652\"\u003efilm scores\u003c/a\u003e, hidden gems, space horror, and killer dates.\u003c/p\u003e \u003cp\u003eA lot of the talking heads repeat; it’s pretty clear \u003cem\u003eHorror’s Greatest\u003c/em\u003e filmed both (or who knows how many) seasons back to back, and the list of interviewees again includes David Dastmalchian, Kate Siegel, Joe Hill,\u003cb\u003e \u003c/b\u003eJonah Ray Rodrigues, Gigi Saul Guerrero, Alex Winter, Tananarive Due, and the Boulet Brothers, among others. It’s an engaging group of people involved in the actual creation of horror films and media, with scholars, authors, critics, and programmers sprinkled in. Everyone clearly shares a deep love and appreciation for the genre.\u003c/p\u003e \u003cp\u003eAs before, the editing is brisk and the clips well-curated, with stop-motion interludes and in-episode asides that break up the discussion in fun ways. One example is the dueling lists of best and worst horror-movie pets in the “Animal Attacks” episode; you can guess where \u003cem\u003eCujo\u003c/em\u003e falls on that ranking. Though there is some overlap between episodes—\u003cem\u003eJaws\u003c/em\u003e comes up a lot, for instance—there’s enough to cover that \u003cem\u003eHorror’s Greatest\u003c/em\u003e doesn’t feel like it’s repeating itself or stretching itself too thin.\u003c/p\u003e \u003cfigure id=\"attachment_2000543356\" aria-describedby=\"caption-attachment-2000543356\"\u003e\u003cimg decoding=\"async\" src=\"https://gizmodo.com/app/uploads/2024/12/Tananarive-Due.jpg\" alt=\"Tananarive Due\" width=\"1500\" height=\"820\" srcset=\"https://gizmodo.com/app/uploads/2024/12/Tananarive-Due.jpg 1500w, https://gizmodo.com/app/uploads/2024/12/Tananarive-Due-300x164.jpg 300w, https://gizmodo.com/app/uploads/2024/12/Tananarive-Due-1024x560.jpg 1024w, https://gizmodo.com/app/uploads/2024/12/Tananarive-Due-768x420.jpg 768w, https://gizmodo.com/app/uploads/2024/12/Tananarive-Due-680x372.jpg 680w, https://gizmodo.com/app/uploads/2024/12/Tananarive-Due-896x490.jpg 896w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-2000543356\"\u003eTananarive Due admits her admiration of Event Horizon in the “Space Horror” episode. Image: Shudder\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003eSince season one focused on slightly more obvious categories, season two is able to get even weirder, which allows \u003cem\u003eHorror’s Greatest\u003c/em\u003e to traverse some less-familiar turf. This is a bonus for the viewer who gets the chance to learn about more offbeat films, as well as a bonus for the talking heads, who—especially in the “Hidden Gems” episode, which is a fun inclusion—get to enthuse about overlooked favorites, which include a lot of vintage and international selections, as well as should-be cult classics.\u003c/p\u003e\n\n \u003cp\u003eThe strongest episodes are probably “Animal Attacks,” which delves into how \u003cem\u003eJaws\u003c/em\u003e launched a wave of copycats but also inspired a taste for films that blend serious-minded environmental concerns and “nature strikes back” themes with, like, alligators leaping out of sewers and PCP-crazed zoo animals; and “Hidden Gems,” though that might just be my excitement over seeing praised heaped upon the relatively obscure likes of \u003cem\u003eLet’s Scare Jessica to Death\u003c/em\u003e and \u003cem\u003eThe Psychic\u003c/em\u003e. That episode in particular feels like you’re getting can’t-fail viewing recommendations from a friend who has seen every movie, except that friend is Shudder (and indeed, a lot of the titles are available to stream there after you finish \u003cem\u003eHorror’s Greatest\u003c/em\u003e).\u003c/p\u003e \u003cp\u003e“Killer Dates” might be the least successful, just because it has the murkiest through-line. It bobs from \u003cem\u003eCarrie\u003c/em\u003e‘s prom nightmare to \u003cem\u003eGet Out\u003c/em\u003e‘s meet-the-parents nightmare to the fact that movies like \u003cem\u003eTerror Train\u003c/em\u003e and \u003cem\u003eJennifer’s Body\u003c/em\u003e have… hook-ups and relationships and romance elements existing alongside their body counts. It just doesn’t feel as cohesive as the other episodes, which works against it.\u003c/p\u003e\n\n \u003cp\u003eAlong those lines, by widening its focus a bit, \u003cem\u003eHorror’s Greatest\u003c/em\u003e season two does tend to drift beyond what many fans might consider strictly “horror.” There’s a lot more sci-fi included, even outside the “Space Horror” episode, and the show makes some assertions that might be controversial to some. You may be able to expand your definition of horror to include, as \u003cem\u003eHorror’s Greatest\u003c/em\u003e would like you to, the 1985 Martin Scorsese film \u003cem\u003eAfter Hours\u003c/em\u003e, about one man’s hellish night out in New York City. Or you may not, especially when there are so many “I’m horror, and proud of it” types of films left out of the conversation.\u003c/p\u003e \u003cp\u003ePerhaps that’s why we’ve got fingers crossed for a third season? The five-episode second season of \u003cem\u003eHorror’s Greatest\u003c/em\u003e begins today, December 31, on Shudder, with weekly rollouts Tuesdays through January 28.\u003c/p\u003e  \u003cblockquote\u003e\u003cp\u003eWant more io9 news? Check out when to expect the latest \u003ca href=\"https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856\"\u003eMarvel\u003c/a\u003e, \u003ca href=\"https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806\"\u003eStar Wars\u003c/a\u003e, and \u003ca href=\"https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650\"\u003eStar Trek\u003c/a\u003e releases, what’s next for the \u003ca href=\"https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161\"\u003eDC Universe on film and TV\u003c/a\u003e, and everything you need to know about the future of \u003ca href=\"https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140\"\u003eDoctor Who\u003c/a\u003e.\u003c/p\u003e\u003c/blockquote\u003e\n                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-31T21:00:10Z",
  "modifiedTime": "2024-12-31T21:00:10Z"
}
