{
  "id": "d4d0d72b-feef-481e-8af1-55386b5c7e4c",
  "title": "California Newspaper Creates AI-Powered 'News Assistant' for Kamala Harris Info",
  "link": "https://politics.slashdot.org/story/24/10/12/1823237/california-newspaper-creates-ai-powered-news-assistant-for-kamala-harris-info?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "After nearly 30 years of covering Kamala Harris, the San Francisco Chronicle is now letting ChatGPT do it. Sort of... \"We're introducing a new way to engage with our decades of coverage: an AI-powered tool designed to answer your questions about Harris' life, her journey through public service and her presidential campaign,\" they announced this week: Drawing from thousands of articles written, edited and published by Chronicle journalists since 1995, this tool aims to give readers informed answers about a politician who rose from the East Bay and is now campaigning to become one of the world's most powerful people. Why don't we have a similar tool for Donald Trump, the Republican nominee for president? The answer isn't political. It's because we've been covering Harris since her career began in the Bay Area and have an archive of vetted articles to draw from. Our newsroom can't offer the same level of expertise when it comes to the former president. The tool's answers are \"drawn directly from decades of extensive reporting,\" according to a notice toward the bottom of the page. \"The tool searches through thousands of Chronicle articles, with new stories added every hour as they are published, ensuring readers have access to the most up-to-date information.\" Our news assistant is powered by OpenAI's GPT-4o mini model, combined with OpenAI's text-embedding-3-large model, to deliver precise answers based on user queries. The Chronicle articles in this tool's corpus span from April 24, 1995, to the present, covering the length of Harris' career. This corpus wouldn't be possible without the hard work of the Chronicle's journalists. Questions go through OpenAI's moderation filter and \"relevance check\" — and if it asks how to vote, \"we redirect readers to appropriate resources including canivote.org...\" Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2024-10-12T22:34:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "ai"
  ],
  "byline": "",
  "length": 1,
  "excerpt": "×",
  "siteName": "",
  "favicon": "https://a.fsdn.com/sd/m/assets/apple-touch-icon-precomposed2X-e553cba2892b057428cabcdff1a372fc.png",
  "text": "×",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\n\n\n\n\n\u003cdiv id=\"ccpa-modal\"\u003e\n        \u003cp\u003e\u003cspan id=\"modal-close\"\u003e×\u003c/span\u003e\u003c/p\u003e\n    \u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
