{
  "id": "d6df8dae-e70b-4df4-8bdb-51bf9dc771fb",
  "title": "Nintendo explains why Switch 2 hardware and software cost so much",
  "link": "https://arstechnica.com/gaming/2025/04/nintendo-explains-why-switch-2-hardware-and-software-prices-cost-so-much/",
  "description": "$450 system isn't being sold at a loss, wasn't priced with tariffs in mind.",
  "author": "Kyle Orland",
  "published": "Mon, 07 Apr 2025 21:00:37 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Gaming"
  ],
  "byline": "Kyle Orland",
  "length": 7126,
  "excerpt": "$450 system isn’t being sold at a loss, wasn’t priced with tariffs in mind.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Skip to content $450 system isn't being sold at a loss, wasn't priced with tariffs in mind. Looking this sleek comes at a price. Among the many surprises during last week's wider unveiling of the Nintendo Switch 2 was the pricing: $450 for the console itself and $70 to $80 for many first-party games. Now, in a set of interviews posted today (but conducted during last week's unveiling event), Nintendo executives are explaining and defending those prices, even as Trump's tariffs are apparently forcing the company to pause and reassess its whole launch strategy. Nintendo of America President Doug Bowser was speaking to CNBC just as Trump's tariffs were being announced, and said in the moment that \"we're still all trying to really understand [the tariffs] better and understand what possible impacts may rise from that.\" At the same time, he said that the company \"didn't consider tariffs into that equation\" when choosing the Switch 2's $450 price and instead went with what \"we felt that was going to be the right price point for our consumers and the right value proposition if you will for the device that we're creating.\" Elsewhere in that CNBC interview, Bowser suggested that Nintendo isn't following the Wii U example of selling hardware at a loss in order to gain more potential software customers. Instead, Bowser said the company is \"trying to find a way to maintain... margins on the hardware even though they may be more slim than they are on software,\" and then \"to make sure that they're seeing the value in their investment in one of our devices\" through software. Those hardware margins might be hard to maintain in the United States if Trump's tariffs add to the cost of importing consoles manufactured in Vietnam or China into the country. That said, Bowser added that \"we've had some time to build up inventories on a global basis,\" and that \"some\" Switch 2 units are \"landed already... in the United States,\" which could help delay the financial pain of any tariffs on Nintendo's part. Things just cost more now In justifying the $450 price of the Switch 2, Nintendo executives predictably pointed to the system's upgraded hardware specs, as well as new features like GameChat and mouse mode. \"As you add more technology into a system, especially in this day and age, that drives additional cost.\" Nintendo Vice President of Player \u0026 Product Experience Bill Trinen told Polygon. That said, Trinen also pointed toward rising prices in the wider economy to justify the $150 jump between Switch and Switch 2 pricing. \"We're unfortunately living in an era where I think inflation is affecting everything,\" Trinen said. The Switch never saw a nominal price drop, but inflation still ate away at its total cost a bit over the years. The Switch never saw a nominal price drop, but inflation still ate away at its total cost a bit over the years. Trinen isn't wrong about that; the $299 early adopters paid for a Switch in 2017 is worth about $391 in today's dollars, according to the BLS CPI calculator. But for customers whose own incomes may have stayed flat over that time, the 50 percent jump in nominal pricing from Switch to Switch 2 may be hard to swallow in a time of increasing economic uncertainty. \"Obviously the cost of everything goes up over time, and I personally would love if the cost of things didn't go up over time,\" Trinen told IGN. \"And certainly there's the cost of goods and things that factor into that, but we try to find the right appropriate price for a product based on that.\" Is $80 the new $70? Talk of inflation extended to Trinen's discussion of why Nintendo decided to sell first-party Switch 2 games for $70 to $80. \"The price of video games has been very stable for a very long time,\" Trinen told Polygon. \"I actually have an ad on my phone that I found from 1993, when Donkey Kong Country released on the SNES at $59. That’s a very, very long time where pricing on games has been very stable...\" Cherry-picking Donkey Kong Country's price from near the end of console gaming's cartridge era might be a little misleading. But Trinen is correct that $80 in today's money is not out of line with historic inflation-adjusted prices for console games, even in the disc era. $80 games in 2025 have got nothing on $70 games in 1997. $80 games in 2025 have got nothing on $70 games in 1997. Credit: Hughes Johnson Speaking to CNBC, Bowser said that Nintendo is \"not really looking to establish a [new] benchmark for pricing\" with Mario Kart World's $80 price tag. He echoed the same sentiment to The Washington Post, saying that the game's higher-than-normal price is \"less about representing the industry... this is really about Nintendo deciding the right thing to do for its products or what the pricing should be for its products overall.\" Instead of flat top-end game pricing, Bowser told CNBC \"we look at every game and every experience and determine what we believe is the right price point based on that experience.\" It's a talking point Trinen echoed, telling Polygon that \"we take an approach of looking at: What is the experience, and what are players going to enjoy out of this game? What is the length of the game—what’s the volume of the experience? How in-depth is it? And then we price appropriately based on what we think the value of that experience is.\" That said, Nintendo of America Senior VP of Product Development and Publishing Nate Bihldorff told Digital Trends that game pricing is still as much an art as a science. \"There isn’t an Excel sheet up here where you’re checking boxes, and each time you add $5,\" Bihldorff said. \"It’s a number of factors that probably can’t be easily quantified for each one. And that’s why you’ll see a fairly different set of prices for different pieces of software.\" Kyle Orland has been the Senior Gaming Editor at Ars Technica since 2012, writing primarily about the business, tech, and culture behind video games. He has journalism and computer science degrees from University of Maryland. He once wrote a whole book about Minesweeper. 90 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/switch2-6-1152x648-1744058028.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"app\"\u003e\n    \u003cp\u003e\u003ca href=\"#main\"\u003e\n  Skip to content\n\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cmain id=\"main\"\u003e\n            \u003carticle data-id=\"2087460\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        $450 system isn\u0026#39;t being sold at a loss, wasn\u0026#39;t priced with tariffs in mind.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Looking this sleek comes at a price.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \u003cp\u003eAmong the many surprises during \u003ca href=\"https://arstechnica.com/gaming/2025/04/nintendo-offers-new-details-on-switch-2-hardware-software/\"\u003elast week\u0026#39;s wider unveiling of the Nintendo Switch 2\u003c/a\u003e was the pricing: $450 for the console itself and \u003ca href=\"https://arstechnica.com/gaming/2025/04/psa-mario-kart-world-is-50-bundled-with-a-switch-2-but-80-by-itself/\"\u003e$70 to $80 for many first-party games\u003c/a\u003e. Now, in a set of interviews posted today (but conducted during last week\u0026#39;s unveiling event), Nintendo executives are explaining and defending those prices, even as Trump\u0026#39;s tariffs are \u003ca href=\"https://arstechnica.com/gaming/2025/04/nintendo-delays-switch-2-preorders-to-assess-trump-tariff-effects/\"\u003eapparently forcing the company to pause and reassess its whole launch strategy\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eNintendo of America President Doug Bowser was \u003ca href=\"https://www.youtube.com/watch?v=svRmWFAGLJg\"\u003espeaking to CNBC\u003c/a\u003e just as Trump\u0026#39;s tariffs were being announced, and said in the moment that \u0026#34;we\u0026#39;re still all trying to really understand [the tariffs] better and understand what possible impacts may rise from that.\u0026#34; At the same time, he said that the company \u0026#34;didn\u0026#39;t consider tariffs into that equation\u0026#34; when choosing the Switch 2\u0026#39;s $450 price and instead went with what \u0026#34;we felt that was going to be the right price point for our consumers and the right value proposition if you will for the device that we\u0026#39;re creating.\u0026#34;\u003c/p\u003e\n\u003cp\u003eElsewhere in that CNBC interview, Bowser suggested that Nintendo isn\u0026#39;t following the Wii U example of \u003ca href=\"https://arstechnica.com/gaming/2013/08/nintendo-wii-u-still-being-sold-at-a-loss/\"\u003eselling hardware at a loss\u003c/a\u003e in order to gain more potential software customers. Instead, Bowser said the company is \u0026#34;trying to find a way to maintain... margins on the hardware even though they may be more slim than they are on software,\u0026#34; and then \u0026#34;to make sure that they\u0026#39;re seeing the value in their investment in one of our devices\u0026#34; through software.\u003c/p\u003e\n\u003cp\u003eThose hardware margins might be hard to maintain in the United States if Trump\u0026#39;s tariffs add to the cost of importing consoles manufactured in Vietnam or China into the country. That said, Bowser added that \u0026#34;we\u0026#39;ve had some time to build up inventories on a global basis,\u0026#34; and that \u0026#34;some\u0026#34; Switch 2 units are \u0026#34;landed already... in the United States,\u0026#34; which could help delay the financial pain of any tariffs on Nintendo\u0026#39;s part.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003ch2\u003eThings just cost more now\u003c/h2\u003e\n\u003cp\u003eIn justifying the $450 price of the Switch 2, Nintendo executives predictably pointed to \u003ca href=\"https://arstechnica.com/gadgets/2025/04/nvidia-confirms-the-switch-2-supports-dlss-g-sync-and-ray-tracing/\"\u003ethe system\u0026#39;s upgraded hardware specs\u003c/a\u003e, as well as new features like GameChat and mouse mode. \u0026#34;As you add more technology into a system, especially in this day and age, that drives additional cost.\u0026#34; Nintendo Vice President of Player \u0026amp; Product Experience Bill Trinen \u003ca href=\"https://www.polygon.com/nintendo-switch-2/553517/price-interview-tariffs\"\u003etold Polygon\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThat said, Trinen also pointed toward rising prices in the wider economy to justify the $150 jump between Switch and Switch 2 pricing. \u0026#34;We\u0026#39;re unfortunately living in an era where I think inflation is affecting everything,\u0026#34; Trinen said.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cdiv\u003e\n            \u003cp\u003e\u003ca data-pswp-width=\"1024\" data-pswp-height=\"768\" data-pswp-srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006.png 1024w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-300x225.png 300w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-640x480.png 640w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-768x576.png 768w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-980x735.png 980w\" data-cropped=\"false\" href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006.png\" target=\"_blank\"\u003e\n              \u003cimg width=\"1024\" height=\"768\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006.png\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006.png 1024w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-300x225.png 300w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-640x480.png 640w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-768x576.png 768w, https://cdn.arstechnica.net/wp-content/uploads/2022/08/switchprice2.006-980x735.png 980w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\n            \u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n              The Switch never saw a nominal price drop, but inflation still ate away at its total cost a bit over the years.\n                          \u003c/p\u003e\n          \u003c/div\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      The Switch never saw a nominal price drop, but inflation still ate away at its total cost a bit over the years.\n\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eTrinen isn\u0026#39;t wrong about that; the $299 early adopters paid for a Switch in 2017 is worth about $391 in today\u0026#39;s dollars, according to \u003ca href=\"https://www.bls.gov/data/inflation_calculator.htm\"\u003ethe BLS CPI calculator\u003c/a\u003e. But for customers whose own incomes may have stayed flat over that time, the 50 percent jump in nominal pricing from Switch to Switch 2 may be hard to swallow in a time of increasing economic uncertainty.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Obviously the cost of everything goes up over time, and I personally would love if the cost of things didn\u0026#39;t go up over time,\u0026#34; Trinen told \u003ca href=\"https://www.ign.com/articles/our-big-nintendo-switch-2-interview-with-nintendo-of-americas-bill-trinen\"\u003eIGN\u003c/a\u003e. \u0026#34;And certainly there\u0026#39;s the cost of goods and things that factor into that, but we try to find the right appropriate price for a product based on that.\u0026#34;\u003c/p\u003e\n\u003ch2\u003eIs $80 the new $70?\u003c/h2\u003e\n\u003cp\u003eTalk of inflation extended to Trinen\u0026#39;s discussion of why Nintendo decided to \u003ca href=\"https://arstechnica.com/gaming/2025/04/psa-mario-kart-world-is-50-bundled-with-a-switch-2-but-80-by-itself/\"\u003esell first-party Switch 2 games for $70 to $80\u003c/a\u003e. \u0026#34;The price of video games has been very stable for a very long time,\u0026#34; Trinen told Polygon. \u0026#34;I actually have an ad on my phone that I found from 1993, when \u003cem\u003eDonkey Kong Country\u003c/em\u003e released on the SNES at $59. That’s a very, very long time where pricing on games has been very stable...\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eCherry-picking \u003cem\u003eDonkey Kong Country\u003c/em\u003e\u0026#39;s price from near the end of console gaming\u0026#39;s cartridge era might be a little misleading. But Trinen is correct that $80 in today\u0026#39;s money is not out of line with \u003ca href=\"https://arstechnica.com/gaming/2020/07/the-return-of-the-70-video-game-has-been-a-long-time-coming/\"\u003ehistoric inflation-adjusted prices for console games\u003c/a\u003e, even in the disc era.\u003c/p\u003e\n\u003cfigure\u003e\n    \u003cdiv\u003e\n            \u003cp\u003e\u003ca data-pswp-width=\"1200\" data-pswp-height=\"1605\" data-pswp-srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp.jpg 1200w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-300x401.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-640x856.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-768x1027.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-1148x1536.jpg 1148w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-980x1311.jpg 980w\" data-cropped=\"false\" href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp.jpg\" target=\"_blank\"\u003e\n              \u003cimg width=\"1200\" height=\"1605\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp.jpg\" alt=\"A 1990s advertisement for home video game consoles and accessories.\" decoding=\"async\" loading=\"lazy\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp.jpg 1200w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-300x401.jpg 300w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-640x856.jpg 640w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-768x1027.jpg 768w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-1148x1536.jpg 1148w, https://cdn.arstechnica.net/wp-content/uploads/2020/07/1997gp-980x1311.jpg 980w\" sizes=\"auto, (max-width: 1200px) 100vw, 1200px\"/\u003e\n            \u003c/a\u003e\u003c/p\u003e\u003cdiv id=\"caption-1690457\"\u003e\u003cp\u003e\n              $80 games in 2025 have got nothing on $70 games in 1997.\n                              \u003c/p\u003e\n                          \u003c/div\u003e\n          \u003c/div\u003e\n          \u003cfigcaption\u003e\n        \u003cdiv\u003e\n    \n    \u003cp\u003e\n      $80 games in 2025 have got nothing on $70 games in 1997.\n\n              \u003cspan\u003e\n          Credit:\n\n                      \u003ca href=\"https://huguesjohnson.com/scans/EBChristmas97/nintendo-sega/EBChristmas97_062.jpg\" target=\"_blank\"\u003e\n          \n          Hughes Johnson\n\n                      \u003c/a\u003e\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n      \u003c/figcaption\u003e\n      \u003c/figure\u003e\n\n\u003cp\u003eSpeaking to CNBC, Bowser said that Nintendo is \u0026#34;not really looking to establish a [new] benchmark for pricing\u0026#34; with \u003cem\u003eMario Kart World\u003c/em\u003e\u0026#39;s $80 price tag. He echoed the same sentiment \u003ca href=\"https://www.washingtonpost.com/entertainment/video-games/2025/04/07/mario-kart-world-price-nintendo-doug-bowser/\"\u003eto The Washington Post\u003c/a\u003e, saying that the game\u0026#39;s higher-than-normal price is \u0026#34;less about representing the industry... this is really about Nintendo deciding the right thing to do for its products or what the pricing should be for its products overall.\u0026#34;\u003c/p\u003e\n\u003cp\u003eInstead of flat top-end game pricing, Bowser told CNBC \u0026#34;we look at every game and every experience and determine what we believe is the right price point based on that experience.\u0026#34; It\u0026#39;s a talking point Trinen echoed, telling Polygon that \u0026#34;we take an approach of looking at: What is the experience, and what are players going to enjoy out of this game? What is the length of the game—what’s the volume of the experience? How in-depth is it? And then we price appropriately based on what we think the value of that experience is.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThat said, Nintendo of America Senior VP of Product Development and Publishing Nate Bihldorff \u003ca href=\"https://www.digitaltrends.com/gaming/inside-the-smile-factory-nintendos-quest-to-save-the-switch-2-from-reality/#dt-heading-a-dose-of-reality\"\u003etold Digital Trends\u003c/a\u003e that game pricing is still as much an art as a science. \u0026#34;There isn’t an Excel sheet up here where you’re checking boxes, and each time you add $5,\u0026#34; Bihldorff said. \u0026#34;It’s a number of factors that probably can’t be easily quantified for each one. And that’s why you’ll see a fairly different set of prices for different pieces of software.\u0026#34;\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/kyle-orland/\"\u003e\u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/05/k.orland-13.jpg\" alt=\"Photo of Kyle Orland\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Kyle Orland has been the Senior Gaming Editor at Ars Technica since 2012, writing primarily about the business, tech, and culture behind video games. He has journalism and computer science degrees from University of Maryland. He once \u003ca href=\"https://bossfightbooks.com/collections/books/products/minesweeper-by-kyle-orland\"\u003ewrote a whole book about \u003cem\u003eMinesweeper\u003c/em\u003e\u003c/a\u003e.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/gaming/2025/04/nintendo-explains-why-switch-2-hardware-and-software-prices-cost-so-much/#comments\" title=\"90 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    90 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \n\n\n  \n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/tech-policy/2025/04/trumps-fcc-chair-invokes-rarely-enforced-news-distortion-policy-to-punish-media/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2025/04/brendan-carr-768x432.jpg\" alt=\"Listing image for first story in Most Read: The speech police: Chairman Brendan Carr and the FCC’s news distortion policy\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/main\u003e\n\n\n\n\n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-07T21:00:37Z",
  "modifiedTime": "2025-04-07T21:21:15Z"
}
