{
  "id": "db1b000c-1d7e-4529-80bb-afab877e0483",
  "title": "What to read this weekend: When the world spins out of control",
  "link": "https://www.engadget.com/entertainment/what-to-read-this-weekend-when-the-world-spins-out-of-control-211422893.html?src=rss",
  "description": "These are some recently released titles we think are worth adding to your reading list. This week, we're diving into Alex Foster's futuristic debut, Circular Motion, and the return of Beneath the Trees Where Nobody Sees. This article originally appeared on Engadget at https://www.engadget.com/entertainment/what-to-read-this-weekend-when-the-world-spins-out-of-control-211422893.html?src=rss",
  "author": "Cheyenne MacDonald",
  "published": "Sat, 19 Jul 2025 21:14:22 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Technology \u0026 Electronics",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Cheyenne MacDonald"
  ],
  "byline": "Cheyenne MacDonald",
  "length": 1282,
  "excerpt": "This week, we read Alex Foster's Circular Motion and the first issue of Beneath the Trees Where Nobody Sees: Rite of Spring.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "I'm still chipping away at my summer reading backlog over here, and this week finally made it to Alex Foster's Circular Motion, which came out in May. And, wow, I wasn't quite ready for the emotional journey this one took me on. It's set in a near future — people ride OneWheels and going viral on social media is still a thing some strive for — where the megacompany CWC has created an extreme form of high-speed travel that allows people to zip across the world in no time flat. But, it soon becomes pretty clear that there's a consequence for this. Earth is spinning faster and faster… and faster, and protestors blame CWC and the orbital circuit its travel system relies on. The days grow shorter, the climate events become more extreme and everything is hurtling toward disaster. Circular Motion follows Tanner, a kid from smalltown Alaska who lands a job at CWC, Winnie, a girl who has truly been through it, and Columbia professor Victor Bickle, who shot to viral fame after predicting a public infrastructure catastrophe. They're all connected, as we piece together through multiple POVs. This is a book that very blatantly has something to say about capitalism, climate change and everything in between, and a beautiful exploration of human connection in a crumbling world.",
  "image": "https://s.yimg.com/ny/api/res/1.2/S7NahIyB6ZyCvLlaNX9mVA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-07/bab62f90-64dc-11f0-bf39-dffea73b9d2a",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eI\u0026#39;m still chipping away at my summer reading backlog over here, and this week finally made it to Alex Foster\u0026#39;s \u003cem\u003eCircular Motion\u003c/em\u003e, which came out in May. And, wow, I wasn\u0026#39;t quite ready for the emotional journey this one took me on. It\u0026#39;s set in a near future — people ride OneWheels and going viral on social media is still a thing some strive for — where the megacompany CWC has created an extreme form of high-speed travel that allows people to zip across the world in no time flat. But, it soon becomes pretty clear that there\u0026#39;s a consequence for this. Earth is spinning faster and faster… and faster, and protestors blame CWC and the orbital circuit its travel system relies on.\u003c/p\u003e \u003cp\u003eThe days grow shorter, the climate events become more extreme and everything is hurtling toward disaster. \u003cem\u003eCircular Motion\u003c/em\u003e follows Tanner, a kid from smalltown Alaska who lands a job at CWC, Winnie, a girl who has truly been\u003cem\u003e through\u003c/em\u003e it, and Columbia professor Victor Bickle, who shot to viral fame after predicting a public infrastructure catastrophe. They\u0026#39;re all connected, as we piece together through multiple POVs. This is a book that very blatantly has something to say about capitalism, climate change and everything in between, and a beautiful exploration of human connection in a crumbling world.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-19T21:14:22Z",
  "modifiedTime": null
}
