{
  "id": "e03482bb-a669-4230-98b2-56a87defac8c",
  "title": "Starlink enters National Radio Quiet Zone—but reportedly cut off access for some",
  "link": "https://arstechnica.com/tech-policy/2024/11/starlink-enters-national-radio-quiet-zone-but-reportedly-cut-off-access-for-some/",
  "description": "Starlink offered to 99.5% of zone, but locals say Roam product was disabled.",
  "author": "Jon Brodkin",
  "published": "Fri, 01 Nov 2024 20:16:33 +0000",
  "source": "http://feeds.arstechnica.com/arstechnica/index",
  "categories": [
    "Policy",
    "national radio quiet zone",
    "starlink"
  ],
  "byline": "Jon Brodkin",
  "length": 9097,
  "excerpt": "Starlink offered to 99.5% of zone, but locals say Roam product was disabled.",
  "siteName": "Ars Technica",
  "favicon": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/cropped-ars-logo-512_480-300x300.png",
  "text": "Starlink offered to 99.5% of zone, but locals say Roam product was disabled. Starlink satellite dish. Credit: Starlink Starlink's home Internet service has come to the National Radio Quiet Zone after a multi-year engineering project that had the goal of minimizing interference with radio telescopes. Starlink operator SpaceX began \"a one-year assessment period to offer residential satellite Internet service to 99.5% of residents within the NRQZ starting October 25,\" the National Radio Astronomy Observatory and Green Bank Observatory announced last week. \"The vast majority of people within the areas of Virginia and West Virginia collectively known as the National Radio Quiet Zone (NRQZ) can now receive high speed satellite Internet service,\" the announcement said. \"The newly available service is the result of a nearly three-year collaborative engineering effort between the US National Science Foundation (NSF), SpaceX, and the NSF National Radio Astronomy Observatory (NSF NRAO), which operates the NSF Green Bank Observatory (NSF GBO) in West Virginia within the NRQZ.\" There's a controversy over the 0.5 percent of residents who aren't included and are said to be newly blocked from using the Starlink Roam service. Starlink markets Roam as a service for people to use while traveling, not as a fixed home Internet service. The Pendleton County Office of Emergency Management last week issued a press release saying that \"customers with the RV/Roam packages had been using Starlink for approximately two years throughout 100% of the NRQZ. Now, the 0.5% have lost coverage after having it for two years. This means that a large section of southeastern Pendleton County and an even larger section of northern Pocahontas will NOT be able to utilize Starlink.\" PCMag wrote that \"Starlink is now live in 42 of the 46 cell areas around the Green Bank Observatory's telescopes.\" Pendleton County Emergency Services Coordinator Rick Gillespie told Ars today that Roam coverage was cut off in the remaining four cell areas. \"After the agreement, we all lost effective use within the four cells,\" Gillespie told Ars in an email. Gillespie's press release said that, \"in many cases, Starlink was the only Internet provider option residents and emergency responders had. This is unacceptable.\" “The dark ages of communications systems” Gillespie was quoted as saying in a WBOY article that the restrictions are \"keeping a portion of Pendleton and Pocahontas counties in the dark ages of communications systems.\" We contacted SpaceX and the National Radio Astronomy Observatory about any limits imposed on Roam today and will update this article if we get any response. Residents of the 13,000-square-mile National Radio Quiet Zone have limited Internet access due to restrictions on radio transmissions first put in place in 1958. In addition to scientific research at Green Bank in Pocahontas County, the National Radio Quiet Zone includes a National Security Agency facility at Sugar Grove Station in Pendleton County. SpaceX and the NRAO collaborated on testing over the past few years and presumably concluded that the service could only be provided without interference in 99.5 percent of the zone. Chris De Pree, the NRAO deputy spectrum manager, said in the organization's announcement that \"working closely with SpaceX over the past three years has enabled NRAO and SpaceX to better understand each other's systems and how to actively coexist in this part of the spectrum.\" In that time, \"scientists and engineers performed multiple tests and analyses to determine the best way to maximize satellite internet service without hindering the missions within the NRQZ,\" the announcement said. During the one-year assessment period for Starlink's home Internet service, \"scientists and engineers will monitor for interference issues and work to resolve them without interrupting Internet service.\" Starlink steers beams away from telescopes Starlink said in August that it worked with the NRAO \"to enable Starlink satellites to avoid transmissions into the line-of-sight of radio telescopes, leveraging our advanced phased array antenna technology to dynamically steer beams away from telescopes.\" Starlink published a summary noting that \"direct transmissions from satellites towards the eye of radio telescopes may pose a significant risk of interference to astronomical research.\" The technique for steering beams away from telescopes is \"made possible by a real-time data sharing framework between radio astronomy observatories and Starlink that provides the Starlink network with a telescope's planned observation schedule, including the telescope's pointing direction (aka 'boresight') and its observed frequency band. With this information, the Starlink network can ensure that satellites passing near the boresight of a telescope dynamically redirect their beams away from the telescope.\" The redirection happens \"in milliseconds\" and \"protects the telescope's observations while ensuring Starlink service remains uninterrupted for customers near the telescope.\" Starlink is also using the technology with NRAO's Very Large Array in New Mexico. Counties want quiet-zone rules scrapped The quiet-zone rules should be scrapped, a number of local officials say. The Pendleton County press release said that 10 West Virginia counties and one Virginia county \"have formally expressed their need for change regarding the National Radio Quiet Zone (NRQZ) through Resolutions and Letters of Support.\" These counties have a combined 262,296 residents, the press release said. \"We do not seek the closure of these federal entities but rather their commitment to identifying and funding viable solutions that would enable our communication systems to operate effectively, similar to those in the majority of America,\" Gillespie said in the press release. Gillespie told Ars that local communities are hampered by \"archaic 1950's regulations. We are being left behind when it comes to the modern advancements in public safety and personal communications.\" He said that \"absent some relief in a timely fashion, we will explore taking our plight to the FCC seeking waivers.\" The Pendleton County Commission resolution approved in September called for dissolution of the quiet zone or \"total waivers of any NRQZ restrictions imposed on Public Safety Radio Frequency Bands currently in use, as well as all the commercial cellular/wireless Bands, and commercial satellite Internet providers, such as Starlink.\" The county resolution said the quiet zone is effectively \"an ever-growing unfunded federal mandate on our county emergency services/911 operation wherein it causes us to spend large amounts of funding building a larger number of tower sites than would be needed absent the NRQZ restrictions.\" The restrictions have greatly diminished access to the AT\u0026T FirstNet public safety network and other networks used by first responders and residents, the resolution said. The Pocahontas County Commission issued a resolution in September calling for total waivers of restrictions imposed on public safety spectrum, or federal funding to offset costs associated with developing public safety communications systems under \"the unique burden of NRQZ regulations.\" Limited fiber and cellular access Starlink service wouldn't be as necessary for home Internet access if the area had universal access to fiber broadband. Recent government grants could help, as one funded project is designed to subsidize Spruce Knob Seneca Rocks Telephone's installation of fiber lines in Pocahontas and Pendleton counties. Ideally, residents would have access to both fiber home Internet and strong cellular networks. But the NRAO still warns that cellular signals could threaten its scientific research. \"Optical fiber as a broadband solution is far better than service from space or via wireless or cellular links, which are less reliable and have the potential to undo much of the coordination work that has happened in the National Radio Quiet Zone over many decades,\" Sheldon Wasik, Zone Regulatory Services Coordinator for the National Radio Astronomy Observatory, said in March 2024. Jon is a Senior IT Reporter for Ars Technica. He covers the telecom industry, Federal Communications Commission rulemakings, broadband consumer affairs, court cases, and government regulation of the tech industry. 54 Comments",
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/starlink-dish-1152x648.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n            \u003carticle data-id=\"2059945\"\u003e\n  \n  \u003cheader\u003e\n  \u003cdiv\u003e\n    \u003cdiv\u003e\n      \n\n      \n\n      \u003cp\u003e\n        Starlink offered to 99.5% of zone, but locals say Roam product was disabled.\n      \u003c/p\u003e\n\n      \n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n    \n    \u003cp\u003e\n      Starlink satellite dish.\n\n              \u003cspan\u003e\n          Credit:\n\n          \n          Starlink\n\n                  \u003c/span\u003e\n          \u003c/p\u003e\n  \u003c/div\u003e\n  \u003c/div\u003e\n\u003c/header\u003e\n\n\n  \n\n  \n      \n    \n    \u003cdiv\u003e\n                      \n                      \n          \n\u003cp\u003eStarlink\u0026#39;s home Internet service has come to the National Radio Quiet Zone after a multi-year engineering project that had the goal of minimizing interference with radio telescopes. Starlink operator SpaceX began \u0026#34;a one-year assessment period to offer residential satellite Internet service to 99.5% of residents within the NRQZ starting October 25,\u0026#34; the National Radio Astronomy Observatory and Green Bank Observatory \u003ca href=\"https://public.nrao.edu/news/over-99-5-of-residents-in-the-national-radio-quiet-zone-can-now-receive-satellite-internet-service/\"\u003eannounced last week\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The vast majority of people within the areas of Virginia and West Virginia collectively known as the National Radio Quiet Zone (NRQZ) can now receive high speed satellite Internet service,\u0026#34; the announcement said. \u0026#34;The newly available service is the result of a nearly three-year collaborative engineering effort between the US National Science Foundation (NSF), SpaceX, and the NSF National Radio Astronomy Observatory (NSF NRAO), which operates the NSF Green Bank Observatory (NSF GBO) in West Virginia within the NRQZ.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s a controversy over the 0.5 percent of residents who aren\u0026#39;t included and are said to be newly blocked from using the \u003ca href=\"https://www.starlink.com/us/roam\"\u003eStarlink Roam\u003c/a\u003e service. Starlink markets Roam as a service for people to use while traveling, not as a fixed home Internet service.\u003c/p\u003e\n\u003cp\u003eThe Pendleton County Office of Emergency Management last week issued a \u003ca href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/11/Pendleton_NRQZ_Press_Release_20241026.pdf\"\u003epress release\u003c/a\u003e saying that \u0026#34;customers with the RV/Roam packages had been using Starlink for approximately two years throughout 100% of the NRQZ. Now, the 0.5% have lost coverage after having it for two years. This means that a large section of southeastern Pendleton County and an even larger section of northern Pocahontas will NOT be able to utilize Starlink.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.pcmag.com/news/let-there-be-broadband-spacex-lights-up-starlink-in-us-national-radio-quiet\"\u003ePCMag wrote\u003c/a\u003e that \u0026#34;Starlink is now live in 42 of the 46 cell areas around the Green Bank Observatory\u0026#39;s telescopes.\u0026#34; Pendleton County Emergency Services Coordinator Rick Gillespie told Ars today that Roam coverage was cut off in the remaining four cell areas.\u003c/p\u003e\n\n          \n                      \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\u003cp\u003e\u0026#34;After the agreement, we all lost effective use within the four cells,\u0026#34; Gillespie told Ars in an email. Gillespie\u0026#39;s press release said that, \u0026#34;in many cases, Starlink was the only Internet provider option residents and emergency responders had. This is unacceptable.\u0026#34;\u003c/p\u003e\n\u003ch2\u003e“The dark ages of communications systems”\u003c/h2\u003e\n\u003cp\u003eGillespie was quoted as saying in a \u003ca href=\"https://www.wboy.com/news/west-virginia/10-west-virginia-counties-call-for-changes-to-national-radio-quiet-zone/\"\u003eWBOY article\u003c/a\u003e that the restrictions are \u0026#34;keeping a portion of Pendleton and Pocahontas counties in the dark ages of communications systems.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWe contacted SpaceX and the National Radio Astronomy Observatory about any limits imposed on Roam today and will update this article if we get any response.\u003c/p\u003e\n\u003cp\u003eResidents of the 13,000-square-mile National Radio Quiet Zone have limited Internet access due to restrictions on radio transmissions first put in place in 1958. In addition to scientific research at Green Bank in Pocahontas County, the National Radio Quiet Zone includes a \u003ca href=\"https://theclio.com/entry/65422\"\u003eNational Security Agency facility\u003c/a\u003e at \u003ca href=\"https://en.wikipedia.org/wiki/Sugar_Grove_Station\"\u003eSugar Grove Station\u003c/a\u003e in Pendleton County.\u003c/p\u003e\n\u003cp\u003eSpaceX and the NRAO collaborated on testing over the past few years and presumably concluded that the service could only be provided without interference in 99.5 percent of the zone. Chris De Pree, the NRAO deputy spectrum manager, said in the organization\u0026#39;s announcement that \u0026#34;working closely with SpaceX over the past three years has enabled NRAO and SpaceX to better understand each other\u0026#39;s systems and how to actively coexist in this part of the spectrum.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn that time, \u0026#34;scientists and engineers performed multiple tests and analyses to determine the best way to maximize satellite internet service without hindering the missions within the NRQZ,\u0026#34; the announcement said. During the one-year assessment period for Starlink\u0026#39;s home Internet service, \u0026#34;scientists and engineers will monitor for interference issues and work to resolve them without interrupting Internet service.\u0026#34;\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n          \n          \n\n\u003ch2\u003eStarlink steers beams away from telescopes\u003c/h2\u003e\n\u003cp\u003eStarlink \u003ca href=\"https://x.com/Starlink/status/1822026233938686422\"\u003esaid in August\u003c/a\u003e that it worked with the NRAO \u0026#34;to enable Starlink satellites to avoid transmissions into the line-of-sight of radio telescopes, leveraging our advanced phased array antenna technology to dynamically steer beams away from telescopes.\u0026#34;\u003c/p\u003e\n\u003cp\u003eStarlink published a \u003ca href=\"https://api.starlink.com/public-files/Telescope_Boresight_Avoidance.pdf\"\u003esummary\u003c/a\u003e noting that \u0026#34;direct transmissions from satellites towards the eye of radio telescopes may pose a significant risk of interference to astronomical research.\u0026#34; The technique for steering beams away from telescopes is \u0026#34;made possible by a real-time data sharing framework between radio astronomy observatories and Starlink that provides the Starlink network with a telescope\u0026#39;s planned observation schedule, including the telescope\u0026#39;s pointing direction (aka \u0026#39;boresight\u0026#39;) and its observed frequency band. With this information, the Starlink network can ensure that satellites passing near the boresight of a telescope dynamically redirect their beams away from the telescope.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe redirection happens \u0026#34;in milliseconds\u0026#34; and \u0026#34;protects the telescope\u0026#39;s observations while ensuring Starlink service remains uninterrupted for customers near the telescope.\u0026#34; Starlink is also using the technology with NRAO\u0026#39;s Very Large Array in New Mexico.\u003c/p\u003e\n\u003ch2\u003eCounties want quiet-zone rules scrapped\u003c/h2\u003e\n\u003cp\u003eThe quiet-zone rules should be scrapped, a number of local officials say. The Pendleton County press release said that 10 West Virginia counties and one Virginia county \u0026#34;have formally expressed their need for change regarding the National Radio Quiet Zone (NRQZ) through Resolutions and Letters of Support.\u0026#34; These counties have a combined 262,296 residents, the press release said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We do not seek the closure of these federal entities but rather their commitment to identifying and funding viable solutions that would enable our communication systems to operate effectively, similar to those in the majority of America,\u0026#34; Gillespie said in the press release.\u003c/p\u003e\n\n          \n                  \u003c/div\u003e\n                    \n        \n          \n    \n    \u003cdiv\u003e\n\n        \n        \u003cdiv\u003e\n          \n          \n\u003cp\u003eGillespie told Ars that local communities are hampered by \u0026#34;archaic 1950\u0026#39;s regulations. We are being left behind when it comes to the modern advancements in public safety and personal communications.\u0026#34; He said that \u0026#34;absent some relief in a timely fashion, we will explore taking our plight to the FCC seeking waivers.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Pendleton County Commission resolution \u003ca href=\"https://pencowv.com/wp-content/uploads/Minutes-September-3-2024.pdf\"\u003eapproved in September\u003c/a\u003e called for dissolution of the quiet zone or \u0026#34;total waivers of any NRQZ restrictions imposed on Public Safety Radio Frequency Bands currently in use, as well as all the commercial cellular/wireless Bands, and commercial satellite Internet providers, such as Starlink.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe county resolution said the quiet zone is effectively \u0026#34;an ever-growing unfunded federal mandate on our county emergency services/911 operation wherein it causes us to spend large amounts of funding building a larger number of tower sites than would be needed absent the NRQZ restrictions.\u0026#34; The restrictions have greatly diminished access to the AT\u0026amp;T FirstNet public safety network and other networks used by first responders and residents, the resolution said.\u003c/p\u003e\n\u003cp\u003eThe Pocahontas County Commission issued a \u003ca href=\"https://pocahontascountycommission.com/wp-content/uploads/September-17-2024-Regular-Session.pdf\"\u003eresolution\u003c/a\u003e in September calling for total waivers of restrictions imposed on public safety spectrum, or federal funding to offset costs associated with developing public safety communications systems under \u0026#34;the unique burden of NRQZ regulations.\u0026#34;\u003c/p\u003e\n\u003ch2\u003eLimited fiber and cellular access\u003c/h2\u003e\n\u003cp\u003eStarlink service wouldn\u0026#39;t be as necessary for home Internet access if the area had universal access to fiber broadband. Recent government grants could help, as one \u003ca href=\"https://broadband.wv.gov/gov-justice-announces-nearly-33-million-in-preliminary-approval-of-line-extension-advancement-and-development-program-award/\"\u003efunded project\u003c/a\u003e is designed to subsidize Spruce Knob Seneca Rocks Telephone\u0026#39;s installation of fiber lines in Pocahontas and Pendleton counties.\u003c/p\u003e\n\u003cp\u003eIdeally, residents would have access to both fiber home Internet and strong cellular networks. But the NRAO still warns that cellular signals could threaten its scientific research.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Optical fiber as a broadband solution is far better than service from space or via wireless or cellular links, which are less reliable and have the potential to undo much of the coordination work that has happened in the National Radio Quiet Zone over many decades,\u0026#34; Sheldon Wasik, Zone Regulatory Services Coordinator for the National Radio Astronomy Observatory, \u003ca href=\"https://greenbankobservatory.org/news/broadband-will-bring-high-speed-internet-connectivity-to-the-national-radio-quiet-zone/\"\u003esaid in March 2024\u003c/a\u003e.\u003c/p\u003e\n\n\n          \n                  \u003c/div\u003e\n\n                  \n          \n\n\n\n\n\n\n  \u003cdiv\u003e\n  \u003cdiv\u003e\n          \u003cp\u003e\u003ca href=\"https://arstechnica.com/author/jon-brodkin/\"\u003e\u003cimg src=\"https://arstechnica.com/wp-content/uploads/2016/05/j.brodkin-11_2.jpg\" alt=\"Photo of Jon Brodkin\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \n\n    \u003cp\u003e\n      Jon is a Senior IT Reporter for Ars Technica. He covers the telecom industry, Federal Communications Commission rulemakings, broadband consumer affairs, court cases, and government regulation of the tech industry.\n    \u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n  \u003cp\u003e\n    \u003ca href=\"https://arstechnica.com/tech-policy/2024/11/starlink-enters-national-radio-quiet-zone-but-reportedly-cut-off-access-for-some/#comments\" title=\"54 comments\"\u003e\n    \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 80 80\"\u003e\u003cdefs\u003e\u003cclipPath id=\"bubble-zero_svg__a\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"bubble-zero_svg__b\"\u003e\u003cpath fill=\"none\" stroke-width=\"0\" d=\"M0 0h80v80H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#bubble-zero_svg__a)\"\u003e\u003cg fill=\"currentColor\" clip-path=\"url(#bubble-zero_svg__b)\"\u003e\u003cpath d=\"M80 40c0 22.09-17.91 40-40 40S0 62.09 0 40 17.91 0 40 0s40 17.91 40 40\"\u003e\u003c/path\u003e\u003cpath d=\"M40 40 .59 76.58C-.67 77.84.22 80 2.01 80H40z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n    54 Comments\n  \u003c/a\u003e\n      \u003c/p\u003e\n\n\n\n\n\n  \n              \u003c/div\u003e\n  \u003c/article\u003e\n\n\n  \u003cdiv\u003e\n    \u003cheader\u003e\n      \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 40 26\"\u003e\u003cdefs\u003e\u003cclipPath id=\"most-read_svg__a\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003cclipPath id=\"most-read_svg__b\"\u003e\u003cpath fill=\"none\" d=\"M0 0h40v26H0z\"\u003e\u003c/path\u003e\u003c/clipPath\u003e\u003c/defs\u003e\u003cg clip-path=\"url(#most-read_svg__a)\"\u003e\u003cg fill=\"none\" clip-path=\"url(#most-read_svg__b)\"\u003e\u003cpath fill=\"currentColor\" d=\"M20 2h.8q1.5 0 3 .6c.6.2 1.1.4 1.7.6 1.3.5 2.6 1.3 3.9 2.1.6.4 1.2.8 1.8 1.3 2.9 2.3 5.1 4.9 6.3 6.4-1.1 1.5-3.4 4-6.3 6.4-.6.5-1.2.9-1.8 1.3q-1.95 1.35-3.9 2.1c-.6.2-1.1.4-1.7.6q-1.5.45-3 .6h-1.6q-1.5 0-3-.6c-.6-.2-1.1-.4-1.7-.6-1.3-.5-2.6-1.3-3.9-2.1-.6-.4-1.2-.8-1.8-1.3-2.9-2.3-5.1-4.9-6.3-6.4 1.1-1.5 3.4-4 6.3-6.4.6-.5 1.2-.9 1.8-1.3q1.95-1.35 3.9-2.1c.6-.2 1.1-.4 1.7-.6q1.5-.45 3-.6zm0-2h-1c-1.2 0-2.3.3-3.4.6-.6.2-1.3.4-1.9.7-1.5.6-2.9 1.4-4.3 2.3-.7.5-1.3.9-1.9 1.4C2.9 8.7 0 13 0 13s2.9 4.3 7.5 7.9c.6.5 1.3 1 1.9 1.4 1.3.9 2.7 1.7 4.3 2.3.6.3 1.3.5 1.9.7 1.1.3 2.3.6 3.4.6h2c1.2 0 2.3-.3 3.4-.6.6-.2 1.3-.4 1.9-.7 1.5-.6 2.9-1.4 4.3-2.3.7-.5 1.3-.9 1.9-1.4C37.1 17.3 40 13 40 13s-2.9-4.3-7.5-7.9c-.6-.5-1.3-1-1.9-1.4-1.3-.9-2.8-1.7-4.3-2.3-.6-.3-1.3-.5-1.9-.7C23.3.4 22.1.1 21 .1h-1\"\u003e\u003c/path\u003e\u003cpath fill=\"#ff4e00\" d=\"M20 5c-4.4 0-8 3.6-8 8s3.6 8 8 8 8-3.6 8-8-3.6-8-8-8m0 11c-1.7 0-3-1.3-3-3s1.3-3 3-3 3 1.3 3 3-1.3 3-3 3\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/g\u003e\u003c/svg\u003e\n      \n    \u003c/header\u003e\n    \u003col\u003e\n              \u003cli\u003e\n                      \u003ca href=\"https://arstechnica.com/space/2024/11/nearly-two-months-after-starliners-return-boeing-remains-mum-on-its-future/\"\u003e\n              \u003cimg src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/09/53988402529_bec93e5a26_k-768x432.jpg\" alt=\"Listing image for first story in Most Read: What is happening with Boeing’s Starliner spacecraft?\" decoding=\"async\" loading=\"lazy\"/\u003e\n            \u003c/a\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                    \u003cli\u003e\n                    \n        \u003c/li\u003e\n                  \u003c/ol\u003e\n\u003c/div\u003e\n\n\n  \n\n  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-01T20:16:33Z",
  "modifiedTime": "2024-11-01T20:39:56Z"
}
