{
  "id": "e0ce5e4d-e944-4a0a-b9d8-9167ba7be5a4",
  "title": "There Aren't Enough Cables To Meet Growing Electricity Demand",
  "link": "https://hardware.slashdot.org/story/25/06/13/207259/there-arent-enough-cables-to-meet-growing-electricity-demand?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "High-voltage electricity cables have become a major constraint throttling the clean energy transition, with manufacturing facilities booked out for years as demand far exceeds supply capacity. The energy transition, trade barriers, and overdue grid upgrades have turbocharged demand for these highly sophisticated cables that connect wind farms, solar installations, and cross-border power networks. The International Energy Agency estimates that 80 million kilometers of grid infrastructure must be built between now and 2040 to meet clean energy targets -- equivalent to rebuilding the entire existing global grid that took a century to construct, but compressed into just 15 years. Each high-voltage cable requires custom engineering and months-long production in specialized 200-meter towers, with manufacturers reporting that 80-90% of major projects now use high-voltage direct current technology versus traditional alternating current systems. Read more of this story at Slashdot.",
  "author": "msmash",
  "published": "2025-06-14T00:10:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "power"
  ],
  "byline": "",
  "length": 952,
  "excerpt": "High-voltage electricity cables have become a major constraint throttling the clean energy transition, with manufacturing facilities booked out for years as demand far exceeds supply capacity. The energy transition, trade barriers, and overdue grid upgrades have turbocharged demand for these highly ...",
  "siteName": "",
  "favicon": "",
  "text": "High-voltage electricity cables have become a major constraint throttling the clean energy transition, with manufacturing facilities booked out for years as demand far exceeds supply capacity. The energy transition, trade barriers, and overdue grid upgrades have turbocharged demand for these highly sophisticated cables that connect wind farms, solar installations, and cross-border power networks. The International Energy Agency estimates that 80 million kilometers of grid infrastructure must be built between now and 2040 to meet clean energy targets -- equivalent to rebuilding the entire existing global grid that took a century to construct, but compressed into just 15 years. Each high-voltage cable requires custom engineering and months-long production in specialized 200-meter towers, with manufacturers reporting that 80-90% of major projects now use high-voltage direct current technology versus traditional alternating current systems.",
  "image": "https://a.fsdn.com/sd/topics/power_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178041673\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tHigh-voltage electricity cables have become a major constraint throttling the clean energy transition, with \u003ca href=\"https://www.bloomberg.com/news/articles/2025-06-12/there-aren-t-enough-cables-to-meet-growing-electricity-demand\"\u003emanufacturing facilities booked out for years\u003c/a\u003e as demand far exceeds supply capacity. The energy transition, trade barriers, and overdue grid upgrades have turbocharged demand for these highly sophisticated cables that connect wind farms, solar installations, and cross-border power networks.\u003c/p\u003e\u003cp\u003e \n\nThe International Energy Agency estimates that 80 million kilometers of grid infrastructure must be built between now and 2040 to meet clean energy targets -- equivalent to rebuilding the entire existing global grid that took a century to construct, but compressed into just 15 years. Each high-voltage cable requires custom engineering and months-long production in specialized 200-meter towers, with manufacturers reporting that 80-90% of major projects now use high-voltage direct current technology versus traditional alternating current systems.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
