{
  "id": "e1448f0a-4894-4e42-b7d2-4887d81e631b",
  "title": "Does Google Plan to Create Email Aliases for Apps to Fight Spam?",
  "link": "https://tech.slashdot.org/story/24/11/16/2223255/does-google-plan-to-create-email-aliases-for-apps-to-fight-spam?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Google appears to be working on an email-forwarding alias system, according to the blog Android Authority, giving users a new way to \"shield\" their main email address. The site performed a teardown on the newest Google Play Services' APK looking for work-in-progress code , and spotted \"a whole boatload of strings referencing and in support of something called 'Shielded Email'.\" Just from that text, we're able to infer quite a lot about what we're looking at here, and it appears that Shielded Email consists of a system to create single-use or limited-use email aliases that will forward messages along to your primary account. And while we could imagine that something like this might be pretty useful in Chrome, here it looks like Google is building it specifically to address apps that ask for your email address. The messages in there touch on a couple reasons beyond spam that you might want to keep your main email private, like reducing the extent to which your online activities can be tracked, and mitigating your personal risk from potential future data breaches. They also sighted a reference to \"Shielded Email\" in the Autofill settings menu — though their article acknowledges that even features hinted at by work-in-progress code may not ultimately make it into a public release. But Forbes suggests that the idea sounds similar to Apple's Hide My Email service, which \"provides an automated random email address creator to help keep your personal email address private when subscribing to services.\" Read more of this story at Slashdot.",
  "author": "EditorDavid",
  "published": "2024-11-16T22:34:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "google"
  ],
  "byline": "",
  "length": 1530,
  "excerpt": "Google appears to be working on an email-forwarding alias system, according to the blog Android Authority, giving users a new way to \"shield\" their main email address. The site performed a teardown on the newest Google Play Services' APK looking for work-in-progress code , and spotted \"a whole bo...",
  "siteName": "",
  "favicon": "",
  "text": "Google appears to be working on an email-forwarding alias system, according to the blog Android Authority, giving users a new way to \"shield\" their main email address. The site performed a teardown on the newest Google Play Services' APK looking for work-in-progress code , and spotted \"a whole boatload of strings referencing and in support of something called 'Shielded Email'.\" Just from that text, we're able to infer quite a lot about what we're looking at here, and it appears that Shielded Email consists of a system to create single-use or limited-use email aliases that will forward messages along to your primary account. And while we could imagine that something like this might be pretty useful in Chrome, here it looks like Google is building it specifically to address apps that ask for your email address. The messages in there touch on a couple reasons beyond spam that you might want to keep your main email private, like reducing the extent to which your online activities can be tracked, and mitigating your personal risk from potential future data breaches. They also sighted a reference to \"Shielded Email\" in the Autofill settings menu — though their article acknowledges that even features hinted at by work-in-progress code may not ultimately make it into a public release. But Forbes suggests that the idea sounds similar to Apple's Hide My Email service, which \"provides an automated random email address creator to help keep your personal email address private when subscribing to services.\"",
  "image": "https://a.fsdn.com/sd/topics/topicgoogle_fb.gif",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175483947\"\u003e\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tGoogle appears to be working on an email-forwarding alias system,  \u003ca href=\"https://www.androidauthority.com/google-shielded-email-3499803/\"\u003eaccording to the blog \u003cem\u003eAndroid Authority\u003c/em\u003e\u003c/a\u003e, giving users a new way to \u0026#34;shield\u0026#34; their main email address.\u003c/p\u003e\u003cp\u003e \n\nThe site performed a teardown on the newest Google Play Services\u0026#39; APK looking for work-in-progress code , and spotted \u0026#34;a whole boatload of strings referencing and in support of something called \u0026#39;Shielded Email\u0026#39;.\u0026#34;\n\n\u003ci\u003e\nJust from that text, we\u0026#39;re able to infer quite a lot about what we\u0026#39;re looking at here, and it appears that Shielded Email consists of a system to create single-use or limited-use email aliases that will forward messages along to your primary account.  And while we could imagine that something like this might be pretty useful in Chrome, here it looks like Google is building it specifically to address apps that ask for your email address.   The messages in there touch on a couple reasons beyond spam that you might want to keep your main email private, like reducing the extent to which your online activities can be tracked, and mitigating your personal risk from potential future data breaches.\u003c/i\u003e \u003cbr/\u003e\nThey also sighted a reference to \u0026#34;Shielded Email\u0026#34; in the Autofill settings menu — though their article acknowledges that even features hinted at by work-in-progress code may not ultimately make it into a public release.\u003c/p\u003e\u003cp\u003e \n\nBut \u003ca href=\"https://www.forbes.com/sites/daveywinder/2024/11/15/gmail-privacy-warning-for-25-billion-users-new-email-address-alert/\"\u003e \u003cem\u003eForbes\u003c/em\u003e suggests\u003c/a\u003e that the idea sounds similar to \u003ca href=\"https://support.apple.com/en-gb/guide/iphone/iphcb02e76f7/ios\"\u003eApple\u0026#39;s Hide My Email\u003c/a\u003e service, which \u0026#34;provides an automated random email address creator to help keep your personal email address private when subscribing to services.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
