{
  "id": "e34e7133-abb7-4d31-a659-88d327bf6d3c",
  "title": "Video Game Actors End 11-Month Strike With New AI Protections",
  "link": "https://games.slashdot.org/story/25/07/10/2119204/video-game-actors-end-11-month-strike-with-new-ai-protections?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "An anonymous reader quotes a report from Straight Arrow News: Hollywood video game performers ended their nearly year-long strike Wednesday with new protections against the use of digital replicas of their voices or appearances. If those replicas are used, actors must be paid at rates comparable to in-person work. The SAG-AFTRA union demanded stronger pay and better working conditions. Among their top concerns was the potential for artificial intelligence to replace human actors without compensation or consent. Under a deal announced in a media release, studios such as Activision and Electronic Arts are now required to obtain written consent from performers before creating digital replicas of their work. Actors have the right to suspend their consent for AI-generated material if another strike occurs. \"This deal delivers historic wage increases, industry-leading AI protections and enhanced health and safety measures for performers,\" Audrey Cooling, a spokesperson for the video game producers, said in the release. The full list of studios includes Activision Productions, Blindlight, Disney Character Voices, Electronic Arts Productions, Formosa Interactive, Insomniac Games, Llama Productions, Take 2 Productions and WB Games. SAG-AFTRA members approved the contract by a vote of 95.04% to 4.96%, according to the announcement. The agreement includes a wage increase of more than 15%, with additional 3% raises in November 2025, 2026 and 2027. The contract expires in October 2028. [...] The video game strike, which started in July 2024, did not shut down production like the SAG-AFTRA actors' strike in 2023. Hollywood actors went on strike for 118 days, from July 14 to November 9, 2023, halting nearly all scripted television and film work. That strike, which centered on streaming residuals and AI concerns, prevented actors from engaging in promotional work, such as attending premieres and posting on social media. In contrast, video game performers were allowed to work during their strike, but only with companies that had signed interim agreements addressing concerns related to AI. More than 160 companies signed on, according to The Associated Press. Still, the year took a toll. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2025-07-11T00:02:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "ai"
  ],
  "byline": "",
  "length": 2211,
  "excerpt": "An anonymous reader quotes a report from Straight Arrow News: Hollywood video game performers ended their nearly year-long strike Wednesday with new protections against the use of digital replicas of their voices or appearances. If those replicas are used, actors must be paid at rates comparable to ...",
  "siteName": "",
  "favicon": "",
  "text": "An anonymous reader quotes a report from Straight Arrow News: Hollywood video game performers ended their nearly year-long strike Wednesday with new protections against the use of digital replicas of their voices or appearances. If those replicas are used, actors must be paid at rates comparable to in-person work. The SAG-AFTRA union demanded stronger pay and better working conditions. Among their top concerns was the potential for artificial intelligence to replace human actors without compensation or consent. Under a deal announced in a media release, studios such as Activision and Electronic Arts are now required to obtain written consent from performers before creating digital replicas of their work. Actors have the right to suspend their consent for AI-generated material if another strike occurs. \"This deal delivers historic wage increases, industry-leading AI protections and enhanced health and safety measures for performers,\" Audrey Cooling, a spokesperson for the video game producers, said in the release. The full list of studios includes Activision Productions, Blindlight, Disney Character Voices, Electronic Arts Productions, Formosa Interactive, Insomniac Games, Llama Productions, Take 2 Productions and WB Games. SAG-AFTRA members approved the contract by a vote of 95.04% to 4.96%, according to the announcement. The agreement includes a wage increase of more than 15%, with additional 3% raises in November 2025, 2026 and 2027. The contract expires in October 2028. [...] The video game strike, which started in July 2024, did not shut down production like the SAG-AFTRA actors' strike in 2023. Hollywood actors went on strike for 118 days, from July 14 to November 9, 2023, halting nearly all scripted television and film work. That strike, which centered on streaming residuals and AI concerns, prevented actors from engaging in promotional work, such as attending premieres and posting on social media. In contrast, video game performers were allowed to work during their strike, but only with companies that had signed interim agreements addressing concerns related to AI. More than 160 companies signed on, according to The Associated Press. Still, the year took a toll.",
  "image": "https://a.fsdn.com/sd/topics/ai_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-178329506\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tAn anonymous reader quotes a report from Straight Arrow News: \u003ci\u003eHollywood video game performers \u003ca href=\"https://san.com/cc/video-game-actors-end-11-month-strike-with-new-ai-protections/\"\u003eended their nearly year-long strike Wednesday\u003c/a\u003e with new protections against the use of digital replicas of their voices or appearances. If those replicas are used, actors must be paid at rates comparable to in-person work. The SAG-AFTRA union demanded stronger pay and better working conditions. Among their top concerns was the potential for artificial intelligence to replace human actors without compensation or consent.\n\u003cp\u003e \nUnder a deal announced in a \u003ca href=\"https://www.sagaftra.org/sag-aftra-members-approve-2025-video-game-agreement\"\u003emedia release\u003c/a\u003e, studios such as Activision and Electronic Arts are now required to obtain written consent from performers before creating digital replicas of their work. Actors have the right to suspend their consent for AI-generated material if another strike occurs. \u0026#34;This deal delivers historic wage increases, industry-leading AI protections and enhanced health and safety measures for performers,\u0026#34; Audrey Cooling, a spokesperson for the video game producers, said in the release. The full list of studios includes Activision Productions, Blindlight, Disney Character Voices, Electronic Arts Productions, Formosa Interactive, Insomniac Games, Llama Productions, Take 2 Productions and WB Games.\n\u003c/p\u003e\u003cp\u003e \nSAG-AFTRA members approved the contract by a vote of 95.04% to 4.96%, according to the announcement. The agreement includes a wage increase of more than 15%, with additional 3% raises in November 2025, 2026 and 2027. The contract expires in October 2028. [...] The video game strike, which \u003ca href=\"https://games.slashdot.org/story/24/08/05/2043252/video-game-actors-are-officially-on-strike-over-ai\"\u003estarted in July 2024\u003c/a\u003e, did not shut down production like the \u003ca href=\"https://entertainment.slashdot.org/story/23/11/09/0625247/hollywood-actors-strike-ends-with-a-deal-that-will-impact-ai-and-streaming-for-decades\"\u003eSAG-AFTRA actors\u0026#39; strike in 2023\u003c/a\u003e. Hollywood actors went on strike for 118 days, from July 14 to November 9, 2023, halting nearly all scripted television and film work. That strike, which centered on streaming residuals and AI concerns, prevented actors from engaging in promotional work, such as attending premieres and posting on social media. In contrast, video game performers were allowed to work during their strike, but only with companies that had signed interim agreements addressing concerns related to AI. More than 160 companies signed on, according to \u003ca href=\"https://apnews.com/article/sagaftra-video-game-strike-2025-contract-ai-9806b9b874dcec52f36687f28a941490\"\u003eThe Associated Press\u003c/a\u003e. Still, the year took a toll.\u003c/p\u003e\u003c/i\u003e\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
