{
  "id": "e513d0fe-36c3-4656-8559-3d680d8b4c94",
  "title": "Expanding AI Overviews and introducing AI Mode",
  "link": "https://blog.google/products/search/ai-mode-search/",
  "description": "AI Mode is a new generative AI experiment in Google Search.",
  "author": "Robby SteinVP of Product, Google Search",
  "published": "Wed, 05 Mar 2025 17:00:00 +0000",
  "source": "https://www.blog.google/rss/",
  "categories": [
    "Search",
    "AI"
  ],
  "byline": "Robby Stein",
  "length": 5807,
  "excerpt": "AI Mode is a new generative AI experiment in Google Search.",
  "siteName": "Google",
  "favicon": "https://blog.google/static/blogv2/images/apple-touch-icon.png?version=pr20250219-1743",
  "text": "Mar 05, 2025 [[read-time]] min read AI Overviews are getting a Gemini 2.0 upgrade and expanding to more people. Plus, we’re introducing a new experimental AI Mode. With our new AI features, people are using Google Search more than ever as they get help with new and more complex questions. AI Overviews are one of our most popular Search features — now used by more than a billion people — and we’re continuing to advance and improve the experience to make them even better.Expanding AI OverviewsToday, we’re sharing that we’ve launched Gemini 2.0 for AI Overviews in the U.S. to help with harder questions, starting with coding, advanced math and multimodal queries, with more on the way. With Gemini 2.0’s advanced capabilities, we provide faster and higher quality responses and show AI Overviews more often for these types of queries.Plus, we’re rolling out to more people: teens can now use AI Overviews, and you’ll no longer need to sign in to get access.Introducing our new AI Mode experiment in SearchAs we’ve rolled out AI Overviews, we’ve heard from power users that they want AI responses for even more of their searches. So today, we’re introducing an early experiment in Labs: AI Mode. This new Search mode expands what AI Overviews can do with more advanced reasoning, thinking and multimodal capabilities so you can get help with even your toughest questions. You can ask anything on your mind and get a helpful AI-powered response with the ability to go further with follow-up questions and helpful web links.Using a custom version of Gemini 2.0, AI Mode is particularly helpful for questions that need further exploration, comparisons and reasoning. You can ask nuanced questions that might have previously taken multiple searches — like exploring a new concept or comparing detailed options — and get a helpful AI-powered response with links to learn more. With AI Mode, you'll be able to ask complex, multi-part questions and ask follow-ups to dig deeper. Note: Results are for illustrative purposes and include future-looking features. This example reflects information from a prior date, and may vary. What makes this experience unique is that it brings together advanced model capabilities with Google’s best-in-class information systems, and it’s built right into Search. You can not only access high-quality web content, but also tap into fresh, real-time sources like the Knowledge Graph, info about the real world, and shopping data for billions of products. It uses a “query fan-out” technique, issuing multiple related searches concurrently across subtopics and multiple data sources and then brings those results together to provide an easy-to-understand response. This approach helps you access more breadth and depth of information than a traditional search on Google.So if you ask, “what's the difference in sleep tracking features between a smart ring, smartwatch and tracking mat,” the custom version of Gemini 2.0 uses a multistep approach to make a plan, conduct searches to find information and adjust the plan based on what it finds.If you want to know more, you can ask a follow up question, like “what happens to your heart rate during deep sleep” to quickly get an easy-to-digest response with links to relevant content. AI Mode helps you search more effortlessly by combining the advanced capabilities of Gemini 2.0 with Google’s best-in-class information systems. Note: Results are for illustrative purposes and include future-looking features. Helping people discover content from the web remains central to our approach, and with AI Mode we’re making it easy for people to explore and take action. With the model’s deep information retrieval, people can better express what they’re looking for — with all their nuances and constraints — and get to the right web content in a range of formats.Testing in LabsWe’ve been getting feedback internally and from trusted testers, and they’ve found AI Mode incredibly helpful– they particularly appreciate the speed, quality and freshness of responses.Now, we’re expanding our testing with a limited, opt-in experience in Labs. This experimental approach helps us learn what’s most helpful and improve rapidly with feedback from people who are most eager to try it out.AI Mode is rooted in our core quality and ranking systems, and we’re also using novel approaches with the model’s reasoning capabilities to improve factuality. We aim to show an AI-powered response as much as possible, but in cases where we don’t have high confidence in helpfulness and quality, the response will be a set of web search results. As with any early-stage AI product, we won’t always get it right. For example, while we aim for AI responses in Search to present information objectively based on what’s available on the web, it’s possible that some responses may unintentionally appear to take on a persona or reflect a particular opinion.In this next testing phase, we’ll address these types of challenges and also rapidly make changes to the user experience based on the feedback we get. We’re already working on new capabilities and updates, like adding more visual responses with images and video, richer formatting, new ways to get to helpful web content and much more.Starting today, we’ll begin inviting Google One AI Premium subscribers to be the first to try out this experience in Labs. We look forward to the feedback, and stay tuned for more!",
  "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-1300.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\n    \n    \n\n\n\n\n\n    \n\n    \n      \n\n\u003cdiv data-analytics-module=\"{\n    \u0026#34;module_name\u0026#34;: \u0026#34;Hero Menu\u0026#34;,\n    \u0026#34;section_header\u0026#34;: \u0026#34;Expanding AI Overviews and introducing AI Mode\u0026#34;\n  }\"\u003e\n      \u003cdiv\u003e\n          \n            \u003cp\u003eMar 05, 2025\u003c/p\u003e\n          \n          \n            \u003cp data-reading-time-render=\"\"\u003e[[read-time]] min read\u003c/p\u003e\n          \n        \u003c/div\u003e\n      \n        \u003cp\u003e\n          AI Overviews are getting a Gemini 2.0 upgrade and expanding to more people. Plus, we’re introducing a new experimental AI Mode.\n        \u003c/p\u003e\n      \n    \u003c/div\u003e\n\n    \n\n    \n      \n\n\n\n\n\n\n\n\n\u003cdiv\u003e\n    \u003cfigure\u003e\n      \u003cdiv\u003e\n  \u003cp\u003e\u003cimg srcset=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-800.format-webp.webp 800w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-1200.format-webp.webp 1200w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-1600.format-webp.webp 1600w, https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-2200.format-webp.webp 2200w\" sizes=\"(max-width: 1023px) 100vw,(min-width: 1024px and max-width: 1259) 80vw, 1046px\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/ai-mode-hero-image.width-1200.format-webp.webp\" fetchpriority=\"high\" alt=\"A Google search page displays results about déjà vu and its relation to memory. A partially visible phone screen on the left shows a \u0026#34;Meet AI Mode\u0026#34; prompt with a gradient background, highlighting Google\u0026#39;s AI features.\"/\u003e\n  \u003c/p\u003e\n\u003c/div\u003e\n\n      \n    \u003c/figure\u003e\n  \u003c/div\u003e\n\n\n    \n\n    \n    \u003cdiv data-reading-time=\"true\" data-component=\"uni-article-body\"\u003e\n\n            \n              \n\n\n\n\n\u003cgoogle-read-aloud-player data-analytics-module=\"{\n        \u0026#34;event\u0026#34;: \u0026#34;module_impression\u0026#34;,\n        \u0026#34;module_name\u0026#34;: \u0026#34;ai_audio\u0026#34;,\n        \u0026#34;section_header\u0026#34;: \u0026#34;Expanding AI Overviews and introducing AI Mode\u0026#34;\n    }\" data-call-to-action-text=\"Listen to article\" data-date-modified=\"2025-03-05T17:00:01.597212+00:00\" data-progress-bar-style=\"half-wave\" data-api-key=\"AIzaSyBLT6VkYe-x7sWLZI2Ep26-fNkBKgND-Ac\" data-article-style=\"style9\" data-tracking-ids=\"G-HGNBTNCHCQ,G-6NKTLKV14N\" data-voice-list=\"en.ioh-pngnat:Cyan,en.usb-pngnat:Lime\" data-layout-style=\"style1\" data-highlight-mode=\"word-over-paragraph\" data-highlight-text-color=\"#000000\" data-highlight-word-background=\"#8AB4F8\" data-highlight-paragraph-background=\"#D2E3FC\" data-background=\"linear-gradient(180deg, #F1F3F4 0%, #F8F9FA 100%)\" data-foreground-color=\"#202124\" data-font=\"600 16px Google Sans, sans-serif\" data-box-shadow=\"0px 1px 3px 1px rgba(60, 64, 67, 0.15)\"\u003e\n\u003c/google-read-aloud-player\u003e\n\n\n\n            \n\n            \n            \n\n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Expanding AI Overviews and introducing AI Mode\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"gu7na\"\u003eWith our new AI features, people are using Google Search more than ever as they get help with new and more complex questions. AI Overviews are one of our most popular Search features — now used by \u003ca href=\"https://blog.google/products/search/ai-overviews-search-october-2024/\"\u003emore than a billion people\u003c/a\u003e — and we’re continuing to advance and improve the experience to make them even better.\u003c/p\u003e\u003ch2 data-block-key=\"8r5o2\"\u003eExpanding AI Overviews\u003c/h2\u003e\u003cp data-block-key=\"dg7l0\"\u003eToday, we’re sharing that we’ve launched Gemini 2.0 for AI Overviews in the U.S. to help with harder questions, starting with coding, advanced math and multimodal queries, with more on the way. With Gemini 2.0’s advanced capabilities, we provide faster and higher quality responses and show AI Overviews more often for these types of queries.\u003c/p\u003e\u003cp data-block-key=\"6kmmm\"\u003ePlus, we’re rolling out to more people: teens can now use AI Overviews, and you’ll no longer need to sign in to get access.\u003c/p\u003e\u003ch2 data-block-key=\"dcqhc\"\u003eIntroducing our new AI Mode experiment in Search\u003c/h2\u003e\u003cp data-block-key=\"btdmq\"\u003eAs we’ve rolled out AI Overviews, we’ve heard from power users that they want AI responses for even more of their searches. So today, we’re introducing an early \u003ca href=\"https://labs.google.com/search/experiment/22\"\u003eexperiment in Labs\u003c/a\u003e: AI Mode. This new Search mode expands what AI Overviews can do with more advanced reasoning, thinking and multimodal capabilities so you can get help with even your toughest questions. You can ask anything on your mind and get a helpful AI-powered response with the ability to go further with follow-up questions and helpful web links.\u003c/p\u003e\u003cp data-block-key=\"d1467\"\u003eUsing a custom version of Gemini 2.0, AI Mode is particularly helpful for questions that need further exploration, comparisons and reasoning. You can ask nuanced questions that might have previously taken multiple searches — like exploring a new concept or comparing detailed options — and get a helpful AI-powered response with links to learn more.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\n\n\n\n\n\u003cuni-image-full-width alignment=\"full\" alt-text=\"Animation of AI mode helping a user schedule an engagement photoshoot in Boston\" external-image=\"\" or-mp4-video-title=\"AI Mode comparison\" or-mp4-video-url=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/original_videos/ai-mode-comparison-animation.mp4\" section-header=\"Expanding AI Overviews and introducing AI Mode\" custom-class=\"image-full-width--constrained-width uni-component-spacing\"\u003e\n  \n    \u003cdiv slot=\"caption-slot\"\u003e\n      \u003cp data-block-key=\"xrhhc\"\u003eWith AI Mode, you\u0026#39;ll be able to ask complex, multi-part questions and ask follow-ups to dig deeper. Note: Results are for illustrative purposes and include future-looking features. This example reflects information from a prior date, and may vary.\u003c/p\u003e\n    \u003c/div\u003e\n  \n  \n\u003c/uni-image-full-width\u003e\n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Expanding AI Overviews and introducing AI Mode\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"se9jo\"\u003eWhat makes this experience unique is that it brings together advanced model capabilities with Google’s best-in-class information systems, and it’s built right into Search. You can not only access high-quality web content, but also tap into fresh, real-time sources like the Knowledge Graph, info about the real world, and shopping data for billions of products. It uses a “query fan-out” technique, issuing multiple related searches concurrently across subtopics and multiple data sources and then brings those results together to provide an easy-to-understand response. This approach helps you access more breadth and depth of information than a traditional search on Google.\u003c/p\u003e\u003cp data-block-key=\"5vk3u\"\u003eSo if you ask, “what\u0026#39;s the difference in sleep tracking features between a smart ring, smartwatch and tracking mat,” the custom version of Gemini 2.0 uses a multistep approach to make a plan, conduct searches to find information and adjust the plan based on what it finds.\u003c/p\u003e\u003cp data-block-key=\"e8nu6\"\u003eIf you want to know more, you can ask a follow up question, like “what happens to your heart rate during deep sleep” to quickly get an easy-to-digest response with links to relevant content.\u003c/p\u003e\u003c/div\u003e\n  \n\n  \n    \n\n\n\n\n\n\n\u003cuni-image-full-width alignment=\"full\" alt-text=\"Animation showing AI mode used for sleep-specific searching\" external-image=\"\" or-mp4-video-title=\"AI Mode sleep tracking question\" or-mp4-video-url=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/original_videos/ai-mode-animation.mp4\" section-header=\"Expanding AI Overviews and introducing AI Mode\" custom-class=\"image-full-width--constrained-width uni-component-spacing\"\u003e\n  \n    \u003cdiv slot=\"caption-slot\"\u003e\n      \u003cp data-block-key=\"jbh2f\"\u003eAI Mode helps you search more effortlessly by combining the advanced capabilities of Gemini 2.0 with Google’s best-in-class information systems. Note: Results are for illustrative purposes and include future-looking features.\u003c/p\u003e\n    \u003c/div\u003e\n  \n  \n\u003c/uni-image-full-width\u003e\n\n\n  \n\n  \n    \u003cdiv data-component=\"uni-article-paragraph\" data-analytics-module=\"{\n           \u0026#34;module_name\u0026#34;: \u0026#34;Paragraph\u0026#34;,\n           \u0026#34;section_header\u0026#34;: \u0026#34;Expanding AI Overviews and introducing AI Mode\u0026#34;\n         }\"\u003e\u003cp data-block-key=\"se9jo\"\u003eHelping people discover content from the web remains central to our approach, and with AI Mode we’re making it easy for people to explore and take action. With the model’s deep information retrieval, people can better express what they’re looking for — with all their nuances and constraints — and get to the right web content in a range of formats.\u003c/p\u003e\u003ch2 data-block-key=\"fibjv\"\u003eTesting in Labs\u003c/h2\u003e\u003cp data-block-key=\"ahj00\"\u003eWe’ve been getting feedback internally and from trusted testers, and they’ve found AI Mode incredibly helpful– they particularly appreciate the speed, quality and freshness of responses.\u003c/p\u003e\u003cp data-block-key=\"27gie\"\u003eNow, we’re expanding our testing with a limited, opt-in \u003ca href=\"https://labs.google.com/search/experiment/22\"\u003eexperience in Labs\u003c/a\u003e. This experimental approach helps us learn what’s most helpful and improve rapidly with feedback from people who are most eager to try it out.\u003c/p\u003e\u003cp data-block-key=\"befe0\"\u003eAI Mode is rooted in our core \u003ca href=\"https://search.google/pdf/google-about-AI-overviews-AI-Mode.pdf\"\u003equality and ranking systems\u003c/a\u003e, and we’re also using novel approaches with the model’s reasoning capabilities to improve factuality. We aim to show an AI-powered response as much as possible, but in cases where we don’t have high confidence in helpfulness and quality, the response will be a set of web search results. As with any early-stage AI product, we won’t always get it right. For example, while we aim for AI responses in Search to present information objectively based on what’s available on the web, it’s possible that some responses may unintentionally appear to take on a persona or reflect a particular opinion.\u003c/p\u003e\u003cp data-block-key=\"24rit\"\u003eIn this next testing phase, we’ll address these types of challenges and also rapidly make changes to the user experience based on the feedback we get. We’re already working on new capabilities and updates, like adding more visual responses with images and video, richer formatting, new ways to get to helpful web content and much more.\u003c/p\u003e\u003cp data-block-key=\"258f3\"\u003eStarting today, we’ll begin inviting \u003ca href=\"https://one.google.com/about/ai-premium/\"\u003eGoogle One AI Premium\u003c/a\u003e subscribers to be the first to try out this experience in Labs. We look forward to the feedback, and stay tuned for more!\u003c/p\u003e\u003c/div\u003e\n  \n\n\n            \n            \n\n            \n              \n\n\n\n\n            \n          \u003c/div\u003e\n  \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-05T17:00:00Z",
  "modifiedTime": null
}
