{
  "id": "ec4a79e6-506f-45be-bbbd-e4ff9d95829d",
  "title": "How a space telescope found the ‘strongest evidence yet’ of life beyond our solar system",
  "link": "https://thenextweb.com/news/how-james-webb-space-telescope-found-evidence-alien-life",
  "description": "Astronomers using the James Webb Space Telescope say they have detected the “strongest evidence yet” that life exists outside our solar system.   Scientists at the University of Cambridge found signs of the gases dimethyl sulfide (DMS) and/or dimethyl disulfide (DMDS) in the atmosphere of exoplanet K2-18b. On Earth, these gases are only produced by living organisms like phytoplankton, suggesting that K2-18b may also support life.  Located 124 light years away, K2-18b is almost three times the size of Earth and inhabits a region in space where temperatures might allow liquid water. This has long made the exoplanet a top candidate…This story continues at The Next Web",
  "author": "Siôn Geschwindt",
  "published": "Thu, 17 Apr 2025 18:27:11 +0000",
  "source": "https://thenextweb.com/feed/",
  "categories": [
    "Deep tech",
    "Government and policy"
  ],
  "byline": "Siôn Geschwindt",
  "length": 3129,
  "excerpt": "Astronomers using the James Webb Space Telescope have found the “strongest evidence” yet of life beyond our solar system.",
  "siteName": "TNW | Deep-Tech",
  "favicon": "https://next.tnwcdn.com/assets/img/favicon/favicon-194x194.png",
  "text": "Astronomers using the James Webb Space Telescope say they have detected the “strongest evidence yet” that life exists outside our solar system.   Scientists at the University of Cambridge found signs of the gases dimethyl sulfide (DMS) and/or dimethyl disulfide (DMDS) in the atmosphere of exoplanet K2-18b. On Earth, these gases are only produced by living organisms like phytoplankton, suggesting that K2-18b may also support life.  Located 124 light years away, K2-18b is almost three times the size of Earth and inhabits a region in space where temperatures might allow liquid water. This has long made the exoplanet a top candidate in humanity’s search for alien life.  Armed with the world’s most powerful space telescope, scientists are closer than ever to unearthing the mysteries of this far-off world.  How did the team spot signs of extraterrestrial life? To arrive at their conclusions, the scientists employed a technique known as transit spectroscopy.  When K2-18b transits in front of its parent star, some of the starlight passes through its atmosphere before reaching Earth. Different gases absorb specific colours or wavelengths of the starlight, which can be picked up by James Webb’s instruments.  By studying the “missing” light colours, the scientists could piece together which gases are present in the exoplanet’s atmosphere.  The new findings support existing theories that K2-18b is a “hycean planet” — home to vast oceans and a hydrogen-rich atmosphere. “Given everything we know about this planet, a Hycean world with an ocean that is teeming with life is the scenario that best fits the data we have,” said Professor Nikku Madhusudhan from Cambridge’s Institute of Astronomy, who led the research.  Madhusudhan and his team admit that an unknown chemical process may be the source of these gases. However, the observations reached a “three-sigma” level of statistical significance, meaning there’s only a 0.3% probability they occurred by chance. That’s not the 0.00006% needed to reach the accepted classification for a scientific discovery — but it’s compelling evidence nonetheless. In 2023, the same team of Cambridge researchers found signs of methane and CO2 in K2-18b’s atmosphere using two different James Webb instruments — the Near-Infrared Imager and Slitless Spectrograph (NIRISS) and the Near-Infrared Spectrograph (NIRSpec). This marked the first detection of carbon-based molecules on an exoplanet within the habitable zone.  During these first observations, the researchers also noticed faint signals that potentially indicated DMS. Intrigued by this possibility, the team conducted follow-up observations two years later, this time using the Mid-Infrared Instrument (MIRI).  “This is an independent line of evidence, using a different instrument than we did before and a different wavelength range of light, where there is no overlap with the previous observations,” said Madhusudhan. “The signal came through strong and clear.”  The researchers estimate that 16 to 24 hours of follow-up observation time with JWST may push the findings past the threshold for a scientific discovery.",
  "image": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1\u0026fit=1280%2C640\u0026url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F04%2FUntitled-design-21.jpg\u0026signature=04dd935d6a1f5057e335bfafb6605887",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-main-content\"\u003e\n                            \u003cp\u003e\u003cspan\u003eAstronomers using the \u003ca href=\"https://thenextweb.com/news/here-are-first-full-color-images-from-james-webb-telescope\" target=\"_blank\" rel=\"noopener\"\u003eJames Webb Space Telescope\u003c/a\u003e say they have detected the “strongest evidence yet” that life exists outside our solar system.  \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eScientists at the University of Cambridge found signs of the gases dimethyl sulfide (DMS) and/or dimethyl disulfide (DMDS) in the atmosphere of exoplanet \u003c/span\u003e\u003cspan\u003eK2-18b. On Earth, these gases are only produced by living organisms like phytoplankton, suggesting that K2-18b may also support life. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLocated 124 light years away, K2-18b is almost three times the size of Earth and inhabits a region in space where temperatures might allow liquid water. This has long made the exoplanet a top candidate in humanity’s search for alien life. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eArmed with the world’s most powerful space telescope, scientists are closer than ever to unearthing the mysteries of this far-off world. \u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003e\u003cb\u003eHow did the team spot signs of extraterrestrial life?\u003c/b\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cspan\u003eTo arrive at their conclusions, the scientists employed a technique known as transit spectroscopy. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWhen K2-18b transits in front of its parent star, some of the starlight passes through its atmosphere before reaching Earth. Different gases absorb specific colours or wavelengths of the starlight, which can be picked up by James Webb’s instruments. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBy studying the “missing” light colours, the scientists could piece together which gases are present in the exoplanet’s atmosphere. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe new\u003c/span\u003e\u003cspan\u003e findings support existing \u003c/span\u003e\u003ca href=\"https://www.nasa.gov/universe/exoplanets/webb-discovers-methane-carbon-dioxide-in-atmosphere-of-k2-18-b/\" target=\"_blank\" rel=\"nofollow noopener\"\u003e\u003cspan\u003etheories\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e that \u003c/span\u003e\u003cspan\u003eK2-18b is a \u003c/span\u003e\u003cspan\u003e“hycean planet” — home to \u003c/span\u003e\u003cspan\u003evast oceans and a hydrogen-rich atmosphere.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“\u003c/span\u003e\u003cspan\u003eGiven everything we know about this planet, a Hycean world with an ocean that is teeming with life is the scenario that best fits the data we have,” said Professor Nikku Madhusudhan from Cambridge’s Institute of Astronomy, who led the research. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMadhusudhan and his team\u003c/span\u003e\u003cspan\u003e admit that an unknown chemical process may be the source of these gases. However, the observations reached a “three-sigma” level of statistical significance, meaning there’s only a 0.3% probability they occurred by chance. That’s not the 0.00006% needed to reach the accepted classification for a scientific discovery — but it’s compelling evidence nonetheless.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eIn 2023, the same team of Cambridge researchers found signs of methane and CO2 in K2-18b’s atmosphere using two different James Webb instruments — the \u003c/span\u003e\u003cspan\u003eNear-Infrared Imager and Slitless Spectrograph (NIRISS) and the Near-Infrared Spectrograph (NIRSpec). \u003c/span\u003e\u003cspan\u003eThis marked the first detection of carbon-based molecules on an exoplanet within the habitable zone. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eDuring these first observations, the researchers also noticed faint signals that potentially indicated DMS. Intrigued by this possibility, the team conducted follow-up observations two years later, this time using the Mid-Infrared Instrument (MIRI). \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“This is an independent line of evidence, using a different instrument than we did before and a different wavelength range of light, where there is no overlap with the previous observations,” said Madhusudhan. “The signal came through strong and clear.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe researchers estimate that 16 to 24 hours of follow-up observation time with JWST may push the findings past the threshold for a scientific discovery.  \u003c/span\u003e\u003c/p\u003e\n                        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-17T18:27:11Z",
  "modifiedTime": "2025-04-17T18:31:54Z"
}
