{
  "id": "ee915c5a-6bf5-4f0e-b907-ef5e07ce592d",
  "title": "Amazon reportedly bumped back its AI-powered Alexa to next year",
  "link": "https://www.engadget.com/ai/amazon-reportedly-bumped-back-its-ai-powered-alexa-to-next-year-215041138.html?src=rss",
  "description": "If you’re wondering what happened to Amazon’s new and improved version of its Alexa voice assistant, you’re not alone. Bloomberg reports that the new Alexa is still stuck in its developmental phase and Amazon has cut off access to its beta phase including its new “Let’s Chat” phase. As a result, a planned late 2024 launch has been pushed back to next year. The problem seems to be with its large language models (LLMs). The new Alexa is designed to understand more complicated questions from users but it’s also more likely to fail doing some of the most basic things the old version could do quite easily like create a timer or operate smart lights, according to a follow up report from The Verge. Amazon originally planned to unveil its new version of Alexa AI in October but now the timeline has been extended into next year. (As you might have noticed, October has come and gone.) The original timeline planned to premiere the next evolutionary step in Alexa’s advancement on October 17 but Amazon decided to pivot and used the date to show off its new line of Kindle ereaders. Then in August, news surfaced that the new Alexa would be powered by Anthropic’s Claude AI and come with a monthly subscription fee. As ChatGPT began to rise in popularity in the summer of 2023, Amazon CEO Andy Jassy wanted to see if Alexa could compete if it had an AI upgrade. Jassy reportedly started peppering Alexa with sports questions “like an ESPN reporter at a playoff press conference” and its answers were “nowhere near perfect.” It even made up a recent game score for Jassy. Despite this, Alexa passed the good enough stage and Jassy and his fellow executives felt their engineers could build a beta version by the early part of 2024. Unfortunately, Amazon wasn’t able to meet its deadline. Even with the new deadline, the new Alexa still has a long way to go to fix its problems. Some employees told Bloomberg that the problem outside of Alexa’s innerworkings is with Amazon’s overstuffed management and a lack of “a compelling vision for an AI-powered Alexa.” .This article originally appeared on Engadget at https://www.engadget.com/ai/amazon-reportedly-bumped-back-its-ai-powered-alexa-to-next-year-215041138.html?src=rss",
  "author": "Danny Gallagher",
  "published": "Fri, 01 Nov 2024 21:50:42 +0000",
  "source": "https://www.engadget.com/rss.xml",
  "categories": [
    "Technology \u0026 Electronics",
    "Personal Investing Ideas \u0026 Strategies",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Danny Gallagher"
  ],
  "byline": "Danny Gallagher",
  "length": 2055,
  "excerpt": "Alexa's next incarnation isn't working as well as Amazon executives hoped it would be by now.",
  "siteName": "Engadget",
  "favicon": "https://s.yimg.com/kw/assets/favicon-160x160.png",
  "text": "If you’re wondering what happened to Amazon’s new and improved version of its Alexa voice assistant, you’re not alone. Bloomberg reports that the new Alexa is still stuck in its developmental phase and Amazon has cut off access to its beta phase including its new “Let’s Chat” phase. As a result, a planned late 2024 launch has been pushed back to next year.The problem seems to be with its large language models (LLMs). The new Alexa is designed to understand more complicated questions from users but it’s also more likely to fail doing some of the most basic things the old version could do quite easily like create a timer or operate smart lights, according to a follow up report from The Verge.Amazon originally planned to unveil its new version of Alexa AI in October but now the timeline has been extended into next year. (As you might have noticed, October has come and gone.) The original timeline planned to premiere the next evolutionary step in Alexa’s advancement on October 17 but Amazon decided to pivot and used the date to show off its new line of Kindle ereaders. Then in August, news surfaced that the new Alexa would be powered by Anthropic’s Claude AI and come with a monthly subscription fee.As ChatGPT began to rise in popularity in the summer of 2023, Amazon CEO Andy Jassy wanted to see if Alexa could compete if it had an AI upgrade. Jassy reportedly started peppering Alexa with sports questions “like an ESPN reporter at a playoff press conference” and its answers were “nowhere near perfect.” It even made up a recent game score for Jassy.Despite this, Alexa passed the good enough stage and Jassy and his fellow executives felt their engineers could build a beta version by the early part of 2024. Unfortunately, Amazon wasn’t able to meet its deadline.Even with the new deadline, the new Alexa still has a long way to go to fix its problems. Some employees told Bloomberg that the problem outside of Alexa’s innerworkings is with Amazon’s overstuffed management and a lack of “a compelling vision for an AI-powered Alexa.” .",
  "image": "https://s.yimg.com/ny/api/res/1.2/OWP.q9uVRDmjYun_eEq2Kg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-11/b79d2750-989a-11ef-bdff-41c3c409887c",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eIf you’re wondering what happened to Amazon’s new and improved version of its Alexa voice assistant, you’re not alone. \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.bloomberg.com/news/features/2024-10-30/new-amazon-alexa-ai-is-stuck-in-the-lab-till-it-can-outsmart-chatgpt?sref=10lNAhZ9\u0026amp;embedded-checkout=true\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Bloomberg;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eBloomberg\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e reports that the new Alexa is still stuck in its developmental phase and Amazon has cut off access to its beta phase including its new “Let’s Chat” phase. As a result, a planned late 2024 launch has been pushed back to next year.\u003c/p\u003e\u003cp\u003eThe problem seems to be with its large language models (LLMs). The new Alexa is designed to \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.engadget.com/amazon-alexa-is-evolving-into-a-chatbot-for-your-home-152654742.html\" data-ylk=\"slk:understand more complicated questions;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eunderstand more complicated questions\u003c/ins\u003e\u003c/a\u003e from users but it’s also more likely to fail doing some of the most basic things the old version could do quite easily like create a timer or operate smart lights, according to a follow up report from \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.theverge.com/2024/10/31/24284772/amazon-new-alexa-llm-voice-assistant-delayed-2025\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:The Verge;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003e\u003cins\u003eThe Verge\u003c/ins\u003e\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAmazon originally planned to unveil its new version of Alexa AI in October but now the timeline has been extended into next year. (As you might have noticed, October has come and gone.) The original timeline planned to premiere the next evolutionary step in Alexa’s advancement on October 17 but Amazon decided to pivot and used the date to show off its new line of Kindle ereaders. Then in August, news surfaced that the new Alexa would be powered by \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.engadget.com/ai/amazons-remarkable-alexa-will-reportedly-run-on-claude-ai-and-cost-5-10-per-month-122532161.html\" data-ylk=\"slk:Anthropic’s Claude AI;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cins\u003eAnthropic’s Claude AI \u003c/ins\u003e\u003c/a\u003eand come with a monthly subscription fee.\u003c/p\u003e\u003cp\u003eAs ChatGPT began to rise in popularity in the summer of 2023, Amazon CEO Andy Jassy wanted to see if Alexa could compete if it had an AI upgrade. Jassy reportedly started peppering Alexa with sports questions “like an ESPN reporter at a playoff press conference” and its answers were “nowhere near perfect.” It even made up a recent game score for Jassy.\u003c/p\u003e\u003cp\u003eDespite this, Alexa passed the good enough stage and Jassy and his fellow executives felt their engineers could build a beta version by the early part of 2024. Unfortunately, Amazon wasn’t able to meet its deadline.\u003c/p\u003e\u003cp\u003eEven with the new deadline, the new Alexa still has a long way to go to fix its problems. Some employees told \u003cem\u003eBloomberg\u003c/em\u003e that the problem outside of Alexa’s innerworkings is with Amazon’s overstuffed management and a lack of “a compelling vision for an AI-powered Alexa.” .\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-01T21:50:42Z",
  "modifiedTime": null
}
