{
  "id": "f13ce3ce-2268-4d7f-8043-644e40b06a4f",
  "title": "Jeff Bezos says he’s ‘very optimistic this time around’ about Trump",
  "link": "https://www.theverge.com/2024/12/4/24313549/bezos-trump-optimistic-dealbook-summit-doge",
  "description": "",
  "author": "Alex Heath",
  "published": "2024-12-04T17:45:38-05:00",
  "source": "https://www.theverge.com/rss/index.xml",
  "categories": null,
  "byline": "Alex Heath",
  "length": 1595,
  "excerpt": "Even though he clashed with Trump before, the Amazon and Blue Origin founder is very bullish on Donald Trump’s second term and Elon Musk’s DOGE.",
  "siteName": "The Verge",
  "favicon": "https://www.theverge.com/icons/android_chrome_512x512.png",
  "text": "Jeff Bezos and President-elect Donald Trump famously didn’t get along the last time Trump was in the White House. This time, Bezos says he’s “very optimistic” and even wants to help out.“I’m actually very optimistic this time around,” Bezos said of Trump during a rare public appearance at The New York Times DealBook Summit on Wednesday. “He seems to have a lot of energy around reducing regulation. If I can help him do that, I’m going to help him.”Trump railed against Bezos and his companies — Amazon, Blue Origin, and The Washington Post — during his 2016 term. Bezos defended himself but it did little to help his reputation with Trump. Now, his companies have a lot at stake in the coming administration, from the FTC’s antitrust lawsuit against Amazon to Blue Origin’s efforts to compete with SpaceX for government contracts. Onstage at the DealBook Summit on Wednesday, Bezos called Trump “calmer this time” and “more settled.” He said he will try to “talk him out of” the idea that the press, which includes The Washington Post, is an enemy of the people. “You’ve probably grown in the last eight years,” he said to DealBook’s Andrew Ross Sorkin. “He has, too.”Bezos also echoed Sam Altman’s comments earlier in the day, saying he doesn’t expect Elon Musk to wield his new political power with DOGE against rivals. “I’ve had a lot success in life not being cynical,” he said. “And I’ve rarely been taken advantage of as a result.”You can watch Bezos’s conversation with Andrew Ross Sorkin below:Command Line / A newsletter from Alex Heath about the tech industry’s inside conversation.",
  "image": "https://cdn.vox-cdn.com/thumbor/noFcZEjUsNriHVwnYO2X9PStFbw=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951506/VRG_Illo_STK173_L_Normand_JeffBezos_Positive2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"zephr-anchor\"\u003e\u003cp\u003eJeff Bezos and President-elect Donald Trump famously didn’t get along the last time Trump was in the White House. This time, Bezos says he’s “very optimistic” and even wants to help out.\u003c/p\u003e\u003cp\u003e“I’m actually very optimistic this time around,” Bezos said of Trump during a rare public appearance at \u003cem\u003eThe New York Times \u003c/em\u003eDealBook Summit on Wednesday. “He seems to have a lot of energy around reducing regulation. If I can help him do that, I’m going to help him.”\u003c/p\u003e\u003cp\u003eTrump \u003ca href=\"https://www.theverge.com/2018/4/14/17233680/trump-amazon-bezos-postal-service-explained\"\u003erailed against Bezos\u003c/a\u003e and his companies — Amazon, Blue Origin, and \u003cem\u003eThe Washington Post \u003c/em\u003e— during his 2016 term. Bezos defended himself but it did little to help his reputation with Trump. Now, his companies have a lot at stake in the coming administration, from the FTC’s antitrust lawsuit against Amazon to Blue Origin’s efforts to compete with SpaceX for government contracts. \u003c/p\u003e\u003cp\u003eOnstage at the DealBook Summit on Wednesday, Bezos called Trump “calmer this time” and “more settled.” He said he will try to “talk him out of” the idea that the press, which includes \u003cem\u003eThe Washington Post\u003c/em\u003e, is an enemy of the people. \u003c/p\u003e\u003cp\u003e“You’ve probably grown in the last eight years,” he said to DealBook’s Andrew Ross Sorkin. “He has, too.”\u003c/p\u003e\u003cp\u003eBezos also echoed Sam Altman’s \u003ca href=\"https://www.theverge.com/e/24077171\"\u003ecomments earlier in the day\u003c/a\u003e, saying he doesn’t expect Elon Musk to wield his new political power \u003ca href=\"https://www.theverge.com/2024/11/20/24301975/elon-musk-vivek-ramaswamy-doge-plan\"\u003ewith DOGE\u003c/a\u003e against rivals. “I’ve had a lot success in life not being cynical,” he said. “And I’ve rarely been taken advantage of as a result.”\u003c/p\u003e\u003cp\u003eYou can watch Bezos’s conversation with Andrew Ross Sorkin below:\u003c/p\u003e\u003cdiv\u003e\u003cform\u003e\u003cdiv\u003e\u003ch2\u003eCommand Line\u003c/h2\u003e\u003cp\u003e / \u003cspan\u003eA newsletter from Alex Heath about the tech industry’s inside conversation.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/form\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-04T22:45:38.195Z",
  "modifiedTime": "2024-12-04T22:45:38.195Z"
}
