{
  "id": "f4f8ef61-d0fc-4836-85b1-3a7a5cca6a0b",
  "title": "A murder victim addressed his killer in court thanks to AI resurrection",
  "link": "https://mashable.com/article/murder-victim-ai-video-courtroom-sentencing",
  "description": "AI is now being used to help the dead speak, even in courtrooms, like Christopher Pelkey in Arizona.",
  "author": "",
  "published": "Thu, 08 May 2025 21:57:11 +0000",
  "source": "http://feeds.mashable.com/Mashable",
  "categories": null,
  "byline": "Christianna Silva",
  "length": 4161,
  "excerpt": "The deceased man was surprisingly chipper in the AI-generated video.",
  "siteName": "Mashable",
  "favicon": "https://mashable.com/favicons/android-chrome-512x512.png",
  "text": "The deceased man was surprisingly chipper in the AI-generated video. Screenshot from an AI-generated image. Credit: Stacey Wales / YouTube Digital resurrection projects — using artificial intelligence to bring back the likeness of people who have died — have become a trend for at least two years. And, as AI gets more advanced, so do the resurrections.Most recently, Stacey Wales used AI to generate a video of her late brother, Christopher Pelkey, to address the courtroom at the sentencing hearing for the man who killed him in a road rage incident in Chandler, Arizona. According to NPR, its the first time AI has ever been used in this way. \"He doesn't get a say. He doesn't get a chance to speak,\" Wales told NPR, referring to her brother. \"We can't let that happen. We have to give him a voice.\"Pelkey was a veteran who served as a sergeant in the U.S. Army, according to an online obituary. He was also heavily involved in his local church, and he went on multiple mission trips. His sister told NPR that he loved God, loved others, and would give a stranger the shirt off his back. He was 37 when he died.Wales created the AI video of her brother in a few days, but she didn't come up with the idea immediately. After two years of trying to craft a victim impact statement, Wales said she had the epiphany that the only voice that mattered was her late brother's. Mashable Top Stories \"Every time I'd get in the shower or the car and my thoughts were quiet, I wrote down what I was feeling — frustrated, crying or emotions, yelling, anger, love, anything that I could think of,\" she told NBC News. \"I've been writing it for two years, but I never had the idea to help Chris speak until a week and a half before this second trial.\"Wales also posted the AI video of her brother online, and you can watch the same video shown in the courtroom. \"Hello. Just to be clear for everyone seeing this, I'm a version of Chris Pelkey recreated through AI that uses my picture and my voice profile,\" the AI avatar said in the video. AI Pelkey thanked everyone in his life, and said he and his shooter, Gabriel Paul Horcasitas, \"could have been friends\" in \"another life.\" \"Well, I'm gonna go fishing now. Love you all. See you on the other side,\" AI Pelkey said at the end of the video.According to NPR, Maricopa County Superior Court Judge Todd Lang said, \"I loved that AI. Thank you for that.\" He gave Horcasitas the maximum sentence of just over a decade in prison for manslaughter.This isn't the first time people have pushed the limits of AI to create versions of people who have died. It's a phenomenon particularly beloved by TikTok true crime fans, as Rolling Stone reported in 2023. And just last year, youth-focused gun reform organizations March For Our Lives and Change the Ref used audio \"deepfakes\" to \"resurrect\" gun violence victims in a campaign to Congress. Christianna Silva is a senior culture reporter covering social platforms and the creator economy, with a focus on the intersection of social media, politics, and the economic systems that govern us. Since joining Mashable in 2021, they have reported extensively on meme creators, content moderation, and the nature of online creation under capitalism. Before joining Mashable, they worked as an editor at NPR and MTV News, a reporter at Teen Vogue and VICE News, and as a stablehand at a mini-horse farm. You can follow her on Bluesky @christiannaj.bsky.social and Instagram @christianna_j. These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy.",
  "image": "https://helios-i.mashable.com/imagery/articles/01pk1b8zc6j9aWNo2ilQMcK/hero-image.fill.size_1200x675.v1746740167.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                \n    \n    \n        \n    \u003cp\u003eThe deceased man was surprisingly chipper in the AI-generated video.\u003c/p\u003e\n    \n\n    \n\u003c/div\u003e\u003csection data-ga-module=\"content_body\"\u003e\n                        \u003cdiv\u003e\n                \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/articles/01pk1b8zc6j9aWNo2ilQMcK/hero-image.fill.size_1248x702.v1746740167.jpg\" alt=\"ai-generated video of murder victim Christopher Pelkey\" width=\"1248\" height=\"702\" srcset=\"https://helios-i.mashable.com/imagery/articles/01pk1b8zc6j9aWNo2ilQMcK/hero-image.fill.size_400x225.v1746740167.jpg 400w, https://helios-i.mashable.com/imagery/articles/01pk1b8zc6j9aWNo2ilQMcK/hero-image.fill.size_800x450.v1746740167.jpg 800w, https://helios-i.mashable.com/imagery/articles/01pk1b8zc6j9aWNo2ilQMcK/hero-image.fill.size_1248x702.v1746740167.jpg 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eScreenshot from an AI-generated image.\u003c/span\u003e\n                \n                                    \u003cspan\u003eCredit: Stacey Wales / YouTube\u003c/span\u003e\n                            \u003c/p\u003e\n                        \u003c/div\u003e\n\n    \n    \n    \n            \u003carticle id=\"article\" data-autopogo=\"\"\u003e\n                                    \u003cp\u003eDigital resurrection projects — using \u003ca href=\"https://mashable.com/category/artificial-intelligence\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eartificial intelligence\u003c/a\u003e to bring back the likeness of people who have died — have become a trend for at least two years. And, as AI gets more advanced, so do the resurrections.\u003c/p\u003e\u003cp\u003eMost recently, Stacey Wales used AI to generate a video of her late brother, Christopher Pelkey, to address the courtroom at the sentencing hearing for the man who killed him in a road rage incident in Chandler, Arizona. \u003ca href=\"https://www.npr.org/2025/05/07/g-s1-64640/ai-impact-statement-murder-victim\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eAccording to NPR\u003c/a\u003e, its the first time AI has ever been used in this way. \u003c/p\u003e\u003cp\u003e\u0026#34;He doesn\u0026#39;t get a say. He doesn\u0026#39;t get a chance to speak,\u0026#34; Wales told NPR, referring to her brother. \u0026#34;We can\u0026#39;t let that happen. We have to give him a voice.\u0026#34;\u003c/p\u003e\u003cp\u003ePelkey was a veteran who served as a sergeant in the U.S. Army, \u003ca href=\"https://everloved.com/life-of/christopher-pelkey/obituary/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eaccording to an online obituary\u003c/a\u003e. He was also heavily involved in his local church, and he went on multiple mission trips. His sister told NPR that he loved God, loved others, and would give a stranger the shirt off his back. He was 37 when he died.\u003c/p\u003e\u003cp\u003eWales created the AI video of her brother in a few days, but she didn\u0026#39;t come up with the idea immediately. After two years of trying to craft a victim impact statement, Wales said she had the epiphany that the only voice that mattered was her late brother\u0026#39;s.\u003c/p\u003e\u003csection x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"incontent_nl_signup\" data-ga-label=\"top-stories\"\u003e\n        \u003cp\u003e\n            Mashable Top Stories\n        \u003c/p\u003e\n        \n        \n    \u003c/section\u003e\n\u003cp\u003e\u0026#34;Every time I\u0026#39;d get in the shower or the car and my thoughts were quiet, I wrote down what I was feeling — frustrated, crying or emotions, yelling, anger, love, anything that I could think of,\u0026#34; she told \u003ca href=\"https://www.nbcnews.com/news/us-news/road-rage-victim-speaks-killers-sentencing-rcna205454\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eNBC News\u003c/a\u003e. \u0026#34;I\u0026#39;ve been writing it for two years, but I never had the idea to help Chris speak until a week and a half before this second trial.\u0026#34;\u003c/p\u003e\u003cp\u003eWales also posted the AI video of her brother online, and you can watch the same video shown in the courtroom.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Hello. Just to be clear for everyone seeing this, I\u0026#39;m a version of Chris Pelkey recreated through AI that uses my picture and my voice profile,\u0026#34; the AI avatar said in the video. AI Pelkey thanked everyone in his life, and said he and his shooter, Gabriel Paul Horcasitas, \u0026#34;could have been friends\u0026#34; in \u0026#34;another life.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Well, I\u0026#39;m gonna go fishing now. Love you all. See you on the other side,\u0026#34; AI Pelkey said at the end of the video.\u003c/p\u003e\u003cp\u003eAccording to NPR, Maricopa County Superior Court Judge Todd Lang said, \u0026#34;I loved that AI. Thank you for that.\u0026#34; He gave Horcasitas the maximum sentence of just over a decade in prison for manslaughter.\u003c/p\u003e\u003cp\u003eThis isn\u0026#39;t the first time people have pushed the limits of AI to create versions of people who have died. It\u0026#39;s a phenomenon particularly beloved by TikTok true crime fans, \u003ca href=\"https://www.rollingstone.com/culture/culture-features/true-crime-tiktok-ai-deepfake-victims-children-1234743895/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003eas \u003cem\u003eRolling Stone\u003c/em\u003e reported in 2023\u003c/a\u003e. And just last year, youth-focused gun reform organizations March For Our Lives and Change the Ref \u003ca href=\"https://mashable.com/article/gun-violence-victims-deepfake-ai-voicemails-sent-to-congress\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eused audio \u0026#34;deepfakes\u0026#34;\u003c/a\u003e to \u0026#34;resurrect\u0026#34; gun violence victims in a campaign to Congress.\u003c/p\u003e\n\n                                        \n                    \u003c/article\u003e\n    \n    \n    \n            \u003cdiv\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e\u003cimg src=\"https://helios-i.mashable.com/imagery/defaults/fallback-thumbnail.fill.size_100x100.1.png\" alt=\"Mashable Image\" width=\"100\" height=\"100\" loading=\"lazy\"/\u003e\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003cp\u003eChristianna Silva is a senior culture reporter covering social platforms and the creator economy, with a focus on the intersection of social media, politics, and the economic systems that govern us. Since joining Mashable in 2021, they have reported extensively on \u003ca href=\"https://mashable.com/article/trauma-memes-are-the-therapy-we-can-afford\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003ememe creators\u003c/a\u003e, \u003ca href=\"https://mashable.com/article/content-moderation-changing-language-fast\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003econtent moderation\u003c/a\u003e, and \u003ca href=\"https://mashable.com/article/strava-anxiety-joy-self-surveillance\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003ethe nature of\u003c/a\u003e \u003ca href=\"https://mashable.com/article/why-social-media-sucks-instagram-meta-backlash\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eonline creation\u003c/a\u003e \u003ca href=\"https://mashable.com/article/productivity-aesthetics-scams\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\"\u003eunder capitalism\u003c/a\u003e. \u003c/p\u003e\u003cp\u003eBefore joining Mashable, they worked as an editor at NPR and MTV News, a reporter at Teen Vogue and VICE News, and as a stablehand at a mini-horse farm. You can follow her on Bluesky @\u003ca href=\"http://christiannaj.bsky.social\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003echristiannaj.bsky.social\u003c/a\u003e and Instagram @\u003ca href=\"https://www.instagram.com/christianna_j/\" target=\"_blank\" data-ga-click=\"1\" data-ga-label=\"$text\" data-ga-item=\"text-link\" data-ga-module=\"content_body\" title=\"(opens in a new window)\"\u003echristianna_j\u003c/a\u003e.\u003c/p\u003e\n            \u003c/div\u003e\n        \u003c/div\u003e\n        \n        \n                    \u003c/section\u003e\u003cdiv x-data=\"window.newsletter()\" x-init=\"init()\" data-ga-impression=\"\" data-ga-category=\"newsletters\" data-ga-module=\"footer_nl_signup\" data-ga-label=\"Top Stories\"\u003e\n    \n\n    \u003cp\u003e\n        These newsletters may contain advertising, deals, or affiliate links. By clicking Subscribe, you confirm you are 16+ and agree to our \u003ca href=\"https://www.ziffdavis.com/terms-of-use\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003eTerms of Use\u003c/a\u003e and \u003ca href=\"https://www.ziffdavis.com/ztg-privacy-policy\" target=\"_blank\" rel=\"noopener\" title=\"(opens in a new window)\"\u003ePrivacy Policy\u003c/a\u003e.\n    \u003c/p\u003e\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-08T21:57:11Z",
  "modifiedTime": null
}
