{
  "id": "f7b34595-117d-4464-839a-1d42c3675aaa",
  "title": "The First Four Settings to Change on Any Boox E-Ink Tablet",
  "link": "https://lifehacker.com/tech/settings-to-change-boox-e-ink-tablet?utm_medium=RSS",
  "description": "Make your pricey new digital notebook a little easier to use.",
  "author": "Joel Cunningham",
  "published": "Fri, 07 Mar 2025 22:00:00 +0000",
  "source": "https://lifehacker.com/rss",
  "categories": [
    "Software"
  ],
  "byline": "Joel Cunningham",
  "length": 7298,
  "excerpt": "Make your pricey new digital notebook a little easier to use.",
  "siteName": "Lifehacker",
  "favicon": "https://lifehacker.com/images/android-chrome-384x384.png",
  "text": "Make your pricey new digital notebook a little easier to use. Credit: Joel Cunningham While they will never have the name recognition of the Amazon Kindle, e-ink devices from Chinese tech company Onyx International—sold under the slightly silly \"Boox\" brand name—are gaining a cult following in the U.S. I've reviewed three of its e-readers and digital notebooks over the past year, and I'm a huge fan. And if you're reading this article, you probably are too (or soon will be).I love Boox devices not only because they're well built and full-featured (though if you want more of my thoughts there, check out my assessments of the Boox Palma, Note Max, and Note Air 4C). I also can't get enough of their customizability. Nothing makes me crazier than trying to do something simple with a device, only to be stymied due to locked down software that doesn't want to let me. From side-loading books onto a Kindle to doing—well, basically anything unsanctioned on an iPad, big companies seem determined to only let me do with my devices what they want me to do.Boox devices are different: They run on an open version of Android that lets you do pretty much whatever you want. You can download any app in the Google Play Store, so you aren't tied to one e-reading platform. If you want to sideload apps, feel free: Plug the device into your laptop and it will mount right to the desktop. If you're truly ambitious, you can even install your own launcher to completely change things up.While all this freedom is nice, it also means Boox devices have a bit more of a learning curve than, say, a plug-and-read Kindle. So if you are the new owner of one of these fantastic devices—whether an e-reader or a full-fledged digital notebook—here are four settings you should change right away to get the most out of it.Set a one-touch refreshLike any e-ink tablet, Boox devices suffer from occasional \"ghosting,\" or visible afterimages once you've turned a page. While the device will automatically refresh itself after a certain number of taps (touching the screen, basically), I like to set up a one-touch refresh that I can trigger whenever I want to. Depending on your device, there are a few ways to do this: a button or a gesture. Setting a manual refresh on a Boox device with buttons Credit: Screenshot by Joel Cunningham If you've got a Boox Palma or another device with page turn/volume buttons, you can map one of them to a screen refresh. For the Palma, it makes the most sense to use the Smart Button for this—that's the button on the left hand side of the device, which can do different things based on whether you press it once, twice, or hold it down. On my own device, I've mapped a manual refresh to a single Smart Button press, as it's the thing I find myself doing most often (that, or returning to the home screen, which is another of the many options you can choose). That said, you can also map a refresh to the volume buttons if you like (though I prefer to use those for page turns).To remap your Smart Button, open the settings app and tap Smart Button. Tap your preferred option (Short-press Function, Double-click Function, or Long-press Function) and select Full-refresh.Setting a manual refresh with a gesture Credit: Screenshot by Joel Cunningham Not all Boox devices have buttons, so if yours doesn't, you'll need to map a manual refresh to a gesture. (Though you can also do this on the Palma, if you like.)To get started, open Settings and scroll down to System Navigation. Under Bottom Navigation, tap More Settings. Choose the area of the screen you'd like to map the refresh to by swiping between the left, center, or right side options. Tap Custom and then choose Full-refresh from your list of options.Choose your cloud storage optionBoox devices tend to have generous onboard storage, but you'll get more out of them by linking your preferred cloud storage service on the system level. This will let you move files on and off the device without the need to plug it in to your computer.To start, open Settings, then Accounts. Tap Move to Cloud Storage in Library, then select your preferred option from the list. You have a bunch of choices, including Dropbox and Google Drive. Tap the one you want, then log in.Manage your sleep settings (if you listen to audiobooks or podcasts) Credit: Screenshot by Joel Cunningham In an effort to use my phone less, I've moved my audiobooks over to my Palma as well (the 128GB of storage comes in handy here). However, I was frustrated with the device as an audio player at first because I use a protective cover, and every time I closed it, it would go to sleep, turning off my audio. I found myself awkwardly trying to slip it into a pocket with the cover folded over, without accidentally touching the screen. Then I discovered there's a setting to fix this (hat tip to Lifehacker reader N33k5 the Zombie Dog Fujin for sharing it in the comments): You need to tell the device not to \"freeze\" your audio apps when the device goes to sleep. To do this, open Settings, tap Apps and Notifications, and scroll down to Freeze Settings. Make sure Do not freeze apps running in the background is set to On. Next, find your audio player apps in the list below (I use Audible, Smart AudioBook Player, and Pocket Casts) and turn the slider to Off. Now your audio will keep playing even after the device goes to sleep.Change your lock screen image and screensaver Credit: Screenshot by Joel Cunningham Boox devices have some handsome preset lock screen images, but if you want to make the device your own, you can set your own screensaver and wallpaper. This one is pretty straightforward: Choose Desktop \u0026 Screensaver in the Settings app—but if you want a custom image, you'll first have to get it saved to the right spot. The easiest way to do this is to find an image you like while browsing the internet using your Boox device. Long press on it and choose Download, which will save it to your downloads folder (naturally). Next, open up the Gallery app, tap your Download folder, and then tap the image you want. In the lower right, tap More and then Set as. You can choose to set it as the Screensaver, the Wallpaper, or the Power-Off image.Alternately, you can plug the device into a computer and manually add the images to your Pictures folder. From there, you can change your wallpaper as described above, or just long press on the home screen and select the Wallpaper icon on the lower right; tap Local to find images saved to your Pictures folder. (And here's another helpful hint: If you want to create your own wallpaper image in Photoshop or Canva, the dimensions are 824x1648 for the Boox Palma. For the Note Max or Note Air 4C, 1404 x 1872 should serve you well.)",
  "image": "https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/hero-image.fill.size_1200x675.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"main\"\u003e\n                            \u003cdiv data-ga-module=\"content-header\" aria-label=\"Content Header\"\u003e\n        \n        \n                    \u003cp\u003eMake your pricey new digital notebook a little easier to use.\u003c/p\u003e\n            \u003c/div\u003e\n            \n            \u003csection data-ga-module=\"content-body\"\u003e\n                            \n                \u003cimg src=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/hero-image.fill.size_1248x702.v1741384850.png\" alt=\"A Boox Note Max, Note Air 4C, and Palma on a table\" width=\"1248\" height=\"702\" srcset=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/hero-image.fill.size_400x225.v1741384850.png 400w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/hero-image.fill.size_800x450.v1741384850.png 800w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/hero-image.fill.size_1248x702.v1741384850.png 1600w\" sizes=\"(max-width: 1280px) 100vw, 1280px\"/\u003e\n                        \u003cp\u003e\u003cspan\u003eCredit: Joel Cunningham\u003c/span\u003e\n                            \u003c/p\u003e\n            \n    \n    \u003carticle data-autopogo=\"\"\u003e\n        \u003chr/\u003e\n        \u003cp\u003eWhile they will never have the name recognition of the Amazon Kindle, e-ink devices from Chinese tech company Onyx International—sold under the slightly silly \u0026#34;Boox\u0026#34; brand name—are gaining a cult following in the U.S. I\u0026#39;ve reviewed three of its e-readers and digital notebooks over the past year, and I\u0026#39;m a huge fan. And if you\u0026#39;re reading this article, you probably are too (or soon will be).\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eI love Boox devices not only because they\u0026#39;re well built and full-featured (though if you want more of my thoughts there, check out my assessments of the \u003ca href=\"https://lifehacker.com/tech/onyx-boox-palma-phone-ereader-review\" target=\"_blank\"\u003eBoox Palma\u003c/a\u003e, \u003ca href=\"https://lifehacker.com/tech/boox-note-max-review\" target=\"_blank\"\u003eNote Max\u003c/a\u003e, and \u003ca href=\"https://lifehacker.com/tech/onyx-boox-note-air-4c-review\" target=\"_blank\"\u003eNote Air 4C\u003c/a\u003e). I also can\u0026#39;t get enough of their customizability. Nothing makes me crazier than trying to do something simple with a device, only to be stymied due to locked down software that doesn\u0026#39;t want to let me. From side-loading books onto a Kindle to doing—well, basically anything unsanctioned on an iPad, big companies seem determined to only let me do with my devices what they want me to do.\u003c/p\u003e\u003cp\u003eBoox devices are different: They run on an open version of Android that lets you do pretty much whatever you want. You can download any app in the Google Play Store, so you aren\u0026#39;t tied to one e-reading platform. If you want to sideload apps, feel free: Plug the device into your laptop and it will mount right to the desktop. If you\u0026#39;re truly ambitious, you can even install your own launcher to completely change things up.\u003c/p\u003e\u003cp\u003eWhile all this freedom is nice, it also means Boox devices have a bit more of a learning curve than, say, a plug-and-read Kindle. So if you are the new owner of one of these fantastic devices—whether an e-reader or a full-fledged digital notebook—here are four settings you should change right away to get the most out of it.\u003c/p\u003e\u003c/div\u003e\u003ch2 id=\"set-a-one-touch-refresh\"\u003eSet a one-touch refresh\u003c/h2\u003e\u003cp\u003eLike any e-ink tablet, Boox devices suffer from occasional \u0026#34;ghosting,\u0026#34; or visible afterimages once you\u0026#39;ve turned a page. While the device will automatically refresh itself after a certain number of taps (touching the screen, basically), I like to set up a one-touch refresh that I can trigger whenever I want to. Depending on your device, there are a few ways to do this: a button or a gesture. \u003c/p\u003e\u003ch3\u003eSetting a manual refresh on a Boox device with buttons\u003c/h3\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-2.fill.size_2000x1125.v1741384850.png\" alt=\"Action button settings on Boox Palma 2\" width=\"2000\" height=\"1125\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-2.fill.size_800x450.v1741384850.png 800w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-2.fill.size_1400x788.v1741384850.png 1400w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-2.fill.size_2000x1125.v1741384850.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Screenshot by Joel Cunningham\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eIf you\u0026#39;ve got a Boox Palma or another device with page turn/volume buttons, you can map one of them to a screen refresh. For the Palma, it makes the most sense to use the Smart Button for this—that\u0026#39;s the button on the left hand side of the device, which can do different things based on whether you press it once, twice, or hold it down. On my own device, I\u0026#39;ve mapped a manual refresh to a single Smart Button press, as it\u0026#39;s the thing I find myself doing most often (that, or returning to the home screen, which is another of the many options you can choose). That said, you can also map a refresh to the volume buttons if you like (though I prefer to use those for page turns).\u003c/p\u003e\u003cp\u003eTo remap your Smart Button, open the settings app and tap \u003cstrong\u003eSmart Button\u003c/strong\u003e. Tap your preferred option (\u003cstrong\u003eShort-press Function\u003c/strong\u003e, \u003cstrong\u003eDouble-click Function\u003c/strong\u003e, or \u003cstrong\u003eLong-press Function\u003c/strong\u003e) and select \u003cstrong\u003eFull-refresh\u003c/strong\u003e.\u003c/p\u003e\u003c/div\u003e\u003ch3\u003eSetting a manual refresh with a gesture\u003c/h3\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-1.fill.size_2000x1125.v1741384850.png\" alt=\"Genture menu on Boox Note Max\" width=\"2000\" height=\"1125\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-1.fill.size_800x450.v1741384850.png 800w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-1.fill.size_1400x788.v1741384850.png 1400w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-1.fill.size_2000x1125.v1741384850.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Screenshot by Joel Cunningham\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eNot all Boox devices have buttons, so if yours doesn\u0026#39;t, you\u0026#39;ll need to map a manual refresh to a gesture. (Though you can also do this on the Palma, if you like.)\u003c/p\u003e\u003cp\u003eTo get started, open Settings and scroll down to \u003cstrong\u003eSystem Navigation\u003c/strong\u003e. Under \u003cstrong\u003eBottom Navigation\u003c/strong\u003e, tap \u003cstrong\u003eMore Settings\u003c/strong\u003e. Choose the area of the screen you\u0026#39;d like to map the refresh to by swiping between the left, center, or right side options. Tap \u003cstrong\u003eCustom\u003c/strong\u003e and then choose \u003cstrong\u003eFull-refresh\u003c/strong\u003e from your list of options.\u003c/p\u003e\u003ch2 id=\"choose-your-cloud-storage-option\"\u003eChoose your cloud storage option\u003c/h2\u003e\u003cp\u003eBoox devices tend to have generous onboard storage, but you\u0026#39;ll get more out of them by linking your preferred cloud storage service on the system level. This will let you move files on and off the device without the need to plug it in to your computer.\u003c/p\u003e\u003cp\u003eTo start, open \u003cstrong\u003eSettings\u003c/strong\u003e, then \u003cstrong\u003eAccounts\u003c/strong\u003e. Tap \u003cstrong\u003eMove to Cloud Storage in Library\u003c/strong\u003e, then select your preferred option from the list. You have a bunch of choices, including Dropbox and Google Drive. Tap the one you want, then log in.\u003c/p\u003e\u003ch2 id=\"manage-your-sleep-settings-if-you-listen-to-audiobooks-or-podcasts\"\u003eManage your sleep settings (if you listen to audiobooks or podcasts)\u003c/h2\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-5.fill.size_2000x1125.v1741471087.png\" alt=\"App Freeze settings menu on Boox Palma\" width=\"2000\" height=\"1125\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-5.fill.size_800x450.v1741471087.png 800w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-5.fill.size_1400x788.v1741471087.png 1400w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-5.fill.size_2000x1125.v1741471087.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Screenshot by Joel Cunningham\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eIn an effort to use my phone less, I\u0026#39;ve moved my audiobooks over to my Palma as well (the 128GB of storage comes in handy here). However, I was frustrated with the device as an audio player at first because I use a protective cover, and every time I closed it, it would go to sleep, turning off my audio. I found myself awkwardly trying to slip it into a pocket with the cover folded over, without accidentally touching the screen. \u003c/p\u003e\u003cp\u003eThen I discovered there\u0026#39;s a setting to fix this (hat tip to Lifehacker reader N33k5 the Zombie Dog Fujin for sharing it in the comments): You need to tell the device not to \u0026#34;freeze\u0026#34; your audio apps when the device goes to sleep. \u003c/p\u003e\u003cp\u003eTo do this, open \u003cstrong\u003eSettings\u003c/strong\u003e, tap \u003cstrong\u003eApps and Notifications\u003c/strong\u003e, and scroll down to \u003cstrong\u003eFreeze Settings\u003c/strong\u003e. Make sure \u003cstrong\u003eDo not freeze apps running in the background\u003c/strong\u003e is set to \u003cstrong\u003eOn\u003c/strong\u003e. Next, find your audio player apps in the list below (I use Audible, Smart AudioBook Player, and Pocket Casts) and \u003cstrong\u003eturn the slider to Off\u003c/strong\u003e. Now your audio will keep playing even after the device goes to sleep.\u003c/p\u003e\u003ch2 id=\"change-your-lock-screen-image-and-screensaver\"\u003eChange your lock screen image and screensaver\u003c/h2\u003e\u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-3.fill.size_2000x1125.v1741384850.png\" alt=\"A wallpaper on a Boox Palma featuring a line drawing of Hobbes from Calvin and Hobbes\" width=\"2000\" height=\"1125\" loading=\"lazy\" srcset=\"https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-3.fill.size_800x450.v1741384850.png 800w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-3.fill.size_1400x788.v1741384850.png 1400w, https://lifehacker.com/imagery/articles/01JNSA07GPVZE03BN7CA3NTZMZ/images-3.fill.size_2000x1125.v1741384850.png 2000w\" sizes=\"(max-width: 1408px) 100vw, 1408px\"/\u003e\n            \u003c/p\u003e\n            \u003cp\u003e\u003cspan\u003e\u003c/span\u003e\n                                        \u003cspan\u003eCredit: Screenshot by Joel Cunningham\u003c/span\u003e\n                    \u003c/p\u003e\n    \u003c/div\u003e\n\u003cp\u003eBoox devices have some handsome preset lock screen images, but if you want to make the device your own, you can set your own screensaver and wallpaper. This one is pretty straightforward: Choose Desktop \u0026amp; Screensaver in the Settings app—but if you want a custom image, you\u0026#39;ll first have to get it saved to the right spot. \u003c/p\u003e\u003cp\u003eThe easiest way to do this is to find an image you like while browsing the internet using your Boox device. Long press on it and choose \u003cstrong\u003eDownload\u003c/strong\u003e, which will save it to your downloads folder (naturally). Next, open up the \u003cstrong\u003eGallery\u003c/strong\u003e app, tap your Download folder, and then tap the image you want. In the lower right, tap More and then Set as. You can choose to set it as the \u003cstrong\u003eScreensaver\u003c/strong\u003e, the \u003cstrong\u003eWallpaper\u003c/strong\u003e, or the \u003cstrong\u003ePower-Off image.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAlternately, you can plug the device into a computer and manually add the images to your \u003cstrong\u003ePictures \u003c/strong\u003efolder. From there, you can change your wallpaper as described above, or just long press on the home screen and select the \u003cstrong\u003eWallpaper\u003c/strong\u003e icon on the lower right; tap \u003cstrong\u003eLocal\u003c/strong\u003e to find images saved to your Pictures folder. (And here\u0026#39;s another helpful hint: If you want to create your own wallpaper image in Photoshop or Canva, the dimensions are 824x1648 for the Boox Palma. For the Note Max or Note Air 4C, 1404 x 1872 should serve you well.)\u003c/p\u003e\n    \u003c/article\u003e\n\n    \n                        \n            \n    \n    \n\n    \n                    \u003c/section\u003e\n\n                            \n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-07T22:00:00Z",
  "modifiedTime": "2025-03-08T21:58:12Z"
}
