{
  "id": "f7c8cc30-e733-4a95-98c5-69bf9ed99938",
  "title": "Google's NotebookLM Now Lets You Customize Its AI Podcasts",
  "link": "https://tech.slashdot.org/story/24/10/17/2248238/googles-notebooklm-now-lets-you-customize-its-ai-podcasts?utm_source=rss1.0mainlinkanon\u0026utm_medium=feed",
  "description": "Google's NotebookLM app has been updated to let you generate custom podcasts from almost any source material. The AI software is also dropping the \"experimental\" tag. Wired reports: To make an AI podcast using NotebookLM, open up the Google Labs website and start a New Notebook. Then, add any source documents you would like to be used for the audio output. These can be anything from files on your computer to YouTube links. Next, when you click on the Notebook guide, you'll now see the option to generate a deep dive as well as the option to customize it first. Choose Customize and add your prompt for how you'd like the AI podcast to come out. The software suggests that you consider what sections of the sources you'd like highlighted, larger topics you want further explored, or different intended audiences who you want the message to reach. One tip [Raiza Martin, who leads the NotebookLM team inside of Google Labs] shares for trying out the new feature is to generate the Audio Overview without changes, and while you're listening to this first iteration, write down any burning questions you have or topics you wish it expanded on. Afterwards, use these notes as a launching pad to create your prompts for NotebookLM and regenerate that AI podcast with your interests in mind. [...] Yes, Google's NotebookLM might flatten the specifics of a big document or get some details mixed up, but being able to generate more personalized podcasts from disparate sources truly does feel like a transformation -- and luckily nothing like turning into a giant bug. You can view some examples of AI-generated podcasts here. Read more of this story at Slashdot.",
  "author": "BeauHD",
  "published": "2024-10-18T00:10:00+00:00",
  "source": "http://rss.slashdot.org/Slashdot/slashdotMain",
  "categories": [
    "ai"
  ],
  "byline": "",
  "length": 1627,
  "excerpt": "Google's NotebookLM app has been updated to let you generate custom podcasts from almost any source material. The AI software is also dropping the \"experimental\" tag. Wired reports: To make an AI podcast using NotebookLM, open up the Google Labs website and start a New Notebook. Then, add any sourc...",
  "siteName": "",
  "favicon": "",
  "text": "Google's NotebookLM app has been updated to let you generate custom podcasts from almost any source material. The AI software is also dropping the \"experimental\" tag. Wired reports: To make an AI podcast using NotebookLM, open up the Google Labs website and start a New Notebook. Then, add any source documents you would like to be used for the audio output. These can be anything from files on your computer to YouTube links. Next, when you click on the Notebook guide, you'll now see the option to generate a deep dive as well as the option to customize it first. Choose Customize and add your prompt for how you'd like the AI podcast to come out. The software suggests that you consider what sections of the sources you'd like highlighted, larger topics you want further explored, or different intended audiences who you want the message to reach. One tip [Raiza Martin, who leads the NotebookLM team inside of Google Labs] shares for trying out the new feature is to generate the Audio Overview without changes, and while you're listening to this first iteration, write down any burning questions you have or topics you wish it expanded on. Afterwards, use these notes as a launching pad to create your prompts for NotebookLM and regenerate that AI podcast with your interests in mind. [...] Yes, Google's NotebookLM might flatten the specifics of a big document or get some details mixed up, but being able to generate more personalized podcasts from disparate sources truly does feel like a transformation -- and luckily nothing like turning into a giant bug. You can view some examples of AI-generated podcasts here.",
  "image": "https://a.fsdn.com/sd/topics/ai_64.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"fhbody-175274423\"\u003e\n\t\n\t\t\n\t\n\n\t\n\t\t\n\t\t\u003cp\u003e\n\t\t\t\n\t\t \t\n\t\t\t\tGoogle\u0026#39;s NotebookLM app has been \u003ca href=\"https://blog.google/technology/ai/notebooklm-update-october-2024/\"\u003eupdated\u003c/a\u003e to let you \u003ca href=\"https://www.wired.com/story/google-notebooklm-customize-ai-podcast/\"\u003egenerate custom podcasts from almost any source material\u003c/a\u003e. The AI software is also dropping the \u0026#34;experimental\u0026#34; tag. Wired reports: \u003ci\u003e To make an AI podcast using \u003ca href=\"https://notebooklm.google/\"\u003eNotebookLM\u003c/a\u003e, open up the Google Labs website and start a New Notebook. Then, add any source documents you would like to be used for the audio output. These can be anything from files on your computer to YouTube links. Next, when you click on the Notebook guide, you\u0026#39;ll now see the option to generate a deep dive as well as the option to customize it first. Choose Customize and add your prompt for how you\u0026#39;d like the AI podcast to come out. The software suggests that you consider what sections of the sources you\u0026#39;d like highlighted, larger topics you want further explored, or different intended audiences who you want the message to reach.\n\u003cp\u003e \nOne tip [Raiza Martin, who leads the NotebookLM team inside of Google Labs] shares for trying out the new feature is to generate the Audio Overview without changes, and while you\u0026#39;re listening to this first iteration, write down any burning questions you have or topics you wish it expanded on. Afterwards, use these notes as a launching pad to create your prompts for NotebookLM and regenerate that AI podcast with your interests in mind. [...] Yes, Google\u0026#39;s NotebookLM might flatten the specifics of a big document or get some details mixed up, but being able to generate more personalized podcasts from disparate sources truly does feel like a transformation -- and luckily nothing like turning into a giant bug. \u003c/p\u003e\u003c/i\u003e You can view some examples of AI-generated podcasts \u003ca href=\"https://slashdot.org/story/24/10/05/0457222/people-are-using-google-study-software-to-make-ai-podcasts\"\u003ehere\u003c/a\u003e.\u003cbr/\u003e\n\t\t \t\n\t\t\u003c/p\u003e\n\n\t\t\n\n\t\t\n\n\t\t\n\t\t\t\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
