{
  "id": "030cd90a-fd64-4609-8759-7be99a113ec5",
  "title": "Dozens of marine mammals found dead after Russian oil tanker spill",
  "link": "https://phys.org/news/2025-01-dozens-marine-mammals-dead-russian.html",
  "description": "Dozens of sea mammals have been found dead since last month's Russian oil tanker spill in the Black Sea, a dolphin rescue center said Sunday, as authorities raced to contain the disaster.",
  "author": "",
  "published": "Sun, 05 Jan 2025 15:01:52 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Environment"
  ],
  "byline": "Science X",
  "length": 2841,
  "excerpt": "Dozens of sea mammals have been found dead since last month's Russian oil tanker spill in the Black Sea, a dolphin rescue center said Sunday, as authorities raced to contain the disaster.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Oil spill in the Kerch Strait. Dozens of sea mammals have been found dead since last month's Russian oil tanker spill in the Black Sea, a dolphin rescue center said Sunday, as authorities raced to contain the disaster. The spill began on December 15, when two aging Russian tankers were caught in a storm off the Kerch Strait linking Crimea to southern Russia. One sank and the other ran aground, pouring around 2,400 tonnes of a heavy fuel oil called mazut into the surrounding waters, authorities estimate. Russia's Delfa center, which rescues and rehabilitates dolphins, said it had recorded 61 dead cetaceans since the incident, 32 of whom \"most likely\" died due to the spill. Cetaceans are a type of aquatic mammal that includes whales, dolphins and porpoises. \"Judging by the condition of the bodies, most likely the bulk of these cetaceans died in the first 10 days after the disaster,\" it said on Telegram. It said most of those killed were \"Azov\" dolphins—a type of harbor porpoise that look similar to dolphins but are more closely related to belugas and narwhals. Russia's emergency ministry said Sunday it was working to clean up after the incident, but that \"strong winds and waves\" had thrown oil onto some beaches. \"More than 68 kilometers (42 miles) of coastline have been cleaned,\" it said. Russia's emergencies ministries has been organizing beach clean-ups since last month. In a further statement Sunday, the ministry said two new oil slicks had been discovered. One was off the seaside resort of Anapa and the other in the bay of Kapsel, it said in a statement cited by the Russian news agency TASS. The news agency said the second slick was two kilometers long. Hundreds of volunteers have been deployed to scoop up contaminated soil from beaches in Crimea and along Russia's southern coast. The type of fuel oil involved in the incident is particularly hard to clean because it is dense and heavy and does not float on the surface, Russian authorities say. © 2025 AFP Citation: Dozens of marine mammals found dead after Russian oil tanker spill (2025, January 5) retrieved 5 January 2025 from https://phys.org/news/2025-01-dozens-marine-mammals-dead-russian.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/oil-spill-in-the-kerch.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/oil-spill-in-the-kerch.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/oil-spill-in-the-kerch.jpg\" data-sub-html=\"Oil spill in the Kerch Strait.\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/oil-spill-in-the-kerch.jpg\" alt=\"Oil spill in the Kerch Strait\" title=\"Oil spill in the Kerch Strait.\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Oil spill in the Kerch Strait.\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eDozens of sea mammals have been found dead since last month\u0026#39;s Russian oil tanker spill in the Black Sea, a dolphin rescue center said Sunday, as authorities raced to contain the disaster.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe spill began on December 15, when two aging Russian tankers were caught in a storm off the Kerch Strait linking Crimea to southern Russia.\u003c/p\u003e\n\u003cp\u003eOne sank and the other ran aground, pouring around 2,400 tonnes of a heavy fuel oil called mazut into the surrounding waters, authorities estimate.\u003c/p\u003e\n\u003cp\u003eRussia\u0026#39;s Delfa center, which rescues and rehabilitates dolphins, said it had recorded 61 dead cetaceans since the incident, 32 of whom \u0026#34;most likely\u0026#34; died due to the spill.\u003c/p\u003e\n\u003cp\u003eCetaceans are a type of aquatic mammal that includes whales, dolphins and porpoises.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Judging by the condition of the bodies, most likely the bulk of these cetaceans died in the first 10 days after the disaster,\u0026#34; it said on Telegram.\u003c/p\u003e\n\u003cp\u003eIt said most of those killed were \u0026#34;Azov\u0026#34; dolphins—a type of harbor porpoise that look similar to dolphins but are more closely related to belugas and narwhals.\u003c/p\u003e\n\u003cp\u003eRussia\u0026#39;s emergency ministry said Sunday it was working to clean up after the incident, but that \u0026#34;\u003ca href=\"https://phys.org/tags/strong+winds/\" rel=\"tag\"\u003estrong winds\u003c/a\u003e and waves\u0026#34; had thrown oil onto some beaches.\u003c/p\u003e\n\u003cp\u003e\u0026#34;More than 68 kilometers (42 miles) of coastline have been cleaned,\u0026#34; it said.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/russias-emergencies-mi.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/russias-emergencies-mi.jpg\" data-sub-html=\"Russia\u0026#39;s emergencies ministries has been organizing beach clean-ups since last month.\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/russias-emergencies-mi.jpg\" alt=\"Russia\u0026#39;s emergencies ministries has been organising beach clean-ups since last month\" title=\"Russia\u0026#39;s emergencies ministries has been organizing beach clean-ups since last month.\"/\u003e\n             \u003cfigcaption\u003e\n                Russia\u0026#39;s emergencies ministries has been organizing beach clean-ups since last month.\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eIn a further statement Sunday, the ministry said two new oil slicks had been discovered.\u003c/p\u003e\n\u003cp\u003eOne was off the seaside resort of Anapa and the other in the bay of Kapsel, it said in a statement cited by the Russian news agency TASS.\u003c/p\u003e\n\u003cp\u003eThe news agency said the second slick was two kilometers long.\u003c/p\u003e\n\u003cp\u003eHundreds of volunteers have been deployed to scoop up \u003ca href=\"https://phys.org/tags/contaminated+soil/\" rel=\"tag\"\u003econtaminated soil\u003c/a\u003e from beaches in Crimea and along Russia\u0026#39;s southern coast.\u003c/p\u003e\n\u003cp\u003eThe type of fuel oil involved in the incident is particularly hard to clean because it is dense and heavy and does not float on the surface, Russian authorities say.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  © 2025 AFP\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tDozens of marine mammals found dead after Russian oil tanker spill (2025, January 5)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 5 January 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-01-dozens-marine-mammals-dead-russian.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-05T15:01:52-05:00",
  "modifiedTime": null
}
