{
  "id": "0aec15ac-635b-43c7-9af5-f3e13eb6bc3e",
  "title": "Indigenous People Mix Ancient and Modern Science to Protect Salmon and Bears",
  "link": "https://www.scientificamerican.com/article/indigenous-people-mix-ancient-and-modern-science-to-protect-salmon-and-bears/",
  "description": "The Heiltsuk of British Columbia are using a mix of traditional principles and modern implementation to protect salmon and bears in their territory",
  "author": "",
  "published": "Tue, 22 Oct 2024 11:30:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Jane Palmer",
  "length": 14679,
  "excerpt": "The Heiltsuk of British Columbia are using a mix of traditional principles and modern implementation to protect salmon and bears in their territory",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "William Housty's grandparents taught him the sacred duty of preparing for the salmon's arrival each year. Before the first silver flashes appeared in the creek, his grandfather — following the wisdom passed down from his own elders — would clear woody debris, chase away seals, and maybe even fell a few trees to ensure a waterway was ready.\"They saw it as their responsibility to roll out a red carpet for the salmon because of their immense importance to us,\" said Dúqva̓ísḷa William Housty, a member of the Heiltsuk Nation of British Columbia's central coast.This practice ensured that the salmon, the ecosystem and their community could thrive together, said Housty, who is director of the Heiltsuk Integrated Resource Management Department (HIRMD), which manages resources in their traditional territory.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.Welcoming the salmon is just one example of the way the Heiltsuk's ancestral laws, or \"Ǧvi̓ḷás — a set of principles centered on respect, responsibility, reciprocity and stewardship for all sentient beings — have shaped their interaction with their environment.Now, the Heiltsuk are using traditional knowledge in concert with modern scientific approaches to monitor wildlife, count salmon, and maintain the health of waterways in their traditional territory. From the outset, the HIRMD stewards decided that Ǧvi̓ḷás would guide how they managed their resources, as well as influence how they would work with other government offices, industry or other outside parties.This has led the Heiltsuk to braid relatively new techniques, like DNA analysis, with ancient ones, like the use of traditional fish weirs, so they can study — but not impact — the ecosystem. Their work has revealed shifting bear habitats and climate change impacts on salmon. Both have led to increased protections for creatures that are critical to the ecosystem.\"We're going back to the value system that our ancestors implemented for thousands of years,\" Housty told Live Science. \"In our eyes, it is for the betterment of everything.\"A Symbiotic RelationshipThe Heiltsuk have lived in the diverse coastal rainforests, islands and marine areas of their traditional territory for more than 14,000 years. Over that time, they passed on ancestral knowledge of how to care for and enhance the natural resources they depended on.In the mid-1800s, however, the British colonial government asserted control over Indigenous lands. In the following decades, deforestation, overfishing and pollution led to a marked decline in the richness of life.\"Take a look out there — it's beautiful,\" Housty said, pointing to the shimmering ocean water west of Bella Bella, the central community of the Heiltsuk Nation. \"But when you go underwater, it's a different story — so many resources have been depleted to the extent that some of them have gone extinct.\"For instance, commercial fishing has led to drastic declines in Pacific herring (Clupea pallasii), eulachon (Thaleichthys pacificus) and Northern abalone (Haliotis kamtschatkana). Some salmon that once thrived in the rivers and streams around Bella Bella have disappeared. A view of the Great Bear Rainforest, seen from a mountaintop above the Heiltsuk First Nation town of Bella Bella, British Columbia, Canada. John Zada/Alamy Stock Photo Government officials, forest companies and academia have their own agendas, said Q̓íx̌itasu Elroy White, an archaeologist who works part time for HIRMD. \"It was often based on greed, commercial enterprise, and academic privilege and perspective,\" White said.This contradicted the Heiltsuk way of living in harmony with the environment, in which they take only what they need to ensure a sustainable supply of resources for future generations.Protecting the bearsFor many decades after colonization, federal and provincial agencies controlled fishing quotas, logging operations and other resource management decisions that directly affected the Heiltsuk. However, that started to change in the 1990s, and a small team of Heiltsuk began doing field assessments on the health of the streams and salmon in the Koeye watershed, 34 miles (55 kilometers) southeast of Bella Bella. The team presented data to the Heiltsuk land use committee, which would use that information to craft conservation management plans. One key goal was to protect grizzly bear (Ursus arctos horribilis) habitat.If \"you protect grizzly bear habitat, you're protecting black bear habitat, wolf habitat, deer habitat and many other species,\" Housty said. \"When you have lots of bears, it means you have a healthy ecosystem.\"The Heiltsuk began monitoring bears directly in the Koeye watershed in the early 2000s.The number of Heiltsuk researchers grew, and in 2010, the Heiltsuk formed HIRMD. That same year, they partnered with University of Victoria wildlife scientist Chris Darimont, who is also the science director at the Raincoast Conservation Foundation, and his graduate students. The academic team expanded the monitoring across a larger region of the Heiltsuk territory in a way that aligned with Heiltsuk values.\"A lot of the concepts were relational in that they were about how wildlife were like relatives to the Heiltsuk,\" Darimont said, \"and ought to be treated accordingly.\"Instead of catching grizzlies, sedating them and attaching tracking collars to them, which eventually fall off, the researchers took an entirely different approach: They created knee-high salmon-scented bear snares — barbed wire corrals around trees — and set 30 in the Koeye and more than 100 throughout the larger study area. Lured to the smell, the bears left hair samples, and the Heiltsuk used their DNA to track their movements. The noninvasive method didn't disrupt the bears' usual habits; the bait provided no rewards to the bears, so the grizzlies didn't become dependent on the snares for food. A field researcher collects a hair sample for a DNA study about grizzly bears in the Great Bear Rainforest, in British Columbia, Canada. John Zada/Alamy Stock Photo Monitoring the bears, collecting scientific data and collaborating with academic scientists are proving critical to the Heiltsuk's involvement in management decisions, Housty said. Historically, when they didn't have the scientific resources, government organizations controlled the management of natural resources. \"It is our partnerships and the science that has really given us the legs to stand on for joint management,\" Housty said.The collaborations have helped the Heiltsuk identify bears on islands outside their traditional range and have pinpointed crucial corridors the bears use to move between feeding areas, according to new research that is under review for publication. Such findings have led to greater protection for bear habitats and will continue to do so, Darimont said.The Heiltsuk stewardship principles often contrast with dominant government-led conservation approaches, which may suggest that hunting grizzly populations is acceptable when the numbers are sustainable. Seeing wildlife as a natural resource to be managed by humans is incorrect and unethical, Housty said. Even a single individual killed by trophy hunters is unacceptable, he said. \"It violates our law regarding respect and reciprocity to the bears,\" Housty said.In 2017, after gauging the broader public's views and listening to Indigenous perspectives, the British Columbia government ended trophy hunting of all grizzlies throughout the province.Grizzlies feed on salmon during the spawning season, leaving the carcasses, skin, bones and leftover flesh to enrich forest soils and feed aquatic invertebrates, which, in turn, support juvenile salmon during their early life stages. Therefore, the ban on trophy hunting did more than benefit the bears; it strengthened the territory's salmon systems, Housty said.Salmon stewardshipEach fall, Howard Humchitt and Lenard Stewart visit some of the many rivers on their territory, walking upstream to check salmon spawning habitats. They are Heiltsuk Coastal Guardian Watchmen, employed by HIRMD to take on many roles, from preparing for the salmon's return to monitoring the populations of chum salmon (Oncorhynchus keta) and pink salmon (Oncorhynchus gorbuscha).Over the years, the watchmen have seen certain types of salmon diminish. Last year, the watchmen counted 7,000 salmon returning to a particular river system where they used to count tens of thousands. \"When our fathers were kids, that same river probably had 100,000 salmon in it,\" Humchitt told Live Science.The Heiltsuk historically used ancestral technologies such as fish weirs. These traps were made of wooden stakes driven into a river, which created a semipermeable barrier that directed salmon into a holding area as they swam upstream. The Heiltsuk also used stone fish traps — miniature stone walls that stretch across tidal inlets. Fish swam through high gaps in the walls and, when the tide receded, were trapped. However, the Canadian government outlawed such practices in the late 19th and early 20th centuries because officials believed the traps harmed fish stocks. But both technologies allowed the Heiltsuk to selectively harvest fish, so the best fish for breeding could go upstream and spawn. Having reliable fish counts can also prevent over-harvesting.These systems have historically kept fish stocks stable, said William Atlas, a salmon watershed scientist at the Wild Salmon Center in Portland, Oregon. \"Prior to the arrival of European colonists, there's probably about 7,000 or 8,000 years of successful stewardship of salmon harvesting,\" Atlas said.In the mid-19th century, however, the colonial government of Canada took over fisheries management. Since then, overfishing, habitat destruction and nonlocal management have led to crashes in catches of salmon and herring in British Columbia. Several Chinook salmon (Oncorhynchus tshawytscha) populations in the province are at risk of extinction, and many coho salmon (Oncorhynchus kisutch) runs — migratory populations of a specific river system — are endangered. Atlas, along with Indigenous colleagues, has called for the revitalization of Indigenous fisheries by supporting the sustainable management practices of coastal First Nations. An 1882 illustration shows a salmon weir at Quamichan Village on the Cowichan River on Vancouver Island, Canada. Penta Springs Limited/Alamy Stock Photo In recent years, some coastal First Nations, including the Heiltsuk, have regained a stake in the management of their fisheries. Collecting data on their marine resources continues to be important to the Heiltsuk.\"Knowledge is power when it comes to ecosystems,\" Atlas said. \"Having numerical values and abundance estimates of how many salmon are returning gives them authority when it comes to co-governance and decision-making.\"To this end, the Heiltsuk have been monitoring and researching the current state of salmon systems in the territory to learn what it takes to sustain them. They also collaborate with scientists to collect data when necessary. It's logistically challenging to count sockeye salmon (Oncorhynchus nerka), as they spawn high up in river systems, typically above a lake. So the HIRMD researchers partnered with Atlas and his colleagues to monitor these populations, using an approach that braids Heiltsuk traditions in salmon stewardship with modern science.Starting in 2013, the collaborators began using a fish weir made from locally harvested cedar logs to help them capture and tag around 500 sockeye salmon each year in the Koeye watershed. The researchers count the outgoing smolts — the young salmon swimming downstream on their way to the sea — and then install the weir, now made of aluminum, at the beginning of June and begin counting the incoming adults. During the salmon's brief capture, the team takes genetic samples from the fish so that when they are caught in the ocean, scientists can identify the salmon's population of origin.Each year, the collaborators report sockeye numbers for five or more populations in the territory. The Heiltsuk can then share this information with Fisheries and Oceans Canada (DFO), the government agency that has historically set fishing quotas for commercial, recreational and Indigenous fishing in British Columbia.\"That creates a bit of a reversal in the power dynamic that we've historically seen, where the DFO is the broker of the truth,\" Atlas said.Planning for the futureLooking out for future generations and acknowledging humans' role in ecosystems are core principles of the Heiltsuk's Ǧvi̓ḷás. Early in their conservation efforts, the Heiltsuk devised a 1,000-year natural resources management plan.\"Our goal is to live sustainably, so we can ensure an abundance of resources not only for my generation but for those to follow,\" Housty said. \"We've been here since the beginning, and the long-term plan is to stay until the end — if there is ever an end.\"Ǧvi̓ḷás also emphasize that humans are as responsible for caring for their territory as they are for their own homes. To uphold their stewardship practices, the Heiltsuk educate their children on their culture, fostering a connection with the natural world from an early age. The Qqs Projects Society, a Heiltsuk nonprofit in Bella Bella, supports youth, culture and the environment, offering programs to strengthen bonds with Heiltsuk lands and waters.\"We want our youth to feel connected to their territory because it's an intrinsic part of their identity,\" said Cúagilákv Jess Housty, executive director of the Qqs Projects Society. \"And we want them to love it, because we know if they love it, they will protect it.\"One goal is to demonstrate how humans can contribute positively to ecosystems. This requires embracing the Heiltsuk understanding that humans are not separate from their environment. Elders would tell Housty that the Heiltsuk didn't own their territory; it belonged to the animals and fish. That means that the Heiltsuk have a responsibility to take care of the creatures in their territory, William Housty said. \"That's a far different mindset from viewing the land in terms of how much we can take,\" he said.Reporting and travel for this story was supported by the Sitka Foundation and the Science Media Centre of Canada.Copyright 2024 Live Science, a Future company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
  "image": "https://static.scientificamerican.com/dam/m/61340be4c4a3ab83/original/grizzly_bear_with_cub_eating_salmon_in_great_bear_rainforest.jpg?w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.linkedin.com/in/william-housty-04814b230/?originalSubdomain=ca\"\u003eWilliam Housty\u003c/a\u003e\u0026#39;s grandparents taught him the sacred duty of preparing for the salmon\u0026#39;s arrival each year. Before the first silver flashes appeared in the creek, his grandfather — following the wisdom passed down from his own elders — would clear woody debris, chase away seals, and maybe even fell a few trees to ensure a waterway was ready.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;They saw it as their responsibility to roll out a red carpet for the salmon because of their immense importance to us,\u0026#34; said Dúqva̓ísḷa William Housty, a member of the Heiltsuk Nation of British Columbia\u0026#39;s central coast.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis practice ensured that the salmon, the ecosystem and their community could thrive together, said Housty, who is director of the \u003ca href=\"https://www.hirmd.ca/\"\u003eHeiltsuk Integrated Resource Management Department (HIRMD)\u003c/a\u003e, which manages resources in their traditional territory.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWelcoming the salmon is just one example of the way the Heiltsuk\u0026#39;s ancestral laws, or \u0026#34;Ǧvi̓ḷás — a set of principles centered on respect, responsibility, reciprocity and stewardship for all sentient beings — have shaped their interaction with their environment.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNow, the Heiltsuk are using traditional knowledge in concert with modern scientific approaches to monitor wildlife, count salmon, and maintain the health of waterways in their traditional territory. From the outset, the HIRMD stewards decided that Ǧvi̓ḷás would guide how they managed their resources, as well as influence how they would work with other government offices, industry or other outside parties.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis has led the Heiltsuk to braid relatively new techniques, like DNA analysis, with ancient ones, like the use of traditional fish weirs, so they can study — but not impact — the ecosystem. Their work has revealed shifting bear habitats and climate change impacts on salmon. Both have led to increased protections for creatures that are critical to the ecosystem.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;We\u0026#39;re going back to the value system that our ancestors implemented for thousands of years,\u0026#34; Housty told Live Science. \u0026#34;In our eyes, it is for the betterment of everything.\u0026#34;\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eA Symbiotic Relationship\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Heiltsuk have lived in the diverse coastal rainforests, islands and marine areas of their traditional territory for more than \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S2352409X23000597\"\u003e14,000 years\u003c/a\u003e. Over that time, they passed on ancestral knowledge of how to care for and enhance the natural resources they depended on.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn the mid-1800s, however, the British colonial government asserted control over Indigenous lands. In the following decades, deforestation, overfishing and pollution led to a marked decline in the richness of life.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Take a look out there — it\u0026#39;s beautiful,\u0026#34; Housty said, pointing to the shimmering ocean water west of Bella Bella, the central community of the Heiltsuk Nation. \u0026#34;But when you go underwater, it\u0026#39;s a different story — so many resources have been depleted to the extent that some of them have gone extinct.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eFor instance, commercial fishing has led to drastic declines in Pacific herring (\u003ci\u003eClupea pallasii\u003c/i\u003e), eulachon (\u003ci\u003eThaleichthys pacificus\u003c/i\u003e) and Northern abalone (\u003ci\u003eHaliotis kamtschatkana\u003c/i\u003e). Some salmon that once thrived in the rivers and streams around Bella Bella have disappeared.\u003c/p\u003e\u003cfigure data-original-class=\"cms-image\" data-block=\"sciam/image\"\u003e\u003ca aria-label=\"Open image in new tab\" href=\"https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=2000\" target=\"_blank\"\u003e\u003cpicture\u003e\n\u003csource media=\"(min-width: 0px)\" sizes=\"(min-width: 900px) 900px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\" srcset=\"https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=600 600w, https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=750 750w, https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=900 900w, https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=1000 1000w, https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=1200 1200w, https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=1350 1350w\"/\u003e\n\u003cimg alt=\"View of Great Bear Rainforest photographed from a mountain above Bella Bella, in Heiltsuk territory, British Columbia, Canada, looking over the water towards the mainland\" decoding=\"async\" height=\"1920\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/315cb64d39e2ab75/original/view_of_great_bear_rainforest_heiltsuk_territory.jpg?w=900\" width=\"2900\"/\u003e\n\u003c/picture\u003e\u003c/a\u003e\n\u003cfigcaption\u003e\n\u003cp\u003eA view of the Great Bear Rainforest, seen from a mountaintop above the Heiltsuk First Nation town of Bella Bella, British Columbia, Canada.\u003c/p\u003e\n\u003cp\u003eJohn Zada/Alamy Stock Photo\u003c/p\u003e\n\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eGovernment officials, forest companies and academia have their own agendas, said \u003ca href=\"https://www.sfu.ca/archaeology/engagement/our-alumni/alum-white.html\"\u003eQ̓íx̌itasu Elroy White\u003c/a\u003e, an archaeologist who works part time for HIRMD. \u0026#34;It was often based on greed, commercial enterprise, and academic privilege and perspective,\u0026#34; White said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis contradicted the Heiltsuk way of living in harmony with the environment, in which they take only what they need to ensure a sustainable supply of resources for future generations.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eProtecting the bears\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eFor many decades after colonization, federal and provincial agencies controlled fishing quotas, logging operations and other resource management decisions that directly affected the Heiltsuk. However, that started to change in the 1990s, and a small team of Heiltsuk began doing field assessments on the health of the streams and salmon in the Koeye watershed, 34 miles (55 kilometers) southeast of Bella Bella. The team presented data to the Heiltsuk land use committee, which would use that information to craft conservation management plans. One key goal was to protect grizzly bear (\u003ci\u003eUrsus arctos horribilis\u003c/i\u003e) habitat.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf \u0026#34;you protect grizzly bear habitat, you\u0026#39;re protecting black bear habitat, wolf habitat, deer habitat and many other species,\u0026#34; Housty said. \u0026#34;When you have lots of bears, it means you have a healthy ecosystem.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Heiltsuk began monitoring bears directly in the Koeye watershed in the early 2000s.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe number of Heiltsuk researchers grew, and in 2010, the Heiltsuk formed HIRMD. That same year, they partnered with University of Victoria wildlife scientist \u003ca href=\"https://conservationscience.uvic.ca/\"\u003eChris Darimont\u003c/a\u003e, who is also the science director at the \u003ca href=\"https://www.raincoast.org/\"\u003eRaincoast Conservation Foundation\u003c/a\u003e, and his graduate students. The academic team expanded the monitoring across a larger region of the Heiltsuk territory in a way that aligned with Heiltsuk values.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;A lot of the concepts were relational in that they were about how wildlife were like relatives to the Heiltsuk,\u0026#34; Darimont said, \u0026#34;and ought to be treated accordingly.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eInstead of catching grizzlies, sedating them and attaching tracking collars to them, which eventually fall off, the researchers took an entirely \u003ca href=\"https://www.wellbeingintlstudiesrepository.org/wilpman/10/\"\u003edifferent approach\u003c/a\u003e: They created knee-high salmon-scented bear snares — barbed wire corrals around trees — and set 30 in the Koeye and more than 100 throughout the larger study area. Lured to the smell, the bears left hair samples, and the Heiltsuk used their DNA to track their movements. The noninvasive method didn\u0026#39;t disrupt the bears\u0026#39; usual habits; the bait provided no rewards to the bears, so the grizzlies didn\u0026#39;t become dependent on the snares for food.\u003c/p\u003e\u003cfigure data-original-class=\"cms-image\" data-block=\"sciam/image\"\u003e\u003ca aria-label=\"Open image in new tab\" href=\"https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=2000\" target=\"_blank\"\u003e\u003cpicture\u003e\n\u003csource media=\"(min-width: 0px)\" sizes=\"(min-width: 900px) 900px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\" srcset=\"https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=600 600w, https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=750 750w, https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=900 900w, https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=1000 1000w, https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=1200 1200w, https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=1350 1350w\"/\u003e\n\u003cimg alt=\"A field researcher wearing disposable gloves collecting a hair sample from a barbed wire snare for a scientific DNA study about grizzly bears in the Great Bear Rainforest, in British Columbia, Canada\" decoding=\"async\" height=\"1920\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/5bd9a9e7d5712bf5/original/field_researcher_collects_bear_hair.jpg?w=900\" width=\"2880\"/\u003e\n\u003c/picture\u003e\u003c/a\u003e\n\u003cfigcaption\u003e\n\u003cp\u003eA field researcher collects a hair sample for a DNA study about grizzly bears in the Great Bear Rainforest, in British Columbia, Canada.\u003c/p\u003e\n\u003cp\u003eJohn Zada/Alamy Stock Photo\u003c/p\u003e\n\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMonitoring the bears, collecting scientific data and collaborating with academic scientists are proving critical to the Heiltsuk\u0026#39;s involvement in management decisions, Housty said. Historically, when they didn\u0026#39;t have the scientific resources, government organizations controlled the management of natural resources. \u0026#34;It is our partnerships and the science that has really given us the legs to stand on for joint management,\u0026#34; Housty said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe collaborations have helped the Heiltsuk \u003ca href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0101595\"\u003eidentify bears\u003c/a\u003e on islands outside their traditional range and have pinpointed crucial corridors the bears use to move between feeding areas, according to new research that is under review for publication. Such findings have led to greater protection for bear habitats and will continue to do so, Darimont said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Heiltsuk stewardship principles often contrast with \u003ca href=\"https://www.tandfonline.com/doi/full/10.1080/21550085.2021.2002624#abstract\"\u003edominant government-led conservation approaches\u003c/a\u003e, which may suggest that hunting grizzly populations is acceptable when the numbers are sustainable. Seeing wildlife as a natural resource to be managed by humans is incorrect and unethical, Housty said. Even a single individual killed by trophy hunters is unacceptable, he said. \u0026#34;It violates our law regarding respect and reciprocity to the bears,\u0026#34; Housty said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn 2017, after gauging the broader public\u0026#39;s views and listening to Indigenous perspectives, the \u003ca href=\"https://news.gov.bc.ca/releases/2017FLNR0372-002065\"\u003eBritish Columbia government ended trophy hunting of all grizzlies throughout the province.\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eGrizzlies feed on salmon during the spawning season, leaving the carcasses, skin, bones and leftover flesh to enrich forest soils and feed aquatic invertebrates, which, in turn, support juvenile salmon during their early life stages. Therefore, the ban on trophy hunting did more than benefit the bears; it strengthened the territory\u0026#39;s salmon systems, Housty said.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eSalmon stewardship\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eEach fall, Howard Humchitt and Lenard Stewart visit some of the many rivers on their territory, walking upstream to check salmon spawning habitats. They are \u003ca href=\"https://coastalfirstnations.ca/cfn-locations/heiltsuk-2/\"\u003eHeiltsuk Coastal Guardian Watchmen\u003c/a\u003e, employed by HIRMD to take on many roles, from preparing for the salmon\u0026#39;s return to monitoring the populations of chum salmon (\u003ci\u003eOncorhynchus keta\u003c/i\u003e) and pink salmon (\u003ci\u003eOncorhynchus gorbuscha\u003c/i\u003e).\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOver the years, the watchmen have seen certain types of salmon diminish. Last year, the watchmen counted 7,000 salmon returning to a particular river system where they used to count tens of thousands. \u0026#34;When our fathers were kids, that same river probably had 100,000 salmon in it,\u0026#34; Humchitt told Live Science.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Heiltsuk historically used ancestral technologies such as fish weirs. These traps were made of wooden stakes driven into a river, which created a semipermeable barrier that directed salmon into a holding area as they swam upstream. The Heiltsuk also used \u003ca href=\"https://summit.sfu.ca/_flysystem/fedora/sfu_migrate/4240/etd2518.pdf\"\u003estone fish traps\u003c/a\u003e — miniature stone walls that stretch across tidal inlets. Fish swam through high gaps in the walls and, when the tide receded, were trapped. However, the Canadian government outlawed such practices in the late 19th and early 20th centuries because officials believed the traps harmed fish stocks. But both technologies allowed the Heiltsuk to selectively harvest fish, so the best fish for breeding could go upstream and spawn. Having reliable fish counts can also prevent over-harvesting.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThese systems have historically kept fish stocks stable, said \u003ca href=\"https://wildsalmoncenter.org/2020/08/05/welcome-dr-will-atlas/\"\u003eWilliam Atlas\u003c/a\u003e, a salmon watershed scientist at the \u003ca href=\"https://wildsalmoncenter.org/\"\u003eWild Salmon Center\u003c/a\u003e in Portland, Oregon. \u0026#34;Prior to the arrival of European colonists, there\u0026#39;s probably about 7,000 or 8,000 years of successful stewardship of salmon harvesting,\u0026#34; Atlas said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn the mid-19th century, however, the colonial government of Canada took over fisheries management. Since then, overfishing, habitat destruction and nonlocal management have led to crashes in catches of salmon and herring in British Columbia. Several Chinook salmon (\u003ci\u003eOncorhynchus tshawytscha\u003c/i\u003e) populations in the province are at risk of extinction, and many coho salmon (\u003ci\u003eOncorhynchus kisutch\u003c/i\u003e) runs — migratory populations of a specific river system — are endangered. Atlas, along with Indigenous colleagues, has \u003ca href=\"https://academic.oup.com/bioscience/article/71/2/186/6028542\"\u003ecalled for\u003c/a\u003e the revitalization of Indigenous fisheries by supporting the sustainable management practices of coastal First Nations.\u003c/p\u003e\u003cfigure data-original-class=\"cms-image\" data-block=\"sciam/image\"\u003e\u003ca aria-label=\"Open image in new tab\" href=\"https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=2000\" target=\"_blank\"\u003e\u003cpicture\u003e\n\u003csource media=\"(min-width: 0px)\" sizes=\"(min-width: 900px) 900px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\" srcset=\"https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=600 600w, https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=750 750w, https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=900 900w, https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=1000 1000w, https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=1200 1200w, https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=1350 1350w\"/\u003e\n\u003cimg alt=\"An 1882 illustration of a salmon weir at Quamichan Village on the Cowichan River, Vancouver Island, Canada. The weir is made from timber, a canoe rests on the river\u0026#39;s edge in the foreground and a person stands in the middle of the weir\" decoding=\"async\" height=\"1980\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/365ad16fb2577416/original/historical_salmon_weir_illustration.jpg?w=900\" width=\"3975\"/\u003e\n\u003c/picture\u003e\u003c/a\u003e\n\u003cfigcaption\u003e\n\u003cp\u003eAn 1882 illustration shows a salmon weir at Quamichan Village on the Cowichan River on Vancouver Island, Canada.\u003c/p\u003e\n\u003cp\u003ePenta Springs Limited/Alamy Stock Photo\u003c/p\u003e\n\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn recent years, some coastal First Nations, including the Heiltsuk, have regained a stake in the management of their fisheries. Collecting data on their marine resources continues to be important to the Heiltsuk.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Knowledge is power when it comes to ecosystems,\u0026#34; Atlas said. \u0026#34;Having numerical values and abundance estimates of how many salmon are returning gives them authority when it comes to co-governance and decision-making.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTo this end, the Heiltsuk have been monitoring and researching the current state of salmon systems in the territory to learn what it takes to sustain them. They also collaborate with scientists to collect data when necessary. It\u0026#39;s logistically challenging to count sockeye salmon (\u003ci\u003eOncorhynchus nerka\u003c/i\u003e), as they spawn high up in river systems, typically above a lake. So the HIRMD researchers partnered with Atlas and his colleagues to monitor these populations, using an approach that braids Heiltsuk traditions in salmon stewardship with modern science.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eStarting in 2013, \u003ca href=\"https://www.tandfonline.com/doi/full/10.1080/20964129.2017.1341284\"\u003ethe collaborators began using a fish weir\u003c/a\u003e made from locally harvested cedar logs to help them capture and tag around 500 sockeye salmon each year in the Koeye watershed. The researchers count the outgoing smolts — the young salmon swimming downstream on their way to the sea — and then install the weir, now made of aluminum, at the beginning of June and begin counting the incoming adults. During the salmon\u0026#39;s brief capture, the team takes genetic samples from the fish so that when they are caught in the ocean, scientists can identify the salmon\u0026#39;s population of origin.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eEach year, the collaborators report sockeye numbers for five or more populations in the territory. The Heiltsuk can then share this information with Fisheries and Oceans Canada (DFO), the government agency that has historically set fishing quotas for commercial, recreational and Indigenous fishing in British Columbia.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;That creates a bit of a reversal in the power dynamic that we\u0026#39;ve historically seen, where the DFO is the broker of the truth,\u0026#34; Atlas said.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003ePlanning for the future\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eLooking out for future generations and acknowledging humans\u0026#39; role in ecosystems are core principles of the Heiltsuk\u0026#39;s Ǧvi̓ḷás. Early in their conservation efforts, the Heiltsuk devised a 1,000-year natural resources management plan.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Our goal is to live sustainably, so we can ensure an abundance of resources not only for my generation but for those to follow,\u0026#34; Housty said. \u0026#34;We\u0026#39;ve been here since the beginning, and the long-term plan is to stay until the end — if there is ever an end.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eǦvi̓ḷás also emphasize that humans are as responsible for caring for their territory as they are for their own homes. To uphold their stewardship practices, the Heiltsuk educate their children on their culture, fostering a connection with the natural world from an early age. The \u003ca href=\"https://www.qqsprojects.org/\"\u003eQqs Projects Society\u003c/a\u003e, a Heiltsuk nonprofit in Bella Bella, supports youth, culture and the environment, offering programs to strengthen bonds with Heiltsuk lands and waters.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;We want our youth to feel connected to their territory because it\u0026#39;s an intrinsic part of their identity,\u0026#34; said Cúagilákv \u003ca href=\"https://www.jesshousty.com/\"\u003eJess Housty\u003c/a\u003e, executive director of the Qqs Projects Society. \u0026#34;And we want them to love it, because we know if they love it, they will protect it.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOne goal is to demonstrate how humans can contribute positively to ecosystems. This requires embracing the Heiltsuk understanding that humans are not separate from their environment. Elders would tell Housty that the Heiltsuk didn\u0026#39;t own their territory; it belonged to the animals and fish. That means that the Heiltsuk have a responsibility to take care of the creatures in their territory, William Housty said. \u0026#34;That\u0026#39;s a far different mindset from viewing the land in terms of how much we can take,\u0026#34; he said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eReporting and travel for this story was supported by the \u003c/i\u003e\u003ca href=\"https://sitkafoundation.org/\"\u003e\u003ci\u003eSitka Foundation\u003c/i\u003e\u003c/a\u003e\u003ci\u003e and the \u003c/i\u003e\u003ca href=\"http://www.sciencemediacentre.ca/\"\u003e\u003ci\u003eScience Media Centre of Canada\u003c/i\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eCopyright 2024 \u003c/i\u003e\u003ca href=\"https://www.livescience.com/\"\u003e\u003ci\u003eLive Science\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, a Future company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-10-22T11:30:00Z",
  "modifiedTime": null
}
