{
  "id": "11878c3e-598d-4854-87b7-578704a67cc7",
  "title": "India rocket launches space docking mission",
  "link": "https://phys.org/news/2024-12-india-rocket-space-docking-mission.html",
  "description": "India launched a rocket Monday carrying two small spacecraft to test docking in space, a critical step for the country's dreams of a space station and a manned Moon mission.",
  "author": "",
  "published": "Mon, 30 Dec 2024 14:29:19 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Space Exploration"
  ],
  "byline": "Science X",
  "length": 2899,
  "excerpt": "India launched a rocket Monday carrying two small spacecraft to test docking in space, a critical step for the country's dreams of a space station and a manned Moon mission.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Unsplash/CC0 Public Domain India launched a rocket Monday carrying two small spacecraft to test docking in space, a critical step for the country's dreams of a space station and a manned Moon mission. The mission is \"vital for India's future space ambitions\", Jitendra Singh, the country's science and technology minister, said in a statement ahead of the launch, which was broadcast live by the Indian Space Research Organisation (ISRO). Prime Minister Narendra Modi announced plans last year to send a man to the Moon by 2040. The PSLV-C60 rocket, which blasted off Monday evening at the Sriharikota launch site with shooting flames as it soared into the night sky, included two 220-kilogramme (485-pound) satellites. ISRO has dubbed the mission SpaDeX, or Space Docking Experiment. \"PSLV-C60 successfully launches SpaDeX and 24 payloads,\" it said in a statement. The mission is intended to \"develop and demonstrate the technology needed for rendezvous, docking, and undocking of two small spacecraft\", it added. The technology is \"essential\" for India's Moon plans, it added, calling it a \"key technology for future human spaceflight and satellite servicing missions\". It will involve a \"precision rendezvous\", manoeuvering satellites orbiting Earth at speeds of 28,800 kilometres per hour (17,895 miles per hour). Their relative velocities will be reduced to 0.036 kph to \"merge to form a single unit in Space\", ISRO said. The world's most populous nation has a comparatively low-budget aerospace programme that is rapidly closing in on the milestones set by global space powers. \"Through this mission, India is marching towards becoming the fourth country in the world to have space docking technology,\" ISRO added, after Russia, the United States and China. The world's most populous country has flexed its spacefaring ambitions in the last decade with its space programme growing considerably in size and momentum, matching the achievements of established powers at a much cheaper price tag. In August 2023, it became just the fourth nation to land an unmanned craft on the Moon after Russia, the United States and China. © 2024 AFP Citation: India rocket launches space docking mission (2024, December 30) retrieved 30 December 2024 from https://phys.org/news/2024-12-india-rocket-space-docking-mission.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/isro.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/isro.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/isro.jpg\" data-sub-html=\"Credit: Unsplash/CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/isro.jpg\" alt=\"ISRO\" title=\"Credit: Unsplash/CC0 Public Domain\" width=\"800\" height=\"450\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: Unsplash/CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eIndia launched a rocket Monday carrying two small spacecraft to test docking in space, a critical step for the country\u0026#39;s dreams of a space station and a manned Moon mission.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe mission is \u0026#34;vital for India\u0026#39;s future space ambitions\u0026#34;, Jitendra Singh, the country\u0026#39;s science and technology minister, said in a statement ahead of the launch, which was broadcast live by the Indian Space Research Organisation (ISRO).\u003c/p\u003e\n\u003cp\u003ePrime Minister Narendra Modi announced plans last year to send a man to the Moon by 2040.\u003c/p\u003e\n\u003cp\u003eThe PSLV-C60 rocket, which blasted off Monday evening at the Sriharikota launch site with shooting flames as it soared into the night sky, included two 220-kilogramme (485-pound) satellites.\u003c/p\u003e\n\u003cp\u003eISRO has dubbed the mission SpaDeX, or Space Docking Experiment.\u003c/p\u003e\n\u003cp\u003e\u0026#34;PSLV-C60 successfully launches SpaDeX and 24 payloads,\u0026#34; it said in a statement.\u003c/p\u003e\n\u003cp\u003eThe mission is intended to \u0026#34;develop and demonstrate the technology needed for rendezvous, \u003ca href=\"https://phys.org/tags/docking/\" rel=\"tag\"\u003edocking\u003c/a\u003e, and undocking of two small spacecraft\u0026#34;, it added.\u003c/p\u003e\n\u003cp\u003eThe technology is \u0026#34;essential\u0026#34; for India\u0026#39;s Moon plans, it added, calling it a \u0026#34;key technology for future human spaceflight and satellite servicing missions\u0026#34;.\u003c/p\u003e\n\u003cp\u003eIt will involve a \u0026#34;precision rendezvous\u0026#34;, manoeuvering satellites orbiting Earth at speeds of 28,800 kilometres per hour (17,895 miles per hour).\u003c/p\u003e\n\u003cp\u003eTheir relative velocities will be reduced to 0.036 kph to \u0026#34;merge to form a single unit in Space\u0026#34;, ISRO said.\u003c/p\u003e\n\u003cp\u003eThe world\u0026#39;s most populous nation has a comparatively low-budget aerospace programme that is rapidly closing in on the milestones set by global space powers.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Through this mission, India is marching towards becoming the fourth country in the world to have space docking technology,\u0026#34; ISRO added, after Russia, the United States and China.\u003c/p\u003e\n\u003cp\u003eThe world\u0026#39;s most populous country has flexed its spacefaring ambitions in the last decade with its space programme growing considerably in size and momentum, matching the achievements of established powers at a much cheaper price tag.\u003c/p\u003e\n\u003cp\u003eIn August 2023, it became just the fourth nation to land an unmanned craft on the Moon after Russia, the United States and China.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  © 2024 AFP\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tIndia rocket launches space docking mission (2024, December 30)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 30 December 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-12-india-rocket-space-docking-mission.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-30T14:29:19-05:00",
  "modifiedTime": null
}
