{
  "id": "120181b3-f206-46ce-b4cb-0571fe8ab15e",
  "title": "2024 Election Will Define America’s Stance on Immigration, with Consequences for Science and Technology",
  "link": "https://www.scientificamerican.com/article/2024-election-will-define-americas-stance-on-immigration-with-consequences/",
  "description": "Both presidential candidates would restrict immigration but Donald Trump would try to implement an extreme anti-immigrant agenda",
  "author": "",
  "published": "Thu, 10 Oct 2024 10:45:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Gary Stix",
  "length": 9497,
  "excerpt": "Both presidential candidates would restrict immigration but Donald Trump would try to implement an extreme anti-immigrant agenda",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "October 10, 20246 min readBoth presidential candidates would restrict immigration but Donald Trump would try to implement an extreme anti-immigrant agenda Thomas FuchsThis article is part of a series on what the 2024 presidential election means for science, health and the environment. Editors with expertise on each topic delved into the candidates’ records and policies and the evidence behind them. Read the rest of the stories here.Immigration is among the top issues that most concern voters in this election cycle, and they’ll have a chance in the coming weeks to choose between two candidates promising highly divergent approaches to it. The decision to pull the lever for Kamala Harris or Donald Trump has become a tacit referendum on whether to endorse a strict but still relatively moderate approach—or one of the most extreme anti-immigrant agendas in American history.The policy wrangling continues against a backdrop that highlights a growing demand for new immigrants to fill jobs that range from caring for an aging population to staffing newly constructed semiconductor plants. There is an intensifying need to grow the labor force at every level of workplace skill.Enacting Mass Deportations versus Bolstering the EconomyOn supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.The Trump plan, if implemented, would become a virtually insurmountable obstruction to achieving this goal. The former president has pledged to expel millions of undocumented immigrants (and perhaps other noncitizens) that he baselessly claims are committing crimes, planning to vote illegally, and stealing jobs from U.S. citizens. Trump promises to implement “the largest domestic deportation operation in the history of our country”—a plan that might encompass the building of detention camps for those waiting to be expelled.Using the National Guard and local police to round up 11 million undocumented immigrants, many of whom have lived in the U.S. for decades, has even drawn comparisons to the building of concentration camps. Trump boasted at the Republican National Convention in July that this massive undertaking would be bigger than a controversial Eisenhower-era deportation program. The feasibility of carrying out an immense anti-immigrant mobilization strains credibility; Trump’s plan to deport “millions” in 2019 accomplished little. But if seriously attempted in a second term, it would generate shock waves through the economy and society as a whole.“It would be the most disruptive thing of people’s lives, excluding COVID lockdowns,” says Todd Schulte, president of FWD.us, a bipartisan political group that works on immigration and criminal justice reform. As just one example, farms nationwide would likely be incapacitated in harvesting produce and livestock without the 283,000 undocumented workers who currently comprise 45 percent of the U.S. agricultural workforce. The cascading economic effects would also cause job losses for American citizens: one estimate projects that for every one million undocumented workers deported, 88,000 U.S. citizens stand to be out of a job.Harris has said that she would strive for a more balanced approach grounded in the political mainstream. She backs a bipartisan bill that allows for restrictive border rules to limit asylum seekers coming through Mexico. That influx reached a peak of nearly 250,000 “encounters” (expulsions and apprehensions) in December 2023 but then dropped dramatically, largely because of a Biden administration executive order that restricted the rate of entry. Harris’s hard line on border security has been offset by a commitment to establish “an earned pathway to citizenship” for undocumented immigrants already living in the country.Imposing strong border security—while recognizing the value of immigration to the U.S. economy—at one time represented a bipartisan status quo on this issue in the U.S. that prevailed until Trump first ran for president in 2015. “We don’t have a strong center anymore,” says Doris Meissner, a senior fellow at the Migration Policy Institute, a nonpartisan think tank that studies and makes policy recommendations on immigration. “The real demonstration of this is that for decades, [the late] senator [Edward] Kennedy for Democrats in the Senate and [the late] senator [John] McCain on the Republican side represented the leaders in each party who championed immigration in one way or another. And they were able to come to agreement to negotiate and bring their parties along.”That bygone era of cooperation has been replaced most notably in the 2024 election run-up by the anti-immigrant fervor that made the up to 20,000 legal Haitian immigrants in Springfield, Ohio, the object of Trump’s wildly false claim that they had been eating residents’ pets. These immigrants had moved to the Rust Belt city to seek unfilled jobs in newly established companies engaged in making microchips, auto parts and other goods; Trump has promised to begin their mass deportations if he is elected. They have a temporary legal status that allows them to hold jobs in the U.S. because of the turmoil in their home country, but Trump wants to remove their “temporary protected status” designation if he gets back in office.The Need for Skilled STEM WorkersThe maligning of immigrants has drawn attention away from the necessity of filling job openings in STEM (science, technology, engineering and math) fields. The U.S. Bureau of Labor Statistics projects that the country will require a million more STEM workers in 2030 than were needed a decade earlier. The CHIPS and Science Act, passed by Congress with bipartisan support in 2022, is spending billions to revive the U.S. semiconductor industry. But a frantic search is underway for computer scientists, engineers and technicians to staff chip factories.Both candidates have voiced support for new measures to promote legal immigration, but Trump’s track record as president casts doubt on whether his plans would ever be realized. Trump said in a podcast in June that he would issue “green cards” (U.S. permanent residency documents) to foreign college graduates at U.S. universities, but his earlier stint in office suggests otherwise. The denial rate for an already short supply of coveted H-1B visas, typically granted to skilled workers, reached 24 percent in fiscal year 2018, when Trump was in office. It fell back to 2 percent in fiscal year 2022 after courts found his administration’s handling of these visas to be unlawful, resulting in a legal settlement that led to the drop. During the pandemic in 2020, moreover, Trump issued proclamations that prohibited entry for nearly all classes of immigrants. “His administration was staffed by people who attempted to make the ability of the United States to attract and train top talent from around the world much, much, much harder,” Schulte says. Since the restrictions were lifted, the growth of foreign-born workers in the labor force has helped propel the U.S. to a healthy economic recovery without taking jobs from native-born workers.If Trump returns, the country will likely pick up where he left off in terms of immigration policy. The Heritage Foundation’s Project 2025, a policy outline drafted largely by former Trump appointees and staffers, calls for eliminating the lowest wage levels eligible to people applying for H-1B visas—an action that would result in “excluding most foreign-born graduates from these job opportunities,” according to the Niskanen Center, a pro-immigration think tank.Harris’s plans emphasize weighing border security against the need for new workers, but they also represent a harsher stance on the issue than when she ran for president in the 2020 election. The current vice president supports the bipartisan immigration bill that died earlier this year after Trump told Republicans to withdraw their backing for the legislation—which would have put in place more stringent asylum measures. The same legislation, however, would also have provided for the issuing of 250,000 additional visas during a five-year period as well as other measures to promote legal immigration. Harris also supports Deferred Action for Childhood Arrivals, or DACA, a policy that shields children brought to the U.S. by undocumented parents from being deported.Any lasting and effective approach to immigration issues will require a complete system overhaul—“comprehensive immigration reform,” as policymakers call it. This would take the form of congressional legislation that regulates the number of people crossing the border, provides paths to legalization for the undocumented and allows for more immigration to meet employer needs. “Those 11 million people who are here without a legal status, it’s in their and our best interest that they have a legal status because then they can contribute more fully,” Meissner says. Comprehensive immigration reform has not been implemented in decades despite several failed attempts to do so.The momentum to enact such sweeping change will likely not come during the next four years. But the Harris campaign’s platform does at least acknowledge that “our immigration system is broken and needs comprehensive reform.” Trump’s strategy of deporting millions would make that much more unlikely.",
  "image": "https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eOctober 10, 2024\u003c/p\u003e\u003cp\u003e6 min read\u003c/p\u003e\u003c/div\u003e\u003cp\u003eBoth presidential candidates would restrict immigration but Donald Trump would try to implement an extreme anti-immigrant agenda\u003c/p\u003e\u003cfigure\u003e\u003cimg src=\"https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=600\" alt=\"Blue and red illustration of a gate with arrows\" srcset=\"https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=600 600w, https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=900 900w, https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=1000 1000w, https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=1200 1200w, https://static.scientificamerican.com/dam/m/f6bca9e5b1c3984/original/sciam-immigration.jpg?w=1350 1350w\" sizes=\"(min-width: 900px) 900px, (min-resolution: 2dppx) 75vw, (min-resolution: 2.1dppx) 50vw, 100vw\" fetchpriority=\"high\"/\u003e\u003cfigcaption\u003e \u003cp\u003eThomas Fuchs\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThis article is part of a series on what the 2024 presidential election means for science, health and the environment. Editors with expertise on each topic delved into the candidates’ records and policies and the evidence behind them. \u003ca href=\"https://www.scientificamerican.com/report/how-the-2024-presidential-election-will-shape-science-health-and-the-environment\"\u003eRead the rest of the stories here\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eImmigration is among the top issues that most concern voters in this election cycle, and they’ll have a chance in the coming weeks to choose between two candidates promising highly divergent approaches to it. The decision to pull the lever for Kamala Harris or Donald Trump has become a tacit referendum on whether to endorse a strict but still relatively moderate approach—or one of the most extreme anti-immigrant agendas in American history.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe policy wrangling continues against a backdrop that highlights a growing demand for new immigrants to fill jobs that range from caring for an aging population to staffing newly constructed semiconductor plants. There is an intensifying need to grow the labor force at every level of workplace skill.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003e\u003cb\u003eEnacting Mass Deportations versus Bolstering the Economy\u003c/b\u003e\u003c/h2\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Trump plan, if implemented, would become a virtually insurmountable obstruction to    achieving this goal. The former president has pledged to expel millions of undocumented immigrants (and perhaps other noncitizens) that he baselessly claims are committing crimes, planning to vote illegally, and stealing jobs from U.S. citizens. Trump promises to implement “the largest domestic deportation operation in the history of our country”—\u003ca href=\"https://www.nytimes.com/2023/11/11/us/politics/trump-2025-immigration-agenda.html\"\u003ea plan\u003c/a\u003e that might encompass the \u003ca href=\"https://time.com/6972022/donald-trump-transcript-2024-election/\"\u003ebuilding of detention camps\u003c/a\u003e for those waiting to be expelled.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eUsing the National Guard and local police to round up 11 million undocumented immigrants, many of whom have lived in the U.S. for decades, has even drawn comparisons to the \u003ca href=\"https://www.scientificamerican.com/article/trumps-massive-deportation-plan-echoes-concentration-camp-history/\"\u003ebuilding of concentration camps\u003c/a\u003e. Trump boasted at the Republican National Convention in July that this massive undertaking would be bigger than a \u003ca href=\"https://www.washingtonpost.com/history/2024/02/26/trump-immigration-deportation-eisenhower-operation/\"\u003econtroversial Eisenhower-era deportation program\u003c/a\u003e. The feasibility of carrying out an immense anti-immigrant mobilization strains credibility; Trump’s \u003ca href=\"https://apnews.com/article/trump-mass-deportations-immigration-844f3050ba99552b900ed9f3a1dec22d\"\u003eplan to deport “millions”\u003c/a\u003e in 2019 accomplished little. But if seriously attempted in a second term, it would generate shock waves through the economy and society as a whole.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“It would be the most disruptive thing of people’s lives, excluding COVID lockdowns,” says Todd Schulte, president of FWD.us, a bipartisan political group that works on immigration and criminal justice reform. As just one example, farms nationwide would likely be incapacitated in harvesting produce and livestock without \u003ca href=\"https://cmsny.org/agricultural-workers-rosenbloom-083022/#:~:text=According%20to%20CMS%20estimates%2C%20there,undocumented%20workforce%20in%20United%20States.\"\u003ethe 283,000 undocumented workers\u003c/a\u003e who currently comprise 45 percent of the U.S. agricultural workforce. The cascading economic effects would also cause job losses for American citizens: \u003ca href=\"https://www.piie.com/blogs/realtime-economics/2024/trumps-proposed-mass-deportations-would-backfire-us-workers\"\u003eone estimate\u003c/a\u003e projects that for every one million undocumented workers deported, 88,000 U.S. citizens stand to be out of a job.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHarris has said that she would strive for a more balanced approach grounded in the political mainstream. She backs a bipartisan bill that allows for restrictive border rules to limit asylum seekers coming through Mexico. That influx \u003ca href=\"https://www.pewresearch.org/short-reads/2024/02/15/migrant-encounters-at-the-us-mexico-border-hit-a-record-high-at-the-end-of-2023/\"\u003ereached a peak of nearly 250,000\u003c/a\u003e “encounters” (expulsions and apprehensions) in December 2023 but then dropped dramatically, largely because of a Biden administration executive order that restricted the rate of entry. Harris’s hard line on border security has been offset by a commitment to establish “an earned pathway to citizenship” for undocumented immigrants already living in the country.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eImposing strong border security—while recognizing the value of immigration to the U.S. economy—at one time represented a bipartisan status quo on this issue in the U.S. that  prevailed until Trump first ran for president in 2015. “We don’t have a strong center anymore,” says Doris Meissner, a senior fellow at the Migration Policy Institute, a nonpartisan think tank that studies and makes policy recommendations on immigration. “The real demonstration of this is that for decades, [the late] senator [Edward] Kennedy for Democrats in the Senate and [the late] senator [John] McCain on the Republican side represented the leaders in each party who championed immigration in one way or another. And they were able to come to agreement to negotiate and bring their parties along.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThat bygone era of cooperation has been replaced most notably in the 2024 election run-up by the anti-immigrant fervor that made the up to 20,000 legal Haitian immigrants in Springfield, Ohio, the object of Trump’s wildly false claim that they had been eating residents’ pets. These immigrants had moved to the Rust Belt city to \u003ca href=\"https://www.nytimes.com/2024/09/03/us/springfield-ohio-school-bus-crash-haiti-immigrants.html\"\u003eseek unfilled jobs in newly established companies\u003c/a\u003e engaged in making microchips, auto parts and other goods; Trump has promised to begin their mass deportations if he is elected. They have a temporary legal status that allows them to hold jobs in the U.S. because of the turmoil in their home country, but Trump wants to \u003ca href=\"https://www.nytimes.com/2024/10/04/us/politics/trump-takes-aim-at-legal-immigration.html\"\u003eremove their “temporary protected status” designation\u003c/a\u003e if he gets back in office.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003e\u003cb\u003eThe Need for Skilled STEM Workers\u003c/b\u003e\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe maligning of immigrants has drawn attention away from the necessity of filling job openings in STEM (science, technology, engineering and math) fields. The U.S. Bureau of Labor Statistics projects that the country \u003ca href=\"https://www.americanimmigrationcouncil.org/research/foreign-born-stem-workers-united-states\"\u003ewill require a million more STEM workers\u003c/a\u003e in 2030 than were needed a decade earlier. \u003ca href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/08/09/fact-sheet-chips-and-science-act-will-lower-costs-create-jobs-strengthen-supply-chains-and-counter-china/\"\u003eThe CHIPS and Science Act\u003c/a\u003e, passed by Congress with bipartisan support in 2022, is spending billions to revive the U.S. semiconductor industry. But a \u003ca href=\"https://www.semiconductors.org/chipping-away-assessing-and-addressing-the-labor-market-gap-facing-the-u-s-semiconductor-industry/\"\u003efrantic search is underway\u003c/a\u003e for computer scientists, engineers and technicians to staff chip factories.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBoth candidates have voiced support for new measures to promote legal immigration, but Trump’s track record as president casts doubt on whether his plans would ever be realized. Trump said in a podcast in June that he would issue “green cards” (U.S. permanent residency documents) to foreign college graduates at U.S. universities, but \u003ca href=\"https://www.forbes.com/sites/stuartanderson/2024/06/23/trump-unlikely-to-pass-immigration-law-to-admit-all-college-grads/\"\u003ehis earlier stint in office\u003c/a\u003e suggests otherwise. The denial rate for an already short supply of coveted H-1B visas, typically granted to skilled workers, \u003ca href=\"https://nfap.com/studies/h-1b-petitions-and-denial-rates-in-fy-2022/\"\u003ereached 24 percent in fiscal year 2018\u003c/a\u003e, when Trump was in office. It fell back to 2 percent in fiscal year 2022 after courts found his administration’s \u003ca href=\"https://nfap.com/studies/trump-immigration-policy-high-skilled-immigration/\"\u003ehandling of these visas to be unlawful\u003c/a\u003e, resulting in a legal settlement that led to the drop. During the pandemic in 2020, moreover, Trump issued proclamations that prohibited entry for nearly all classes of immigrants. “His administration was staffed by people who attempted to make the ability of the United States to attract and train top talent from around the world much, much, much harder,” Schulte says. Since the restrictions were lifted, the \u003ca href=\"https://www.nytimes.com/2024/02/29/business/economy/immigrants-labor.html\"\u003egrowth of foreign-born workers in the labor force\u003c/a\u003e has helped propel the U.S. to a healthy economic recovery without taking jobs from native-born workers.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf Trump returns, the country will likely pick up where he left off in terms of immigration policy. The Heritage Foundation’s \u003ca href=\"https://www.scientificamerican.com/article/project-2025-plan-for-trump-presidency-has-far-reaching-threats-to-science/\"\u003eProject 2025\u003c/a\u003e, a policy outline drafted largely by former Trump appointees and staffers, calls for eliminating the lowest wage levels eligible to people applying for H-1B visas—\u003ca href=\"https://www.niskanencenter.org/project-2025-unveiling-the-far-rights-plan-to-demolish-immigration-in-a-second-trump-term/\"\u003ean action \u003c/a\u003ethat would result in “excluding most foreign-born graduates from these job opportunities,” according to the Niskanen Center, a pro-immigration think tank.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHarris’s plans emphasize weighing border security against the need for new workers, but they also represent a harsher stance on the issue than when she ran for president in the 2020 election. The current vice president supports the bipartisan immigration bill that died earlier this year after Trump told Republicans to withdraw their backing for the legislation—which would have put in place more stringent asylum measures. The same legislation, however, would also have provided for \u003ca href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/04/fact-sheet-biden-harris-administration-calls-on-congress-to-immediately-pass-the-bipartisan-national-security-agreement/#:~:text=For%20the%20first%20time%20in,90%2C000%20will%20be%20employment%2Dbased.\"\u003ethe issuing of 250,000 additional visas\u003c/a\u003e during a five-year period as well as other measures to promote legal immigration. Harris also \u003ca href=\"https://www.kff.org/racial-equity-and-health-policy/fact-sheet/key-facts-on-deferred-action-for-childhood-arrivals-daca/\"\u003esupports Deferred Action for Childhood Arrivals\u003c/a\u003e, or DACA, a policy that shields children brought to the U.S. by undocumented parents from being deported.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAny lasting and effective approach to immigration issues will require a complete system overhaul—“\u003ca href=\"https://www.migrationpolicy.org/topics/comprehensive-immigration-reform\"\u003ecomprehensive immigration reform\u003c/a\u003e,” as policymakers call it. This would take the form of congressional legislation that regulates the number of people crossing the border, provides paths to legalization for the undocumented and allows for more immigration to meet employer needs. “Those 11 million people who are here without a legal status, it’s in their and our best interest that they have a legal status because then they can contribute more fully,” Meissner says. Comprehensive immigration reform has not been implemented in decades despite several failed attempts to do so.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe momentum to enact such sweeping change will likely not come during the next four years. But the Harris campaign’s platform does at least acknowledge that \u003ca href=\"https://kamalaharris.com/issues/\"\u003e“our immigration system is broken and needs comprehensive reform.”\u003c/a\u003e Trump’s strategy of deporting millions would make that much more unlikely.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-10T10:45:00Z",
  "modifiedTime": null
}
