{
  "id": "19d30308-e7d8-4190-ad47-df37cccd2f7d",
  "title": "Well Well Well, We Want Them Infected Doctors Are OK With Censorship After All",
  "link": "https://sciencebasedmedicine.org/lovecensorship/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=lovecensorship",
  "description": "Doctors who mourned the loss of a single speech or YouTube video are fine with the the mass censorship of public scientists. The post Well Well Well, We Want Them Infected Doctors Are OK With Censorship After All first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Tue, 28 Jan 2025 18:11:27 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 10618,
  "excerpt": "Doctors who mourned the loss of a single speech or YouTube video are fine with the the mass censorship of public scientists.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "In 2023, Dr. Vinay Prasad had a talk cancelled by the American College of Clinical Pharmacy, a private organization, after members reasonably protested that they did not trust him. Dr. Prasad published a self-pitying article on this speech in Bari Weiss’s Free Press titled Why Was My Talk at a Medical Conference Canceled? In it, Dr. Prasad portrayed himself as a neutral scholar by saying: As a physician and medical scholar who has published over 450 academic articles and two books, my research team and I base our opinions on a sober assessment of available evidence.  Although in reality Dr. Prasad is full of vengeful vulgarities, at the time he spoke about the need for civil debate and discussion. He continued: I invite my critics to disagree with me on any of my positions and to change my mind. Like any good scientist, I have changed my mind over the course of Covid. I was initially skeptical that Donald Trump’s Operation Warp Speed could develop a vaccine so quickly—I was wrong. I was optimistic that vaccination would halt the spread of the virus—I was wrong.  But instead of debate or dialogue, the ACCP organizers preferred to cancel my talk on a topic unrelated to Covid. The same thing happened to geophysicist Dorian Abbot, whose lecture on geology at MIT was canceled because of his views on affirmative action.  In her letter, Lichvar claimed that, in a 2021 post, I likened the Covid response to the Third Reich. This is false. As journalist David Zweig explained, “Prasad talked about democratic norms that had eroded during the pandemic, including military action in Australia to prevent movement of citizens. . . He argued there can be a slippery slope toward totalitarianism when democracies accept the loss of certain freedoms, and he referenced Germany in 1929–1939. . . . He did not say the Covid response was like Nazi Germany.” Indeed, Dr. Prasad had imaged a future pandemic where power-hungry leaders trying to contain a deadly virus ushered in Nazi totalitarianism. Dr. Prasad was worried about a slippery slope only when people tried to limit COVID. Dr. Prasad also wrote another article in 2021 titled At a Time When The U.S. Needed COVID-19 Dialogue Between Scientists, Francis Collins Moved to Shut it Down. In it, Dr. Prasad said that as the pandemic raged, our public health leaders were obligated to hold public debates with advocates of herd immunity via mass infection. He wrote: What concerns me about the NIH director’s email and his interview on television is that he appeared unwilling to have this dialogue. Collins’s day job does not make him arbiter of scientific truth, the Pope for all scientists. On questions of unprecedented pandemic policy, he is surely entitled to his opinion — as we all are — but his is just one opinion of many. When it comes to lockdowns or school closures, the answer to the question of whether the benefits exceed the harms and, if so, under what conditions, is far from certain, and scientists will continue to study this for decades. As a good scientist, Collins should have recognized the massive uncertainty around these policies. Collins’s response to a memo signed by thousands of scientists should not have been to call for an immediate and devastating take down, but to use his pulpit as NIH director to hold a series of public discussions and dialogues. In a world where scientists were trapped in their own homes for months, a series of dialogues — even virtual ones — made available for the broader scientific community, policy makers, and the public would have benefited us all. Dr. Prasad was hardly alone in demanding debates and bemoaning censorship”. Many We Want Them Infected (WWTI) doctors similarly claimed to be free speech champions when a trivial amount of their misinformation was restricted. For example, after YouTube, a private company, removed a video of theirs, Florida Governor Ron DeSantis issued a press release titled Roundtable With Public Health Experts To Discuss Big Tech Censorship. It contained the following quotes: “There’s nothing more dangerous than being able to censor what is said in a country, because then you are simply not ever going to even hear the truth. And you are entering into a phase of countries that we used to criticize severely like the USSR, like communist China…I mean, this is almost the end of our civilization if we have this sort of censorship, I’m afraid,” said Dr. Scott Atlas. “For science to work, you have to have an open exchange of ideas…If you’re going to make an argument that something is misinformation, you should provide an actual argument. You can’t just take it down and say, ‘Oh, it’s misinformation’ without actually giving a reason…Let’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate,” said Dr. Jay Bhattacharya. “We need to have debates, rather than censoring…When we do censoring and slandering, even if we are willing to continue to speak out, there are many other scientists that I know, including junior scientists, who do not want to speak out because they see what’s happening to us. They don’t want to have to go through the same thing. So, we really need a debate,” said Dr. Martin Kulldorff. In reality, these doctors were celebrities who advised world leaders, despite not treating a single COVID patient. Yet this is how they they reacted to having just one of their hundreds of YouTube videos removed. Dr. Bhattacharya, who will soon be heading the NIH, gave countless speeches and devoted volumes of Tweets to the fate his social media content. It became the centerpiece of the pandemic for him. One typical speech was dramatically titled The End of Free Speech is the End of Science. He absurdly described himself as a “scientific dissident” at a rally for RFK Jr., and even sued the Biden administration, though he lost in the Supreme Court. Our future FDA director, Dr. Marty Makary similarly recorded a podcast Cancel Culture Isn’t Good for Science and elsewhere said, “science should have no gag rules.” All of this was just an act though, empty virtue-signaling. WWTI doctors faked concern about censorship to portray themselves as heroic victims and distract from their factual errors. Every moment spent discussing their “censored” YouTube video was a moment not discussing the misinformation it contained. An “immediate pause” had been ordered on various aspects of communications with the general public, including regulations, announcements, press releases, and social media and website posts. Things are very different today. WWTI doctors are not mourning cancelled talks and conferences. They are not calling for public debates or whining about a fictional Ministry of Truth. Nothing that’s going on bothers them in the slightest. Yet, what’s happening is much more chilling than the fate of a single speech or YouTube video. According to the article: Health Agency Reports from CDC, FDA, and NIH Halted by Trump Officials The Trump administration halted reports from top health agencies like the CDC, FDA, and National Institutes of Health (NIH) on Tuesday, putting communications with the general public in limbo until at least the end of the month. According to a memo obtained by the Associated Press, Dorothy Fink, acting Secretary of the U.S. Department of Health and Human Services (HHS), told agency staff leaders that an “immediate pause” had been ordered on various aspects of communications with the general public, including regulations, announcements, press releases, and social media and website posts. “HHS has issued a pause on mass communications and public appearances that are not directly related to emergencies or critical to preserving health. This is a short pause to allow the new team to set up a process for review and prioritization. There are exceptions for announcements that HHS divisions believe are mission critical, but they will be made on a case by case basis,” a spokesperson for the HHS Office of Public Affairs told Healthline in an email. The most obvious explanation for this muzzling of scientists is that the Trump administration is following Project 2025 and doesn’t want scientific agencies to publish data that runs counter to its political narrative. That’s already happened in 2020 with COVID. However, as with COVID, the same doctors who told us not to worry about mass infection are telling us not to worry about mass censorship at the CDC, FDA, and NIH. As Dr. David Gorski discussed Monday, Dr. Prasad authored an article titled Pausing NIH Study Sections Is Going To Be Fine. He wants us to believe this censorship is just about making government work well for the people. In his telling, politics doesn’t factor in at all, and in order to reform government, the indefinite silencing of public scientists must be embraced. Dr. Prasad frames it as a mere “pause on external communication.” That’s all. Dr. Prasad further portrayed NIH researchers as party animals who wasted taxpayer dollars and deserve what’s happening now. It’s worth it to post a response to Dr. Prasad’s fantasy. Dr. David Steensma said: However, Dr. Prasad felt this censorship was all worth it to purge undesirable researchers. In response to one scientist whose life has been upended by censorship, he said: Dr. Prasad recognized that this mass censorship would cause pain for some people, but he said everyone just has to get used to it. So, let’s be clear what is happening here. Currently, every federal public scientist is silenced and censored. Meetings are cancelled and publications halted. Yet Dr. Prasad, who wrote an entire article whinging about a single cancelled speech of his, cheers it on. It’s merely “unfortunate” that countless scientists are having their research interrupted and careers threatened. “You got to break some eggs to make an omelette,” he said about scientists’ lives. Meanwhile, the free speech “champions” set to lead the NIH and FDA, have said nothing about the censorship of the administration they will soon join, thus revealing everything about their true commitment to open discussion and debate. In addition to their COVID misinformation, everything that happens over the next 4 years will be the permanent legacy of these doctors. Let’s return to this column in 2029 and see whether or not scientists felt free to honestly communicate with the American public. It’s not looking good so far.",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-15.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cp\u003eIn 2023, Dr. Vinay Prasad had a talk cancelled by the \u003ca href=\"https://www.accp.com/news/index.aspx?i=331\"\u003eAmerican College of Clinical Pharmacy\u003c/a\u003e, a private organization, after members reasonably protested that they did not trust him. Dr. Prasad published a self-pitying article on this speech in Bari Weiss’s Free Press titled \u003ca href=\"https://www.thefp.com/p/disinvited-from-medical-conference\"\u003eWhy Was My Talk at a Medical Conference Canceled?\u003c/a\u003e In it, Dr. Prasad portrayed himself as a neutral scholar by saying:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eAs a physician and medical scholar who has published over 450 academic articles and two books, my \u003ca href=\"http://www.vkprasadlab.com/\"\u003eresearch team\u003c/a\u003e and I base our opinions on a sober assessment of available evidence. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAlthough in reality Dr. Prasad is full of \u003ca href=\"https://www.youtube.com/watch?v=_HZDNG9gO1Q\u0026amp;t=4s\"\u003evengeful vulgarities\u003c/a\u003e, at the time he spoke about the need for civil debate and discussion. He continued:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eI invite my critics to disagree with me on any of my positions and to change my mind. Like any good scientist, I\u003cem\u003e have\u003c/em\u003e changed my mind over the course of Covid. I was initially skeptical that Donald Trump’s \u003ca href=\"https://www.gao.gov/products/gao-21-319\"\u003eOperation Warp Speed\u003c/a\u003e could develop a vaccine so quickly—I was wrong. I was optimistic that vaccination would halt the spread of the virus—I was wrong. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut instead of debate or dialogue, the ACCP organizers preferred to cancel my talk on a topic unrelated to Covid. The \u003ca href=\"https://www.nytimes.com/2021/10/20/us/dorian-abbot-mit.html\"\u003esame thing\u003c/a\u003e happened to geophysicist Dorian Abbot, whose lecture on geology at MIT was canceled because of his views on affirmative action. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn her letter, Lichvar claimed that, in a 2021 post, I likened the Covid response to the Third Reich. This is false. As journalist David Zweig \u003ca href=\"https://www.silentlunch.net/p/after-complaints-pharmacy-conference\"\u003eexplained\u003c/a\u003e, “Prasad talked about democratic norms that had eroded during the pandemic, including military action in \u003ca href=\"https://www.reuters.com/world/asia-pacific/australia-pm-says-vaccinations-alone-will-not-end-sydneys-covid-19-lockdown-2021-07-28/#:~:text=SYDNEY%2C%20July%2029%20(Reuters),was%20likely%20to%20get%20worse.\"\u003eAustralia\u003c/a\u003e to prevent movement of citizens. . . He argued there can be a slippery slope toward totalitarianism when democracies accept the loss of certain freedoms, and he referenced Germany in 1929–1939. . . . He did not say the Covid response was like Nazi Germany.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIndeed, Dr. Prasad had imaged a future pandemic where power-hungry leaders trying to contain a deadly virus ushered in Nazi totalitarianism. Dr. Prasad was worried about a slippery slope only when people tried to limit COVID.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Prasad also wrote another article in 2021 titled \u003ca href=\"https://www.statnews.com/2021/12/23/at-a-time-when-the-u-s-needed-covid-19-dialogue-between-scientists-francis-collins-moved-to-shut-it-down/\"\u003eAt a Time When The U.S. Needed COVID-19 Dialogue Between Scientists, Francis Collins Moved to Shut it Down\u003c/a\u003e. In it, Dr. Prasad said that as the pandemic raged, our public health leaders were \u003cem\u003eobligated\u003c/em\u003e to hold public debates with advocates of herd immunity via mass infection. He wrote:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhat concerns me about the NIH director’s email and his interview on television is that he appeared unwilling to have this dialogue. Collins’s day job does not make him arbiter of scientific truth, the Pope for all scientists. On questions of unprecedented pandemic policy, he is surely entitled to his opinion — as we all are — but his is just one opinion of many.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen it comes to lockdowns or school closures, the answer to the question of whether the benefits exceed the harms and, if so, under what conditions, is far from certain, and scientists will continue to study this for decades. As a good scientist, Collins should have recognized the massive uncertainty around these policies.\u003c/p\u003e\n\n\n\n\u003cp\u003eCollins’s response to a memo signed by thousands of scientists should not have been to call for an immediate and devastating take down, but to use his pulpit as NIH director to hold a series of public discussions and dialogues. In a world where scientists were trapped in their own homes for months, a series of dialogues — even virtual ones — made available for the broader scientific community, policy makers, and the public would have benefited us all.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eDr. Prasad was hardly alone in demanding debates and bemoaning censorship”. Many We Want Them Infected (WWTI) doctors similarly claimed to be free speech champions when a trivial amount of their misinformation was restricted. For example, after YouTube, a private company, removed a video of theirs, Florida Governor Ron DeSantis issued a press release titled \u003ca href=\"https://www.flgov.com/eog/news/press/2021/governor-ron-desantis-holds-roundtable-public-health-experts-discuss-big-tech\"\u003eRoundtable With Public Health Experts To Discuss Big Tech Censorship\u003c/a\u003e. It contained the following quotes:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“There’s nothing more dangerous than being able to censor what is said in a country, because then you are simply not ever going to even hear the truth. And you are entering into a phase of countries that we used to criticize severely like the USSR, like communist China…I mean, this is almost the end of our civilization if we have this sort of censorship, I’m afraid,” \u003cstrong\u003esaid Dr. Scott Atlas.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“For science to work, you have to have an open exchange of ideas…If you’re going to make an argument that something is misinformation, you should provide an actual argument. You can’t just take it down and say, ‘Oh, it’s misinformation’ without actually giving a reason…Let’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate,” \u003cstrong\u003esaid Dr. Jay Bhattacharya.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“We need to have debates, rather than censoring…When we do censoring and slandering, even if we are willing to continue to speak out, there are many other scientists that I know, including junior scientists, who do not want to speak out because they see what’s happening to us. They don’t want to have to go through the same thing. So, we really need a debate,” \u003cstrong\u003esaid Dr. Martin Kulldorff.\u003c/strong\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIn reality, these doctors were celebrities who advised world leaders, despite not treating a single COVID patient. Yet this is how they they reacted to having \u003cem\u003ejust one\u003c/em\u003e of their hundreds of YouTube videos removed.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Bhattacharya, who will soon be heading the NIH, gave countless speeches and devoted volumes of Tweets to the fate his social media content.  It became the centerpiece of the pandemic for him. One typical speech was dramatically titled \u003ca href=\"https://jmp.princeton.edu/events/2024/end-free-speech-end-science\"\u003eThe End of Free Speech is the End of Science\u003c/a\u003e. He absurdly described himself as a “\u003ca href=\"https://www.illusionconsensus.com/p/live-jay-speaks-at-rfk-jrs-vice-president\"\u003escientific dissident\u003c/a\u003e” at a rally for RFK Jr., and even sued the Biden administration, though he \u003ca href=\"https://en.wikipedia.org/wiki/Murthy_v._Missouri\" title=\"\"\u003elost\u003c/a\u003e in the Supreme Court. Our future FDA director, Dr. Marty Makary similarly recorded a podcast \u003ca href=\"https://www.youtube.com/watch?v=ZsadKO_RHPE\"\u003eCancel Culture Isn’t Good for Science\u003c/a\u003e and elsewhere said, “\u003ca href=\"https://www.washingtonexaminer.com/news/2877600/johns-hopkins-surgeon-says-science-should-have-no-gag-rules-after-twitter-censorship/\" title=\"\"\u003escience should have no gag rules\u003c/a\u003e.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAll of this was just an act though, empty virtue-signaling. WWTI doctors faked concern about censorship to portray themselves as heroic victims and distract\u003cem\u003e \u003c/em\u003efrom their factual errors. Every moment spent discussing their “censored” YouTube video was a moment not discussing the misinformation it contained.\u003c/p\u003e\n\n\n\n\u003ch2\u003eAn “immediate pause” had been ordered on various aspects of communications with the general public, including regulations, announcements, press releases, and social media and website posts.\u003c/h2\u003e\n\n\n\n\u003cp\u003eThings are very different today. WWTI doctors are not mourning cancelled talks and conferences. They are not calling for public debates or \u003ca href=\"https://www.youtube.com/watch?v=ggC5jEID2bA\"\u003ewhining about a fictional Ministry of Truth\u003c/a\u003e.  Nothing that’s going on bothers them in the slightest. Yet, what’s happening is much more chilling than the fate of a single speech or YouTube video. According to the article: \u003ca href=\"https://www.healthline.com/health-news/trump-officials-pause-federal-health-agency-reports\"\u003eHealth Agency Reports from CDC, FDA, and NIH Halted by Trump Officials\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe Trump administration halted reports from top health agencies like the CDC, FDA, and National Institutes of Health (NIH) on Tuesday, putting communications with the general public in limbo until at least the end of the month.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to a memo obtained by the \u003ca href=\"https://apnews.com/article/trump-health-communications-cdc-hhs-fda-1eeca64c1ccc324b31b779a86d3999a4\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAssociated Press\u003c/a\u003e, Dorothy Fink, acting Secretary of the U.S. Department of Health and Human Services (HHS), told agency staff leaders that an “immediate pause” had been ordered on various aspects of communications with the general public, including regulations, announcements, press releases, and social media and website posts.\u003c/p\u003e\n\n\n\n\u003cp\u003e“HHS has issued a pause on mass communications and public appearances that are not directly related to emergencies or critical to preserving health. This is a short pause to allow the new team to set up a process for review and prioritization. There are exceptions for announcements that HHS divisions believe are mission critical, but they will be made on a case by case basis,” a spokesperson for the HHS Office of Public Affairs told Healthline in an email.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThe most obvious explanation for this muzzling of scientists is that the Trump administration is following \u003ca href=\"https://www.apha.org/topics-and-issues/public-health-under-threat/project-2025\" title=\"\"\u003eProject 2025\u003c/a\u003e and doesn’t want scientific agencies to publish data that runs counter to its political narrative. That’s already happened in \u003ca href=\"https://coronavirus-democrats-oversight.house.gov/news/press-releases/clyburn-trump-cdc-redfield-caputo-report\" title=\"\"\u003e2020 with COVID\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, as with COVID, the same doctors who told us not to worry about mass infection are telling us not to worry about mass censorship at the CDC, FDA, and NIH. As Dr. David Gorski \u003ca href=\"https://sciencebasedmedicine.org/the-attack-on-the-nih-has-begun/\" title=\"\"\u003ediscussed Monday\u003c/a\u003e, Dr. Prasad authored an article titled \u003ca href=\"https://x.com/VPrasadMDMPH/status/1882463671110312281\" title=\"\"\u003ePausing NIH Study Sections Is Going To Be Fine\u003c/a\u003e. He wants us to believe this censorship is just about making government work well for the people. In his telling, politics doesn’t factor in at all, and in order to reform government, the indefinite silencing of public scientists must be embraced. Dr. Prasad frames it as a mere “pause on external communication.” That’s all.\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"675\" height=\"1024\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11-675x1024.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11-675x1024.png 675w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11-422x640.png 422w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11-132x200.png 132w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11-650x987.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-11.png 753w\" sizes=\"(max-width: 675px) 100vw, 675px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003eDr. Prasad further portrayed NIH researchers as party animals who wasted taxpayer dollars and deserve what’s happening now.\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"491\" height=\"411\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-5.jpeg\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-5.jpeg 491w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-5-480x402.jpeg 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-5-200x167.jpeg 200w\" sizes=\"(max-width: 491px) 100vw, 491px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003eIt’s worth it to post a response to Dr. Prasad’s fantasy. Dr. David Steensma said:\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"648\" height=\"1024\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10-648x1024.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10-648x1024.png 648w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10-405x640.png 405w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10-127x200.png 127w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10-650x1026.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-10.png 720w\" sizes=\"(max-width: 648px) 100vw, 648px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003eHowever, Dr. Prasad felt this censorship was all worth it to purge undesirable researchers. In response to one scientist whose life has been upended by censorship, he said:\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"751\" height=\"1024\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-751x1024.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-751x1024.png 751w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-469x640.png 469w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-147x200.png 147w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-768x1047.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12-650x886.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-12.png 834w\" sizes=\"auto, (max-width: 751px) 100vw, 751px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eDr. Prasad recognized that this mass censorship would cause pain for some people, but he said everyone just has to get used to it.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"936\" height=\"728\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13.png 936w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13-480x373.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13-200x156.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13-768x597.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2025/01/image-13-650x506.png 650w\" sizes=\"auto, (max-width: 936px) 100vw, 936px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003eSo, let’s be clear what is happening here. Currently, every federal public scientist is silenced and censored. Meetings are cancelled and \u003ca href=\"https://www.healio.com/news/infectious-disease/20250124/famed-cdc-journal-goes-unpublished-amid-hhs-communications-freeze\"\u003epublications halted\u003c/a\u003e. Yet Dr. Prasad, who wrote an entire article whinging about a \u003cem\u003esingle\u003c/em\u003e cancelled speech of his, cheers it on. It’s merely “unfortunate” that countless scientists are having their research interrupted and careers threatened. “\u003ca href=\"https://x.com/VPrasadMDMPH/status/1882497870215221738\" title=\"\"\u003eYou got to break some eggs to make an omelette\u003c/a\u003e,” he said about scientists’ lives. Meanwhile, the free speech “champions” set to lead the NIH and FDA, have said \u003cem\u003enothing\u003c/em\u003e about the censorship of the administration they will soon join, thus revealing everything about their true commitment to open discussion and debate.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition to their COVID misinformation, everything that happens over the next 4 years will be the permanent legacy of these doctors. Let’s return to this column in 2029 and see whether or not scientists felt free to honestly communicate with the American public. It’s not looking good so far.\u003c/p\u003e\n\n\n\n\n\n\n\n\n                \n                    \n\n                    \n                    \n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-01-28T13:11:27-05:00",
  "modifiedTime": "2025-01-28T18:11:29Z"
}
