{
  "id": "1e94d971-4567-4691-a38b-621bb542145e",
  "title": "This triple-layer sunlight catalyst supercharges green hydrogen by 800%",
  "link": "https://www.sciencedaily.com/releases/2025/06/250623072757.htm",
  "description": "Researchers in Sweden have developed a powerful new material that dramatically boosts the ability to create hydrogen fuel from water using sunlight, making the process eight times more effective than before. This breakthrough could be key to fueling heavy transport like ships and planes with clean, renewable energy.",
  "author": "",
  "published": "Mon, 23 Jun 2025 07:27:57 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3995,
  "excerpt": "Researchers in Sweden have developed a powerful new material that dramatically boosts the ability to create hydrogen fuel from water using sunlight, making the process eight times more effective than before. This breakthrough could be key to fueling heavy transport like ships and planes with clean, renewable energy.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The chemical reaction to produce hydrogen from water is several times more effective when using a combination of new materials in three layers, according to researchers at Linköping University in Sweden. Hydrogen produced from water is a promising renewable energy source - especially if the hydrogen is produced using sunlight. The production of new petrol and diesel cars will be banned in the EU as of 2035. Electric motors are expected to become increasingly common in vehicles - but they are not suitable for all types of transport. \"Passenger cars can have a battery, but heavy trucks, ships or aircraft cannot use a battery to store the energy. For these means of transport, we need to find clean and renewable energy sources, and hydrogen is a good candidate,\" says Jianwu Sun, associate professor at Linköping University, who has led the study published in the Journal of the American Chemical Society. The LiU researchers are working on developing materials that can be used to produce hydrogen (H2) from water (H2O) by using the energy in sunlight. The research team has previously shown that a material called cubic silicon carbide (3C-SiC) has beneficial properties for facilitating the reaction where water is split into hydrogen and oxygen. The material can effectively capture the sunlight so that the energy therein can be used for hydrogen production through the photochemical water splitting reaction. In their current study, the researchers have further developed a new combined material. The new material consists of three layers: a layer of cubic silicon carbide, a layer of cobalt oxide and a catalyst material that helps to split water. \"It's a very complicated structure, so our focus in this study has been to understand the function of each layer and how it helps improve the properties of the material. The new material has eight times better performance than pure cubic silicon carbide for splitting water into hydrogen,\" says Jianwu Sun. When sunlight hits the material, electric charges are generated, which are then used to split water. A challenge in the development of materials for this application is to prevent the positive and negative charges from merging again and neutralising each other. In their study, the researchers show that by combining a layer of cubic silicon carbide with the other two layers, the material, known as Ni(OH)2/Co3O4/3C-SiC, becomes more able to separate the charges, thereby making the splitting of water more effective. Today, there is a distinction between \"grey\" and \"green\" hydrogen. Almost all hydrogen present on the market is \"grey\" hydrogen produced from a fossil fuel called natural gas or fossil gas. The production of one tonne of \"grey\" hydrogen gas causes emission of up to ten tonnes of carbon dioxide, which contributes to the greenhouse effect and climate change. \"Green\" hydrogen is produced using renewable electricity as a source of energy. The long-term goal of the LiU researchers is to be able to use only energy from the sun to drive the photochemical reaction to produce \"green\" hydrogen. Most materials under development today have an efficiency of between 1 and 3 per cent, but for commercialisation of this green hydrogen technology the target is 10 per cent efficiency. Being able to fully drive the reaction using solar energy would lower the cost of producing \"green\" hydrogen, compared to producing it using supplementary renewable electricity as is done with the technology used today. Jianwu Sun speculates that it may take around five to ten years for the research team to develop materials that reach the coveted 10 per cent limit. The research has been funded with support from, among others, the Swedish Foundation for International Cooperation in Research and Higher Education (STINT), the Olle Engkvists Stiftelse, the ÅForsk Foundation, the Carl Tryggers Stiftelse and through the Swedish Government Strategic Research Area in Advanced Functional Materials (AFM) at Linköping University.",
  "image": "https://www.sciencedaily.com/images/1920/solar-water-splitting-material.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe chemical reaction to produce hydrogen from water is several times more effective when using a combination of new materials in three layers, according to researchers at Linköping University in Sweden. Hydrogen produced from water is a promising renewable energy source - especially if the hydrogen is produced using sunlight.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe production of new petrol and diesel cars will be banned in the EU as of 2035. Electric motors are expected to become increasingly common in vehicles - but they are not suitable for all types of transport.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Passenger cars can have a battery, but heavy trucks, ships or aircraft cannot use a battery to store the energy. For these means of transport, we need to find clean and renewable energy sources, and hydrogen is a good candidate,\u0026#34; says Jianwu Sun, associate professor at Linköping University, who has led the study published in the \u003cem\u003eJournal of the American Chemical Society\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eThe LiU researchers are working on developing materials that can be used to produce hydrogen (H\u003csub\u003e2\u003c/sub\u003e) from water (H\u003csub\u003e2\u003c/sub\u003eO) by using the energy in sunlight.\u003c/p\u003e\n\u003cp\u003eThe research team has previously shown that a material called cubic silicon carbide (3C-SiC) has beneficial properties for facilitating the reaction where water is split into hydrogen and oxygen. The material can effectively capture the sunlight so that the energy therein can be used for hydrogen production through the photochemical water splitting reaction.\u003c/p\u003e\n\u003cp\u003eIn their current study, the researchers have further developed a new combined material. The new material consists of three layers: a layer of cubic silicon carbide, a layer of cobalt oxide and a catalyst material that helps to split water.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s a very complicated structure, so our focus in this study has been to understand the function of each layer and how it helps improve the properties of the material. The new material has eight times better performance than pure cubic silicon carbide for splitting water into hydrogen,\u0026#34; says Jianwu Sun.\u003c/p\u003e\n\n\n\u003cp\u003eWhen sunlight hits the material, electric charges are generated, which are then used to split water. A challenge in the development of materials for this application is to prevent the positive and negative charges from merging again and neutralising each other. In their study, the researchers show that by combining a layer of cubic silicon carbide with the other two layers, the material, known as Ni(OH)\u003csub\u003e2\u003c/sub\u003e/Co\u003csub\u003e3\u003c/sub\u003eO\u003csub\u003e4\u003c/sub\u003e/3C-SiC, becomes more able to separate the charges, thereby making the splitting of water more effective.\u003c/p\u003e\n\u003cp\u003eToday, there is a distinction between \u0026#34;grey\u0026#34; and \u0026#34;green\u0026#34; hydrogen. Almost all hydrogen present on the market is \u0026#34;grey\u0026#34; hydrogen produced from a fossil fuel called natural gas or fossil gas. The production of one tonne of \u0026#34;grey\u0026#34; hydrogen gas causes emission of up to ten tonnes of carbon dioxide, which contributes to the greenhouse effect and climate change. \u0026#34;Green\u0026#34; hydrogen is produced using renewable electricity as a source of energy.\u003c/p\u003e\n\u003cp\u003eThe long-term goal of the LiU researchers is to be able to use only energy from the sun to drive the photochemical reaction to produce \u0026#34;green\u0026#34; hydrogen. Most materials under development today have an efficiency of between 1 and 3 per cent, but for commercialisation of this green hydrogen technology the target is 10 per cent efficiency. Being able to fully drive the reaction using solar energy would lower the cost of producing \u0026#34;green\u0026#34; hydrogen, compared to producing it using supplementary renewable electricity as is done with the technology used today. Jianwu Sun speculates that it may take around five to ten years for the research team to develop materials that reach the coveted 10 per cent limit.\u003c/p\u003e\n\u003cp\u003eThe research has been funded with support from, among others, the Swedish Foundation for International Cooperation in Research and Higher Education (STINT), the Olle Engkvists Stiftelse, the ÅForsk Foundation, the Carl Tryggers Stiftelse and through the Swedish Government Strategic Research Area in Advanced Functional Materials (AFM) at Linköping University.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
