{
  "id": "225fcbe1-960a-414d-95fb-520d0242191a",
  "title": "Key gene discovered for regulating rice grain length",
  "link": "https://phys.org/news/2024-10-key-gene-rice-grain-length.html",
  "description": "Recently, a research team led by Professor Wu Yuejin from the Hefei Institutes of Physical Science of the Chinese Academy of Sciences, discovered a key gene that can influence rice grain length by regulating cell proliferation, the RGL2 gene. This provides new genetic resources for high-yield breeding of rice. The related findings were recently published in Physiologia Plantarum.",
  "author": "",
  "published": "Thu, 10 Oct 2024 16:53:02 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Molecular \u0026 Computational biology Agriculture"
  ],
  "byline": "Zhao Weiwei",
  "length": 2966,
  "excerpt": "Recently, a research team led by Professor Wu Yuejin from the Hefei Institutes of Physical Science of the Chinese Academy of Sciences, discovered a key gene that can influence rice grain length by regulating cell proliferation, the RGL2 gene. This provides new genetic resources for high-yield breeding of rice. The related findings were recently published in Physiologia Plantarum.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "The physical interaction between RGL2 and RGB1. Credit: Cheng Weimin Recently, a research team led by Professor Wu Yuejin from the Hefei Institutes of Physical Science of the Chinese Academy of Sciences, discovered a key gene that can influence rice grain length by regulating cell proliferation, the RGL2 gene. This provides new genetic resources for high-yield breeding of rice. The related findings were recently published in Physiologia Plantarum. High yield is one of the primary objectives in rice breeding, and grain type like grain length and width is an important agronomic trait affecting yield. Wu's team obtained this rgl2 mutant in their research, which exhibited shorter grain length without changes in grain width through physical mutagenesis. Cytological analysis revealed that the reduction in grain length was primarily due to a decrease in cell number rather than changes in cell length. Mapping and functional analysis indicated that RGL2 encoded a keratin-associated protein (KAP), which was expressed at a higher level in the young panicle. Overexpression of RGL2 significantly increased grain length and enhanced single-plant yield by promoting cell proliferation in the grain. Phenotypic analysis of rgl2 mutant. Credit: Cheng Weimin Additionally, OsRGL2 interacted with the RGB1 protein, suggesting that it may positively regulate grain type and yield through the G protein signaling pathway. The researchers also found that RGL2 might affect grain length by regulating the cell cycle. In simple terms, RGL2 helped rice grains grow longer by regulating genes related to cell cycle and promoting the growth of more cells. This discovery not only deepens our understanding of the genetic mechanisms of rice grain type, but also provides new strategies and directions for molecular design breeding aimed at high rice yield. More information: Chunpeng Chen et al, Mutation of KAP, which encodes a keratin‐associated protein, affects grain size and yield production in rice, Physiologia Plantarum (2024). DOI: 10.1111/ppl.14528 Citation: Key gene discovered for regulating rice grain length (2024, October 10) retrieved 11 October 2024 from https://phys.org/news/2024-10-key-gene-rice-grain-length.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/novel-discovery-unveil.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/novel-discovery-unveil.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/novel-discovery-unveil.jpg\" data-sub-html=\"The physical interaction between RGL2 and RGB1. Credit: Cheng Weimin\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/novel-discovery-unveil.jpg\" alt=\"Novel discovery unveils the gene secret of rice length\" title=\"The physical interaction between RGL2 and RGB1. Credit: Cheng Weimin\" width=\"800\" height=\"366\"/\u003e\n             \u003cfigcaption\u003e\n                The physical interaction between RGL2 and RGB1. Credit: Cheng Weimin\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eRecently, a research team led by Professor Wu Yuejin from the Hefei Institutes of Physical Science of the Chinese Academy of Sciences, discovered a key gene that can influence rice grain length by regulating cell proliferation, the RGL2 gene. This provides new genetic resources for high-yield breeding of rice. The related findings were recently \u003ca href=\"https://onlinelibrary.wiley.com/doi/10.1111/ppl.14528\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003ePhysiologia Plantarum\u003c/i\u003e.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eHigh yield is one of the primary objectives in rice breeding, and grain type like grain length and width is an important agronomic trait affecting yield. Wu\u0026#39;s team obtained this rgl2 mutant in their research, which exhibited shorter grain length without changes in grain width through physical mutagenesis.\u003c/p\u003e\n\u003cp\u003eCytological analysis revealed that the reduction in grain length was primarily due to a decrease in cell number rather than changes in cell length. Mapping and \u003ca href=\"https://phys.org/tags/functional+analysis/\" rel=\"tag\"\u003efunctional analysis\u003c/a\u003e indicated that RGL2 encoded a keratin-associated protein (KAP), which was expressed at a higher level in the young panicle. Overexpression of RGL2 significantly increased grain length and enhanced single-plant yield by promoting \u003ca href=\"https://phys.org/tags/cell+proliferation/\" rel=\"tag\"\u003ecell proliferation\u003c/a\u003e in the grain.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/novel-discovery-unveil-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2024/novel-discovery-unveil-1.jpg\" data-sub-html=\"Phenotypic analysis of rgl2 mutant. Credit: Cheng Weimin\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/novel-discovery-unveil-1.jpg\" alt=\"Novel discovery unveils the gene secret of rice length\" title=\"Phenotypic analysis of rgl2 mutant. Credit: Cheng Weimin\"/\u003e\n             \u003cfigcaption\u003e\n                Phenotypic analysis of rgl2 mutant. Credit: Cheng Weimin\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eAdditionally, OsRGL2 interacted with the RGB1 protein, suggesting that it may positively regulate grain type and yield through the G protein signaling pathway.\u003c/p\u003e\n\u003cp\u003eThe researchers also found that RGL2 might affect grain length by regulating the \u003ca href=\"https://phys.org/tags/cell+cycle/\" rel=\"tag\"\u003ecell cycle\u003c/a\u003e. In simple terms, RGL2 helped rice grains grow longer by regulating genes related to cell cycle and promoting the growth of more cells.\u003c/p\u003e\n\u003cp\u003eThis discovery not only deepens our understanding of the genetic mechanisms of rice grain type, but also provides new strategies and directions for molecular design breeding aimed at high rice yield.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tChunpeng Chen et al, Mutation of KAP, which encodes a keratin‐associated protein, affects grain size and yield production in rice, \u003ci\u003ePhysiologia Plantarum\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1111/ppl.14528\" target=\"_blank\"\u003eDOI: 10.1111/ppl.14528\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tKey gene discovered for regulating rice grain length (2024, October 10)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 11 October 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-10-key-gene-rice-grain-length.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-10T16:53:02-04:00",
  "modifiedTime": null
}
