{
  "id": "22d42553-50ba-4aa9-8190-6905fab85928",
  "title": "How the coronavirus defeats the innate immune response",
  "link": "https://www.sciencedaily.com/releases/2024/10/241022132635.htm",
  "description": "SARS-CoV-2 has an enzyme that can counteract a cell's innate defense mechanism against viruses, explaining why it is more infectious than the previous SARS and MERS-causing viruses. The discovery may point the way to the development of more effective drugs against this and possibly similar, future diseases.",
  "author": "",
  "published": "Tue, 22 Oct 2024 13:26:35 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3515,
  "excerpt": "SARS-CoV-2 has an enzyme that can counteract a cell's innate defense mechanism against viruses, explaining why it is more infectious than the previous SARS and MERS-causing viruses. The discovery may point the way to the development of more effective drugs against this and possibly similar, future diseases.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The novel coronavirus SARS-CoV-2 has an enzyme that can counteract a cell's innate defense mechanism against viruses, explaining why it is more infectious than the previous SARS and MERS-causing viruses. The Kobe University discovery may point the way to the development of more effective drugs against this and possibly similar, future diseases. When a virus attacks, the body's immune response has two basic layers of defense: the innate and the adaptive immune systems. While the adaptive immune system grows stronger against a specific pathogen as the body is exposed to it multiple times and which forms the basis of vaccinations, the innate immune system is an assortment of molecular mechanisms that work against a broad range of pathogens at a basic level. The Kobe University virologist SHOJI Ikuo says, \"The new coronavirus, however, is so infectious that we wondered what clever mechanisms the virus employs to evade the innate immune system so effectively.\" Shoji's team previously worked on the immune response to hepatitis viruses and investigated the role of a molecular tag called \"ISG15\" the innate immune system attaches to the virus's building blocks. Having learned that the novel coronavirus has an enzyme that is especially effective in removing this tag, he decided to use his team's expertise to elucidate the effect of the ISG15 tag on the coronavirus and the mechanism of the virus's countermeasures. In a paper in the Journal of Virology, the Kobe University-led team is now the first to report that the ISG15 tag gets attached to a specific location on the virus's nucleocapsid protein, the scaffold that packages the pathogen's genetic material. For the virus to assemble, many copies of the nucleocapsid protein need to attach to each other, but the ISG15 tag prevents this, which is the mechanism behind the tag's antiviral action. \"However, the novel coronavirus also has an enzyme that can remove the tags from its nucleocapsid, recovering its ability to assemble new viruses and thus overcoming the innate immune response,\" explains Shoji. The novel coronavirus shares many traits with the SARS and MERS viruses, which all belong to the same family of viruses. And these viruses, too, have an enzyme that can remove the ISG15 tag. However, Shoji's team found that their versions are less efficient at it than the one in the novel coronavirus. And in fact, it has been reported recently that the previous viruses' enzymes have a different primary target. \"These results suggest that the novel coronavirus is simply better at evading this aspect of the innate immune system's defense mechanism, which explains why it is so infectious,\" says Shoji. But understanding just why the novel coronavirus is so effective also points the way to developing more effective treatments. The Kobe University researcher explains: \"We may be able to develop new antiviral drugs if we can inhibit the function of the viral enzyme that removes the ISG15 tag. Future therapeutic strategies may also include antiviral agents that directly target the nucleocapsid protein, or a combination of these two approaches.\" This research was funded by the Kansai Economic Federation, the Hyogo Science and Technology Association (grant 3501) and the Ministry of Education, Culture, Sports, Science and Technology Japan (grant 18042-203556). It was conducted in collaboration with researchers from Universitas Gadjah Mada, Niigata University, the University of Yamanashi, Hokkaido University and Osaka University.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe novel coronavirus SARS-CoV-2 has an enzyme that can counteract a cell\u0026#39;s innate defense mechanism against viruses, explaining why it is more infectious than the previous SARS and MERS-causing viruses. The Kobe University discovery may point the way to the development of more effective drugs against this and possibly similar, future diseases.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eWhen a virus attacks, the body\u0026#39;s immune response has two basic layers of defense: the innate and the adaptive immune systems. While the adaptive immune system grows stronger against a specific pathogen as the body is exposed to it multiple times and which forms the basis of vaccinations, the innate immune system is an assortment of molecular mechanisms that work against a broad range of pathogens at a basic level. The Kobe University virologist SHOJI Ikuo says, \u0026#34;The new coronavirus, however, is so infectious that we wondered what clever mechanisms the virus employs to evade the innate immune system so effectively.\u0026#34;\u003c/p\u003e\n\u003cp\u003eShoji\u0026#39;s team previously worked on the immune response to hepatitis viruses and investigated the role of a molecular tag called \u0026#34;ISG15\u0026#34; the innate immune system attaches to the virus\u0026#39;s building blocks. Having learned that the novel coronavirus has an enzyme that is especially effective in removing this tag, he decided to use his team\u0026#39;s expertise to elucidate the effect of the ISG15 tag on the coronavirus and the mechanism of the virus\u0026#39;s countermeasures.\u003c/p\u003e\n\u003cp\u003eIn a paper in the \u003cem\u003eJournal of Virology\u003c/em\u003e, the Kobe University-led team is now the first to report that the ISG15 tag gets attached to a specific location on the virus\u0026#39;s nucleocapsid protein, the scaffold that packages the pathogen\u0026#39;s genetic material. For the virus to assemble, many copies of the nucleocapsid protein need to attach to each other, but the ISG15 tag prevents this, which is the mechanism behind the tag\u0026#39;s antiviral action. \u0026#34;However, the novel coronavirus also has an enzyme that can remove the tags from its nucleocapsid, recovering its ability to assemble new viruses and thus overcoming the innate immune response,\u0026#34; explains Shoji.\u003c/p\u003e\n\u003cp\u003eThe novel coronavirus shares many traits with the SARS and MERS viruses, which all belong to the same family of viruses. And these viruses, too, have an enzyme that can remove the ISG15 tag. However, Shoji\u0026#39;s team found that their versions are less efficient at it than the one in the novel coronavirus. And in fact, it has been reported recently that the previous viruses\u0026#39; enzymes have a different primary target. \u0026#34;These results suggest that the novel coronavirus is simply better at evading this aspect of the innate immune system\u0026#39;s defense mechanism, which explains why it is so infectious,\u0026#34; says Shoji.\u003c/p\u003e\n\u003cp\u003eBut understanding just why the novel coronavirus is so effective also points the way to developing more effective treatments. The Kobe University researcher explains: \u0026#34;We may be able to develop new antiviral drugs if we can inhibit the function of the viral enzyme that removes the ISG15 tag. Future therapeutic strategies may also include antiviral agents that directly target the nucleocapsid protein, or a combination of these two approaches.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis research was funded by the Kansai Economic Federation, the Hyogo Science and Technology Association (grant 3501) and the Ministry of Education, Culture, Sports, Science and Technology Japan (grant 18042-203556). It was conducted in collaboration with researchers from Universitas Gadjah Mada, Niigata University, the University of Yamanashi, Hokkaido University and Osaka University.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
