{
  "id": "250077a8-7d5b-4cb7-8723-50ac310b3ef7",
  "title": "Man scouring Google Earth found a mysterious scar in the Australian outback. Now we know what caused it",
  "link": "https://phys.org/news/2024-11-scouring-google-earth-mysterious-scar.html",
  "description": "Earlier this year, a caver was poring over satellite images of the Nullarbor Plain when he came across something unexpected: an enormous, mysterious scar etched into the barren landscape.",
  "author": "",
  "published": "Sun, 24 Nov 2024 14:50:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Earth Sciences Environment"
  ],
  "byline": "Matej Lipar",
  "length": 6711,
  "excerpt": "Earlier this year, a caver was poring over satellite images of the Nullarbor Plain when he came across something unexpected: an enormous, mysterious scar etched into the barren landscape.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Author provided/Google Earth Earlier this year, a caver was poring over satellite images of the Nullarbor Plain when he came across something unexpected: an enormous, mysterious scar etched into the barren landscape. The find intrigued scientists, including my colleagues and I. Upon closer investigation, we realized the scar was created by a ferocious tornado that no-one knew had occurred. We outline the findings in new research published today. Tornadoes are a known threat in the United States and elsewhere. But they also happen in Australia. Without the power of technology, this remarkable example of nature's ferocity would have gone unnoticed. It's important to study the tornado's aftermath to help us predict and prepare for the next big twister. Australia's tornado history Tornadoes are violent, spinning columns of air that drop from thunderstorms to the ground, bringing wind speeds often exceeding 200 kilometers an hour. They can cause massive destruction—uprooting trees, tearing apart buildings and throwing debris over large distances. Tornadoes have been reported on every continent except Antarctica. They most commonly occur in the Great Plains region of the United States, and in the north-east region of India–Bangladesh. The earliest observed tornado in Australia occurred in 1795 in the suburbs of Sydney. But a tornado was not scientifically confirmed here until the late 1800s. In recent decades, documented instances in Australia include a 2013 tornado that crossed north-east Victoria and traveled up to the New South Wales border. It brought winds between 250 and 300 kilometers an hour and damaged Murray River townships. And in 2016, a severe storm produced at least seven tornadoes in central and eastern parts of South Australia. It's important for scientists to accurately predict tornadoes, so we can issue warnings to communities. That's why the Nullarbor tornado scar was useful to study. A whirlwind mystery The Nullarbor Plain is a remote, dry, treeless stretch of land in southern Australia. The man who discovered the scar had been using Google Earth satellite imagery to search the Nullabor for caves or other karst features. Karst is a landscape underlain by limestone featuring distinctive landforms. The discovery of the scar came to the attention of my colleagues and I through the collaborative network of researchers and explorers who study the Nullarbor karst. The scar stretches from Western Australia over the border to South Australia. It lies 20 kilometers north of the Trans-Australian Railway and 90 kilometers east-north-east of Forrest, a former railway settlement. We compared satellite imagery of the site over several years to determine that the tornado occurred between November 16 and 18, 2022. Blue circular patterns appeared alongside the scar, indicating pools of water associated with heavy rain. My colleagues and I then traveled to the site in May this year to examine and photograph the scar and the neighboring landscape. Our results have been published today in the Journal of Southern Hemisphere Earth Systems Science. Map showing tornado events in Western Australia and South Australia between 1795 and 2014. The location of the tornado scar in the study is shown with a red dot. Credit: Severe Thunderstorm Archive/Australian Bureau of Meteorology What we found The scar is 11 kilometers long and between 160 and 250 meters wide. It bears striking patterns called \"cycloidal marks,\" formed by tornado suction vortexes. This suggests the tornado was no ordinary storm but in the strong F2 or F3 category, spinning with destructive winds of more than 200 kilometers an hour. The tornado probably lasted between seven and 13 minutes. Features of the scar suggest the whirling wind within the tornado was moving in a clockwise direction. We also think the tornado moved from west to east—which is consistent with the direction of a strong cold front in the region at the time. 'Cycloidal marks' in the tornado scar, caused by multiple vortexes. Credit: Google Earth satellite imagery Local weather observations also recorded intensive cloud cover and rainfall during that period in November 2022. Unlike tornadoes that hit populated areas, this one did not damage homes or towns. But it left its mark nonetheless, eroding soil and vegetation and reshaping the Earth's surface. Remarkably, the scar was still clearly visible 18 months after the event, both in satellite images and on the ground. This is probably because vegetation grows slowly in this dry landscape, so hadn't yet covered the erosion. Predict and prepare This fascinating discovery on the Nullarbor Plain shows how powerful and unpredictable nature can be—sometimes without us knowing. Only three tornadoes have previously been documented on the Nullarbor Plain. This is likely because the area is remote with few eye-witnesses, and because the events do not damage properties and infrastructure. Interestingly, those three tornadoes occurred in November, just like this one. Our research provides valuable insights into the tornadoes in this remote and little-studied region. It helps us understand when, and in what conditions, these types of tornadoes occur. It also emphasizes the importance of satellite imagery in identifying and analyzing weather phenomena in remote locations, and in helping us predict and prepare for the next big event. And finally, the results are a stark reminder that extreme weather can strike anywhere, anytime. More information: Matej Lipar et al, Tornado scar on the Nullarbor Plain, Australia, Journal of Southern Hemisphere Earth Systems Science (2024). DOI: 10.1071/ES24023",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/a-man-scouring-google.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1187288\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2024/a-man-scouring-google.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google.jpg\" width=\"800\" height=\"394\" alt=\"A man scouring Google Earth found a mysterious scar in the Australian outback—and now scientists know what caused it\" title=\"Credit: Author provided/Google Earth\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Author provided/Google Earth\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eEarlier this year, a caver was poring over satellite images of the Nullarbor Plain when he came across something unexpected: an enormous, mysterious scar etched into the barren landscape.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThe find intrigued scientists, including my colleagues and I. Upon closer investigation, we realized the scar was created by a ferocious tornado that no-one knew had occurred. We outline the findings in \u003ca href=\"https://doi.org/10.1071/ES24023\" target=\"_blank\"\u003enew research\u003c/a\u003e published today.\u003c/p\u003e\n\u003cp\u003eTornadoes are a known threat in the United States and elsewhere. But they also \u003ca href=\"https://doi.org/10.1016/j.atmosres.2016.03.011\" target=\"_blank\"\u003ehappen in Australia\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWithout the power of technology, this remarkable example of nature\u0026#39;s ferocity would have gone unnoticed. It\u0026#39;s important to study the tornado\u0026#39;s aftermath to help us predict and prepare for the next big twister.\u003c/p\u003e\n\u003ch2\u003eAustralia\u0026#39;s tornado history\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://doi.org/10.1007/978-3-642-05381-8\" target=\"_blank\"\u003eTornadoes\u003c/a\u003e are violent, spinning columns of air that drop from thunderstorms to the ground, bringing \u003ca href=\"https://phys.org/tags/wind+speeds/\" rel=\"tag\"\u003ewind speeds\u003c/a\u003e often exceeding 200 kilometers an hour. They can cause massive destruction—uprooting trees, tearing apart buildings and throwing debris over large distances.\u003c/p\u003e\n\u003cp\u003eTornadoes have been reported on every continent except Antarctica. They most commonly occur in the Great Plains region of the United States, and in the north-east region of India–Bangladesh.\u003c/p\u003e\n\u003cp\u003eThe earliest observed tornado in Australia occurred in 1795 in the suburbs of Sydney. But a tornado was not scientifically confirmed here until the late 1800s.\u003c/p\u003e\n\u003cp\u003eIn recent decades, documented instances in Australia include a \u003ca href=\"https://knowledge.aidr.org.au/resources/tornado-murray-river-townships-victoria-2013/#:~:text=Tornado%20-%20Murray%20River%20townships%2C%202013\u0026amp;text=At%20approximately%208.00pm%20on,border%20of%20New%20South%20Wales.\" target=\"_blank\"\u003e2013 tornado\u003c/a\u003e that crossed north-east Victoria and traveled up to the New South Wales border. It brought winds between 250 and 300 kilometers an hour and damaged Murray River townships.\u003c/p\u003e\n\u003cp\u003eAnd in 2016, a \u003ca href=\"https://phys.org/tags/severe+storm/\" rel=\"tag\"\u003esevere storm\u003c/a\u003e produced at least seven tornadoes in central and eastern parts of South Australia.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s important for scientists to accurately predict tornadoes, so we can issue warnings to communities. That\u0026#39;s why the Nullarbor tornado scar was useful to study.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eA whirlwind mystery\u003c/h2\u003e\n\u003cp\u003eThe Nullarbor Plain is a remote, dry, treeless stretch of land in southern Australia. The man who discovered the scar had been using Google Earth satellite imagery to search the Nullabor for \u003ca href=\"https://doi.org/10.1007/978-3-031-24267-0_11\" target=\"_blank\"\u003ecaves\u003c/a\u003e or other karst features.\u003c/p\u003e\n\u003cp\u003eKarst is a landscape underlain by limestone featuring distinctive landforms. The discovery of the scar came to the attention of my colleagues and I through the collaborative network of researchers and explorers who study the Nullarbor karst.\u003c/p\u003e\n\u003cp\u003eThe scar stretches from Western Australia over the border to South Australia. It lies 20 kilometers north of the \u003ca href=\"https://www.nma.gov.au/defining-moments/resources/trans-australian-railway\" target=\"_blank\"\u003eTrans-Australian Railway\u003c/a\u003e and 90 kilometers east-north-east of Forrest, a former railway settlement.\u003c/p\u003e\n\u003cp\u003eWe compared satellite imagery of the site over several years to determine that the tornado occurred between November 16 and 18, 2022. Blue circular patterns appeared alongside the scar, indicating pools of water associated with heavy rain.\u003c/p\u003e\n\u003cp\u003eMy colleagues and I then traveled to the site in May this year to examine and photograph the scar and the neighboring landscape.\u003c/p\u003e\n\u003cp\u003eOur results have been \u003ca href=\"https://doi.org/10.1071/ES24023\" target=\"_blank\"\u003epublished today\u003c/a\u003e in the \u003ci\u003eJournal of Southern Hemisphere Earth Systems Science\u003c/i\u003e.\u003c/p\u003e\n\n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1187289\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/2024/a-man-scouring-google-1.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-1.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google-1.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-1.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google-1.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-1.jpg\" width=\"800\" height=\"420\" alt=\"A man scouring Google Earth found a mysterious scar in the Australian outback—and now scientists know what caused it\" title=\"Map showing tornado events in Western Australia and South Australia between 1795 and 2014. The location of the tornado scar in the study is shown with a red dot. Credit: Severe Thunderstorm Archive/Australian Bureau of Meteorology\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eMap showing tornado events in Western Australia and South Australia between 1795 and 2014. The location of the tornado scar in the study is shown with a red dot. Credit: Severe Thunderstorm Archive/Australian Bureau of Meteorology\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\n\n                                                                                  \n                                                                    \u003ch2\u003eWhat we found\u003c/h2\u003e\n\u003cp\u003eThe scar is 11 kilometers long and between 160 and 250 meters wide. It bears striking patterns called \u0026#34;cycloidal marks,\u0026#34; formed by tornado suction vortexes. This suggests the tornado was no ordinary storm but in the strong \u003ca href=\"https://ntrs.nasa.gov/citations/19720008829\" target=\"_blank\"\u003eF2 or F3\u003c/a\u003e category, spinning with destructive winds of more than 200 kilometers an hour.\u003c/p\u003e\n\u003cp\u003eThe tornado probably lasted between seven and 13 minutes. Features of the scar suggest the whirling wind within the tornado was moving in a clockwise direction. We also think the tornado moved from west to east—which is consistent with the direction of a strong cold front in the region at the time.\u003c/p\u003e\n\n\n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1187290\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/2024/a-man-scouring-google-2.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-2.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google-2.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-2.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/a-man-scouring-google-2.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-man-scouring-google-2.jpg\" width=\"800\" height=\"453\" alt=\"A man scouring Google Earth found a mysterious scar in the Australian outback—and now scientists know what caused it\" title=\"\u0026#39;Cycloidal marks\u0026#39; in the tornado scar, caused by multiple vortexes. Credit: Google Earth satellite imagery\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003e\u0026#39;Cycloidal marks\u0026#39; in the tornado scar, caused by multiple vortexes. Credit: Google Earth satellite imagery\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cp\u003eLocal weather observations also recorded intensive cloud cover and rainfall during that period in November 2022.\u003c/p\u003e\n\u003cp\u003eUnlike tornadoes that hit populated areas, this one did not damage homes or towns. But it left its mark nonetheless, eroding soil and vegetation and reshaping the Earth\u0026#39;s surface.\u003c/p\u003e\n\u003cp\u003eRemarkably, the \u003ca href=\"https://phys.org/tags/scar/\" rel=\"tag\"\u003escar\u003c/a\u003e was still clearly visible 18 months after the event, both in satellite images and on the ground. This is probably because vegetation grows slowly in this dry landscape, so hadn\u0026#39;t yet covered the erosion.\u003c/p\u003e\n\u003ch2\u003ePredict and prepare\u003c/h2\u003e\n\u003cp\u003eThis fascinating discovery on the Nullarbor Plain shows how powerful and unpredictable nature can be—sometimes without us knowing.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eOnly three tornadoes have previously been documented on the Nullarbor Plain. This is likely because the area is remote with few eye-witnesses, and because the events do not damage properties and infrastructure. Interestingly, those three tornadoes occurred in November, just like this one.\u003c/p\u003e\n\u003cp\u003eOur research provides valuable insights into the tornadoes in this remote and little-studied region. It helps us understand when, and in what conditions, these types of \u003ca href=\"https://phys.org/tags/tornadoes/\" rel=\"tag\"\u003etornadoes\u003c/a\u003e occur.\u003c/p\u003e\n\u003cp\u003eIt also emphasizes the importance of \u003ca href=\"https://phys.org/tags/satellite+imagery/\" rel=\"tag\"\u003esatellite imagery\u003c/a\u003e in identifying and analyzing weather phenomena in \u003ca href=\"https://phys.org/tags/remote+locations/\" rel=\"tag\"\u003eremote locations\u003c/a\u003e, and in helping us predict and prepare for the next big event.\u003c/p\u003e\n\u003cp\u003eAnd finally, the results are a stark reminder that extreme weather can strike anywhere, anytime.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Matej Lipar et al, Tornado scar on the Nullarbor Plain, Australia, \u003ci\u003eJournal of Southern Hemisphere Earth Systems Science\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1071/ES24023\" target=\"_blank\"\u003eDOI: 10.1071/ES24023\u003c/a\u003e\n                            \u003c/p\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                                    \n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-24T14:50:01-05:00",
  "modifiedTime": null
}
