{
  "id": "283934f4-f25b-4670-9a67-b202ee6b9629",
  "title": "On Mexico’s Caribbean Coast, There’s Lobster for the Tourists and Microplastics for Everyone Else",
  "link": "https://www.wired.com/story/on-mexicos-caribbean-coast-theres-lobster-for-the-tourists-and-microplastics-for-everyone-else/",
  "description": "The fishermen of Puerto Morelos complain of pirates who fish off-season with total impunity, while their small catches are contaminated by the abundant microplastics in the sea.",
  "author": "Ricardo Hernández",
  "published": "Mon, 07 Jul 2025 10:42:39 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Science / Environment",
    "Pollution"
  ],
  "byline": "Ricardo Hernández",
  "length": 8605,
  "excerpt": "The fishermen of Puerto Morelos complain of pirates who fish off-season with total impunity, while their small catches are contaminated by the abundant microplastics in the sea.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "All products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.The fishermen of Puerto Morelos, on Mexico’s Caribbean coast, risk their lives every time they head out to sea to fish or dive for lobsters. Their bounty is dependent on luck, as the weather often makes it impossible to go out, while on other days the hooks they cast come back empty. These workers set out every day to find the best lobsters possible for the affluent vacationers who come to the region, while they and their families, cut off from many of the benefits of tourism development, get by on fish full of microplastics.Omar Oslet Rivera-Garibay, a researcher at the Institute of Marine Sciences and Limnology at the Universidad Nacional Autónoma de México, documented the lives of these fishermen in a recent study. He and his colleagues report that while members of the Pescadores de Puerto Morelos fishing cooperative harvest and sell high-value seafood products to satisfy tourists’ appetites, they are left with only the fish caught near the town’s beaches for their own consumption. It has little commercial value and is contaminated with tiny plastic fragments.As part of their research, Rivera-Garibay and the team captured 424 fish from 29 different species using the same methods as the cooperative’s partners. All were dissected, and their digestive tracts removed and examined. Contaminants were found in 57 percent of the fish, with over a thousand microplastic particles recovered. The research noted that “fish caught with handlines in shallow waters near the coast had significantly more microplastics in their intestines than those caught in deeper waters.”During the closed season, the cooperative’s members only use methods such as this “rosary line” with multiple lures. Photograph: Ricardo HernándezHandline fishing is a traditional method that has long been used in the shallow waters near Puerto Morelos. It consists simply of a line and a hook, and can be used to catch fish such as croaker, which can be eaten but have little commercial value. Two other methods are used to catch more valuable species. A línea de rosario (“rosary line”) consists of multiple lines with a series of branched hooks, and is used in deeper waters, about 20 nautical miles from the coast. It is used to catch snapper, grouper, and pigfish. Lobster is caught by free divers using spearguns.The least-prized fish, containing more microplastics, are taken home by fishermen to feed their families; the high-value fish are sold to tourists here in the state of Quintana Roo, which each year receives more than 20 million visitors who spend more than $20 billion. Quintana Roo is the Mexican state with the highest revenue from tourism, but that doesn’t trickle down to the bottom of the population pyramid. As of 2020, 42.6 percent of the population in Puerto Morelos lived in poverty or extreme poverty, according to data from Mexico’s Secretariat of Economy.Rivera-Garibay highlights the dangers of microplastics in fish. “These species are consumed by humans. Microplastics contain potentially hazardous chemicals, such as plastic monomers and additives, and they absorb toxic contaminants from the environment, like harmful microbes and algae that may cause illnesses in humans,” Rivera-Garibay says. “However, there is still no solid evidence that the safety of seafood is compromised by microplastics. A greater understanding of the impacts of microplastics on seafood is urgently needed.”The fish caught by the cooperative’s members are stored in large coolers, waiting to be sold. Photograph: Ricardo HernándezLobster PiratesThe closed season for lobster—during which the area’s most lucrative catch cannot legally be caught—began in March. Three months have passed, and the 15 fishermen of the Puerto Morelos cooperative are feeling the effects on their finances. But while they are desperate to earn money, on the June day when I visited them, they preferred to spend the entire day sitting on dry land rather than earn ill-gotten gains from poaching.“Look at us, we’re the only bastards who follow the rules. Right now, the sea is full of pirates,” says Ezequiel Sánchez Herrera, a representative of the cooperative, referring to the hundreds of boats that poach in the Mexican Caribbean, ignoring fishing bans and other regulations. The pirates he speaks of don’t have permission to fish and are overexploiting a limited resource, without facing any legal consequences.The fishermen of Quintana Roo warn about the effects of poaching and overfishing lobsters. Fishing is taking place when it shouldn’t, juveniles are being caught, and as a result, the lobster population is falling, says Sánchez.Ezequiel Sánchez Herrera learned to fish when he was a child, and ever since then he’s always been near the sea. Photograph: Ricardo HernándezThere are days, Sánchez adds, when he feels like solving things the old-fashioned way: Going after the pirates, handing them over to the authorities, and burning their boats. “But I’m sure they’d go free and we’d be put in jail,” says this man who has been fishing since he was eight years old, who became president of the cooperative for the first time at 16, and who has never stopped seeking the best for the cooperative members and for the fishing ecosystem, even if that sometimes means sacrificing income in order to assure the health of the seas.Lobster has long been the most sought-after species in Quintana Roo, contributing around 50 percent of the value of the state’s fishing production, according to an article published this January in the journal Ería. It generates around 150 million pesos, or $8 million, in revenue in the state, according to data from the National Aquaculture and Fisheries Commission (Conapesca).Tourists sunbathe while a tour operator disembarks from his boat. Photograph: Ricardo HernándezLobster is also the economic foundation for the state’s cooperatives. Fishermen usually catch it using spearguns while free diving, which is risky. According to Sánchez, one of the cooperative’s members nearly died at the beginning of the year from decompression sickness, or “the bends.” He surfaced faster than he should have, causing nitrogen in his blood and tissues to form bubbles, which can damage tissues and block blood vessels.The closed season for lobster lasts for four months, and Sánchez and the other fishermen often find themselves struggling. “Sometimes people give me a hard time and ask why we are the only ones who respect the closed season. There’s a lot of pressure. I need to make payroll every month, pay for the members’ health insurance, and keep all the permits in order. And things have been bad, the weather has been terrible, and we haven’t been able to go out fishing. When we do go out, we catch very little. Yesterday, one bastard got only 70 pesos [less than $4] because they came back with only a few kilos of fish, and today we couldn’t go out at all because of the bad weather,” says Sánchez.A rosary line is a bundle of lines with several hooks at the ends of each one. Photograph: Ricardo HernándezI ask about the final destination of the fish—about their customers—and whether hotels buy most of their catch.“‘No. We stopped selling to hotels. They’re the worst. They pay on credit. If we sell them something today, they pay for it three months later. Actually, three months from when you send them the invoice. How could we survive as a cooperative like that? Imagine if I waited three months to pay a fisherman for what he brings in today,” Sánchez complains.Ería also noticed this weakness in its article about the fishing industry in the region. Cooperatives like the one in Puerto Morelos need to sell their catches quickly due to the demands of their members, and also because of inadequate storage facilities, which are usually basic storage centers without freezers or ice machines.As the cooperatives struggle, they are being replaced by private actors, experts say, with large facilities and sufficient capital that allows them to export to foreign markets, including the United States and Asia.Whatever happens, Sánchez says that they will not go out to catch lobsters until July, when the closed season ends. The cooperative’s members know that the animals need time to reproduce and grow sufficiently to ensure the long-term sustainability of the species and the future of their livelihoods.This article was originally published by WIRED en Español. It was translated by John Newton.",
  "image": "https://media.wired.com/photos/6863aea8f0b71cd10716e691/191:100/w_1280,c_limit/Todos%20los%20miembros%20de%20la%20cooperativa%20han%20desarrollado%20una%20sensibilidad%20especial%20por%20el%20mar%20y%20sus%20recursos,%20por%20eso%20saben%20que%20deben%20respetar%20las%20vedas.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cspan\u003eThe fishermen of\u003c/span\u003e Puerto Morelos, on Mexico’s Caribbean coast, risk their lives every time they head out to sea to fish or dive for lobsters. Their bounty is dependent on luck, as the weather often makes it impossible to go out, while on other days the hooks they cast come back empty. These workers set out every day to find the best lobsters possible for the affluent vacationers who come to the region, while they and their families, cut off from many of the benefits of tourism development, get by on fish full of microplastics.\u003c/p\u003e\u003cp\u003eOmar Oslet Rivera-Garibay, a researcher at the Institute of Marine Sciences and Limnology at the Universidad Nacional Autónoma de México, documented the lives of these fishermen \u003ca data-offer-url=\"https://link.springer.com/article/10.1007/s00227-024-04399-1\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://link.springer.com/article/10.1007/s00227-024-04399-1\u0026#34;}\" href=\"https://link.springer.com/article/10.1007/s00227-024-04399-1\" rel=\"nofollow noopener\" target=\"_blank\"\u003ein a recent study\u003c/a\u003e. He and his colleagues report that while members of the Pescadores de Puerto Morelos fishing cooperative harvest and sell high-value seafood products to satisfy tourists’ appetites, they are left with only the fish caught near the town’s beaches for their own consumption. It has little commercial value and is contaminated with tiny plastic fragments.\u003c/p\u003e\u003cp\u003eAs part of their research, Rivera-Garibay and the team captured 424 fish from 29 different species using the same methods as the cooperative’s partners. All were dissected, and their digestive tracts removed and examined. Contaminants were found in 57 percent of the fish, with over a thousand microplastic particles recovered. The research noted that “fish caught with handlines in shallow waters near the coast had significantly more microplastics in their intestines than those caught in deeper waters.”\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eDuring the closed season, the cooperative’s members only use methods such as this “rosary line” with multiple lures.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ricardo Hernández\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eHandline fishing is a traditional method that has long been used in the shallow waters near Puerto Morelos. It consists simply of a line and a hook, and can be used to catch fish such as croaker, which can be eaten but have little commercial value. Two other methods are used to catch more valuable species. A \u003cem\u003elínea de\u003c/em\u003e \u003cem\u003erosario\u003c/em\u003e (“rosary line”) consists of multiple lines with a series of branched hooks, and is used in deeper waters, about 20 nautical miles from the coast. It is used to catch snapper, grouper, and pigfish. Lobster is caught by free divers using spearguns.\u003c/p\u003e\u003cp\u003eThe least-prized fish, containing more microplastics, are taken home by fishermen to feed their families; the high-value fish are sold to tourists here in the state of Quintana Roo, which each year receives more than 20 million visitors who spend more than $20 billion. Quintana Roo is the Mexican state with the highest revenue from tourism, but that doesn’t trickle down to the bottom of the population pyramid. As of 2020, 42.6 percent of the population in Puerto Morelos lived in poverty or extreme poverty, according to data from Mexico’s Secretariat of Economy.\u003c/p\u003e\u003cp\u003eRivera-Garibay highlights the dangers of microplastics in fish. “These species are consumed by humans. Microplastics contain potentially hazardous chemicals, such as plastic monomers and additives, and they absorb toxic contaminants from the environment, like harmful microbes and algae that may cause illnesses in humans,” Rivera-Garibay says. “However, there is still no solid evidence that the safety of seafood is compromised by microplastics. A greater understanding of the impacts of microplastics on seafood is urgently needed.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe fish caught by the cooperative’s members are stored in large coolers, waiting to be sold.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ricardo Hernández\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003ch2\u003eLobster Pirates\u003c/h2\u003e\u003cp\u003eThe closed season for lobster—during which the area’s most lucrative catch cannot legally be caught—began in March. Three months have passed, and the 15 fishermen of the Puerto Morelos cooperative are feeling the effects on their finances. But while they are desperate to earn money, on the June day when I visited them, they preferred to spend the entire day sitting on dry land rather than earn ill-gotten gains from poaching.\u003c/p\u003e\u003cp\u003e“Look at us, we’re the only bastards who follow the rules. Right now, the sea is full of pirates,” says Ezequiel Sánchez Herrera, a representative of the cooperative, referring to the hundreds of boats that poach in the Mexican Caribbean, ignoring fishing bans and other regulations. The pirates he speaks of don’t have permission to fish and are overexploiting a limited resource, without facing any legal consequences.\u003c/p\u003e\u003cp\u003eThe fishermen of Quintana Roo warn about the effects of poaching and overfishing lobsters. Fishing is taking place when it shouldn’t, juveniles are being caught, and as a result, the lobster population is falling, says Sánchez.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eEzequiel Sánchez Herrera learned to fish when he was a child, and ever since then he’s always been near the sea.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ricardo Hernández\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThere are days, Sánchez adds, when he feels like solving things the old-fashioned way: Going after the pirates, handing them over to the authorities, and burning their boats. “But I’m sure they’d go free and we’d be put in jail,” says this man who has been fishing since he was eight years old, who became president of the cooperative for the first time at 16, and who has never stopped seeking the best for the cooperative members and for the fishing ecosystem, even if that sometimes means sacrificing income in order to assure the health of the seas.\u003c/p\u003e\u003cp\u003eLobster has long been the most sought-after species in Quintana Roo, contributing around 50 percent of the value of the state’s fishing production, according to an article \u003ca data-offer-url=\"https://reunido.uniovi.es/index.php/RCG/issue/view/1475\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://reunido.uniovi.es/index.php/RCG/issue/view/1475\u0026#34;}\" href=\"https://reunido.uniovi.es/index.php/RCG/issue/view/1475\" rel=\"nofollow noopener\" target=\"_blank\"\u003epublished this January\u003c/a\u003e in the journal Ería. It generates around 150 million pesos, or $8 million, in revenue in the state, according to data from the National Aquaculture and Fisheries Commission (Conapesca).\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTourists sunbathe while a tour operator disembarks from his boat.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ricardo Hernández\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eLobster is also the economic foundation for the state’s cooperatives. Fishermen usually catch it using spearguns while free diving, which is risky. According to Sánchez, one of the cooperative’s members nearly died at the beginning of the year from decompression sickness, or “the bends.” He surfaced faster than he should have, causing nitrogen in his blood and tissues to form bubbles, which can damage tissues and block blood vessels.\u003c/p\u003e\u003cp\u003eThe closed season for lobster lasts for four months, and Sánchez and the other fishermen often find themselves struggling. “Sometimes people give me a hard time and ask why we are the only ones who respect the closed season. There’s a lot of pressure. I need to make payroll every month, pay for the members’ health insurance, and keep all the permits in order. And things have been bad, the weather has been terrible, and we haven’t been able to go out fishing. When we do go out, we catch very little. Yesterday, one bastard got only 70 pesos [less than $4] because they came back with only a few kilos of fish, and today we couldn’t go out at all because of the bad weather,” says Sánchez.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA rosary line is a bundle of lines with several hooks at the ends of each one.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ricardo Hernández\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eI ask about the final destination of the fish—about their customers—and whether hotels buy most of their catch.\u003c/p\u003e\u003cp\u003e“‘No. We stopped selling to hotels. They’re the worst. They pay on credit. If we sell them something today, they pay for it three months later. Actually, three months from when you send them the invoice. How could we survive as a cooperative like that? Imagine if I waited three months to pay a fisherman for what he brings in today,” Sánchez complains.\u003c/p\u003e\u003cp\u003eEría also noticed this weakness in its article about the fishing industry in the region. Cooperatives like the one in Puerto Morelos need to sell their catches quickly due to the demands of their members, and also because of inadequate storage facilities, which are usually basic storage centers without freezers or ice machines.\u003c/p\u003e\u003cp\u003eAs the cooperatives struggle, they are being replaced by private actors, experts say, with large facilities and sufficient capital that allows them to export to foreign markets, including the United States and Asia.\u003c/p\u003e\u003cp\u003eWhatever happens, Sánchez says that they will not go out to catch lobsters until July, when the closed season ends. The cooperative’s members know that the animals need time to reproduce and grow sufficiently to ensure the long-term sustainability of the species and the future of their livelihoods.\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis article was originally published by\u003c/em\u003e \u003ca href=\"https://es.wired.com/articulos/en-quintana-roo-langosta-para-el-turista-microplasticos-para-el-resto\"\u003eWIRED \u003cem\u003een Español\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e \u003cem\u003eIt was translated by John Newton.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-07-07T06:42:39.533-04:00",
  "modifiedTime": "2025-07-07T10:42:39.533Z"
}
