{
  "id": "29ffd3e9-e906-494a-9673-b50b90ac207b",
  "title": "Study finds key protein aids nutrient transport within plant cells",
  "link": "https://phys.org/news/2024-10-key-protein-aids-nutrient-cells.html",
  "description": "Botanists have come to understand the channels and transporters involved in the uptake and transport of nutrients, yet how are they positioned where they need to be?",
  "author": "",
  "published": "Tue, 29 Oct 2024 21:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Molecular \u0026 Computational biology Agriculture"
  ],
  "byline": "Osaka Metropolitan University",
  "length": 3270,
  "excerpt": "Botanists have come to understand the channels and transporters involved in the uptake and transport of nutrients, yet how are they positioned where they need to be?",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "The KNS3-KNSTH1-KNSTH2 complex acts as a cargo receptor for the transport of boric acid channels from the endoplasmic reticulum to the plasma membrane. Credit: Osaka Metropolitan University Botanists have come to understand the channels and transporters involved in the uptake and transport of nutrients, yet how are they positioned where they need to be? For example, plants need boron, which is taken into the cells by molecules known as the boric acid channel. But how do the proteins that form the channel make it to the plasma membrane? A research group led by Professor Junpei Takano of Osaka Metropolitan University's Graduate School of Agriculture identified a mutant line of Arabidopsis thaliana in which the boric acid channels are not properly transported to the plasma membrane. The findings are published in the Journal of Experimental Botany. The cause was a deficiency in the protein KAONASHI3 (KNS3); the name kaonashi (Japanese for \"faceless\") was given in 2008 by a research team under Nagoya University Associate Professor Sumie Ishiguro, who is also an author of the current study. Detailed examination of the transport process of boric acid channels revealed that KNS3 and homolog proteins dubbed KNSTH1 and KNSTH2 are likely to form a protein complex. These complexes help move the boric acid channels from the endoplasmic reticulum to the Golgi apparatus, then to the plasma membrane. In addition, the pollen of Arabidopsis thaliana usually has a surface with patterns like muskmelon skin, but this pattern disappears—becomes faceless—in mutant strains that lack the protein-encoding function of the KNS3 gene, which is involved in pollen exine formation. This feature might be due to abnormal transport of a protein other than that of the boric acid channel. \"Based on the mechanism of intracellular transport of membrane proteins revealed in this study, plants might regulate nutrient uptake and pollen structure by regulating the intracellular transport of specific proteins via the KNS3-KNSTH1-KNSTH2 complex,\" stated Professor Takano. \"Our results might help uncover ways to reduce fertilizer requirements while improving crop yields.\" More information: Arabidopsis KNS3 and its two homologs mediate endoplasmic reticulum to plasma membrane traffic of boric acid channels, Journal of Experimental Botany (2024). DOI: 10.1093/jxb/erae380 Citation: Study finds key protein aids nutrient transport within plant cells (2024, October 29) retrieved 29 October 2024 from https://phys.org/news/2024-10-key-protein-aids-nutrient-cells.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2024/spirited-away-key-prot.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/spirited-away-key-prot.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2024/spirited-away-key-prot.jpg\" data-sub-html=\"The KNS3-KNSTH1-KNSTH2 complex acts as a cargo receptor for the transport of boric acid channels from the endoplasmic reticulum to the plasma membrane. Credit: Osaka Metropolitan University\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/spirited-away-key-prot.jpg\" alt=\"Spirited away: Key protein aids transport within plant cells\" title=\"The KNS3-KNSTH1-KNSTH2 complex acts as a cargo receptor for the transport of boric acid channels from the endoplasmic reticulum to the plasma membrane. Credit: Osaka Metropolitan University\" width=\"800\" height=\"450\"/\u003e\n             \u003cfigcaption\u003e\n                The KNS3-KNSTH1-KNSTH2 complex acts as a cargo receptor for the transport of boric acid channels from the endoplasmic reticulum to the plasma membrane. Credit: Osaka Metropolitan University\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eBotanists have come to understand the channels and transporters involved in the uptake and transport of nutrients, yet how are they positioned where they need to be?\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eFor example, plants need boron, which is taken into the cells by molecules known as the boric acid channel. But how do the proteins that form the channel make it to the \u003ca href=\"https://phys.org/tags/plasma+membrane/\" rel=\"tag\"\u003eplasma membrane\u003c/a\u003e?\u003c/p\u003e\n\u003cp\u003eA research group led by Professor Junpei Takano of Osaka Metropolitan University\u0026#39;s Graduate School of Agriculture identified a mutant line of Arabidopsis thaliana in which the boric acid channels are not properly transported to the plasma membrane. The findings are published in the \u003ci\u003eJournal of Experimental Botany\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eThe cause was a deficiency in the protein KAONASHI3 (KNS3); the name kaonashi (Japanese for \u0026#34;faceless\u0026#34;) was given in 2008 by a research team under Nagoya University Associate Professor Sumie Ishiguro, who is also an author of the current study.\u003c/p\u003e\n\u003cp\u003eDetailed examination of the transport process of boric acid channels revealed that KNS3 and homolog proteins dubbed KNSTH1 and KNSTH2 are likely to form a \u003ca href=\"https://phys.org/tags/protein+complex/\" rel=\"tag\"\u003eprotein complex\u003c/a\u003e. These complexes help move the boric acid channels from the \u003ca href=\"https://phys.org/tags/endoplasmic+reticulum/\" rel=\"tag\"\u003eendoplasmic reticulum\u003c/a\u003e to the Golgi apparatus, then to the plasma membrane.\u003c/p\u003e\n\u003cp\u003eIn addition, the pollen of Arabidopsis thaliana usually has a surface with patterns like muskmelon skin, but this pattern disappears—becomes faceless—in mutant strains that lack the protein-encoding function of the KNS3 gene, which is involved in pollen exine formation. This feature might be due to abnormal transport of a protein other than that of the boric acid channel.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Based on the mechanism of intracellular transport of membrane proteins revealed in this study, plants might regulate \u003ca href=\"https://phys.org/tags/nutrient+uptake/\" rel=\"tag\"\u003enutrient uptake\u003c/a\u003e and pollen structure by regulating the intracellular transport of specific proteins via the KNS3-KNSTH1-KNSTH2 complex,\u0026#34; stated Professor Takano. \u0026#34;Our results might help uncover ways to reduce fertilizer requirements while improving \u003ca href=\"https://phys.org/tags/crop+yields/\" rel=\"tag\"\u003ecrop yields\u003c/a\u003e.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tArabidopsis KNS3 and its two homologs mediate endoplasmic reticulum to plasma membrane traffic of boric acid channels, \u003ci\u003eJournal of Experimental Botany\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1093/jxb/erae380\" target=\"_blank\"\u003eDOI: 10.1093/jxb/erae380\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tStudy finds key protein aids nutrient transport within plant cells (2024, October 29)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 29 October 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-10-key-protein-aids-nutrient-cells.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-29T21:00:01-04:00",
  "modifiedTime": null
}
