{
  "id": "39b35b09-1f23-4bde-995f-047b5158b0ad",
  "title": "How much food can the world grow? International team calls for new yield potential estimates",
  "link": "https://www.sciencedaily.com/releases/2025/04/250409155025.htm",
  "description": "Agronomists question statistical methods used to predict yield potential and 'yield gaps' for major crops. In some cases, yield potential is overestimated, while in others it can be underestimated. It's important to have accurate information so that worldwide agriculture can meet the food demands of the growing global population.",
  "author": "",
  "published": "Wed, 09 Apr 2025 15:50:25 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4407,
  "excerpt": "Agronomists question statistical methods used to predict yield potential and 'yield gaps' for major crops. In some cases, yield potential is overestimated, while in others it can be underestimated. It's important to have accurate information so that worldwide agriculture can meet the food demands of the growing global population.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "An international team of agronomists is calling for a new approach to estimate crop yield potential and gaps -- information that is critical in planning how to meet growing food demand. University of Nebraska-Lincoln researchers made major contributions to the study, published online April 8 in the journal Nature Food. \"We are in a race to feed the world and to try to feed the population with the available agricultural land that we have,\" said Patricio Grassini, Sunkist Distinguished Professor of Agronomy and one of the paper's authors. To do so requires estimates that predict both yield potential, as determined by weather and soil properties, and yield gaps, which is the difference between yield potential and current farm yields, which indicates the room that exists to increase food production on existing cropland. Those estimates are essential in making investments in agricultural research and development, both from public and private sources. At issue is how best to compile those estimates. In the Nature Food paper, a team that includes scientists from Nebraska and three other institutions calls into question the statistical methods now widely used. In addition to Grassini, Husker authors of the study included Fatima Tenorio, Fernando Aramburu Merlos and Juan Rattalino Edreira, research assistant professors of agronomy. In the United States, for example, current statistical models tend to rely too heavily on best-case scenarios -- the most productive counties with the most fertile soils in a year with the most favorable weather, Grassini said. The methods also extrapolate a single yield potential across large regions with a wide diversity of climates and soils that likely would produce a similarly wide range in yield potential. \"Therefore, if you use that year as a reference, you are going to be overestimating your production potential because the best county with the best soils in the best year doesn't really represent your average climate or your most typical soil across the state,\" Grassini said. But in other parts of the world -- Africa, for example -- these models might underestimate crop yield. There, farmers may have limited access to inputs compared to producers in other areas, thus attaining yields far below what the climate can support. This statistical approach also leads to conflicting results, with production potential estimates almost doubling from one method to another. Grassini said this approach -- driven mostly by geographers and statisticians, not agronomists -- has been largely accepted, and more rigorous analysis is needed. The research team's conclusions are explained in the paper, titled \"Statistical approaches are inadequate for accurate estimation of yield potential and gaps at regional level.\" The study compared estimates of yield potential and yield gaps of major U.S. rainfed crops -- corn, soybeans and wheat -- derived from four statistical models against those derived from a \"bottom-up\" spatial scaling approach based on robust crop modeling and local weather and soil data, such as the Global Yield Gap and Water Productivity Atlas developed at Nebraska. Process-based crop models used in this study have been rigorously validated for their capacity to estimate yield potential based on experimental data from well-managed crops grown across a wide range of environments. This bottom-up approach, which better incorporates long-term data and regional variations, is clearly superior, the team found. \"I expect some controversy,\" Grassini said of the team's conclusions challenging the conventional wisdom. The approach recommended by the team should better capture yield gaps, which \"can help identify regions with largest room to increase crop production, which, in turn provides a basis to orient agricultural research and development programs.\" \"This is a call to set the record straight because if we are going to use this information to inform policy and our investments, we better make sure that the information is sound and has been validated,\" Grassini said. Additional team members included Romulo Lollato, associate professor of agronomy, Kansas State University; Sotirios Archontoulis, professor of agronomy, Iowa State University; and Antoine Couëdel, who completed his postdoctoral research at Nebraska and is a researcher at the French Agricultural Research Centre for International Development, France.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eAn international team of agronomists is calling for a new approach to estimate crop yield potential and gaps -- information that is critical in planning how to meet growing food demand.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eUniversity of Nebraska-Lincoln researchers made major contributions to the study, published online April 8 in the journal \u003cem\u003eNature Food\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We are in a race to feed the world and to try to feed the population with the available agricultural land that we have,\u0026#34; said Patricio Grassini, Sunkist Distinguished Professor of Agronomy and one of the paper\u0026#39;s authors.\u003c/p\u003e\n\u003cp\u003eTo do so requires estimates that predict both yield potential, as determined by weather and soil properties, and yield gaps, which is the difference between yield potential and current farm yields, which indicates the room that exists to increase food production on existing cropland. Those estimates are essential in making investments in agricultural research and development, both from public and private sources.\u003c/p\u003e\n\u003cp\u003eAt issue is how best to compile those estimates.\u003c/p\u003e\n\u003cp\u003eIn the Nature Food paper, a team that includes scientists from Nebraska and three other institutions calls into question the statistical methods now widely used. In addition to Grassini, Husker authors of the study included Fatima Tenorio, Fernando Aramburu Merlos and Juan Rattalino Edreira, research assistant professors of agronomy.\u003c/p\u003e\n\u003cp\u003eIn the United States, for example, current statistical models tend to rely too heavily on best-case scenarios -- the most productive counties with the most fertile soils in a year with the most favorable weather, Grassini said. The methods also extrapolate a single yield potential across large regions with a wide diversity of climates and soils that likely would produce a similarly wide range in yield potential.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;Therefore, if you use that year as a reference, you are going to be overestimating your production potential because the best county with the best soils in the best year doesn\u0026#39;t really represent your average climate or your most typical soil across the state,\u0026#34; Grassini said.\u003c/p\u003e\n\u003cp\u003eBut in other parts of the world -- Africa, for example -- these models might underestimate crop yield. There, farmers may have limited access to inputs compared to producers in other areas, thus attaining yields far below what the climate can support.\u003c/p\u003e\n\u003cp\u003eThis statistical approach also leads to conflicting results, with production potential estimates almost doubling from one method to another. Grassini said this approach -- driven mostly by geographers and statisticians, not agronomists -- has been largely accepted, and more rigorous analysis is needed.\u003c/p\u003e\n\u003cp\u003eThe research team\u0026#39;s conclusions are explained in the paper, titled \u0026#34;Statistical approaches are inadequate for accurate estimation of yield potential and gaps at regional level.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe study compared estimates of yield potential and yield gaps of major U.S. rainfed crops -- corn, soybeans and wheat -- derived from four statistical models against those derived from a \u0026#34;bottom-up\u0026#34; spatial scaling approach based on robust crop modeling and local weather and soil data, such as the Global Yield Gap and Water Productivity Atlas developed at Nebraska.\u003c/p\u003e\n\u003cp\u003eProcess-based crop models used in this study have been rigorously validated for their capacity to estimate yield potential based on experimental data from well-managed crops grown across a wide range of environments. This bottom-up approach, which better incorporates long-term data and regional variations, is clearly superior, the team found.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;I expect some controversy,\u0026#34; Grassini said of the team\u0026#39;s conclusions challenging the conventional wisdom.\u003c/p\u003e\n\u003cp\u003eThe approach recommended by the team should better capture yield gaps, which \u0026#34;can help identify regions with largest room to increase crop production, which, in turn provides a basis to orient agricultural research and development programs.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a call to set the record straight because if we are going to use this information to inform policy and our investments, we better make sure that the information is sound and has been validated,\u0026#34; Grassini said.\u003c/p\u003e\n\u003cp\u003eAdditional team members included Romulo Lollato, associate professor of agronomy, Kansas State University; Sotirios Archontoulis, professor of agronomy, Iowa State University; and Antoine Couëdel, who completed his postdoctoral research at Nebraska and is a researcher at the French Agricultural Research Centre for International Development, France.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
