{
  "id": "3ca3dc43-fc57-4ebb-9f2e-9d4abb0cd534",
  "title": "Cannabis use and cardiovascular disease",
  "link": "https://sciencebasedmedicine.org/cannabis-use-and-cardiovascular-disease/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=cannabis-use-and-cardiovascular-disease",
  "description": "New research suggests that cannabis use may be harmful and could be causing cardiovascular disease. The post Cannabis use and cardiovascular disease first appeared on Science-Based Medicine.",
  "author": "Scott Gavura",
  "published": "Thu, 12 Sep 2024 12:00:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Public Health",
    "cannabis",
    "cardiovascular disease"
  ],
  "byline": "Scott Gavura",
  "length": 11164,
  "excerpt": "New research suggests that cannabis use may be harmful and could be causing cardiovascular disease.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Cannabis use is increasingly common as a consequence of decriminalization and even legalization. With legalization in Canada, I swear that there is now seemingly no place in Toronto free of the scent of cannabis smoke. (A few weeks ago I was paddleboarding in Lake Ontario hundreds of feet from shore, and I caught a whiff of that characteristic smell – it was another paddleboarder, smoking, even further out from shore.) The health effects of cannabis use, particularly the cardiovascular risk, are not well understood. A recent study published in the Journal of the American Heart Association examined the association of cannabis use with myocardial infarction (heart attacks) stroke and coronary heard disease. The findings suggest that there may be some distinct risks with use that users should be aware of. Cannabis use in the U.S. has significantly increased, with daily or near-daily use tripling between 2002 and 2019. At the same time, the public’s perception of the drug’s risks has declined, with fewer people viewing cannabis use as highly dangerous. Little is known about the specific health risks of use, particularly for cardiovascular disease, which remains the leading cause of death. Research into cannabis use and cardiovascular disease has historically been complicated by simultaneous cigarette smoking, which is known to be be harmful. Cannabis may be linked to heart disease because its active component, delta-9-tetrahydrocannabinol (THC), can affect the cardiovascular system, with cannabinoid receptors throughout the cardiovascular system. Smoking cannabis poses additional risks due to inhaled particles. Evidence is lacking related to the distinct cardiovascular impact of cannabis, especially among non-tobacco users. The Study This paper was entitled Association of Cannabis Use With Cardiovascular Outcomes Among US Adults, with lead author Abra M. Jeffers and senior author Salomeh Keyhani, and funding for the study from the National Cancer Institute. The authors used data from the Behavioral Risk Factor Surveillance Survey (BRFSS) between 2016 and 2020, collected from adults aged 18 to 74 across 27 U.S. states and two territories. Participants were asked how many days they used cannabis in the last month, with usage categorized on a scale from 0 to 1 daily. This meant daily use was rated as 1, and anything less was a fraction of 1. Demographic, socioeconomic, and cardiovascular risk factors were also recorded, including tobacco use (never, former, current), alcohol, and e-cigarette use. The study analyzed the relationship between cannabis use and cardiovascular diseases like coronary heart disease, myocardial infarction, and stroke. This was entirely self-reported: Outcomes were assessed when respondents were asked, “Has a doctor, nurse, or other health professional ever told you that you had any of the following….?”. Coronary heart disease (CHD) was assessed by: “(Ever told) you had angina or coronary heart disease?” The lifetime occurrence of myocardial infarction (MI): “(Ever told) you had a heart attack, also called a myocardial infarction?” Stroke: “(Ever told) you had a stroke?” Statistical methods accounted for variables like age, tobacco use, and lifestyle factors. The study also explored how cannabis use affects those who never smoked tobacco and younger adults at risk for early cardiovascular disease. Sensitivity analyses compared daily users to non-users. Statistical methods were also used to adjust for the complex survey design and factors such as age, gender, and socioeconomic status. The Results Among 434,104 respondents aged 18 to 74, 4% reported daily cannabis use, while 7.1% used it less than daily. Nonuse was 88.9%. Most cannabis users smoked the products, with 73.8% reporting smoking as their method of consumption. The average respondent was 45 years old, and about half were women. The majority were White (60.2%), followed by Hispanic (19.3%) and Black (11.6%). Around 61.1% had never smoked tobacco, and 7.4% experienced coronary heart disease, myocardial infarction, or stroke, the cardiovascular conditions of interest in this study. There were significant differences between cannabis users and non-users. Adults who used cannabis daily or occasionally were more likely to also use tobacco and alcohol compared to non-users. Cannabis users showed higher rates of CHD, MI, and stroke, with the lowest rates seen in occasional users. Interestingly, cannabis users tended to have fewer other cardiovascular risk factors, such as obesity and diabetes, and were generally younger and more educated. The analysis found no significant link between daily cannabis use and CHD – risk was slightly elevated but not statistically significant. However, there was a 25% higher risk of MI (95% confidence interval, 1.07–1.46) among daily cannabis users compared to non-users, and a similar increased risk for stroke. as well as the composite of CHD, MI and stroke. The study also found that the more frequently cannabis was used, the higher the likelihood of these cardiovascular issues. Importantly, this relationship remained even after adjusting for tobacco use, suggesting cannabis has its own distinct impact on heart health, separate from smoking. In a supplemental analysis of younger adults at risk for premature cardiovascular disease (men under 55 and women under 65), cannabis use was linked to higher risks of CHD, MI and stroke, and the combined outcome of all three conditions. These associations held even when accounting for tobacco use. Among those who had never smoked tobacco or used e-cigarettes, the risk of stroke and the combined triple outcome was notably higher, suggesting a relationship between cannabis use and cardiovascular problems even in this younger population. Implications and Limitations Overall, this study found that cannabis use correlates with an increased risk of heart attack, stroke, and a combination of cardiovascular events in adults aged 18 to 74, even after controlling for factors like tobacco use, age, and lifestyle. The more frequent the cannabis use, the higher the risk observed. This association was independent of tobacco use, with similar results for people who have never smoked tobacco or used e-cigarettes. There are a number of important limitations, primarily a consequence of the design and methodology. Importantly, these findings do not establish cause and effect. While prospective studies would be needed to confirm the link between cannabis use and heart problems, that is not realistic or even ethical. Also notably, cardiovascular conditions and cannabis use were entirely self-reported, which could introduce some bias because of recall and a lack of objective measurements. The study also lacked hard data on key risk factors like blood pressure and lipid profiles. Finally, most cannabis users in the study were young, potentially underestimating the long-term cardiovascular impact. Conclusion: Cannabis use associated with adverse heart outcomes In this study, cannabis use was associated with higher risk of heart problems, even when accounting for factors like age, tobacco use, and health conditions. This risk is seen both in the general population, younger adults, and non-smokers or users of e-cigarettes. Smoking cannabis was the most common means of consumption, so the impact of other forms of consumption is less clear. However, given the cardiovascular effects of cannabinoids, risks from edibles and other dosages forms of cannabis may be real. Given the growing popularity of cannabis, as well as the decreasing perception of risk with the drug, more information is needed about how cannabis use is affecting health outcomes. Scott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada. Scott has no conflicts of interest to disclose. Disclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional. View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2014/07/Cannabis_sativa_leaf_diagnostic_venation_2012_01_23_0829_c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"640\" height=\"427\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/09/cannabis-smoking-5890427_640.jpg\" alt=\"Cannabis\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/09/cannabis-smoking-5890427_640.jpg 640w, https://sciencebasedmedicine.org/wp-content/uploads/2024/09/cannabis-smoking-5890427_640-480x320.jpg 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/09/cannabis-smoking-5890427_640-200x133.jpg 200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/09/cannabis-smoking-5890427_640-375x250.jpg 375w\" sizes=\"(max-width: 640px) 100vw, 640px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eCannabis use is increasingly common as a consequence of decriminalization and even legalization. With legalization in Canada, I swear that there is now seemingly no place in Toronto free of the scent of cannabis smoke. (A few weeks ago I was paddleboarding in Lake Ontario hundreds of feet from shore, and I caught a whiff of that characteristic smell – it was another paddleboarder, smoking, even further out from shore.) \u003c/p\u003e\n\n\n\n\u003cp\u003eThe health effects of cannabis use, particularly the cardiovascular risk, are not well understood. A recent study published in the \u003cem\u003e\u003ca href=\"https://www.ahajournals.org/doi/10.1161/JAHA.123.030178\" title=\"\"\u003eJournal of the American Heart Association\u003c/a\u003e\u003c/em\u003e examined the association of cannabis use with myocardial infarction (heart attacks) stroke and coronary heard disease. The findings suggest that there may be some distinct risks with use that users should be aware of.\u003c/p\u003e\n\n\n\n\u003cp\u003eCannabis use in the U.S. has significantly increased, with daily or near-daily use tripling between 2002 and 2019. At the same time, the public’s perception of the drug’s risks has declined, with fewer people viewing cannabis use as highly dangerous. Little is known about the specific health risks of use, particularly for cardiovascular disease, which remains the leading cause of death. Research into cannabis use and cardiovascular disease has historically been complicated by simultaneous cigarette smoking, which is known to be be harmful. Cannabis may be linked to heart disease because its active component, delta-9-tetrahydrocannabinol (THC), can affect the cardiovascular system, with cannabinoid receptors throughout the cardiovascular system. Smoking cannabis poses additional risks due to inhaled particles. Evidence is lacking related to the distinct cardiovascular impact of cannabis, especially among non-tobacco users. \u003c/p\u003e\n\n\n\n\u003ch2\u003eThe Study\u003c/h2\u003e\n\n\n\n\u003cp\u003eThis paper was entitled \u003ca href=\"https://www.ahajournals.org/doi/10.1161/JAHA.123.030178\" title=\"\"\u003eAssociation of Cannabis Use With Cardiovascular Outcomes Among US Adults\u003c/a\u003e, with lead author Abra M. Jeffers and senior author Salomeh Keyhani, and funding for the study from the National Cancer Institute. The authors used data from the \u003ca href=\"https://www.cdc.gov/brfss/index.html\" title=\"\"\u003eBehavioral Risk Factor Surveillance Survey\u003c/a\u003e (BRFSS) between 2016 and 2020, collected from adults aged 18 to 74 across 27 U.S. states and two territories. Participants were asked how many days they used cannabis in the last month, with usage categorized on a scale from 0 to 1 daily. This meant daily use was rated as 1, and anything less was a fraction of 1. Demographic, socioeconomic, and cardiovascular risk factors were also recorded, including tobacco use (never, former, current), alcohol, and e-cigarette use.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe study analyzed the relationship between cannabis use and cardiovascular diseases like coronary heart disease, myocardial infarction, and stroke. This was entirely self-reported:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eOutcomes were assessed when respondents were asked, “Has a doctor, nurse, or other health professional ever told you that you had any of the following….?”. Coronary heart disease (CHD) was assessed by: “(Ever told) you had angina or coronary heart disease?” The lifetime occurrence of myocardial infarction (MI): “(Ever told) you had a heart attack, also called a myocardial infarction?” Stroke: “(Ever told) you had a stroke?”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eStatistical methods accounted for variables like age, tobacco use, and lifestyle factors. The study also explored how cannabis use affects those who never smoked tobacco and younger adults at risk for early cardiovascular disease. Sensitivity analyses compared daily users to non-users. Statistical methods were also used to adjust for the complex survey design and factors such as age, gender, and socioeconomic status.\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe Results\u003c/h2\u003e\n\n\n\n\u003cp\u003eAmong 434,104 respondents aged 18 to 74, 4% reported daily cannabis use, while 7.1% used it less than daily. Nonuse was 88.9%. Most cannabis users smoked the products, with 73.8% reporting smoking as their method of consumption. The average respondent was 45 years old, and about half were women. The majority were White (60.2%), followed by Hispanic (19.3%) and Black (11.6%). Around 61.1% had never smoked tobacco, and 7.4% experienced coronary heart disease, myocardial infarction, or stroke, the cardiovascular conditions of interest in this study. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere were significant differences between cannabis users and non-users. Adults who used cannabis daily or occasionally were more likely to also use tobacco and alcohol compared to non-users. Cannabis users showed higher rates of CHD, MI, and stroke, with the lowest rates seen in occasional users. Interestingly, cannabis users tended to have fewer other cardiovascular risk factors, such as obesity and diabetes, and were generally younger and more educated.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe analysis found no significant link between \u003cstrong\u003edaily\u003c/strong\u003e cannabis use and CHD – risk was slightly elevated but not statistically significant. However, there was a 25% higher risk of MI (95% confidence interval, 1.07–1.46) among daily cannabis users compared to non-users, and a similar increased risk for stroke. as well as the composite of CHD, MI and stroke. The study also found that the more frequently cannabis was used, the higher the likelihood of these cardiovascular issues. Importantly, this relationship remained even after adjusting for tobacco use, suggesting \u003cstrong\u003ecannabis has its own distinct impact on heart health\u003c/strong\u003e, separate from smoking. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn a supplemental analysis of younger adults at risk for premature cardiovascular disease (men under 55 and women under 65), cannabis use was linked to higher risks of CHD, MI and stroke, and the combined outcome of all three conditions. These associations held even when accounting for tobacco use. Among those who had never smoked tobacco or used e-cigarettes, the risk of stroke and the combined triple outcome was notably higher, suggesting a relationship between cannabis use and cardiovascular problems even in this younger population.\u003c/p\u003e\n\n\n\n\u003ch2\u003eImplications and Limitations\u003c/h2\u003e\n\n\n\n\u003cp\u003eOverall, this study found that cannabis use correlates with an increased risk of heart attack, stroke, and a combination of cardiovascular events in adults aged 18 to 74, even after controlling for factors like tobacco use, age, and lifestyle. The more frequent the cannabis use, the higher the risk observed. This association was independent of tobacco use, with similar results for people who have never smoked tobacco or used e-cigarettes. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere are a number of important limitations, primarily a consequence of the design and methodology. Importantly, these findings do not establish cause and effect. While prospective studies would be needed to confirm the link between cannabis use and heart problems, that is not realistic or even ethical. Also notably, cardiovascular conditions and cannabis use were entirely self-reported, which could introduce some bias because of recall and a lack of objective measurements. The study also lacked hard data on key risk factors like blood pressure and lipid profiles. Finally, most cannabis users in the study were young, potentially underestimating the long-term cardiovascular impact.\u003c/p\u003e\n\n\n\n\u003ch2\u003eConclusion: Cannabis use associated with adverse heart outcomes\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn this study, cannabis use was associated with higher risk of heart problems, even when accounting for factors like age, tobacco use, and health conditions. This risk is seen both in the general population, younger adults, and non-smokers or users of e-cigarettes. Smoking cannabis was the most common means of consumption, so the impact of other forms of consumption is less clear. However, given the cardiovascular effects of cannabinoids, risks from edibles and other dosages forms of cannabis may be real. Given the growing popularity of cannabis, as well as the decreasing perception of risk with the drug, more information is needed about how cannabis use is affecting health outcomes.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Scott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada.\n\nScott has no conflicts of interest to disclose.\n\nDisclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional.                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/scottg416/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Website\" href=\"http://sciencebasedpharmacy.wordpress.com/\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#accbcddad9decdeccbc1cdc5c082cfc3c1\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-09-12T08:00:00-04:00",
  "modifiedTime": "2024-09-11T14:04:26Z"
}
