{
  "id": "41d3c4a8-1368-483d-a7dc-aba6d3075819",
  "title": "These Plants Photosynthesize Deep in the Arctic Even When There’s No Light",
  "link": "https://www.wired.com/story/how-does-life-happen-when-theres-barely-any-light/",
  "description": "Under the sea ice during the Arctic’s pitch-black polar night, cells power photosynthesis on the lowest light levels ever observed in nature.",
  "author": "Asher Elbein",
  "published": "Sun, 02 Mar 2025 12:00:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Science / Environment",
    "Dark Energy"
  ],
  "byline": "Asher Elbein",
  "length": 13456,
  "excerpt": "Under the sea ice during the Arctic’s pitch-black polar night, cells power photosynthesis on the lowest light levels ever observed in nature.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "The original version of this story appeared in Quanta Magazine.Most of life’s engines run on sunlight. Photons filter down through the atmosphere and are eagerly absorbed by light-powered organisms such as plants and algae. Through photosynthesis, the particles of light power a cellular reaction that manufactures chemical energy (in the form of sugars), which is then passed around the food web in a complex dance of herbivores, predators, scavengers, decomposers, and more.On a bright, sunny day, there’s a wealth of photons to go around. But what happens at low light? Biologists have long been curious about just how little light photosynthesis can run on—or how many photons need to arrive, and how quickly, for a cell’s photosynthetic machinery to process carbon dioxide into oxygen and energy. Calculations have suggested a theoretical minimum of around 0.01 micromoles of photons per square meter per second, or less than one-hundred-thousandth of the light of a sunny day.For decades, this calculation was theoretical, given the difficulties of studying photosynthesis under low light. No one could confirm it in the field, though there are plenty of places on Earth that light barely reaches. Every winter in the high Arctic, for example, the sun, hidden by the tilt of the Earth, vanishes for months. Meters of snow blanket the sea ice and block incoming light, leaving the frigid ocean below as dark as the inside of a tomb. There, biologists assumed, photosynthesizing microalgae that live in the water and ice power down for the season and wait for warmth and light to return.“People thought of the polar night as these desert conditions where there’s very little life, and things are all sleeping and hibernating and waiting for the next spring to come,” said Clara Hoppe, a biogeochemist at the Alfred Wegener Institute in Germany. “But really, people had never really looked at it.”In winter 2020, Hoppe spent months living on a ship wedged into an ice floe, through the polar night, to study the limits of photosynthesis in the dark. Her team’s recent study in Nature Communications reported microalgae growing and reproducing at light levels at or close to the theoretical minimum—far lower than had previously been observed in nature.The study shows that in some of the coldest, darkest places on Earth, life blooms with the barest quantum of light. “At least some phytoplankton, under some conditions, may be able to do some very useful things at very low light,” said Douglas Campbell, a specialist in aquatic photosynthesis at Mount Allison University in Canada, who was not involved in the study. “It’s important work.”Clara Hoppe, a biogeochemist at the Alfred Wegener Institute, probed the limits of photosynthesis in the months-long darkness of the Arctic polar night. Photograph: Paolo VerzoneThe Power of the Dark SideScientists have traditionally understood the Arctic to be a place of stasis for much of the year. In winter, organisms that can flee the frigid waters do so; those that stay live off stored reserves or sink into a silent sleep. Then, when the sun returns, the place comes back to life. During spring bloom, an upsurge in photosynthesizing algae and other microbes kick-starts the Arctic ecosystem, fueling a yearly revel, with tiny crustaceans, fish, seals, birds, polar bears, whales, and more.It seemed to Hoppe that any phytoplankton able to get an earlier start than the competition could have a more successful summer. This led her to wonder when, precisely, the organisms could respond to the light coming back.Her interest received a jolt in 2015 when she tagged along on a research project led by researchers at the University of Tromsø in Norway. The multidisciplinary team found an unexpectedly thriving ecosystem in the winter waters off the Svalbard archipelago; some organisms, particularly clams, were actually more active than they were in summer. To everyone’s surprise, the phytoplankton were not asleep either: Hoppe measured higher levels of the pigment chlorophyll—a useful proxy for active photosynthesis—in the seawater than anyone expected. Rather than sinking into surface sediments and overwintering in a dormant “sleep mode,” many cells Hoppe found were having an active winter, with their cellular operations fully up and running.“If these things are active,” Hoppe said, “the question obviously becomes: When do they start to function again for the ecosystem?” She began to wonder about the vast, cold blackness of the polar ocean.The icebreaker ship RV Polarstern wedged itself into an ice floe in fall 2019, then turned its engines off. For months it drifted with the sea ice and served as a base for scientists studying the physics, chemistry, and biology of the Arctic’s polar night. Photograph: Alfred Wegener Institute/Lukas PiotrowskiIn early 2020, Hoppe found herself testing the limits of photosynthesis directly, camped aboard an icebreaker ship that had been deliberately rammed into an ice floe and allowed to drift with its engines off through the polar night. A rotating crew of scientists with the expedition Mosaic (Multidisciplinary Drifting Observatory for the Study of Arctic Climate) occupied RV Polarstern on its journey to gather as much data about the Arctic winter as possible.Hoppe and her colleagues worked in the darkness of 24-hour night, amid expanses of glittering ice and wind chills down to minus 76 degrees Fahrenheit. Cracks and ridges in the ice constantly shifted the route to a permanent hole in the ice, named Ocean City, from which Hoppe and her team gathered hundreds of liters of seawater samples and hauled them back to the ship for analysis.The team carried out two parallel sets of measurements. First, they took samples of microalgae from seawater and sea ice into the shipboard lab. There, they incubated the cells and offered them carbon (traceable by isotope, or the number of neutrons in the atomic nuclei) and minute amounts of light (though significantly more than what was available under the ice). By measuring the cells’ carbon-uptake rates, they were able to estimate the limits of the organisms’ capacity for photosynthesis.The researchers also took regular seawater samples in which to track the amounts of phytoplankton and chlorophyll present over time. Throughout February, both sets of numbers remained static, Hoppe said. By the end of March, however, the microalgae’s carbon uptake had jumped, along with the number of cells and the concentration of chlorophyll—proxies for growth and photosynthesis. Hoppe and her team tested and ruled out many possible explanations, and recognized that the uptick in photosynthesis coincided with the return of the first springtime sunlight.At Ocean City (left), a scientific encampment on the ice floe, researchers collected seawater from a permanent hole in the ice (right). The sampled region changed as the floe drifted across the Arctic. Photograph: Left: Alfred Wegener Institute/Esther Horvath; Right: Alfred Wegener Institute/Michael GutscheYet a key piece of evidence only emerged three years after the expedition, Hoppe said, and from researchers in another department: the physicists measuring light beneath the sea ice. This has historically been tricky: “You can’t really measure light under the ice without disturbing the environment you’re trying to measure,” Hoppe said. “Because you drill a hole, you walk around—even footsteps on the snow and ice are going to change the light field.”To get around the problem, the sea ice physicist Niels Fuchs and his team aboard RV Polarstern had placed extremely precise light sensors around the ice floe early in the season and allowed them to freeze to the underside of the ice for the winter. Like trail cameras placed in the backwoods by a wildlife biologist, the light sensors recorded data on under-ice light for months, undisturbed.In February, the darkness of the polar night was nearly absolute, and not even photons from a bright moon or fleeting twilight could reach the dark waters below. Then, in late March, the sun briefly surfaced over the horizon. Beneath that ice, the light sensors recorded an astronomically small number of photons: an upper range of 0.04 micromoles per square meter per second, a number very close to the theoretical minimum amount of light that photosynthesis can run on. The actual amount of light was probably lower.“The light we observed, compared to a normal sunny day, is like one droplet of water compared to 3 liters,” said Fuchs, an ice specialist at the University of Hamburg and coauthor on the study.To measure the amount of light penetrating the sea ice, the physicist Niels Fuchs froze light sensors into the ice floe and left them to record data undisturbed for months. Photograph: Courtesy of Niels FuchsTheir estimate is a conservative one, he added, and it’s possible even fewer photons got through. “The ice cover is quite heterogeneous,” he explained. Because some parts of the sheet might allow more light through than others, the research team selected the upper thresholds of their light measurements. “In the end there’s some variety, and we really want to be on the safe side—to not stake on the lower limit where we’re not 100 percent certain that this is really the amount of light.”Pairing Fuchs’ light data with Hoppe’s microalgae observations clinched it: At the end of March, right when the barest amount of sunlight returned, the microalgae not only had their photosynthetic machinery up and running but were also growing and building biomass. Her team concluded that they’d made the first-ever field observation of photosynthesis at just around the theoretical minimum—where the amount of light was an order of magnitude lower than what had been observed in nature before.Sleep No MoreHoppe was excited to observe photosynthesis at or near the minimum amount of light that could power life. But the finding raised a question: How could dormant cells be ready to turn their machinery on at the very moment that spring’s first light trickled through the ice?Her team found that during the darkest periods of polar night, the microalgae didn’t show a measurable uptick in carbon uptake—they were neither growing nor photosynthesizing. Yet they weren’t totally dormant either. The cells kept running on low power. Then, as soon as the light levels rose enough to support active carbon fixation in late March, the algae were ready to explode into action.“It’s sort of like a seedbed or an inoculation issue,” Campbell said. “That ability to productively exploit really low light improves your ability to survive and then be ready to go fast when the light goes back.”The researchers aren’t entirely sure how the microalgae managed to stay alive and out of dormancy through the darkest times. Some, such as diatoms, can consume dissolved organic nutrients directly from the water. Perhaps they could eke out a living from stray photons that passed through cracks in the ice or were emitted by some bioluminescent creature. Or perhaps polar algae have evolved unique mechanisms that can keep their metabolism running on low at frigid temperatures so that they’re ready to activate at first light.Such adaptations might be important to the ecology of the region, said Kevin Flynn, a plankton specialist at Plymouth Marine Laboratory who was not involved in the study. “The organisms may be getting ready earlier than we think,” he said. The finding is “important work that’s a reality check about what nature really does.”However, he isn’t entirely convinced that the cells’ late-March growth occurred through photosynthesis. “The appearance of chlorophyll does not mean that they are photosynthesizing to obtain that growth,” he said. “They may simply be making more chlorophyll from organics and in preparation for photosynthesizing. Because as the season goes, there will be light. And the organism which is ready for it quicker than the others is going to go the quickest.”On the other hand, Campbell thinks it’s possible that the algae might be photosynthesizing even earlier than Hoppe’s team suggested. Their estimates of light levels were conservative, he said, and photosynthesis may have been occurring well in advance of the kind of biomass accumulation that’s easy to measure. It is feasible to him, then, that “these things are right at or touching below that biochemical thermodynamic limit,” he said.The findings paint a new picture of life in the Arctic’s polar night and possibly beyond. Life may not be packed entirely into a few short months of summer; rather, the waters may be productive—or, at the very least, still living—throughout the year. This, Hoppe said, could rewrite our understanding of Arctic organisms’ life cycles, interactions, and energy reserves.She wonders, too, whether Arctic phytoplankton’s ability to ride out near-absolute darkness might be shared by some algae in the colder, darker waters of the deep sea. If she’s right, the zone of productive ocean may be deeper than anyone thought. “If polar phytoplankton were able to evolve these mechanisms,” Hoppe suggested, “I’m sure phytoplankton in other areas of the ocean can do the same.”Original story reprinted with permission from Quanta Magazine, an editorially independent publication of the Simons Foundation whose mission is to enhance public understanding of science by covering research developments and trends in mathematics and the physical and life sciences.",
  "image": "https://media.wired.com/photos/67bdbc5ff5b8a54195f021d9/191:100/w_1280,c_limit/Dark_Photosynthesis-crMarkBelan-Article.mp4",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cem\u003e\u003cspan\u003eThe original version\u003c/span\u003e of\u003c/em\u003e \u003ca href=\"https://www.quantamagazine.org/how-does-life-happen-when-theres-barely-any-light-20250129/\"\u003e\u003cem\u003ethis story\u003c/em\u003e\u003c/a\u003e \u003cem\u003eappeared in \u003ca href=\"https://www.quantamagazine.org\"\u003eQuanta Magazine\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eMost of life’s engines run on sunlight. Photons filter down through the atmosphere and are eagerly absorbed by light-powered organisms such as plants and algae. Through photosynthesis, the particles of light power a cellular reaction that manufactures chemical energy (in the form of sugars), which is then passed around the food web in a complex dance of herbivores, predators, scavengers, decomposers, and more.\u003c/p\u003e\u003cp\u003eOn a bright, sunny day, there’s a wealth of photons to go around. But what happens at low light? Biologists have long been curious about just how little light photosynthesis can run on—or how many photons need to arrive, and how quickly, for a cell’s photosynthetic machinery to process carbon dioxide into oxygen and energy. Calculations have suggested a theoretical minimum of around 0.01 micromoles of photons per square meter per second, or less than one-hundred-thousandth of the light of a sunny day.\u003c/p\u003e\u003cp\u003eFor decades, this calculation was theoretical, given the difficulties of studying photosynthesis under low light. No one could confirm it in the field, though there are plenty of places on Earth that light barely reaches. Every winter in the high Arctic, for example, the sun, hidden by the tilt of the Earth, vanishes for months. Meters of snow blanket the sea ice and block incoming light, leaving the frigid ocean below as dark as the inside of a tomb. There, biologists assumed, photosynthesizing microalgae that live in the water and ice power down for the season and wait for warmth and light to return.\u003c/p\u003e\u003cp\u003e“People thought of the polar night as these desert conditions where there’s very little life, and things are all sleeping and hibernating and waiting for the next spring to come,” said \u003ca data-offer-url=\"https://www.awi.de/en/about-us/organisation/staff/single-view/clara-hoppe.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.awi.de/en/about-us/organisation/staff/single-view/clara-hoppe.html\u0026#34;}\" href=\"https://www.awi.de/en/about-us/organisation/staff/single-view/clara-hoppe.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eClara Hoppe\u003c/a\u003e, a biogeochemist at the Alfred Wegener Institute in Germany. “But really, people had never really looked at it.”\u003c/p\u003e\u003cp\u003eIn winter 2020, Hoppe spent months living on a ship wedged into an ice floe, through the polar night, to study the limits of photosynthesis in the dark. Her team’s recent study in Nature Communications reported microalgae \u003ca href=\"https://doi.org/10.1038/s41467-024-51636-8\" target=\"_blank\"\u003egrowing and reproducing\u003c/a\u003e at light levels at or close to the theoretical minimum—far lower than had previously been observed in nature.\u003c/p\u003e\u003cp\u003eThe study shows that in some of the coldest, darkest places on Earth, life blooms with the barest quantum of light. “At least some phytoplankton, under some conditions, may be able to do some very useful things at very low light,” said \u003ca data-offer-url=\"https://mta.ca/directory/douglas-campbell\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://mta.ca/directory/douglas-campbell\u0026#34;}\" href=\"https://mta.ca/directory/douglas-campbell\" rel=\"nofollow noopener\" target=\"_blank\"\u003eDouglas Campbell\u003c/a\u003e, a specialist in aquatic photosynthesis at Mount Allison University in Canada, who was not involved in the study. “It’s important work.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eClara Hoppe, a biogeochemist at the Alfred Wegener Institute, probed the limits of photosynthesis in the months-long darkness of the Arctic polar night.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Paolo Verzone\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003ch2\u003eThe Power of the Dark Side\u003c/h2\u003e\u003cp\u003eScientists have traditionally understood the Arctic to be a place of stasis for much of the year. In winter, organisms that can flee the frigid waters do so; those that stay live off stored reserves or sink into a silent sleep. Then, when the sun returns, the place comes back to life. During spring bloom, an upsurge in photosynthesizing algae and other microbes kick-starts the Arctic ecosystem, fueling a yearly revel, with tiny crustaceans, fish, seals, birds, polar bears, whales, and more.\u003c/p\u003e\u003cp\u003eIt seemed to Hoppe that any phytoplankton able to get an earlier start than the competition could have a more successful summer. This led her to wonder when, precisely, the organisms could respond to the light coming back.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eHer interest received a jolt in 2015 when she tagged along on a research project led by researchers at the University of Tromsø in Norway. The multidisciplinary team found an unexpectedly thriving ecosystem in the winter waters off the Svalbard archipelago; some organisms, particularly clams, were actually more active than they were in summer. To everyone’s surprise, the phytoplankton were not asleep either: Hoppe measured higher levels of the pigment chlorophyll—a useful proxy for active photosynthesis—in the seawater than anyone expected. Rather than sinking into surface sediments and overwintering in a dormant “sleep mode,” many cells Hoppe found were having an active winter, with their cellular operations fully up and running.\u003c/p\u003e\u003cp\u003e“If these things are active,” Hoppe said, “the question obviously becomes: When do they start to function again for the ecosystem?” She began to wonder about the vast, cold blackness of the polar ocean.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe icebreaker ship RV \u003cem\u003ePolarstern\u003c/em\u003e wedged itself into an ice floe in fall 2019, then turned its engines off. For months it drifted with the sea ice and served as a base for scientists studying the physics, chemistry, and biology of the Arctic’s polar night.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Alfred Wegener Institute/Lukas Piotrowski\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn early 2020, Hoppe found herself testing the limits of photosynthesis directly, camped aboard an icebreaker ship that had been \u003ca href=\"https://www.quantamagazine.org/the-voyage-to-the-end-of-ice-20200116/\"\u003edeliberately rammed into an ice floe\u003c/a\u003e and allowed to drift with its engines off through the polar night. A rotating crew of scientists with the expedition Mosaic (Multidisciplinary Drifting Observatory for the Study of Arctic Climate) occupied \u003cem\u003eRV Polarstern\u003c/em\u003e on its journey to gather as much data about the Arctic winter as possible.\u003c/p\u003e\u003cp\u003eHoppe and her colleagues worked in the darkness of 24-hour night, amid expanses of glittering ice and wind chills down to minus 76 degrees Fahrenheit. Cracks and ridges in the ice constantly shifted the route to a permanent hole in the ice, named Ocean City, from which Hoppe and her team gathered hundreds of liters of seawater samples and hauled them back to the ship for analysis.\u003c/p\u003e\u003cp\u003eThe team carried out two parallel sets of measurements. First, they took samples of microalgae from seawater and sea ice into the shipboard lab. There, they incubated the cells and offered them carbon (traceable by isotope, or the number of neutrons in the atomic nuclei) and minute amounts of light (though significantly more than what was available under the ice). By measuring the cells’ carbon-uptake rates, they were able to estimate the limits of the organisms’ capacity for photosynthesis.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe researchers also took regular seawater samples in which to track the amounts of phytoplankton and chlorophyll present over time. Throughout February, both sets of numbers remained static, Hoppe said. By the end of March, however, the microalgae’s carbon uptake had jumped, along with the number of cells and the concentration of chlorophyll—proxies for growth and photosynthesis. Hoppe and her team tested and ruled out many possible explanations, and recognized that the uptick in photosynthesis coincided with the return of the first springtime sunlight.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAt Ocean City (left), a scientific encampment on the ice floe, researchers collected seawater from a permanent hole in the ice (right). The sampled region changed as the floe drifted across the Arctic.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Left: Alfred Wegener Institute/Esther Horvath; Right: Alfred Wegener Institute/Michael Gutsche\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eYet a key piece of evidence only emerged three years after the expedition, Hoppe said, and from researchers in another department: the physicists measuring light beneath the sea ice. This has historically been tricky: “You can’t really measure light under the ice without disturbing the environment you’re trying to measure,” Hoppe said. “Because you drill a hole, you walk around—even footsteps on the snow and ice are going to change the light field.”\u003c/p\u003e\u003cp\u003eTo get around the problem, the sea ice physicist \u003ca data-offer-url=\"https://www.ifm.uni-hamburg.de/institute/staff/fuchs.html\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.ifm.uni-hamburg.de/institute/staff/fuchs.html\u0026#34;}\" href=\"https://www.ifm.uni-hamburg.de/institute/staff/fuchs.html\" rel=\"nofollow noopener\" target=\"_blank\"\u003eNiels Fuchs\u003c/a\u003e and his team aboard \u003cem\u003eRV\u003c/em\u003e \u003cem\u003ePolarstern\u003c/em\u003e had placed extremely precise light sensors around the ice floe early in the season and allowed them to freeze to the underside of the ice for the winter. Like trail cameras placed in the backwoods by a wildlife biologist, the light sensors recorded data on under-ice light for months, undisturbed.\u003c/p\u003e\u003cp\u003eIn February, the darkness of the polar night was nearly absolute, and not even photons from a bright moon or fleeting twilight could reach the dark waters below. Then, in late March, the sun briefly surfaced over the horizon. Beneath that ice, the light sensors recorded an astronomically small number of photons: an upper range of 0.04 micromoles per square meter per second, a number very close to the theoretical minimum amount of light that photosynthesis can run on. The actual amount of light was probably lower.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“The light we observed, compared to a normal sunny day, is like one droplet of water compared to 3 liters,” said Fuchs, an ice specialist at the University of Hamburg and coauthor on the study.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTo measure the amount of light penetrating the sea ice, the physicist Niels Fuchs froze light sensors into the ice floe and left them to record data undisturbed for months.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Courtesy of Niels Fuchs\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eTheir estimate is a conservative one, he added, and it’s possible even fewer photons got through. “The ice cover is quite heterogeneous,” he explained. Because some parts of the sheet might allow more light through than others, the research team selected the upper thresholds of their light measurements. “In the end there’s some variety, and we really want to be on the safe side—to not stake on the lower limit where we’re not 100 percent certain that this is really the amount of light.”\u003c/p\u003e\u003cp\u003ePairing Fuchs’ light data with Hoppe’s microalgae observations clinched it: At the end of March, right when the barest amount of sunlight returned, the microalgae not only had their photosynthetic machinery up and running but were also growing and building biomass. Her team concluded that they’d made the first-ever field observation of photosynthesis at just around the theoretical minimum—where the amount of light was an order of magnitude lower than what had been observed in nature before.\u003c/p\u003e\u003ch2\u003eSleep No More\u003c/h2\u003e\u003cp\u003eHoppe was excited to observe photosynthesis at or near the minimum amount of light that could power life. But the finding raised a question: How could dormant cells be ready to turn their machinery on at the very moment that spring’s first light trickled through the ice?\u003c/p\u003e\u003cp\u003eHer team found that during the darkest periods of polar night, the microalgae didn’t show a measurable uptick in carbon uptake—they were neither growing nor photosynthesizing. Yet they weren’t totally dormant either. The cells kept running on low power. Then, as soon as the light levels rose enough to support active carbon fixation in late March, the algae were ready to explode into action.\u003c/p\u003e\u003cp\u003e“It’s sort of like a seedbed or an inoculation issue,” Campbell said. “That ability to productively exploit really low light improves your ability to survive and then be ready to go fast when the light goes back.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe researchers aren’t entirely sure how the microalgae managed to stay alive and out of dormancy through the darkest times. Some, such as diatoms, can consume dissolved organic nutrients directly from the water. Perhaps they could eke out a living from stray photons that passed through cracks in the ice or were emitted by some bioluminescent creature. Or perhaps polar algae have evolved unique mechanisms that can \u003ca href=\"https://doi.org/10.1111/nph.19387\" target=\"_blank\"\u003ekeep their metabolism running\u003c/a\u003e on low at frigid temperatures so that they’re ready to activate at first light.\u003c/p\u003e\u003cp\u003eSuch adaptations might be important to the ecology of the region, said \u003ca data-offer-url=\"https://pml.ac.uk/profile/professor-kevin-flynn/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://pml.ac.uk/profile/professor-kevin-flynn/\u0026#34;}\" href=\"https://pml.ac.uk/profile/professor-kevin-flynn/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eKevin Flynn\u003c/a\u003e, a plankton specialist at Plymouth Marine Laboratory who was not involved in the study. “The organisms may be getting ready earlier than we think,” he said. The finding is “important work that’s a reality check about what nature really does.”\u003c/p\u003e\u003cp\u003eHowever, he isn’t entirely convinced that the cells’ late-March growth occurred through photosynthesis. “The appearance of chlorophyll does not mean that they are photosynthesizing to obtain that growth,” he said. “They may simply be making more chlorophyll from organics and in preparation for photosynthesizing. Because as the season goes, there will be light. And the organism which is ready for it quicker than the others is going to go the quickest.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOn the other hand, Campbell thinks it’s possible that the algae might be photosynthesizing even earlier than Hoppe’s team suggested. Their estimates of light levels were conservative, he said, and photosynthesis may have been occurring well in advance of the kind of biomass accumulation that’s easy to measure. It is feasible to him, then, that “these things are right at or touching below that biochemical thermodynamic limit,” he said.\u003c/p\u003e\u003cp\u003eThe findings paint a new picture of life in the Arctic’s polar night and possibly beyond. Life may not be packed entirely into a few short months of summer; rather, the waters may be productive—or, at the very least, still living—throughout the year. This, Hoppe said, could rewrite our understanding of Arctic organisms’ life cycles, interactions, and energy reserves.\u003c/p\u003e\u003cp\u003eShe wonders, too, whether Arctic phytoplankton’s ability to ride out near-absolute darkness might be shared by some algae in the colder, darker waters of the deep sea. If she’s right, the zone of productive ocean may be deeper than anyone thought. “If polar phytoplankton were able to evolve these mechanisms,” Hoppe suggested, “I’m sure phytoplankton in other areas of the ocean can do the same.”\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003ca href=\"https://www.quantamagazine.org/how-does-life-happen-when-theres-barely-any-light-20250129/\"\u003e\u003cem\u003eOriginal story\u003c/em\u003e\u003c/a\u003e \u003cem\u003ereprinted with permission from\u003c/em\u003e \u003ca href=\"https://www.quantamagazine.org\"\u003eQuanta Magazine\u003c/a\u003e, \u003cem\u003ean editorially independent publication of the\u003c/em\u003e \u003ca href=\"https://www.simonsfoundation.org\"\u003e\u003cem\u003eSimons Foundation\u003c/em\u003e\u003c/a\u003e \u003cem\u003ewhose mission is to enhance public understanding of science by covering research developments and trends in mathematics and the physical and life sciences.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-02T07:00:00-05:00",
  "modifiedTime": "2025-03-02T12:00:00Z"
}
