{
  "id": "42616df8-ca6b-48c3-94dd-abc5b6ac1dd9",
  "title": "Can Overpriced Peaches Convince Us That Fukushima Is Safe?",
  "link": "https://www.scientificamerican.com/article/can-overpriced-peaches-convince-us-that-fukushima-is-safe/",
  "description": "Years after a nuclear disaster wiped out Fukushima’s agriculture, peach growers are banking on Harrods to sell the area’s recovery story",
  "author": "",
  "published": "Wed, 09 Oct 2024 11:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Kate Graham-Shaw",
  "length": 10793,
  "excerpt": "Years after a nuclear disaster wiped out Fukushima’s agriculture, peach growers are banking on Harrods to sell the area’s recovery story",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "What if I told you that peaches grown around the Fukushima Daiichi Power Plant, site of Japan’s catastrophic nuclear accident, were on sale at Harrods, the luxury department store in London where Ronald Reagan once inquired about buying a baby elephant?It's true, and how those peaches got there is as much a story of clever marketing as how the people of Fukushima prefecture, marred by the 2011 disaster, are trying to disentangle their region from its nuclear legacy.Most people in the U.S. associate peaches with Georgia. But before the nuclear accident, the prefecture, nestled in a traditional, picturesque part of northeast Japan, had been a thriving agricultural hub, earning the nickname “The Fruit Kingdom.”On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.But this all changed on March 11, 2011, when the most powerful recorded earthquake in Japanese history triggered a tsunami, 50 feet (15 meters) in height, that hit one of the region’s nuclear power plants, flooding it. Three active nuclear reactors lost power. Without their cooling systems, the cores of the reactors overheated and partially melted. This damaged the reactors’ containment vessels, causing an explosion. As toxic radioactive materials burst out, permeating soil, water, air and foliage, the prefectural government declared a danger zone 12.5 miles (20 kilometers) in radius around the plant. Fallout patterns then prompted adding an area of 80 square mi (207 sq km)—about the size of Seattle—to the zone. An estimated 18,500 people died as a result of the earthquake, tsunami and nuclear meltdown combined.According to the severity scale of the International Atomic Energy Agency (IAEA), the Fukushima emergency was a level 7, equivalent to Chernobyl. The Fukushima countryside was no longer a fruit kingdom, and its farmers’ livelihoods were in tatters.So imagine my surprise when, 13 years later, I saw photos of employees at Harrods’ food hall handing out samples of peaches grown in Fukushima to shoppers, who were apparently willing to give them a taste. If your gut reaction is probably something like “I wouldn’t try one of those radioactive peaches if you paid me,” no one would blame you; that was my initial reaction, too.Questions started swirling in my head: How could fruit grown in this region possibly be safe? How were these peaches allowed to be exported? Could these radioactive peaches birth a new superhero?A radioactive reputation can be difficult to shake. If I offered you a peach grown in Chernobyl, which has had 38 years to recover, would you take it? What about food grown at Three Mile Island? That explosion was nearly 45 years ago. Probably not, right? But why is this?One of the main reasons nuclear power has a bad reputation is its unfortunate genesis; before splitting atoms for public energy, scientists split them for warfare. When a similar technique was used for generating power a few years later, and when nuclear power plants began operating commercially from 1954 onwards, the public did not see the energy released by radioactive decay as a new, extremely efficient power source; they saw it as something capable of wiping out cities and instantly incinerating people, while leaving insidious contamination in its wake.Antinuclear movements spread across the world in the 1960s and 1970s, highlighting growing public trepidation about both nuclear weapons and power. Nuclear power also lost popularity because of its high costs and concerns about nuclear waste disposal and workplace safety. But many governments ignored protests and built plants anyway, including Japan (Fukushima Daiichi was constructed in 1967). Despite its brutal experience of nuclear war, the country chose nuclear energy to help facilitate its economic growth and energy self-sufficiency. Many governments were also aware of the need to keep up with developing nuclear technologies, both to symbolize their country’s technical expertise and in case the practical knowledge of nuclear fission ever came in handy in the future.When the failures at Three Mile Island and Chernobyl happened, however, many of the wider public’s nuclear fears were confirmed. Research has shown that nuclear power has failed to shed its association with death, hazard and weapons, even in more recent decades. I’ve met many physicists who are careful not to advertise they work in the nuclear field because of this lingering stigma.Compared to Three Mile Island and Chernobyl, though, Fukushima had the benefit of 30 years of technological advances to aid its cleanup mission. Immediately after the accident, a few hundred workers took turns in groups of 50 to try and stabilize the plant and reduce radioactive leakage.Once stabilized, the cleanup began, with the plant’s operators, Tokyo Electric Power Company Holdings (or TEPCO), partially owned by the Japanese government, decommissioned the plant to remove all remaining radioactive material. Workers bagged contaminated materials for safe disposal, and contaminated water was stored for later release, counting on it decaying further. TEPCO would later make use of robotic technology, including the ALPS system, to aid their decontamination efforts. The affected surrounding area also quickly became subject to strict monitoring, with scientists using equipment like EPA’s RadNet, to test air and soil radioactivity levels and observe the rate of decay. An array of radioactive substances had been released during the disaster, including plutonium and uranium, but scientists were also on the lookout for harmful levels of radioactive cesium and iodine isotopes, which turned out to be the abundant and far-reaching contaminants of agricultural land.Many Japanese people and onlookers from around the world were sure that the agricultural land of Fukushima prefecture would be out of use for decades. But as soon as July 2011, researchers were coming out with surprising claims—the soil in Fukushima was safe, they announced. This was despite the decay half-life of cesium-137—one of the main contaminating isotopes—being about 30 years. The scientists’ analysis had shown that, instead of penetrating deep into the soil as feared, the radioactive contamination had only seemed to affect about two inches of the top layer of soil, and accumulated on already-grown crops.Scoop out the bad soil and get rid of the bad crops, they said, and the food grown in Fukushima would likely be safe. They did precisely this, significantly reducing soil contamination and allowing residents to return to their homes. This is in sharp contrast to Chernobyl, where surrounding areas were completely deserted and reduced to ghost towns, many of which remain abandoned to this day.A local agricultural facility was adapted, and in September 2011 it began testing produce samples for radiation. Today the facility holds a radiation testing unit; to me, it seems that the food passing through here, including yields of peaches like those being sold at Harrods, is probably the most thoroughly examined in the world. Germanium semiconductor detectors, radioactive cesium concentration detectors, sodium iodide scintillation spectrometers and more scan the produce for any signs of radioactivity. The nationally approved testing process is held to the strict threshold standards of 100 Becquerel per kilogram of food item—which is a mere tenth of the internationally recognized CODEX threshold of 1,000 Bq/kg, and far less radiation than the U.S. standard of 1,200 Bq/kg. Food from Fukushima is also subjected to monitoring and testing by the International Atomic Energy Association (IAEA), the United Nations’ nuclear watchdog, to ensure safe standards.In 2017, 6 years after the disaster, the government of Japan said that Fukushima foods were “safe and delicious”, backing up the brusque statement with numerous data and endorsements from the U.N. Food and Agriculture Organization and IAEA officials, the main global bodies who have assisted the government in monitoring the contamination.According to data presented by the Japanese government, agricultural soil in Fukushima purportedly had comparable radiation “dose rates” to soil in New York, London, Hong Kong and Seoul, as of 2017 to 2018, because radiation occurs naturally. The Fukushima peaches would therefore be no more radioactively contaminated than those grown in a London back garden. Soil in the U.S. can also become contaminated from natural radionuclides and even from nuclear weapons testing, but fruit grown in the U.S. has far lower safety thresholds and less radioactivity testing procedures compared to that coming from Fukushima. And yet we all eat it.Internationally, it took another few years before governments began respecting scientists’ findings. In 2021 the FDA agreed that, according to their “standard surveillance and sampling measures,” food imported to the U.S. from Fukushima posed no food safety risk to consumers. They followed up in 2023 by testing 51 samples from the area and found that none contained “detectable levels of cesium.” The U.K. also lifted its own restrictions on Fukushima imports two years ago. Owing to international protocols, the food was safe for import and consumption.But would consumers agree? This is where Harrods comes in. The Japanese government and TEPCO—the owners of the devastated power plant—have been heavily pushing their reputation-building initiative. Associate peaches with Harrods, a place the royal family is known to frequent, and maybe they become a delicacy, an interesting snack to bring out at a dinner party, rather than something to be afraid of.And their price tag reflects this. They cost nearly $33 a piece—while an average Georgia peach in the U.S. costs less than $1. By selling here, they might just be fast-tracking their fruit to a better reputation, one which embraces the uniqueness of its origin, the weirdness of it, rather than perpetuating fear.Regardless of the cost of these peaches, the region is urging the world to not leave them in a ruinous past. This is commendable.When I first heard about the peaches, my gut instinct was “no, thank you.” But now I realize that Fukushima food has been tested within an inch of its life—and likely mine. I trust the science on this one, regardless of all the negative nuclear associations. So, now, will I try one? Yes, if they’re still giving out free samples—as $33 for a peach, however safe, is terribly indulgent.This is an opinion and analysis article, and the views expressed by the author or authors are not necessarily those of Scientific American.",
  "image": "https://static.scientificamerican.com/dam/m/5cc5b797c2ba2fc1/original/Customers_sample_peaches.jpg?w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhat if I told you that peaches grown around the Fukushima Daiichi Power Plant, site of Japan’s catastrophic nuclear accident, were on sale at Harrods, the luxury department store in London where Ronald Reagan once inquired about buying \u003ca href=\"https://www.tatler.com/article/the-fabulous-world-of-dior-harrods-takeover\"\u003ea baby elephant\u003c/a\u003e?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIt\u0026#39;s true, and how those peaches got there is as much a story of clever marketing as how the people of Fukushima prefecture, marred by the 2011 disaster, are trying to disentangle their region from its nuclear legacy.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMost people in the U.S. associate peaches with Georgia. But before \u003ca href=\"https://www.scientificamerican.com/report/4-years-after-fukushima/\"\u003ethe nuclear accident\u003c/a\u003e, the prefecture, nestled in a traditional, picturesque part of northeast Japan, had been a thriving agricultural hub, earning the nickname “The Fruit Kingdom.”\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut this all changed on March 11, 2011, when the most powerful recorded earthquake in Japanese history triggered a tsunami, 50 feet (15 meters) in height, that hit one of the region’s nuclear power plants, flooding it. Three active nuclear reactors lost power. Without their cooling systems, the cores of the reactors overheated and partially melted. This damaged the reactors’ containment vessels, causing an explosion. As toxic radioactive materials burst out, permeating soil, water, air and foliage, the prefectural government declared a danger zone 12.5 miles (20 kilometers) in radius around the plant. Fallout patterns then prompted adding an area of 80 square mi (207 sq km)—about the size of Seattle—to the zone. An estimated \u003ca href=\"https://www.bbc.com/news/world-asia-45423575\"\u003e18,500 people died as a result of the earthquake, tsunami and nuclear meltdown combined\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.iaea.org/topics/response/fukushima-daiichi-nuclear-accident\"\u003eAccording to the severity scale of the International Atomic Energy Agency (IAEA), the Fukushima emergency was a level 7, equivalent to \u003c/a\u003eChernobyl. The \u003ca href=\"https://www.scientificamerican.com/article/clearing-the-radioactive-rubble-heap-that-was-fukushima-daiichi-7-years-on/\"\u003eFukushima countryside\u003c/a\u003e was no longer a fruit kingdom, and its farmers’ livelihoods were in tatters.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo imagine my surprise when, 13 years later, I saw photos of employees at Harrods’ food hall handing out samples of peaches grown in Fukushima to shoppers, who were apparently willing to give them a taste. If your gut reaction is probably something like “I wouldn’t try one of those radioactive peaches if you paid me,” no one would blame you; that was my initial reaction, too.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eQuestions started swirling in my head: How could fruit grown in this region possibly be safe? How were these peaches allowed to be exported? Could these radioactive peaches birth a new superhero?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eA radioactive reputation can be difficult to shake. If I offered you a peach grown in Chernobyl, which has had 38 years to recover, would you take it? What about food grown at Three Mile Island? That explosion was nearly 45 years ago. Probably not, right? But why is this?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOne of the main reasons nuclear power \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S095717871730005X#bib20\"\u003ehas a bad reputation\u003c/a\u003e is \u003ca href=\"https://news.uchicago.edu/explainer/first-nuclear-reactor-explained\"\u003eits unfortunate genesis\u003c/a\u003e; before splitting atoms for public energy, scientists split them for warfare. When a similar technique was used for \u003ca href=\"https://www.ans.org/news/article-1281/tour-of-ebr/\"\u003egenerating power a\u003c/a\u003e few years later, and when nuclear power plants \u003ca href=\"https://www.ans.org/news/article-1703/anniversary-at-obninsk-the-first-commercial-nuclear-power-plant/\"\u003ebegan operating commercially from 1954 onwards\u003c/a\u003e, the public did not see the energy released by radioactive decay as a new, extremely efficient power source; \u003ca href=\"https://ehne.fr/en/encyclopedia/themes/material-civilization/risks-and-security/nuclear-fear-in-europe-weapons-power-stations\"\u003ethey saw it as something capable of wiping out cities and instantly incinerating people, while leaving insidious contamination in its wake\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.sciencedirect.com/topics/social-sciences/antinuclear-movement\"\u003eAntinuclear movements spread\u003c/a\u003e across the world in the 1960s and 1970s, highlighting growing public trepidation about both nuclear weapons and power. Nuclear power also lost popularity because of its \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0301421516300106\"\u003ehigh costs\u003c/a\u003e and concerns about \u003ca href=\"https://energsustainsoc.biomedcentral.com/articles/10.1186/s13705-015-0064-6\"\u003enuclear waste disposal\u003c/a\u003e and \u003ca href=\"https://www.jstor.org/stable/45352197\"\u003eworkplace safety\u003c/a\u003e. But many governments ignored protests and built plants anyway, including Japan (Fukushima Daiichi was constructed in 1967). Despite its brutal experience of nuclear war, the country chose nuclear energy to help facilitate its economic growth and energy self-sufficiency. \u003ca href=\"https://www.oecd-nea.org/upload/docs/application/pdf/2019-12/5270-government-nuclear-energy.pdf\"\u003eMany governments were also aware\u003c/a\u003e of the need to keep up with developing nuclear technologies, both to symbolize their country’s technical expertise and in case the practical knowledge of nuclear fission ever came in handy in the future.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhen the failures at \u003ca href=\"https://www.sciencedirect.com/science/article/pii/0149197082900154\"\u003eThree Mile Island\u003c/a\u003e and \u003ca href=\"https://www.iaea.org/sites/default/files/28304780912.pdf\"\u003eChernobyl\u003c/a\u003e happened, however, many of the wider public’s nuclear fears were confirmed. Research has shown that nuclear power has \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S2214629620301432\"\u003efailed to shed its association\u003c/a\u003e with death, hazard and weapons, even in more recent decades. I’ve met many physicists who are careful not to advertise they work in the nuclear field because of this lingering stigma.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCompared to Three Mile Island and Chernobyl, though, \u003ca href=\"https://www.scientificamerican.com/article/clearing-the-radioactive-rubble-heap-that-was-fukushima-daiichi-7-years-on/\"\u003eFukushima had the benefit of 30 years of technological advances to aid its cleanup mission\u003c/a\u003e. Immediately after the accident, a few hundred workers \u003ca href=\"https://www.theguardian.com/environment/2013/jan/11/fukushima-50-kamikaze-pilots-sacrifice\"\u003etook turns in groups of 50 to try and stabilize the plant and reduce radioactive leakage.\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOnce stabilized, the cleanup began, with the plant’s operators, Tokyo Electric Power Company Holdings (or \u003ca href=\"https://www.tepco.co.jp/en/hd/index-e.html\"\u003eTEPCO\u003c/a\u003e), partially owned by the Japanese government, decommissioned the plant to remove all remaining radioactive material. Workers bagged contaminated materials for safe disposal, and contaminated water was \u003ca href=\"https://www.iaea.org/newscenter/pressreleases/iaea-finds-japans-plans-to-release-treated-water-into-the-sea-at-fukushima-consistent-with-international-safety-standards\"\u003estored for later release\u003c/a\u003e, counting on it decaying further. TEPCO would later make use \u003ca href=\"https://www.tepco.co.jp/en/decommision/principles/robot/index-e.html\"\u003eof robotic technology\u003c/a\u003e, including the \u003ca href=\"https://www.iaea.org/topics/response/fukushima-daiichi-nuclear-accident/fukushima-daiichi-alps-treated-water-discharge\"\u003eALPS system\u003c/a\u003e, to aid their decontamination efforts. The affected surrounding area also quickly became subject to \u003ca href=\"https://www.tepco.co.jp/en/nu/fukushima-np/f1/index-e.html\"\u003estrict monitoring\u003c/a\u003e, with scientists using equipment like \u003ca href=\"https://www.epa.gov/radnet/learn-about-radnet\"\u003eEPA’s RadNet\u003c/a\u003e, to test air and soil radioactivity levels and observe the rate of decay. An array of radioactive substances had been released during the disaster, \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0048969720340614\"\u003eincluding plutonium and uranium\u003c/a\u003e, but scientists were also on the lookout for harmful levels of \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4351624/\"\u003eradioactive cesium and iodine isotopes\u003c/a\u003e, which turned out to be the abundant and far-reaching contaminants of agricultural land.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMany Japanese people and onlookers from around the world were sure that the agricultural land of Fukushima prefecture would be out of use for decades. But as soon as July 2011, researchers were coming out with surprising claims—\u003ca href=\"https://www.latimes.com/health/la-xpm-2011-jul-12-la-heb-fukushima-crops-safety-20110712-story.html\"\u003ethe soil in Fukushima was safe, they announced\u003c/a\u003e. This was despite the \u003ca href=\"https://www.pnas.org/doi/full/10.1073/pnas.1112058108\"\u003edecay half-life of cesium-137—one of the main contaminating isotopes—being about 30 years.\u003c/a\u003e The \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5829612/\"\u003escientists’ analysis\u003c/a\u003e had shown that, instead of penetrating deep into the soil as feared, the radioactive contamination had only seemed to affect about two inches of the top layer of soil, and accumulated on already-grown crops.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eScoop out the bad soil and get rid of the bad crops, they said, and the food grown in Fukushima would likely be safe. \u003ca href=\"https://www.port.ac.uk/news-events-and-blogs/blogs/protecting-our-environment/decontaminating-fukushima-have-the-billions-spent-been-worth-it#:~:text=Consequently%2C%20the%20decontamination%20of%20agricultural,pressure%20washing%20drains%20and%20gutters.\"\u003eThey did precisely this\u003c/a\u003e, significantly reducing soil contamination and allowing residents to return to their homes. This is in sharp contrast to Chernobyl, where surrounding areas were completely deserted and reduced to ghost towns, many of which \u003ca href=\"https://www.iaea.org/newscenter/focus/chernobyl/faqs#:~:text=There%20are%20187%20small%20communities,to%20live%20in%20this%20area.\"\u003eremain abandoned to this day\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://fukushima.travel/destination/fukushima-agricultural-technology-centre/199\"\u003eA local agricultural facility\u003c/a\u003e was adapted, and \u003ca href=\"https://www.producer.com/news/nuclear-accident-still-affecting-japanese-agriculture/#:~:text=The%20centre%2C%20which%20opened%20in,capital%20of%20the%20Chiba%20prefecture\"\u003ein September 2011 it began testing produce samples for radiation\u003c/a\u003e. Today the facility holds a radiation testing unit; to me, it seems that the food passing through here, including yields of peaches like those being sold at Harrods, is probably the most thoroughly examined in the world. \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S1876610214027192\"\u003eGermanium semiconductor detectors\u003c/a\u003e, \u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4351624/\"\u003eradioactive cesium concentration\u003c/a\u003e detectors, \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S1738573324004212\"\u003esodium iodide scintillation spectrometers\u003c/a\u003e and more scan the produce for any signs of radioactivity. The nationally approved testing process is held to the \u003ca href=\"https://www.env.go.jp/en/chemi/rhm/basic-info/1st/04-02-03.html\"\u003estrict threshold standards of 100 Becquerel per kilogram\u003c/a\u003e of food item—which is a mere tenth of the internationally recognized \u003ca href=\"https://www.meti.go.jp/english/earthquake/nuclear/decommissioning/pdf/06_maff_sideevent.pdf\"\u003eCODEX threshold of 1,000 Bq/kg\u003c/a\u003e, and far less radiation than the \u003ca href=\"https://www.fda.gov/food/process-contaminants-food/supporting-document-guidance-levels-radionuclides-domestic-and-imported-foods\"\u003eU.S. standard of 1,200 Bq/kg\u003c/a\u003e. Food from Fukushima is also subjected to \u003ca href=\"https://www.iaea.org/newscenter/focus/fukushima/status-update\"\u003emonitoring\u003c/a\u003e and \u003ca href=\"https://apnews.com/article/japan-iaea-fukushima-fish-radiation-test-035b8cacd9b6d4dc603896f7e8f0ff0d\"\u003etesting\u003c/a\u003e by the International Atomic Energy Association (IAEA), the United Nations’ nuclear watchdog, to ensure safe standards.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn 2017, 6 years after the disaster, the government of Japan said that Fukushima foods were “safe and delicious”, backing up the brusque statement with numerous data and endorsements from the U.N. Food and Agriculture Organization and IAEA officials, the main global bodies who have assisted the government in monitoring the contamination.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAccording to \u003ca href=\"https://www.env.go.jp/en/chemi/rhm/portal/digest/travel/detail_002.html\"\u003edata presented by the Japanese government\u003c/a\u003e, agricultural soil in Fukushima purportedly had comparable radiation “dose rates” to soil in New York, London, Hong Kong and Seoul, as of 2017 to 2018, because \u003ca href=\"https://www.epa.gov/radtown/natural-radioactivity-food\"\u003eradiation occurs naturally\u003c/a\u003e. The Fukushima peaches would therefore be no more radioactively contaminated than those grown in a London back garden. Soil in the U.S. can also become \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S2213343723023424\"\u003econtaminated from natural radionuclides\u003c/a\u003e and even from \u003ca href=\"https://www.epa.gov/radtown/radioactive-fallout-nuclear-weapons-testing\"\u003enuclear weapons testing\u003c/a\u003e, but fruit grown in the U.S. has far lower safety thresholds and \u003ca href=\"https://www.fda.gov/media/174923/download\"\u003eless radioactivity testing procedures\u003c/a\u003e compared to that coming from Fukushima. And yet we all eat it.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eInternationally, it took another few years before governments began respecting scientists’ findings. In 2021 the \u003ca href=\"https://www.fda.gov/news-events/public-health-focus/fda-response-fukushima-daiichi-nuclear-power-facility-incident\"\u003eFDA agreed\u003c/a\u003e that, according to their “standard surveillance and sampling measures,” food imported to the U.S. from Fukushima posed no food safety risk to consumers. They followed up in 2023 by testing 51 samples from the area and found that none contained “detectable levels of cesium.” \u003ca href=\"https://www.theguardian.com/environment/2022/jun/29/uk-to-lift-import-restrictions-on-food-from-fukushima\"\u003eThe U.K. also lifted its own restrictions on Fukushima imports two years ago.\u003c/a\u003e Owing to international protocols, the food was safe for import and consumption.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut would consumers agree? This is where Harrods comes in. The Japanese government and TEPCO—the owners of the devastated power plant—have been heavily pushing their reputation-building initiative. Associate peaches with Harrods, a place the royal family is known to frequent, and maybe they become a delicacy, an interesting snack to bring out at a dinner party, rather than something to be afraid of.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd their price tag reflects this. They cost nearly $33 a piece—while an average Georgia peach in the U.S. costs less than $1. By selling here, they might just be fast-tracking their fruit to a better reputation, one which embraces the uniqueness of its origin, the weirdness of it, rather than perpetuating fear.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eRegardless of the cost of these peaches, the region is urging the world to not leave them in a ruinous past. This is commendable.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhen I first heard about the peaches, my gut instinct was “no, thank you.” But now I realize that Fukushima food has been tested within an inch of its life—and likely mine. I trust the science on this one, regardless of all the negative nuclear associations. So, now, will I try one? Yes, if they’re still giving out free samples—as $33 for a peach, however safe, is terribly indulgent.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eThis is an opinion and analysis article, and the views expressed by the author or authors are not necessarily those of \u003c/i\u003eScientific American.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-09T11:00:00Z",
  "modifiedTime": null
}
