{
  "id": "4b6c70da-4f5d-4208-b177-865d77adc19c",
  "title": "NASA Will Investigate UFOs, Er, ‘Unidentified Aerial Phenomena’",
  "link": "https://gizmodo.com/nasa-study-ufos-unidentified-aerial-phenomena-1849041509",
  "description": "The space agency’s announcement comes on the heels of some inconclusive UFO hearings before Congress.",
  "author": "Isaac Schultz",
  "published": "Thu, 09 Jun 2022 19:40:01 +0000",
  "source": "https://gizmodo.com/tag/science/rss",
  "categories": [
    "Space",
    "Articles",
    "Astronomy",
    "Human Interest",
    "NASA",
    "Science",
    "Ufology"
  ],
  "byline": "Isaac Schultz",
  "length": 3208,
  "excerpt": "The space agency’s announcement comes on the heels of some inconclusive UFO hearings before Congress.",
  "siteName": "Gizmodo",
  "favicon": "https://gizmodo.com/apple-touch-icon.png",
  "text": "NASA will commission a team of scientists to begin investigating unidentified aerial phenomena (UAPs) this fall, the agency announced today. UAPs are simply unidentified flying objects (UFOs) with less of a little-green-alien connotation about them. And that’s reasonable, because things labeled UFOs may not be flying objects at all, but instead optical illusions, image artifacts, or something else. Whatever UAPs are, they’ve been in the news lately, as U.S. House Intelligence Committee held several hearings about the phenomena that failed to reach any concrete conclusions. The hearings resurfaced some of the rare (but spell-binding) videos of UAPs, which were declassified by the Pentagon over the last few years, as well as some previously unreleased footage. The videos supposedly show geometric shapes behaving in ways no known technologies or creatures are capable of. But the hearings basically rehashed that U.S. military personnel don’t know much about these phenomena—or at least, that they say they don’t know much. Now, NASA is getting involved. “NASA believes that the tools of scientific discovery are powerful and apply here also,” said Thomas Zurbuchen, the associate administrator for science at NASA, in an agency release. “We have access to a broad range of observations of Earth from space – and that is the lifeblood of scientific inquiry. We have the tools and team who can help us improve our understanding of the unknown. That’s the very definition of what science is. That’s what we do.” NASA is not part of the Department of Defense’s effort to demystify the skyborne phenomena (the Unidentified Aerial Phenomena Task Force, now the Airborne Object Identification and Management Synchronization Group). However, NASA will now assemble a team that will take a strictly scientific approach to the mystery. They’ll find out what data exists; what data we’d need to solve these puzzles; and how best to go about getting said data. The project is expected to kick off this fall and last nine months. The U.S. Deputy Director of Naval Intelligence Scott Bray talks through a UAP video at a Congressional hearing. Photo: Kevin Dietsch (Getty Images) “Our first task is simply to gather the most robust set of data that we can,” said David Spergel, an astrophysicist and current president of the science-focused Simons Foundation, in the NASA release. “We will be identifying what data – from civilians, government, non-profits, companies – exists, what else we should try to collect, and how to best analyze it.” According to Daniel Evans, the assistant deputy associate administrator for research at NASA’s Science Mission Directorate, the report’s findings will be shared publicly. An early step, NASA says, will be to determine which of these events are natural and which may be technological. While NASA may be skeptical about alien spacecraft visiting Earth, it’s bullish about the prospect of extraterrestrial life in general. Several NASA missions are looking for evidence of life outside Earth, including the new Webb Space Telescope and the Perseverance Mars rover. More: Pentagon Reveals 400 UFO Sightings, Aims to Eliminate Stigma Around Reporting Mysterious Objects",
  "image": "https://gizmodo.com/app/uploads/2022/06/947a0b094af80f2d4705e4075dcf8f10.gif",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                          \u003cp\u003eNASA will commission a team of scientists to begin investigating unidentified aerial phenomena (UAPs) this fall, the agency announced today.\u003c/p\u003e\n\n \u003cp\u003eUAPs are simply unidentified flying objects (UFOs) with less of a little-green-alien connotation about them. And that’s reasonable, because things labeled UFOs may not be flying objects at all, but instead optical illusions, image artifacts, or something else. Whatever UAPs are, they’ve been in the news lately, as U.S. House Intelligence Committee \u003ca href=\"https://gizmodo.com/ufos-alien-conspiracy-unidentified-aerial-phenomena-1848905326\"\u003eheld several hearings\u003c/a\u003e about the phenomena that failed to reach any concrete conclusions. The hearings resurfaced some of the \u003ca href=\"https://en.wikipedia.org/wiki/Pentagon_UFO_videos\" target=\"_blank\" rel=\"noopener\"\u003erare (but spell-binding) videos\u003c/a\u003e of UAPs, which were declassified by the Pentagon over the last few years, as well as some \u003ca href=\"https://www.youtube.com/watch?v=OVshaCCwxxM\" target=\"_blank\" rel=\"noopener\"\u003epreviously unreleased footage\u003c/a\u003e.\u003c/p\u003e \u003cp\u003eThe videos supposedly show geometric shapes behaving in ways no known technologies or creatures are capable of. But the hearings basically rehashed that U.S. military personnel don’t know much about these phenomena—or at least, that they say they don’t know much. Now, NASA is getting involved.\u003c/p\u003e \u003cp\u003e“NASA believes that the tools of scientific discovery are powerful and apply here also,” said Thomas Zurbuchen, the associate administrator for science at NASA, in an agency \u003ca href=\"https://www.nasa.gov/feature/nasa-to-set-up-independent-study-on-unidentified-aerial-phenomena/\" target=\"_blank\" rel=\"noopener\"\u003erelease\u003c/a\u003e. “We have access to a broad range of observations of Earth from space – and that is the lifeblood of scientific inquiry. We have the tools and team who can help us improve our understanding of the unknown. That’s the very definition of what science is. That’s what we do.”\u003c/p\u003e \u003cp\u003eNASA is not part of the Department of Defense’s effort to demystify the skyborne phenomena (the Unidentified Aerial Phenomena Task Force, now the Airborne Object Identification and Management Synchronization Group). However, NASA will now assemble a team that will take a strictly scientific approach to the mystery. They’ll find out what data exists; what data we’d need to solve these puzzles; and how best to go about getting said data. The project is expected to kick off this fall and last nine months.\u003c/p\u003e\n\n \u003cfigure id=\"attachment_1851999867\" aria-describedby=\"caption-attachment-1851999867\"\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1280\" src=\"https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db.jpg\" alt=\"The U.S. Deputy Director of Naval Intelligence Scott Bray talks through a UAP video at a Congressional hearing.\" srcset=\"https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db.jpg 1920w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-300x200.jpg 300w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-1024x683.jpg 1024w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-768x512.jpg 768w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-336x224.jpg 336w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-1400x932.jpg 1400w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-680x453.jpg 680w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-896x597.jpg 896w, https://gizmodo.com/app/uploads/2022/06/b34ef1f0f0f1c98a1680369f369132db-1792x1195.jpg 1792w\" sizes=\"(max-width: 1023px) calc(100vw - 2rem), (max-width: 1279px) calc(100vw - 26rem), 680px\"/\u003e\u003cfigcaption id=\"caption-attachment-1851999867\"\u003e\u003cspan\u003eThe U.S. Deputy Director of Naval Intelligence Scott Bray talks through a UAP video at a Congressional hearing.\u003c/span\u003e Photo: Kevin Dietsch (Getty Images)\u003c/figcaption\u003e\u003c/figure\u003e \u003cp\u003e“Our first task is simply to gather the most robust set of data that we can,” said David Spergel, an astrophysicist and current president of the science-focused Simons Foundation, in the NASA release. “We will be identifying what data – from civilians, government, non-profits, companies – exists, what else we should try to collect, and how to best analyze it.”\u003c/p\u003e \u003cp\u003eAccording to Daniel Evans, the assistant deputy associate administrator for research at NASA’s Science Mission Directorate, the report’s findings will be shared publicly.\u003c/p\u003e\n\n \u003cp\u003eAn early step, NASA says, will be to determine which of these events are natural and which may be technological. While NASA may be skeptical about alien spacecraft visiting Earth, it’s bullish about the prospect of extraterrestrial life in general. Several NASA missions are looking for evidence of life outside Earth, including the new \u003ca href=\"https://gizmodo.com/how-the-webb-space-telescope-will-support-the-search-fo-1848691660\"\u003eWebb Space Telescope\u003c/a\u003e and the \u003ca href=\"https://gizmodo.com/abigail-allwoods-hunt-for-alien-fossils-on-mars-has-beg-1846344495\"\u003ePerseverance Mars rover\u003c/a\u003e.\u003c/p\u003e \u003cp\u003e\u003ca href=\"https://gizmodo.com/ufo-uap-unidentified-objects-aliens-hearing-1848936948\"\u003eMore: Pentagon Reveals 400 UFO Sightings, Aims to Eliminate Stigma Around Reporting Mysterious Objects\u003c/a\u003e\u003c/p\u003e                          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2022-06-09T19:40:01Z",
  "modifiedTime": "2022-06-09T19:40:01Z"
}
