{
  "id": "522fc8d5-46db-45c7-bb3c-efe22aa80816",
  "title": "Reviving Europe's historical scents—including 'the smell of hell'",
  "link": "https://phys.org/news/2025-06-reviving-europe-historical-scents-hell.html",
  "description": "Researchers are merging multidisciplinary expertise with AI tools to document, reconstruct and preserve Europe's historical scents.",
  "author": "",
  "published": "Sat, 28 Jun 2025 12:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Analytical Chemistry Other"
  ],
  "byline": "Kaja Šeruga",
  "length": 7401,
  "excerpt": "Researchers are merging multidisciplinary expertise with AI tools to document, reconstruct and preserve Europe's historical scents.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Researchers have created a searchable database of Europe’s historical smells. Credit: Odeuropa2025 Researchers are merging multidisciplinary expertise with AI tools to document, reconstruct and preserve Europe's historical scents. What do you think hell smells like? British researcher Dr. William Tullett has faithfully recreated its foul odor—or at least how our forefathers imagined it. Thanks to a research initiative called ODEUROPA, which ran from 2021 to 2023, Tullett did not need to spend years scouring archives across Europe. Instead, the information was accessible in the ODEUROPA Smell Explorer, a unique, easily searchable database of historical smells, including more than 2.4 million individual instances or mentions of different smells. \"Hell and its symbolism play a major role in European and Christian culture,\" said Dr. Tullett, an expert on the history of smell and senior lecturer at the University of York in the UK. To reconstruct this particular smell, he collected relevant references from 16th- and 17th-century sermons. These ranged from the expected sulfur and brimstone to more evocative descriptions like \"a million dead dogs.\" This infernal scent was just one of a dozen historical scents presented at the 2025 World Expo's European pavilion in Japan. Also featured were frankincense, myrrh and the scent of Amsterdam's canals—each with their own emotional, cultural and historic connotations. All were recreated by the ODEUROPA team's researchers. Professor Inger Leemans, cultural historian at the Vrije Universiteit Amsterdam in the Netherlands who coordinated the research team, said the World Expo was a vivid demonstration of how subjective and dependent smells are on historical context. While some Europeans found the scent of hell strangely attractive because the smokiness reminded them of grilled meat, Japanese visitors in Osaka found it \"completely revolting,\" she said. Preserving scents with AI's help Olfactory heritage—smells that hold cultural or community value—remains underexplored and difficult to document. While research into scent as a cultural phenomenon has been growing for some time, the work was previously scattered across various disciplines. \"This project was able to bring together expertise about scents from different domains like history, art history, chemistry and heritage science,\" Leemans said of the work done by researchers based in the Netherlands, France, Germany, Italy, Slovenia and the U.K. And it went well beyond recreating the brimstone of hell. The ODEUROPA team developed an Olfactory Heritage Toolkit containing a list of olfactory practices, smells and \"fragrant places.\" The aim is to help heritage researchers and policymakers acknowledge and safeguard significant scents and smellscapes—scents or odors that characterize a particular place, environment, or moment in time. On a practical note, Tullett said, smell can be a powerful tool to help people connect with history. Museums and heritage sites can use scent to make exhibits more immersive and memorable. \"Smell allows people to have a tangible, authentic and real engagement with the past,\" he said. Museums and heritage sites are already taking notice, and curators are increasingly turning to smell as a way to engage visitors. For example, the ODEUROPA team helped create a scent-based tour at the Museum Ulm, a museum of art, archaeology, and urban and cultural history in Ulm, Germany. They also produced a self-guided tour of Amsterdam with scratch-and-sniff maps, and an Olfactory Storytelling Toolkit—a how-to guide for working with smells in museums and heritage sites. To unearth historical knowledge and \"nose-witness accounts\" from some 43,000 images and 167,000 historical texts in six languages, researchers trained AI models to find smell and scent references in texts and images from the 16th to the early 20th century. On the basis of that, they produced knowledge graphs—a structured network of interconnected information which interlinks the data and puts it in context. This cutting-edge use of AI supports the EU's wider ambition to make cultural heritage more impactful and accessible, including through Europeana, Europe's platform for digitalized cultural content. Inspired by Japan Even before the World Expo, the ODEUROPA researchers had been exchanging ideas with counterparts in Japan and were inspired by Japan's pioneering efforts in scent preservation. \"Japan has been an inspiring example of thinking about smell in terms of heritage,\" said Leemans. In 2001, Japan's Ministry of Environment created a list of the country's 100 notable smellscapes—from the sea fog that envelops the Kushiro region in cool summers to the white peaches of the Kibi Hills and the scent of Korean cuisine in Osaka's Tsuruhashi neighborhood. This inspired the ODEUROPA team to think more broadly about how smellscapes can reflect identity, place and memory. \"Smellscapes are important spaces that should be safeguarded and have a specific value,\" said Leemans. Smell used to be a much bigger part of Japanese culture, according to Maki Ueda, a pioneering Japanese olfactory artist whose work also inspired the European team. During the Heian period, more than a thousand years ago, scent was not only used for fragrance, but also as a form of social signaling and information, she explained. \"We don't have that nowadays, that delicacy and sensitivity to scents.\" Ueda stressed that engaging with olfactory art is a meaningful and educational experience. \"People realize that they had forgotten how powerful the sense of smell can be.\" Engaging the forgotten sense Leemans agreed that smell has been undeservedly overlooked, but argues it may now be making a comeback. \"Most people have a lot of nose knowledge that they don't normally tap into,\" she said. \"They might have trouble finding the words, but if we help them, they can actually bring that knowledge together.\" To keep the conversation going, Leemans left behind an AI avatar of herself in Osaka. The digital version of her will continue to present ODEUROPA's research and answer visitors' questions for the remainder of the World Expo. Her team has also been discussing potential future collaborations with Japanese partners, who are doing interesting work in collecting, documenting and presenting scents. \"There are so many different ways in which we can move forward together and learn from each other,\" she said. This article was originally published in Horizon the EU Research and Innovation Magazine.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/researchers-revive-eur.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1224180\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/2025/researchers-revive-eur.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/researchers-revive-eur.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/researchers-revive-eur.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/researchers-revive-eur.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/researchers-revive-eur.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/researchers-revive-eur.jpg\" width=\"800\" height=\"530\" alt=\"Researchers revive Europe\u0026#39;s historical scents, including \u0026#39;the smell of hell\u0026#39;\" title=\"Researchers have created a searchable database of Europe’s historical smells. Credit: Odeuropa2025\" fetchpriority=\"high\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eResearchers have created a searchable database of Europe’s historical smells. Credit: Odeuropa2025\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eResearchers are merging multidisciplinary expertise with AI tools to document, reconstruct and preserve Europe\u0026#39;s historical scents.\u003c/p\u003e\n\n                \n                                \n                \n                \n                                                            \u003cp\u003eWhat do you think hell smells like? British researcher Dr. William Tullett has faithfully recreated its foul odor—or at least how our forefathers imagined it.\u003c/p\u003e\n\u003cp\u003eThanks to a research initiative called ODEUROPA, which ran from 2021 to 2023, Tullett did not need to spend years scouring archives across Europe. Instead, the information was accessible in the \u003ca href=\"https://explorer.odeuropa.eu/\" target=\"_blank\"\u003eODEUROPA Smell Explorer,\u003c/a\u003e a unique, easily searchable database of historical smells, including more than 2.4 million individual instances or mentions of different smells.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Hell and its symbolism play a major role in European and Christian culture,\u0026#34; said Dr. Tullett, an expert on the history of smell and senior lecturer at the University of York in the UK.\u003c/p\u003e\n\u003cp\u003eTo reconstruct this particular smell, he collected relevant references from 16th- and 17th-century sermons. These ranged from the expected sulfur and brimstone to more evocative descriptions like \u0026#34;a million dead dogs.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis infernal scent was just one of a dozen historical scents presented at the 2025 World Expo\u0026#39;s European pavilion in Japan. Also featured were frankincense, myrrh and the scent of Amsterdam\u0026#39;s canals—each with their own emotional, cultural and historic connotations.\u003c/p\u003e\n\u003cp\u003eAll were recreated by the ODEUROPA team\u0026#39;s researchers.\u003c/p\u003e\n\u003cp\u003eProfessor Inger Leemans, cultural historian at the Vrije Universiteit Amsterdam in the Netherlands who coordinated the research team, said the World Expo was a vivid demonstration of how subjective and dependent smells are on historical context.\u003c/p\u003e\n\u003cp\u003eWhile some Europeans found the scent of hell strangely attractive because the smokiness reminded them of grilled meat, Japanese visitors in Osaka found it \u0026#34;completely revolting,\u0026#34; she said.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003ePreserving scents with AI\u0026#39;s help\u003c/h2\u003e\n\u003cp\u003eOlfactory heritage—smells that hold cultural or community value—remains underexplored and difficult to document. While research into scent as a cultural phenomenon has been growing for some time, the work was previously scattered across various disciplines.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This project was able to bring together expertise about scents from different domains like history, art history, chemistry and heritage science,\u0026#34; Leemans said of the work done by researchers based in the Netherlands, France, Germany, Italy, Slovenia and the U.K.\u003c/p\u003e\n\u003cp\u003eAnd it went well beyond recreating the brimstone of hell. The ODEUROPA team developed an \u003ca href=\"https://odeuropa.eu/olfactory-heritage-toolkit/\" target=\"_blank\"\u003eOlfactory Heritage Toolkit\u003c/a\u003e containing a list of olfactory practices, smells and \u0026#34;fragrant places.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe aim is to help heritage researchers and policymakers acknowledge and safeguard significant scents and smellscapes—scents or odors that characterize a particular place, environment, or moment in time.\u003c/p\u003e\n\u003cp\u003eOn a practical note, Tullett said, smell can be a powerful tool to help people connect with history. Museums and heritage sites can use scent to make exhibits more immersive and memorable.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Smell allows people to have a tangible, authentic and real engagement with the past,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003eMuseums and heritage sites are already taking notice, and curators are increasingly turning to smell as a way to engage visitors.\u003c/p\u003e\n\u003cp\u003eFor example, the ODEUROPA team helped create a scent-based tour at the Museum Ulm, a museum of art, archaeology, and urban and cultural history in Ulm, Germany.\u003c/p\u003e\n\u003cp\u003eThey also produced a \u003ca href=\"https://citysniffers.odeuropa.eu/\" target=\"_blank\"\u003eself-guided tour of Amsterdam\u003c/a\u003e with scratch-and-sniff maps, and an \u003ca href=\"https://odeuropa.eu/the-olfactory-storytelling-toolkit/\" target=\"_blank\"\u003eOlfactory Storytelling Toolkit\u003c/a\u003e—a how-to guide for working with smells in museums and heritage sites.\u003c/p\u003e\n\u003cp\u003eTo unearth historical knowledge and \u0026#34;nose-witness accounts\u0026#34; from some 43,000 images and 167,000 historical texts in six languages, researchers trained AI models to find smell and scent references in texts and images from the 16th to the early 20th century.\u003c/p\u003e\n\u003cp\u003eOn the basis of that, they produced knowledge graphs—a structured network of interconnected information which interlinks the data and puts it in context.\u003c/p\u003e\n\u003cp\u003eThis cutting-edge use of AI supports the EU\u0026#39;s wider ambition to make cultural heritage more impactful and accessible, including through \u003ca href=\"https://www.europeana.eu/en\" target=\"_blank\"\u003eEuropeana\u003c/a\u003e, Europe\u0026#39;s platform for digitalized cultural content.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eInspired by Japan\u003c/h2\u003e\n\u003cp\u003eEven before the World Expo, the ODEUROPA researchers had been exchanging ideas with counterparts in Japan and were inspired by Japan\u0026#39;s pioneering efforts in scent preservation.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Japan has been an inspiring example of thinking about smell in terms of heritage,\u0026#34; said Leemans.\u003c/p\u003e\n\u003cp\u003eIn 2001, Japan\u0026#39;s Ministry of Environment created a list of the country\u0026#39;s 100 notable smellscapes—from the sea fog that envelops the Kushiro region in cool summers to the white peaches of the Kibi Hills and the scent of Korean cuisine in Osaka\u0026#39;s Tsuruhashi neighborhood.\u003c/p\u003e\n\u003cp\u003eThis inspired the ODEUROPA team to think more broadly about how smellscapes can reflect identity, place and memory.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Smellscapes are important spaces that should be safeguarded and have a specific value,\u0026#34; said Leemans.\u003c/p\u003e\n\u003cp\u003eSmell used to be a much bigger part of Japanese culture, according to Maki Ueda, a pioneering Japanese olfactory artist whose work also inspired the European team.\u003c/p\u003e\n\u003cp\u003eDuring the Heian period, more than a thousand years ago, \u003ca href=\"https://phys.org/tags/scent/\" rel=\"tag\"\u003escent\u003c/a\u003e was not only used for fragrance, but also as a form of social signaling and information, she explained.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We don\u0026#39;t have that nowadays, that delicacy and sensitivity to scents.\u0026#34;\u003c/p\u003e\n\u003cp\u003eUeda stressed that engaging with olfactory art is a meaningful and educational experience. \u0026#34;People realize that they had forgotten how powerful the sense of smell can be.\u0026#34;\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eEngaging the forgotten sense\u003c/h2\u003e\n\u003cp\u003eLeemans agreed that \u003ca href=\"https://phys.org/tags/smell/\" rel=\"tag\"\u003esmell\u003c/a\u003e has been undeservedly overlooked, but argues it may now be making a comeback.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Most people have a lot of nose knowledge that they don\u0026#39;t normally tap into,\u0026#34; she said. \u0026#34;They might have trouble finding the words, but if we help them, they can actually bring that knowledge together.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTo keep the conversation going, Leemans left behind an AI avatar of herself in Osaka. The \u003ca href=\"https://phys.org/tags/digital+version/\" rel=\"tag\"\u003edigital version\u003c/a\u003e of her will continue to present ODEUROPA\u0026#39;s research and answer visitors\u0026#39; questions for the remainder of the World Expo.\u003c/p\u003e\n\u003cp\u003eHer team has also been discussing potential future collaborations with Japanese partners, who are doing interesting work in collecting, documenting and presenting scents.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There are so many different ways in which we can move forward together and learn from each other,\u0026#34; she said.\u003c/p\u003e\n\n                                                            \n                  \n\n                \n                                    \n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                                    \u003cp\u003e\u003ci\u003eThis article was originally published in \u003ca href=\"https://projects.research-and-innovation.ec.europa.eu/en/horizon-magazine\" target=\"_blank\"\u003eHorizon\u003c/a\u003e the EU Research and Innovation Magazine.\u003c/i\u003e\u003c/p\u003e\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-28T12:00:01-04:00",
  "modifiedTime": null
}
