{
  "id": "5615ad01-8a01-4d22-b537-325882db4826",
  "title": "'Forever chemical' found in all but one of tested UK rivers",
  "link": "https://www.bbc.com/news/articles/cm2yjxxvx08o",
  "description": "The long-term impact of the chemical on human health is still unclear and being researched.",
  "author": "",
  "published": "Sun, 15 Jun 2025 23:33:52 GMT",
  "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
  "categories": null,
  "byline": "Jonah Fisher",
  "length": 3672,
  "excerpt": "The long-term impact of the chemical on human health is still unclear and being researched.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250611-093910-fc500e843d-web-2.23.1-1/apple-touch-icon.png",
  "text": "Jonah FisherBBC environment correspondentA chemical that scientists worry might have an impact on human reproduction has been found in rivers across the UK.Researchers from York University analysed samples from 32 rivers in all the UK's 4 nations and found traces of trifluoroacetic acid (TFA) at 98% of the test locations.TFA is what's known as a \"forever chemical\" which means that it breaks down extremely slowly in nature, and so accumulates over time.As with other \"forever chemicals\", also known as PFAS, just how much a threat to human health and at what concentrations is still being researched. But scientists in Germany say having looked at the impact of TFA on animals they want it to be classed as toxic for reproduction. TFA forms when synthetic chemicals from other \"forever chemicals\" such as those found in pesticides and refrigerants are partially broken down. \"This molecule (TFA) is everywhere,\" Alistair Boxall, professor of Environmental Science at the University of York who carried out the research, told the BBC. \"We will all be drinking water containing TFA every day - so we'll be exposed throughout our lifetime. It's that long-term, low level exposure that is the big concern.\"This new study was funded by environmental charity Fidra and involved sampling in 5 rivers in Wales, 3 in Northern Ireland 14 in Scotland and 10 in the north of England. The highest concentration was recorded on the River Kelvin in Glasgow.The River Ness, which flows from Loch Ness to the Moray Firth, was the only river sampled not to show traces of TFA.Recent studies in the EU have found TFA to be widespread, including in wine and food, human blood and breast milk. Authorities in Germany have been looking with interest at rising TFA levels in drinking water. In the last two decades its concentrations have gone up fourfold and researchers have been trying to establish what impact - if any - it might have on human health. Citing scientific studies that showed TFA affecting rabbit and rat foetuses, the German Federal Environment Agency (UBA) has applied to the European Chemicals Agency (ECHA) for TFA to be classified as toxic for reproduction and harmful to the environment. That could eventually lead to recommendations being made in the EU as to how products containing TFA should be controlled.\"Currently, there are no expected adverse health effects from consuming water or food contaminated with TFA,\" said Andreas Hensel, president of the German Federal Institute for Risk Assessment (BfR). \"The new classification is an important step in preparing further measures to ensure that this remains the case in the future\".There aren't currently any rules or regulations in place to identify or reduce the concentrations of TFA either in the environment or in drinking water supplies in the UK.But aware of concerns, the Drinking Water Inspectorate, which monitors and regulates drinking water quality in England and Wales, has just commissioned its own research. It will look at how much TFA is already in drinking water and what risk - if any - it poses. \"The information signposted by the University of York suggests that TFA can be formed from the degradation of PFAS-containing pesticides,\" a spokesperson for the Drinking Water Inspectorate, told the BBC. \"It is important that the fate of pesticides and other chemicals in the environment is understood, in order to protect drinking water sources.\"A spokesperson for Water UK, which represents the UK's water companies, told the BBC: \"We want to see PFAS, including TFA, banned and the development of a national plan to remove it from the environment which should be paid for by manufacturers.\"",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e15a/live/59961610-4a76-11f0-b24e-5da3b43383e8.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250611-093910-fc500e843d-web-2.23.1-1/grey-placeholder.png\"/\u003e\u003cimg sizes=\"96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c4df/live/7b967190-4861-11f0-9471-e380f647874e.jpg.webp\" loading=\"lazy\" alt=\"Jonah Fisher  profile image\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eJonah Fisher\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC environment correspondent\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA chemical that scientists worry might have an impact on human reproduction has been found in rivers across the UK.\u003c/p\u003e\u003cp\u003eResearchers from York University analysed samples from 32 rivers in all the UK\u0026#39;s 4 nations and found traces of trifluoroacetic acid (TFA) at 98% of the test locations.\u003c/p\u003e\u003cp\u003eTFA is what\u0026#39;s known as a \u0026#34;forever chemical\u0026#34; which means that it breaks down extremely slowly in nature, and so accumulates over time.\u003c/p\u003e\u003cp\u003eAs with other \u0026#34;forever chemicals\u0026#34;, also known as PFAS, just how much a threat to human health and at what concentrations is still being researched. \u003c/p\u003e\u003cp\u003eBut scientists in Germany say having looked at the impact of TFA on animals they want it to be classed as toxic for reproduction. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eTFA forms when synthetic chemicals from other \u0026#34;forever chemicals\u0026#34; such as those found in pesticides and refrigerants are partially broken down. \u003c/p\u003e\u003cp\u003e\u0026#34;This molecule (TFA) is everywhere,\u0026#34; Alistair Boxall, professor of Environmental Science at the University of York who carried out the research, told the BBC.  \u0026#34;We will all be drinking water containing TFA every day - so we\u0026#39;ll be exposed throughout our lifetime. It\u0026#39;s that long-term, low level exposure that is the big concern.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://www.fidra.org.uk/download/concentrations-of-trifluoroacetic-acid-tfa-in-uk-surface-waters/\"\u003eThis new study\u003c/a\u003e was funded by environmental charity Fidra and involved sampling in 5 rivers in Wales, 3 in Northern Ireland 14 in Scotland and 10 in the north of England. The highest concentration was recorded on the River Kelvin in Glasgow.\u003c/p\u003e\u003cp\u003eThe River Ness, which flows from Loch Ness to the Moray Firth, was the only river sampled not to show traces of TFA.\u003c/p\u003e\u003cp\u003eRecent studies in the EU have found TFA to be widespread, including in wine and food, human blood and breast milk. \u003c/p\u003e\u003cp\u003eAuthorities in Germany have been looking with interest at rising TFA levels in drinking water. In the last two decades its concentrations have gone up fourfold and researchers have been trying to establish what impact - if any - it might have on human health. \u003c/p\u003e\u003cp\u003eCiting scientific studies that showed TFA affecting rabbit and rat foetuses, the \u003ca target=\"_blank\" href=\"https://www.umweltbundesamt.de/en/publikationen/trifluoroacetate-tfa-laying-the-foundations-for\"\u003eGerman  Federal Environment Agency (UBA) has\u003c/a\u003e\u003ca target=\"_blank\" href=\"https://www.umweltbundesamt.de/en/publikationen/trifluoroacetate-tfa-laying-the-foundations-for\"\u003e applied to the European Chemicals Agency (ECHA\u003c/a\u003e) for TFA to be classified as \u003ca target=\"_blank\" href=\"https://www.umweltbundesamt.de/en/press/pressinformation/german-agencies-classify-tfa-as-toxic-substance#:~:text=The%20BfR%20considers%20TFA%20to,a%20purely%20hazard%2Dbased%20classification.\"\u003etoxic for reproduction and harmful to the environment\u003c/a\u003e. That could eventually lead to recommendations being made in the EU as to how products containing TFA should be controlled.\u003c/p\u003e\u003cp\u003e\u0026#34;Currently, there are no expected adverse health effects from consuming water or food contaminated with TFA,\u0026#34; said Andreas Hensel, president of the German Federal Institute for Risk Assessment (BfR). \u0026#34;The new classification is an important step in preparing further measures to ensure that this remains the case in the future\u0026#34;.\u003c/p\u003e\u003cp\u003eThere aren\u0026#39;t currently any rules or regulations in place to identify or reduce the concentrations of TFA either in the environment or in drinking water supplies in the UK.\u003c/p\u003e\u003cp\u003eBut aware of concerns, the Drinking Water Inspectorate, which monitors and regulates drinking water quality in England and Wales, has just commissioned its own research. It will look at how much TFA is already in drinking water and what risk - if any - it poses. \u003c/p\u003e\u003cp\u003e\u0026#34;The information signposted by the University of York suggests that TFA can be formed from the degradation of PFAS-containing pesticides,\u0026#34; a spokesperson for the Drinking Water Inspectorate, told the BBC.  \u0026#34;It is important that the fate of pesticides and other chemicals in the environment is understood, in order to protect drinking water sources.\u0026#34;\u003c/p\u003e\u003cp\u003eA spokesperson for Water UK, which represents the UK\u0026#39;s water companies, told the BBC: \u0026#34;We want to see PFAS, including TFA, banned and the development of a national plan to remove it from the environment which should be paid for by manufacturers.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-15T23:33:52.733Z",
  "modifiedTime": "2025-06-15T23:33:52.733Z"
}
