{
  "id": "595976ec-b21a-49d2-b065-ef375c340222",
  "title": "Unlocking the past: How NZ's first jail tells a complex story of colonial identity",
  "link": "https://phys.org/news/2025-01-nz-complex-story-colonial-identity.html",
  "description": "New Zealand's first jail was a simple affair, just a symmetrical four-roomed log building, built in 1840 at Okiato in the Bay of Islands, not far from present-day Russell.",
  "author": "",
  "published": "Sat, 04 Jan 2025 18:50:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences Political science"
  ],
  "byline": "Christine McCarthy,",
  "length": 6091,
  "excerpt": "New Zealand's first jail was a simple affair, just a symmetrical four-roomed log building, built in 1840 at Okiato in the Bay of Islands, not far from present-day Russell.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "View of Kororāreka in the Bay of Islands, 1845. Credit: George Thomas Clayton, Wikimedia Commons, CC BY New Zealand's first jail was a simple affair, just a symmetrical four-roomed log building, built in 1840 at Okiato in the Bay of Islands, not far from present-day Russell. But its history—especially the bits that have been forgotten—tells us a lot about how we have framed our colonial past, particularly in relation to architecture. Typically, New Zealand's earliest non-Māori buildings were depicted as having a direct lineage with imperial Britain. As one of our earliest architectural histories (written by Christchurch architect Paul Pascoe and published for the 1940 centennial) put it: \"Our architecture derived from England.\" But as my recent research has found, this isn't the whole story. In fact, it obscures another important strand of New Zealand's early development, which reveals how the evolving colony wanted to see itself. 'Little more than shacks' At the time the first jail was built, Okiato was the colony's administrative capital, close to Kororāreka, which Governor William Hobson renamed Russell. The building consisted of two windowless cells, with a central kitchen and a back room for the jailer. It was located in a yard surrounded by a three-meter-high log wall, and was built by men from the 80th Regiment at a cost of £420. Architectural historian John Stacpoole (1919–2018) described it as one of a series of buildings that were \"little more than shacks,\" and on the surface it doesn't sound terribly special. There was no Victorian grandeur that might be typical of a civic building, and it wasn't built of brick or stone as English prisons were at the time. And there was a reason for this. The jail was designed in the Colonial Architect's office in New South Wales. As such, it was a direct import from Australia's convict system. Most New Zealanders probably think of their country at that time as a British colony. But before it became its own distinct colony, Britain extended the boundaries of the colony of New South Wales to include New Zealand. This arrangement lasted almost a year, but is often forgotten or overlooked. Partly this is because considerable effort was put into distancing New Zealand from the convict \"taint\" of Australia's penal colonies. Australian designs There is further confusion over the jail's designer. The architect usually credited is William Mason (1810–97), who was employed by the New South Wales Colonial Architect's office before arriving in New Zealand. Mason is better known for buildings such as Government House in Auckland (1856), All Saints Church in North Dunedin (1865) and the Stock Exchange Building in Dunedin (1868, demolished in 1969). But the Okiato jail design wasn't one of Mason's. It was actually a standard plan designed by Ambrose Hallen, also from the Colonial Architect's office. Hallen's time as colonial architect from 1832 to 1835 coincided with a government policy of territorial sprawl in New South Wales, which included building more judicial and penal infrastructure. The policy required the design of what Australian prison historian James Kerr has called the \"basic plan.\" This was adapted across state as a watch house, a lockup and a jail for more than half a century. An example is the Goulburn Plains design, which incorporated a timber weatherboard courthouse straddling the stockade surrounding its log jail. Another version added a room for the jailer behind the kitchen's fireplace. It was this design Mason had built at Okiato. How and when history is told The forgotten influence of the New South Wales Colonial Architect's office on New Zealand's earliest prison architecture surely relates in part to the building's apparently rudimentary nature. Simple log buildings fit with a pioneering, frontier myth of transience and impermanent architecture. This sits at odds with the sophisticated skills already evident in 1840s Aotearoa, including Māori expertise and the craftsmanship of British and US ship carpenters. But it may also be to do with how we tell the histories of our colonial architecture. Consistent with Paul Pascoe's assertion that local architecture \"derived from England,\" our first jail buildings have perhaps been measured against English prison architecture and found inadequate. But the jail at Okiato was not a makeshift one-off—a deliberately designed structure that links the young colonies of New South Wales and New Zealand in ways that help us understand our early European history. Alas, it no longer exists. After ten months, Hobson left Okiato and established a new capital at Tāmaki Makaurau-Auckland. References to the jail suggest it operated until about 1844. The Okiato jail might not have loomed large in New Zealand's architectural histories, but the story of its origin is nonetheless a useful one. It's a healthy reminder that history has a complex relationship with \"the truth,\" so we need to constantly reexamine it. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: Unlocking the past: How NZ's first jail tells a complex story of colonial identity (2025, January 4) retrieved 4 January 2025 from https://phys.org/news/2025-01-nz-complex-story-colonial-identity.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/unlocking-the-past-how.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/unlocking-the-past-how.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/unlocking-the-past-how.jpg\" data-sub-html=\"View of Kororāreka in the Bay of Islands, 1845. Credit: George Thomas Clayton, Wikimedia Commons, \u0026lt;a class=\u0026#34;license\u0026#34; href=\u0026#34;http://creativecommons.org/licenses/by/4.0/\u0026#34;\u0026gt;CC BY\u0026lt;/a\u0026gt;\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/unlocking-the-past-how.jpg\" alt=\"Unlocking the past: how NZ\u0026#39;s first jail tells a complex story of colonial identity\" title=\"View of Kororāreka in the Bay of Islands, 1845. Credit: George Thomas Clayton, Wikimedia Commons, CC BY\" width=\"800\" height=\"394\"/\u003e\n             \u003cfigcaption\u003e\n                View of Kororāreka in the Bay of Islands, 1845. Credit: George Thomas Clayton, Wikimedia Commons, \u003ca href=\"http://creativecommons.org/licenses/by/4.0/\"\u003eCC BY\u003c/a\u003e\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eNew Zealand\u0026#39;s first jail was a simple affair, just a symmetrical four-roomed log building, built in 1840 at Okiato in the Bay of Islands, not far from present-day Russell.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBut its history—especially the bits that have been forgotten—tells us a lot about how we have framed our colonial past, particularly in relation to architecture.\u003c/p\u003e\n\u003cp\u003eTypically, New Zealand\u0026#39;s earliest non-Māori buildings were depicted as having a direct lineage with imperial Britain. As one of our earliest architectural histories (written by Christchurch architect Paul Pascoe and published for the 1940 centennial) put it: \u0026#34;Our architecture derived from England.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBut as my \u003ca href=\"https://www.tandfonline.com/doi/full/10.1080/10331867.2024.2369371\" target=\"_blank\"\u003erecent research\u003c/a\u003e has found, this isn\u0026#39;t the whole story. In fact, it obscures another important strand of New Zealand\u0026#39;s \u003ca href=\"https://phys.org/tags/early+development/\" rel=\"tag\"\u003eearly development\u003c/a\u003e, which reveals how the evolving colony wanted to see itself.\u003c/p\u003e\n\u003ch2\u003e\u0026#39;Little more than shacks\u0026#39;\u003c/h2\u003e\n\u003cp\u003eAt the time the first jail was built, \u003ca href=\"https://www.doc.govt.nz/parks-and-recreation/places-to-go/northland/places/russell-area/heritage-sites/okiato-historic-reserve/\" target=\"_blank\"\u003eOkiato\u003c/a\u003e was the colony\u0026#39;s administrative capital, close to \u003ca href=\"https://nzhistory.govt.nz/culture/missionaries/kororareka\" target=\"_blank\"\u003eKororāreka,\u003c/a\u003e which Governor \u003ca href=\"https://nzhistory.govt.nz/people/william-hobson\" target=\"_blank\"\u003eWilliam Hobson\u003c/a\u003e renamed Russell.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://phys.org/tags/building/\" rel=\"tag\"\u003ebuilding\u003c/a\u003e consisted of two windowless cells, with a central kitchen and a back room for the jailer. It was located in a yard surrounded by a three-meter-high log wall, and was built by men from the \u003ca href=\"https://teara.govt.nz/en/1966/25242/print#:~:text=80th%3A%20The%20South%20Staffordshire%20Regiment,New%20Zealand%20between%201840%E2%80%9345.\" target=\"_blank\"\u003e80th Regiment\u003c/a\u003e at a cost of £420.\u003c/p\u003e\n\u003cp\u003eArchitectural historian \u003ca href=\"https://remueraheritage.org.nz/story/john-massy-stacpoole-1919-2018/\" target=\"_blank\"\u003eJohn Stacpoole\u003c/a\u003e (1919–2018) described it as one of a series of buildings that were \u0026#34;little more than shacks,\u0026#34; and on the surface it doesn\u0026#39;t sound terribly special. There was no Victorian grandeur that might be typical of a civic building, and it wasn\u0026#39;t built of brick or stone as English prisons were at the time.\u003c/p\u003e\n\u003cp\u003eAnd there was a reason for this. The jail was designed in the Colonial Architect\u0026#39;s office in New South Wales. As such, it was a direct import from Australia\u0026#39;s convict system.\u003c/p\u003e\n\u003cp\u003eMost New Zealanders probably think of their country at that time as a British colony. But before it became its own distinct colony, Britain extended the boundaries of the colony of New South Wales to include New Zealand.\u003c/p\u003e\n\u003cp\u003eThis arrangement lasted almost a year, but is often forgotten or overlooked. Partly this is because considerable effort was put into distancing New Zealand from the convict \u0026#34;taint\u0026#34; of Australia\u0026#39;s penal colonies.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eAustralian designs\u003c/h2\u003e\n\u003cp\u003eThere is further confusion over the jail\u0026#39;s designer. The architect usually credited is \u003ca href=\"https://teara.govt.nz/en/biographies/1m22/mason-william\" target=\"_blank\"\u003eWilliam Mason\u003c/a\u003e (1810–97), who was employed by the New South Wales Colonial Architect\u0026#39;s office before arriving in New Zealand.\u003c/p\u003e\n\u003cp\u003eMason is better known for buildings such as \u003ca href=\"https://vuw-my.sharepoint.com/personal/mccartch_staff_vuw_ac_nz/Documents/MyHDocs/papers/New%20Zealand/prisons/sabatical%202019/BOOK/Chapter%202%20-%20Crown%20colonial%20NZ%201840-1852/NSW-Okiato%20and%20Kororareka/Fabrications/Fig%201a%20map-north%20island%20copy.jpg\" target=\"_blank\"\u003eGovernment House\u003c/a\u003e in Auckland (1856), \u003ca href=\"https://www.heritage.org.nz/list-details/2136/All%20Saints\u0026#39;%20Church%20(Anglican)\" target=\"_blank\"\u003eAll Saints Church\u003c/a\u003e in North Dunedin (1865) and the \u003ca href=\"https://ourheritage.ac.nz/files/original/44c78dd94547392d0d31867c2cbc34dd.jpg\" target=\"_blank\"\u003eStock Exchange Building\u003c/a\u003e in Dunedin (1868, demolished in 1969).\u003c/p\u003e\n\u003cp\u003eBut the Okiato jail design wasn\u0026#39;t one of Mason\u0026#39;s. It was actually a standard plan designed by \u003ca href=\"https://adb.anu.edu.au/biography/hallen-ambrose-2147\" target=\"_blank\"\u003eAmbrose Hallen\u003c/a\u003e, also from the Colonial Architect\u0026#39;s office.\u003c/p\u003e\n\u003cp\u003eHallen\u0026#39;s time as colonial architect from 1832 to 1835 coincided with a government policy of territorial sprawl in New South Wales, which included building more judicial and penal infrastructure.\u003c/p\u003e\n\u003cp\u003eThe policy required the design of what Australian prison historian James Kerr has called the \u0026#34;basic plan.\u0026#34; This was adapted across state as a watch house, a lockup and a jail for more than half a century.\u003c/p\u003e\n\u003cp\u003eAn example is the \u003ca href=\"https://collection.sl.nsw.gov.au/record/YRlZNNln/7v0yqVRlRXlGd\" target=\"_blank\"\u003eGoulburn Plains design\u003c/a\u003e, which incorporated a timber weatherboard courthouse straddling the stockade surrounding its log jail. Another version added a room for the jailer behind the kitchen\u0026#39;s fireplace. It was this design Mason had built at Okiato.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eHow and when history is told\u003c/h2\u003e\n\u003cp\u003eThe forgotten influence of the New South Wales Colonial Architect\u0026#39;s office on New Zealand\u0026#39;s earliest prison architecture surely relates in part to the building\u0026#39;s apparently rudimentary nature.\u003c/p\u003e\n\u003cp\u003eSimple log buildings fit with a pioneering, frontier myth of transience and impermanent architecture. This sits at odds with the sophisticated skills already evident in 1840s Aotearoa, including Māori expertise and the craftsmanship of British and US ship carpenters.\u003c/p\u003e\n\u003cp\u003eBut it may also be to do with how we tell the histories of our colonial architecture. Consistent with Paul Pascoe\u0026#39;s assertion that local architecture \u0026#34;derived from England,\u0026#34; our first jail buildings have perhaps been measured against English prison architecture and found inadequate.\u003c/p\u003e\n\u003cp\u003eBut the jail at Okiato was not a makeshift one-off—a deliberately designed structure that links the young colonies of New South Wales and New Zealand in ways that help us understand our early European history.\u003c/p\u003e\n\u003cp\u003eAlas, it no longer exists. After ten months, Hobson left Okiato and established a new capital at Tāmaki Makaurau-Auckland. References to the jail suggest it operated until about 1844.\u003c/p\u003e\n\u003cp\u003eThe Okiato \u003ca href=\"https://phys.org/tags/jail/\" rel=\"tag\"\u003ejail\u003c/a\u003e might not have loomed large in New Zealand\u0026#39;s architectural histories, but the story of its origin is nonetheless a useful one. It\u0026#39;s a healthy reminder that history has a complex relationship with \u0026#34;the truth,\u0026#34; so we need to constantly reexamine it.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/unlocking-the-past-how-nzs-first-jail-tells-a-complex-story-of-colonial-identity-244745\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/244745/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tUnlocking the past: How NZ\u0026#39;s first jail tells a complex story of colonial identity (2025, January 4)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 4 January 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-01-nz-complex-story-colonial-identity.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-04T18:50:01-05:00",
  "modifiedTime": null
}
