{
  "id": "5ca9e408-30df-4fb4-b3e9-8d9ec86f5037",
  "title": "23 October, 2024 – Episode 991 – How Much Toilet Water Would You Drink?",
  "link": "https://www.twis.org/23-october-2024-episode-991-how-much-toilet-water-would-you-drink/",
  "description": "What is in the This Week in Science Podcast? This Week: Interview W/Dr. Steven V. Rouse, Tasmanian Tigers, Ovulation, Toilet Water, Doulas, Global Warming, Polarizing People, Human Biased, The Next Jaws, And Much More! Become a Patron! Check out the full unedited episode of our science podcast on YouTube or Twitch. And, remember that you […] The post 23 October, 2024 – Episode 991 – How Much Toilet Water Would You Drink? appeared first on This Week in Science - The Kickass Science Podcast.",
  "author": "Rachel Salin",
  "published": "Fri, 25 Oct 2024 02:20:29 +0000",
  "source": "http://www.twis.org/feed/",
  "categories": [
    "animals",
    "artificial intelligence",
    "biology",
    "chemistry",
    "cognitive science",
    "ecology",
    "end of the world",
    "energy",
    "global warming",
    "mammals",
    "neuroscience",
    "podcast",
    "robots",
    "science",
    "Science Education",
    "technology",
    "z-Broadcasts",
    "Dr. Kiki",
    "Dr. Kiki Sanford",
    "Dr. Kirsten Sanford",
    "Interview",
    "Justin Jackson",
    "new media",
    "news",
    "Patreon",
    "radio",
    "science news",
    "science podcast",
    "science policy",
    "science radio",
    "STEM",
    "talk",
    "This Week in Science",
    "TWIS"
  ],
  "byline": "Rachel Salin",
  "length": 4676,
  "excerpt": "How much toilet water would you drink, the answer may surprise you! Listen to this episode of This Week in Science to find out.",
  "siteName": "This Week in Science - The Kickass Science Podcast",
  "favicon": "https://www.twis.org/wp-content/uploads/2014/05/cropped-itunes1400x1400-180x180.png",
  "text": "Podcast: Play in new window | Download (Duration: 2:02:31 — 131.1MB)Subscribe: RSS | More What is in the This Week in Science Podcast? This Week: Interview W/Dr. Steven V. Rouse, Tasmanian Tigers, Ovulation, Toilet Water, Doulas, Global Warming, Polarizing People, Human Biased, The Next Jaws, And Much More! Become a Patron! Check out the full unedited episode of our science podcast on YouTube or Twitch. And, remember that you can find TWIS in all the podcast directories. If you are looking for science podcasts on Spotify, we are there! Science podcasts on Google? We are there! Are you looking for science podcasts on iTunes or science podcasts on Apple? We are there, too! Just look for This Week in Science! Disclaimer, Disclaimer, Disclaimer!!! The following hour of programming contains science. If you are allergic to science, science has a remedy. If you think science is boring, science will reveal its wonders. If you don’t know what science is, science has an answer. If you are afraid of science, science will protect you. If you question science and are skeptical, science invites your curiosity. If science seems confusing, science can clarify. If you think science is too complicated, science can be super simplified. If science feeds your thirst for knowledge, fuels your imagination, and fills your brain with well-reasoned thinking, you’ve come to the right place. Because we have all of that and more here on This Week in Science. Some quick science news! Tasmanian Tiger Time! What has Colossal done now? Want to see ovulation in action? You can! IF YOU ARE INTERESTED IN A TWIS SHIRT OR MUG OR OTHER ITEM OF TWIS MERCHANDISE CLICK ON THE ZAZZLE LINK TO BROWSE OUR STORE HELP TWIS GROW! GET FRIENDS TO SUBSCRIBE TODAY! The Interview! We want to welcome our guest, Dr. Steven V. Rouse, to TWIS. You can find him on the Pepperdine Seaver College website. Dr. Steven V. Rouse is a professor of psychology, with an emphasis on personality and psychological assessment. He earned his bachelor’s degree in psychology and master’s degree in clinical/counseling psychology at Abilene Christian University before earning his PhD in personality research at the University of Minnesota. Professor Rouse has diverse research interests but is especially interested in personality characteristics that relate to a person’s religious beliefs and research on the statistical quality of personality tests. We can make jokes about drinking toilet water, but really with clean drinking water shortages around the world, water-recycling is a very serious issue. Dr. Kiki, Justin, and Dr. Rouse flush out all the nuances of recycling water you’ll want to listen to again and again! IF YOU ARE INTERESTED IN A TWIS SHIRT OR MUG OR OTHER ITEM OF TWIS MERCHANDISE CLICK ON THE ZAZZLE LINK TO BROWSE OUR STORE HELP TWIS GROW! GET FRIENDS TO SUBSCRIBE TODAY! Support us on Patreon! What Science News Does Justin Have? Doulas They are super important to maternity outcomes Global Warming Might bring more coffee DON’T FORGET TO GET FRIENDS TO SUBSCRIBE TODAY! Some Science stories with Kiki! Polarizing People Do simulated results mirror what we see in social media? Human Biased Can we all just agree to be biased against AI, and work together from here on out? The Next Jaws Will it be a Honey Badger Four-Legged robot? Support us on Patreon! DON’T FORGET TO GET FRIENDS TO SUBSCRIBE TODAY! This Week in Science Questions! Do you have questions that you want us to answer? Send us your questions (Like, how much toilet water would you drink??)! We will do our best to have answers! Remember, everyone, we need you to write in with your questions! Leave us a message on our Facebook page, email Dr. Kiki, or find us on Mastodon Social if you can! Support us on Patreon! Support is the secret to more science with TWIS! WANT TO HELP TWIS? LEAVE A POSITIVE REVIEW FOR TWIS ON YOUR FAVORITE PODCAST PLATFORM TODAY! YOU CAN EVEN DO IT FROM THE TOILET. Take a blast into the past… What were we discussing at this time last year? This time last year We discussed LIGO, Mummies, Language \u0026 AI, Policing, Pigs, Roosters, Birds Aren’t Real, Fuzzy Stems, Prehistoric Gender Roles, Zoomies, Memory Codes, And Much More! This week 10 years ago TWIS we discussed Stem Dark Matters, In The Light, The Fermi Signal, Olive Oil Update, Bendy Feathers, Skin Cells Brain Cells, Shrinking Goats, Latrines For Lemurs, Best. Experiment. Ever., Interview w/ Rob Manning From NASA JPL, And Much More! Take a blast into the past with TWIS! If You love TWIS, and all the science news we pronounce each week, please consider making a donation to the This Week in Science podcast. Support us on Patreon!",
  "image": "https://www.twis.org/wp-content/uploads/2024/10/991.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp\u003ePodcast: \u003ca href=\"https://traffic.libsyn.com/twis/TWIS_10_23_2024.mp3\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw(\u0026#39;https://www.twis.org/?powerpress_pinw=3960-podcast\u0026#39;);\" rel=\"nofollow\"\u003ePlay in new window\u003c/a\u003e | \u003ca href=\"https://traffic.libsyn.com/twis/TWIS_10_23_2024.mp3\" title=\"Download\" rel=\"nofollow\" download=\"TWIS_10_23_2024.mp3\"\u003eDownload\u003c/a\u003e (Duration: 2:02:31 — 131.1MB)\u003c/p\u003e\u003cp\u003eSubscribe: \u003ca href=\"https://www.twis.org/feed/podcast/\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\"\u003eRSS\u003c/a\u003e | \u003ca href=\"https://www.twis.org/subscribe-to-podcast/\" target=\"_blank\" title=\"More\" rel=\"nofollow\"\u003eMore\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.twis.org/wp-content/uploads/2013/09/orangesquare-twitterprofile-180x180.jpg\"\u003e\u003cimg decoding=\"async\" title=\"TWIS_podcast_logo\" src=\"https://www.twis.org/wp-content/uploads/2013/09/orangesquare-twitterprofile-180x180.jpg\" alt=\"This Week in Science podcast TWIS logo orange square\" width=\"144\" height=\"144\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003ch2\u003eWhat is in the This Week in Science Podcast?\u003c/h2\u003e\n\u003cp\u003eThis Week: \u003cspan data-sheets-value=\"{\u0026#34;1\u0026#34;:2,\u0026#34;2\u0026#34;:\u0026#34;Engineered Yeast\u0026#34;}\" data-sheets-userformat=\"{\u0026#34;2\u0026#34;:4993,\u0026#34;3\u0026#34;:{\u0026#34;1\u0026#34;:0},\u0026#34;10\u0026#34;:2,\u0026#34;11\u0026#34;:4,\u0026#34;12\u0026#34;:0,\u0026#34;15\u0026#34;:\u0026#34;Arial\u0026#34;}\"\u003eInterview W/Dr. Steven V. Rouse, Tasmanian Tigers, Ovulation, Toilet Water, Doulas, Global Warming, Polarizing People, Human Biased, The Next Jaws\u003c/span\u003e, And Much More!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.patreon.com/bePatron?u=64889\" data-patreon-widget-type=\"become-patron-button\"\u003eBecome a Patron!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eCheck out the full unedited episode of our science podcast on \u003ca href=\"https://www.youtube.com/watch?v=1ohHLQiUYIo\"\u003eYouTube\u003c/a\u003e or \u003ca href=\"https://m.twitch.tv/videos/2283785296\"\u003eTwitch\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAnd, remember that you can find TWIS in all the podcast directories. If you are looking for science podcasts on \u003ca href=\"https://open.spotify.com/show/6gTYx1Cjd6xSeGhIZOYl9k\"\u003eSpotify\u003c/a\u003e, we are there! Science podcasts on \u003ca href=\"https://podcasts.google.com/feed/aHR0cHM6Ly93d3cudHdpcy5vcmcvZmVlZC8\"\u003eGoogle\u003c/a\u003e? We are there! Are you looking for science podcasts on iTunes or science podcasts on \u003ca href=\"https://podcasts.apple.com/us/podcast/this-week-in-science-the-kickass-science-podcast/id73330501\"\u003eApple\u003c/a\u003e? We are there, too! Just look for This Week in Science!\u003c/p\u003e\n\u003ch2\u003eDisclaimer, Disclaimer, Disclaimer!!!\u003c/h2\u003e\n\u003cp\u003eThe following hour of programming contains science.\u003c/p\u003e\n\u003cp\u003eIf you are allergic to science, science has a remedy.\u003c/p\u003e\n\u003cp\u003eIf you think science is boring, science will reveal its wonders.\u003c/p\u003e\n\u003cp\u003eIf you don’t know what science is, science has an answer.\u003c/p\u003e\n\u003cp\u003eIf you are afraid of science, science will protect you.\u003c/p\u003e\n\u003cp\u003eIf you question science and are skeptical, science invites your curiosity.\u003c/p\u003e\n\u003cp\u003eIf science seems confusing, science can clarify.\u003c/p\u003e\n\u003cp\u003eIf you think science is too complicated, science can be super simplified.\u003c/p\u003e\n\u003cp\u003eIf science feeds your thirst for knowledge, fuels your imagination, and fills your brain with well-reasoned thinking, you’ve come to the right place.\u003c/p\u003e\n\u003cp\u003eBecause we have all of that and more here on This Week in Science.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003e\u003cem\u003eSome quick science news!\u003c/em\u003e\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://arstechnica.com/science/2024/10/effort-to-bring-back-the-tasmanian-tiger-builds-steam/\"\u003e\u003cspan data-sheets-root=\"1\"\u003eTasmanian Tiger Time!\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eWhat has Colossal done now?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://phys.org/news/2024-10-imaging-ovulation-action-reveals-distinct.html\"\u003e\u003cspan data-sheets-root=\"1\"\u003eWant to see ovulation in action?\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eYou can!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIF YOU ARE INTERESTED IN A TWIS SHIRT OR MUG OR OTHER ITEM OF TWIS MERCHANDISE CLICK ON THE \u003ca href=\"https://www.zazzle.com/store/thisweekinscience\"\u003eZAZZLE LINK TO BROWSE OUR STORE \u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eHELP TWIS GROW! GET FRIENDS TO SUBSCRIBE TODAY!\u003c/p\u003e\n\u003ch2\u003e\u003cb\u003eThe Interview!\u003c/b\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cspan\u003eWe want to welcome our guest, Dr. Steven V. Rouse, to TWIS. \u003c/span\u003eYou can find him on the \u003ca href=\"https://seaver.pepperdine.edu/academics/faculty/steve-rouse/\"\u003ePepperdine Seaver College\u003c/a\u003e website.\u003c/p\u003e\n\u003cp\u003eDr. Steven V. Rouse is a professor of psychology, with an emphasis on personality and psychological assessment. He earned his bachelor’s degree in psychology and master’s degree in clinical/counseling psychology at Abilene Christian University before earning his PhD in personality research at the University of Minnesota. Professor Rouse has diverse research interests but is especially interested in personality characteristics that relate to a person’s religious beliefs and research on the statistical quality of personality tests.\u003c/p\u003e\n\u003cp\u003e\u003cspan data-sheets-root=\"1\"\u003eWe can make jokes about drinking toilet water, but really with clean drinking water shortages around the world, water-recycling is a very serious issue. \u003c/span\u003e\u003cspan\u003eDr. Kiki, Justin, and Dr. Rouse flush out all the nuances of recycling water you’ll want to listen to again and again!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eIF YOU ARE INTERESTED IN A TWIS SHIRT OR MUG OR OTHER ITEM OF TWIS MERCHANDISE CLICK ON THE \u003ca href=\"https://www.zazzle.com/store/thisweekinscience\"\u003eZAZZLE LINK TO BROWSE OUR STORE\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eHELP TWIS GROW! GET FRIENDS TO SUBSCRIBE TODAY!\u003c/p\u003e\n\u003ch3\u003eSupport us on \u003ca href=\"http://www.patreon.com/thisweekinscience\"\u003ePatreon!\u003c/a\u003e\u003c/h3\u003e\n\u003ch2\u003e\u003cstrong\u003e\u003cem\u003eWhat Science News Does Justin Have?\u003c/em\u003e\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://www.sciencedirect.com/science/article/pii/S2589537022002619?ssrnid=4023204\u0026amp;dgcid=SSRN_redirect_SD#coi0001\"\u003e\u003cspan data-sheets-root=\"1\"\u003eDoulas\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eThey are super important to maternity outcomes\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310945%20\"\u003e\u003cspan data-sheets-root=\"1\"\u003eGlobal Warming\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eMight bring more coffee\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eDON’T FORGET TO GET FRIENDS TO \u003ca href=\"https://www.twis.org/subscribe/\"\u003eSUBSCRIBE\u003c/a\u003e TODAY!\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003e\u003cem\u003eSome Science stories with Kiki!\u003c/em\u003e\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://phys.org/news/2024-10-users-social-media-networks-polarization.html\"\u003e\u003cspan data-sheets-root=\"1\"\u003ePolarizing People\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eDo simulated results mirror what we see in social media?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://neurosciencenews.com/ai-writing-psychological-bias-27904/\"\u003e\u003cspan data-sheets-root=\"1\"\u003eHuman Biased\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eCan we all just agree to be biased against AI, and work together from here on out?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://techcrunch.com/2024/10/15/watch-a-robot-dog-run-under-water/\"\u003e\u003cspan data-sheets-root=\"1\"\u003eThe Next Jaws\u003c/span\u003e\u003c/a\u003e\u003cbr/\u003e\n\u003cspan data-sheets-root=\"1\"\u003eWill it be a Honey Badger Four-Legged robot?\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003eSupport us on \u003ca href=\"http://www.patreon.com/thisweekinscience\"\u003ePatreon!\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eDON’T FORGET TO GET FRIENDS TO \u003ca href=\"https://www.twis.org/subscribe/\"\u003eSUBSCRIBE\u003c/a\u003e TODAY!\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003e\u003cem\u003e\u003cspan data-sheets-value=\"{\u0026#34;1\u0026#34;:2,\u0026#34;2\u0026#34;:\u0026#34;This Week in Science Questions!\u0026#34;}\" data-sheets-userformat=\"{\u0026#34;2\u0026#34;:4480,\u0026#34;10\u0026#34;:2,\u0026#34;11\u0026#34;:4,\u0026#34;15\u0026#34;:\u0026#34;Arial\u0026#34;}\"\u003eThis Week in Science Questions!\u003c/span\u003e\u003c/em\u003e\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cspan data-sheets-value=\"{\u0026#34;1\u0026#34;:2,\u0026#34;2\u0026#34;:\u0026#34;Let\u0026#39;s start a new segment for the show! Do you have questions that you want us to answer? Send us your questions! We will do our best to have answers!\\n \\nRemember, everyone, we need you to write in with your questions!\\n\\nLeave us a message on our Facebook page - Facebook.com/ThisWeekinScience\\n\\nOR email Dr. Kiki at kirsten@thisweekinscience.com (until she gets her email fixed)\\n\\n\u0026#34;}\" data-sheets-userformat=\"{\u0026#34;2\u0026#34;:4480,\u0026#34;10\u0026#34;:2,\u0026#34;11\u0026#34;:4,\u0026#34;15\u0026#34;:\u0026#34;Arial\u0026#34;}\"\u003eDo you have questions that you want us to answer? Send us your questions (Like, how much toilet water would you drink??)! We will do our best to have answers!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eRemember, everyone, we need you to write in with your questions!\u003c/p\u003e\n\u003cp\u003eLeave us a message on \u003ca href=\"http://Facebook.com/ThisWeekinScience\"\u003eour Facebook page\u003c/a\u003e, \u003ca href=\"https://www.twis.org/23-october-2024-episode-991-how-much-toilet-water-would-you-drink/kirsten@thisweekinscience.com\"\u003eemail Dr. Kiki,\u003c/a\u003e or find us on \u003ca href=\"https://universeodon.com/@TWIScience\"\u003eMastodon Social\u003c/a\u003e if you can!\u003c/p\u003e\n\u003ch3\u003eSupport us on \u003ca href=\"http://www.patreon.com/thisweekinscience\"\u003ePatreon!\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eSupport is the secret to more science with TWIS!\u003c/p\u003e\n\u003cp\u003eWANT TO HELP TWIS? LEAVE A POSITIVE REVIEW FOR TWIS ON YOUR FAVORITE PODCAST PLATFORM TODAY! YOU CAN EVEN DO IT FROM THE TOILET.\u003c/p\u003e\n\u003ch3\u003eTake a blast into the past…\u003c/h3\u003e\n\u003cp\u003eWhat were we discussing at this time last year? This time \u003ca href=\"https://www.twis.org/25-october-2023-episode-949-do-roosters-even-know-themselves/\"\u003elast year \u003c/a\u003eWe discussed \u003cspan data-sheets-value=\"{\u0026#34;1\u0026#34;:2,\u0026#34;2\u0026#34;:\u0026#34;Mapping The Universe\u0026#34;}\" data-sheets-userformat=\"{\u0026#34;2\u0026#34;:4993,\u0026#34;3\u0026#34;:{\u0026#34;1\u0026#34;:0},\u0026#34;10\u0026#34;:2,\u0026#34;11\u0026#34;:4,\u0026#34;12\u0026#34;:0,\u0026#34;15\u0026#34;:\u0026#34;Arial\u0026#34;}\"\u003eLIGO, Mummies, Language \u0026amp; AI, Policing, Pigs, Roosters, Birds Aren’t Real, Fuzzy Stems, Prehistoric Gender Roles, Zoomies, Memory Codes\u003c/span\u003e, And Much More!\u003c/p\u003e\n\u003cp\u003eThis week \u003ca href=\"https://www.twis.org/23-october-2014-episode-486-this-week-in-science/\"\u003e10 years ago\u003c/a\u003e TWIS we discussed Stem Dark Matters, In The Light, The Fermi Signal, Olive Oil Update, Bendy Feathers, Skin Cells Brain Cells, Shrinking Goats, Latrines For Lemurs, Best. Experiment. Ever., Interview w/ Rob Manning From NASA JPL, And Much More! Take a blast into the past with TWIS!\u003c/p\u003e\n\u003ch3\u003e\u003cstrong\u003eIf You love TWIS, and all the science news we pronounce each week, please consider making a donation to the This Week in Science podcast. \u003c/strong\u003e\u003c/h3\u003e\n\u003ch3\u003eSupport us on \u003ca href=\"http://www.patreon.com/thisweekinscience\"\u003ePatreon!\u003c/a\u003e\u003c/h3\u003e\n  \n        \t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-25T02:20:29Z",
  "modifiedTime": "2024-10-25T02:20:31Z"
}
