{
  "id": "5d5927e7-915e-4260-abb5-e04c8065c526",
  "title": "Why Is ADHD On The Rise",
  "link": "https://sciencebasedmedicine.org/why-is-adhd-on-the-rise/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=why-is-adhd-on-the-rise",
  "description": "Attention-deficit/hyperactivity disorder (ADHD) is one of the most commonly diagnosed neurodevelopment disorders and seems to be on the rise, in both children and adults. The diagnosis in children requires having various symptoms of attention deficit or hyperactivity which is functionally impairing with onset by age 12. Recognition of the disorder actually goes back farther than you might think – the observation that […] The post Why Is ADHD On The Rise first appeared on Science-Based Medicine.",
  "author": "Steven Novella",
  "published": "Wed, 18 Sep 2024 12:22:15 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Neuroscience/Mental Health"
  ],
  "byline": "Steven Novella",
  "length": 10608,
  "excerpt": "Attention-deficit/hyperactivity disorder (ADHD) is one of the most commonly diagnosed neurodevelopment disorders and seems to be on the rise, in both children and adults. The diagnosis in children re",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Attention-deficit/hyperactivity disorder (ADHD) is one of the most commonly diagnosed neurodevelopment disorders and seems to be on the rise, in both children and adults. The diagnosis in children requires having various symptoms of attention deficit or hyperactivity which is functionally impairing with onset by age 12. Recognition of the disorder actually goes back farther than you might think – the observation that some children are highly distractible goes back to the late 19th century. The concept was first presented publicly in 1902 by George Frederic Still, who in a lecture discussed an “abnormal defect of moral control in children.” ADHD first appeared as a formal diagnosis in the DSM in 1968. Since then there has been a steady increase in the incidence and prevalence of ADHD. A 2023 review in JAMA notes: “An analysis of the National Health Interview Survey (NHIS) reported that the prevalence of ADHD among children increased from 6.1% in 1997 to 1998 to 10.2% in 2015 to 2016. Similarly, the National Survey of Children’s Health showed a 42.0% increase from 2003 to 2011.” That period, from the 1990s to the 2010s saw perhaps the biggest increase, but the number of diagnoses has crept up further since then. The latest survey, published in May 2024, found: “Approximately 1 in 9 U.S. children have ever received an ADHD diagnosis (11.4%, 7.1 million children) and 10.5% (6.5 million) had current ADHD. Among children with current ADHD, 58.1% had moderate or severe ADHD, 77.9% had at least one co-occurring disorder, approximately half of children with current ADHD (53.6%) received ADHD medication, and 44.4% had received behavioral treatment for ADHD in the past year; nearly one third (30.1%) did not receive any ADHD-specific treatment.” ADHD in adults has seen a similar increase, although somewhat trailing the rise in children. The most recent estimates also put the figure at about 10%. This makes sense, since it is now understood that ADHD is a lifelong condition. Children do not outgrow it – they become adults with ADHD. Of course, this figure depends highly on how the diagnosis is made, and whether you are counting those diagnosed with ADHD or estimates on how many adults may have it, whether formally diagnosed or not. The low-end estimate is closer to 4-5%. The first question that always arises when a diagnosis is on the increase relates to whether the true incidence is increasing, or is the apparent increase an artifact of how the diagnosis is made. We have had this discussion many times with the autism diagnosis. The two main factors that might result in an artifactual increase are, an expansion of the diagnostic criteria, or increased surveillance – either we have broadened the diagnosis, or we are looking for it more. There is also the possibility of diagnostic substitution – other diagnoses are now shifting to the one apparently increasing. All of these factors appear relevant to ADHD. We have broadened the diagnostic category to include more symptoms. There is greater surveillance, with increased public awareness, decreased stigma, and greater incentive due to effective treatments. This does not rule out that there is an actual increase hiding in the data as well, but there is no solid evidence that this is the case. Increased awareness and expanded criteria likely explain the increased numbers. But there are still some lingering questions, which relate to how the diagnosis is made. ADHD is a clinical diagnosis, which means that it is based on the manifestation of symptoms and observations of behavior. Right now there is no laboratory test for ADHD. What this means is that we are not looking directly at brain function or anatomy to make the diagnosis. This does not mean there are no neuroanatomical correlates – there are. Functional imaging like fMRI scans do show differences in the brains of people with ADHD vs healthy control. They are simply not specific enough to use as a diagnosis. What this means is that there is an underlying brain condition that then manifests with symptoms and behavior. It’s possible, therefore, that even if the underlying brain condition is static in incidence, manifestations have been increasing because of environmental or societal factors. Some experts hypothesize, for example, that social media and other factors have conditioned children for immediate satisfaction, decreased boredom tolerance, and constant stimulation. Manifestation is also situation dependent. People with ADHD may do just find in many settings, while finding other setting extremely challenging. Tasks that require prolonged focused attention and inhibition of impulses, like school, tend to manifest ADHD. Increasing diagnosis can therefore result from increasing demands on attention and control. The other aspect of the diagnosis that is tricky is that ADHD (again, like autism) is part of a spectrum. ADHD is largely understood now as a disorder of executive function, which is essentially our highest level neurological function for strategic planning and control. This is a higher, frontal lobe, largely inhibitory control. Executive function exists on a continuum without a sharp demarcation line between healthy and ADHD. Therefore, where and how we draw the line with affect the number of diagnoses. This is a challenge for psychiatry in general, not just for ADHD. It is easy to be dismissive by saying – well, all people find executive control challenging at times. All children are impulsive and hyperactive. Are we just “pathologizing” normal behavior? At one end, this is a healthy discussion about exactly where we should draw the line and consider challenges of executive function a “disorder” requiring intervention. This includes discussion if whether or not ADHD is being under or over diagnosed (which also relates to whether or not strict diagnostic criteria are being followed). At the other end of the spectrum, however, this kind of criticism leads to mental health denial, the notion that ADHD does not even exist as a legitimate diagnosis. Manifestations of ADHD are then spun as normal child behavior, or the result of bad parenting, bad schooling, or whatever your preferred societal scapegoat is. It must be social media and all those electronic devices, right? The fact is, however, some people objectively have decreased executive function that we can see in their brains using functional imaging. ADHD is also objectively a disorder, meaning that it is not just a set of symptoms and behaviors, those behaviors lead to demonstrable harm. Further, effective interventions reduce the harm and negative outcomes that result from having executive function at the low end of the Bell curve. The good news is that ADHD denial has been on the wane. The stigma attached to the diagnosis has also been decreasing, and the benefits of effective treatment are increasingly apparent. We still do need to consider the impact of societal factors, like screen time and social media, but that should not be used to either shame or deny those with a real neurological disorder. Founder and currently Executive Editor of Science-Based Medicine Steven Novella, MD is an academic clinical neurologist at the Yale University School of Medicine. He is also the host and producer of the popular weekly science podcast, The Skeptics’ Guide to the Universe, and the author of the NeuroLogicaBlog, a daily blog that covers news and issues in neuroscience, but also general science, scientific skepticism, philosophy of science, critical thinking, and the intersection of science with the media and society. Dr. Novella also has produced two courses with The Great Courses, and published a book on critical thinking - also called The Skeptics Guide to the Universe. View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2024/09/ADHD.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cp\u003eAttention-deficit/hyperactivity disorder (ADHD) is one of the most commonly diagnosed neurodevelopment disorders and seems to be on the rise, in both children and adults. The diagnosis in children requires having various symptoms of attention deficit or hyperactivity which is functionally impairing with onset by age 12. \u003c/p\u003e\n\n\n\n\u003cp\u003eRecognition of the disorder actually goes back farther than you might think – the observation that some children are highly distractible goes back to the late 19th century. The concept was first presented publicly in 1902 by \u003ca href=\"https://embryo.asu.edu/pages/george-frederic-still-1868-1941\" title=\"\"\u003eGeorge Frederic Still\u003c/a\u003e, who in a lecture discussed an “abnormal defect of moral control in children.” ADHD first appeared as a formal diagnosis \u003ca href=\"https://www.pbs.org/wgbh/pages/frontline/shows/medicating/adhd/diagnostic.html\" title=\"\"\u003ein the DSM in 1968\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eSince then there has been a steady increase in the incidence and prevalence of ADHD. A 2023 review in \u003cabbr title=\"Journal of the American Medical Association\"\u003eJAMA\u003c/abbr\u003e notes:\u003c/p\u003e\n\n\n\n\u003cp\u003e“An analysis of the National Health Interview Survey (NHIS) reported that the prevalence of ADHD among children increased from 6.1% in 1997 to 1998 to 10.2% in 2015 to 2016. Similarly, the National Survey of Children’s Health showed a 42.0% increase from 2003 to 2011.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThat period, from the 1990s to the 2010s saw perhaps the biggest increase, but the number of diagnoses has crept up further since then. The latest survey, published in May 2024, found:\u003c/p\u003e\n\n\n\n\u003cp\u003e“Approximately 1 in 9 U.S. children have ever received an ADHD diagnosis (11.4%, 7.1 million children) and 10.5% (6.5 million) had current ADHD. Among children with current ADHD, 58.1% had moderate or severe ADHD, 77.9% had at least one co-occurring disorder, approximately half of children with current ADHD (53.6%) received ADHD medication, and 44.4% had received behavioral treatment for ADHD in the past year; nearly one third (30.1%) did not receive any ADHD-specific treatment.”\u003c/p\u003e\n\n\n\n\u003cp\u003eADHD in adults has seen a similar increase, although somewhat trailing the rise in children. The most recent estimates also put the figure at about 10%. This makes sense, since it is now understood that ADHD is a lifelong condition. Children do not outgrow it – they become adults with ADHD. \u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, this figure depends highly on how the diagnosis is made, and whether you are counting those diagnosed with ADHD or estimates on how many adults may have it, whether formally diagnosed or not. The low-end estimate is \u003ca href=\"https://www.webmd.com/add-adhd/adult-adhd-facts-statistics\" title=\"\"\u003ecloser to 4-5%\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe first question that always arises when a diagnosis is on the increase relates to whether the true incidence is increasing, or is the apparent increase an artifact of how the diagnosis is made. We have had this discussion many times \u003ca href=\"https://sciencebasedmedicine.org/autism-prevalence-unchanged-in-20-years/\" title=\"\"\u003ewith the autism diagnosis\u003c/a\u003e. The two main factors that might result in an artifactual increase are, an expansion of the diagnostic criteria, or increased surveillance – either we have broadened the diagnosis, or we are looking for it more. There is also the possibility of diagnostic substitution – other diagnoses are now shifting to the one apparently increasing. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9616454/\" title=\"\"\u003eAll of these factors appear relevant\u003c/a\u003e to ADHD. We have broadened the diagnostic category to include more symptoms. There is greater surveillance, with increased public awareness, decreased stigma, and greater incentive due to effective treatments. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis does not rule out that there is an actual increase hiding in the data as well, but there is no solid evidence that this is the case. Increased awareness and expanded criteria likely explain the increased numbers. But there are still some lingering questions, which relate to how the diagnosis is made.\u003c/p\u003e\n\n\n\n\u003cp\u003eADHD is a clinical diagnosis, which means that it is based on the manifestation of symptoms and observations of behavior. Right now there is no laboratory test for ADHD. What this means is that we are not looking directly at brain function or anatomy to make the diagnosis. This does not mean there are no neuroanatomical correlates – there are. Functional imaging like \u003ca href=\"https://ajronline.org/doi/full/10.2214/AJR.21.26316\" title=\"\"\u003efMRI scans do show differences\u003c/a\u003e in the brains of people with ADHD vs healthy control. They are simply not specific enough to use as a diagnosis. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhat this means is that there is an underlying brain condition that then manifests with symptoms and behavior. It’s possible, therefore, that even if the underlying brain condition is static in incidence, manifestations have been increasing because of environmental or societal factors. Some experts hypothesize, for example, that social media and other factors have conditioned children for immediate satisfaction, decreased boredom tolerance, and constant stimulation. \u003c/p\u003e\n\n\n\n\u003cp\u003eManifestation is also situation dependent. People with ADHD may do just find in many settings, while finding other setting extremely challenging. Tasks that require prolonged focused attention and inhibition of impulses, like school, tend to manifest ADHD. Increasing diagnosis can therefore result from increasing demands on attention and control. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe other aspect of the diagnosis that is tricky is that ADHD (again, like autism) is part of a spectrum. ADHD is largely understood now as a disorder of executive function, which is essentially our highest level neurological function for strategic planning and control. This is a higher, frontal lobe, largely inhibitory control. Executive function exists on a continuum without a sharp demarcation line between healthy and ADHD. Therefore, where and how we draw the line with affect the number of diagnoses. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis is a challenge for psychiatry in general, not just for ADHD. It is easy to be dismissive by saying – well, all people find executive control challenging at times. All children are impulsive and hyperactive. Are we just “pathologizing” normal behavior? At one end, this is a healthy discussion about exactly where we should draw the line and consider challenges of executive function a “disorder” requiring intervention. This includes discussion if whether or not ADHD is being under or over diagnosed (which also relates to whether or not strict diagnostic criteria are being followed). \u003c/p\u003e\n\n\n\n\u003cp\u003eAt the other end of the spectrum, however, this kind of criticism leads to mental health denial, the notion that ADHD does not even exist as a legitimate diagnosis. Manifestations of ADHD are then spun as normal child behavior, or the result of bad parenting, bad schooling, or whatever your preferred societal scapegoat is. It must be social media and all those electronic devices, right? \u003c/p\u003e\n\n\n\n\u003cp\u003eThe fact is, however, some people objectively have decreased executive function that we can see in their brains using functional imaging. ADHD is also objectively a disorder, meaning that it is not just a set of symptoms and behaviors, those behaviors lead to demonstrable harm. Further, effective interventions reduce the harm and negative outcomes that result from having executive function at the low end of the Bell curve. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe good news is that ADHD denial has been on the wane. The stigma attached to the diagnosis has also been decreasing, and the benefits of effective treatment are increasingly apparent. We still do need to consider the impact of societal factors, like screen time and social media, but that should not be used to either shame or deny those with a real neurological disorder. \u003c/p\u003e\n\n\n\n\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \u003cdiv\u003e\n                                                                    \u003cp\u003e\u003cimg alt=\"Steven Novella\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/06/stevennovella-transformed-800x800-1.jpeg\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/06/stevennovella-transformed-800x800-1.jpeg\" height=\"80\" width=\"80\"/\u003e                                                                                                                                                                                                            \u003c/p\u003e\n                                                                                                                                    \u003c/div\u003e\n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Founder and currently Executive Editor of Science-Based Medicine \u003cstrong\u003eSteven Novella, MD\u003c/strong\u003e is an academic clinical neurologist at the Yale University School of Medicine. He is also the host and producer of the popular weekly science podcast, \u003ca href=\"http://www.theskepticsguide.org\"\u003eThe Skeptics’ Guide to the Universe\u003c/a\u003e, and the author of the \u003ca href=\"http://www.theness.com/neurologicablog\"\u003eNeuroLogicaBlog\u003c/a\u003e, a daily blog that covers news and issues in neuroscience, but also general science, scientific skepticism, philosophy of science, critical thinking, and the intersection of science with the media and society. Dr. Novella also has produced two courses with \u003ca\u003eThe Great Courses\u003c/a\u003e, and published a book on critical thinking - also called \u003ca\u003eThe Skeptics Guide to the Universe\u003c/a\u003e.                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/steven-novella/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Website\" href=\"http://www.theness.com/neurologicablog/index.php?page_id=2\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#cab9beafbcafa4a4a5bcafa6a6ab8aa9a5a7a9abb9bee4a4afbe\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-09-18T08:22:15-04:00",
  "modifiedTime": "2024-09-18T12:23:50Z"
}
