{
  "id": "6a979c0d-d20d-49f7-9150-73a62d3917c3",
  "title": "Life, death and mowing: Study reveals Britain's poetic obsession with the humble lawnmower",
  "link": "https://phys.org/news/2025-05-life-death-reveals-britain-poetic.html",
  "description": "Over the last half-century, British poets including Philip Larkin and Andrew Motion have driven a \"lawnmower poetry microgenre,\" using the machine to explore childhood, masculinity, violence, addiction, mortality and much more, new research shows.",
  "author": "",
  "published": "Fri, 16 May 2025 19:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences"
  ],
  "byline": "University of Cambridge",
  "length": 7605,
  "excerpt": "Over the last half-century, British poets including Philip Larkin and Andrew Motion have driven a \"lawnmower poetry microgenre,\" using the machine to explore childhood, masculinity, violence, addiction, mortality and much more, new research shows.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Portrait of the seventeenth-century poet Andrew Marvell who used mowing—with a scythe—to comment on the violence of the English Civil War. Painting attributed to Godfrey Kneller (1646–1723). Credit: Trinity College, University of Cambridge Over the last half-century, British poets including Philip Larkin and Andrew Motion have driven a \"lawnmower poetry microgenre,\" using the machine to explore childhood, masculinity, violence, addiction, mortality and much more, new research shows. The study, published in Critical Quarterly, argues that the tradition goes back to the 17th-century poet Andrew Marvell, who used mowing—with a scythe—to comment on the violence of the English Civil War. \"Lawnmower poetry had its highpoint in the late 20th century but now would be a good moment for a revival,\" says the study's author, Francesca Gardner, from Cambridge University's English Faculty and St Catharine's College. \"It might seem random to write poetry about mowing, but it's a great vehicle for exploring our relationship with nature and with each other. Andrew Marvell wrote about mowing with scythes after the English Civil War and modern poets continue to use lawnmowers to think about their own ups and downs. \"In a time of eco-crisis, conflict and societal problems, perhaps another poet will be inspired to write one soon. They might reflect the growing anti-lawn movement or something else entirely.\" In 1651, Andrew Marvell wrote a poem in which a mower accidentally kills a bird crouched in the grass. In \"Upon Appleton House,\" he wrote that the \"Edge\" of the scythe was left \"all bloody from its Breast.\" Gardner argues that the poem makes us think about \"the Flesh untimely mow'd\" as a result of powerful undeviating cycles, including the seasons and warfare, which dominate our lives and determine our actions. In 1979, another poet from Hull, Philip Larkin, described killing a hedgehog with his own motorized machine. In \"The Mower,\" Larkin wrote that his mower had \"'stalled, twice'\" and that he found \"A hedgehog jammed up against the blades, / Killed.\" A mower with a scythe by Francis Place (1647 to 1728), a study for the Pilkington Crest (undated). Yale Center for British Art, Paul Mellon Collection. Credit: Yale Center for British Art, Paul Mellon Collection Inspired by \"Upon Appleton House,\" Larkin also admired Marvell's four mower poems: \"The Mowers Song,\" \"Damon the Mower,\" \"The Mower Against Gardens,\" and \"The Mower to the Glow-Worms,\" describing them as \"charming and exquisite in the pastoral tradition,\" and Gardner points out numerous similarities between the two poets. \"Larkin had a deep awareness of pastoral and georgic poetry and this makes his poem more unsettling. While he felt terrible about killing the hedgehog, which really happened, his poem is disturbing because it presents an uneasy affinity between the natural and the mechanical.\" \"Every time Larkin cuts the grass, it grows back so he's forced to use a machine that completes the job efficiently and repeatedly. By mirroring nature's cruel, relentless forces, mowers like Larkin commit their own acts of cruelty and violence.\" And yet, Gardner argues, it is often through their violence that the human mowers in these poems discover a capacity to be careful, sensitive and empathetic. Larkin's is one of the best-known lawnmower poems from the UK and U.S. discussed by Gardner, but not the only one to tackle traumatic events. In 2007, Andrew Motion based a moving elegy for his father on happy memories of him mowing the lawn. By contrast, Michael Laskey's 1999 \"The Lawnmower\" uses the machine to describe fatherly \"despotism and neglect,\" Gardner argues. \"Mowing a lawn is often viewed as a victory over nature but these poems reflect an increasing sense that this is a pyrrhic or ignoble victory,\" Gardner says. \"The father in Michael Laskey's poem is so intent on mowing straight lines that he misses out on the joyful messiness of life with his children.\" Study author Francesca Gardner on the lawn of her Cambridge College, St Catharine's College, University of Cambridge. Credit: University of Cambridge Laskey's poem ends: \"We keep back, / do as were told, don't touch. / It must be overgrown now, the grave.\" Gardner says, \"British poets are very interested in the lawn as a nostalgic space, so lawnmowers are often associated with childhood memories, especially of fathers working. The lawn is a safe domestic, often suburban, space in which unexpected violence can occur, as when Larkin kills a hedgehog.\" Gardner's favorite lawnmower poem is Mark Waldron's 2017 \"I wish I loved lawnmowers\" which explores alienation, obsession and drug addiction. The speaker tells us that, if he loved lawnmowers, he would take a trip to the British Lawnmower Museum in Southport. But he doesn't and the poem ends: \"Now crack cocaine—that I loved.\" Most of the poems Gardner studied were written by recognized poets but she also found examples written by lawnmower enthusiasts. In 2013, Grassbox, the Old Lawnmower Club's magazine, published Tony Hopwood's parody of the hymn \"Morning Has Broken\" which laments: \"Mower has broken, / Gardeners in mourning. / Missus has spoken, / Had the last word.\" \"Lawnmowers draw people to poetry as much as poetry draws people to lawnmowers,\" Gardner says. Gardner points out that to-date most British lawnmower poems have been written by men but has found examples of women poking fun at mower-obsessed men. In 2002, Grassbox published \"A Lawnmower Widows Lament,\" a poem by Peggy Miller, which opens: \"I once was loved and cherished by a man who was quite handsome / But now I'm second fiddle to a Dennis or Ransomes.\" Francesca Gardner is an expert on early modern pastoral, georgic, and 'nature' writing. She explains that British and American lawnmower poetry is rooted in two forms of ancient nature poetry. The pastoral form presents an idyllic form of nature in which shepherds stroll through fields and the land yields things up to them. By contrast, georgic poetry involves people having to work hard and use tools because nature isn't so generous. Gardner points out that Andrew Marvell's 'Upon Appleton House' is an unusual mixture of both pastoral and georgic. \"Poets inspired by Marvell appreciate that clash between idyllic nature and what it takes to maintain the lawn as an ideal space, the georgic conception of work,\" Gardner says. The final lines of Larkin's poem were widely quoted during the COVID-19 pandemic: \"we should be kind / While there is still time.\" \"That remains a useful lesson whether we're mowing or not,\" Gardner says. More information: Francesca Gardner, Lawnmower Poetry and the Poetry of Lawnmowers, Critical Quarterly (2025).",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/life-death-and-mowing-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1216188\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/life-death-and-mowing-1.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-1.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing-1.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-1.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing-1.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-1.jpg\" width=\"800\" height=\"530\" alt=\"Life, death and mowing – study reveals Britain\u0026#39;s poetic obsession with the humble lawnmower\" title=\"Portrait of the seventeenth-century poet Andrew Marvell who used mowing—with a scythe—to comment on the violence of the English Civil War. Painting attributed to Godfrey Kneller (1646–1723). Credit: Trinity College, University of Cambridge\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003ePortrait of the seventeenth-century poet Andrew Marvell who used mowing—with a scythe—to comment on the violence of the English Civil War. Painting attributed to Godfrey Kneller (1646–1723). Credit: Trinity College, University of Cambridge\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eOver the last half-century, British poets including Philip Larkin and Andrew Motion have driven a \u0026#34;lawnmower poetry microgenre,\u0026#34; using the machine to explore childhood, masculinity, violence, addiction, mortality and much more, new research shows.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThe study, published in \u003ci\u003eCritical Quarterly\u003c/i\u003e, argues that the tradition goes back to the 17th-century poet Andrew Marvell, who used mowing—with a scythe—to comment on the violence of the English Civil War.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Lawnmower poetry had its highpoint in the late 20th century but now would be a good moment for a revival,\u0026#34; says the study\u0026#39;s author, Francesca Gardner, from Cambridge University\u0026#39;s English Faculty and St Catharine\u0026#39;s College.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It might seem random to write poetry about mowing, but it\u0026#39;s a great vehicle for exploring our relationship with nature and with each other. Andrew Marvell wrote about mowing with scythes after the English Civil War and modern poets continue to use lawnmowers to think about their own ups and downs.\u003c/p\u003e\n\u003cp\u003e\u0026#34;In a time of eco-crisis, conflict and societal problems, perhaps another poet will be inspired to write one soon. They might reflect the growing anti-lawn movement or something else entirely.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn 1651, Andrew Marvell wrote a \u003ca href=\"https://phys.org/tags/poem/\" rel=\"tag\"\u003epoem\u003c/a\u003e in which a mower accidentally kills a bird crouched in the grass. In \u0026#34;Upon Appleton House,\u0026#34; he wrote that the \u0026#34;Edge\u0026#34; of the scythe was left \u0026#34;all bloody from its Breast.\u0026#34; Gardner argues that the poem makes us think about \u0026#34;the Flesh untimely mow\u0026#39;d\u0026#34; as a result of powerful undeviating cycles, including the seasons and warfare, which dominate our lives and determine our actions.\u003c/p\u003e\n\u003cp\u003eIn 1979, another poet from Hull, Philip Larkin, described killing a hedgehog with his own motorized machine. In \u0026#34;The Mower,\u0026#34; Larkin wrote that his mower had \u0026#34;\u0026#39;stalled, twice\u0026#39;\u0026#34; and that he found \u0026#34;A hedgehog jammed up against the blades, / Killed.\u0026#34;\u003c/p\u003e\n\n\n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1216189\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/life-death-and-mowing-2.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-2.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing-2.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-2.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing-2.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing-2.jpg\" width=\"800\" height=\"530\" alt=\"Life, death and mowing – study reveals Britain\u0026#39;s poetic obsession with the humble lawnmower\" title=\"A mower with a scythe by Francis Place (1647 to 1728), a study for the Pilkington Crest (undated). Yale Center for British Art, Paul Mellon Collection. Credit: Yale Center for British Art, Paul Mellon Collection\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eA mower with a scythe by Francis Place (1647 to 1728), a study for the Pilkington Crest (undated). Yale Center for British Art, Paul Mellon Collection. Credit: Yale Center for British Art, Paul Mellon Collection\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cp\u003eInspired by \u0026#34;Upon Appleton House,\u0026#34; Larkin also admired Marvell\u0026#39;s four mower poems: \u0026#34;The Mowers Song,\u0026#34; \u0026#34;Damon the Mower,\u0026#34; \u0026#34;The Mower Against Gardens,\u0026#34; and \u0026#34;The Mower to the Glow-Worms,\u0026#34; describing them as \u0026#34;charming and exquisite in the pastoral tradition,\u0026#34; and Gardner points out numerous similarities between the two poets.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003e\u0026#34;Larkin had a deep awareness of pastoral and georgic poetry and this makes his poem more unsettling. While he felt terrible about killing the hedgehog, which really happened, his poem is disturbing because it presents an uneasy affinity between the natural and the mechanical.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Every time Larkin cuts the grass, it grows back so he\u0026#39;s forced to use a machine that completes the job efficiently and repeatedly. By mirroring nature\u0026#39;s cruel, relentless forces, mowers like Larkin commit their own acts of cruelty and violence.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd yet, Gardner argues, it is often through their violence that the human mowers in these poems discover a capacity to be careful, sensitive and empathetic.\u003c/p\u003e\n\u003cp\u003eLarkin\u0026#39;s is one of the best-known lawnmower poems from the UK and U.S. discussed by Gardner, but not the only one to tackle traumatic events.\u003c/p\u003e\n\u003cp\u003eIn 2007, Andrew Motion based a moving elegy for his father on happy memories of him mowing the lawn. By contrast, Michael Laskey\u0026#39;s 1999 \u0026#34;The Lawnmower\u0026#34; uses the machine to describe fatherly \u0026#34;despotism and neglect,\u0026#34; Gardner argues.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Mowing a lawn is often viewed as a victory over nature but these poems reflect an increasing sense that this is a pyrrhic or ignoble victory,\u0026#34; Gardner says. \u0026#34;The father in Michael Laskey\u0026#39;s poem is so intent on mowing straight lines that he misses out on the joyful messiness of life with his children.\u0026#34;\u003c/p\u003e\n\n\n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1216187\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/life-death-and-mowing.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/life-death-and-mowing.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/life-death-and-mowing.jpg\" width=\"800\" height=\"530\" alt=\"Life, death and mowing – study reveals Britain\u0026#39;s poetic obsession with the humble lawnmower\" title=\"Study author Francesca Gardner on the lawn of her Cambridge College, St Catharine\u0026#39;s College, University of Cambridge. Credit: University of Cambridge\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eStudy author Francesca Gardner on the lawn of her Cambridge College, St Catharine\u0026#39;s College, University of Cambridge. Credit: University of Cambridge\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003cp\u003eLaskey\u0026#39;s poem ends: \u0026#34;We keep back, / do as were told, don\u0026#39;t touch. / It must be overgrown now, the grave.\u0026#34;\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eGardner says, \u0026#34;British poets are very interested in the lawn as a nostalgic space, so lawnmowers are often associated with childhood memories, especially of fathers working. The lawn is a safe domestic, often suburban, space in which unexpected violence can occur, as when Larkin kills a hedgehog.\u0026#34;\u003c/p\u003e\n\u003cp\u003eGardner\u0026#39;s favorite lawnmower poem is Mark Waldron\u0026#39;s 2017 \u0026#34;I wish I loved lawnmowers\u0026#34; which explores alienation, obsession and drug addiction. The speaker tells us that, if he loved lawnmowers, he would take a trip to the British Lawnmower Museum in Southport. But he doesn\u0026#39;t and the poem ends: \u0026#34;Now crack cocaine—that I loved.\u0026#34;\u003c/p\u003e\n\u003cp\u003eMost of the poems Gardner studied were written by recognized poets but she also found examples written by lawnmower enthusiasts. In 2013, \u003ci\u003eGrassbox\u003c/i\u003e, the Old Lawnmower Club\u0026#39;s magazine, published Tony Hopwood\u0026#39;s parody of the hymn \u0026#34;Morning Has Broken\u0026#34; which laments: \u0026#34;Mower has broken, / Gardeners in mourning. / Missus has spoken, / Had the last word.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Lawnmowers draw people to poetry as much as poetry draws people to lawnmowers,\u0026#34; Gardner says.\u003c/p\u003e\n\u003cp\u003eGardner points out that to-date most British lawnmower poems have been written by men but has found examples of women poking fun at mower-obsessed men. In 2002, \u003ci\u003eGrassbox\u003c/i\u003e published \u0026#34;A Lawnmower Widows Lament,\u0026#34; a poem by Peggy Miller, which opens: \u0026#34;I once was loved and cherished by a man who was quite handsome / But now I\u0026#39;m second fiddle to a Dennis or Ransomes.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFrancesca Gardner is an expert on early modern pastoral, georgic, and \u0026#39;nature\u0026#39; writing. She explains that British and American lawnmower poetry is rooted in two forms of ancient nature poetry. The pastoral form presents an idyllic form of nature in which shepherds stroll through fields and the land yields things up to them.\u003c/p\u003e\n\u003cp\u003eBy contrast, georgic poetry involves people having to work hard and use tools because nature isn\u0026#39;t so generous. Gardner points out that Andrew Marvell\u0026#39;s \u0026#39;Upon Appleton House\u0026#39; is an unusual mixture of both pastoral and georgic.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Poets inspired by Marvell appreciate that clash between idyllic nature and what it takes to maintain the lawn as an ideal space, the georgic conception of work,\u0026#34; Gardner says.\u003c/p\u003e\n\u003cp\u003eThe final lines of Larkin\u0026#39;s poem were widely quoted during the COVID-19 pandemic: \u0026#34;we should be kind / While there is still time.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;That remains a useful lesson whether we\u0026#39;re mowing or not,\u0026#34; Gardner says.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Francesca Gardner, Lawnmower Poetry and the Poetry of Lawnmowers, \u003ci\u003eCritical Quarterly\u003c/i\u003e (2025).\n                            \u003c/p\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-05-16T19:00:01-04:00",
  "modifiedTime": null
}
