{
  "id": "6d72cf42-e2d7-4133-82a8-8213a836efcf",
  "title": "Checklist for federal data backups",
  "link": "https://flowingdata.com/2025/01/31/checklist-for-federal-data-backups/",
  "description": "In preparation for days like this, MIT Libraries has a guide for making…Tags: backup, government, MIT",
  "author": "Nathan Yau",
  "published": "Sat, 01 Feb 2025 03:43:41 +0000",
  "source": "https://flowingdata.com/feed",
  "categories": [
    "Data Sharing",
    "backup",
    "government",
    "MIT"
  ],
  "byline": "Nathan Yau",
  "length": 722,
  "excerpt": "In preparation for days like this, MIT Libraries has a guide for making usable backups: The United States (US) federal government collects, aggregates, and disseminates a large volume of informatio…",
  "siteName": "FlowingData",
  "favicon": "https://flowingdata.com/wp-content/uploads/2025/01/logo-lone-square512x512-210x210.png",
  "text": "In preparation for days like this, MIT Libraries has a guide for making usable backups: The United States (US) federal government collects, aggregates, and disseminates a large volume of information and data. This content is used by researchers, policymakers, and many others for various purposes. Protecting access to US federal government data between and during presidential administrations is important. Data can potentially disappear because of government shutdowns, broken links, and policy shifts. This checklist provides steps you can take to ensure the government data you use in your research remains accessible to you and others. Identify the data, confirm, backup with documentation, and maintain re-usability.",
  "image": "https://flowingdata.com/wp-content/uploads/2025/01/logo-lone-square512x512.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"single-post\"\u003e\n                                    \n                \u003cp\u003eIn preparation for days like this, MIT Libraries has a \u003ca href=\"https://libraries.mit.edu/data-management/store/backups/checklist-usa/\"\u003eguide for making usable backups\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eThe United States (US) federal government collects, aggregates, and disseminates a large volume of information and data. This content is used by researchers, policymakers, and many others for various purposes.\u003c/p\u003e\n\u003cp\u003eProtecting access to US federal government data between and during presidential administrations is important. Data can potentially disappear because of government shutdowns, broken links, and policy shifts.\u003c/p\u003e\n\u003cp\u003eThis checklist provides steps you can take to ensure the government data you use in your research remains accessible to you and others.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eIdentify the data, confirm, backup with documentation, and maintain re-usability.\u003c/p\u003e\n                \n                \n                                        \n            \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-02-01T03:43:41Z",
  "modifiedTime": "2025-02-01T03:43:41Z"
}
