{
  "id": "6e5e0b02-b44c-4099-9407-603ae0f13915",
  "title": "Popular sugar substitute linked to brain cell damage and stroke risk",
  "link": "https://www.sciencedaily.com/releases/2025/07/250718035156.htm",
  "description": "Erythritol, a widely used sugar substitute found in many low-carb and sugar-free products, may not be as harmless as once believed. New research from the University of Colorado Boulder reveals that even small amounts of erythritol can harm brain blood vessel cells, promoting constriction, clotting, and inflammation—all of which may raise the risk of stroke.",
  "author": "",
  "published": "Sat, 19 Jul 2025 10:49:54 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3118,
  "excerpt": "Erythritol, a widely used sugar substitute found in many low-carb and sugar-free products, may not be as harmless as once believed. New research from the University of Colorado Boulder reveals that even small amounts of erythritol can harm brain blood vessel cells, promoting constriction, clotting, and inflammation—all of which may raise the risk of stroke.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "From low-carb ice cream to keto protein bars to \"sugar-free\" soda, the decades-old sweetener erythritol is everywhere. But new University of Colorado Boulder research shows the popular sugar substitute and specialty food additive comes with serious downsides, impacting brain cells in numerous ways that can boost risk of stroke. The study was published in the Journal of Applied Physiology. \"Our study adds to the evidence suggesting that non-nutritive sweeteners that have generally been purported to be safe, may not come without negative health consequences,\" said senior author Christopher DeSouza, professor of integrative physiology and director of the Integrative Vascular Biology Lab. First approved by the Food and Drug Administration in 2001, erythritol is a sugar alcohol, often produced by fermenting corn and found in hundreds of products. It has almost no calories, is about 80% as sweet as table sugar, and has negligible impact on insulin levels, making it a favorite for people trying to lose weight, keep their blood sugar in check or avoid carbohydrates. But recent research has begun to shed light on its risks. One recent study involving 4,000 people in the U.S. and Europe found that men and women with higher circulating levels of erythritol were significantly more likely to have a heart attack or stroke within the next three years. DeSouza and first author Auburn Berry, a graduate student in his lab, set out to understand what might be driving that increased risk. Researchers in the lab treated human cells that line blood vessels in the brain for three hours with about the same amount of erythritol contained in a typical sugar-free beverage. They observed that the treated cells were altered in numerous ways: They expressed significantly less nitric oxide, a molecule that relaxes and widens blood vessels, and more endothelin-1, a protein that constricts blood vessels. Meanwhile, when challenged with a clot-forming compound called thrombin, cellular production of the natural clot-busting compound t-PA was \"markedly blunted.\" The erythritol-treated cells also produced more reactive oxygen species (ROS), a.k.a. \"free radicals,\" metabolic byproducts which can age and damage cells and inflame tissue. \"Big picture, if your vessels are more constricted and your ability to break down blood clots is lowered, your risk of stroke goes up,\" said Berry. \"Our research demonstrates not only that, but how erythritol has the potential to increase stroke risk.\" DeSouza notes that their study used only a serving-size worth of the sugar substitute. For those who consume multiple servings per day, the impact, presumably, could be worse. The authors caution that their study was a laboratory study, conducted on cells, and larger studies in people are needed. That said, De Souza encourages consumers to read labels, looking for erythritol or \"sugar alcohol\" on the label. \"Given the epidemiological study that inspired our work, and now our cellular findings, we believe it would be prudent for people to monitor their consumption of non-nutrient-sweeteners such as this one,\" he said.",
  "image": "https://www.sciencedaily.com/images/1920/man-headache-brain-stroke.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eFrom low-carb ice cream to keto protein bars to \u0026#34;sugar-free\u0026#34; soda, the decades-old sweetener erythritol is everywhere.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eBut new University of Colorado Boulder research shows the popular sugar substitute and specialty food additive comes with serious downsides, impacting brain cells in numerous ways that can boost risk of stroke.\u003c/p\u003e\n\u003cp\u003eThe study was published in the \u003cem\u003eJournal of Applied Physiology\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our study adds to the evidence suggesting that non-nutritive sweeteners that have generally been purported to be safe, may not come without negative health consequences,\u0026#34; said senior author Christopher DeSouza, professor of integrative physiology and director of the Integrative Vascular Biology Lab.\u003c/p\u003e\n\u003cp\u003eFirst approved by the Food and Drug Administration in 2001, erythritol is a sugar alcohol, often produced by fermenting corn and found in hundreds of products. It has almost no calories, is about 80% as sweet as table sugar, and has negligible impact on insulin levels, making it a favorite for people trying to lose weight, keep their blood sugar in check or avoid carbohydrates.\u003c/p\u003e\n\u003cp\u003eBut recent research has begun to shed light on its risks.\u003c/p\u003e\n\u003cp\u003eOne recent study involving 4,000 people in the U.S. and Europe found that men and women with higher circulating levels of erythritol were significantly more likely to have a heart attack or stroke within the next three years.\u003c/p\u003e\n\n\n\u003cp\u003eDeSouza and first author Auburn Berry, a graduate student in his lab, set out to understand what might be driving that increased risk.\u003c/p\u003e\n\u003cp\u003eResearchers in the lab treated human cells that line blood vessels in the brain for three hours with about the same amount of erythritol contained in a typical sugar-free beverage.\u003c/p\u003e\n\u003cp\u003eThey observed that the treated cells were altered in numerous ways: They expressed significantly less nitric oxide, a molecule that relaxes and widens blood vessels, and more endothelin-1, a protein that constricts blood vessels. Meanwhile, when challenged with a clot-forming compound called thrombin, cellular production of the natural clot-busting compound t-PA was \u0026#34;markedly blunted.\u0026#34; The erythritol-treated cells also produced more reactive oxygen species (ROS), a.k.a. \u0026#34;free radicals,\u0026#34; metabolic byproducts which can age and damage cells and inflame tissue.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Big picture, if your vessels are more constricted and your ability to break down blood clots is lowered, your risk of stroke goes up,\u0026#34; said Berry. \u0026#34;Our research demonstrates not only that, but how erythritol has the potential to increase stroke risk.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDeSouza notes that their study used only a serving-size worth of the sugar substitute. For those who consume multiple servings per day, the impact, presumably, could be worse.\u003c/p\u003e\n\u003cp\u003eThe authors caution that their study was a laboratory study, conducted on cells, and larger studies in people are needed.\u003c/p\u003e\n\u003cp\u003eThat said, De Souza encourages consumers to read labels, looking for erythritol or \u0026#34;sugar alcohol\u0026#34; on the label.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Given the epidemiological study that inspired our work, and now our cellular findings, we believe it would be prudent for people to monitor their consumption of non-nutrient-sweeteners such as this one,\u0026#34; he said.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
