{
  "id": "74076baa-ef5a-4cc4-b6e5-241cc8446506",
  "title": "Earth's oldest impact crater was just found in Australia—exactly where geologists hoped it would be",
  "link": "https://phys.org/news/2025-03-earth-oldest-impact-crater-australia.html",
  "description": "We have discovered the oldest meteorite impact crater on Earth, in the very heart of the Pilbara region of Western Australia. The crater formed more than 3.5 billion years ago, making it the oldest known by more than a billion years. Our discovery is published today in Nature Communications.",
  "author": "",
  "published": "Sat, 08 Mar 2025 15:50:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Earth Sciences Environment"
  ],
  "byline": "Tim Johnson, Chris Kirkland, Jonas Kaempf",
  "length": 6716,
  "excerpt": "We have discovered the oldest meteorite impact crater on Earth, in the very heart of the Pilbara region of Western Australia. The crater formed more than 3.5 billion years ago, making it the oldest known by more than a billion years. Our discovery is published today in Nature Communications.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Field photographs of rocks on the flanks on the North Pole Dome. Credit: Nature Communications (2025). DOI: 10.1038/s41467-025-57558-3 We have discovered the oldest meteorite impact crater on Earth, in the very heart of the Pilbara region of Western Australia. The crater formed more than 3.5 billion years ago, making it the oldest known by more than a billion years. Our discovery is published today in Nature Communications. Curiously enough, the crater was exactly where we had hoped it would be, and its discovery supports a theory about the birth of Earth's first continents. The very first rocks The oldest rocks on Earth formed more than 3 billion years ago, and are found in the cores of most modern continents. However, geologists still cannot agree on how or why they formed. Nonetheless, there is agreement that these early continents were critical for many chemical and biological processes on Earth. Many geologists think these ancient rocks formed above hot plumes that rose from above Earth's molten metallic core, rather like wax in a lava lamp. Others maintain they formed by plate tectonic processes similar to modern Earth, where rocks collide and push each other over and under. Although these two scenarios are very different, both are driven by the loss of heat from within the interior of our planet. We think rather differently. A few years ago, we published a paper suggesting that the energy required to make continents in the Pilbara came from outside Earth, in the form of one or more collisions with meteorites many kilometers in diameter. As the impacts blasted up enormous volumes of material and melted the rocks around them, the mantle below produced thick \"blobs\" of volcanic material that evolved into continental crust. Our evidence then lay in the chemical composition of tiny crystals of the mineral zircon, about the size of sand grains. But to persuade other geologists, we needed more convincing evidence, preferably something people could see without needing a microscope. So, in May 2021, we began the long drive north from Perth for two weeks of fieldwork in the Pilbara, where we would meet up with our partners from the Geological Survey of Western Australia (GSWA) to hunt for the crater. But where to start? A serendipitous beginning Our first target was an unusual layer of rocks known as the Antarctic Creek Member, which crops out on the flanks of a dome some 20 kilometers in diameter. The Antarctic Creek Member is only 20 meters or so in thickness, and mostly comprises sedimentary rocks that are sandwiched between several kilometers of dark, basaltic lava. However, it also contains spherules—droplets formed from molten rock thrown up during an impact. But these drops could have traveled across the globe from a giant impact anywhere on Earth, most likely from a crater that has now been destroyed. After consulting the GSWA maps and aerial photography, we located an area in the center of the Pilbara along a dusty track to begin our search. We parked the off-road vehicles and headed our separate ways across the outcrops, more in hope than expectation, agreeing to meet an hour later to discuss what we'd found and grab a bite to eat. Remarkably, when we returned to the vehicle, we all thought we'd found the same thing: shatter cones. Shatter cones are beautiful, delicate branching structures, not dissimilar to a badminton shuttlecock. They are the only feature of shock visible to the naked eye, and in nature can only form following a meteorite impact. Little more than an hour into our search, we had found precisely what we were looking for. We had literally opened the doors of our 4WDs and stepped onto the floor of a huge, ancient impact crater. Frustratingly, after taking some photographs and grabbing a few samples, we had to move on to other sites, but we determined to return as soon as possible. Most importantly, we needed to know how old the shatter cones were. Had we discovered the oldest known crater on Earth? It turned out that we had. There and back again With some laboratory research under our belts, we returned to the site in May 2024 to spend ten days examining the evidence in more detail. Shatter cones were everywhere, developed throughout most of the Antarctic Creek Member, which we traced for several hundred meters into the rolling hills of the Pilbara. Our observations showed that above the layer with the shatter cones was a thick layer of basalt with no evidence of impact shock. This meant the impact had to be the same age as the Antarctic Member rocks, which we know are 3.5 billion years old. We had our age, and the record for the oldest impact crater on Earth. Perhaps our ideas regarding the ultimate origin of the continents were not so mad, as many told us. Serendipity is a marvelous thing. As far as we knew, other than the Traditional Owners, the Nyamal people, no geologist had laid eyes on these stunning features since they formed. Like some others before us, we had argued that meteorite impacts played a fundamental role in the geological history of our planet, as they clearly had on our cratered moon and on other planets, moons and asteroids. Now we and others have the chance to test these ideas based on hard evidence. Who knows how many ancient craters lay undiscovered in the ancient cores of other continents? Finding and studying them will transform our understanding of the early Earth and the role of giant impacts, not only in the formation of the landmasses on which we all live, but in the origins of life itself. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: Earth's oldest impact crater was just found in Australia—exactly where geologists hoped it would be (2025, March 8) retrieved 8 March 2025 from https://phys.org/news/2025-03-earth-oldest-impact-crater-australia.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/earths-oldest-impact-c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/earths-oldest-impact-c.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/earths-oldest-impact-c.jpg\" data-sub-html=\"Field photographs of rocks on the flanks on the North Pole Dome. Credit: \u0026lt;i\u0026gt;Nature Communications\u0026lt;/i\u0026gt; (2025). DOI: 10.1038/s41467-025-57558-3\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/earths-oldest-impact-c.jpg\" alt=\"Earth’s oldest impact crater was just found in Australia—exactly where geologists hoped it would be\" title=\"Field photographs of rocks on the flanks on the North Pole Dome. Credit: Nature Communications (2025). DOI: 10.1038/s41467-025-57558-3\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Field photographs of rocks on the flanks on the North Pole Dome. Credit: \u003ci\u003eNature Communications\u003c/i\u003e (2025). DOI: 10.1038/s41467-025-57558-3\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eWe have discovered the oldest meteorite impact crater on Earth, in the very heart of the Pilbara region of Western Australia. The crater formed more than 3.5 billion years ago, making it the oldest known by more than a billion years. Our discovery is published today in \u003ca href=\"https://doi.org/10.1038/s41467-025-57558-3\" target=\"_blank\"\u003e\u003ci\u003eNature Communications\u003c/i\u003e\u003c/a\u003e.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eCuriously enough, the \u003ca href=\"https://phys.org/tags/crater/\" rel=\"tag\"\u003ecrater\u003c/a\u003e was exactly where we had hoped it would be, and its discovery supports a theory about the birth of Earth\u0026#39;s first continents.\u003c/p\u003e\n\u003ch2\u003eThe very first rocks\u003c/h2\u003e\n\u003cp\u003eThe oldest rocks on Earth formed more than 3 billion years ago, and are found in the cores of most modern continents. However, geologists still cannot agree on how or why they formed.\u003c/p\u003e\n\u003cp\u003eNonetheless, there is agreement that these \u003ca href=\"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-040722-093345\" target=\"_blank\"\u003eearly continents\u003c/a\u003e were critical for many chemical and \u003ca href=\"https://phys.org/tags/biological+processes/\" rel=\"tag\"\u003ebiological processes\u003c/a\u003e on Earth.\u003c/p\u003e\n\u003cp\u003eMany geologists think these \u003ca href=\"https://phys.org/tags/ancient+rocks/\" rel=\"tag\"\u003eancient rocks\u003c/a\u003e formed \u003ca href=\"https://www.nature.com/articles/372063a0\" target=\"_blank\"\u003eabove hot plumes\u003c/a\u003e that rose from above Earth\u0026#39;s molten metallic core, rather like wax in a lava lamp. Others maintain they formed by \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0301926821001066\" target=\"_blank\"\u003eplate tectonic processes\u003c/a\u003e similar to modern Earth, where rocks collide and push each other over and under.\u003c/p\u003e\n\u003cp\u003eAlthough these two scenarios are very different, both are driven by the loss of heat from within the interior of our planet.\u003c/p\u003e\n\u003cp\u003eWe think rather differently.\u003c/p\u003e\n\u003cp\u003eA few years ago, we published \u003ca href=\"https://www.nature.com/articles/s41586-022-04956-y\" target=\"_blank\"\u003ea paper\u003c/a\u003e suggesting that the energy required to make continents in the Pilbara came from outside Earth, in the form of one or more collisions with meteorites many kilometers in diameter.\u003c/p\u003e\n\u003cp\u003eAs the impacts blasted up enormous volumes of material and melted the rocks around them, the mantle below produced thick \u0026#34;blobs\u0026#34; of volcanic material that evolved into continental crust.\u003c/p\u003e\n\u003cp\u003eOur evidence then lay in the chemical composition of tiny crystals of the mineral zircon, about the size of sand grains. But to persuade other geologists, we needed more convincing evidence, preferably something people could see without needing a microscope.\u003c/p\u003e\n\u003cp\u003eSo, in May 2021, we began the long drive north from Perth for two weeks of fieldwork in the Pilbara, where we would meet up with our partners from the Geological Survey of Western Australia (\u003ca href=\"https://www.dmp.wa.gov.au/geological-survey/geological-survey-262.aspx\" target=\"_blank\"\u003eGSWA\u003c/a\u003e) to hunt for the crater. But where to start?\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eA serendipitous beginning\u003c/h2\u003e\n\u003cp\u003eOur first target was an unusual layer of rocks known as the Antarctic Creek Member, which crops out on the flanks of a dome some 20 kilometers in diameter. The Antarctic Creek Member is only 20 meters or so in thickness, and mostly comprises \u003ca href=\"https://phys.org/tags/sedimentary+rocks/\" rel=\"tag\"\u003esedimentary rocks\u003c/a\u003e that are sandwiched between several kilometers of dark, basaltic lava.\u003c/p\u003e\n\u003cp\u003eHowever, it also contains \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0012821X04001049?casa_token=Gikx3Vfm7GMAAAAA:6EDaPWf5ESfuN3HuQMqF7-lyqFC2AbaXCsGF-IBOg5Y9Jp8rVjnTAv6FQdMJa9LOB_uO4Yzr\" target=\"_blank\"\u003espherules\u003c/a\u003e—droplets formed from molten rock thrown up during an impact. But these drops could have traveled across the globe from a giant impact anywhere on Earth, most likely from a crater that has now been destroyed.\u003c/p\u003e\n\u003cp\u003eAfter consulting the GSWA maps and aerial photography, we located an area in the center of the Pilbara along a dusty track to begin our search. We parked the off-road vehicles and headed our separate ways across the outcrops, more in hope than expectation, agreeing to meet an hour later to discuss what we\u0026#39;d found and grab a bite to eat.\u003c/p\u003e\n\u003cp\u003eRemarkably, when we returned to the vehicle, we all thought we\u0026#39;d found the same thing: shatter cones.\u003c/p\u003e\n\u003cp\u003eShatter cones are beautiful, delicate branching structures, not dissimilar to a badminton shuttlecock. They are the only feature of shock visible to the naked eye, and in nature can only form following a meteorite impact.\u003c/p\u003e\n\u003cp\u003eLittle more than an hour into our search, we had found precisely what we were looking for. We had literally opened the doors of our 4WDs and stepped onto the floor of a huge, ancient impact crater.\u003c/p\u003e\n\u003cp\u003eFrustratingly, after taking some photographs and grabbing a few samples, we had to move on to other sites, but we determined to return as soon as possible. Most importantly, we needed to know how old the shatter cones were. Had we discovered the oldest known crater on Earth?\u003c/p\u003e\n\u003cp\u003eIt turned out that we had.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eThere and back again\u003c/h2\u003e\n\u003cp\u003eWith some laboratory research under our belts, we returned to the site in May 2024 to spend ten days examining the evidence in more detail.\u003c/p\u003e\n\u003cp\u003eShatter cones were everywhere, developed throughout most of the Antarctic Creek Member, which we traced for several hundred meters into the rolling hills of the Pilbara.\u003c/p\u003e\n\u003cp\u003eOur observations showed that above the layer with the shatter cones was a thick layer of basalt with no evidence of impact shock. This meant the impact had to be the same age as the Antarctic Member rocks, which we know are 3.5 billion years old.\u003c/p\u003e\n\u003cp\u003eWe had our age, and the record for the oldest impact crater on Earth. Perhaps our ideas regarding the ultimate origin of the continents were not so mad, as many told us.\u003c/p\u003e\n\u003cp\u003eSerendipity is a marvelous thing. As far as we knew, other than the Traditional Owners, the Nyamal people, no geologist had laid eyes on these stunning features since they formed.\u003c/p\u003e\n\u003cp\u003eLike some \u003ca href=\"https://pubs.geoscienceworld.org/gsw/lithosphere/article/7/5/563/145769/Impact-origin-of-Archean-cratons\" target=\"_blank\"\u003eothers before us\u003c/a\u003e, we had argued that meteorite impacts played a fundamental role in the geological history of our planet, as they clearly had on our cratered moon and on \u003ca href=\"https://www.nature.com/articles/ngeo1841\" target=\"_blank\"\u003eother planets, moons and asteroids\u003c/a\u003e. Now we and others have the chance to test these ideas based on hard evidence.\u003c/p\u003e\n\u003cp\u003eWho knows how many ancient craters lay undiscovered in the ancient cores of other continents? Finding and studying them will transform our understanding of the early Earth and the role of giant impacts, not only in the formation of the landmasses on which we all live, but in the \u003ca href=\"https://canadiangeographic.ca/articles/did-meteorite-impacts-help-create-life-on-earth-and-beyond/\" target=\"_blank\"\u003eorigins of life\u003c/a\u003e itself.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/earths-oldest-impact-crater-was-just-found-in-australia-exactly-where-geologists-hoped-it-would-be-250921\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/250921/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tEarth\u0026#39;s oldest impact crater was just found in Australia—exactly where geologists hoped it would be (2025, March 8)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 8 March 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-03-earth-oldest-impact-crater-australia.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-08T15:50:01-05:00",
  "modifiedTime": null
}
