{
  "id": "79599e72-fec7-4dac-b393-4737be9c638a",
  "title": "As Musk seeks to launch tens of thousands of Starlink satellites, space researchers urge caution",
  "link": "https://phys.org/news/2024-10-musk-tens-thousands-starlink-satellites.html",
  "description": "Over 100 space researchers signed a letter urging the federal government to perform an environmental review before allowing SpaceX to continue launching thousands of satellites for its internet service, Starlink.",
  "author": "",
  "published": "Wed, 30 Oct 2024 20:50:02 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Space Exploration"
  ],
  "byline": "Noah Haggerty, Los Angeles Times",
  "length": 5438,
  "excerpt": "Over 100 space researchers signed a letter urging the federal government to perform an environmental review before allowing SpaceX to continue launching thousands of satellites for its internet service, Starlink.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Unsplash/CC0 Public Domain Over 100 space researchers signed a letter urging the federal government to perform an environmental review before allowing SpaceX to continue launching thousands of satellites for its internet service, Starlink. The Federal Communications Commission has licensed Elon Musk's company to launch nearly 12,000 satellites into space—more than double the number of non-SpaceX satellites orbiting Earth. SpaceX is asking the FCC to allow it to launch over 20,000 more. While the FCC evaluates the potential harms of satellite constellations, it currently exempts almost all telecommunications projects—including satellites—from facing formal environmental reviews. The researchers' letter, released on Thursday, argues that much has changed since the rule was created almost four decades ago. \"This is a new technology,\" said Lucas Gutterman, the director of the Designed to Last Campaign at Public Interest Research Groups (PIRG), which organized the letter. \"It could have benefits for the public and that's great, but the benefits need to be weighed against the potential harms, and the way you do that is with an environmental review.\" Gutterman said PIRG has heard back from the FCC and is excited to meet with the agency to discuss the group's concerns. The Starlink constellation provides internet coverage across the globe, especially to rural communities and countries without reliable cell tower service. The service has provided internet access to Ukrainian soldiers, hurricane victims and commercial flight passengers. SpaceX's satellites are designed to have a roughly five-year lifespan, after which SpaceX ground controllers will deorbit the satellites, let them burn up in Earth's atmosphere and launch replacements. This injection of metals and other compounds into the upper atmosphere from the incineration of the spent satellites has the potential to disturb the delicate balance of elements and molecules in the air, the letter argues. \"The industry has moved faster than regulators can act and faster than the public has really been aware,\" Gutterman said. \"The results aren't in—we just don't actually have the data on what effects this new technology could have.\" In a 2022 report, the Government Accountability Office—a nonpartisan federal agency tasked with saving taxpayer money and increasing government efficiency—recommended the FCC review whether the satellite constellations normally have significant environmental impacts. The FCC agreed with the findings. The space researchers who signed the letter not only study the effects of satellites and rocket launches on the atmosphere, but also rely on clear skies for their observations. As satellites whiz past the field of view of telescopes, they leave streaks in the astronomers' images. To compensate, scientists have had to frequently retake images and develop more sophisticated computer programs to remove the streaks. \"Picture an open book. Then picture a big marker streak across the page,\" said David Jewitt, a distinguished professor of astronomy at UCLA who signed the letter. \"That's what they do.\" Jewitt first heard about the letter while dealing with satellite streaks on his observations from a telescope in Spain. \"It was so obvious that the number of satellite trails is just way way up since I started doing astronomy,\" he said. \"People want to use space for good purposes. Communication is a good purpose. ... So, there has to be some moderation between the effective use of space and its effects on our view of the night sky.\" Environmental review of satellite mega-constellations would be a first step along a path of much-needed space policy reform, said Gutterman. Currently there is limited international cooperation in regulation of satellite constellations, and within the United States, oversight of different aspects of their life cycles—from launch to orbit to decommissioning—is handled by separate agencies. Setting clear international standards and streamlining the process in the U.S. would be a win-win for concerned scientists and the space industry, said Gutterman. It's not the first time Starlink has run into pushback from the public and government officials. After the first few batches of satellites were launched in 2019, astronomers around the world raised concerns about the satellites' reflectivity. In response, SpaceX began applying a coating to the satellites to make them less shiny. And earlier this month, the California Coastal Commission rejected a SpaceX plan to increase the number of rocket launches from Vandenburg Space Force Base to 50 a year, on the grounds that SpaceX was increasingly using the launches for their Starlink satellites instead of for military missions. SpaceX subsequently sued. 2024 Los Angeles Times. Distributed by Tribune Content Agency, LLC.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/starlink.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1142025\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2024/starlink.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/starlink.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/starlink.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/starlink.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/starlink.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/starlink.jpg\" width=\"800\" height=\"530\" alt=\"Starlink\" title=\"Credit: Unsplash/CC0 Public Domain\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Unsplash/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eOver 100 space researchers signed a letter urging the federal government to perform an environmental review before allowing SpaceX to continue launching thousands of satellites for its internet service, Starlink.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThe Federal Communications Commission has licensed Elon Musk\u0026#39;s company to launch nearly 12,000 satellites into space—more than double the number of non-SpaceX satellites orbiting Earth. SpaceX is asking the FCC to allow it to launch over 20,000 more.\u003c/p\u003e\n\u003cp\u003eWhile the FCC evaluates the potential harms of \u003ca href=\"https://phys.org/tags/satellite/\" rel=\"tag\"\u003esatellite\u003c/a\u003e constellations, it currently exempts almost all telecommunications projects—including satellites—from facing formal environmental reviews. The researchers\u0026#39; letter, released on Thursday, argues that much has changed since the rule was created almost four decades ago.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a new technology,\u0026#34; said Lucas Gutterman, the director of the Designed to Last Campaign at Public Interest Research Groups (PIRG), which organized the letter.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It could have benefits for the public and that\u0026#39;s great, but the benefits need to be weighed against the potential harms, and the way you do that is with an environmental review.\u0026#34;\u003c/p\u003e\n\u003cp\u003eGutterman said PIRG has heard back from the FCC and is excited to meet with the agency to discuss the group\u0026#39;s concerns.\u003c/p\u003e\n\u003cp\u003eThe Starlink constellation provides internet coverage across the globe, especially to rural communities and countries without reliable cell tower service. The service has provided internet access to Ukrainian soldiers, hurricane victims and commercial flight passengers.\u003c/p\u003e\n\u003cp\u003eSpaceX\u0026#39;s satellites are designed to have a roughly five-year lifespan, after which SpaceX ground controllers will deorbit the satellites, let them burn up in Earth\u0026#39;s atmosphere and launch replacements. This injection of metals and other compounds into the \u003ca href=\"https://phys.org/tags/upper+atmosphere/\" rel=\"tag\"\u003eupper atmosphere\u003c/a\u003e from the incineration of the spent satellites has the potential to disturb the delicate balance of elements and molecules in the air, the letter argues.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003e\u0026#34;The industry has moved faster than regulators can act and faster than the public has really been aware,\u0026#34; Gutterman said. \u0026#34;The results aren\u0026#39;t in—we just don\u0026#39;t actually have the data on what effects this new technology could have.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn a 2022 report, the Government Accountability Office—a nonpartisan federal agency tasked with saving \u003ca href=\"https://phys.org/tags/taxpayer+money/\" rel=\"tag\"\u003etaxpayer money\u003c/a\u003e and increasing government efficiency—recommended the FCC review whether the satellite constellations normally have significant environmental impacts. The FCC agreed with the findings.\u003c/p\u003e\n\u003cp\u003eThe space researchers who signed the letter not only study the effects of satellites and \u003ca href=\"https://phys.org/tags/rocket+launches/\" rel=\"tag\"\u003erocket launches\u003c/a\u003e on the atmosphere, but also rely on clear skies for their observations.\u003c/p\u003e\n\u003cp\u003eAs satellites whiz past the field of view of telescopes, they leave streaks in the astronomers\u0026#39; images. To compensate, scientists have had to frequently retake images and develop more sophisticated computer programs to remove the streaks.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Picture an open book. Then picture a big marker streak across the page,\u0026#34; said David Jewitt, a distinguished professor of astronomy at UCLA who signed the letter. \u0026#34;That\u0026#39;s what they do.\u0026#34;\u003c/p\u003e\n\u003cp\u003eJewitt first heard about the letter while dealing with satellite streaks on his observations from a telescope in Spain.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It was so obvious that the number of satellite trails is just way way up since I started doing astronomy,\u0026#34; he said. \u0026#34;People want to use space for good purposes. Communication is a good purpose. ... So, there has to be some moderation between the effective use of space and its effects on our view of the night sky.\u0026#34;\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eEnvironmental review of satellite mega-constellations would be a first step along a path of much-needed space policy reform, said Gutterman.\u003c/p\u003e\n\u003cp\u003eCurrently there is limited international cooperation in regulation of satellite constellations, and within the United States, oversight of different aspects of their life cycles—from launch to orbit to decommissioning—is handled by separate agencies.\u003c/p\u003e\n\u003cp\u003eSetting clear international standards and streamlining the process in the U.S. would be a win-win for concerned scientists and the \u003ca href=\"https://phys.org/tags/space+industry/\" rel=\"tag\"\u003espace industry\u003c/a\u003e, said Gutterman.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s not the first time Starlink has run into pushback from the public and government officials. After the first few batches of satellites were launched in 2019, astronomers around the world raised concerns about the satellites\u0026#39; reflectivity. In response, SpaceX began applying a coating to the satellites to make them less shiny.\u003c/p\u003e\n\u003cp\u003eAnd earlier this month, the California Coastal Commission rejected a SpaceX plan to increase the number of rocket launches from Vandenburg Space Force Base to 50 a year, on the grounds that SpaceX was increasingly using the launches for their Starlink satellites instead of for military missions.\u003c/p\u003e\n\u003cp\u003eSpaceX subsequently sued.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                \n\n                                    \u003cp\u003e2024 Los Angeles Times. Distributed by Tribune Content Agency, LLC.\u003c/p\u003e\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-30T20:50:02-04:00",
  "modifiedTime": null
}
