{
  "id": "7e97398c-9703-4843-a617-0fd27d2da939",
  "title": "Signaling pathway discovery could lead to faster, more reliable human stem cell differentiation",
  "link": "https://phys.org/news/2024-10-pathway-discovery-faster-reliable-human.html",
  "description": "A recent discovery has found a possible avenue to improve human health by better understanding how to engineer human stem cell differentiation.",
  "author": "",
  "published": "Thu, 10 Oct 2024 16:25:26 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Cell \u0026 Microbiology Biotechnology"
  ],
  "byline": "Raven Wuebker",
  "length": 4864,
  "excerpt": "A recent discovery has found a possible avenue to improve human health by better understanding how to engineer human stem cell differentiation.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Smad signaling is a conserved pathway. Credit: npj Systems Biology and Applications (2024). DOI: 10.1038/s41540-024-00430-9 A recent discovery has found a possible avenue to improve human health by better understanding how to engineer human stem cell differentiation. Texas A\u0026M University chemical engineering professor Dr. Gregory Reeves has led this discovery of the highly conserved Bone Morphogenetic Protein (BMP) Signaling Pathway, which operates in all animals and can achieve a variety of outcomes depending on the context. \"With this research, we are beginning to put together a roadmap of how to alter cells, such as adult human stem cells,\" Reeves said. \"They differentiate faster and more reliably, which would lead to advances in the therapeutic potential of stem cells.\" Reeves and his team have observed how cell signaling pathways drive cellular decision-making across different tissues and contexts. Signaling pathways such as the BMP pathway play important roles in these cellular responses. \"A cell is definitely a complex system,\" Reeves said. \"So it's not a surprise that we find engineering principles in the cell. I think that as we study biology more and more, we find out that biological systems are chock full of engineering principles, and I'm very interested in studying how those engineering principles are there.\" This cell signaling pathway is further explored in Reeves' recently published article in the journal npj Systems Biology and Applications. The paper examines how the BMP pathway balances trade-offs among three systems-level behaviors, or Performance Objectives (POs): speed, noise canceling, and the ability to act as a linear sensor. The diagram shows how different cells in various living organisms behave while going through a signaling pathway, choosing between speed, fidelity, and noise filtering. Credit: Dr. Gregory Reeves \"In fly embryos, when the signaling pathway becomes active, it reacts really fast, but if you look at the same signaling pathway in other scenarios, like in human stem cells, it takes much longer, but that might give it more of an ability to filter noise,\" Reeves said. \"The question that we were investigating is how the same pathway, with the same molecules, reacts differently.\" The team's findings reveal that varying the concentration of BMP signaling proteins inside the cell allows the pathway to achieve a diverse balance of POs. However, as the BMP pathway is used reiteratively throughout the life cycle of all animals, its systems-level behavior varies from one context to another, despite the pathway connectivity remaining nearly constant. \"Different systems have different trade-offs that they're emphasizing,\" Reeves said. \"Even though the pathway is wired the same in all cells, the concentrations of signaling proteins are different from cell to cell. So in the fly embryo, you could have high levels of signaling proteins, which makes a fast system; and in the human cell, you could have low levels that'll make a slower system, but it'll be more noise free.\" The research showed that due to competition among the POs, the pathway cannot simultaneously optimize all three, but must make trade-offs among the POs. With this knowledge, the team applied multi-objective optimization to identify optimal trade-offs among various requirements and discovered that the BMP pathway efficiently balances competing POs across species. \"We can tweak it to be a little bit faster, a little bit more noise free, and we'll sacrifice the goodness of the linear sensor,\" Reeves said. More information: Razeen Shaikh et al, Optimal performance objectives in the highly conserved bone morphogenetic protein signaling pathway, npj Systems Biology and Applications (2024). DOI: 10.1038/s41540-024-00430-9 Citation: Signaling pathway discovery could lead to faster, more reliable human stem cell differentiation (2024, October 10) retrieved 11 October 2024 from https://phys.org/news/2024-10-pathway-discovery-faster-reliable-human.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/signaling-pathway-disc.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/signaling-pathway-disc.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/signaling-pathway-disc.jpg\" data-sub-html=\"Smad signaling is a conserved pathway. Credit: \u0026lt;i\u0026gt;npj Systems Biology and Applications\u0026lt;/i\u0026gt; (2024). DOI: 10.1038/s41540-024-00430-9\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/signaling-pathway-disc.jpg\" alt=\"Signaling pathway discovery could lead to faster, more reliable human stem cell differentiation\" title=\"Smad signaling is a conserved pathway. Credit: npj Systems Biology and Applications (2024). DOI: 10.1038/s41540-024-00430-9\" width=\"800\" height=\"448\"/\u003e\n             \u003cfigcaption\u003e\n                Smad signaling is a conserved pathway. Credit: \u003ci\u003enpj Systems Biology and Applications\u003c/i\u003e (2024). DOI: 10.1038/s41540-024-00430-9\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eA recent discovery has found a possible avenue to improve human health by better understanding how to engineer human stem cell differentiation.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTexas A\u0026amp;M University chemical engineering professor Dr. Gregory Reeves has led this discovery of the highly conserved Bone Morphogenetic Protein (BMP) Signaling Pathway, which operates in all animals and can achieve a variety of outcomes depending on the context.\u003c/p\u003e\n\u003cp\u003e\u0026#34;With this research, we are beginning to put together a roadmap of how to alter \u003ca href=\"https://phys.org/tags/cells/\" rel=\"tag\"\u003ecells\u003c/a\u003e, such as adult human stem cells,\u0026#34; Reeves said. \u0026#34;They differentiate faster and more reliably, which would lead to advances in the therapeutic potential of stem cells.\u0026#34;\u003c/p\u003e\n\u003cp\u003eReeves and his team have observed how cell signaling pathways drive cellular decision-making across different tissues and contexts. Signaling pathways such as the BMP pathway play important roles in these cellular responses.\u003c/p\u003e\n\u003cp\u003e\u0026#34;A cell is definitely a complex system,\u0026#34; Reeves said. \u0026#34;So it\u0026#39;s not a surprise that we find engineering principles in the cell. I think that as we study biology more and more, we find out that \u003ca href=\"https://phys.org/tags/biological+systems/\" rel=\"tag\"\u003ebiological systems\u003c/a\u003e are chock full of engineering principles, and I\u0026#39;m very interested in studying how those engineering principles are there.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis cell \u003ca href=\"https://phys.org/tags/signaling+pathway/\" rel=\"tag\"\u003esignaling pathway\u003c/a\u003e is further explored in Reeves\u0026#39; recently \u003ca href=\"https://www.nature.com/articles/s41540-024-00430-9\" target=\"_blank\"\u003epublished\u003c/a\u003e article in the journal \u003ci\u003enpj Systems Biology and Applications\u003c/i\u003e.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe paper examines how the BMP pathway balances trade-offs among three systems-level behaviors, or Performance Objectives (POs): speed, noise canceling, and the ability to act as a linear sensor.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/cell-signaling-pathway.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/cell-signaling-pathway.jpg\" data-sub-html=\"The diagram shows how different cells in various living organisms behave while going through a signaling pathway, choosing between speed, fidelity, and noise filtering. Credit: Dr. Gregory Reeves\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/cell-signaling-pathway.jpg\" alt=\"Cell signaling pathways have been discovered to positively affect human stem cells \" title=\"The diagram shows how different cells in various living organisms behave while going through a signaling pathway, choosing between speed, fidelity, and noise filtering. Credit: Dr. Gregory Reeves\"/\u003e\n             \u003cfigcaption\u003e\n                The diagram shows how different cells in various living organisms behave while going through a signaling pathway, choosing between speed, fidelity, and noise filtering. Credit: Dr. Gregory Reeves\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003e\u0026#34;In fly embryos, when the signaling pathway becomes active, it reacts really fast, but if you look at the same signaling pathway in other scenarios, like in human stem cells, it takes much longer, but that might give it more of an ability to filter noise,\u0026#34; Reeves said. \u0026#34;The question that we were investigating is how the same pathway, with the same molecules, reacts differently.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe team\u0026#39;s findings reveal that varying the concentration of BMP signaling proteins inside the cell allows the pathway to achieve a diverse balance of POs.\u003c/p\u003e\n\u003cp\u003eHowever, as the BMP pathway is used reiteratively throughout the life cycle of all animals, its systems-level behavior varies from one context to another, despite the pathway connectivity remaining nearly constant.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Different systems have different trade-offs that they\u0026#39;re emphasizing,\u0026#34; Reeves said. \u0026#34;Even though the pathway is wired the same in all cells, the concentrations of signaling proteins are different from cell to cell. So in the fly embryo, you could have high levels of signaling proteins, which makes a fast system; and in the human cell, you could have low levels that\u0026#39;ll make a slower system, but it\u0026#39;ll be more noise free.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe research showed that due to competition among the POs, the pathway cannot simultaneously optimize all three, but must make trade-offs among the POs.\u003c/p\u003e\n\u003cp\u003eWith this knowledge, the team applied multi-objective optimization to identify optimal trade-offs among various requirements and discovered that the BMP pathway efficiently balances competing POs across species.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We can tweak it to be a little bit faster, a little bit more noise free, and we\u0026#39;ll sacrifice the goodness of the linear sensor,\u0026#34; Reeves said.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tRazeen Shaikh et al, Optimal performance objectives in the highly conserved bone morphogenetic protein signaling pathway, \u003ci\u003enpj Systems Biology and Applications\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1038/s41540-024-00430-9\" target=\"_blank\"\u003eDOI: 10.1038/s41540-024-00430-9\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tSignaling pathway discovery could lead to faster, more reliable human stem cell differentiation (2024, October 10)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 11 October 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-10-pathway-discovery-faster-reliable-human.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-10T16:25:26-04:00",
  "modifiedTime": null
}
