{
  "id": "7f5d61f5-2e22-4931-a7f4-5bd899c7ac63",
  "title": "Flamingos create water tornados to trap their prey",
  "link": "https://phys.org/news/2025-05-flamingos-tornados-prey.html",
  "description": "Flamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there's a lot going on under the surface.",
  "author": "",
  "published": "Mon, 12 May 2025 17:30:04 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Plants \u0026 Animals Ecology"
  ],
  "byline": "Robert Sanders",
  "length": 10031,
  "excerpt": "Flamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there's a lot going on under the surface.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Flamingos feed by dragging their flattened beaks forward along the bottom of shallow lakes. To increase the efficiency of feeding, they stomp dance to churn the bottom, create an upwelling vortex with their heads and clap their beaks constantly to draw food, like brine shrimp, into their mouths. Credit: Aztli Ortega Flamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there's a lot going on under the surface. Through studies of Chilean flamingos in the Nashville Zoo and analysis of 3D printed models of their feet and L-shaped bills, researchers have documented how the birds use their feet, heads and beaks to create a storm of swirling tornados, or vortices, in the water to efficiently concentrate and slurp up their prey. \"Flamingos are actually predators, they are actively looking for animals that are moving in the water, and the problem they face is how to concentrate these animals, to pull them together and feed,\" said Victor Ortega Jiménez, an assistant professor of integrative biology at the University of California, Berkeley, who specializes in biomechanics. \"Think of spiders, which produce webs to trap insects. Flamingos are using vortices to trap animals, like brine shrimp.\" Ortega Jiménez and collaborators at the Georgia Institute of Technology in Atlanta; Kennesaw State University in Marietta, Georgia (KSU-Marietta); and the Nashville Zoo have published their findings this week in the journal Proceedings of the National Academy of Sciences. A Chilean flamingo feeding in shallow water. Credit: Victor Ortega Jiménez, UC Berkeley Chilean flamingo. Credit: Victor Ortega Jiménez, UC Berkeley The researchers found that flamingos use their floppy webbed feet to churn up the bottom sediment and propel it forward in whorls that the birds then draw to the surface by jerking their heads upward like plungers, creating mini tornados. All the while, the birds' heads remain upside down within the watery vortex, their angled beaks chattering to create smaller vortices that direct the sediment and food into their mouths, where it's strained out. The beak of a flamingo is unique in being flattened on the angled front end, so that when the bird's head is upside down in the water, the flat portion is parallel to the bottom. This allows the flamingo to employ another technique called skimming. This involves using its long, S-shaped neck to push its head forward while rapidly clapping its beak, creating sheet-like vortices—von Kármán vortices—that trap prey. This suite of active feeding behaviors belie the flamingo's reputation as a passive filter feeder, Ortega Jiménez said. \"It seems like they are filtering just passive particles, but no, these animals are actually taking animals that are moving,\" he said. The principles he discovered could be used to design better systems for concentrating and sucking up tiny particles, such as microplastics, from water; better self-cleaning filters, based on chattering; or robots that, like flamingos, can walk and run in mud. Chattering Ortega Jiménez, a native of Puebla, Mexico, became fascinated with the feeding behavior of flamingos during a visit to Zoo Atlanta with his wife and daughter before the COVID-19 pandemic. Filming the birds' feeding behavior, he observed only ripples on the surface. \"We don't know anything about what is happening inside. That was my question,\" he said. At the time, a postdoctoral fellow at Kennesaw State University in Georgia, Ortega Jiménez focused on flamingo feeding as his next research project. He views himself, he said, as a modern-day Darwinian naturalist, investigating the behavior of animals of all types, from nematodes and flies to springtails and birds, focusing on how the animals interact with and manipulate their surroundings, including air, water and electromagnetic fields. From Kennesaw State, he moved to the Georgia Institute of Technology to work in the lab of Saad Bhamla, where he collaborated with engineers, and they gained access to Chilean flamingos at the Nashville Zoo. The team filmed them feeding in a large tray, using a laser to illuminate gas bubbles in the water in order to see the vortices created by the heads and beaks of the animals. After moving to the University of Maine in Orono as an assistant professor, Ortega Jiménez refined 3D printed models of a flamingo beak and foot to study more precisely the movement of water and particles during the beak clapping, or \"chattering,\" that the birds use when eating. In 2024, he moved again, to UC Berkeley, where he conducted experiments to see how effective the chattering and foot stomping was in capturing live brine shrimp. The new paper summarizes all of this collaborative work. At UC Berkeley, he attached a real flamingo beak to an actuator to simulate chattering and added a small pump in the mouth to simulate the tongue and suck up the brine shrimp captured by the mouth. With this setup, he was able to establish that chattering is key to flamingo feeding. \"The chattering actually is increasing seven times the number of brine shrimp passing through the tube,\" he said. \"So it's clear that the chattering is enhancing the number of individuals that are captured by the beak.\" Stomp dancing The feeding behavior begins with the feet, Ortega Jiménez said. If you look at a flamingo in very shallow water, you can often see its dancing-in-place or circular dancing behavior. The feet are webbed, but as with many wading birds, they are floppy, so that when the bird lifts a foot, the webbing collapses and comes away from the bottom without the suction that makes it hard for humans to walk in mud. When walking or running, flamingos seem to slide their feet into the water instead of stomping, a technique that could help robots walk in water or mud. Ortega Jiménez created models of both rigid and flexible flamingo feet to compare how the two designs affect fluid flow, and he found that the floppy feet are much more effective at pushing vortices of sediment out in front of each step. Rigid webbing primarily produces turbulence. Creating a 3D model of the L-shaped beak, he was able to show that pulling the head straight upward in the water creates a vortex swirling around a vertical axis, again concentrating particles of food. He measured the head speed at about 40 centimeters per second (1.3 feet per second). The small tornados were strong enough to entrap even agile invertebrates, such as brine shrimp and the microscopic crustaceans called copepods. Chattering also creates vortices around the beak. In this case, the flamingo keeps its upper beak stationary, though it is capable of independent motion, and moves only the lower beak—about 12 times per second during chattering, Ortega Jiménez discovered. Tien Yee, a co-author of the paper and a professor at KSU-Marrieta, employed computational fluid dynamics to simulate on a computer the 3D flow around the beak and the feet. He confirmed that the vortices do indeed concentrate particles, similar to experiments using a 3D-printed head in a flume with both actively swimming brine shrimp and passively floating brine shrimp eggs. \"We observed when we put a 3D printed model in a flume to mimic what we call skimming, they are producing symmetrical vortices on the sides of the beak that recirculate the particles in the water so they actually get into the beak,\" Ortega Jiménez said. \"It's this trick of fluid dynamics.\" His next projects are to determine the role of the flamingo's piston-like tongue and how the comb-like edges of the beak filter prey out of briny and sometimes toxic water. \"Flamingos are super-specialized animals for filter feeding,\" he said. \"It's not just the head, but the neck, their legs, their feet and all the behaviors they use just to effectively capture these tiny and agile organisms.\" In addition to Yee, other co-authors of the paper are postdoctoral fellow Pankaj Rohilla, graduate student Benjamin Seleb and Professor Saad Bhamla at Georgia Tech; and Jake Belair of the Nashville Zoo in Tennessee. More information: Victor M. Ortega-Jimenez et al, Flamingos use their L-shaped beak and morphing feet to induce vortical traps for prey capture, Proceedings of the National Academy of Sciences (2025). DOI: 10.1073/pnas.2503495122 Journal information: Proceedings of the National Academy of Sciences",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/flamingos-create-water.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1215684\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/flamingos-create-water.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water.jpg\" width=\"800\" height=\"530\" alt=\"Flamingos create water tornados to trap their prey\" title=\"Flamingos feed by dragging their flattened beaks forward along the bottom of shallow lakes. To increase the efficiency of feeding, they stomp dance to churn the bottom, create an upwelling vortex with their heads and clap their beaks constantly to draw food, like brine shrimp, into their mouths. Credit: Aztli Ortega\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eFlamingos feed by dragging their flattened beaks forward along the bottom of shallow lakes. To increase the efficiency of feeding, they stomp dance to churn the bottom, create an upwelling vortex with their heads and clap their beaks constantly to draw food, like brine shrimp, into their mouths. Credit: Aztli Ortega\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eFlamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there\u0026#39;s a lot going on under the surface.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThrough studies of Chilean \u003ca href=\"https://phys.org/tags/flamingos/\" rel=\"tag\"\u003eflamingos\u003c/a\u003e in the Nashville Zoo and analysis of 3D printed models of their feet and L-shaped bills, researchers have documented how the birds use their feet, heads and beaks to create a storm of swirling tornados, or vortices, in the water to efficiently concentrate and slurp up their prey.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Flamingos are actually predators, they are actively looking for animals that are moving in the water, and the problem they face is how to concentrate these animals, to pull them together and feed,\u0026#34; said Victor Ortega Jiménez, an assistant professor of integrative biology at the University of California, Berkeley, who specializes in biomechanics. \u0026#34;Think of spiders, which produce webs to trap insects. Flamingos are using vortices to trap animals, like brine shrimp.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOrtega Jiménez and collaborators at the Georgia Institute of Technology in Atlanta; Kennesaw State University in Marietta, Georgia (KSU-Marietta); and the Nashville Zoo have \u003ca href=\"https://pnas.org/doi/10.1073/pnas.2503495122\" target=\"_blank\"\u003epublished\u003c/a\u003e their findings this week in the journal \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e.\u003c/p\u003e\n\n\n\u003cul\u003e\n            \u003cli\u003e\n            \u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1215685\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/flamingos-create-water-1.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-1.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water-1.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-1.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water-1.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-1.jpg\" width=\"800\" height=\"530\" alt=\"Flamingos create water tornados to trap their prey\" title=\"A Chilean flamingo feeding in shallow water. Credit: Victor Ortega Jiménez, UC Berkeley\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eA Chilean flamingo feeding in shallow water. Credit: Victor Ortega Jiménez, UC Berkeley\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e        \u003c/li\u003e\n            \u003cli\u003e\n            \u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1215686\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/flamingos-create-water-2.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-2.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water-2.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-2.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/flamingos-create-water-2.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/flamingos-create-water-2.jpg\" width=\"800\" height=\"525\" alt=\"Flamingos create water tornados to trap their prey\" title=\"Chilean flamingo. Credit: Victor Ortega Jiménez, UC Berkeley\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eChilean flamingo. Credit: Victor Ortega Jiménez, UC Berkeley\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e        \u003c/li\u003e\n    \u003c/ul\u003e\n\n\u003cp\u003eThe researchers found that flamingos use their floppy webbed feet to churn up the bottom sediment and propel it forward in whorls that the birds then draw to the surface by jerking their heads upward like plungers, creating mini tornados. All the while, the birds\u0026#39; heads remain upside down within the watery vortex, their angled beaks chattering to create smaller vortices that direct the sediment and food into their mouths, where it\u0026#39;s strained out.\u003c/p\u003e\n\u003cp\u003eThe beak of a flamingo is unique in being flattened on the angled front end, so that when the bird\u0026#39;s head is upside down in the water, the flat portion is parallel to the bottom. This allows the flamingo to employ another technique called skimming. This involves using its long, S-shaped neck to push its head forward while rapidly clapping its beak, creating sheet-like vortices—von Kármán vortices—that trap prey.\u003c/p\u003e\n\u003cp\u003eThis suite of active feeding behaviors belie the flamingo\u0026#39;s reputation as a passive filter feeder, Ortega Jiménez said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It seems like they are filtering just passive particles, but no, these animals are actually taking animals that are moving,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003eThe principles he discovered could be used to design better systems for concentrating and sucking up tiny particles, such as microplastics, from water; better self-cleaning filters, based on chattering; or robots that, like flamingos, can walk and run in mud.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eChattering\u003c/h2\u003e\n\u003cp\u003eOrtega Jiménez, a native of Puebla, Mexico, became fascinated with the feeding behavior of flamingos during a visit to Zoo Atlanta with his wife and daughter before the COVID-19 pandemic. Filming the birds\u0026#39; feeding behavior, he observed only ripples on the surface.\u003c/p\u003e\n\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=3cgcF8th5Nk\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2025-05-12T17:18:05-04:00\"/\u003e\n            \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/3cgcF8th5Nk\"/\u003e\n        \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/3cgcF8th5Nk/maxresdefault.jpg\"/\u003e\n        \u003cp\u003e\n            \u003ciframe src=\"https://www.youtube.com/embed/3cgcF8th5Nk?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n        \u003c/p\u003e\n        \u003c/figure\u003e\u003cp\u003e\u0026#34;We don\u0026#39;t know anything about what is happening inside. That was my question,\u0026#34; he said.\u003c/p\u003e\n\u003cp\u003eAt the time, a postdoctoral fellow at Kennesaw State University in Georgia, Ortega Jiménez focused on flamingo feeding as his next research project. He views himself, he said, as a modern-day Darwinian naturalist, investigating the behavior of animals of all types, from nematodes and flies to springtails and birds, focusing on how the animals interact with and manipulate their surroundings, including air, water and electromagnetic fields.\u003c/p\u003e\n\u003cp\u003eFrom Kennesaw State, he moved to the Georgia Institute of Technology to work in the lab of Saad Bhamla, where he collaborated with engineers, and they gained access to Chilean flamingos at the Nashville Zoo. The team filmed them feeding in a large tray, using a laser to illuminate gas bubbles in the water in order to see the vortices created by the heads and \u003ca href=\"https://phys.org/tags/beaks/\" rel=\"tag\"\u003ebeaks\u003c/a\u003e of the animals.\u003c/p\u003e\n\u003cp\u003eAfter moving to the University of Maine in Orono as an assistant professor, Ortega Jiménez refined 3D printed models of a flamingo beak and foot to study more precisely the movement of water and particles during the beak clapping, or \u0026#34;chattering,\u0026#34; that the birds use when eating.\u003c/p\u003e\n\u003cp\u003eIn 2024, he moved again, to UC Berkeley, where he conducted experiments to see how effective the chattering and foot stomping was in capturing live brine shrimp. The new paper summarizes all of this collaborative work.\u003c/p\u003e\n\u003cp\u003eAt UC Berkeley, he attached a real flamingo beak to an actuator to simulate chattering and added a small pump in the mouth to simulate the tongue and suck up the brine shrimp captured by the mouth. With this setup, he was able to establish that chattering is key to flamingo feeding.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The chattering actually is increasing seven times the number of brine shrimp passing through the tube,\u0026#34; he said. \u0026#34;So it\u0026#39;s clear that the chattering is enhancing the number of individuals that are captured by the beak.\u0026#34;\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eStomp dancing\u003c/h2\u003e\n\u003cp\u003eThe feeding behavior begins with the feet, Ortega Jiménez said. If you look at a flamingo in very shallow water, you can often see its dancing-in-place or circular dancing behavior.\u003c/p\u003e\n\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=MDzIufdF3KA\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2025-05-12T17:19:11-04:00\"/\u003e\n            \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/MDzIufdF3KA\"/\u003e\n        \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/MDzIufdF3KA/maxresdefault.jpg\"/\u003e\n        \u003cp\u003e\n            \u003ciframe src=\"https://www.youtube.com/embed/MDzIufdF3KA?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n        \u003c/p\u003e\n        \u003c/figure\u003e\u003cp\u003eThe feet are webbed, but as with many wading birds, they are floppy, so that when the bird lifts a foot, the webbing collapses and comes away from the bottom without the suction that makes it hard for humans to walk in mud. When walking or running, flamingos seem to slide their feet into the water instead of stomping, a technique that could help robots walk in water or mud.\u003c/p\u003e\n\u003cp\u003eOrtega Jiménez created models of both rigid and flexible flamingo feet to compare how the two designs affect \u003ca href=\"https://phys.org/tags/fluid+flow/\" rel=\"tag\"\u003efluid flow\u003c/a\u003e, and he found that the floppy feet are much more effective at pushing vortices of sediment out in front of each step. Rigid webbing primarily produces turbulence.\u003c/p\u003e\n\u003cp\u003eCreating a 3D model of the L-shaped beak, he was able to show that pulling the head straight upward in the water creates a vortex swirling around a vertical axis, again concentrating particles of food. He measured the head speed at about 40 centimeters per second (1.3 feet per second). The small tornados were strong enough to entrap even agile invertebrates, such as brine shrimp and the microscopic crustaceans called copepods.\u003c/p\u003e\n\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=NBkrXU7N6kw\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2025-05-12T17:19:26-04:00\"/\u003e\n            \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/NBkrXU7N6kw\"/\u003e\n        \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/NBkrXU7N6kw/maxresdefault.jpg\"/\u003e\n        \u003cp\u003e\n            \u003ciframe src=\"https://www.youtube.com/embed/NBkrXU7N6kw?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n        \u003c/p\u003e\n        \u003c/figure\u003e\u003cp\u003eChattering also creates vortices around the beak. In this case, the flamingo keeps its upper beak stationary, though it is capable of independent motion, and moves only the lower beak—about 12 times per second during chattering, Ortega Jiménez discovered.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eTien Yee, a co-author of the paper and a professor at KSU-Marrieta, employed computational fluid dynamics to simulate on a computer the 3D flow around the beak and the feet. He confirmed that the vortices do indeed concentrate particles, similar to experiments using a 3D-printed head in a flume with both actively swimming brine shrimp and passively floating brine shrimp eggs.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We observed when we put a 3D printed model in a flume to mimic what we call skimming, they are producing symmetrical vortices on the sides of the beak that recirculate the particles in the water so they actually get into the beak,\u0026#34; Ortega Jiménez said. \u0026#34;It\u0026#39;s this trick of fluid dynamics.\u0026#34;\u003c/p\u003e\n\u003cp\u003eHis next projects are to determine the role of the flamingo\u0026#39;s piston-like tongue and how the comb-like edges of the beak filter prey out of briny and sometimes toxic water.\u003c/p\u003e\n\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=zrjSHymv1q0\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"Flamingos create water tornados to trap their prey\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2025-05-12T17:19:35-04:00\"/\u003e\n            \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/zrjSHymv1q0\"/\u003e\n        \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/zrjSHymv1q0/maxresdefault.jpg\"/\u003e\n        \u003cp\u003e\n            \u003ciframe src=\"https://www.youtube.com/embed/zrjSHymv1q0?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n        \u003c/p\u003e\n        \u003c/figure\u003e\u003cp\u003e\u0026#34;Flamingos are super-specialized animals for filter feeding,\u0026#34; he said. \u0026#34;It\u0026#39;s not just the head, but the neck, their legs, their feet and all the behaviors they use just to effectively capture these tiny and agile organisms.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn addition to Yee, other co-authors of the paper are postdoctoral fellow Pankaj Rohilla, graduate student Benjamin Seleb and Professor Saad Bhamla at Georgia Tech; and Jake Belair of the Nashville Zoo in Tennessee.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Victor M. Ortega-Jimenez et al, Flamingos use their L-shaped beak and morphing feet to induce vortical traps for prey capture, \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1073/pnas.2503495122\" target=\"_blank\"\u003eDOI: 10.1073/pnas.2503495122\u003c/a\u003e\n                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/proceedings-of-the-national-academy-of-sciences/\"\u003eProceedings of the National Academy of Sciences\u003c/a\u003e\n                                                                                    \u003ca href=\"http://www.pnas.org/\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-05-12T17:30:04-04:00",
  "modifiedTime": null
}
