{
  "id": "7fffa1d7-6c88-4acb-b6a6-3986786f1f38",
  "title": "Is university worth it? Yes, for both students and society",
  "link": "https://phys.org/news/2024-12-university-worth-students-society.html",
  "description": "As we enter the holiday season, many young people are no doubt beginning to consider their future options. With a range of paths to pursue, a high rate of youth unemployment in Canada and a higher education sector facing unprecedented challenges it may seem logical to wonder if university is worth it.",
  "author": "",
  "published": "Thu, 26 Dec 2024 17:10:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences Education"
  ],
  "byline": "Rhonda Lenton",
  "length": 7167,
  "excerpt": "As we enter the holiday season, many young people are no doubt beginning to consider their future options. With a range of paths to pursue, a high rate of youth unemployment in Canada and a higher education sector facing unprecedented challenges it may seem logical to wonder if university is worth it.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Pixabay/CC0 Public Domain As we enter the holiday season, many young people are no doubt beginning to consider their future options. With a range of paths to pursue, a high rate of youth unemployment in Canada and a higher education sector facing unprecedented challenges it may seem logical to wonder if university is worth it. In my role as president of York University, I see these issues play out every day in the lives of my students and faculty. However, I can say with certainty that, yes, university is worth it for both students and society. And while you might think that I might be biased, there is real data to back it up. Simply put, going to university enriches both students and society over the long term. We must ensure that students and universities are supported to help ensure as broad access as possible. Long-term benefits While many students entering the market fresh out of university will make entry-level wages, the reality is that over the longer term their earning potential has more room to expand. Those with a bachelor's degree earn 24% more than the national average. The more education, the higher the earning potential. Students with a university degree are more likely to have stable employment even amidst economic disruption, as the COVID-19 pandemic revealed. Graduates are also more likely to gain employment that offers a wider range of benefits. Simply put, an education increases one's chances of finding fulfilling employment and living a longer and healthier life. Beyond individual benefits, there are also key benefits to society. Canada relies disproportionately on universities compared to other OECD countries to drive the research and innovation central to a productive and prosperous economy. Further research has shown that education is central to a healthy, democratic society To quote Nelson Mandela: \"education is the most powerful weapon which you can use to change the world.\" The world faces a host of wicked problems ranging from economic inequality to climate change, geopolitical conflict and ongoing wars. Universities and graduates play a key role in addressing these challenges. Training resilience Technology is not going away and it is not slowing down. A recent study revealed that the jobs of more than 60% of Canadians may be at risk to AI. Moreover, an estimated one out of 10 employees in Canada could be at a high risk of automation-related job redundancy. Canada's already volatile job market will continue to be impacted. Those with higher levels of education are the best equipped to benefit from technologies in ways that complement the work they do. Graduates are also more likely to have the transferable skills needed to withstand workforce disruption. According to the OECD, AI technologies pose less of a risk for highly-skilled workers. In fact, their jobs are less likely to be replaced by automation because they possess the critical thinking skills needed to provide oversight to tasks that use AI and automation. While these technologies are sophisticated and becoming even more so each day, they currently cannot replicate human cognitive, critical and decision-making skills. There is also compelling research that shows students with higher education are more likely to pursue continuing education to upgrade and reskill, a quality that makes students more agile in a shifting labor market. Universities have also been increasing micro-credentials, programs which help learners re-skill while they are holding employment and balancing familial obligations, to support lifelong learning and build a more resilient Canadian workforce. Ensuring access If Canada is to meet the expanding needs of students and of the country then we must invest now in higher education. Access is something I worry deeply about to ensure that we are not leaving any talent behind. Data from the 2017 National Survey of Engagement indicates that 48% of first- and fourth-year undergrad students at York came from households where neither parent held a bachelor's degree. What's more, York's 2020 Economic and Social Impact Report revealed that 59% of students could not have attended university without financial support. Creating accessible educational opportunities for diverse learners to develop responsive skills is critical for a vibrant future workforce and for resilient communities. York and other universities in Canada have a good track record for this. At the same time, social mobility and productivity have been declining in Canada in recent years. Continuing to ensure that eligible students have access to university education, including at the graduate level, is imperative to address these trends. The significant numbers of Canadian students leaving the country to study medicine overseas while Canada is facing a significant gap in primary care physicians is just one example. These are troubling trends which Canadian universities are committed to addressing. Investing in universities While the commitment and innovation of universities is evident, the unfortunate truth is that universities across much of Canada have seen a steady decline in real dollar funding for years. In Ontario, recommendations from the government's blue-ribbon panel strongly advocated for the urgent increase in financial support for universities. To meet the changes in Canada's labor market, universities have developed new programs to meet the talent needs in areas such as science, technology, engineering and health. We have also worked to enhance access through flexible teaching formats and strengthened international and cross-sector research collaborations to tackle complex societal problems. Universities have also increased supports for students including activities to help them connect with careers and become more entrepreneurial and efficient. In short, universities in Canada are one of the country's most important assets. If we are to continue delivering the high-quality education for which we are known and serving the needs of the communities who rely on us, especially given fierce global competition for talent, it is essential that we secure a financially sustainable model for universities. Canada's high youth unemployment has many people anxious about how they will fare in a job market that bears a striking resemblance to the Hunger Games. Expanding employment opportunities is necessary and will require collaboration across all sectors. But the data are clear. A university education will provide our youth with a running start and the ability to adapt as they go.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2022/university-lecture.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1051232\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2022/university-lecture.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2022/university-lecture.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2022/university-lecture.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2022/university-lecture.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2022/university-lecture.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2022/university-lecture.jpg\" width=\"800\" height=\"530\" alt=\"university lecture\" title=\"Credit: Pixabay/CC0 Public Domain\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pixabay/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eAs we enter the holiday season, many young people are no doubt beginning to consider their future options. With a range of paths to pursue, a \u003ca href=\"https://www150.statcan.gc.ca/t1/tbl1/en/tv.action?pid=1410028703\u0026amp;pickMembers%5B0%5D=3.1\u0026amp;pickMembers%5B1%5D=4.2\u0026amp;cubeTimeFrame.startMonth=08\u0026amp;cubeTimeFrame.startYear=2024\u0026amp;referencePeriods=20240801%2C20240801\" target=\"_blank\"\u003ehigh rate of youth unemployment in Canada\u003c/a\u003e and a higher education sector \u003ca href=\"https://www.cbc.ca/news/canada/post-secondary-cuts-1.7387175\" target=\"_blank\"\u003efacing unprecedented challenges\u003c/a\u003e it may seem logical to wonder if university is worth it.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eIn my role as president of York University, I see these issues play out every day in the lives of my students and faculty. However, I can say with certainty that, yes, university is worth it for both students and society. And while you might think that I might be biased, there is real data to back it up.\u003c/p\u003e\n\u003cp\u003eSimply put, going to university enriches both students and society over the long term. We must ensure that students and universities are supported to help ensure as broad access as possible.\u003c/p\u003e\n\u003ch2\u003eLong-term benefits\u003c/h2\u003e\n\u003cp\u003eWhile many students entering the market fresh out of university will make entry-level wages, the reality is that \u003ca href=\"https://univcan.ca/media-room/publications/universities-help-canadians-get-ahead-quick-facts/\" target=\"_blank\"\u003eover the longer term their earning potential has more room to expand\u003c/a\u003e. Those with a bachelor\u0026#39;s degree earn 24% more than the national average. The more education, the higher the earning potential.\u003c/p\u003e\n\u003cp\u003eStudents with a university degree are more likely to have stable employment even amidst economic disruption, \u003ca href=\"https://www150.statcan.gc.ca/n1/daily-quotidien/221130/dq221130a-eng.htm\" target=\"_blank\"\u003eas the COVID-19 pandemic revealed\u003c/a\u003e. Graduates are also more likely to gain employment that offers a wider range of benefits. Simply put, an education increases one\u0026#39;s chances of finding fulfilling employment and living a longer and healthier life.\u003c/p\u003e\n\u003cp\u003eBeyond individual benefits, there are also key benefits to society. Canada \u003ca href=\"https://unesdoc.unesco.org/ark:/48223/pf0000377433/PDF/377433eng.pdf.multi\" target=\"_blank\"\u003erelies disproportionately on universities compared to other OECD countries to drive the research and innovation central to a productive and prosperous economy\u003c/a\u003e. Further \u003ca href=\"https://www.universityworldnews.com/post.php?story=20230117092112785\" target=\"_blank\"\u003eresearch has shown that education is central to a healthy, democratic society\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eTo quote Nelson Mandela: \u0026#34;\u003ca href=\"https://www.oxfordreference.com/display/10.1093/acref/9780191843730.001.0001/q-oro-ed5-00007046\" target=\"_blank\"\u003eeducation is the most powerful weapon which you can use to change the world\u003c/a\u003e.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe world faces a host of wicked problems ranging from economic inequality to \u003ca href=\"https://phys.org/tags/climate+change/\" rel=\"tag\"\u003eclimate change\u003c/a\u003e, geopolitical conflict and ongoing wars. Universities and graduates play a key role in addressing these challenges.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eTraining resilience\u003c/h2\u003e\n\u003cp\u003eTechnology is not going away and it is not slowing down.\u003c/p\u003e\n\u003cp\u003eA recent study revealed that the jobs of more than \u003ca href=\"https://www150.statcan.gc.ca/n1/pub/11f0019m/11f0019m2024005-eng.htm\" target=\"_blank\"\u003e60% of Canadians may be at risk to AI\u003c/a\u003e. Moreover, an estimated one out of 10 employees in Canada could be at a high risk of automation-related job redundancy. Canada\u0026#39;s already volatile job market will continue to be impacted.\u003c/p\u003e\n\u003cp\u003eThose with \u003ca href=\"https://www.oecd.org/en/publications/oecd-skills-outlook-2023_27452f29-en.html\" target=\"_blank\"\u003ehigher levels of education are the best equipped to benefit from technologies in ways that complement the work they do\u003c/a\u003e. Graduates are also more likely to have the transferable skills needed to withstand workforce disruption.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.oecd-ilibrary.org/employment/what-skills-and-abilities-can-automation-technologies-replicate-and-what-does-it-mean-for-workers_646aad77-en\" target=\"_blank\"\u003eAccording to the OECD\u003c/a\u003e, AI technologies pose less of a risk for highly-skilled workers. In fact, their jobs are less likely to be replaced by automation because they possess the critical thinking skills needed to provide oversight to tasks that use AI and automation. While these technologies are sophisticated and becoming even more so each day, they currently cannot replicate human cognitive, critical and decision-making skills.\u003c/p\u003e\n\u003cp\u003eThere is also compelling research that shows \u003ca href=\"https://www.researchgate.net/publication/350341650_Understanding_Factors_that_Influence_Upskilling\" target=\"_blank\"\u003estudents with higher education are more likely to pursue continuing education\u003c/a\u003e to upgrade and reskill, a quality that makes students more agile in a shifting labor market.\u003c/p\u003e\n\u003cp\u003eUniversities have also been increasing \u003ca href=\"https://www.ontario.ca/page/micro-credentials-ontarios-postsecondary-schools\" target=\"_blank\"\u003emicro-credentials\u003c/a\u003e, programs which help learners re-skill while they are holding employment and balancing familial obligations, to support lifelong learning and build a more resilient Canadian workforce.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eEnsuring access\u003c/h2\u003e\n\u003cp\u003eIf Canada is to meet the expanding needs of students and of the country then we must invest now in \u003ca href=\"https://phys.org/tags/higher+education/\" rel=\"tag\"\u003ehigher education\u003c/a\u003e. Access is something I worry deeply about to ensure that we are not leaving any talent behind.\u003c/p\u003e\n\u003cp\u003eData from the \u003ca href=\"https://oipa.info.yorku.ca/files/2019/04/NSSE17-Snapshot-York.pdf\" target=\"_blank\"\u003e2017 National Survey of Engagement\u003c/a\u003e indicates that 48% of first- and fourth-year undergrad students at York came from households where neither parent held a bachelor\u0026#39;s degree. What\u0026#39;s more, York\u0026#39;s \u003ca href=\"https://www.yorku.ca/economic-social-impact-report/wp-content/uploads/sites/279/2021/01/York-University-ESIR-2020-Summary-Report.pdf\" target=\"_blank\"\u003e2020 Economic and Social Impact Report\u003c/a\u003e revealed that 59% of students could not have attended university without \u003ca href=\"https://phys.org/tags/financial+support/\" rel=\"tag\"\u003efinancial support\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCreating accessible educational opportunities for diverse learners to develop responsive skills is critical for a vibrant future workforce and for resilient communities. York and other universities in Canada have a good track record for this.\u003c/p\u003e\n\u003cp\u003eAt the same time, \u003ca href=\"https://www150.statcan.gc.ca/n1/pub/11f0019m?11f0019m2021001-eng.pdf\" target=\"_blank\"\u003esocial mobility and productivity have been declining in Canada in recent years\u003c/a\u003e. Continuing to ensure that eligible students have access to university education, including at the graduate level, is imperative to address these trends. The significant numbers of Canadian \u003ca href=\"https://www.cbc.ca/news/health/too-many-canadians-studying-medicine-overseas-1.993980\" target=\"_blank\"\u003estudents leaving the country to study medicine overseas while Canada is facing a significant gap in primary care physicians is just one example\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThese are troubling trends which Canadian universities are committed to addressing.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eInvesting in universities\u003c/h2\u003e\n\u003cp\u003eWhile the commitment and innovation of universities is evident, the unfortunate truth is that universities across much of Canada have seen a steady decline in real dollar funding for years.\u003c/p\u003e\n\u003cp\u003eIn Ontario, \u003ca href=\"https://files.ontario.ca/mcu-ensuring-financial-sustainability-for-ontarios-postsecondary-sector-en-2023-11-14.pdf\" target=\"_blank\"\u003erecommendations from the government\u0026#39;s blue-ribbon panel strongly advocated for the urgent increase in financial support for universities\u003c/a\u003e. To meet the changes in Canada\u0026#39;s labor market, \u003ca href=\"https://files.ontario.ca/mcu-ensuring-financial-sustainability-for-ontarios-postsecondary-sector-en-2023-11-14.pdf\" target=\"_blank\"\u003euniversities have developed new programs to meet the talent needs in areas such as science, technology, engineering and health\u003c/a\u003e. We have also worked to enhance access through flexible teaching formats and \u003ca href=\"https://www.canada.ca/en/innovation-science-economic-development/news/2024/09/government-of-canada-announces-support-for-over-6900-top-tier-researchers-projects-and-infrastructure-across-the-country.html\" target=\"_blank\"\u003estrengthened international and cross-sector research collaborations to tackle complex societal problems\u003c/a\u003e. Universities have also \u003ca href=\"https://ontariosuniversities.ca/news/preparing-students-to-graduate-job-ready-and-resilient/\" target=\"_blank\"\u003eincreased supports for students including activities to help them connect with careers and become more entrepreneurial and efficient\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn short, universities in Canada are one of the country\u0026#39;s most important assets. If we are to continue delivering the high-quality education for which we are known and serving the needs of the communities who rely on us, especially given fierce global competition for talent, it is essential that we secure a financially sustainable model for universities.\u003c/p\u003e\n\u003cp\u003eCanada\u0026#39;s high youth unemployment has many people anxious about how they will fare in a job market that bears a striking resemblance to the Hunger Games. Expanding employment opportunities is necessary and will require collaboration across all sectors. But the data are clear. A university education will provide our youth with a running start and the ability to adapt as they go.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                                    \n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-26T17:10:01-05:00",
  "modifiedTime": null
}
