{
  "id": "88c56c43-eeed-4339-8a6f-1de73c4a2830",
  "title": "Full-bodied cheese flavor quickly and efficiently",
  "link": "https://www.sciencedaily.com/releases/2024/10/241022104657.htm",
  "description": "Peptides formed during cheese ripening are crucial for the full-bodied flavor of aged cheeses, known as kokumi. A research team led by the Leibniz-Institute for Food Systems Biology at the Technical University of Munich has now developed a new method to analyze these flavor-relevant peptides precisely, quickly, and efficiently. Based on more than 120 cheese samples, the team has also created a database that can be used in the future to predict flavor development during cheese ripening.",
  "author": "",
  "published": "Tue, 22 Oct 2024 10:46:57 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3466,
  "excerpt": "Peptides formed during cheese ripening are crucial for the full-bodied flavor of aged cheeses, known as kokumi. A research team led by the Leibniz-Institute for Food Systems Biology at the Technical University of Munich has now developed a new method to analyze these flavor-relevant peptides precisely, quickly, and efficiently. Based on more than 120 cheese samples, the team has also created a database that can be used in the future to predict flavor development during cheese ripening.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Peptides formed during cheese ripening are crucial for the full-bodied flavor of aged cheeses, known as kokumi. A research team led by the Leibniz-Institute for Food Systems Biology at the Technical University of Munich has now developed a new method to analyze these flavor-relevant peptides precisely, quickly, and efficiently. Based on more than 120 cheese samples, the team has also created a database that can be used in the future to predict flavor development during cheese ripening. The term kokumi derives from Japanese and refers to a full-bodied and long-lasting taste experience. The taste impression is particularly pronounced in aged cheeses, mainly due to the increasing concentration of gamma-glutamyl dipeptides. These are small molecules that consist of a link between glutamic acid and another amino acid. Depending on how the two amino acids are linked, researchers distinguish between gamma-, alpha-, and X-glutamyl dipeptides, with the latter two not contributing to the kokumi effect. The high polarity of the glutamyl dipeptides, as well as their great structural similarity with different flavor contributions, represent a major challenge for food analysis. Efficient analysis method developed Nevertheless, the team led by principal investigator Andreas Dunkel of the Leibniz Institute has succeeded in developing a new efficient analysis method based on ultra-high performance liquid chromatography-mass spectrometry. For the first time, it can precisely and selectively determine the concentrations of all 56 gamma-glutamyl dipeptide variants in just 22 minutes. Optimized sample preparation makes it possible to analyze 60 cheese samples per day. \"This is a significant improvement compared to other methods. Our tests have shown that our method is faster, more efficient, and yet reliable -- it delivers reproducible results and detects even the smallest concentrations,\" says first author Sonja Maria Fröhlich, a doctoral student at the Leibniz Institute. To further investigate the influence of ripening time on gamma-glutamyl dipeptide concentrations, the researchers applied the method to 122 cheese samples from Europe and the USA after the test phase. The ripening times of the cheese ranged from two weeks to 15 years. Mold cultures accelerate flavor development The results show that, as expected, the concentrations of glutamyl dipeptides increase with increasing ripeness. \"Interestingly, the addition of blue and white mold cultures led to significantly higher gamma-glutamyl dipeptide concentrations, even at shorter ripening times,\" says Andreas Dunkel, who heads the Integrative Food Systems Analysisresearch group at the Leibniz Institute. The food chemist adds: \"The concentration profiles we have determined for different stages of ripening and different types of cheese can be used in the future as a database for prediction models. The latter could, for example, be used to objectively monitor flavor development during cheese ripening, to shorten ripening times, or to develop new plant-based cheese products with high consumer acceptance.\" \"In the sense of an interdisciplinary, food systems biology research approach, one of our goals is to combine analytical research results with bioinformatic methods to develop predictive models suitable to support sustainable food production. This is also the starting point of the project led by Andreas Dunkel,\" concludes Veronika Somoza, director of the Leibniz Institute.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003ePeptides formed during cheese ripening are crucial for the full-bodied flavor of aged cheeses, known as kokumi. A research team led by the Leibniz-Institute for Food Systems Biology at the Technical University of Munich has now developed a new method to analyze these flavor-relevant peptides precisely, quickly, and efficiently. Based on more than 120 cheese samples, the team has also created a database that can be used in the future to predict flavor development during cheese ripening.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe term kokumi derives from Japanese and refers to a full-bodied and long-lasting taste experience. The taste impression is particularly pronounced in aged cheeses, mainly due to the increasing concentration of gamma-glutamyl dipeptides. These are small molecules that consist of a link between glutamic acid and another amino acid.\u003c/p\u003e\n\u003cp\u003eDepending on how the two amino acids are linked, researchers distinguish between gamma-, alpha-, and X-glutamyl dipeptides, with the latter two not contributing to the kokumi effect. The high polarity of the glutamyl dipeptides, as well as their great structural similarity with different flavor contributions, represent a major challenge for food analysis.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEfficient analysis method developed\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNevertheless, the team led by principal investigator Andreas Dunkel of the Leibniz Institute has succeeded in developing a new efficient analysis method based on ultra-high performance liquid chromatography-mass spectrometry. For the first time, it can precisely and selectively determine the concentrations of all 56 gamma-glutamyl dipeptide variants in just 22 minutes. Optimized sample preparation makes it possible to analyze 60 cheese samples per day.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is a significant improvement compared to other methods. Our tests have shown that our method is faster, more efficient, and yet reliable -- it delivers reproducible results and detects even the smallest concentrations,\u0026#34; says first author Sonja Maria Fröhlich, a doctoral student at the Leibniz Institute. To further investigate the influence of ripening time on gamma-glutamyl dipeptide concentrations, the researchers applied the method to 122 cheese samples from Europe and the USA after the test phase. The ripening times of the cheese ranged from two weeks to 15 years.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMold cultures accelerate flavor development\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe results show that, as expected, the concentrations of glutamyl dipeptides increase with increasing ripeness. \u0026#34;Interestingly, the addition of blue and white mold cultures led to significantly higher gamma-glutamyl dipeptide concentrations, even at shorter ripening times,\u0026#34; says Andreas Dunkel, who heads the Integrative Food Systems Analysisresearch group at the Leibniz Institute.\u003c/p\u003e\n\u003cp\u003eThe food chemist adds: \u0026#34;The concentration profiles we have determined for different stages of ripening and different types of cheese can be used in the future as a database for prediction models. The latter could, for example, be used to objectively monitor flavor development during cheese ripening, to shorten ripening times, or to develop new plant-based cheese products with high consumer acceptance.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;In the sense of an interdisciplinary, food systems biology research approach, one of our goals is to combine analytical research results with bioinformatic methods to develop predictive models suitable to support sustainable food production. This is also the starting point of the project led by Andreas Dunkel,\u0026#34; concludes Veronika Somoza, director of the Leibniz Institute.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
