{
  "id": "8aa7d703-c36c-40ed-b56f-8120a864451d",
  "title": "Computational method works backwards from observations to track down river polluters",
  "link": "https://phys.org/news/2024-10-method-track-river-polluters.html",
  "description": "A new computational method developed by researchers at the University of Oxford and Imperial College London uses an innovative new technique to track down the sources of river pollutants. The method can work backwards from observations of polluted river water—making it a simple approach that could be scaled up nationwide.",
  "author": "",
  "published": "Thu, 17 Oct 2024 17:06:05 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Environment"
  ],
  "byline": "University of Oxford",
  "length": 8644,
  "excerpt": "A new computational method developed by researchers at the University of Oxford and Imperial College London uses an innovative new technique to track down the sources of river pollutants. The method can work backwards from observations of polluted river water—making it a simple approach that could be scaled up nationwide.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Screenshots of www.sewagemap.co.uk focusing on rivers around Oxford. The brown lines are rivers and streams downstream of recent sewage spills. Taken on 10 October 2024 after a period of wet weather. Credit: Alex Lipp. A new computational method developed by researchers at the University of Oxford and Imperial College London uses an innovative new technique to track down the sources of river pollutants. The method can work backwards from observations of polluted river water—making it a simple approach that could be scaled up nationwide. In a case study, the model identified the source of a harmful neonicotinoid pesticide—banned for agricultural use- in a rare chalk stream habitat. Oxford researchers have also developed www.sewagemap.co.uk, a popular tool widely used by members of the public to identify sewage-polluted rivers in real time. Recent months have seen national outcry over water companies allowing sewage pollution in rivers to breach acceptable limits. Combined with pollution from agricultural fertilizers and chemicals, this has led to only 14% of rivers in England currently meeting 'good' ecological status. But to date, there has been no robust method to identify the likely sources of river pollution, making it almost impossible to effectively address the problem. A research study co-authored by scientists at the University of Oxford now provides a new approach. This utilizes \"inverse modeling,\" which works backwards from observations of pollution in rivers, tracing them back to the probable source. The paper is published in the journal Science of The Total Environment. This is in contrast to current 'forward modeling' methods, which start from an assumed set of pollution sources and run forwards to estimate the eventual distribution and reach of the pollutants. However, this has several critical flaws—namely, that the potential sources need to be known in advance, and it is often based on large assumptions and uncertain data. Study co-lead Dr. Alex Lipp (Department of Earth Sciences \u0026 Merton College, University of Oxford) said, \"The first step to mitigating a polluted river is working out where the problem is. These new mathematical 'inverse' methods provide an objective way to determine where and how pollutants enter river networks from monitoring data alone.\" The new technique was tested on the River Wandle, a chalk stream in southwest London which has prompted local outrage over recent sewage dumping. Recently, the neonicotinoid pesticide imidacloprid was detected in the river Wandle despite it being illegal to use on fields in the UK since 2018. Using the new inverse modeling, the researchers concluded that, overwhelmingly, the imidacloprid in the River Wandle comes from one small part of the river that contains the out-flow of a sewage treatment works. Co-lead author Dr. Gareth Roberts (Department of Earth Science \u0026 Engineering, Imperial College London) said, \"This supports the idea that imidacloprid in our rivers can originate from its use as pet medication, entering sewage systems after being washed down drains and evading removal at wastewater treatment facilities.\" A video demonstration of SewageMap Citizens called on to become 'river wardens' Having demonstrated the power of the inverse-modeling approach, Dr. Lipp is keen to see it scaled up and ultimately become a key part of the future of water quality monitoring. \"One application of this approach I'm very interested in is the analysis of citizen science data\" Dr. Lipp added. \"Citizen campaign groups are now frequently generating fantastic high-density datasets of pollutants such as phosphorous and nitrate in rivers, and this inverse approach could be used to turn this data into actionable insights.\" Citizen data has already been used as part of the national river campaigns. For instance, water quality testing by River Action citizen scientists found high levels of E.coli bacteria along the River Thames ahead of the Henley Royal Regatta. This new modeling approach could equip volunteer 'river guardians' to take more targeted actions against polluters. CEO of River Action James Wallace said, \"Repeat offenders like the water companies and industrial-scale agriculture often try to pass the buck, blaming others for the muck they allow to freely enter our rivers. But modeling approaches such as this new algorithm could ultimately empower a legion of citizen scientists up and down the UK to pin-point sources of pollution, leaving the perpetrators nowhere to hide.\" \"The potential of new methods and citizen science must now be further explored by the Environment Agency in their prosecutions of polluters and subsequent penalties, matched by proper government funding in the upcoming Budget to empower the regulator to enforce the law. Improving the power of pollution monitoring sends a powerful message—pollute at your peril and not for profit.\" Making a difference with data The new study builds on Dr. Lipp's data-driven approach to tackling the 'river crisis.\" In 2023, with his collaborator Jonathan Dawe, at the British Antarctic Survey, he developed www.sewagemap.co.uk, a free, open-source website which shows real-time information about river sections that might be affected by untreated sewage discharges in the Thames Basin. This is done using a model which links real-time sewage outflows to the downstream sections of the river. The website is already popular with wild swimming groups, and citizen scientists, who use it to identify local rivers that are being polluted with sewage in real-time. Jeremy Watson, an outdoor swimmer in London who uses SewageMap regularly said, \"With SewageMap, it is easy to get a reasonable estimate of the state of sewage in a river at a particular spot for the day you want to swim. For instance, I checked it after a sunny week, and it showed only one spill, 90km upstream, so I went for a nice swim near Hampton Court Palace. \"When I looked again after a couple of wet days it showed there were suddenly dozens of upstream sewage spills—so I went to the pool instead! It's a great privilege to find something which goes so far in meeting a public need for presenting information in a very accessible way. For me, it is also great to see that the software is made openly available by a team with the energy and enthusiasm to welcome new contributors.\" The model underlying Sewage Map is based on public data released by Thames Water on sewage discharges. Because no other water companies make this information accessible at present, the model can't yet be scaled up to the rest of the UK. Dr. Lipp concluded, \"This is why it is so important that water companies follow the lead of Thames Water, releasing environmental data in an accessible format for the public, and scientists, to use.\" The case study on the River Wandle, \"Using convex optimization to efficiently apportion tracer and pollutant sources from point concentration observations,\" has been published in Water Resources Research. More information: Kajetan Chrapkiewicz et al, Apportioning sources of chemicals of emerging concern along an urban river with inverse modelling, Science of The Total Environment (2024). DOI: 10.1016/j.scitotenv.2024.172827 Richard Barnes et al, Using Convex Optimization to Efficiently Apportion Tracer and Pollutant Sources From Point Concentration Observations, Water Resources Research (2024). DOI: 10.1029/2023WR036159 Citation: Computational method works backwards from observations to track down river polluters (2024, October 17) retrieved 17 October 2024 from https://phys.org/news/2024-10-method-track-river-polluters.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2024/new-computational-meth-3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/new-computational-meth-3.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2024/new-computational-meth-3.jpg\" data-sub-html=\"Screenshots of www.sewagemap.co.uk focusing on rivers around Oxford. The brown lines are rivers and streams downstream of recent sewage spills. Taken on 10 October 2024 after a period of wet weather. Credit: Alex Lipp.\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/new-computational-meth-3.jpg\" alt=\"New computational method could prove game-changer in tracking down river polluters\" title=\"Screenshots of www.sewagemap.co.uk focusing on rivers around Oxford. The brown lines are rivers and streams downstream of recent sewage spills. Taken on 10 October 2024 after a period of wet weather. Credit: Alex Lipp.\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Screenshots of www.sewagemap.co.uk focusing on rivers around Oxford. The brown lines are rivers and streams downstream of recent sewage spills. Taken on 10 October 2024 after a period of wet weather. Credit: Alex Lipp.\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eA new computational method developed by researchers at the University of Oxford and Imperial College London uses an innovative new technique to track down the sources of river pollutants. The method can work backwards from observations of polluted river water—making it a simple approach that could be scaled up nationwide.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn a case study, the model identified the source of a harmful neonicotinoid pesticide—banned for agricultural use- in a rare chalk stream habitat. Oxford researchers have also developed \u003ca href=\"http://www.sewagemap.co.uk\" target=\"_blank\"\u003ewww.sewagemap.co.uk,\u003c/a\u003e a popular tool widely used by members of the public to identify sewage-polluted rivers in real time.\u003c/p\u003e\n\u003cp\u003eRecent months have seen \u003ca href=\"https://www.theguardian.com/environment/2024/mar/27/water-companies-in-england-face-outrage-over-record-sewage-discharges\" target=\"_blank\"\u003enational outcry\u003c/a\u003e over water companies allowing sewage pollution in rivers to breach acceptable limits. Combined with pollution from agricultural fertilizers and chemicals, this has led to only 14% of rivers in England currently meeting \u0026#39;good\u0026#39; ecological status. But to date, there has been no robust method to identify the likely sources of river pollution, making it almost impossible to effectively address the problem.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0048969724029747\" target=\"_blank\"\u003eA research study\u003c/a\u003e co-authored by scientists at the University of Oxford now provides a new approach. This utilizes \u0026#34;inverse modeling,\u0026#34; which works backwards from observations of pollution in rivers, tracing them back to the probable source. The paper is published in the journal \u003ci\u003eScience of The Total Environment\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eThis is in contrast to current \u0026#39;forward modeling\u0026#39; methods, which start from an assumed set of pollution sources and run forwards to estimate the eventual distribution and reach of the pollutants. However, this has several critical flaws—namely, that the potential sources need to be known in advance, and it is often based on large assumptions and uncertain data.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eStudy co-lead Dr. Alex Lipp (Department of Earth Sciences \u0026amp; Merton College, University of Oxford) said, \u0026#34;The first step to mitigating a polluted river is working out where the problem is. These new mathematical \u0026#39;inverse\u0026#39; methods provide an objective way to determine where and how pollutants enter river networks from monitoring data alone.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe new technique was tested on the River Wandle, a chalk stream in southwest London \u003ca href=\"https://wandlefilm.co.uk/\" target=\"_blank\"\u003ewhich has prompted local outrage over recent sewage dumping\u003c/a\u003e. Recently, \u003ca href=\"https://phys.org/news/2023-09-river-sampling-impact-covid-pandemic.html\"\u003ethe neonicotinoid pesticide imidacloprid was detected in the river Wandle\u003c/a\u003e despite it being illegal to use on fields in the UK since 2018.\u003c/p\u003e\n\u003cp\u003eUsing the new inverse modeling, the researchers concluded that, overwhelmingly, the imidacloprid in the River Wandle comes from one small part of the river that contains the out-flow of a sewage treatment works.\u003c/p\u003e\n\u003cp\u003eCo-lead author Dr. Gareth Roberts (Department of Earth Science \u0026amp; Engineering, Imperial College London) said, \u0026#34;This supports \u003ca href=\"https://phys.org/news/2024-02-handwashing-major-source-pet-pesticide.html\"\u003ethe idea that imidacloprid in our rivers can originate from its use as pet medication\u003c/a\u003e, entering sewage systems after being washed down drains and evading removal at wastewater treatment facilities.\u0026#34;\u003c/p\u003e\n\u003cfigure itemscope=\"\" itemtype=\"http://schema.org/VideoObject\"\u003e\n    \u003cmeta itemprop=\"name\" content=\"New computational method could prove game-changer in tracking down river polluters\"/\u003e\n    \u003cmeta itemprop=\"url\" content=\"https://www.youtube.com/watch/?v=oWuVbmzKOrU\"/\u003e\n    \u003cmeta itemprop=\"description\" content=\"A video demonstration of SewageMap\"/\u003e\n    \u003cmeta itemprop=\"uploadDate\" content=\"2024-10-17T04:28:23-04:00\"/\u003e    \n        \u003cmeta itemprop=\"embedUrl\" content=\"https://www.youtube.com/embed/oWuVbmzKOrU\"/\u003e\n    \u003cmeta itemprop=\"thumbnailUrl\" content=\"https://img.youtube.com/vi/oWuVbmzKOrU/maxresdefault.jpg\"/\u003e\n         \u003cp\u003e\n             \u003ciframe src=\"https://www.youtube.com/embed/oWuVbmzKOrU?color=white\" loading=\"lazy\" frameborder=\"0\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n         \u003c/p\u003e\n        \u003cfigcaption itemprop=\"caption\"\u003eA video demonstration of SewageMap\u003c/figcaption\u003e  \n\u003c/figure\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eCitizens called on to become \u0026#39;river wardens\u0026#39;\u003c/h2\u003e\n\u003cp\u003eHaving demonstrated the power of the inverse-modeling approach, Dr. Lipp is keen to see it scaled up and ultimately become a key part of the future of water quality monitoring.\u003c/p\u003e\n\u003cp\u003e\u0026#34;One application of this approach I\u0026#39;m very interested in is the analysis of citizen science data\u0026#34; Dr. Lipp added. \u0026#34;Citizen campaign groups are now frequently generating fantastic high-density datasets of pollutants such as phosphorous and nitrate in rivers, and this inverse approach could be used to turn this data into actionable insights.\u0026#34;\u003c/p\u003e\n\u003cp\u003eCitizen data has already been used as part of the national river campaigns. \u003ca href=\"https://riveractionuk.com/very-high-e-coli-levels-discovered-on-thames-ahead-of-henley-royal-regatta/\" target=\"_blank\"\u003eFor instance, water quality testing by River Action citizen scientists found high levels of E.coli bacteria along the River Thames ahead of the Henley Royal Regatta\u003c/a\u003e. This new modeling approach could equip volunteer \u0026#39;river guardians\u0026#39; to take more targeted actions against polluters.\u003c/p\u003e\n\u003cp\u003eCEO of \u003ca href=\"https://riveractionuk.com/\" target=\"_blank\"\u003eRiver Action\u003c/a\u003e James Wallace said, \u0026#34;Repeat offenders like the water companies and industrial-scale agriculture often try to pass the buck, blaming others for the muck they allow to freely enter our rivers. But modeling approaches such as this new algorithm could ultimately empower a legion of citizen scientists up and down the UK to pin-point sources of pollution, leaving the perpetrators nowhere to hide.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;The potential of new methods and citizen science must now be further explored by the Environment Agency in their prosecutions of polluters and subsequent penalties, matched by proper government funding in the upcoming Budget to empower the regulator to enforce the law. Improving the power of pollution monitoring sends a powerful message—pollute at your peril and not for profit.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eMaking a difference with data\u003c/h2\u003e\n\u003cp\u003eThe new study builds on Dr. Lipp\u0026#39;s data-driven approach to tackling the \u0026#39;river crisis.\u0026#34; In 2023, with his collaborator Jonathan Dawe, at the British Antarctic Survey, he developed \u003ca href=\"http://www.sewagemap.co.uk\" target=\"_blank\"\u003ewww.sewagemap.co.uk\u003c/a\u003e, a free, open-source website which shows real-time information about river sections that might be affected by untreated sewage discharges in the Thames Basin.\u003c/p\u003e\n\u003cp\u003eThis is done using a model which links real-time sewage outflows to the downstream sections of the river. The website is already popular with wild swimming groups, and citizen scientists, who use it to identify local rivers that are being polluted with sewage in real-time.\u003c/p\u003e\n\u003cp\u003eJeremy Watson, an outdoor swimmer in London who uses SewageMap regularly said, \u0026#34;With SewageMap, it is easy to get a reasonable estimate of the state of sewage in a river at a particular spot for the day you want to swim. For instance, I checked it after a sunny week, and it showed only one spill, 90km upstream, so I went for a nice swim near Hampton Court Palace.\u003c/p\u003e\n\u003cp\u003e\u0026#34;When I looked again after a couple of wet days it showed there were suddenly dozens of upstream sewage spills—so I went to the pool instead! It\u0026#39;s a great privilege to find something which goes so far in meeting a public need for presenting information in a very accessible way. For me, it is also great to see that the software is made openly available by a team with the energy and enthusiasm to welcome new contributors.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe model underlying Sewage Map is based on public data released by Thames Water on sewage discharges. Because no other water companies make this information accessible at present, the model can\u0026#39;t yet be scaled up to the rest of the UK. Dr. Lipp concluded, \u0026#34;This is why it is so important that water companies follow the lead of Thames Water, releasing environmental data in an accessible format for the public, and scientists, to use.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe case study on the River Wandle, \u0026#34;Using convex optimization to efficiently apportion tracer and pollutant sources from point concentration observations,\u0026#34; has been \u003ca href=\"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036159\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eWater Resources Research\u003c/i\u003e.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tKajetan Chrapkiewicz et al, Apportioning sources of chemicals of emerging concern along an urban river with inverse modelling, \u003ci\u003eScience of The Total Environment\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1016/j.scitotenv.2024.172827\" target=\"_blank\"\u003eDOI: 10.1016/j.scitotenv.2024.172827\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003eRichard Barnes et al, Using Convex Optimization to Efficiently Apportion Tracer and Pollutant Sources From Point Concentration Observations, \u003ci\u003eWater Resources Research\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1029/2023WR036159\" target=\"_blank\"\u003eDOI: 10.1029/2023WR036159\u003c/a\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tComputational method works backwards from observations to track down river polluters (2024, October 17)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 17 October 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-10-method-track-river-polluters.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-17T17:06:05-04:00",
  "modifiedTime": null
}
