{
  "id": "9adbcabb-468c-428f-9710-f119e1a20cd2",
  "title": "Clever trick to cook young stars detected for first time—astronomers highlight magnetic fields as the missing ingredient",
  "link": "https://phys.org/news/2024-12-clever-cook-young-stars-astronomers.html",
  "description": "The missing ingredient for cooking up stars in the same way you might steam your Christmas pudding has been spotted for the first time by astronomers. Much like a pressure cooker has a weight on top of its lid to keep the pressure in and get your festive dessert dense, moist and ready to eat, merging galaxies may need magnetic fields to create the ideal conditions for star formation.",
  "author": "",
  "published": "Thu, 19 Dec 2024 19:00:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Astronomy Astrobiology"
  ],
  "byline": "Royal Astronomical Society",
  "length": 5888,
  "excerpt": "The missing ingredient for cooking up stars in the same way you might steam your Christmas pudding has been spotted for the first time by astronomers. Much like a pressure cooker has a weight on top of its lid to keep the pressure in and get your festive dessert dense, moist and ready to eat, merging galaxies may need magnetic fields to create the ideal conditions for star formation.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Astronomers have found evidence of magnetic fields associated with a disc of gas and dust a few hundred light-years across deep inside a system of two merging galaxies known as Arp220 (pictured). Credit: NASA, ESA, the Hubble Heritage (STScl/AURA), ESA, Hubble Collaboration, and A. Evans (University of Virginia, Charlottesville/NRAO/Stony Brook University) The missing ingredient for cooking up stars in the same way you might steam your Christmas pudding has been spotted for the first time by astronomers. Much like a pressure cooker has a weight on top of its lid to keep the pressure in and get your festive dessert dense, moist and ready to eat, merging galaxies may need magnetic fields to create the ideal conditions for star formation. Until now, however, the existence of such a force had only been theorized rather than observed. An international team of researchers led by Imperial College astrophysicist Dr. David Clements found evidence of magnetic fields associated with a disk of gas and dust a few hundred light-years across deep inside a system of two merging galaxies known as Arp220. They say these regions could be the key to making the centers of interacting galaxies just right for cooking lots of hydrogen gas into young stars. This is because magnetic fields may be able to stop intense bursts of star formation in the cores of merging galaxies from effectively \"boiling over\" when the heat is turned up too high. A new paper revealing the discovery has been published in Monthly Notices of the Royal Astronomical Society. \"This is the first time we've found evidence of magnetic fields in the core of a merger,\" said Dr. Clements, \"but this discovery is just a starting point. We now need better models, and to see what's happening in other galaxy mergers.\" He gave a cooking analogy when explaining the role of magnetic fields in star formation. \"If you want to cook up a lot of stars (Christmas puddings) in a short period of time you need to squeeze lots of gas (or ingredients) together. This is what we see in the cores of mergers. But then, as the heat from young stars (or your cooker) builds, things can boil over, and the gas (or pudding mixture) gets dispersed,\" Dr. Clements said. \"To stop this happening, you need to add something to hold it all together—a magnetic field in a galaxy, or the lid and weight of a pressure cooker.\" Astronomers have long been looking for the magic ingredient that makes some galaxies form stars more efficiently than is normal. One of the issues about galaxy mergers is that they can form stars very quickly, in what is known as a starburst. This means they're behaving differently to other star-forming galaxies in terms of the relationship between star formation rate and the mass of stars in the galaxy—they seem to be turning gas into stars more efficiently than non-starburst galaxies. Astronomers are baffled as to why this happens. One possibility is that magnetic fields could act as an extra 'binding force' that holds the star-forming gas together for longer, resisting the tendency for the gas to expand and dissipate as it is heated by young, hot stars, or by supernovae as massive stars die. Theoretical models have previously suggested this, but the new observations are the first to show that magnetic fields are present in the case of at least one galaxy. Researchers used the Submillimeter Array (SMA) on Maunakea in Hawaii to probe deep inside the ultraluminous infrared galaxy Arp220. The SMA is designed to take images of light in wavelengths of about a millimeter—which lies at the boundary between infrared and radio wavelengths. This opens up a window to a wide range of astronomical phenomena including supermassive black holes and the birth of stars and planets. Arp220 is one of the brightest objects in the extragalactic far-infrared sky and is the result of a merger between two gas-rich spiral galaxies, which has triggered starbursting activity in the merger's nuclear regions. The extragalactic far-infrared sky is a cosmic background radiation made up of the integrated light from distant galaxies' dust emissions. About half of all starlight emerges at far-infrared wavelengths. The next step for the research team will be to use the Atacama Large Millimeter/submillimeter Array (ALMA)—the most powerful telescope for observing molecular gas and dust in the cool universe—to search for magnetic fields in other ultraluminous infrared galaxies. That is because the next brightest local ultraluminous infrared galaxy to Arp220 is a factor of four or more fainter. With their result, and further observations, the researchers hope the role of magnetic fields in some of the most luminous galaxies in the local universe will become much clearer. More information: Dave Clements et al, Polarized Dust Emission in Arp220: Magnetic Fields in the Core of an Ultraluminous Infrared Galaxy,Monthly Notices of the Royal Astronomical Society (2024) DOI: 10.1093/mnrasl/slae107 academic.oup.com/mnrasl/articl … .1093/mnrasl/slae107 Journal information: Monthly Notices of the Royal Astronomical Society",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/clever-trick-to-cook-s.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1191577\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2024/clever-trick-to-cook-s.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/clever-trick-to-cook-s.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/clever-trick-to-cook-s.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/clever-trick-to-cook-s.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/clever-trick-to-cook-s.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/clever-trick-to-cook-s.jpg\" width=\"800\" height=\"530\" alt=\"Clever trick to cook stars like Christmas puds detected for first time\" title=\"Astronomers have found evidence of magnetic fields associated with a disc of gas and dust a few hundred light-years across deep inside a system of two merging galaxies known as Arp220 (pictured). Credit: NASA, ESA, the Hubble Heritage (STScl/AURA), ESA, Hubble Collaboration, and A. Evans (University of Virginia, Charlottesville/NRAO/Stony Brook University)\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eAstronomers have found evidence of magnetic fields associated with a disc of gas and dust a few hundred light-years across deep inside a system of two merging galaxies known as Arp220 (pictured). Credit: NASA, ESA, the Hubble Heritage (STScl/AURA), ESA, Hubble Collaboration, and A. Evans (University of Virginia, Charlottesville/NRAO/Stony Brook University)\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eThe missing ingredient for cooking up stars in the same way you might steam your Christmas pudding has been spotted for the first time by astronomers. Much like a pressure cooker has a weight on top of its lid to keep the pressure in and get your festive dessert dense, moist and ready to eat, merging galaxies may need magnetic fields to create the ideal conditions for star formation.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eUntil now, however, the existence of such a force had only been theorized rather than observed.\u003c/p\u003e\n\u003cp\u003eAn international team of researchers led by Imperial College astrophysicist Dr. David Clements found evidence of magnetic fields associated with a disk of gas and dust a few hundred light-years across deep inside a system of two merging \u003ca href=\"https://phys.org/tags/galaxies/\" rel=\"tag\"\u003egalaxies\u003c/a\u003e known as Arp220.\u003c/p\u003e\n\u003cp\u003eThey say these regions could be the key to making the centers of interacting galaxies just right for cooking lots of hydrogen gas into \u003ca href=\"https://phys.org/tags/young+stars/\" rel=\"tag\"\u003eyoung stars\u003c/a\u003e. This is because magnetic fields may be able to stop intense bursts of \u003ca href=\"https://phys.org/tags/star+formation/\" rel=\"tag\"\u003estar formation\u003c/a\u003e in the cores of merging galaxies from effectively \u0026#34;boiling over\u0026#34; when the heat is turned up too high.\u003c/p\u003e\n\u003cp\u003eA new paper revealing the discovery has been \u003ca href=\"https://academic.oup.com/mnrasl/article-lookup/doi/10.1093/mnrasl/slae107\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eMonthly Notices of the Royal Astronomical Society\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This is the first time we\u0026#39;ve found evidence of magnetic fields in the core of a merger,\u0026#34; said Dr. Clements, \u0026#34;but this discovery is just a starting point. We now need better models, and to see what\u0026#39;s happening in other galaxy mergers.\u0026#34;\u003c/p\u003e\n\u003cp\u003eHe gave a cooking analogy when explaining the role of magnetic fields in star formation.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003e\u0026#34;If you want to cook up a lot of stars (Christmas puddings) in a short period of time you need to squeeze lots of gas (or ingredients) together. This is what we see in the cores of mergers. But then, as the heat from young stars (or your cooker) builds, things can boil over, and the gas (or pudding mixture) gets dispersed,\u0026#34; Dr. Clements said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;To stop this happening, you need to add something to hold it all together—a \u003ca href=\"https://phys.org/tags/magnetic+field/\" rel=\"tag\"\u003emagnetic field\u003c/a\u003e in a galaxy, or the lid and weight of a \u003ca href=\"https://phys.org/tags/pressure+cooker/\" rel=\"tag\"\u003epressure cooker\u003c/a\u003e.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAstronomers have long been looking for the magic ingredient that makes some galaxies form stars more efficiently than is normal.\u003c/p\u003e\n\u003cp\u003eOne of the issues about galaxy mergers is that they can form stars very quickly, in what is known as a starburst. This means they\u0026#39;re behaving differently to other star-forming galaxies in terms of the relationship between star formation rate and the mass of stars in the galaxy—they seem to be turning gas into stars more efficiently than non-starburst galaxies. Astronomers are baffled as to why this happens.\u003c/p\u003e\n\u003cp\u003eOne possibility is that magnetic fields could act as an extra \u0026#39;binding force\u0026#39; that holds the star-forming gas together for longer, resisting the tendency for the gas to expand and dissipate as it is heated by young, hot stars, or by supernovae as massive stars die.\u003c/p\u003e\n\u003cp\u003eTheoretical models have previously suggested this, but the new observations are the first to show that magnetic fields are present in the case of at least one galaxy.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eResearchers used the Submillimeter Array (SMA) on Maunakea in Hawaii to probe deep inside the ultraluminous infrared galaxy Arp220.\u003c/p\u003e\n\u003cp\u003eThe SMA is designed to take images of light in wavelengths of about a millimeter—which lies at the boundary between infrared and radio wavelengths. This opens up a window to a wide range of astronomical phenomena including supermassive black holes and the birth of stars and planets.\u003c/p\u003e\n\u003cp\u003eArp220 is one of the brightest objects in the extragalactic far-infrared sky and is the result of a merger between two gas-rich spiral galaxies, which has triggered starbursting activity in the merger\u0026#39;s nuclear regions.\u003c/p\u003e\n\u003cp\u003eThe extragalactic far-infrared sky is a \u003ca href=\"https://phys.org/tags/cosmic+background+radiation/\" rel=\"tag\"\u003ecosmic background radiation\u003c/a\u003e made up of the integrated light from distant galaxies\u0026#39; dust emissions. About half of all starlight emerges at far-infrared wavelengths.\u003c/p\u003e\n\u003cp\u003eThe next step for the research team will be to use the Atacama Large Millimeter/submillimeter Array (ALMA)—the most powerful telescope for observing molecular gas and dust in the cool universe—to search for magnetic fields in other ultraluminous infrared galaxies.\u003c/p\u003e\n\u003cp\u003eThat is because the next brightest local ultraluminous infrared galaxy to Arp220 is a factor of four or more fainter.\u003c/p\u003e\n\u003cp\u003eWith their result, and further observations, the researchers hope the role of magnetic fields in some of the most luminous galaxies in the local universe will become much clearer.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Dave Clements et al, Polarized Dust Emission in Arp220: Magnetic Fields in the Core of an Ultraluminous Infrared Galaxy,\u003ci\u003eMonthly Notices of the Royal Astronomical Society\u003c/i\u003e (2024) \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1093/mnrasl/slae107\" target=\"_blank\"\u003eDOI: 10.1093/mnrasl/slae107\u003c/a\u003e \u003ca href=\"https://academic.oup.com/mnrasl/article-lookup/doi/10.1093/mnrasl/slae107\" target=\"_blank\"\u003eacademic.oup.com/mnrasl/articl … .1093/mnrasl/slae107\u003c/a\u003e\n                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/monthly-notices-of-the-royal-astronomical-society/\"\u003eMonthly Notices of the Royal Astronomical Society\u003c/a\u003e\n                                                                                    \u003ca href=\"http://www.wiley.com/bw/journal.asp?ref=0035-8711\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-19T19:00:01-05:00",
  "modifiedTime": null
}
