{
  "id": "9bfd491e-e359-4b36-b75f-d1ee3907b915",
  "title": "Ignoring citizens’ privacy to build a centralized database and track people",
  "link": "https://flowingdata.com/2025/04/23/ignoring-citizens-privacy-to-build-a-centralized-database-and-track-people/",
  "description": "DOGE is taking agency data in an effort to compile a master database…Tags: DOGE, immigration, privacy, Wired",
  "author": "Nathan Yau",
  "published": "Wed, 23 Apr 2025 11:04:47 +0000",
  "source": "https://flowingdata.com/feed",
  "categories": [
    "Data Sharing",
    "DOGE",
    "immigration",
    "privacy",
    "Wired"
  ],
  "byline": "Nathan Yau",
  "length": 1297,
  "excerpt": "DOGE is taking agency data in an effort to compile a master database for tracking immigrants. For Wired, Makena Kelly and Vittoria Elliott break it down: While government agencies frequently share …",
  "siteName": "FlowingData",
  "favicon": "https://flowingdata.com/wp-content/uploads/2025/01/logo-lone-square512x512-210x210.png",
  "text": "DOGE is taking agency data in an effort to compile a master database for tracking immigrants. For Wired, Makena Kelly and Vittoria Elliott break it down: While government agencies frequently share data, this process is documented and limited to specific purposes, according to experts. Still, the consolidation appears to have administration buy-in: On March 20, President Trump signed an executive order requiring all federal agencies to facilitate “both the intra- and inter-agency sharing and consolidation of unclassified agency records.” DOGE officials and Trump administration agency leaders have also suggested centralizing all government data into one single repository. “As you think about the future of AI, in order to think about using any of these tools at scale, we gotta get our data in one place,” General Services Administration acting administrator Stephen Ehikian said in a town hall meeting on March 20. In an interview with Fox News in March, Airbnb cofounder and DOGE member Joe Gebbia asserted that this kind of data sharing would create an “Apple-like store experience” of government services. They’re taking what they want and discarding the rest. If this cycle continues, it doesn’t seem long before you or someone you know becomes a statistical error that can’t be fixed.",
  "image": "https://flowingdata.com/wp-content/uploads/2025/01/logo-lone-square512x512.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"single-post\"\u003e\n                                    \n                \u003cp\u003eDOGE is taking agency data in an effort to compile a master database for tracking immigrants. For Wired, \u003ca href=\"https://www.wired.com/story/doge-collecting-immigrant-data-surveil-track/?_sp=e9adc494-f8c7-4f7a-829f-a372923ac483.1745016079807\"\u003eMakena Kelly and Vittoria Elliott break it down\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eWhile government agencies frequently share data, this process is documented and limited to specific purposes, according to experts. Still, the consolidation appears to have administration buy-in: On March 20, President Trump signed an executive order requiring all federal agencies to facilitate “both the intra- and inter-agency sharing and consolidation of unclassified agency records.” DOGE officials and Trump administration agency leaders have also suggested centralizing all government data into one single repository. “As you think about the future of AI, in order to think about using any of these tools at scale, we gotta get our data in one place,” General Services Administration acting administrator Stephen Ehikian said in a town hall meeting on March 20. In an interview with Fox News in March, Airbnb cofounder and DOGE member Joe Gebbia asserted that this kind of data sharing would create an “Apple-like store experience” of government services.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eThey’re taking what they want and \u003ca href=\"https://flowingdata.com/2025/04/22/halt-of-data-collection-that-measures-american-society/\"\u003ediscarding the rest\u003c/a\u003e. If this cycle continues, it doesn’t seem long before you or someone you know becomes a statistical error that can’t be fixed.\u003c/p\u003e\n                \n                \n                                        \n            \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-23T11:04:47Z",
  "modifiedTime": "2025-04-21T19:59:54Z"
}
