{
  "id": "9e540b67-ab4f-4646-92ed-f36f3c9f97ec",
  "title": "A checklist for delivering the Sustainable Development Goals",
  "link": "https://www.nature.com/articles/d41586-024-02903-7",
  "description": "",
  "author": "Dom Byrne",
  "published": "2024-10-10",
  "source": "https://www.nature.com/nature.rss",
  "categories": null,
  "byline": "Byrne, Dom",
  "length": 31015,
  "excerpt": "SDG 17 offers an “enabling” blueprint for meeting ambitious targets, including measures to tackle poverty, hunger and climate change, says Kate Roll. SDG 17 offers an “enabling” blueprint for meeting ambitious targets, including measures to tackle poverty, hunger and climate change, says Kate Roll.",
  "siteName": "",
  "favicon": "https://www.nature.com/static/images/favicons/nature/apple-touch-icon-f39cb19454.png",
  "text": "Monica Contestabile 00:10Hello. This is How to Save Humanity in 17 Goals, a podcast brought to you by Nature Careers in partnership with Nature Sustainability.I am Monica Contestabile, chief editor of Nature Sustainability. This is the series where we meet the researchers working towards the Sustainable Development Goals agreed by the United Nations and world leaders in 2015.Since then, in a huge global effort, thousands of academics have been using those targets to tackle the biggest problems that the planet faces today.Each episode ends with a sponsored slot from La Trobe Institute for Sustainable Agriculture and Food in Melbourne, Australia, where we hear about how its researchers are focusing on the SDGs.In this episode, we look at the last Sustainable Development Goal, number 17: to strengthen the means of implementation and revitalize global partnerships.And we hear from an American scholar who proposes strategies to break down these goals into manageable missions in order to make them happen.Kate Roll: 01:33So I’m Dr Kate Roll. I’m a political scientist at the Institute for Innovation and Public Purpose at University College London in the United Kingdom.I have a really varied background, looking at everything from veterans and disarmament up to responsible business. But a lot of my current work is around systems change and the SDGs.And the research, the questions I'm interested in, really have to do with things like political economy, who gets what, and why. And increasingly, and very much tied to the SDGs, why does change happen? How and when does it happen? And an important part of my work is both my research, but I also lead the Masters of Public Administration program at my institute, and that’s what keeps me busy most days.So, SDG 17, Sustainable Development Goal 17, is the final sustainable development goal.And we sometimes talk about it as being an overarching goal, or a meta goal.It’s a convener or facilitator of all the 16 prior goals. And so SDG 17 is partnership for the goals. And it’s about strengthening the means of implementation and revitalizing global partnership for sustainable development.And sort of the key term for SDG 17 is partnership. And I think those of us who are academics, those of us who are interested in policy and practice, partnerships are absolutely essential for our work, both collaborations within academia, with people from other fields, but also partnerships with organizations, with political actors, with students, with civil society organizations. All of that is extremely important.Kate Roll: 03:25So SDG 17 is about partnership for the goals. And sort of the core principle, the core intuition, is that collaboration is needed to deal with complexity.You know, multi-stakeholder work is really important when you’ve got problems that themselves are unclear.So, you know, obesity. Is this the problem of food systems? Is this is the problem of transportation? Is this the problem of health? You know, what type of problem is this?You need multiple stakeholders to come around and work, work on these type of things. Also, when we’re working with uncertainty, when we’re working around innovation, you need to have lots of experimentation, lots of small bets.And with that kind of work, partnership is essential. So that kind of intuition or principle sits behind SDG 17.But if you lift up the lid, if you, if you look at actually the targets and indicators for SDG 17, it covers five really specific areas.So the first is finance, which has to do with revenue collection, aid, debt, base erosion and profit-shifting is a term we’re very interested in with finance. Do countries have enough money to pay for SDG work around education, health, etc?So finance is the first. We’re interested in technology, digital divide and technology, technological diffusion.Third is capacity building. Fourth is trade. And fifth are systemic issues with how to do things like policy coherence, And SDG 17 is pursued in two ways. One is primarily through global alliances and organizations that are led by governments. So things like the WTO, the World Trade Organization, the World Health Organization, and also partnership for goals on multiple levels.So again, these can be local, national, international partnerships. And finally, SDG 17, these are what are called means of implementation targets. About how we get there, rather than the destination, rather than the outcome.So we’re sort of measuring, “Are we raising enough money to do this?” Rather than saying what the outcome that we want is? So there's some concerns, actually, that the sort of means of getting there aren’t as closely tied to the outcomes as we want.But we’re again thinking about these means of implementation targets. What do we need to do to achieve the other 16 SDGs?Kate Roll: 05:57So I was born outside of Boston, grew up there, did my university at Brown University.But before I went to university, I had the opportunity to take a year out and work on a boat, and my sister had to pick my university courses.And I told her, “Put me into pre-med courses. I’m going to be a doctor.”And she looked at me, and she said, “No, you’re not going to be a doctor. You're going to be, you know, into something else.”So when I arrived back from from that year, and I arrived to my courses for the first year of Brown University, she’d put me in medical anthropology, not in pre-med courses. And that sort of started my my journey into social science, into thinking about power, thinking about conflict.I’d been living in Indonesia. So seeing people smuggling cigarettes over borders in these dugout canoes. You know, seeing this incredible world out there.And she really saw that, that’s what I was going to be interested in. So started to be interested in questions of of power, of politics, of culture, all of these things, and that started to inform my studies in international relations, in post-conflict transitions, being in these areas, you know, in Indonesia that had been post conflict, like Ache, or in Papua New Guinea, like Bougainville, seeing those up close.And then wanting to go back into the classroom and really understand what was going on. So that really, really informed my work. And then, you know, this interest in in people, in resources, in security that’s cut through all of these pieces, whether it's thinking about veterans in East Timor, or responsible business and and the poor in Kenya.Or thinking about, you know, do we have enough funding for education here in the UK? It all has sort of a similar question about resources, vulnerability, security, and how do we make this world better?Kate Roll: 07:59So, the big idea at UCL Institute for Innovation and Public Purpose is around bringing the state back in, around really honouring the state and thinking about its role in innovation.And we capture that idea. What we have on our tote bags, on our T shirts, is the slogan, “Innovation is political.”And I love that idea as a political scientist, but it cuts across, you know, economists are drawn to this idea. Designers are drawn to this idea. Everyone is. Innovation is political.And what we mean by that is that innovation is shaped by political processes and structures. It’s not just that the best idea or the best technology wins.You know, we illustrate that idea by thinking about something like, at the turn of the 20th century, there were more electric cars on the road than there were internal combustion engines.So why, why did that technology lose out? Was it a worse technology, or were there sort of political factors? So that’s one way of thinking about innovation is political.But we can also think about, you know, people can be involved in directing this process, right? We can make choices about where we want our future to go, where we want investment to go, in terms of technology, in terms of these sort of transformations that are so important, in light of the challenges captured by the SDGs, and particularly the climate emergency.And, you know, finally, this idea that power structures are involved. So this idea of “innovation is political” really drew me to IPP, this idea of rethinking the state and celebrating the state.I think the second idea that’s really associated with the Institute of Innovation and Public Purpose is the idea of missions and mission-oriented innovation. And this is idea that’s been championed and brought forward by Professor Mariana mazzucato, who’s the director of the Institute, and it’s a tool for thinking about innovation strategy that beds it in a challenge. Why do we want to have, you know, a competitive automotive sector? Well, we want sustainable and accessible mobility. What’s the purpose? Where are we trying to go? And so it reorients innovation strategy around a challenge. And those challenges can be drawn from the SDGs.So this question of, how do we make the SDG challenges manageable is such a good one. Because when we’re talking about the SDGs, we’re talking about the absolute biggest, most important problems of our day. We’re talking about health, we’re talking about poverty, we’re talking about oceans, soil, all of these things.For me as an academic, when I think about tackling the SDGs, I think of using a systems change lens. Sometimes we talk about critical systems heuristics, which is, just say, you know, a fancy way of saying, “How do we define the problem? How do we place a boundary around an issue in order to tackle it?” Because that’s one of the issues we see with the SDGs, is that they’re so big, they’re so difficult that, you know, how do we even get stuck in?So we can be thinking about a very narrow boundary where we’re talking about local food systems, local change, you know, how we deal with waste, or even thinking about much bigger national or international level systems, and drawing the boundary that way, and then thinking about, if we draw that big, wide and international boundary, who needs to be around the table in order to be thinking about doing this differently?And again, that’s where partnership, and where SDG 17 comes in. We draw this boundary, we think about the stakeholders within that boundary, and then we bring them together in order to really address the problem.There’s some really interesting work that’s been going on that’s been using the sort of systems change, using the sort of mission orientation, for doing that kind of kind of change and tackling SDGs.So there’s a great example from Sweden. Their Innovation Agency is called Vinnova.And they worked on trying to change food systems in Sweden, and their entry point was school feeding, which is such a smart way to do it, because it’s an area where their state is involved. It’s got children who are making new food habits.And they did this incredible program that involved consultation with hundreds of people, including political leaders.And then they’ve funded lots of different experiments all over the country around menus, around how the procurement is done, how the, even the cafeteria is organized.Lots of small bits, lots of small experiments, trying to think about how to shift this system. So this is a very innovative design-led approach to using a mission, to using a systems change approach to tackle something like the SDGs, where we’re thinking about health, we’re thinking about agriculture, we're thinking about partnering, we’re thinking about industry.All of these, these different SDGs are involved, but we also have missions like I mentioned before that deal on this much more international level, or again, focused on placing lots of bets on the development of different kinds of technologies.But the SDGs, they’re, you know, big, wooly, hairy goals, and I think there’s no way to go about them, except for thinking about who needs to be around the table in order to make change happen.So missions are a relatively new idea, and how they’re governed really varies by what level they're working on, whether it’s a city level, what’s an international level.And also what the goal is, is it about innovation driving more diverse and new innovation? Is it about social problems and social change?And so we've got a lot of diversity in who’s working and accordingly in how they're governed. I think what is important is that we’re seeing or we’re seeing some trends, we’re seeing some patterns of multiple-stakeholder engagement for governance of missions, both at the local level and on the international level.So for example, the Horizon Program, which is a really important EU-level initiative, they’ve got panels of experts that help to monitor and govern the missions that are being pursued as part of that project, which include things like climate, which include things like addressing cancer.And you also see that kind of highly-participatory approach coming with things like local missions, or with the example that I just gave of the Vinnova food system transformation, where they are doing lots of consultation, lots of partnership, and bringing in the stakeholders, bringing them into the room.And that really starts with the definition of what is the mission, what is important, but then also in terms of who’s involved in executing the mission, who are doing the the different projects that come together to advance that, that shared goal.And so, you know, we’re often thinking about things like flexibility, accountability, engagement. And then also building up the the capacity of the public sector to do this kind of work. Because this might be flexing new muscles on this type of collaboration, this type of co-creation might be new for for a lot of people.So yeah, those are, those are really important, but they’re all about, you know, bringing together folks around a bold, inspirational mission, and moving forward, moving towards that, that goal together.One example of a mission would be around addressing climate change. Again. SDG 13 is around climate, so you know, thinking about, how do we reduce the amount of carbon? How do we reduce the negative effects of climate change?And that big goal gets tied to a more specific mission, a more measurable mission, which, for example, could be 100 carbon-neutral cities in Europe by 2030.So you take that big overarching SDG, you know, SDG, 13, climate change, you bring it down to a measurable, achievable goal of 100 carbon-neutral cities, also still ambitious.And then you think about, “what would it take to get there? What would we need to do to have 100 carbon-neutral cities?”And it becomes really an interesting question, again, sort of a systems question, because you can’t just be thinking, “Oh, this is a transport problem,” or, “Oh, this is an energy problem.”You have to be thinking about the built environment, real estate, the materials that we’re using. You need to be thinking about people’s behaviour. You need to be thinking about the social sector. You’d be thinking about all these different pieces that maybe hadn't been part of a climate change discussion before.Crowd in the different actors. Think about all of those that need to be involved. And then once you've identified those sectors, whether it be real estate or construction or mobility or energy, then you think about, let's foster some experiments.Let's help them think about new ways of working that could again move us forward towards that, that goal of 100 carbon-neutral cities.So is that thinking about building reuse rather than building new? Is it thinking about new construction materials?Is it about electrifying buses or thinking about new ways of encouraging more cycling? You know, how can we do small-level experiments that all add up and push us towards towards that goal?And ultimately, you know, innovation theory talks about niche innovation, where you support something small, you foster it, and then hopefully it grows, and then becomes the norm, becomes part of what we call the regime. And so by placing lots of bets, by doing lots of experiments, you’re sort of seeding the future that allows for this, this greater change and these wonderful sort of cascades that can happen.So if we have the that big, chunky goal of preventing or mitigating climate change, we bring that down to the mission of 100 carbon-neutral cities, we identify the sectors, and then we run experiments, we run different projects that all advance that goal, bringing these sectors and bringing these actors together again through partnerships, very much in line with SDG 17.So it’s really interesting to reflect on this question of, “will SGG 17 be achieved?”Because, as we started out with, SGG 17 is sort of an enabling SDG. It’s not an outcome in and of itself. It’s about, you know, achieving the other SDGs.So you know, when we think about “Will SGG 17 be achieved. How do we know?” It almost will be, you know, if we are able to attack, you know, tackle poverty, if we are able to support education, if we are able to to improve gender equity, then we sort of know that we’ve been able to do SDG 17 as well, which, which involves resource mobilization, involves capacity, involves all these different enabling conditions.More technically, we can look at SDG 17 and the specific targets and indicators, and we can look at trends there.So, you know, we can already see things like a reduction in tariffs or increase in internet use, which are both, you know, targets within, within the SDG, but I think these are really proxies.These are really stand-ins for the really important factors that we're looking at, where we're saying people should have equal and equitable and useful access to technology that you know, the economy should work for people.So I’m actually less interested, or less focused on those specific targets or indicators, than the big important spirit of SDG 17, which is getting the tools and relationships and financing in place that allows the other SDGs to be unlocked and move forward.20:42: Monica ContestabileThanks for listening to this series, How to Save Humanity in 17 Goals.Join us again next time for a final bonus episode where we meet the Swedish graphic designer who devised the icons and messaging, and the whole communication package for the UN SDGs.But before we do, next up, we’ll hear our researchers at La Trobe Institute for Sustainable Agriculture and Food in Melbourne, Australia, the sponsor of this series, are working towards the targets set by the UN.Caris Bizzaca: 21:39I’m Caris Bizzaca, and welcome to this podcast series from the La Trobe Institute for Sustainable Agriculture and Food at La Trobe University in Australia. I would like to start by acknowledging the traditional custodians of the lands where La Trobe University campuses are located in Australia, and to pay respect to Aboriginal and Torres Strait Islander cultures, as well as to elders past, present and emerging.Across this six-episode series, you’ll hear from academics at the top of their fields as they discuss groundbreaking research happening at the La Trobe Institute for Sustainable Agriculture and Food, also known as LISAF. Through LISAF, La Trobe has developed a holistic approach to food security, and this ‘paddock-to-gut’ philosophy is delivering innovative research and significant academic and industry partnerships across the entire value chain.Its success so far can already be seen in the Times Higher Education Impact Rankings, which measure university performance against the United Nations’ 17 Sustainable Development Goals, or SDGs. In 2024, La Trobe was ranked first in Australia and fifth globally for SDG 2: Zero Hunger.Now, stay tuned to hear first-hand about the research of LISAF as it delivers innovative solutions for sustainable and nutritious food production in a resource and climate-constrained world.Lauren Rickards: 23:04The climate is well and truly changing. It’s changing at a very rapid rate, faster than expected, and the impacts are starting to accumulate and intersect.Caris Bizzaca: 23:14That is Lauren Rickards, Professor of Climate Change Adaptation and Director of the La Trobe Climate Change Adaptation Lab at La Trobe University in Victoria.Lauren Rickards: 23:24I’ve got a cross-disciplinary background, but particularly geography. That means I’ve come from a social science perspective, and what we look at is the impacts of climate change on different forms of work, including trying to respond to disasters, understand climate change and do the hard work of greenhouse-gas mitigation and adapting to future climates.So, this is very, very urgent in the sense that if we don’t get our heads around this, the window of opportunity to be able to work out what we need to do – and to do it effectively – is going to close, and we’ll end up in just some kind of permanent disaster-response mode.Caris Bizzaca: 24:02The good news is that tackling this area of research is a priority for the Australian government. The 2023–24 budget allocated Aus$27.4 million over two years to deliver Australia’s first National Climate Risk Assessment and National Adaptation Plan. These will guide decisions on how to adapt to the country’s significant climate risks. Professor Rickards says the research being undertaken at La Trobe’s Climate Change Adaptation Lab plugs into these very live policy conversations.Lauren Rickards: 24:35The first thing that we’re doing is quite open-ended empirical work in a range of different work settings. We’re looking at the impacts of climate change on the work of natural resource management, for example. So, all of the efforts, a lot of them unpaid, to actually improve the environmental outcomes and the biodiversity outcomes of our landscapes and waterscapes.We’ve got a range of different projects with catchment-management authorities and others there. And that is part of my lineage of working with farm households and farming communities for a long time. We’re also doing a lot of conceptual work to come up with the new vocabulary, the new conceptual frameworks, the new principles that we need to adapt.Caris Bizzaca: 25:24An example is that currently researchers are quite good at understanding the impact of direct climate hazards, like extreme weather events or the effect of increasing temperature levels on food production.Lauren Rickards: 25:37Increasing night-time temperatures, which doesn’t tend to sort of make the headlines, but can make a big difference if you’re an apple or pear grower, for example, and really seeking those cold overnight temperatures to set your fruit.Caris Bizzaca: 25:51However, less work has been done in understanding the flow-on effects of these climactic hazards.Lauren Rickards: 25:56We’re not very good at understanding the more indirect cascading climate-change impacts, and yet it’s very, very evident that it’s those secondary, tertiary impacts that we really need to pay attention to. Because although the word secondary and tertiary make them sound less important, they can often be far more consequential.So, it’s not necessarily the floodwaters, for example, it’s the fact that your supply chains are cut, that your infrastructure is affected, that businesses are closing, that environments react with a proliferation of weeds that might be a long-term collapse of a road. It’s these secondary things that can really cause a huge amount of harm if we don’t manage them well.So, our hope is that if we have a more comprehensive, a more realistic, sense of what climate change entails, so building on fairly limited climate-focused approach that we’ve had to date, then we’ll be able to identify a whole range of new, effective and creative and innovative climate-change adaptation options.Caris Bizzaca: 27:09The far-reaching impacts of climate change mean these adaptation options also have a lot of crossover.Lauren Rickards: 27:16A lot of adaptation looks a lot like good governance. It looks like building social well-being. It looks like building environmental sustainability. So suddenly we’ve got this connection through to a whole host of existing policy agendas, things that we have a lot of skills and capacity to do, and that’s really exciting for adaptation. It becomes far less about expertise in particular climatic domains, far less about exposure models, and far more about how can we work together to get ourselves positioned as safely and securely as possible to cope with whatever comes next.Caris Bizzaca: 27:56It also means Professor Rickard’s research taps into all of the SDGs, but especially SDG 13 on climate-change action.Lauren Rickards: 28:05But, as I’ve indicated, our conceptualization of the challenge of climate-change impacts and adaptation means we are looking across all of the different areas of work that the different SDGs represent. Whether that’s the health sector and education sector, whether it’s the water sector, the agricultural sector.The sorts of research we’re doing, including particular work with the National Climate Risk Assessment, really reinforces to us the importance of governance. And that focus and ongoing dialogue about governance is, I think, very much resonant with the 17th SDG, which is about partnership.The only other thing I would say is that actually our work also has caused us to question one or two elements in the SDGs. Accepting that, of course, it’s this grand vision, it’s a big transformational vision that was brought together through hard work of partnership between a lot of countries. And for us in SDG 8, it talks about decent work or good jobs and economic growth.We are very much drawn to the work of those who are questioning whether economic growth is the kind of metric of societal progress that we really need in a changing climate. And there’s a couple of reasons for that. One is because all the hard work of building community, building relationships, social capital, a lot of that gets left outside of a classic economic lens. And at the same time, stuff that really ought not to be celebrated also gets included. So if we have large-scale disasters causing large amount of losses of assets, infrastructure, and then we rebuild those, that can show up as a positive in terms of economic development, economic growth.So, the question is, is it really the right compass for us? And our research is increasingly suggesting that we need to rethink that one.Caris Bizzaca: 30:12Professor Rickard’s immediate next focus will be on big picture questions around climate-change adaptation.Lauren Rickards: 30:20How do we know whether adaptation has been successful? What’s the purpose of it? What’s the vision of it? It’s very much about social and ecological well-being. It’s about the foundational economies. It’s about everything that we know helps to sustain us in... for us to thrive.And, so, that opens up a big vista of different types of work that are required there. One of the other things we are doing is really starting to question things like what work is essential? What work matters? How work should be remunerated? What forms of infrastructure are critical?Caris Bizzaca: 30:59Researchers in climate-change adaptation also face an unusual hurdle.Lauren Rickards: 31:04Unlike the typical idea of the researcher or the academic being in an ivory tower, disconnected from the world, we are living this, we are part of it. And that has a huge range of effects on our actual ability to complete research successfully. As individuals, for example, we may be affected. So I was doing a project on the effects of drought on farm households in north-west Victoria, trained up local women in the community to help with that research. And one of them was unable to do the interviews because her house was flooded in the 2010–2011 floods.Caris Bizzaca: 31:42In this way, the research focus area is also impacting the researcher themselves.Lauren Rickards: 31:47I think there’s something about rural and regional communities that really understand this. Your professional self and your personal self are always so closely enmeshed.But another thing that we are finding all of the time is that research funders, research partners, all the sorts of organizations we work with including, I should say, the media, are themselves being impacted and are very distractible.And so we’ll be trying to do something, particularly the long-term, future-oriented climate-change adaptation, and it keeps getting disrupted, people leave, funding dries up, interest dries up, policy windows close, policy windows open.It’s just this real difficulty of ever getting ahead. How do we actually start to make sense of this when we’re so drawn into turmoil? And one of the key risks that we identified for Australia is actually the risk of what we call institutional overwhelm. So our institutions, but more broadly, organizations, are starting to unravel, because we are so caught up in the uncertainty, the volatility, the extremes that climate change is already throwing at us.That’s a real concern when it comes to all of the extremely time-intensive, energy-intensive work that good climate-change adaptation requires. So, we need to actually become really, really expert at putting together strategic visions and plans that we can then use to keep sketching out what the future looks like as we’re driving towards it.Caris Bizzaca: 33:28Achieving that vision will require a combined effort. As we’ve heard through this podcast series, that is the LISAF vision – to bring together researchers across disciplines for a holistic approach.Lauren Rickards: 33:39My hope is that we have, as a society, a real opportunity and rapid engagement with the challenges of adapting to our increasingly changing climate. We really, really need to work collectively to ensure that we’re adapting in the right direction, in a way that’s going to be effective. And we really need everybody engaged in it. It’s not the sort of thing that anyone can just take a back seat on. Each and every person, household, organization, location has to be involved. So I’m really hoping that we will get there.It also, as part of that, needs to be really seen as a complement – in fact, a foundation – for the hard work of greenhouse-gas mitigation or decarbonization. The two things enable each other. So, they have to be done in partnership.So, I hope that we move past some of the sort older, simplistic idea that it’s one or the other, or that they’re somehow antithetical to each other. So, with that hope that our lab continues to be part of that conversation, part of the policy change, the practice change. We certainly feel really poised, ready to make a big difference. So, hopefully that will come to fruition.Caris Bizzaca: 35:05That was Lauren Rickards, Professor of Climate Change Adaptation and Director of the La Trobe Climate Change Adaptation Lab at La Trobe University in Victoria. Join us for the next episode in this series where we’ll be looking at the role AI and digital agriculture is playing, and will continue to play, in food security and sustainability.",
  "image": "https://media.nature.com/lw1200/magazine-assets/d41586-024-02903-7/d41586-024-02903-7_26652900.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"MO0\"\u003e\u003cp\u003e\u003cb\u003eMonica Contestabile 00:10\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHello. This is \u003ci\u003eHow to Save Humanity in 17 Goals\u003c/i\u003e, a podcast brought to you by \u003ci\u003eNature Careers\u003c/i\u003e in partnership with \u003ci\u003eNature Sustainability\u003c/i\u003e.\u003c/p\u003e\u003cp\u003eI am Monica Contestabile, chief editor of \u003ci\u003eNature Sustainability\u003c/i\u003e. This is the series where we meet the researchers working towards the Sustainable Development Goals agreed by the United Nations and world leaders in 2015.\u003c/p\u003e\u003cp\u003eSince then, in a huge global effort, thousands of academics have been using those targets to tackle the biggest problems that the planet faces today.\u003c/p\u003e\u003cp\u003eEach episode ends with a sponsored slot from La Trobe Institute for Sustainable Agriculture and Food in Melbourne, Australia, where we hear about how its researchers are focusing on the SDGs.\u003c/p\u003e\u003cp\u003eIn this episode, we look at the last Sustainable Development Goal, number 17: to strengthen the means of implementation and revitalize global partnerships.\u003c/p\u003e\u003cp\u003eAnd we hear from an American scholar who proposes strategies to break down these goals into manageable missions in order to make them happen.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKate Roll: 01:33\u003c/b\u003e\u003c/p\u003e\u003cp\u003eSo I’m Dr Kate Roll. I’m a political scientist at the Institute for Innovation and Public Purpose at University College London in the United Kingdom.\u003c/p\u003e\u003cp\u003eI have a really varied background, looking at everything from veterans and disarmament up to responsible business. But a lot of my current work is around systems change and the SDGs.\u003c/p\u003e\u003cp\u003eAnd the research, the questions I\u0026#39;m interested in, really have to do with things like political economy, who gets what, and why. And increasingly, and very much tied to the SDGs, why does change happen? How and when does it happen? And an important part of my work is both my research, but I also lead the Masters of Public Administration program at my institute, and that’s what keeps me busy most days.\u003c/p\u003e\u003cp\u003eSo, SDG 17, Sustainable Development Goal 17, is the final sustainable development goal.\u003c/p\u003e\u003cp\u003eAnd we sometimes talk about it as being an overarching goal, or a meta goal.\u003c/p\u003e\u003cp\u003eIt’s a convener or facilitator of all the 16 prior goals. And so SDG 17 is partnership for the goals. And it’s about strengthening the means of implementation and revitalizing global partnership for sustainable development.\u003c/p\u003e\u003cp\u003eAnd sort of the key term for SDG 17 is partnership. And I think those of us who are academics, those of us who are interested in policy and practice, partnerships are absolutely essential for our work, both collaborations within academia, with people from other fields, but also partnerships with organizations, with political actors, with students, with civil society organizations. All of that is extremely important.\u003c/p\u003e\u003cp\u003e\u003cb\u003eKate Roll: 03:25\u003c/b\u003e\u003c/p\u003e\u003cp\u003eSo SDG 17 is about partnership for the goals. And sort of the core principle, the core intuition, is that collaboration is needed to deal with complexity.\u003c/p\u003e\u003cp\u003eYou know, multi-stakeholder work is really important when you’ve got problems that themselves are unclear.\u003c/p\u003e\u003cp\u003eSo, you know, obesity. Is this the problem of food systems? Is this is the problem of transportation? Is this the problem of health? You know, what type of problem is this?\u003c/p\u003e\u003cp\u003eYou need multiple stakeholders to come around and work, work on these type of things. Also, when we’re working with uncertainty, when we’re working around innovation, you need to have lots of experimentation, lots of small bets.\u003c/p\u003e\u003cp\u003eAnd with that kind of work, partnership is essential. So that kind of intuition or principle sits behind SDG 17.\u003c/p\u003e\u003cp\u003eBut if you lift up the lid, if you, if you look at actually the targets and indicators for SDG 17, it covers five really specific areas.\u003c/p\u003e\u003cp\u003eSo the first is finance, which has to do with revenue collection, aid, debt, base erosion and profit-shifting is a term we’re very interested in with finance. Do countries have enough money to pay for SDG work around education, health, etc?\u003c/p\u003e\u003cp\u003eSo finance is the first. We’re interested in technology, digital divide and technology, technological diffusion.\u003c/p\u003e\u003cp\u003eThird is capacity building. Fourth is trade. And fifth are systemic issues with how to do things like policy coherence, And SDG 17 is pursued in two ways. One is primarily through global alliances and organizations that are led by governments. So things like the WTO, the World Trade Organization, the World Health Organization, and also partnership for goals on multiple levels.\u003c/p\u003e\u003cp\u003eSo again, these can be local, national, international partnerships. And finally, SDG 17, these are what are called means of implementation targets. About how we get there, rather than the destination, rather than the outcome.\u003c/p\u003e\u003cp\u003eSo we’re sort of measuring, “Are we raising enough money to do this?” Rather than saying what the outcome that we want is? So there\u0026#39;s some concerns, actually, that the sort of means of getting there aren’t as closely tied to the outcomes as we want.\u003c/p\u003e\u003cp\u003eBut we’re again thinking about these means of implementation targets. What do we need to do to achieve the other 16 SDGs?\u003c/p\u003e\u003cp\u003e\u003cb\u003eKate Roll: 05:57\u003c/b\u003e\u003c/p\u003e\u003cp\u003eSo I was born outside of Boston, grew up there, did my university at Brown University.\u003c/p\u003e\u003cp\u003eBut before I went to university, I had the opportunity to take a year out and work on a boat, and my sister had to pick my university courses.\u003c/p\u003e\u003cp\u003eAnd I told her, “Put me into pre-med courses. I’m going to be a doctor.”\u003c/p\u003e\u003cp\u003eAnd she looked at me, and she said, “No, you’re not going to be a doctor. You\u0026#39;re going to be, you know, into something else.”\u003c/p\u003e\u003cp\u003eSo when I arrived back from from that year, and I arrived to my courses for the first year of Brown University, she’d put me in medical anthropology, not in pre-med courses. And that sort of started my my journey into social science, into thinking about power, thinking about conflict.\u003c/p\u003e\u003cp\u003eI’d been living in Indonesia. So seeing people smuggling cigarettes over borders in these dugout canoes. You know, seeing this incredible world out there.\u003c/p\u003e\u003cp\u003eAnd she really saw that, that’s what I was going to be interested in. So started to be interested in questions of of power, of politics, of culture, all of these things, and that started to inform my studies in international relations, in post-conflict transitions, being in these areas, you know, in Indonesia that had been post conflict, like Ache, or in Papua New Guinea, like Bougainville, seeing those up close.\u003c/p\u003e\u003cp\u003eAnd then wanting to go back into the classroom and really understand what was going on. So that really, really informed my work. And then, you know, this interest in in people, in resources, in security that’s cut through all of these pieces, whether it\u0026#39;s thinking about veterans in East Timor, or responsible business and and the poor in Kenya.\u003c/p\u003e\u003cp\u003eOr thinking about, you know, do we have enough funding for education here in the UK? It all has sort of a similar question about resources, vulnerability, security, and how do we make this world better?\u003c/p\u003e\u003cp\u003e\u003cb\u003eKate Roll: 07:59\u003c/b\u003e\u003c/p\u003e\u003cp\u003eSo, the big idea at UCL Institute for Innovation and Public Purpose is around bringing the state back in, around really honouring the state and thinking about its role in innovation.\u003c/p\u003e\u003cp\u003eAnd we capture that idea. What we have on our tote bags, on our T shirts, is the slogan, “Innovation is political.”\u003c/p\u003e\u003cp\u003eAnd I love that idea as a political scientist, but it cuts across, you know, economists are drawn to this idea. Designers are drawn to this idea. Everyone is. Innovation is political.\u003c/p\u003e\u003cp\u003eAnd what we mean by that is that innovation is shaped by political processes and structures. It’s not just that the best idea or the best technology wins.\u003c/p\u003e\u003cp\u003eYou know, we illustrate that idea by thinking about something like, at the turn of the 20th century, there were more electric cars on the road than there were internal combustion engines.\u003c/p\u003e\u003cp\u003eSo why, why did that technology lose out? Was it a worse technology, or were there sort of political factors? So that’s one way of thinking about innovation is political.\u003c/p\u003e\u003cp\u003eBut we can also think about, you know, people can be involved in directing this process, right? We can make choices about where we want our future to go, where we want investment to go, in terms of technology, in terms of these sort of transformations that are so important, in light of the challenges captured by the SDGs, and particularly the climate emergency.\u003c/p\u003e\u003cp\u003eAnd, you know, finally, this idea that power structures are involved. So this idea of “innovation is political” really drew me to IPP, this idea of rethinking the state and celebrating the state.\u003c/p\u003e\u003cp\u003eI think the second idea that’s really associated with the Institute of Innovation and Public Purpose is the idea of missions and mission-oriented innovation. And this is idea that’s been championed and brought forward by Professor Mariana mazzucato, who’s the director of the Institute, and it’s a tool for thinking about innovation strategy that beds it in a challenge. Why do we want to have, you know, a competitive automotive sector? Well, we want sustainable and accessible mobility. What’s the purpose? Where are we trying to go? And so it reorients innovation strategy around a challenge. And those challenges can be drawn from the SDGs.\u003c/p\u003e\u003cp\u003eSo this question of, how do we make the SDG challenges manageable is such a good one. Because when we’re talking about the SDGs, we’re talking about the absolute biggest, most important problems of our day. We’re talking about health, we’re talking about poverty, we’re talking about oceans, soil, all of these things.\u003c/p\u003e\u003cp\u003eFor me as an academic, when I think about tackling the SDGs, I think of using a systems change lens. Sometimes we talk about critical systems heuristics, which is, just say, you know, a fancy way of saying, “How do we define the problem? How do we place a boundary around an issue in order to tackle it?” Because that’s one of the issues we see with the SDGs, is that they’re so big, they’re so difficult that, you know, how do we even get stuck in?\u003c/p\u003e\u003cp\u003eSo we can be thinking about a very narrow boundary where we’re talking about local food systems, local change, you know, how we deal with waste, or even thinking about much bigger national or international level systems, and drawing the boundary that way, and then thinking about, if we draw that big, wide and international boundary, who needs to be around the table in order to be thinking about doing this differently?\u003c/p\u003e\u003cp\u003eAnd again, that’s where partnership, and where SDG 17 comes in. We draw this boundary, we think about the stakeholders within that boundary, and then we bring them together in order to really address the problem.\u003c/p\u003e\u003cp\u003eThere’s some really interesting work that’s been going on that’s been using the sort of systems change, using the sort of mission orientation, for doing that kind of kind of change and tackling SDGs.\u003c/p\u003e\u003cp\u003eSo there’s a great example from Sweden. Their Innovation Agency is called Vinnova.\u003c/p\u003e\u003cp\u003eAnd they worked on trying to change food systems in Sweden, and their entry point was school feeding, which is such a smart way to do it, because it’s an area where their state is involved. It’s got children who are making new food habits.\u003c/p\u003e\u003cp\u003eAnd they did this incredible program that involved consultation with hundreds of people, including political leaders.\u003c/p\u003e\u003cp\u003eAnd then they’ve funded lots of different experiments all over the country around menus, around how the procurement is done, how the, even the cafeteria is organized.\u003c/p\u003e\u003cp\u003eLots of small bits, lots of small experiments, trying to think about how to shift this system. So this is a very innovative design-led approach to using a mission, to using a systems change approach to tackle something like the SDGs, where we’re thinking about health, we’re thinking about agriculture, we\u0026#39;re thinking about partnering, we’re thinking about industry.\u003c/p\u003e\u003cp\u003eAll of these, these different SDGs are involved, but we also have missions like I mentioned before that deal on this much more international level, or again, focused on placing lots of bets on the development of different kinds of technologies.\u003c/p\u003e\u003cp\u003eBut the SDGs, they’re, you know, big, wooly, hairy goals, and I think there’s no way to go about them, except for thinking about who needs to be around the table in order to make change happen.\u003c/p\u003e\u003cp\u003eSo missions are a relatively new idea, and how they’re governed really varies by what level they\u0026#39;re working on, whether it’s a city level, what’s an international level.\u003c/p\u003e\u003cp\u003eAnd also what the goal is, is it about innovation driving more diverse and new innovation? Is it about social problems and social change?\u003c/p\u003e\u003cp\u003eAnd so we\u0026#39;ve got a lot of diversity in who’s working and accordingly in how they\u0026#39;re governed. I think what is important is that we’re seeing or we’re seeing some trends, we’re seeing some patterns of multiple-stakeholder engagement for governance of missions, both at the local level and on the international level.\u003c/p\u003e\u003cp\u003eSo for example, the Horizon Program, which is a really important EU-level initiative, they’ve got panels of experts that help to monitor and govern the missions that are being pursued as part of that project, which include things like climate, which include things like addressing cancer.\u003c/p\u003e\u003cp\u003eAnd you also see that kind of highly-participatory approach coming with things like local missions, or with the example that I just gave of the Vinnova food system transformation, where they are doing lots of consultation, lots of partnership, and bringing in the stakeholders, bringing them into the room.\u003c/p\u003e\u003cp\u003eAnd that really starts with the definition of what is the mission, what is important, but then also in terms of who’s involved in executing the mission, who are doing the the different projects that come together to advance that, that shared goal.\u003c/p\u003e\u003cp\u003eAnd so, you know, we’re often thinking about things like flexibility, accountability, engagement. And then also building up the the capacity of the public sector to do this kind of work. Because this might be flexing new muscles on this type of collaboration, this type of co-creation might be new for for a lot of people.\u003c/p\u003e\u003cp\u003eSo yeah, those are, those are really important, but they’re all about, you know, bringing together folks around a bold, inspirational mission, and moving forward, moving towards that, that goal together.\u003c/p\u003e\u003cp\u003eOne example of a mission would be around addressing climate change. Again. SDG 13 is around climate, so you know, thinking about, how do we reduce the amount of carbon? How do we reduce the negative effects of climate change?\u003c/p\u003e\u003cp\u003eAnd that big goal gets tied to a more specific mission, a more measurable mission, which, for example, could be 100 carbon-neutral cities in Europe by 2030.\u003c/p\u003e\u003cp\u003eSo you take that big overarching SDG, you know, SDG, 13, climate change, you bring it down to a measurable, achievable goal of 100 carbon-neutral cities, also still ambitious.\u003c/p\u003e\u003cp\u003eAnd then you think about, “what would it take to get there? What would we need to do to have 100 carbon-neutral cities?”\u003c/p\u003e\u003cp\u003eAnd it becomes really an interesting question, again, sort of a systems question, because you can’t just be thinking, “Oh, this is a transport problem,” or, “Oh, this is an energy problem.”\u003c/p\u003e\u003cp\u003eYou have to be thinking about the built environment, real estate, the materials that we’re using. You need to be thinking about people’s behaviour. You need to be thinking about the social sector. You’d be thinking about all these different pieces that maybe hadn\u0026#39;t been part of a climate change discussion before.\u003c/p\u003e\u003cp\u003eCrowd in the different actors. Think about all of those that need to be involved. And then once you\u0026#39;ve identified those sectors, whether it be real estate or construction or mobility or energy, then you think about, let\u0026#39;s foster some experiments.\u003c/p\u003e\u003cp\u003eLet\u0026#39;s help them think about new ways of working that could again move us forward towards that, that goal of 100 carbon-neutral cities.\u003c/p\u003e\u003cp\u003eSo is that thinking about building reuse rather than building new? Is it thinking about new construction materials?\u003c/p\u003e\u003cp\u003eIs it about electrifying buses or thinking about new ways of encouraging more cycling? You know, how can we do small-level experiments that all add up and push us towards towards that goal?\u003c/p\u003e\u003cp\u003eAnd ultimately, you know, innovation theory talks about niche innovation, where you support something small, you foster it, and then hopefully it grows, and then becomes the norm, becomes part of what we call the regime. And so by placing lots of bets, by doing lots of experiments, you’re sort of seeding the future that allows for this, this greater change and these wonderful sort of cascades that can happen.\u003c/p\u003e\u003cp\u003eSo if we have the that big, chunky goal of preventing or mitigating climate change, we bring that down to the mission of 100 carbon-neutral cities, we identify the sectors, and then we run experiments, we run different projects that all advance that goal, bringing these sectors and bringing these actors together again through partnerships, very much in line with SDG 17.\u003c/p\u003e\u003cp\u003eSo it’s really interesting to reflect on this question of, “will SGG 17 be achieved?”\u003c/p\u003e\u003cp\u003eBecause, as we started out with, SGG 17 is sort of an enabling SDG. It’s not an outcome in and of itself. It’s about, you know, achieving the other SDGs.\u003c/p\u003e\u003cp\u003eSo you know, when we think about “Will SGG 17 be achieved. How do we know?” It almost will be, you know, if we are able to attack, you know, tackle poverty, if we are able to support education, if we are able to to improve gender equity, then we sort of know that we’ve been able to do SDG 17 as well, which, which involves resource mobilization, involves capacity, involves all these different enabling conditions.\u003c/p\u003e\u003cp\u003eMore technically, we can look at SDG 17 and the specific targets and indicators, and we can look at trends there.\u003c/p\u003e\u003cp\u003eSo, you know, we can already see things like a reduction in tariffs or increase in internet use, which are both, you know, targets within, within the SDG, but I think these are really proxies.\u003c/p\u003e\u003cp\u003eThese are really stand-ins for the really important factors that we\u0026#39;re looking at, where we\u0026#39;re saying people should have equal and equitable and useful access to technology that you know, the economy should work for people.\u003c/p\u003e\u003cp\u003eSo I’m actually less interested, or less focused on those specific targets or indicators, than the big important spirit of SDG 17, which is getting the tools and relationships and financing in place that allows the other SDGs to be unlocked and move forward.\u003c/p\u003e\u003cp\u003e\u003cb\u003e20:42: Monica Contestabile\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThanks for listening to this series, \u003ci\u003eHow to Save Humanity in 17 Goals\u003c/i\u003e.\u003c/p\u003e\u003cp\u003eJoin us again next time for a final bonus episode where we meet the Swedish graphic designer who devised the icons and messaging, and the whole communication package for the UN SDGs.\u003c/p\u003e\u003cp\u003eBut before we do, next up, we’ll hear our researchers at La Trobe Institute for Sustainable Agriculture and Food in Melbourne, Australia, the sponsor of this series, are working towards the targets set by the UN.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 21:39\u003c/b\u003e\u003c/p\u003e\u003cp\u003eI’m Caris Bizzaca, and welcome to this podcast series from the La Trobe Institute for Sustainable Agriculture and Food at La Trobe University in Australia. I would like to start by acknowledging the traditional custodians of the lands where La Trobe University campuses are located in Australia, and to pay respect to Aboriginal and Torres Strait Islander cultures, as well as to elders past, present and emerging.\u003c/p\u003e\u003cp\u003eAcross this six-episode series, you’ll hear from academics at the top of their fields as they discuss groundbreaking research happening at the La Trobe Institute for Sustainable Agriculture and Food, also known as LISAF. Through LISAF, La Trobe has developed a holistic approach to food security, and this ‘paddock-to-gut’ philosophy is delivering innovative research and significant academic and industry partnerships across the entire value chain.\u003c/p\u003e\u003cp\u003eIts success so far can already be seen in the Times Higher Education Impact Rankings, which measure university performance against the United Nations’ 17 Sustainable Development Goals, or SDGs. In 2024, La Trobe was ranked first in Australia and fifth globally for SDG 2: Zero Hunger.\u003c/p\u003e\u003cp\u003eNow, stay tuned to hear first-hand about the research of LISAF as it delivers innovative solutions for sustainable and nutritious food production in a resource and climate-constrained world.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 23:04\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe climate is well and truly changing. It’s changing at a very rapid rate, faster than expected, and the impacts are starting to accumulate and intersect.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 23:14\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThat is Lauren Rickards, Professor of Climate Change Adaptation and Director of the La Trobe Climate Change Adaptation Lab at La Trobe University in Victoria.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 23:24\u003c/b\u003e\u003c/p\u003e\u003cp\u003eI’ve got a cross-disciplinary background, but particularly geography. That means I’ve come from a social science perspective, and what we look at is the impacts of climate change on different forms of work, including trying to respond to disasters, understand climate change and do the hard work of greenhouse-gas mitigation and adapting to future climates.\u003c/p\u003e\u003cp\u003eSo, this is very, very urgent in the sense that if we don’t get our heads around this, the window of opportunity to be able to work out what we need to do – and to do it effectively – is going to close, and we’ll end up in just some kind of permanent disaster-response mode.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 24:02\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe good news is that tackling this area of research is a priority for the Australian government. The 2023–24 budget allocated Aus$27.4 million over two years to deliver Australia’s first National Climate Risk Assessment and National Adaptation Plan. These will guide decisions on how to adapt to the country’s significant climate risks. Professor Rickards says the research being undertaken at La Trobe’s Climate Change Adaptation Lab plugs into these very live policy conversations.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 24:35\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe first thing that we’re doing is quite open-ended empirical work in a range of different work settings. We’re looking at the impacts of climate change on the work of natural resource management, for example. So, all of the efforts, a lot of them unpaid, to actually improve the environmental outcomes and the biodiversity outcomes of our landscapes and waterscapes.\u003c/p\u003e\u003cp\u003eWe’ve got a range of different projects with catchment-management authorities and others there. And that is part of my lineage of working with farm households and farming communities for a long time. We’re also doing a lot of conceptual work to come up with the new vocabulary, the new conceptual frameworks, the new principles that we need to adapt.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 25:24\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAn example is that currently researchers are quite good at understanding the impact of direct climate hazards, like extreme weather events or the effect of increasing temperature levels on food production.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 25:37\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIncreasing night-time temperatures, which doesn’t tend to sort of make the headlines, but can make a big difference if you’re an apple or pear grower, for example, and really seeking those cold overnight temperatures to set your fruit.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 25:51\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHowever, less work has been done in understanding the flow-on effects of these climactic hazards.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 25:56\u003c/b\u003e\u003c/p\u003e\u003cp\u003eWe’re not very good at understanding the more indirect cascading climate-change impacts, and yet it’s very, very evident that it’s those secondary, tertiary impacts that we really need to pay attention to. Because although the word secondary and tertiary make them sound less important, they can often be far more consequential.\u003c/p\u003e\u003cp\u003eSo, it’s not necessarily the floodwaters, for example, it’s the fact that your supply chains are cut, that your infrastructure is affected, that businesses are closing, that environments react with a proliferation of weeds that might be a long-term collapse of a road. It’s these secondary things that can really cause a huge amount of harm if we don’t manage them well.\u003c/p\u003e\u003cp\u003eSo, our hope is that if we have a more comprehensive, a more realistic, sense of what climate change entails, so building on fairly limited climate-focused approach that we’ve had to date, then we’ll be able to identify a whole range of new, effective and creative and innovative climate-change adaptation options.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 27:09\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe far-reaching impacts of climate change mean these adaptation options also have a lot of crossover.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 27:16\u003c/b\u003e\u003c/p\u003e\u003cp\u003eA lot of adaptation looks a lot like good governance. It looks like building social well-being. It looks like building environmental sustainability. So suddenly we’ve got this connection through to a whole host of existing policy agendas, things that we have a lot of skills and capacity to do, and that’s really exciting for adaptation. It becomes far less about expertise in particular climatic domains, far less about exposure models, and far more about how can we work together to get ourselves positioned as safely and securely as possible to cope with whatever comes next.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 27:56\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIt also means Professor Rickard’s research taps into all of the SDGs, but especially SDG 13 on climate-change action.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 28:05\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBut, as I’ve indicated, our conceptualization of the challenge of climate-change impacts and adaptation means we are looking across all of the different areas of work that the different SDGs represent. Whether that’s the health sector and education sector, whether it’s the water sector, the agricultural sector.\u003c/p\u003e\u003cp\u003eThe sorts of research we’re doing, including particular work with the National Climate Risk Assessment, really reinforces to us the importance of governance. And that focus and ongoing dialogue about governance is, I think, very much resonant with the 17th SDG, which is about partnership.\u003c/p\u003e\u003cp\u003eThe only other thing I would say is that actually our work also has caused us to question one or two elements in the SDGs. Accepting that, of course, it’s this grand vision, it’s a big transformational vision that was brought together through hard work of partnership between a lot of countries. And for us in SDG 8, it talks about decent work or good jobs and economic growth.\u003c/p\u003e\u003cp\u003eWe are very much drawn to the work of those who are questioning whether economic growth is the kind of metric of societal progress that we really need in a changing climate. And there’s a couple of reasons for that. One is because all the hard work of building community, building relationships, social capital, a lot of that gets left outside of a classic economic lens. And at the same time, stuff that really ought not to be celebrated also gets included. So if we have large-scale disasters causing large amount of losses of assets, infrastructure, and then we rebuild those, that can show up as a positive in terms of economic development, economic growth.\u003c/p\u003e\u003cp\u003eSo, the question is, is it really the right compass for us? And our research is increasingly suggesting that we need to rethink that one.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 30:12\u003c/b\u003e\u003c/p\u003e\u003cp\u003eProfessor Rickard’s immediate next focus will be on big picture questions around climate-change adaptation.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 30:20\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHow do we know whether adaptation has been successful? What’s the purpose of it? What’s the vision of it? It’s very much about social and ecological well-being. It’s about the foundational economies. It’s about everything that we know helps to sustain us in... for us to thrive.\u003c/p\u003e\u003cp\u003eAnd, so, that opens up a big vista of different types of work that are required there. One of the other things we are doing is really starting to question things like what work is essential? What work matters? How work should be remunerated? What forms of infrastructure are critical?\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 30:59\u003c/b\u003e\u003c/p\u003e\u003cp\u003eResearchers in climate-change adaptation also face an unusual hurdle.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 31:04\u003c/b\u003e\u003c/p\u003e\u003cp\u003eUnlike the typical idea of the researcher or the academic being in an ivory tower, disconnected from the world, we are living this, we are part of it. And that has a huge range of effects on our actual ability to complete research successfully. As individuals, for example, we may be affected. So I was doing a project on the effects of drought on farm households in north-west Victoria, trained up local women in the community to help with that research. And one of them was unable to do the interviews because her house was flooded in the 2010–2011 floods.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 31:42\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIn this way, the research focus area is also impacting the researcher themselves.\u003c/p\u003e\u003cp\u003eLauren Rickards: 31:47\u003c/p\u003e\u003cp\u003eI think there’s something about rural and regional communities that really understand this. Your professional self and your personal self are always so closely enmeshed.\u003c/p\u003e\u003cp\u003eBut another thing that we are finding all of the time is that research funders, research partners, all the sorts of organizations we work with including, I should say, the media, are themselves being impacted and are very distractible.\u003c/p\u003e\u003cp\u003eAnd so we’ll be trying to do something, particularly the long-term, future-oriented climate-change adaptation, and it keeps getting disrupted, people leave, funding dries up, interest dries up, policy windows close, policy windows open.\u003c/p\u003e\u003cp\u003eIt’s just this real difficulty of ever getting ahead. How do we actually start to make sense of this when we’re so drawn into turmoil? And one of the key risks that we identified for Australia is actually the risk of what we call institutional overwhelm. So our institutions, but more broadly, organizations, are starting to unravel, because we are so caught up in the uncertainty, the volatility, the extremes that climate change is already throwing at us.\u003c/p\u003e\u003cp\u003eThat’s a real concern when it comes to all of the extremely time-intensive, energy-intensive work that good climate-change adaptation requires. So, we need to actually become really, really expert at putting together strategic visions and plans that we can then use to keep sketching out what the future looks like as we’re driving towards it.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 33:28\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAchieving that vision will require a combined effort. As we’ve heard through this podcast series, that is the LISAF vision – to bring together researchers across disciplines for a holistic approach.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLauren Rickards: 33:39\u003c/b\u003e\u003c/p\u003e\u003cp\u003eMy hope is that we have, as a society, a real opportunity and rapid engagement with the challenges of adapting to our increasingly changing climate. We really, really need to work collectively to ensure that we’re adapting in the right direction, in a way that’s going to be effective. And we really need everybody engaged in it. It’s not the sort of thing that anyone can just take a back seat on. Each and every person, household, organization, location has to be involved. So I’m really hoping that we will get there.\u003c/p\u003e\u003cp\u003eIt also, as part of that, needs to be really seen as a complement – in fact, a foundation – for the hard work of greenhouse-gas mitigation or decarbonization. The two things enable each other. So, they have to be done in partnership.\u003c/p\u003e\u003cp\u003eSo, I hope that we move past some of the sort older, simplistic idea that it’s one or the other, or that they’re somehow antithetical to each other. So, with that hope that our lab continues to be part of that conversation, part of the policy change, the practice change. We certainly feel really poised, ready to make a big difference. So, hopefully that will come to fruition.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCaris Bizzaca: 35:05\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThat was Lauren Rickards, Professor of Climate Change Adaptation and Director of the La Trobe Climate Change Adaptation Lab at La Trobe University in Victoria. Join us for the next episode in this series where we’ll be looking at the role AI and digital agriculture is playing, and will continue to play, in food security and sustainability.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "33 min read",
  "publishedTime": null,
  "modifiedTime": null
}
