{
  "id": "9eed796a-291a-49be-b2b1-0a4c8e611c0e",
  "title": "Do fungi recognize shapes?",
  "link": "https://www.sciencedaily.com/releases/2024/10/241009122809.htm",
  "description": "Fungi don't have eyes or a brain, but their intelligent behaviors may surprise you. New research suggests that fungi may be able to recognize shapes.",
  "author": "",
  "published": "Wed, 09 Oct 2024 12:28:09 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2412,
  "excerpt": "Fungi don't have eyes or a brain, but their intelligent behaviors may surprise you. New research suggests that fungi may be able to recognize shapes.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Can organisms without a brain still show signs of intelligence? Researchers at Tohoku University and Nagaoka College had this question in mind when conducting a study to measure the decision-making processes in fungi. While it may sound like science fiction, this level of basal cognition is possible even in fungi. \"You'd be surprised at just how much fungi are capable of,\" remarks Yu Fukasawa of Tohoku University, \"They have memories, they learn, and they can make decisions. Quite frankly, the differences in how they solve problems compared to humans is mind-blowing.\" Fungi grow by releasing spores, which can germinate and form long, spidery threads underground (a mycelium). We typically only see the tiny mushrooms on the surface without realizing that there's a vast network of interconnected mycelium beneath our feet. It is through this network that information can be shared, somewhat like neural connections in the brain. The present study examined how a wood-decaying mycelial network responded to two different situations: wood blocks placed in a circle versus cross arrangement. For example, if the fungi didn't display decision-making skills, they would simply spread out from a central point without consideration for the position of the blocks. Remarkably, this is not what the researchers witnessed. For the cross arrangement, the degree of connection was greater in the outermost four blocks. It was hypothesized that this was because the outermost blocks can serve as \"outposts\" for the mycelial network to embark in foraging expeditions, therefore more dense connections were required. In the circle arrangement, the degree of connection was the same at any given block. However, the dead centre of the circle remained clear. It was proposed that the mycelial network did not see a benefit in overextending itself in an already well-populated area. These findings suggest that the mycelial network was able to communicate information about its surroundings throughout the entire network, and change its direction of growth accordingly based on the shape. Our comprehension of the mysterious world of fungi is limited, especially when compared to our knowledge of plants and animals. This research will help us better understand how biotic ecosystems function and how different types of cognition evolved in organisms. These results were published in Fungal Ecology on September 12, 2024.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eCan organisms without a brain still show signs of intelligence? Researchers at Tohoku University and Nagaoka College had this question in mind when conducting a study to measure the decision-making processes in fungi. While it may sound like science fiction, this level of basal cognition is possible even in fungi.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;You\u0026#39;d be surprised at just how much fungi are capable of,\u0026#34; remarks Yu Fukasawa of Tohoku University, \u0026#34;They have memories, they learn, and they can make decisions. Quite frankly, the differences in how they solve problems compared to humans is mind-blowing.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFungi grow by releasing spores, which can germinate and form long, spidery threads underground (a mycelium). We typically only see the tiny mushrooms on the surface without realizing that there\u0026#39;s a vast network of interconnected mycelium beneath our feet. It is through this network that information can be shared, somewhat like neural connections in the brain.\u003c/p\u003e\n\u003cp\u003eThe present study examined how a wood-decaying mycelial network responded to two different situations: wood blocks placed in a circle versus cross arrangement. For example, if the fungi didn\u0026#39;t display decision-making skills, they would simply spread out from a central point without consideration for the position of the blocks. Remarkably, this is not what the researchers witnessed.\u003c/p\u003e\n\u003cp\u003eFor the cross arrangement, the degree of connection was greater in the outermost four blocks. It was hypothesized that this was because the outermost blocks can serve as \u0026#34;outposts\u0026#34; for the mycelial network to embark in foraging expeditions, therefore more dense connections were required. In the circle arrangement, the degree of connection was the same at any given block. However, the dead centre of the circle remained clear. It was proposed that the mycelial network did not see a benefit in overextending itself in an already well-populated area.\u003c/p\u003e\n\u003cp\u003eThese findings suggest that the mycelial network was able to communicate information about its surroundings throughout the entire network, and change its direction of growth accordingly based on the shape.\u003c/p\u003e\n\u003cp\u003eOur comprehension of the mysterious world of fungi is limited, especially when compared to our knowledge of plants and animals. This research will help us better understand how biotic ecosystems function and how different types of cognition evolved in organisms.\u003c/p\u003e\n\u003cp\u003eThese results were published in Fungal Ecology on September 12, 2024.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
