{
  "id": "a2c8d83f-f8c8-445d-ac17-9592c10afb14",
  "title": "Robert Kennedy Jr. \u0026 His Doctor Friends May Just Be Getting Started",
  "link": "https://sciencebasedmedicine.org/too-late/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=too-late",
  "description": "Doctors who are concerned about members of our profession enabling powerful anti-vaxx disinformation agents should speak up before it's too late. But its probably too late already. The post Robert Kennedy Jr. \u0026 His Doctor Friends May Just Be Getting Started first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Fri, 08 Nov 2024 08:39:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 9073,
  "excerpt": "Doctors who are concerned about members of our profession enabling powerful anti-vaxx disinformation agents should speak up before it's too late. But its probably too late already.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Previously, I shared a Fox New article from 2023 titled Dr. Makary on RFK Jr’s Criticism of the ‘Medical Industrial Complex’: Saying Things ‘People Know Are True’. That article quoted Dr. Marty Makary as saying about Kennedy’s pandemic book “100% of it was true”. Dr. Makary also said: One thing RFK Jr. did is he would post true stories of children who died immediately after the vaccine. These were otherwise healthy children. As with most things Dr. Makary says, that was false. The unsurprising and horrible truth was discussed in an article titled RFK Jr. Spent Years Stoking Fear And Mistrust Of Vaccines. These People Were Hurt By His Work. It said: When 12-year-old Braden Fahey collapsed during football practice and died, it was just the beginning of his parents’ nightmare. Deep in their grief a few months later, Gina and Padrig Fahey received news that shocked them to their core: A favorite photo of their beloved son was plastered on the cover of a book that falsely argues COVID-19 vaccines caused a spike of sudden deaths among healthy young people. The book, called “Cause Unknown,” was co-published by an anti-vaccine group led by Robert F. Kennedy Jr., President John F. Kennedy’s nephew, who is now running for president. Kennedy wrote the foreword and promoted the book, tweeting that it details data showing “ COVID shots are a crime against humanity.” The Faheys couldn’t understand how Braden’s face appeared on the book’s cover, or why his name appeared inside it. Braden never received the vaccine. His death in August 2022 was due to a malformed blood vessel in his brain. No one ever contacted them to ask about their son’s death, or for permission to use the photo. No one asked to confirm the date of his death — which the book misdated by a year. When the Faheys and residents of their town in California tried to contact the publisher and author to get Braden and his picture taken out of the book, no one responded. “We reached out in every way possible,” Gina Fahey told The Associated Press in an emotional interview. “We waited months and months to hear back, and nothing.” We need to be clear where we are right now and how we got here. Kennedy is a lying conman who used dead children and ignored their grieving parents to spread anti-vaxx propaganda during a deadly pandemic. Dr. Makary is a slick-speaking, media darling with political connections, who used his stellar credentials to convince people that Kennedy is an honest broker. Dr. Makary was not alone. Many other highly-credentialed doctors similarly sanewashed Kennedy. Today, Kennedy might wield great power and bring these doctors along with him. However, all of that is in the past, and there’s nothing to be done about it now. Yet, Kennedy and the doctors who normalized him are just getting warmed up and the risks couldn’t be higher. As Dr. Allison Neitzel discussed, Kennedy is considering people like Drs. Makary, as well as Drs. Jay Bhattacharya and Joseph Ladapo, for positions of great authority. Their pro-infection philosophy meshed with his. Currently, the headlines read RFK Jr. Says ‘Entire Departments’ at FDA ‘Have To Go’, and he’s repeated these threats, along with other rank quackery, on social media It’s not outlandish to imagine that he’ll purge pro-vaccine scientists if given the chance. The CDC might become a hotbed of anti-vaccine and alt-med disinformation. It might be impossible to get a COVID booster in 2025. Other vaccines might follow. “100% of it was true” Maybe I am being overwrought, but we are already at a point that would have been unbelievable just 6 months ago. It’s foolish not to consider the worst case scenarios moving forward. As Matt Field wrote in his article,  What Trump Might Do On Vaccines, Pandemics, Global Health, And More: I don’t believe that Robert F. Kennedy Jr. will be an integral part of the coming Trump administration, but rogue opinions and disinformation have already been normalized through Trump-Kennedy interactions. I expect that more Americans will share Kennedy’s vaccine skepticism four years from now, and if school vaccine mandates are no longer strongly supported, we can expect the resurgence of preventable childhood infections.  (On the other hand, if Kennedy does get an important appointment, and the scenario evolves, then the United States will proceed down a path of fatal science denialism, just as the former Soviet Union did under the influential biologist Trofirm Lysenko, who’s contrarian views on genetics led to the persecution of scientific critics and a retrenchment in Soviet science.) Doctors who are concerned that members of our profession are enabling powerful anti-vaxx disinformation agents should speak up before it’s too late. But it might be too late already. The medical profession was tested, and we chose silence. If measles and pertussis come roaring back, all we’ll have left is regret for missed opportunities. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts Posted by Jonathan Howard Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\"",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n\n        \n\u003carticle id=\"post-102011\"\u003e\n\n\t\t\n\t\u003cdiv\u003e\n\t\t\n\n\u003cp\u003ePreviously, I shared a Fox New article from 2023 titled \u003ca href=\"https://www.foxnews.com/media/dr-makary-rfk-jr-criticism-medical-industrial-complex-saying-things-people-know-true\"\u003eDr. Makary on RFK Jr’s Criticism of the ‘Medical Industrial Complex’: Saying Things ‘People Know Are True’\u003c/a\u003e. That article quoted Dr. Marty Makary as saying about Kennedy’s pandemic book “100% of it was true”.  Dr. Makary also said:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eOne thing RFK Jr. did is he would post true stories of children who died immediately after the vaccine. These were otherwise healthy children.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAs with most things Dr. Makary says, that was false. The unsurprising and horrible truth was discussed in an article titled \u003ca href=\"https://www.wric.com/news/politics/ap-rfk-jr-spent-years-stoking-fear-and-mistrust-of-vaccines-heres-who-gets-hurt-by-kennedys-work/\"\u003eRFK Jr. Spent Years Stoking Fear And Mistrust Of Vaccines. These People Were Hurt By His Work\u003c/a\u003e. It said:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhen 12-year-old Braden Fahey collapsed during football practice and died, it was just the beginning of his parents’ nightmare.\u003c/p\u003e\n\n\n\n\u003cp\u003eDeep in their grief a few months later, Gina and Padrig Fahey received news that shocked them to their core: A favorite photo of their beloved son was plastered on the cover of a book that falsely argues COVID-19 vaccines caused a spike of sudden deaths among healthy young people.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe book, called “Cause Unknown,” was co-published by an anti-vaccine group led by Robert F. Kennedy Jr., President John F. Kennedy’s nephew, who is now running for president. Kennedy wrote the foreword and promoted the book, tweeting that it details data showing “ COVID shots are a crime against humanity.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Faheys couldn’t understand how Braden’s face appeared on the book’s cover, or why his name appeared inside it.\u003c/p\u003e\n\n\n\n\u003cp\u003eBraden never received the vaccine. His death in August 2022 was due to a malformed blood vessel in his brain. No one ever contacted them to ask about their son’s death, or for permission to use the photo. No one asked to confirm the date of his death — which the book misdated by a year. When the Faheys and residents of their town in California tried to contact the publisher and author to get Braden and his picture taken out of the book, no one responded.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We reached out in every way possible,” Gina Fahey told The Associated Press in an emotional interview. “We waited months and months to hear back, and nothing.”\u003c/p\u003e\n\n\n\n\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWe need to be clear where we are right now and how we got here. Kennedy is a lying conman who used dead children and ignored their grieving parents to spread anti-vaxx propaganda during a deadly pandemic. Dr. Makary is a slick-speaking, \u003ca href=\"https://sciencebasedmedicine.org/paul/\" title=\"\"\u003emedia darling\u003c/a\u003e with \u003ca href=\"https://oversight.house.gov/roundtable/preparing-for-the-future-by-learning-from-the-past-examining-covid-policy-decisions/\"\u003epolitical connections\u003c/a\u003e, who used his stellar credentials to convince people that Kennedy is an honest broker. Dr. Makary was not alone. Many other highly-credentialed doctors similarly sanewashed Kennedy. Today, Kennedy might wield great power and bring these doctors along with him.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, all of that is in the past, and there’s nothing to be done about it now.\u003c/p\u003e\n\n\n\n\u003cp\u003eYet, Kennedy and the doctors who normalized him are just getting warmed up and the risks \u003ca href=\"https://sciencebasedmedicine.org/rfk-jr-is-now-an-extinction-level-threat-to-federal-public-health-programs-and-science-based-health-policy/\" title=\"\"\u003ecouldn’t be higher\u003c/a\u003e. As Dr. Allison Neitzel discussed, \u003ca href=\"https://sciencebasedmedicine.org/bhattacharya-for-the-cdc/\" title=\"\"\u003eKennedy is considering\u003c/a\u003e people like Drs. Makary, as well as Drs. Jay Bhattacharya and Joseph Ladapo, for positions of great authority.  Their pro-infection philosophy meshed with his.  Currently, the headlines read \u003ca href=\"https://thehill.com/homenews/campaign/4976746-robert-kennedy-potential-role-trump-administration/\" title=\"\"\u003eRFK Jr. Says ‘Entire Departments’ at FDA ‘Have To Go’,\u003c/a\u003e and he’s repeated these threats, along with other rank quackery, on social media It’s not outlandish to imagine that he’ll purge pro-vaccine scientists if given the chance.  The CDC might become a hotbed of anti-vaccine and alt-med disinformation. It might be impossible to get a COVID booster in 2025. Other vaccines might follow.  \u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"510\" height=\"546\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image.png 510w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-480x514.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-187x200.png 187w\" sizes=\"(max-width: 510px) 100vw, 510px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e“100% of it was true”\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eMaybe I am being overwrought, but we are already at a point that would have been unbelievable just 6 months ago. It’s foolish not to consider the worst case scenarios moving forward.  As Matt Field wrote in his article,  \u003ca href=\"https://thebulletin.org/2024/11/what-trump-might-do-on-vaccines-pandemics-global-health-and-more/\"\u003eWhat Trump Might Do On Vaccines, Pandemics, Global Health, And More\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eI don’t believe that Robert F. Kennedy Jr. will be an integral part of the coming Trump administration, but rogue opinions and disinformation have already been normalized through Trump-Kennedy interactions. I expect that more Americans will share Kennedy’s vaccine skepticism four years from now, and if school vaccine mandates are no longer strongly supported, we can expect the resurgence of preventable childhood infections.  (On the other hand, if Kennedy does get an important appointment, and the scenario evolves, then the United States will proceed down a path of fatal science denialism, just as the former Soviet Union did under the influential biologist Trofirm Lysenko, who’s contrarian views on genetics led to the persecution of scientific critics and a retrenchment in Soviet science.)\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eDoctors who are concerned that members of our profession are enabling powerful anti-vaxx disinformation agents should speak up before it’s too late.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut it might be too late already. The medical profession was tested, and we chose silence. If measles and pertussis come roaring back, all we’ll have left is regret for missed opportunities.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#eb8184858a9f838a85c583849c8a998fab85929e878a858c84858ec584998c\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\n\n\t\n\t\t\t\n\t\n\u003c/article\u003e\n\t\u003cdiv\u003e\n\t\t\t\u003ch3\u003e\n\t\t\t\t\t\t\t\t\tPosted by\t\t\t\t\t\t\t\tJonathan Howard\u003c/h3\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eDr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;\u003c/p\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/div\u003e\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n            \n\n            \n\n\n    \u003c/main\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-08T03:39:00-05:00",
  "modifiedTime": "2024-11-08T03:24:15Z"
}
