{
  "id": "ac2d3785-fcf0-41e1-88cb-3e403da66196",
  "title": "A look into 'mirror molecules' may lead to new medicines",
  "link": "https://phys.org/news/2024-10-mirror-molecules-medicines.html",
  "description": "A University of Texas at Dallas chemist and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \"mirror molecules\" found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions.",
  "author": "",
  "published": "Thu, 10 Oct 2024 16:25:51 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Biochemistry Analytical Chemistry"
  ],
  "byline": "Amanda Siegfried",
  "length": 6499,
  "excerpt": "A University of Texas at Dallas chemist and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \"mirror molecules\" found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "University of Texas at Dallas chemist Dr. Filippo Romiti, assistant professor of chemistry and biochemistry, and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \"mirror molecules\" found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions. The research was published in the Oct. 11, 2024, issue of the journal Science. Credit: The University of Texas at Dallas A University of Texas at Dallas chemist and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \"mirror molecules\" found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions. The results are important, because while the left- and right-handed versions (enantiomers) of chemical compounds have identical chemical properties, they differ in how they react in the human body. Developing cost-effective ways to synthesize only the version with a desired biological effect is critical to medicinal chemistry. In a study published in Science, the researchers describe how their chemical synthesis method can quickly, efficiently and in a scalable manner produce a sample that is purely one enantiomer of a mirror-image pair of molecules, as opposed to a mixture of the two. The new method involves adding prenyl groups—molecules made of five carbon atoms—to enones by means of a newly developed catalyst in one step in the synthesis process. \"Adding a prenyl group is the way nature assembles these molecules, but it has been challenging for scientists to replicate this successfully,\" said Dr. Filippo Romiti, assistant professor of chemistry and biochemistry in the School of Natural Sciences and Mathematics at UT Dallas and a corresponding author of the study. \"Nature is the best synthetic chemist of all; she's way ahead of us. This research represents a paradigm shift in the way we can now synthesize large quantities of biologically active molecules and test them for therapeutic activity,\" said Romiti, who is also a Cancer Prevention \u0026 Research Institute of Texas (CPRIT) Scholar. Naturally occurring compounds are a significant source of potential new medicines, but because they often occur only in minute quantities, scientists and pharmaceutical companies must develop methods to synthesize larger amounts to test in the lab or to manufacture into drugs. In their study, the researchers demonstrated how incorporating their new chemical reaction resulted in a synthesis process that reached completion in about 15 minutes at room temperature, which is more energy-efficient than having to heat or cool substances significantly during a reaction. Romiti collaborated with researchers at Boston College, the University of Pittsburgh and the University of Strasbourg in France to develop the new chemical reaction. Romiti's role involved creating the synthesis process. The researchers developed their method as part of an effort to synthesize polycyclic polyprenylated acylphloroglucinols (PPAPs), which are a class of more than 400 natural products with a broad spectrum of bioactivity, including combating cancer, HIV, Alzheimer's disease, depression, epilepsy and obesity. Romiti and his colleagues demonstrated a proof of concept by synthesizing enantiomers of eight PPAPs, including nemorosonol, a chemical derived from a Brazilian tree that has been shown by other researchers to have antibiotic activity. \"For 20 years, we've known that nemorosonol is antimicrobial, but which enantiomer is responsible? Is it one or both?\" Romiti said. \"It could be that one version has this property, but the other does not.\" Romiti and his colleagues tested their nemorosonol enantiomer against lung and breast cancer cell lines provided by Dr. John Minna, director of the Hamon Center for Therapeutic Oncology Research at UT Southwestern Medical Center. \"Our entantiomer of nemorosonol had pretty decent effects against cancer cell lines,\" Romiti said. \"This was very interesting and could only have been discovered if we had access to large quantities of a pure entantiomeric sample to test.\" Romiti said that more research will be needed to confirm whether one nemorosonol enantiomer is specifically antimicrobial and the other anticancer. The study results could impact drug discovery and translational medicine in several ways. In addition to informing scalable and more efficient drug-manufacturing processes, the findings will enable researchers to make more efficiently natural product analogs, which are optimized versions of the natural product that are more potent or selective in how they work in the body. \"We developed this process to be as pharma-friendly as possible,\" Romiti said. \"This is a new tool for chemists and biologists to study 400 new drug leads that we can make, plus their analogs, and test their biological activity. We now have access to potent natural products that we previously could not synthesize in the lab.\" Romiti said the next step will be to apply the new reaction to the synthesis of other classes of natural products, in addition to PPAPs. More information: Shawn Ng et al, Catalytic prenyl conjugate additions for synthesis of enantiomerically enriched PPAPs, Science (2024). DOI: 10.1126/science.adr8612 Citation: A look into 'mirror molecules' may lead to new medicines (2024, October 10) retrieved 11 October 2024 from https://phys.org/news/2024-10-mirror-molecules-medicines.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/a-look-into-mirror-mol.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/a-look-into-mirror-mol.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/a-look-into-mirror-mol.jpg\" data-sub-html=\"University of Texas at Dallas chemist Dr. Filippo Romiti, assistant professor of chemistry and biochemistry, and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \u0026#34;mirror molecules\u0026#34; found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions. The research was published in the Oct. 11, 2024, issue of the journal \u0026lt;i\u0026gt;Science\u0026lt;/i\u0026gt;. Credit: The University of Texas at Dallas\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/a-look-into-mirror-mol.jpg\" alt=\"A look into \u0026#39;mirror molecules\u0026#39; may lead to new medicines\" title=\"University of Texas at Dallas chemist Dr. Filippo Romiti, assistant professor of chemistry and biochemistry, and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \u0026#34;mirror molecules\u0026#34; found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions. The research was published in the Oct. 11, 2024, issue of the journal Science. Credit: The University of Texas at Dallas\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                University of Texas at Dallas chemist Dr. Filippo Romiti, assistant professor of chemistry and biochemistry, and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \u0026#34;mirror molecules\u0026#34; found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions. The research was published in the Oct. 11, 2024, issue of the journal \u003ci\u003eScience\u003c/i\u003e. Credit: The University of Texas at Dallas\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eA University of Texas at Dallas chemist and his colleagues have developed a new chemical reaction that will allow researchers to synthesize selectively the left-handed or right-handed versions of \u0026#34;mirror molecules\u0026#34; found in nature and assess them for potential use against cancer, infection, depression, inflammation and a host of other conditions.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe results are important, because while the left- and right-handed versions (enantiomers) of \u003ca href=\"https://phys.org/tags/chemical+compounds/\" rel=\"tag\"\u003echemical compounds\u003c/a\u003e have identical chemical properties, they differ in how they react in the human body. Developing cost-effective ways to synthesize only the version with a desired biological effect is critical to \u003ca href=\"https://phys.org/tags/medicinal+chemistry/\" rel=\"tag\"\u003emedicinal chemistry\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn a study \u003ca href=\"https://www.science.org/doi/10.1126/science.adr8612\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eScience\u003c/i\u003e, the researchers describe how their chemical synthesis method can quickly, efficiently and in a scalable manner produce a sample that is purely one enantiomer of a mirror-image pair of molecules, as opposed to a mixture of the two. The new method involves adding prenyl groups—molecules made of five carbon atoms—to enones by means of a newly developed catalyst in one step in the \u003ca href=\"https://phys.org/tags/synthesis+process/\" rel=\"tag\"\u003esynthesis process\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Adding a prenyl group is the way nature assembles these molecules, but it has been challenging for scientists to replicate this successfully,\u0026#34; said Dr. Filippo Romiti, assistant professor of chemistry and biochemistry in the School of Natural Sciences and Mathematics at UT Dallas and a corresponding author of the study.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Nature is the best synthetic chemist of all; she\u0026#39;s way ahead of us. This research represents a paradigm shift in the way we can now synthesize large quantities of biologically active molecules and test them for therapeutic activity,\u0026#34; said Romiti, who is also a Cancer Prevention \u0026amp; Research Institute of Texas (CPRIT) Scholar.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eNaturally occurring compounds are a significant source of potential new medicines, but because they often occur only in minute quantities, scientists and \u003ca href=\"https://phys.org/tags/pharmaceutical+companies/\" rel=\"tag\"\u003epharmaceutical companies\u003c/a\u003e must develop methods to synthesize larger amounts to test in the lab or to manufacture into drugs.\u003c/p\u003e\n\u003cp\u003eIn their study, the researchers demonstrated how incorporating their new chemical reaction resulted in a synthesis process that reached completion in about 15 minutes at room temperature, which is more energy-efficient than having to heat or cool substances significantly during a reaction.\u003c/p\u003e\n\u003cp\u003eRomiti collaborated with researchers at Boston College, the University of Pittsburgh and the University of Strasbourg in France to develop the \u003ca href=\"https://phys.org/tags/new+chemical+reaction/\" rel=\"tag\"\u003enew chemical reaction\u003c/a\u003e. Romiti\u0026#39;s role involved creating the synthesis process.\u003c/p\u003e\n\u003cp\u003eThe researchers developed their method as part of an effort to synthesize polycyclic polyprenylated acylphloroglucinols (PPAPs), which are a class of more than 400 \u003ca href=\"https://phys.org/tags/natural+products/\" rel=\"tag\"\u003enatural products\u003c/a\u003e with a broad spectrum of bioactivity, including combating cancer, HIV, Alzheimer\u0026#39;s disease, depression, epilepsy and obesity.\u003c/p\u003e\n\u003cp\u003eRomiti and his colleagues demonstrated a proof of concept by synthesizing enantiomers of eight PPAPs, including nemorosonol, a chemical derived from a Brazilian tree that has been shown by other researchers to have antibiotic activity.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u0026#34;For 20 years, we\u0026#39;ve known that nemorosonol is antimicrobial, but which enantiomer is responsible? Is it one or both?\u0026#34; Romiti said. \u0026#34;It could be that one version has this property, but the other does not.\u0026#34;\u003c/p\u003e\n\u003cp\u003eRomiti and his colleagues tested their nemorosonol enantiomer against lung and breast \u003ca href=\"https://phys.org/tags/cancer+cell+lines/\" rel=\"tag\"\u003ecancer cell lines\u003c/a\u003e provided by Dr. John Minna, director of the Hamon Center for Therapeutic Oncology Research at UT Southwestern Medical Center.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our entantiomer of nemorosonol had pretty decent effects against cancer cell lines,\u0026#34; Romiti said. \u0026#34;This was very interesting and could only have been discovered if we had access to large quantities of a pure entantiomeric sample to test.\u0026#34;\u003c/p\u003e\n\u003cp\u003eRomiti said that more research will be needed to confirm whether one nemorosonol enantiomer is specifically antimicrobial and the other anticancer.\u003c/p\u003e\n\u003cp\u003eThe study results could impact drug discovery and translational medicine in several ways. In addition to informing scalable and more efficient drug-manufacturing processes, the findings will enable researchers to make more efficiently natural product analogs, which are optimized versions of the natural product that are more potent or selective in how they work in the body.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We developed this process to be as pharma-friendly as possible,\u0026#34; Romiti said. \u0026#34;This is a new tool for chemists and biologists to study 400 new drug leads that we can make, plus their analogs, and test their biological activity. We now have access to potent natural products that we previously could not synthesize in the lab.\u0026#34;\u003c/p\u003e\n\u003cp\u003eRomiti said the next step will be to apply the new reaction to the synthesis of other classes of natural products, in addition to PPAPs.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tShawn Ng et al, Catalytic prenyl conjugate additions for synthesis of enantiomerically enriched PPAPs, \u003ci\u003eScience\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1126/science.adr8612\" target=\"_blank\"\u003eDOI: 10.1126/science.adr8612\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tA look into \u0026#39;mirror molecules\u0026#39; may lead to new medicines (2024, October 10)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 11 October 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-10-mirror-molecules-medicines.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-10T16:25:51-04:00",
  "modifiedTime": null
}
