{
  "id": "b2e4e811-312c-47c2-992c-38c5c5e970b5",
  "title": "Underwater caves yield new clues about Sicily's first residents",
  "link": "https://www.sciencedaily.com/releases/2024/10/241009144855.htm",
  "description": "Archaeological surveys suggest that coastal and underwater cave sites in southern Sicily contain important new clues about the path and fate of early human migrants to the island.",
  "author": "",
  "published": "Wed, 09 Oct 2024 14:48:55 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 7759,
  "excerpt": "Archaeological surveys suggest that coastal and underwater cave sites in southern Sicily contain important new clues about the path and fate of early human migrants to the island.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Archaeological surveys led by scientists at Washington University in St. Louis suggest that coastal and underwater cave sites in southern Sicily contain important new clues about the path and fate of early human migrants to the island. A new study in PLOS ONE reports and assesses the contents of 25 caves and rock shelters, most of them first identified between 1870 and the 1990s but essentially lost to science over time. Study authors also conducted new land and underwater surveys in previously unexplored coastal areas and uncovered three new sites that contain potentially important archaeological sediments. \"What we are looking for is not just the first person who arrived, but the first community,\" said Ilaria Patania, an assistant professor of archaeology in Arts \u0026 Sciences. \"Understanding the timing of the initial colonization of Sicily provides key data for the pattern and mode of the early expansion of Homo sapiens into the Mediterranean.\" Sicily is considered by many scholars to be the earliest island in the region to be permanently occupied by human ancestors, but when and how the early migrants accomplished this feat remains unknown. Sicily is less than two miles from mainland Italy, but the water crossing would have been extremely difficult for early humans. Other studies have primarily focused on possible entry points on the island's northern side. \"This research shows that new ways of thinking and looking can reveal patterns that weren't visible before,\" said T.R. Kidder, the Edward S. and Tedi Macias Professor of anthropology in Arts \u0026 Sciences at WashU, a co-author of the new study. \"Previous scholars assumed that sites on the southern coast of Sicily would be eroded or too damaged to yield useful information,\" Kidder said. \"But finding underwater sites opens up a whole new terrain to study. It allows us to reconsider routes of migration of these earliest modern human ancestors.\" Dangerous water crossing Sicily, the largest Mediterranean island, is located just off the \"toe\" of Italy's boot. In the ancient Greek poem the \"Odyssey,\" Homer describes how Odysseus sailed his ship past the mythical sea monsters Scylla and Charybdis as he crossed the Sicily strait. The strait was well known to sailors of the past; they attributed the deadly forces of its waves and whirlpools to powerful monsters. In modern times, thousands of migrants from North Africa attempt to cross the strait each year. Many don't make it, some capsizing just a few hundred meters from landing. Patania, a native of the island of Sicily, has a deep respect for the power of the sea. Her grandfather was a fisherman who worked on the same shores she now studies. \"Very early on, I was taught that the sea can be a great resource,\" she said. \"At the same time, you never turn your back on the sea. The sea can be very dangerous.\" This idea plays out in her research. \"I'm very interested in how humans occupy marginal environments,\" Patania said. \"These are environments where if everything goes well, we are in perfect harmony with nature. But if something changes -- and this could be something like global climate change, or something smaller, like the arrival of a new animal -- it could be a catastrophe.\" Scholars of the region agree that humans had made it to Sicily by 16,000 years after the last glacial maximum. But that established date is puzzlingly late, given that humans are known to have dispersed by land into Siberia about 30,000 years earlier. The discrepancy has led some to wonder if humans actually arrived on Sicily much before the currently accepted dates. Also, no one yet knows whether humans arrived on Sicily by seafaring, or by foot over a land bridge -- or even what direction they came from. \"A challenge for understanding the spread of early modern human ancestors is that we don't fully understand how they spread and colonized the world at a very early stage,\" Kidder said. \"As Ilaria says, this is a very marginal environment. Did folks come down from Italy and cross the Straits of Messina, or did they come from the south along the African coast? Or, is it possible that they were island hopping across the Mediterranean? Locating sites on the south coast helps us consider pathways and thus modes of behavior.\" Eyes on the sea Patania leads a long-term research project focused on the early occupation of Sicily. \"In southeast Sicily, very few Upper Paleolithic sites have been excavated and analyzed using scientific methods,\" she said. \"Our project is still in its early stages, but already we have identified and assessed over 40 sites of interest, of which about 17 are sites that have been relocated with greater precision based on older identifications,\" Patania said. She and her team prepared for their recent cave explorations by poring through the archives of local town libraries in Sicily, reading historical bulletins and news articles as far back as the 19th century. The researchers identified potential sites and reviewed records and photographs of materials recovered by local avocational archaeologists. When possible, they interviewed workers that had been involved in earlier excavations, and they also talked with local recreational divers and fishermen. For example, one of the co-authors on the new study is a retired tugboat captain. He has no formal scientific training, but he spent decades working on the decks of boats in and around the Port of Augusta. \"The moment I said that I was looking for paleosols, and that paleosols look like clay dirt that could be red or gray underwater, he said, 'I know exactly what you are looking for,'\" Patania said. Patania also partnered with the superintendent of cultural and natural heritage of Siracusa and Ragusa (two provinces of Sicily) and the superintendent of the sea of Sicily to locate and recruit other local experts and stakeholders. As the research has progressed, Patania also has spoken with officers in the Italian navy about training members of their specialized dive team to help identify underwater archaeological features. These divers spend a lot of time in local waters completing their regular tasks related to clearing ordnance and other debris from World War II. \"We've started with the area close to the coast, and we're slowly going to move further out in the years to come,\" Patania said. Excavations continue Two of the new sites in the PLOS ONE study may contain Upper Paleolithic human occupation traces, including fossil fauna, study authors said. Corruggi is located at the southernmost tip of Sicily. The site was originally identified by other researchers in the 1940s. \"This site is where a second land bridge would have connected this island with the island of Malta,\" Patania said. \"When we inspected this site, we found teeth from a European wild ass and stone tools,\" she said. \"Analyzing the remains from this site might give us insight on the very last leg of the human journey south into the southernmost coast of Sicily and off toward Malta.\" During summer 2024, project team members worked on excavating the second site, a cave called Campolato. \"Here we have discovered evidence for sea-level changes caused by the last glaciation and a localized earthquake that we are still investigating,\" Patania said. \"We hope to reconstruct not only the timing of human occupation, but also the environment these people lived in and how they negotiated with natural events like earthquakes, climatic and environmental changes and maybe even volcanic eruptions,\" she said. Funding: The Early Occupation of Sicily Project is funded in part by The Leakey Foundation, the Rust Family Foundation and the Archaeological Institute of America, with the support of Italian and Sicilian governmental bodies.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eArchaeological surveys led by scientists at Washington University in St. Louis suggest that coastal and underwater cave sites in southern Sicily contain important new clues about the path and fate of early human migrants to the island.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eA new study in PLOS ONE reports and assesses the contents of 25 caves and rock shelters, most of them first identified between 1870 and the 1990s but essentially lost to science over time. Study authors also conducted new land and underwater surveys in previously unexplored coastal areas and uncovered three new sites that contain potentially important archaeological sediments.\u003c/p\u003e\n\u003cp\u003e\u0026#34;What we are looking for is not just the first person who arrived, but the first community,\u0026#34; said Ilaria Patania, an assistant professor of archaeology in Arts \u0026amp; Sciences. \u0026#34;Understanding the timing of the initial colonization of Sicily provides key data for the pattern and mode of the early expansion of Homo sapiens into the Mediterranean.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSicily is considered by many scholars to be the earliest island in the region to be permanently occupied by human ancestors, but when and how the early migrants accomplished this feat remains unknown. Sicily is less than two miles from mainland Italy, but the water crossing would have been extremely difficult for early humans.\u003c/p\u003e\n\u003cp\u003eOther studies have primarily focused on possible entry points on the island\u0026#39;s northern side.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This research shows that new ways of thinking and looking can reveal patterns that weren\u0026#39;t visible before,\u0026#34; said T.R. Kidder, the Edward S. and Tedi Macias Professor of anthropology in Arts \u0026amp; Sciences at WashU, a co-author of the new study.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Previous scholars assumed that sites on the southern coast of Sicily would be eroded or too damaged to yield useful information,\u0026#34; Kidder said. \u0026#34;But finding underwater sites opens up a whole new terrain to study. It allows us to reconsider routes of migration of these earliest modern human ancestors.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDangerous water crossing\u003c/strong\u003e\u003c/p\u003e\n\n\n\u003cp\u003eSicily, the largest Mediterranean island, is located just off the \u0026#34;toe\u0026#34; of Italy\u0026#39;s boot.\u003c/p\u003e\n\u003cp\u003eIn the ancient Greek poem the \u0026#34;Odyssey,\u0026#34; Homer describes how Odysseus sailed his ship past the mythical sea monsters Scylla and Charybdis as he crossed the Sicily strait. The strait was well known to sailors of the past; they attributed the deadly forces of its waves and whirlpools to powerful monsters.\u003c/p\u003e\n\u003cp\u003eIn modern times, thousands of migrants from North Africa attempt to cross the strait each year. Many don\u0026#39;t make it, some capsizing just a few hundred meters from landing.\u003c/p\u003e\n\u003cp\u003ePatania, a native of the island of Sicily, has a deep respect for the power of the sea. Her grandfather was a fisherman who worked on the same shores she now studies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Very early on, I was taught that the sea can be a great resource,\u0026#34; she said. \u0026#34;At the same time, you never turn your back on the sea. The sea can be very dangerous.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis idea plays out in her research. \u0026#34;I\u0026#39;m very interested in how humans occupy marginal environments,\u0026#34; Patania said. \u0026#34;These are environments where if everything goes well, we are in perfect harmony with nature. But if something changes -- and this could be something like global climate change, or something smaller, like the arrival of a new animal -- it could be a catastrophe.\u0026#34;\u003c/p\u003e\n\u003cp\u003eScholars of the region agree that humans had made it to Sicily by 16,000 years after the last glacial maximum. But that established date is puzzlingly late, given that humans are known to have dispersed by land into Siberia about 30,000 years earlier. The discrepancy has led some to wonder if humans actually arrived on Sicily much before the currently accepted dates.\u003c/p\u003e\n\n\n\u003cp\u003eAlso, no one yet knows whether humans arrived on Sicily by seafaring, or by foot over a land bridge -- or even what direction they came from.\u003c/p\u003e\n\u003cp\u003e\u0026#34;A challenge for understanding the spread of early modern human ancestors is that we don\u0026#39;t fully understand how they spread and colonized the world at a very early stage,\u0026#34; Kidder said. \u0026#34;As Ilaria says, this is a very marginal environment. Did folks come down from Italy and cross the Straits of Messina, or did they come from the south along the African coast? Or, is it possible that they were island hopping across the Mediterranean? Locating sites on the south coast helps us consider pathways and thus modes of behavior.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEyes on the sea\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePatania leads a long-term research project focused on the early occupation of Sicily. \u0026#34;In southeast Sicily, very few Upper Paleolithic sites have been excavated and analyzed using scientific methods,\u0026#34; she said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our project is still in its early stages, but already we have identified and assessed over 40 sites of interest, of which about 17 are sites that have been relocated with greater precision based on older identifications,\u0026#34; Patania said.\u003c/p\u003e\n\u003cp\u003eShe and her team prepared for their recent cave explorations by poring through the archives of local town libraries in Sicily, reading historical bulletins and news articles as far back as the 19th century.\u003c/p\u003e\n\u003cp\u003eThe researchers identified potential sites and reviewed records and photographs of materials recovered by local avocational archaeologists. When possible, they interviewed workers that had been involved in earlier excavations, and they also talked with local recreational divers and fishermen.\u003c/p\u003e\n\u003cp\u003eFor example, one of the co-authors on the new study is a retired tugboat captain. He has no formal scientific training, but he spent decades working on the decks of boats in and around the Port of Augusta.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The moment I said that I was looking for paleosols, and that paleosols look like clay dirt that could be red or gray underwater, he said, \u0026#39;I know exactly what you are looking for,\u0026#39;\u0026#34; Patania said.\u003c/p\u003e\n\u003cp\u003ePatania also partnered with the superintendent of cultural and natural heritage of Siracusa and Ragusa (two provinces of Sicily) and the superintendent of the sea of Sicily to locate and recruit other local experts and stakeholders.\u003c/p\u003e\n\u003cp\u003eAs the research has progressed, Patania also has spoken with officers in the Italian navy about training members of their specialized dive team to help identify underwater archaeological features. These divers spend a lot of time in local waters completing their regular tasks related to clearing ordnance and other debris from World War II.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We\u0026#39;ve started with the area close to the coast, and we\u0026#39;re slowly going to move further out in the years to come,\u0026#34; Patania said.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExcavations continue\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTwo of the new sites in the PLOS ONE study may contain Upper Paleolithic human occupation traces, including fossil fauna, study authors said.\u003c/p\u003e\n\u003cp\u003eCorruggi is located at the southernmost tip of Sicily. The site was originally identified by other researchers in the 1940s.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This site is where a second land bridge would have connected this island with the island of Malta,\u0026#34; Patania said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;When we inspected this site, we found teeth from a European wild ass and stone tools,\u0026#34; she said. \u0026#34;Analyzing the remains from this site might give us insight on the very last leg of the human journey south into the southernmost coast of Sicily and off toward Malta.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDuring summer 2024, project team members worked on excavating the second site, a cave called Campolato.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Here we have discovered evidence for sea-level changes caused by the last glaciation and a localized earthquake that we are still investigating,\u0026#34; Patania said.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We hope to reconstruct not only the timing of human occupation, but also the environment these people lived in and how they negotiated with natural events like earthquakes, climatic and environmental changes and maybe even volcanic eruptions,\u0026#34; she said.\u003c/p\u003e\n\u003cp\u003eFunding: The Early Occupation of Sicily Project is funded in part by The Leakey Foundation, the Rust Family Foundation and the Archaeological Institute of America, with the support of Italian and Sicilian governmental bodies.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": null,
  "modifiedTime": null
}
