{
  "id": "b38005c8-dc94-4d6e-a3b0-b3bd009e7384",
  "title": "The Cure for Self-Importance",
  "link": "https://www.stitcher.com",
  "description": "When we meet new people, we’re often drawn to those with a commanding presence or a dazzling personality. But it turns out that a very different trait — humility — is important in the long term. This week, in the first of a two-part discussion, we talk with psychologist Daryl Van Tongeren about different kinds of humility, and how this overlooked quality can play a powerful role in workplace dynamics and romantic relationships. If you like today's episode, be sure to check out part two of our conversation, exclusively for Hidden Brain+ listeners. We talk with Daryl Van Tongeren about existential humility — being open to the idea we might be wrong about life's biggest unknowns. It's the episode called \"Asking the Big Questions.\" To listen to Hidden Brain+ with a free seven-day trial, go to apple.co/hiddenbrain or support.hiddenbrain.org.",
  "author": "Hidden Brain Media",
  "published": "Mon, 5 Aug 2024 18:10:00 +0000",
  "source": "https://feeds.npr.org/510308/podcast.xml",
  "categories": null,
  "byline": "",
  "length": 384,
  "excerpt": "Stitcher is the easiest way to listen, download, and discover podcasts for free across iOS, Android, Web, and more. Access exclusive podcasts from your favorite hosts with Stitcher Premium.",
  "siteName": "Stitcher",
  "favicon": "https://www.stitcher.com/favicons/apple-touch-icon.png",
  "text": "We’re proud to be home to some of the best production talent around -- a team of people who make incredible podcasts for our Stitcher Studios original network. And, we not only help our internal creators drive revenue for their shows but also support the larger creator community by helping them monetize their work through the SiriusXM Podcast Network, PodSwag, and Stitcher Premium.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-v-15421cbf=\"\" data-v-15421cbf=\"\"\u003e\u003cp data-v-15421cbf=\"\"\u003e\n          We’re proud to be home to some of the best production talent around -- a team of people who make incredible podcasts for our Stitcher Studios original network. And, we not only help our internal creators drive revenue for their shows but also support the larger creator community by helping them monetize their work through the SiriusXM Podcast Network, PodSwag, and Stitcher Premium.\n        \u003c/p\u003e  \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
