{
  "id": "c433f5d4-6cb4-4971-8033-5c0cbb0bca58",
  "title": "Should farm fields be used for crops or solar? Research suggests both",
  "link": "https://phys.org/news/2025-04-farm-fields-crops-solar.html",
  "description": "As farmers debate whether fields should be used for agriculture or solar panels, new research from Michigan State University says the answer could be both.",
  "author": "",
  "published": "Mon, 21 Apr 2025 17:08:06 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Biotechnology Agriculture"
  ],
  "byline": "Michigan State University",
  "length": 5759,
  "excerpt": "As farmers debate whether fields should be used for agriculture or solar panels, new research from Michigan State University says the answer could be both.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Conceptual diagram of trade-offs and co-benefits with agrisolar, agrivoltaic and ecovoltaic co-location. Credit: Nature Sustainability (2025). DOI: 10.1038/s41893-025-01546-4 As farmers debate whether fields should be used for agriculture or solar panels, new research from Michigan State University says the answer could be both. Jake Stid, a graduate student in the College of Natural Science Hydrogeology Lab, analyzed remote sensing and aerial imagery to study how fields have been used in California for the last 25 years. Using databases to estimate revenues and costs, Stid found that farmers who used a small percentage of their land for solar arrays were more financially secure per acre than those who didn't. His research, now published in Nature Sustainability, could provide a new roadmap to solvency for farmers struggling to pay the bills. Instead of converting entire fields to solar arrays, Stid hopes this research will help more farmers decide to keep producing crops by strategically placing arrays on lower-yield spots in their fields. \"The conversation shouldn't be as much about solar or agriculture, but solar and agriculture,\" Stid said. \"They can work together, and it can be a collaboration rather than a conflict.\" Stid's work with solar panels began when he joined the lab of Anthony Kendall, an MSU assistant professor who's also a co-author on the paper. Kendall saw Stid working with Google Earth Engine, a public satellite-image database and cloud computing tool. A casual suggestion that Stid try to pinpoint solar panels on the landscape sparked his curiosity. He narrowed his focus to the California region for multiple reasons. The state boasts some of the most valuable and productive agricultural land in the United States, and it's a nationwide leader in solar energy production and installation. As increasingly extreme weather threatens food, energy and water resources, new energy sources have emerged, such as solar, to help decrease carbon emissions. The solar boom has led to concerns of reduced food production, especially as an expanding population and growing consumption place a greater strain on agriculture. Because of these competing interests, some farmers have turned to what's called a colocation method: purposefully installing solar arrays alongside crops to maximize the landscape's production. Stid wanted to find out how these colocated installations affected a farmer's bottom line and how that compared to conventional solar arrays where entire fields are turned into solar farms versus farms that continue to grow crops with no solar. \"We're taking a balanced approach to not just focus on the negatives or the positives, but to take them both together to look more deeply at what people are actually doing on the landscape,\" Stid said. \"We're asking what it means and how we can better plan for the future.\" The team used the solar panel footprint in California previously published by Stid in 2022. From there, they used available data sets to calculate that 86,000 people could have been fed by what's now solar-occupied land. Then, they used crop cost studies from the University of California-Davis, U.S. annual crop prices, the California Water Rights Fee and other data to calculate the average farmer's costs and revenue. They modeled solar electricity production from each installation to estimate how much of a farmer's costs could be offset by selling energy back to the grid. The results confirmed their hypothesis—farmers who used a few acres of land for solar arrays had more financial stability than those who took an all-or-nothing approach to solar. They spent less on fertilizer, water and farming supplies, and the income from selling energy from their solar arrays made up for the decrease in crops produced. They were even likely to save water by offsetting irrigation, which could benefit the water-stressed region. \"If I'm a farmer, these two acres of solar arrays are going to pay me a certain amount of money throughout the year,\" Stid said. \"I don't have to worry about yield instability, or whether it's going to be a wet or dry year.\" Looking ahead, Stid hopes to expand his research to look at food production and solar arrays across the continental U.S. He's also working with Kendall to explore other ways that solar arrays impact the environment. He hopes this research becomes part of the conversation as farmers debate the best way to use land without hurting food production. Solar arrays can be part of a sustainable food system if they're placed deliberately. \"There are arguments to be made that that's a more resilient landscape,\" Stid said. \"You have more benefits being distributed to more people, which we think is impactful.\" More information: Jacob T. Stid et al, Impacts of agrisolar co-location on the food–energy–water nexus and economic security, Nature Sustainability (2025). DOI: 10.1038/s41893-025-01546-4 Journal information: Nature Sustainability",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/should-farm-fields-be.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1212040\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/should-farm-fields-be.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/should-farm-fields-be.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/should-farm-fields-be.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/should-farm-fields-be.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/should-farm-fields-be.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/should-farm-fields-be.jpg\" width=\"800\" height=\"400\" alt=\"Should farm fields be used for crops or solar? Research suggests both\" title=\"Conceptual diagram of trade-offs and co-benefits with agrisolar, agrivoltaic and ecovoltaic co-location. Credit: Nature Sustainability (2025). DOI: 10.1038/s41893-025-01546-4\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eConceptual diagram of trade-offs and co-benefits with agrisolar, agrivoltaic and ecovoltaic co-location. Credit: \u003ci\u003eNature Sustainability\u003c/i\u003e (2025). DOI: 10.1038/s41893-025-01546-4\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eAs farmers debate whether fields should be used for agriculture or solar panels, new research from Michigan State University says the answer could be both.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eJake Stid, a graduate student in the College of Natural Science Hydrogeology Lab, analyzed \u003ca href=\"https://phys.org/tags/remote+sensing/\" rel=\"tag\"\u003eremote sensing\u003c/a\u003e and aerial imagery to study how fields have been used in California for the last 25 years. Using databases to estimate revenues and costs, Stid found that farmers who used a small percentage of their land for \u003ca href=\"https://phys.org/tags/solar+arrays/\" rel=\"tag\"\u003esolar arrays\u003c/a\u003e were more financially secure per acre than those who didn\u0026#39;t.\u003c/p\u003e\n\u003cp\u003eHis research, now \u003ca href=\"https://www.nature.com/articles/s41893-025-01546-4\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eNature Sustainability\u003c/i\u003e, could provide a new roadmap to solvency for farmers struggling to pay the bills. Instead of converting entire fields to solar arrays, Stid hopes this research will help more farmers decide to keep producing crops by strategically placing arrays on lower-yield spots in their fields.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The conversation shouldn\u0026#39;t be as much about solar or agriculture, but solar and agriculture,\u0026#34; Stid said. \u0026#34;They can work together, and it can be a collaboration rather than a conflict.\u0026#34;\u003c/p\u003e\n\u003cp\u003eStid\u0026#39;s work with solar panels began when he joined the lab of Anthony Kendall, an MSU assistant professor who\u0026#39;s also a co-author on the paper. Kendall saw Stid working with Google Earth Engine, a public satellite-image database and cloud computing tool. A casual suggestion that Stid try to pinpoint \u003ca href=\"https://phys.org/tags/solar+panels/\" rel=\"tag\"\u003esolar panels\u003c/a\u003e on the landscape sparked his curiosity.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eHe narrowed his focus to the California region for multiple reasons. The state boasts some of the most valuable and productive agricultural land in the United States, and it\u0026#39;s a nationwide leader in solar energy production and installation.\u003c/p\u003e\n\u003cp\u003eAs increasingly extreme weather threatens food, energy and \u003ca href=\"https://phys.org/tags/water+resources/\" rel=\"tag\"\u003ewater resources\u003c/a\u003e, new energy sources have emerged, such as solar, to help decrease carbon emissions. The solar boom has led to concerns of reduced food production, especially as an expanding population and growing consumption place a greater strain on agriculture.\u003c/p\u003e\n\u003cp\u003eBecause of these competing interests, some farmers have turned to what\u0026#39;s called a colocation method: purposefully installing solar arrays alongside crops to maximize the landscape\u0026#39;s production.\u003c/p\u003e\n\u003cp\u003eStid wanted to find out how these colocated installations affected a farmer\u0026#39;s bottom line and how that compared to conventional solar arrays where entire fields are turned into \u003ca href=\"https://phys.org/tags/solar+farms/\" rel=\"tag\"\u003esolar farms\u003c/a\u003e versus farms that continue to grow crops with no solar.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We\u0026#39;re taking a balanced approach to not just focus on the negatives or the positives, but to take them both together to look more deeply at what people are actually doing on the landscape,\u0026#34; Stid said. \u0026#34;We\u0026#39;re asking what it means and how we can better plan for the future.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe team used the solar panel footprint in California previously published by Stid in 2022. From there, they used available data sets to calculate that 86,000 people could have been fed by what\u0026#39;s now solar-occupied land.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eThen, they used crop cost studies from the University of California-Davis, U.S. annual crop prices, the California Water Rights Fee and other data to calculate the average farmer\u0026#39;s costs and revenue. They modeled solar electricity production from each installation to estimate how much of a farmer\u0026#39;s costs could be offset by selling energy back to the grid.\u003c/p\u003e\n\u003cp\u003eThe results confirmed their hypothesis—farmers who used a few acres of land for solar arrays had more \u003ca href=\"https://phys.org/tags/financial+stability/\" rel=\"tag\"\u003efinancial stability\u003c/a\u003e than those who took an all-or-nothing approach to solar. They spent less on fertilizer, water and farming supplies, and the income from selling energy from their solar arrays made up for the decrease in crops produced. They were even likely to save water by offsetting irrigation, which could benefit the water-stressed region.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If I\u0026#39;m a farmer, these two acres of solar arrays are going to pay me a certain amount of money throughout the year,\u0026#34; Stid said. \u0026#34;I don\u0026#39;t have to worry about yield instability, or whether it\u0026#39;s going to be a wet or dry year.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLooking ahead, Stid hopes to expand his research to look at food production and solar arrays across the continental U.S. He\u0026#39;s also working with Kendall to explore other ways that solar arrays impact the environment.\u003c/p\u003e\n\u003cp\u003eHe hopes this research becomes part of the conversation as farmers debate the best way to use land without hurting food production. Solar arrays can be part of a sustainable food system if they\u0026#39;re placed deliberately.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There are arguments to be made that that\u0026#39;s a more resilient landscape,\u0026#34; Stid said. \u0026#34;You have more benefits being distributed to more people, which we think is impactful.\u0026#34;\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Jacob T. Stid et al, Impacts of agrisolar co-location on the food–energy–water nexus and economic security, \u003ci\u003eNature Sustainability\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1038/s41893-025-01546-4\" target=\"_blank\"\u003eDOI: 10.1038/s41893-025-01546-4\u003c/a\u003e\n                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/nature-sustainability/\"\u003eNature Sustainability\u003c/a\u003e\n                                                                                    \u003ca href=\"https://www.nature.com/natsustain/\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-21T17:08:06-04:00",
  "modifiedTime": null
}
