{
  "id": "c5d9dc35-3f08-4f35-b10c-fbda5a6efac0",
  "title": "New gene-editing therapy shows early success in fighting advanced GI cancers",
  "link": "https://www.sciencedaily.com/releases/2025/05/250502133947.htm",
  "description": "Researchers have completed a first-in-human clinical trial testing a CRISPR/Cas9 gene-editing technique to help the immune system fight advanced gastrointestinal (GI) cancers. The results show encouraging signs of safety and potential effectiveness of the treatment.",
  "author": "",
  "published": "Fri, 02 May 2025 13:39:47 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2962,
  "excerpt": "Researchers have completed a first-in-human clinical trial testing a CRISPR/Cas9 gene-editing technique to help the immune system fight advanced gastrointestinal (GI) cancers. The results show encouraging signs of safety and potential effectiveness of the treatment.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Researchers at the University of Minnesota have completed a first-in-human clinical trial testing a CRISPR/Cas9 gene-editing technique to help the immune system fight advanced gastrointestinal (GI) cancers. The results, recently published in Lancet Oncology, show encouraging signs of safety and potential effectiveness of the treatment. \"Despite many advances in understanding the genomic drivers and other factors causing cancer, with few exceptions, stage IV colorectal cancer remains a largely incurable disease,\" said Emil Lou, MD, PhD, a gastrointestinal oncologist with the University of Minnesota Medical School, Masonic Cancer Center and M Health Fairview, and clinical principal investigator for the trial. \"This trial brings a new approach from our research labs into the clinic and shows potential for improving outcomes in patients with late-stage disease.\" In the study, researchers used CRISPR/Cas9 gene-editing to modify a type of immune cell called tumor-infiltrating lymphocytes (TILs). By deactivating a gene called CISH, the researchers found that modified TILs were better able to recognize and attack cancer cells. The treatment was tested in 12 highly metastatic, end-stage patients and found to be generally safe, with no serious side effects from the gene editing. Several patients in the trial saw the growth of their cancer halt, and one patient had a complete response, meaning that in this patient, the metastatic tumors disappeared over the course of several months and have not returned in over two years. \"We believe that CISH is a key factor preventing T cells from recognizing and eliminating tumors,\" said Branden Moriarity, PhD, associate professor at the University of Minnesota Medical School, Masonic Cancer Center researcher and co-director of the Center for Genome Engineering. \"Because it acts inside the cell, it couldn't be blocked using traditional methods, so we turned to CRISPR-based genetic engineering.\" Unlike other cancer therapies that require ongoing doses, this gene edit is permanent and built into the T cells from the start. \"With our gene-editing approach, the checkpoint inhibition is accomplished in one step and is permanently hardwired into the T cells,\" said Beau Webber, PhD, associate professor at the University of Minnesota Medical School and Masonic Cancer Center researcher. The research team delivered more than 10 billion engineered TIL without adverse side effects, demonstrating the feasibility of genetically engineering TIL without sacrificing the ability to grow them to large numbers in the lab in a clinically compliant environment, which has never been done before. While the results are promising, the process remains costly and complex. Efforts are underway to streamline production and better understand why the therapy worked so effectively in the patient with a complete response in order to improve the approach in future trials. This research was funded by Intima Bioscience.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eResearchers at the University of Minnesota have completed a first-in-human clinical trial testing a CRISPR/Cas9 gene-editing technique to help the immune system fight advanced gastrointestinal (GI) cancers. The results, recently published in Lancet Oncology, show encouraging signs of safety and potential effectiveness of the treatment.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;Despite many advances in understanding the genomic drivers and other factors causing cancer, with few exceptions, stage IV colorectal cancer remains a largely incurable disease,\u0026#34; said Emil Lou, MD, PhD, a gastrointestinal oncologist with the University of Minnesota Medical School, Masonic Cancer Center and M Health Fairview, and clinical principal investigator for the trial. \u0026#34;This trial brings a new approach from our research labs into the clinic and shows potential for improving outcomes in patients with late-stage disease.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn the study, researchers used CRISPR/Cas9 gene-editing to modify a type of immune cell called tumor-infiltrating lymphocytes (TILs). By deactivating a gene called CISH, the researchers found that modified TILs were better able to recognize and attack cancer cells.\u003c/p\u003e\n\u003cp\u003eThe treatment was tested in 12 highly metastatic, end-stage patients and found to be generally safe, with no serious side effects from the gene editing. Several patients in the trial saw the growth of their cancer halt, and one patient had a complete response, meaning that in this patient, the metastatic tumors disappeared over the course of several months and have not returned in over two years.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We believe that CISH is a key factor preventing T cells from recognizing and eliminating tumors,\u0026#34; said Branden Moriarity, PhD, associate professor at the University of Minnesota Medical School, Masonic Cancer Center researcher and co-director of the Center for Genome Engineering. \u0026#34;Because it acts inside the cell, it couldn\u0026#39;t be blocked using traditional methods, so we turned to CRISPR-based genetic engineering.\u0026#34;\u003c/p\u003e\n\u003cp\u003eUnlike other cancer therapies that require ongoing doses, this gene edit is permanent and built into the T cells from the start.\u003c/p\u003e\n\u003cp\u003e\u0026#34;With our gene-editing approach, the checkpoint inhibition is accomplished in one step and is permanently hardwired into the T cells,\u0026#34; said Beau Webber, PhD, associate professor at the University of Minnesota Medical School and Masonic Cancer Center researcher.\u003c/p\u003e\n\u003cp\u003eThe research team delivered more than 10 billion engineered TIL without adverse side effects, demonstrating the feasibility of genetically engineering TIL without sacrificing the ability to grow them to large numbers in the lab in a clinically compliant environment, which has never been done before.\u003c/p\u003e\n\u003cp\u003eWhile the results are promising, the process remains costly and complex. Efforts are underway to streamline production and better understand why the therapy worked so effectively in the patient with a complete response in order to improve the approach in future trials.\u003c/p\u003e\n\u003cp\u003eThis research was funded by Intima Bioscience.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
