{
  "id": "c6913b43-3ea6-4689-b114-c76d5d3994b2",
  "title": "How many trees does it take to cool a city? Researchers develop tool to set urban tree canopy goals",
  "link": "https://phys.org/news/2024-11-trees-cool-city-tool-urban.html",
  "description": "Cities around the globe are increasingly experiencing dangerous heat as urban concrete and asphalt amplify rising temperatures. Tree-planting programs are a popular, nature-based way to cool cities, but these initiatives have been largely based on guesswork and extrapolation. A study published Monday in Proceedings of the National Academy of Sciences offers a new tool for urban planners and decision makers to set more specific and science-based city-wide greening goals.",
  "author": "",
  "published": "Mon, 04 Nov 2024 17:15:03 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Environment"
  ],
  "byline": "Cary Institute of Ecosystem Studies",
  "length": 6889,
  "excerpt": "Cities around the globe are increasingly experiencing dangerous heat as urban concrete and asphalt amplify rising temperatures. Tree-planting programs are a popular, nature-based way to cool cities, but these initiatives have been largely based on guesswork and extrapolation. A study published Monday in Proceedings of the National Academy of Sciences offers a new tool for urban planners and decision makers to set more specific and science-based city-wide greening goals.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Baltimore, Maryland's Mount Vernon neighborhood. Credit: Anthony G. Reyes Cities around the globe are increasingly experiencing dangerous heat as urban concrete and asphalt amplify rising temperatures. Tree-planting programs are a popular, nature-based way to cool cities, but these initiatives have been largely based on guesswork and extrapolation. A study published Monday in Proceedings of the National Academy of Sciences offers a new tool for urban planners and decision makers to set more specific and science-based city-wide greening goals. The study is led by Jia Wang, Weiqi Zhou, and Yuguo Qian at the Chinese Academy of Sciences, and co-authored by Steward Pickett, an urban ecologist at Cary Institute of Ecosystem Studies. \"Trees offer many benefits to cities, and cooling is one of them,\" Pickett explained. \"Trees are good at cooling because they pump a lot of water from the ground into the air, and when that water evaporates at the leaf surface, it absorbs a vast amount of heat. That's just the physics of evaporation. The shade provided by trees also helps with cooling.\" To date, most studies measuring the cooling effects of urban trees focus on the hyperlocal level, such as on a particular street or neighborhood. When the urban tree canopy expands by 1%, for example, nearby temperatures may decrease by 0.04 to 0.57 degrees Celsius. \"That's valuable, but planners and decision makers are thinking about the whole city,\" said Pickett. \"They're asking, \"How much tree canopy do we need for the whole city? What happens when we scale it up?\" And that information hasn't been available.\" It wasn't clear whether the fine-scale results could be extrapolated to the city scale. So, the researchers set out to determine how trees' cooling efficiency—the temperature reduction associated with a 1% increase urban tree canopy—changes across larger areas. The team analyzed satellite imagery and temperature data from four cities with very different climates: Beijing and Shenzhen in China, and Baltimore and Sacramento in the US. Baltimore and Beijing are temperate, Shenzhen is subtropical, and Sacramento is in a Mediterranean climate zone. First, they divided each city into pixels approximately the size of a city block. For each pixel, they measured the land surface temperature and how much of the ground was covered by trees. Then they ran the same analyses across larger and larger sections of each city, spanning the neighborhood level, city level, and beyond. Finally, they calculated how the mathematical relationship between greenery and temperature—the cooling efficiency—changed at different scales. Rather than following a linear relationship, the relationship between area (\"size of analytical unit\") and cooling efficiency (\"CE\")—the temperature reduction associated with a 1% increase in urban tree canopy—follows a statistical power law. That is, as the area size initially increases, urban planners can get more bang for their buck—each 1% increase in tree canopy cover offers additional cooling benefits. The line tends to level out at larger and larger scales. The relationship holds across four cities: Sacramento (A), Baltimore (B), Beijing (C), and Shenzhen (D). Credit: Proceedings of the National Academy of Sciences (2024). DOI: 10.1073/pnas.2401210121 Overall, the team discovered that the cooling efficiency of urban trees increased at larger scales. But it did so at a slower rate at larger unit sizes. In Beijing, for example, a 1% increase in canopy at the block level decreases temperature by about 0.06 degrees, whereas a 1% increase in canopy at the city level could decrease temperature by about 0.18 degrees. The additional benefit at larger scales seems to come from being able to include large groups of trees, which have a larger cooling capacity. With greater clarity about the relationships between area, tree canopy cover, and cooling effects, the paper makes it possible to predict cooling effects at the whole-city scale, offering a valuable tool for managers to set urban tree canopy goals to reduce extreme heat. Co-author Weiqi Zhou notes, \"We found that cooling efficiency follows a power law across scales—from as small as 120 by 120 meters to as large as regions covering the entire city. The relationship holds across all four of the studied cities, which are in very different climates. This suggests that it could be used to predict the amount of additional tree cover needed to achieve specific heat mitigation and climate adaptation goals in cities worldwide.\" For example, the authors estimate that the city of Baltimore could reduce land surface temperatures by 0.23°C if they increased tree canopy by 1%. To achieve 1.5°C of cooling, they would need to increase tree canopy cover by 6.39%. While the paper provides essential information for decision-making at the municipal level, Pickett cautions that urban planners may also need to work at smaller scales to ensure that urban trees—and their potential benefits—are distributed equitably across the city, and with community buy-in. \"This paper doesn't tell you where to put the trees,\" said Pickett. \"That's another sort of analysis, which would have to involve a lot more social information and engagement with communities or with individual property owners.\" Pickett suggested next steps could include broadening the analysis to include other cities with different kinds of climates, and examining how well this nature-based solution will work in the future as climate change makes some areas hotter and drier. More information: Jia Wang et al, A scaling law for predicting urban trees canopy cooling efficiency, Proceedings of the National Academy of Sciences (2024). DOI: 10.1073/pnas.2401210121 Citation: How many trees does it take to cool a city? Researchers develop tool to set urban tree canopy goals (2024, November 4) retrieved 4 November 2024 from https://phys.org/news/2024-11-trees-cool-city-tool-urban.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/how-many-trees-does-it.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/how-many-trees-does-it.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/how-many-trees-does-it.jpg\" data-sub-html=\"Baltimore, Maryland\u0026#39;s Mount Vernon neighborhood. Credit: Anthony G. Reyes\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/how-many-trees-does-it.jpg\" alt=\"How many trees does it take to cool a city?\" title=\"Baltimore, Maryland\u0026#39;s Mount Vernon neighborhood. Credit: Anthony G. Reyes\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Baltimore, Maryland\u0026#39;s Mount Vernon neighborhood. Credit: Anthony G. Reyes\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eCities around the globe are increasingly experiencing dangerous heat as urban concrete and asphalt amplify rising temperatures. Tree-planting programs are a popular, nature-based way to cool cities, but these initiatives have been largely based on guesswork and extrapolation. A study published Monday in \u003ca href=\"https://www.pnas.org/cgi/doi/10.1073/pnas.2401210121\" target=\"_blank\"\u003e\u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e\u003c/a\u003e offers a new tool for urban planners and decision makers to set more specific and science-based city-wide greening goals.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe study is led by Jia Wang, Weiqi Zhou, and Yuguo Qian at the Chinese Academy of Sciences, and co-authored by Steward Pickett, an urban ecologist at Cary Institute of Ecosystem Studies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Trees offer many benefits to cities, and cooling is one of them,\u0026#34; Pickett explained. \u0026#34;Trees are good at cooling because they pump a lot of water from the ground into the air, and when that water evaporates at the leaf surface, it absorbs a vast amount of heat. That\u0026#39;s just the physics of evaporation. The shade provided by trees also helps with cooling.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTo date, most studies measuring the cooling effects of urban trees focus on the hyperlocal level, such as on a particular street or neighborhood. When the urban tree canopy expands by 1%, for example, nearby temperatures may decrease by 0.04 to 0.57 degrees Celsius.\u003c/p\u003e\n\u003cp\u003e\u0026#34;That\u0026#39;s valuable, but planners and \u003ca href=\"https://phys.org/tags/decision+makers/\" rel=\"tag\"\u003edecision makers\u003c/a\u003e are thinking about the whole city,\u0026#34; said Pickett. \u0026#34;They\u0026#39;re asking, \u0026#34;How much tree canopy do we need for the whole city? What happens when we scale it up?\u0026#34; And that information hasn\u0026#39;t been available.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIt wasn\u0026#39;t clear whether the fine-scale results could be extrapolated to the city scale. So, the researchers set out to determine how trees\u0026#39; cooling efficiency—the \u003ca href=\"https://phys.org/tags/temperature/\" rel=\"tag\"\u003etemperature\u003c/a\u003e reduction associated with a 1% increase urban tree canopy—changes across larger areas.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe team analyzed satellite imagery and temperature data from four cities with very different climates: Beijing and Shenzhen in China, and Baltimore and Sacramento in the US. Baltimore and Beijing are temperate, Shenzhen is subtropical, and Sacramento is in a Mediterranean climate zone.\u003c/p\u003e\n\u003cp\u003eFirst, they divided each city into pixels approximately the size of a city block. For each pixel, they measured the land surface temperature and how much of the ground was covered by trees. Then they ran the same analyses across larger and larger sections of each city, spanning the neighborhood level, city level, and beyond. Finally, they calculated how the mathematical relationship between greenery and temperature—the cooling efficiency—changed at different scales.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/how-many-trees-does-it-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2024/how-many-trees-does-it-1.jpg\" data-sub-html=\"Rather than following a linear relationship, the relationship between area (\u0026#34;size of analytical unit\u0026#34;) and cooling efficiency (\u0026#34;CE\u0026#34;)—the temperature reduction associated with a 1% increase in urban tree canopy—follows a statistical power law. That is, as the area size initially increases, urban planners can get more bang for their buck—each 1% increase in tree canopy cover offers additional cooling benefits. The line tends to level out at larger and larger scales. The relationship holds across four cities: Sacramento (A), Baltimore (B), Beijing (C), and Shenzhen (D). Credit: \u0026lt;i\u0026gt;Proceedings of the National Academy of Sciences\u0026lt;/i\u0026gt; (2024). DOI: 10.1073/pnas.2401210121\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/how-many-trees-does-it-1.jpg\" alt=\"How many trees does it take to cool a city?\" title=\"Rather than following a linear relationship, the relationship between area (\u0026#34;size of analytical unit\u0026#34;) and cooling efficiency (\u0026#34;CE\u0026#34;)—the temperature reduction associated with a 1% increase in urban tree canopy—follows a statistical power law. That is, as the area size initially increases, urban planners can get more bang for their buck—each 1% increase in tree canopy cover offers additional cooling benefits. The line tends to level out at larger and larger scales. The relationship holds across four cities: Sacramento (A), Baltimore (B), Beijing (C), and Shenzhen (D). Credit: Proceedings of the National Academy of Sciences (2024). DOI: 10.1073/pnas.2401210121\"/\u003e\n             \u003cfigcaption\u003e\n                Rather than following a linear relationship, the relationship between area (\u0026#34;size of analytical unit\u0026#34;) and cooling efficiency (\u0026#34;CE\u0026#34;)—the temperature reduction associated with a 1% increase in urban tree canopy—follows a statistical power law. That is, as the area size initially increases, urban planners can get more bang for their buck—each 1% increase in tree canopy cover offers additional cooling benefits. The line tends to level out at larger and larger scales. The relationship holds across four cities: Sacramento (A), Baltimore (B), Beijing (C), and Shenzhen (D). Credit: \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e (2024). DOI: 10.1073/pnas.2401210121\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eOverall, the team discovered that the cooling efficiency of urban trees increased at larger scales. But it did so at a slower rate at larger unit sizes. In Beijing, for example, a 1% increase in canopy at the block level decreases temperature by about 0.06 degrees, whereas a 1% increase in canopy at the city level could decrease temperature by about 0.18 degrees.\u003c/p\u003e\n\u003cp\u003eThe additional benefit at larger scales seems to come from being able to include large groups of trees, which have a larger cooling capacity.\u003c/p\u003e\n\u003cp\u003eWith greater clarity about the relationships between area, tree canopy cover, and cooling effects, the paper makes it possible to predict cooling effects at the whole-city scale, offering a \u003ca href=\"https://phys.org/tags/valuable+tool/\" rel=\"tag\"\u003evaluable tool\u003c/a\u003e for managers to set urban tree canopy goals to reduce extreme heat.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eCo-author Weiqi Zhou notes, \u0026#34;We found that cooling efficiency follows a power law across scales—from as small as 120 by 120 meters to as large as regions covering the entire city. The relationship holds across all four of the studied cities, which are in very different climates. This suggests that it could be used to predict the amount of additional tree cover needed to achieve specific heat mitigation and climate adaptation goals in cities worldwide.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFor example, the authors estimate that the city of Baltimore could reduce land surface temperatures by 0.23°C if they increased tree canopy by 1%. To achieve 1.5°C of \u003ca href=\"https://phys.org/tags/cooling/\" rel=\"tag\"\u003ecooling\u003c/a\u003e, they would need to increase tree \u003ca href=\"https://phys.org/tags/canopy/\" rel=\"tag\"\u003ecanopy\u003c/a\u003e cover by 6.39%.\u003c/p\u003e\n\u003cp\u003eWhile the paper provides essential information for decision-making at the municipal level, Pickett cautions that \u003ca href=\"https://phys.org/tags/urban+planners/\" rel=\"tag\"\u003eurban planners\u003c/a\u003e may also need to work at smaller scales to ensure that urban trees—and their potential benefits—are distributed equitably across the city, and with community buy-in.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This paper doesn\u0026#39;t tell you where to put the trees,\u0026#34; said Pickett. \u0026#34;That\u0026#39;s another sort of analysis, which would have to involve a lot more social information and engagement with communities or with individual property owners.\u0026#34;\u003c/p\u003e\n\u003cp\u003ePickett suggested next steps could include broadening the analysis to include other cities with different kinds of climates, and examining how well this nature-based solution will work in the future as climate change makes some areas hotter and drier.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tJia Wang et al, A scaling law for predicting urban trees canopy cooling efficiency, \u003ci\u003eProceedings of the National Academy of Sciences\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1073/pnas.2401210121\" target=\"_blank\"\u003eDOI: 10.1073/pnas.2401210121\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tHow many trees does it take to cool a city? Researchers develop tool to set urban tree canopy goals (2024, November 4)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 4 November 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-11-trees-cool-city-tool-urban.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-04T17:15:03-05:00",
  "modifiedTime": null
}
