{
  "id": "c92bdfb6-6499-4432-8c2b-bda8402e8bd1",
  "title": "Throwing a 'spanner in the works' of our cells' machinery could help fight cancer, fatty liver disease... and hair loss",
  "link": "https://www.sciencedaily.com/releases/2025/04/250418235509.htm",
  "description": "Fifty years since its discovery, scientists have finally worked out how a molecular machine found in mitochondria, the 'powerhouses' of our cells, allows us to make the fuel we need from sugars, a process vital to all life on Earth. Scientists have worked out the structure of this machine and shown how it operates like the lock on a canal to transport pyruvate -- a molecule generated in the body from the breakdown of sugars -- into our mitochondria.",
  "author": "",
  "published": "Fri, 18 Apr 2025 23:55:09 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4843,
  "excerpt": "Fifty years since its discovery, scientists have finally worked out how a molecular machine found in mitochondria, the 'powerhouses' of our cells, allows us to make the fuel we need from sugars, a process vital to all life on Earth. Scientists have worked out the structure of this machine and shown how it operates like the lock on a canal to transport pyruvate -- a molecule generated in the body from the breakdown of sugars -- into our mitochondria.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Fifty years since its discovery, scientists have finally worked out how a molecular machine found in mitochondria, the 'powerhouses' of our cells, allows us to make the fuel we need from sugars, a process vital to all life on Earth. Scientists at the Medical Research Council (MRC) Mitochondrial Biology Unit, University of Cambridge, have worked out the structure of this machine and shown how it operates like the lock on a canal to transport pyruvate -- a molecule generated in the body from the breakdown of sugars -- into our mitochondria. Known as the mitochondrial pyruvate carrier, this molecular machine was first proposed to exist in 1971, but it has taken until now for scientists to visualise its structure at the atomic scale using cryo-electron microscopy, a technique used to magnify an image of an object to around 165,000 times its real size. Details are published today in Science Advances. Dr Sotiria Tavoulari, a Senior Research Associate from the University of Cambridge, who first determined the composition of this molecular machine, said: \"Sugars in our diet provide energy for our bodies to function. When they are broken down inside our cells they produce pyruvate, but to get the most out of this molecule it needs to be transferred inside the cell's powerhouses, the mitochondria. There, it helps increase 15-fold the energy produced in the form of the cellular fuel ATP.\" Maximilian Sichrovsky, a PhD student at Hughes Hall and joint first author of the study, said: \"Getting pyruvate into our mitochondria sounds straightforward, but until now we haven't been able to understand the mechanism of how this process occurs. Using state-of-the-art cryo-electron microscopy, we've been able to show not only what this transporter looks like, but exactly how it works. It's an extremely important process, and understanding it could lead to new treatments for a range of different conditions.\" Mitochondria are surrounded by two membranes. The outer one is porous, and pyruvate can easily pass through, but the inner membrane is impermeable to pyruvate. To transport pyruvate into the mitochondrion, first an outer 'gate' of the carrier opens, allowing pyruvate to enter the carrier. This gate then closes, and the inner gate opens, allowing the molecule to pass through into the mitochondrion. \"It works like the locks on a canal but on the molecular scale,\" said Professor Edmund Kunji from the MRC Mitochondrial Biology Unit, and a Fellow at Trinity Hall, Cambridge. \"There, a gate opens at one end, allowing the boat to enter. It then closes and the gate at the opposite end opens to allow the boat smooth transit through.\" Because of its central role in controlling the way mitochondria operate to produce energy, this carrier is now recognised as a promising drug target for a range of conditions, including diabetes, fatty liver disease, Parkinson's disease, specific cancers, and even hair loss. Pyruvate is not the only energy source available to us. Our cells can also take their energy from fats stored in the body or from amino acids in proteins. Blocking the pyruvate carrier would force the body to look elsewhere for its fuel -- creating opportunities to treat a number of diseases. In fatty liver disease, for example, blocking access to pyruvate entry into mitochondria could encourage the body to use potentially dangerous fat that has been stored in liver cells. Likewise, there are certain tumour cells that rely on pyruvate metabolism, such as in some types of prostate cancer. These cancers tend to be very 'hungry', producing excess pyruvate transport carriers to ensure they can feed more. Blocking the carrier could then starve these cancer cells of the energy they need to survive, killing them. Previous studies have also suggested that inhibiting the mitochondrial pyruvate carrier may reverse hair loss. Activation of human follicle cells, which are responsible for hair growth, relies on metabolism and, in particular, the generation of lactate. When the mitochondrial pyruvate carrier is blocked from entering the mitochondria in these cells, it is instead converted to lactate. Professor Kunji said: \"Drugs inhibiting the function of the carrier can remodel how mitochondria work, which can be beneficial in certain conditions. Electron microscopy allows us to visualise exactly how these drugs bind inside the carrier to jam it -- a spanner in the works, you could say. This creates new opportunities for structure-based drug design in order to develop better, more targeted drugs. This will be a real game changer.\" The research was supported by the Medical Research Council and was a collaboration with the groups of Professors Vanessa Leone at the Medical College of Wisconsin, Lucy Forrest at the National Institutes of Health, and Jan Steyaert at the Free University of Brussels.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eFifty years since its discovery, scientists have finally worked out how a molecular machine found in mitochondria, the \u0026#39;powerhouses\u0026#39; of our cells, allows us to make the fuel we need from sugars, a process vital to all life on Earth.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eScientists at the Medical Research Council (MRC) Mitochondrial Biology Unit, University of Cambridge, have worked out the structure of this machine and shown how it operates like the lock on a canal to transport pyruvate -- a molecule generated in the body from the breakdown of sugars -- into our mitochondria.\u003c/p\u003e\n\u003cp\u003eKnown as the mitochondrial pyruvate carrier, this molecular machine was first proposed to exist in 1971, but it has taken until now for scientists to visualise its structure at the atomic scale using cryo-electron microscopy, a technique used to magnify an image of an object to around 165,000 times its real size. Details are published today in \u003cem\u003eScience Advances\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eDr Sotiria Tavoulari, a Senior Research Associate from the University of Cambridge, who first determined the composition of this molecular machine, said: \u0026#34;Sugars in our diet provide energy for our bodies to function. When they are broken down inside our cells they produce pyruvate, but to get the most out of this molecule it needs to be transferred inside the cell\u0026#39;s powerhouses, the mitochondria. There, it helps increase 15-fold the energy produced in the form of the cellular fuel ATP.\u0026#34;\u003c/p\u003e\n\u003cp\u003eMaximilian Sichrovsky, a PhD student at Hughes Hall and joint first author of the study, said: \u0026#34;Getting pyruvate into our mitochondria sounds straightforward, but until now we haven\u0026#39;t been able to understand the mechanism of how this process occurs. Using state-of-the-art cryo-electron microscopy, we\u0026#39;ve been able to show not only what this transporter looks like, but exactly how it works. It\u0026#39;s an extremely important process, and understanding it could lead to new treatments for a range of different conditions.\u0026#34;\u003c/p\u003e\n\u003cp\u003eMitochondria are surrounded by two membranes. The outer one is porous, and pyruvate can easily pass through, but the inner membrane is impermeable to pyruvate. To transport pyruvate into the mitochondrion, first an outer \u0026#39;gate\u0026#39; of the carrier opens, allowing pyruvate to enter the carrier. This gate then closes, and the inner gate opens, allowing the molecule to pass through into the mitochondrion.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It works like the locks on a canal but on the molecular scale,\u0026#34; said Professor Edmund Kunji from the MRC Mitochondrial Biology Unit, and a Fellow at Trinity Hall, Cambridge. \u0026#34;There, a gate opens at one end, allowing the boat to enter. It then closes and the gate at the opposite end opens to allow the boat smooth transit through.\u0026#34;\u003c/p\u003e\n\u003cp\u003eBecause of its central role in controlling the way mitochondria operate to produce energy, this carrier is now recognised as a promising drug target for a range of conditions, including diabetes, fatty liver disease, Parkinson\u0026#39;s disease, specific cancers, and even hair loss.\u003c/p\u003e\n\n\n\u003cp\u003ePyruvate is not the only energy source available to us. Our cells can also take their energy from fats stored in the body or from amino acids in proteins. Blocking the pyruvate carrier would force the body to look elsewhere for its fuel -- creating opportunities to treat a number of diseases. In fatty liver disease, for example, blocking access to pyruvate entry into mitochondria could encourage the body to use potentially dangerous fat that has been stored in liver cells.\u003c/p\u003e\n\u003cp\u003eLikewise, there are certain tumour cells that rely on pyruvate metabolism, such as in some types of prostate cancer. These cancers tend to be very \u0026#39;hungry\u0026#39;, producing excess pyruvate transport carriers to ensure they can feed more. Blocking the carrier could then starve these cancer cells of the energy they need to survive, killing them.\u003c/p\u003e\n\u003cp\u003ePrevious studies have also suggested that inhibiting the mitochondrial pyruvate carrier may reverse hair loss. Activation of human follicle cells, which are responsible for hair growth, relies on metabolism and, in particular, the generation of lactate. When the mitochondrial pyruvate carrier is blocked from entering the mitochondria in these cells, it is instead converted to lactate.\u003c/p\u003e\n\u003cp\u003eProfessor Kunji said: \u0026#34;Drugs inhibiting the function of the carrier can remodel how mitochondria work, which can be beneficial in certain conditions. Electron microscopy allows us to visualise exactly how these drugs bind inside the carrier to jam it -- a spanner in the works, you could say. This creates new opportunities for structure-based drug design in order to develop better, more targeted drugs. This will be a real game changer.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe research was supported by the Medical Research Council and was a collaboration with the groups of Professors Vanessa Leone at the Medical College of Wisconsin, Lucy Forrest at the National Institutes of Health, and Jan Steyaert at the Free University of Brussels.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
