{
  "id": "d10c918c-2261-42a3-bfbf-b6b057dc7f70",
  "title": "Elderberry (What is it good for)",
  "link": "https://sciencebasedmedicine.org/elderberry-what-is-it-good-for/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=elderberry-what-is-it-good-for",
  "description": "Accumulated evidence does not demonstrate that elderberry has meaningful beneficial effects. The post Elderberry (What is it good for) first appeared on Science-Based Medicine.",
  "author": "Scott Gavura",
  "published": "Thu, 10 Oct 2024 11:50:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Herbs \u0026 Supplements",
    "elderberry"
  ],
  "byline": "Scott Gavura",
  "length": 10989,
  "excerpt": "Accumulated evidence does not demonstrate that elderberry has meaningful beneficial effects.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Elderberry is a popular natural product and remedy used to treat viral infections like influenza (the flu), colds and in recent years, COVID-19. Touted for its immune-boosting properties, and seemingly available in every dosage form from syrups to gummies, elderberry has many enthusiasts, and the billion-dollar market is forecast to continue to grow. With cold and flu season (in the northern hemisphere) approaching quickly, I wanted to refresh my understanding of the evidence supporting this widely marketed remedy. New trials continue to be published – but are the compelling enough to warrant a recommendation? Elderberry is the dark purple fruit of the European or Black elder, a deciduous tree native to Europe, but also found in North America. The tree produces both elderberries and elderflowers, used in food, beverages, and traditional medicine. Historically, elderberries have been used as folk remedies to treat colds and flu, but they are also used as a diuretic, laxative, and for “stimulating the immune system”. There are a number of potentially active ingredients in elderberry, so it is plausible that elderberry may have biological and medicinal effects. For this review, I focused on evidence for treatments of respiratory infections. Elderberry extract may inhibit the replication of certain viruses, which fuels much of the marketing. Of course, inhibiting viral replication is not difficult to do in a test tube. Supportive trials published to date have had mixed results. Taking elderberry extract syrup (Sambucol)) 15 mL four times daily for 5 days may improve symptoms such as aches, cough, and nasal congestion about 4 days earlier than control groups, and reduce the need for additional medications. However, in a study involving children and adults aged 5 and older, including those with high-risk conditions, taking Sambucol for 5 days did not significantly shorten the time to complete symptom resolution compared to placebo. A randomized, double-blind, placebo-controlled trial conducted from January 2018 to April 2019 and published in 2020 aimed to determine if elderberry extract reduces the duration and severity of influenza. The study included 87 patients aged 5 and older with confirmed influenza, who were treated with either elderberry extract or placebo for 5 days. Patients were permitted to choose to also receive oseltamivir (Tamiflu). The primary outcome was the number of days until symptoms were mild or none, and secondary outcomes included total symptom resolution. The results: no significant difference in symptom improvement between the elderberry and placebo groups, with elderberry showing no benefit in reducing flu duration or severity. In fact, post hoc analysis suggested that elderberry alone (i.e., without oseltamivir) may have prolonged symptoms compared to placebo by about two days. In colds, a 2016 randomized, double-blind, placebo-controlled trial looked at air travel overseas using a standardized elderberry extract. While the number of cold episodes between the placebo and elderberry groups was similar between the two groups participants in the placebo group experienced significantly longer cold durations and more severe symptoms. The authors conclude that elderberry extract may reduce the duration and severity of colds during air travel. As this is a single trial and not replicated, it’s not terribly convincing. There is no evidence to suggest that elderberry is effective against COVID-19 infections. The FDA and FTC and Federal Trade Commission have taken action against companies that marketed products with claims of effectiveness for COVID-19. Safety Summary Elderberry is rated by the Natural Database as likely safe when consumed orally, in amounts typically found in foods, and it holds Generally Recognized As Safe (GRAS) status in the US. It is considered possibly safe when elderberry fruit extract is used short-term. Specific products like Sambucol and BerryPharma have been used safely for up to 5 and 15 days, respectively, while ViraBLOC lozenges are safe for up to 2 days. Consuming unripe or uncooked elderberries, leaves, or stems is considered possibly unsafe due to cyanide-producing chemicals, which can cause serious toxicity. Cooking eliminates this toxin. In children, elderberry is likely safe in food amounts and possibly safe for up to 3 days, but unripe or uncooked elderberries should be avoided. During pregnancy and lactation, elderberry is likely safe in food amounts, but there is insufficient data to ensure its safety when used as a dietary supplement or medicinally. Larger doses should be avoided. There is also the ongoing concern about accuracy of supplement labels (and product contents) which increases the risk to the pregnant/breast feeding. Don’t skip your flu or COVID-19 shot this fall Very weak data suggest that elderberry may offer some benefit for colds and flu, but it’s also refuted with conflicting evidence that is more compelling. I don’t recommend elderberry, but it has a reasonable safety profile for most adults. If people really want to self-medicate with something, I warn them that it may not be helpful and there’s a suggestion it could actually be harmful. Scott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada. Scott has no conflicts of interest to disclose. Disclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional. View all posts Posted by Scott Gavura Scott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada. Scott has no conflicts of interest to disclose. Disclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional.",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2019/12/Elderberry.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n\n        \n\u003carticle id=\"post-101693\"\u003e\n\n\t\t\n\t\u003cdiv\u003e\n\t\t\n\n\u003cp\u003eElderberry is a popular natural product and remedy used to treat viral infections like influenza (the flu), colds and in recent years, COVID-19. Touted for its immune-boosting properties, and seemingly available in every dosage form from syrups to gummies, elderberry has many enthusiasts, and \u003ca href=\"https://www.futuremarketinsights.com/reports/elderberry-supplements-market\" title=\"\"\u003ethe billion-dollar market is forecast to continue to grow\u003c/a\u003e. With cold and flu season (in the northern hemisphere) approaching quickly, I wanted to refresh my understanding of the evidence supporting this widely marketed remedy. New trials continue to be published – but are the compelling enough to warrant a recommendation?\u003c/p\u003e\n\n\n\n\u003cp\u003eElderberry is the dark purple fruit of the European or Black elder, a deciduous tree native to Europe, but also found in North America. The tree produces both elderberries and elderflowers, used in food, beverages, and traditional medicine. Historically, elderberries have been used as folk remedies to treat colds and flu, but they are also used as a diuretic, laxative, and for “stimulating the immune system”. There are a number of \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S1756464614002400\" title=\"\"\u003epotentially active ingredients\u003c/a\u003e in elderberry, so it is plausible that elderberry may have biological and medicinal effects. For this review, I focused on evidence for treatments of respiratory infections.\u003c/p\u003e\n\n\n\n\u003cp\u003eElderberry extract may inhibit the replication of certain viruses, which fuels much of the marketing. Of course, inhibiting viral replication is not difficult to do in a test tube. Supportive trials published to date have had mixed results. Taking elderberry extract syrup (Sambucol)) 15 mL four times daily for 5 days may \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/9395631/\" title=\"\"\u003eimprove symptoms\u003c/a\u003e such as aches, cough, and nasal congestion about 4 days earlier than control groups, and reduce the need for additional medications. However, in a study involving children and adults aged 5 and older, including those with high-risk conditions, taking Sambucol for 5 days \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/32929634/\" title=\"\"\u003edid not significantly shorten the time to complete symptom\u003c/a\u003e resolution compared to placebo. \u003c/p\u003e\n\n\n\n\u003cp\u003eA randomized, double-blind, placebo-controlled trial conducted from January 2018 to April 2019 and published in 2020 aimed to determine if \u003ca href=\"https://link.springer.com/article/10.1007/s11606-020-06170-w\" title=\"\"\u003eelderberry extract reduces the duration and severity of influenza\u003c/a\u003e. The study included 87 patients aged 5 and older with confirmed influenza, who were treated with either elderberry extract or placebo for 5 days. Patients were permitted to choose to also receive oseltamivir (Tamiflu). The primary outcome was the number of days until symptoms were mild or none, and secondary outcomes included total symptom resolution. The results: no significant difference in symptom improvement between the elderberry and placebo groups, with elderberry showing no benefit in reducing flu duration or severity. In fact, post hoc analysis suggested that elderberry alone (i.e., without oseltamivir) may have \u003cem\u003eprolonged\u003c/em\u003e symptoms compared to placebo by about two days.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn colds, a 2016 randomized, double-blind, placebo-controlled trial looked at \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/27023596/\" title=\"\"\u003eair travel overseas\u003c/a\u003e using a standardized elderberry extract. While the number of cold episodes between the placebo and elderberry groups was similar between the two groups participants in the placebo group experienced significantly longer cold durations and more severe symptoms. The authors conclude that elderberry extract may reduce the duration and severity of colds during air travel. As this is a single trial and not replicated, it’s not terribly convincing. \u003c/p\u003e\n\n\n\n\u003cp\u003eThere is no evidence to suggest that elderberry is effective against COVID-19 infections. The \u003ca href=\"https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/elderberry-fairy-co-llc-622859-08152022\" title=\"\"\u003eFDA\u003c/a\u003e and \u003ca href=\"https://www.ftc.gov/news-events/news/press-releases/2020/04/ftc-sends-21-letters-warning-marketers-stop-making-unsupported-claims-their-products-therapies-can\" title=\"\"\u003eFTC\u003c/a\u003e and Federal Trade Commission have taken action against companies that marketed products with claims of effectiveness for COVID-19.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eSafety Summary\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eElderberry is rated by the Natural Database as \u003cem\u003elikely safe\u003c/em\u003e when consumed orally, in amounts typically found in foods, and it holds Generally Recognized As Safe (GRAS) status in the US. It is considered \u003cem\u003epossibly safe\u003c/em\u003e when elderberry fruit extract is used short-term. Specific products like Sambucol and BerryPharma have been used safely for up to 5 and 15 days, respectively, while ViraBLOC lozenges are safe for up to 2 days. Consuming unripe or uncooked elderberries, leaves, or stems is considered \u003cem\u003epossibly unsafe\u003c/em\u003e due to cyanide-producing chemicals, which can cause serious toxicity. Cooking eliminates this toxin. In children, elderberry is \u003cem\u003elikely safe\u003c/em\u003e in food amounts and \u003cem\u003epossibly safe\u003c/em\u003e for up to 3 days, but unripe or uncooked elderberries should be avoided. During pregnancy and lactation, elderberry is \u003cem\u003elikely safe\u003c/em\u003e in food amounts, but there is insufficient data to ensure its safety when used as a dietary supplement or medicinally. Larger doses should be avoided. There is also the ongoing concern about accuracy of supplement labels (and product contents) which increases the risk to the pregnant/breast feeding.\u003c/p\u003e\n\n\n\n\u003ch2\u003eDon’t skip your flu or COVID-19 shot this fall\u003c/h2\u003e\n\n\n\n\u003cp\u003eVery weak data suggest that elderberry may offer some benefit for colds and flu, but it’s also refuted with conflicting evidence that is more compelling. I don’t recommend elderberry, but it has a reasonable safety profile for most adults. If people really want to self-medicate with something, I warn them that it may not be helpful and there’s a suggestion it could actually be harmful. \u003c/p\u003e\n\n\n\n\n\n\n\n\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Scott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada.\n\nScott has no conflicts of interest to disclose.\n\nDisclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional.                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/scottg416/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Website\" href=\"http://sciencebasedpharmacy.wordpress.com/\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#85e2e4f3f0f7e4c5e2e8e4ece9abe6eae8\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\n\n\t\n\t\t\t\n\t\n\u003c/article\u003e\n\t\u003cdiv\u003e\n\t\t\t\u003ch3\u003e\n\t\t\t\t\t\t\t\t\tPosted by\t\t\t\t\t\t\t\tScott Gavura\u003c/h3\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eScott Gavura, BScPhm, MBA, RPh is committed to improving the way medications are used, and examining the profession of pharmacy through the lens of science-based medicine. He has a professional interest is improving the cost-effective use of drugs at the population level. Scott holds a Bachelor of Science in Pharmacy degree, and a Master of Business Administration degree from the University of Toronto, and has completed a Accredited Canadian Hospital Pharmacy Residency Program. His professional background includes pharmacy work in both community and hospital settings. He is a registered pharmacist in Ontario, Canada.\n\nScott has no conflicts of interest to disclose.\n\nDisclaimer: All views expressed by Scott are his personal views alone, and do not represent the opinions of any current or former employers, or any organizations that he may be affiliated with. All information is provided for discussion purposes only, and should not be used as a replacement for consultation with a licensed and accredited health professional.\u003c/p\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/div\u003e\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n            \n\n            \n\n\n    \u003c/main\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-10T07:50:00-04:00",
  "modifiedTime": "2024-10-10T02:53:10Z"
}
