{
  "id": "d3de49af-517e-41d9-8098-278c13457e42",
  "title": "Climate-Fueled Disasters Are Raising Insurance Rates",
  "link": "https://www.scientificamerican.com/article/climate-fueled-disasters-are-raising-insurance-rates/",
  "description": "Increasingly intense hurricanes, wildfires and other climate disasters have forced these state-run backstop insurance groups into a role typically assumed by the private sector as the primary insurer within their borders",
  "author": "",
  "published": "Tue, 15 Oct 2024 18:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Zack Colman",
  "length": 9042,
  "excerpt": "Increasingly intense hurricanes, wildfires and other climate disasters have forced these state-run backstop insurance groups into a role typically assumed by the private sector as the primary insurer within their borders",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "CLIMATEWIRE | The devastation caused by Hurricanes Helene and Milton has sharpened concerns about the financial stability of state-run insurance plans and the escalating climate risks they are taking on.Increasingly intense hurricanes, wildfires and other climate disasters have forced these so-called insurers of last resort into a role typically assumed by the private sector as the primary insurer within their borders. This has left these backstop insurers holding more risky policies for property in vulnerable locations.And lawmakers and finance experts fear these state programs might not be able to carry that burden for much longer, looking toward the federal government to step in to deal with the rising costs of these disasters.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\"There is a sense that there might need to be some broader response here than just state-level programs,\" said Thomas Zemetis, a director and analytical lead at S\u0026P Global Ratings with expertise in public finance. \"It seems that some of that is coming forth in the federal view and the lens to say, 'Do we need something that's more broadly supportive as these risks continue to rise and there's the increased exits or reduction in policy coverage at an affordable level?'\"Conceived as a fallback to ensure homeowners can maintain insurance needed to secure mortgages, these insurers offer subsidized policies when private insurance is unavailable. But they are now operating in ways they never anticipated as increasing climate risks shrink private insurance options and boost premiums across the country.“I’m pretty skeptical of the longer-term willingness of states to continue to shoulder the burden,” said Benjamin Keys, a real estate and finance professor at the University of Pennsylvania’s Wharton School.If state-run programs continue to be the only option for some homeowners in climate-distressed areas, the financial pressures will likely continue to grow, raising fears that they will ultimately have to turn to federal taxpayers for help.In Florida, Hurricane Milton’s damage could have a major impact on the state’s insurance market. Milton made landfall near Sarasota as a Category 3 storm, but the state may have avoided the worst-case scenario of a landfall in the vulnerable Tampa Bay region, the nation’s 17th most populous metro region.Citizens Property Insurance, the Florida state-backed insurer, has said it can cover losses from Helene and Milton through its reserve and catastrophe fund. It could also raise rates for all Florida policyholders, whether for property or otherwise, to plug the gap — even if they live nowhere near the disaster zone.Citizens is the largest insurance provider in the state at 1.3 million policies. Republican Gov. Ron DeSantis has previously warned it is not solvent, though Citizens’ CEO has pushed back on that claim. Those statements sparked an investigation by the Senate Budget Committee earlier this year to explore how a destructive event in Florida could ripple across the country if Citizens cannot cover its losses.“Climate change is driving insurance premiums higher across the country, and nowhere more so than in Florida, which is in the throes of a full-blown insurance crisis,” Senate Budget Committee Chair Sheldon Whitehouse said in a statement on Wednesday. “Citizens, Florida’s state-backed insurer of last resort, has ballooned in recent years and is potentially one catastrophic storm or storm season away from insolvency, raising the prospect of a request for a federal bailout.”Analysts are still closely monitoring the state-backed insurer’s financial position.“Citizens Property Insurance Corporation has been making concerted efforts to depopulate its book,” AM Best, an insurance rating agency, said in a note Wednesday. “However, any cutback in capacity among other insurers will only add to the number of property owners covered by Citizens.”The private sector’s flight from Florida, due to a combination of litigation and flood- and wind-risk from hurricanes and climate change, thrust Citizens into a greater role to stabilize insurance markets, property values and homeownership. But similar trends are playing out in California, Louisiana and now Texas and North Carolina, all of which operate state insurance plans, said Ishita Sen, an assistant professor of business administration at Harvard Business School.“Florida is 20 years ahead of other states” in terms of climate risks to insurance, Sen said. “How much Citizens can withstand a shock will tell us a lot about how the states can act as a backstop.”While Florida’s plan is truly backed by the state, meaning the state itself is ultimately on the hook for covering losses, other state-run insurance plans in California, Louisiana, Texas and North Carolina operate differently. Those programs require the private companies that write policies elsewhere in the state to collectively cover losses for homeowners who could not find affordable private insurance.But if private firms want to avoid paying out the riskier policies that form that pool, they can elect to leave the state entirely, which would in turn raise the costs on the private companies that remain in the state-run plans.The warning signs for other state-backed insurance programs are growing. The head of California’s insurer of last resort raised alarms earlier this year that its model is becoming infeasible, which has put pressure on the state to allow private companies to more easily recoup losses.California Insurance Commissioner Ricardo Lara is implementing a climate resilience strategy that state insurance commissioners agreed to in March, said Michael Soller, deputy insurance commissioner and spokesperson. Recent actions would require its state plan to pay from reserves, reinsurance and other sources to prevent people from paying the full costs from an event that exhausts its existing funds, he said.\"Commissioner Lara’s strategy will lead to increased writing of policies in wildfire-distressed areas,\" Soller said.In North Carolina, insurers on Monday argued for an average 42 percent rate hike in a hearing before the state insurance commission, noting Helene and other storms have ballooned losses.“Whether you want to call it climate change or not, there is no denying that we are having bigger, stronger, and more costly catastrophic storms than we have seen in any of our lifetimes,” Mickey Spivey, attorney for insurance industry group North Carolina Rate Bureau, said in the hearing.Insurer decisions to reject coverage renewals for California homeowners in its most wildfire-affected regions spiked 800 percent between 2015 and 2021, according to research by climate risk firm First Street Foundation. Louisiana’s state plan has adjusted to the growing riskiness of its books by hitting thousands of policyholders in 2022 with an average 63 percent premium hike to account for losses.It’s those types of figures that have the Senate Budget Committee and experts like Keys worrying the state-backed systems are becoming unsustainable.“It is a new and unprecedented burden,” he said. “State lawmakers would much prefer to have this burden passed on to every taxpayer in the country rather than their own citizens.”Federal lawmakers from these states have already begun looking for Congress to create an off-ramp for their state insurance backstops, though with little traction.Rep. Jared Moskowitz (D-Fla.) floated legislation in May 2023 that would require the federal government to issue cheap bonds to cover the gap in insurance premiums for homeowners after a hurricane. It would essentially subsidize homeowner insurance in places where premiums are skyrocketing and availability is shrinking due to climate risk.Rep. Adam Schiff (D-Calif.), introduced a bill in January that would create a federal reinsurance program to offer government-backed coverage to people who cannot find insurance in the nation’s riskier areas, such as the wildfire-prone regions that dot the Golden State.“While the Congressman’s work primarily focuses on the federal level, California’s FAIR plan wasn’t designed to be a first resort,” Schiff spokesperson Marisol Samayoa said in a statement. “The fact that it has become the only option for so many Californians highlights the failure of the insurance market to provide affordable coverage, prioritizing profits over people by pulling out of entire states. Insurance companies have long profited from the climate crisis while continuing to support fossil fuel projects. As a result, state plans like the FAIR plan have become the only option for many families, putting an undue strain on state resources.”Reprinted from E\u0026E News with permission from POLITICO, LLC. Copyright 2024. E\u0026E News provides essential news for energy and environment professionals.",
  "image": "https://static.scientificamerican.com/dam/m/29eda41906432682/original/home_sits_on_road_after_hurricane_milton.jpg?w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCLIMATEWIRE |\u003c/b\u003e The devastation caused by Hurricanes Helene and Milton has sharpened concerns about the financial stability of state-run insurance plans and the escalating climate risks they are taking on.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIncreasingly intense hurricanes, wildfires and other climate disasters have forced these so-called insurers of last resort into a role typically assumed by the private sector as the primary insurer within their borders. This has left these backstop insurers holding more risky policies for property in vulnerable locations.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd lawmakers and finance experts fear these state programs might not be able to carry that burden for much longer, looking toward the federal government to step in to deal with the rising costs of these disasters.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;There is a sense that there might need to be some broader response here than just state-level programs,\u0026#34; said Thomas Zemetis, a director and analytical lead at S\u0026amp;P Global Ratings with expertise in public finance. \u0026#34;It seems that some of that is coming forth in the federal view and the lens to say, \u0026#39;Do we need something that\u0026#39;s more broadly supportive as these risks continue to rise and there\u0026#39;s the increased exits or reduction in policy coverage at an affordable level?\u0026#39;\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eConceived as a fallback to ensure homeowners can maintain insurance needed to secure mortgages, these insurers offer subsidized policies when private insurance is unavailable. But they are now operating in ways they never anticipated as increasing climate risks shrink private insurance options and boost premiums across the country.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“I’m pretty skeptical of the longer-term willingness of states to continue to shoulder the burden,” said Benjamin Keys, a real estate and finance professor at the University of Pennsylvania’s Wharton School.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf state-run programs continue to be the only option for some homeowners in climate-distressed areas, the financial pressures will likely continue to grow, raising fears that they will ultimately have to turn to federal taxpayers for help.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn Florida, Hurricane Milton’s damage could have a major impact on the state’s insurance market. Milton made landfall near Sarasota as a Category 3 storm, but the state \u003ca href=\"https://subscriber.politicopro.com/article/2024/10/heavy-hit-florida-may-have-avoided-worst-case-scenario-from-hurricane-milton-00183211\"\u003emay have avoided the worst-case scenario\u003c/a\u003e of a landfall in the vulnerable Tampa Bay region, the nation’s 17th most populous metro region.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCitizens Property Insurance, the Florida state-backed insurer, \u003ca href=\"https://subscriber.politicopro.com/eenews/article/eenews/2024/10/09/this-is-the-worst-case-scenario-hurricane-milton-could-clobber-floridas-insurance-market-ee-00183098\"\u003ehas said it can cover losses\u003c/a\u003e from Helene and Milton through its reserve and catastrophe fund. It could also raise rates for all Florida policyholders, whether for property or otherwise, to plug the gap — even if they live nowhere near the disaster zone.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCitizens is the largest insurance provider in the state at 1.3 million policies. Republican Gov. Ron DeSantis has previously \u003ca href=\"https://subscriber.politicopro.com/article/eenews/2024/03/08/desantis-keeps-saying-floridas-largest-insurer-is-financially-broke-it-has-5b-00145507\"\u003ewarned it is not solvent\u003c/a\u003e, though Citizens’ CEO has \u003ca href=\"https://subscriber.politicopro.com/article/2023/12/florida-citizens-ceo-snaps-back-at-us-senator-who-questioned-insurer-finances-00132085?source=email\"\u003epushed back on that claim\u003c/a\u003e. Those statements sparked an investigation by the \u003ca href=\"https://subscriber.politicopro.com/article/2024/03/more-federal-scrutiny-of-citizens-after-desantis-remarks-00147906\"\u003eSenate Budget Committee earlier this year\u003c/a\u003e to explore how a destructive event in Florida could ripple across the country if Citizens cannot cover its losses.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Climate change is driving insurance premiums higher across the country, and nowhere more so than in Florida, which is in the throes of a full-blown insurance crisis,” Senate Budget Committee Chair Sheldon Whitehouse said in a statement on Wednesday. “Citizens, Florida’s state-backed insurer of last resort, has ballooned in recent years and is potentially one catastrophic storm or storm season away from insolvency, raising the prospect of a request for a federal bailout.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnalysts are still closely monitoring the state-backed insurer’s financial position.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Citizens Property Insurance Corporation has been making concerted efforts to depopulate its book,” AM Best, an insurance rating agency, said in a note Wednesday. “However, any cutback in capacity among other insurers will only add to the number of property owners covered by Citizens.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe private sector’s flight from Florida, due to a combination of litigation and flood- and wind-risk from hurricanes and climate change, thrust Citizens into a greater role to stabilize insurance markets, property values and homeownership. But similar trends are playing out in California, Louisiana and now Texas and North Carolina, all of which operate state insurance plans, said Ishita Sen, an assistant professor of business administration at Harvard Business School.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Florida is 20 years ahead of other states” in terms of climate risks to insurance, Sen said. “How much Citizens can withstand a shock will tell us a lot about how the states can act as a backstop.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhile Florida’s plan is truly backed by the state, meaning the state itself is ultimately on the hook for covering losses, other state-run insurance plans in California, Louisiana, Texas and North Carolina operate differently. Those programs require the private companies that write policies elsewhere in the state to collectively cover losses for homeowners who could not find affordable private insurance.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut if private firms want to avoid paying out the riskier policies that form that pool, they can elect to leave the state entirely, which would in turn raise the costs on the private companies that remain in the state-run plans.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe warning signs for other state-backed insurance programs are growing. The head of California’s insurer of last resort raised alarms earlier this year that \u003ca href=\"https://www.eenews.net/articles/californias-insurer-of-last-resort-is-a-ticking-time-bomb/\"\u003eits model is becoming infeasible\u003c/a\u003e, which has put pressure on the state to allow private companies to more easily recoup losses.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCalifornia Insurance Commissioner Ricardo Lara is implementing a climate resilience strategy that state insurance commissioners agreed to in March, said Michael Soller, deputy insurance commissioner and spokesperson. Recent actions would require its state plan to pay from reserves, reinsurance and other sources to prevent people from paying the full costs from an event that exhausts its existing funds, he said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Commissioner Lara’s strategy will lead to increased writing of policies in wildfire-distressed areas,\u0026#34; Soller said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn North Carolina, insurers on Monday \u003ca href=\"https://www.ncdoi.gov/homeowners-insurance-rate-hearing-docket-2157-vol-1-copy-am-10-07-2024/open\"\u003eargued for an average 42 percent rate hike\u003c/a\u003e in a hearing before the state insurance commission, noting Helene and other storms have ballooned losses.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Whether you want to call it climate change or not, there is no denying that we are having bigger, stronger, and more costly catastrophic storms than we have seen in any of our lifetimes,” Mickey Spivey, attorney for insurance industry group North Carolina Rate Bureau, said in the hearing.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eInsurer decisions to reject coverage renewals for California homeowners in its most wildfire-affected regions spiked 800 percent between 2015 and 2021, according to research by climate risk firm First Street Foundation. Louisiana’s state plan has adjusted to the growing riskiness of its books by hitting thousands of policyholders in 2022 with an \u003ca href=\"https://ldi.la.gov/news/press-releases/10-10-22-ldi-approves-citizens-rate-increase-and-offers-tips-for-policyholders\"\u003eaverage 63 percent premium hike\u003c/a\u003e to account for losses.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIt’s those types of figures that have the Senate Budget Committee and experts like Keys worrying the state-backed systems are becoming unsustainable.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“It is a new and unprecedented burden,” he said. “State lawmakers would much prefer to have this burden passed on to every taxpayer in the country rather than their own citizens.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eFederal lawmakers from these states have already begun looking for Congress to create an off-ramp for their state insurance backstops, though with little traction.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eRep. Jared Moskowitz (D-Fla.) floated legislation in May 2023 that would require the federal government to issue cheap bonds to cover the gap in insurance premiums for homeowners after a hurricane. It would essentially subsidize homeowner insurance in places where premiums are skyrocketing and availability is shrinking due to climate risk.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eRep. Adam Schiff (D-Calif.), introduced a bill in January that would create a federal reinsurance program to offer government-backed coverage to people who cannot find insurance in the nation’s riskier areas, such as the wildfire-prone regions that dot the Golden State.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“While the Congressman’s work primarily focuses on the federal level, California’s FAIR plan wasn’t designed to be a first resort,” Schiff spokesperson Marisol Samayoa said in a statement. “The fact that it has become the only option for so many Californians highlights the failure of the insurance market to provide affordable coverage, prioritizing profits over people by pulling out of entire states. Insurance companies have long profited from the climate crisis while continuing to support fossil fuel projects. As a result, state plans like the FAIR plan have become the only option for many families, putting an undue strain on state resources.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eReprinted from \u003c/i\u003e\u003ca href=\"https://www.eenews.net/\"\u003e\u003ci\u003eE\u0026amp;E News\u003c/i\u003e\u003c/a\u003e\u003ci\u003e with permission from POLITICO, LLC. Copyright 2024. E\u0026amp;E News provides essential news for energy and environment professionals.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-15T18:00:00Z",
  "modifiedTime": null
}
