{
  "id": "d41013fc-96de-4643-92a0-44803f941934",
  "title": "Comparing baseball greats across eras, who comes out on top?",
  "link": "https://phys.org/news/2025-07-baseball-greats-eras.html",
  "description": "An interdisciplinary study co-authored by researchers from the statistics and history departments at the University of Illinois Urbana-Champaign introduces a novel statistical framework for comparing baseball players across different eras.",
  "author": "",
  "published": "Thu, 24 Jul 2025 16:18:14 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Mathematics"
  ],
  "byline": "University of Illinois at Urbana-Champaign",
  "length": 2760,
  "excerpt": "An interdisciplinary study co-authored by researchers from the statistics and history departments at the University of Illinois Urbana-Champaign introduces a novel statistical framework for comparing baseball players across different eras.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Pixabay/CC0 Public Domain An interdisciplinary study co-authored by researchers from the statistics and history departments at the University of Illinois Urbana-Champaign introduces a novel statistical framework for comparing baseball players across different eras. The paper, titled \"Comparing Baseball Players Across Eras Via Novel Full House Modeling,\" appears in The Annals of Applied Statistics and offers a significant advancement in how historical player performance is understood and evaluated. The research team includes postdoctoral researcher Shen Yan, professors Christopher Kinson, and Daniel Eck from the Department of Statistics, and professor Adrian Burgos Jr. from the Department of History. Their work addresses debates that tend to overvalue players from earlier eras of baseball. To do this, the authors created Full House Models that adjust player metrics by balancing relative performance within a season against the size and quality of the talent pool at the time. The team's findings indicate that players like Barry Bonds and Willie Mays rise to the top, surpassing legends Henry \"Hank\" Aaron and Babe Ruth as all-time great batters, while Roger Clemens, Greg Maddux, and Randy Johnson rank as the best era-adjusted pitchers of all time. These results stem from the fact that today's players compete in significantly larger and more competitive talent pools. The research is part of a broader initiative from the Eck Sports Lab, whose mission is to explore all aspects of baseball through accessible, entertaining, and rigorous interdisciplinary research. The Full House Modeling project is a significant step in the lab's ongoing efforts to develop principled, era-neutral metrics for evaluating player greatness. The Eck Sports Lab project was recently referenced in a segment of the \"Baseball Bits\" YouTube series by Foolish Baseball, which explored Hank Aaron's remarkable consistency across his career. More information: Shen Yan et al, Comparing baseball players across eras via novel Full House Modeling, The Annals of Applied Statistics (2025). DOI: 10.1214/24-AOAS1992 Journal information: Annals of Applied Statistics",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/yankee-stadium.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n        \u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1229052\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/yankee-stadium.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/yankee-stadium.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/yankee-stadium.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/yankee-stadium.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/yankee-stadium.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/yankee-stadium.jpg\" width=\"800\" height=\"530\" alt=\"yankee stadium\" title=\"Credit: Pixabay/CC0 Public Domain\" fetchpriority=\"high\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pixabay/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eAn interdisciplinary study co-authored by researchers from the statistics and history departments at the University of Illinois Urbana-Champaign introduces a novel statistical framework for comparing baseball players across different eras.\u003c/p\u003e\n\n                \n                                \n                \n                \n                                    \u003cp\u003eThe paper, titled \u0026#34;Comparing Baseball Players Across Eras Via Novel Full House Modeling,\u0026#34; \u003ca href=\"https://projecteuclid.org/journals/annals-of-applied-statistics/volume-19/issue-2/Comparing-baseball-players-across-eras-via-novel-Full-House-Modeling/10.1214/24-AOAS1992.full\" target=\"_blank\"\u003eappears\u003c/a\u003e in \u003ci\u003eThe Annals of Applied Statistics\u003c/i\u003e and offers a significant advancement in how historical player performance is understood and evaluated.\u003c/p\u003e\n\u003cp\u003eThe research team includes postdoctoral researcher Shen Yan, professors Christopher Kinson, and Daniel Eck from the Department of Statistics, and professor Adrian Burgos Jr. from the Department of History. Their work addresses debates that tend to overvalue players from earlier eras of baseball. To do this, the authors created Full House Models that adjust player metrics by balancing relative performance within a season against the size and quality of the talent pool at the time.\u003c/p\u003e\n\u003cp\u003eThe team\u0026#39;s findings indicate that players like Barry Bonds and Willie Mays rise to the top, surpassing legends Henry \u0026#34;Hank\u0026#34; Aaron and Babe Ruth as all-time great batters, while Roger Clemens, Greg Maddux, and Randy Johnson rank as the best era-adjusted pitchers of all time. These results stem from the fact that today\u0026#39;s players compete in significantly larger and more competitive talent pools.\u003c/p\u003e\n\u003cp\u003eThe research is part of a broader initiative from the Eck Sports Lab, whose mission is to explore all aspects of \u003ca href=\"https://phys.org/tags/baseball/\" rel=\"tag\"\u003ebaseball\u003c/a\u003e through accessible, entertaining, and rigorous interdisciplinary research. The Full House Modeling project is a significant step in the lab\u0026#39;s ongoing efforts to develop principled, era-neutral metrics for evaluating player greatness.\u003c/p\u003e\n\u003cp\u003eThe Eck Sports Lab project was recently referenced in a segment of the \u0026#34;Baseball Bits\u0026#34; YouTube series by Foolish Baseball, which explored Hank Aaron\u0026#39;s remarkable consistency across his career.\u003c/p\u003e\n\n                \n                  \n\n                \n                                    \u003cdiv\u003e\n                                                    \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Shen Yan et al, Comparing baseball players across eras via novel Full House Modeling, \u003ci\u003eThe Annals of Applied Statistics\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1214/24-AOAS1992\" target=\"_blank\"\u003eDOI: 10.1214/24-AOAS1992\u003c/a\u003e\n                            \u003c/p\u003e\n                                                                        \n                                                    \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                                                    \u003ca href=\"https://phys.org/journals/annals-of-applied-statistics/\"\u003eAnnals of Applied Statistics\u003c/a\u003e\n                                                                            \u003ca href=\"http://imstat.org/aoas/\" target=\"_blank\" rel=\"nofollow\"\u003e\n                                            \u003ci\u003e\u003c/i\u003e\n                                        \u003c/a\u003e\n                                                                         \n                                                            \u003c/p\u003e\n                                            \u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\n\t\t  \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-24T16:18:14-04:00",
  "modifiedTime": null
}
