{
  "id": "dd2736aa-0948-467a-9d0a-2c6b1cd4b0bf",
  "title": "Storing carbon in buildings could help address climate change",
  "link": "https://www.sciencedaily.com/releases/2025/01/250109141128.htm",
  "description": "Construction materials such as concrete and plastic have the potential to lock away billions of tons of carbon dioxide, according to a new study by civil engineers and earth systems scientists. The study shows that combined with steps to decarbonize the economy, storing CO2 in buildings could help the world achieve goals for reducing greenhouse gas emissions.",
  "author": "",
  "published": "Thu, 09 Jan 2025 14:11:28 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3296,
  "excerpt": "Construction materials such as concrete and plastic have the potential to lock away billions of tons of carbon dioxide, according to a new study by civil engineers and earth systems scientists. The study shows that combined with steps to decarbonize the economy, storing CO2 in buildings could help the world achieve goals for reducing greenhouse gas emissions.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Construction materials such as concrete and plastic have the potential to lock away billions of tons of carbon dioxide, according to a new study by civil engineers and earth systems scientists at the University of California, Davis and Stanford University. The study, published Jan. 10 in Science, shows that combined with steps to decarbonize the economy, storing CO2 in buildings could help the world achieve goals for reducing greenhouse gas emissions. \"The potential is pretty large,\" said Elisabeth Van Roijen, who led the study as a graduate student at UC Davis. The goal of carbon sequestration is to take carbon dioxide, either from where it is being produced or from the atmosphere, convert it into a stable form and store it away from the atmosphere where it cannot contribute to climate change. Proposed schemes have involved, for example, injecting carbon underground or storing it in the deep ocean. These approaches pose both practical challenges and environmental risks. \"What if, instead, we can leverage materials that we already produce in large quantities to store carbon?\" Van Roijen said. Working with Sabbie Miller, associate professor of civil and environmental engineering at UC Davis, and Steve Davis at Stanford University, Van Roijen calculated the potential to store carbon in a wide range of common building materials including concrete (cement and aggregates), asphalt, plastics, wood and brick. More than 30 billion tons of conventional versions of these materials are produced worldwide every year. Concrete potential The carbon-storing approaches studied included adding biochar (made by heating waste biomass) into concrete; using artificial rocks that can be loaded with carbon as concrete and asphalt pavement aggregate; plastics and asphalt binders based on biomass rather than fossil petroleum sources; and including biomass fiber into bricks. These technologies are at different stages of readiness, with some still being investigated at a lab or pilot scale and others already available for adoption. Researchers found that while bio-based plastics could take up the largest amount of carbon by weight, by far the largest potential for carbon storage is in using carbonated aggregates to make concrete. That's because concrete is by far the world's most popular building material: Over 20 billion tons are produced every year. \"If feasible, a little bit of storage in concrete could go a long way,\" Miller said. The team calculated that if 10% of the world's concrete aggregate production were carbonateable, it could absorb a gigaton of CO2. The feedstocks for these new processes for making building materials are mostly low-value waste materials such as biomass, Van Roijen said. Implementing these new processes would enhance their value, creating economic development and promoting a circular economy, she said. Some technology development is needed, particularly in cases where material performance and net-storage potential of individual manufacturing methods must be validated. However, many of these technologies are just waiting to be adopted, Miller said. Van Roijen is now a researcher at the U.S. Department of Energy National Renewable Energy Laboratory. The work was supported by Miller's CAREER grant from the National Science Foundation.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eConstruction materials such as concrete and plastic have the potential to lock away billions of tons of carbon dioxide, according to a new study by civil engineers and earth systems scientists at the University of California, Davis and Stanford University. The study, published Jan. 10 in \u003cem\u003eScience\u003c/em\u003e, shows that combined with steps to decarbonize the economy, storing CO\u003csub\u003e2\u003c/sub\u003e in buildings could help the world achieve goals for reducing greenhouse gas emissions.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;The potential is pretty large,\u0026#34; said Elisabeth Van Roijen, who led the study as a graduate student at UC Davis.\u003c/p\u003e\n\u003cp\u003eThe goal of carbon sequestration is to take carbon dioxide, either from where it is being produced or from the atmosphere, convert it into a stable form and store it away from the atmosphere where it cannot contribute to climate change. Proposed schemes have involved, for example, injecting carbon underground or storing it in the deep ocean. These approaches pose both practical challenges and environmental risks.\u003c/p\u003e\n\u003cp\u003e\u0026#34;What if, instead, we can leverage materials that we already produce in large quantities to store carbon?\u0026#34; Van Roijen said.\u003c/p\u003e\n\u003cp\u003eWorking with Sabbie Miller, associate professor of civil and environmental engineering at UC Davis, and Steve Davis at Stanford University, Van Roijen calculated the potential to store carbon in a wide range of common building materials including concrete (cement and aggregates), asphalt, plastics, wood and brick.\u003c/p\u003e\n\u003cp\u003eMore than 30 billion tons of conventional versions of these materials are produced worldwide every year.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eConcrete potential\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe carbon-storing approaches studied included adding biochar (made by heating waste biomass) into concrete; using artificial rocks that can be loaded with carbon as concrete and asphalt pavement aggregate; plastics and asphalt binders based on biomass rather than fossil petroleum sources; and including biomass fiber into bricks. These technologies are at different stages of readiness, with some still being investigated at a lab or pilot scale and others already available for adoption.\u003c/p\u003e\n\n\n\u003cp\u003eResearchers found that while bio-based plastics could take up the largest amount of carbon by weight, by far the largest potential for carbon storage is in using carbonated aggregates to make concrete. That\u0026#39;s because concrete is by far the world\u0026#39;s most popular building material: Over 20 billion tons are produced every year.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If feasible, a little bit of storage in concrete could go a long way,\u0026#34; Miller said. The team calculated that if 10% of the world\u0026#39;s concrete aggregate production were carbonateable, it could absorb a gigaton of CO\u003csub\u003e2\u003c/sub\u003e.\u003c/p\u003e\n\u003cp\u003eThe feedstocks for these new processes for making building materials are mostly low-value waste materials such as biomass, Van Roijen said. Implementing these new processes would enhance their value, creating economic development and promoting a circular economy, she said.\u003c/p\u003e\n\u003cp\u003eSome technology development is needed, particularly in cases where material performance and net-storage potential of individual manufacturing methods must be validated. However, many of these technologies are just waiting to be adopted, Miller said.\u003c/p\u003e\n\u003cp\u003eVan Roijen is now a researcher at the U.S. Department of Energy National Renewable Energy Laboratory. The work was supported by Miller\u0026#39;s CAREER grant from the National Science Foundation.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
