{
  "id": "e09bde17-3ab1-4604-bf1a-4762d357808c",
  "title": "Tell us Dr. John Ioannidis, Exactly Who is Waging This “War on Science”?",
  "link": "https://sciencebasedmedicine.org/war-on-science/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=war-on-science",
  "description": "When science was under attack, Dr. John Ioannidis played the role of enabler. Along with his copious COVID misinformation, that will be his permanent legacy. The post Tell us Dr. John Ioannidis, Exactly Who is Waging This “War on Science”? first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Thu, 17 Apr 2025 07:04:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 11907,
  "excerpt": "When science was under attack, Dr. John Ioannidis played the role of enabler. Along with his copious COVID misinformation, that will be his permanent legacy.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "I think that war on science, science surrendered immediately and the whole country of science was torn In a previous article, I discussed Dr. John Ioannidis and his supposed “biggest mistake”. He said: So I think that science is about mistakes, it’s about making mistakes, but trying to realize them and compare them with what might be better evidence and hopefully correct them as quickly as possible. And I think my biggest mistake, and I think that others can probably think about their mistakes, is that I underestimated how much power politics and media and powers outside of science, could have on science. I think that I had no clue and no preparation for this invasion of science.   I think that war on science, science surrendered immediately and the whole country of science was torn apart among people with very different ideologies and partisan beliefs with strong opinions, with power struggles, with the thirst for power and dominance and conflicts and that’s something that I have not witnessed before and I was not prepared for that and I think that I did my best, but I was close to ridiculously poorly prepared for that. I think my preparation had been for debates with other scientists with a few scientists who might be knowledgeable in the field or are interested, and sometimes very interested and are fighting for the truth, which is of course evasive for all of us, but I was not prepared to have to fight with all of these powers that had nothing to do with science. That’s something that I feel a complete idiot about. While I don’t think this was Dr. Ioannidis’ biggest mistake, I basically said the same thing in my article I Confess My Sins: I Was Too Slow and Timid to Call Out Propaganda For What It Is. I have been following cranks like RFK Jr. for many years, and I greatly underestimated their threat. Not only is RFK Jr. is taking a wrecking ball to everything, as the video below shows, he is also plagiarizing misinformation spread by Dr. Ioannidis in 2020, absurdly claiming that COVID wasn’t to blame for the deaths of people with underlying conditions. Everything that’s happening now is just a continuation of a process that began in March 2020, when the misinformation started. The only thing that’s changed is that the doctors who spread the misinformation are now in charge. They are now the Medical Establishment and they own everything that’s happening right now. Their harm will reverberate for decades. Currently, things seem to be going very poorly for them and everyone around them. I discussed this and many similar myths spread by Dr. Ioannidis here. BMJ had a strong bias in favour of authors advocating an aggressive approach to COVID-19 mitigation. We at SBM have been agree that there has been a war on science and we have been crystal clear about about who is attacking it. Dr. Gorski wrote about this Monday in his article How Bad Is It? RFK Jr.’s Extinction-Level Threat to Science-Based Federal Health Policy and Public Health is Here and my article Doctors Who Fluffed RFK Jr.: Here’s What You Own So Far, contained a long list of horrific articles about the state of science and medicine in the U.S. today. We may be wrong- though our articles remain unrefuted- however we at SBM staked out an unambiguous position in this “war on science.” Their is no doubt about where we stand and whom we blame. Of course, none of this is any secret. In fact, it’s all over the news. It’s impossible to miss. Despite this, Dr. Ioannidis has only uttered bland platitudes about the “war on science” while remaining mostly silent about the battles and warriors. His publication record provides a clue as to whom he believes the aggressors to be- his critics. His article Constructive and Obsessive Criticism in Science written with pro-RFK Jr. propagandist Dr. Vinay Prasad, lamented harassment and scientific bullying with “ad hominem aspects” saying: Typical behaviors include: repetitive and persistent comments (including sealioning), lengthy commentaries/tweetorials/responses often longer than the original work, strong degree of moralizing, distortion of the underlying work, argumentum ad populum, calls to suspend/censor/retract the work of the author, guilt by association, reputational tarnishing, large gains in followers specifically through attacks, finding and positing sensitive personal information, anonymity or pseudonymity, social media campaigning, and unusual ratio of criticism to pursuit of one’s research agenda. Who specifically is guilty of this behavior? Dr. Ioannidis did not say, though his co-author Dr. Prasad routinely launched juvenile, vulgar personal attacks, compiled here by Pandemic Accountablity Index. To my knowledge, Dr. Ioannidis has never complained about Dr. Prasad’s immature profanity or his calls for mass purges of scientists. Dr. Ioannidis was also willing to found a new “journal” with Dr. Martin Kulldorff, who sent out a guillotine Tweet along with an article written by a child-labor advocate. This was not a bridge too far for Dr. Ioannidis. He did not mind that Dr. Jay Bhattacharya campaigned for anti-vaxx crank RFK Jr or that he made nearly $12,000 posting on Twitter, giving him a financial incentive to keep his audience engaged and inflamed. He said nothing when Dr. Marty Makary endorsed RFK Jr.’s most vile lies about vaccines. That was not a deal-breaker for Dr. Ioannidis. None of this was part of the “war on science,” apparently. This is not to say Dr. Ioannidis didn’t have his pandemic villains. Last month, Dr. Ioannidis published an article titled COVID-19 Advocacy Bias in the BMJ: Meta-Research Evaluation, which concluded that: BMJ had a strong bias in favour of authors advocating an aggressive approach to COVID-19 mitigation. Advocacy bias may influence public opinion and policy decisions and should be mitigated in future health crises in favour of open and balanced debate of different policy options. In this moment, with all that’s happening, that is the hill he is willing to die on. This seems to be this the “war on science” that Dr. Ioannidis had in mind. I got my start here debunking anti-vaccine balderdash from the BMJ. Should the BMJ have published more of it? Did the BMJ owe space to Dr. Ioannidis simply because of who he is? Is Dr. Ioannidis a causality in the “war on science?” For the most part, I don’t think so. Dr. Ioannidis reported that he received threats, which is of course abhorrent and completely unacceptable. However, he’s healthy and employed, thankfully, and any dents to his reputation are his own doing. He didn’t have to that claim the flu would be worse than COVID and that it would kill 40,000 Americans. No one forced him to repeatedly minimize COVID on Fox News. However, when discussing the “war on science”, I can’t recall Dr. Ioannidis ever lamenting the tragedy of young people who died due to anti-vaccine misinformation spread by doctors he’s collaborated with. I’ve not seen seen him bemoan the attacks on universities, the mass purges, or the chaos and dysfunction at the FDA and NIH. Given our mutual concern about this “war on science,” I’d be curious to hear Dr. Ioannidis’ thoughts on these headlines and the men responsible for them. As far as I know, he’s said nothing. If there are examples, let me know in the comments and I will add them to this article. Read these articles here and here. Instead of recognizing this sad reality, Dr. Ioannidis continues to vaguely worry about “science becoming a political battleground” as if that is something that might happen one day if we are not careful. “That’s not going to help anyone. The winners and the losers, they’re both going to be losers,” he added in a recent speech. In the video below he warns about “the wrong way to go”, implying that things are OK now. Dr. Ioannidis is trying to warn us about a potential dark future in a very serious and sober way, but he’s got nothing to say about the present. In the same way headlines of mass morgues didn’t impress him 5 years ago, headlines about mass purges don’t seem to bother him today. One wonders what would have to happen for him to care more about actual disasters than theoretical threats. Well, I have bad news for Dr. Ioannidis. We weren’t careful, science became a political battleground, and the headlines leave no doubt as to whom is responsible. Widespread indifference to misinformation spread by doctors for the past 5 years directly led us to this moment. The same doctors who relentlessly spread fake COVID nonsense, are today pictured in articles about “purges” and “firings.” I suspect that if Dr. Ioannidis were to acknowledge this, he’d be forced to confront the uncomfortable fact that he partnered with these doctors, legitimized them, and shared their pandemic vision. He overlooked everything they did. When science was under attack, he played the role of enabler. Along with his copious COVID misinformation, that will be his legacy. He’s right about some things though- science is the best thing that has happened to humans, and when it becomes a political battleground, there are only losers. All this is happening right now. Just read a newspaper. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-13.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003ch2\u003eI think that war on science, science surrendered immediately and the whole country of science was torn \u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://sciencebasedmedicine.org/mistakes/\"\u003eIn a previous article\u003c/a\u003e, I discussed Dr. John Ioannidis and his supposed “biggest mistake”. He \u003ca href=\"https://www.youtube.com/watch?t=473\u0026amp;v=ZmErXFRKAOo\u0026amp;feature=youtu.be\"\u003esaid\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eSo I think that science is about mistakes, it’s about making mistakes, but trying to realize them and compare them with what might be better evidence and hopefully correct them as quickly as possible. And I think my biggest mistake, and I think that others can probably think about their mistakes, is that I underestimated how much power politics and media and powers outside of science, could have on science. I think that I had no clue and no preparation for this invasion of science.  \u003c/p\u003e\n\n\n\n\u003cp\u003eI think that war on science, science surrendered immediately and the whole country of science was torn apart among people with very different ideologies and partisan beliefs with strong opinions, with power struggles, with the thirst for power and dominance and conflicts and that’s something that I have not witnessed before and I was not prepared for that and I think that I did my best, but I was close to ridiculously poorly prepared for that.\u003c/p\u003e\n\n\n\n\u003cp\u003eI think my preparation had been for debates with other scientists with a few scientists who might be knowledgeable in the field or are interested, and sometimes very interested and are fighting for the truth, which is of course evasive for all of us, but I was not prepared to have to fight with all of these powers that had nothing to do with science. That’s something that I feel a complete idiot about.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWhile I don’t think this was Dr. Ioannidis’ biggest mistake, I basically said the same thing in my article \u003ca href=\"https://sciencebasedmedicine.org/mymistake/\" title=\"\"\u003eI Confess My Sins: I Was Too Slow and Timid to Call Out Propaganda For What It Is\u003c/a\u003e. I have been following cranks like RFK Jr. for many years, and I greatly underestimated their threat. Not only is RFK Jr. is taking a wrecking ball to everything, as the video below shows, he is also plagiarizing misinformation spread by Dr. Ioannidis in 2020, absurdly claiming that COVID wasn’t to blame for the deaths of people with underlying conditions. Everything that’s happening now is just a continuation of a process that began in \u003ca href=\"https://sciencebasedmedicine.org/10000-deaths/\"\u003eMarch 2020\u003c/a\u003e, when the misinformation started.  \u003c/p\u003e\n\n\n\n\u003cp\u003eThe only thing that’s changed is that the doctors who spread the misinformation are now in charge.  They are now the Medical Establishment and they own everything that’s happening right now.  Their harm will reverberate for decades.  Currently, things seem to be going very poorly for them and everyone around them.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"John Ioannidis 2020 = RFK Jr  2025\" width=\"900\" height=\"675\" src=\"https://www.youtube.com/embed/DSt0UcCs_kU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eI discussed this and many similar myths spread by Dr. Ioannidis \u003ca href=\"https://sciencebasedmedicine.org/what-exactly-did-the-virus-do-to-all-these-people-reflections-on-ted-nugent-mel-q-kelly-brogan-and-john-ioannidis/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2\u003e\u003cem\u003eBMJ\u003c/em\u003e had a strong bias in favour of authors advocating an aggressive approach to COVID-19 mitigation. \u003c/h2\u003e\n\n\n\n\u003cp\u003eWe at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e have been agree that there has been a war on science and we have been crystal clear about about who is attacking it. Dr. Gorski wrote about this Monday in his article \u003ca href=\"https://sciencebasedmedicine.org/how-bad-is-it-rfk-jr-s-extinction-level-threat-to-science-based-federal-health-policy-and-public-health-is-here/\"\u003eHow Bad Is It? RFK Jr.’s Extinction-Level Threat to Science-Based Federal Health Policy and Public Health is Here\u003c/a\u003e and my article \u003ca href=\"https://sciencebasedmedicine.org/ownitpart2/\"\u003eDoctors Who Fluffed RFK Jr.: Here’s What You Own So Far\u003c/a\u003e, contained a long list of horrific articles about the state of science and medicine in the U.S. today. We may be wrong- though our articles remain unrefuted- however we at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e staked out an unambiguous position in this “war on science.” Their is no doubt about where we stand and whom we blame. \u003c/p\u003e\n\n\n\n\u003cp\u003eOf course, none of this is any secret. In fact, it’s all over the news. It’s impossible to miss. \u003c/p\u003e\n\n\n\n\u003cp\u003eDespite this, Dr. Ioannidis has only uttered bland platitudes about the “war on science” while remaining mostly silent about the battles and warriors. His publication record provides a clue as to whom he believes the aggressors to be- his critics. His article \u003ca href=\"https://onlinelibrary.wiley.com/doi/abs/10.1111/eci.13839\"\u003eConstructive and Obsessive Criticism in Science\u003c/a\u003e written with pro-RFK Jr. \u003ca href=\"https://sciencebasedmedicine.org/notsatire/\"\u003epropagandist\u003c/a\u003e Dr. Vinay Prasad, lamented harassment and scientific bullying with “ad hominem aspects” saying:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eTypical behaviors include: repetitive and persistent comments (including sealioning), lengthy commentaries/tweetorials/responses often longer than the original work, strong degree of moralizing, distortion of the underlying work, argumentum ad populum, calls to suspend/censor/retract the work of the author, guilt by association, reputational tarnishing, large gains in followers specifically through attacks, finding and positing sensitive personal information, anonymity or pseudonymity, social media campaigning, and unusual ratio of criticism to pursuit of one’s research agenda.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eWho specifically is guilty of this behavior? Dr. Ioannidis did not say, though his co-author Dr. Prasad routinely launched \u003ca href=\"https://www.youtube.com/watch?v=a8lQpGikZWo\"\u003ejuvenile, vulgar\u003c/a\u003e personal attacks, \u003ca href=\"https://www.panaccindex.info/p/the-list-95-organizations-institutions\"\u003ecompiled here\u003c/a\u003e by Pandemic Accountablity Index. To my knowledge, Dr. Ioannidis has never complained about Dr. Prasad’s \u003ca href=\"https://www.youtube.com/watch?v=_HZDNG9gO1Q\"\u003eimmature profanity\u003c/a\u003e or his calls for \u003ca href=\"https://x.com/VPrasadMDMPH/status/1854632448195543452\"\u003emass purges\u003c/a\u003e of scientists. Dr. Ioannidis was also willing to found a new “\u003ca href=\"https://sciencebasedmedicine.org/misinformation-doctors-start-a-misinformation-journal-to-spread-misinformation/\"\u003ejournal\u003c/a\u003e” with Dr. Martin Kulldorff, who sent out a \u003ca href=\"https://sciencebasedmedicine.org/fired/\"\u003eguillotine Tweet\u003c/a\u003e along with an article written by a \u003ca href=\"https://sciencebasedmedicine.org/child-labor-advocates/\"\u003echild-labor advocate\u003c/a\u003e. This was not a bridge too far for Dr. Ioannidis. He did not mind that Dr. Jay Bhattacharya \u003ca href=\"https://www.youtube.com/watch?v=BnwTZocNbOY\"\u003ecampaigned for anti-vaxx crank RFK Jr\u003c/a\u003e or that he made \u003ca href=\"https://www.businessinsider.com/jay-bhattacharya-x-content-creator-national-institute-health-2025-2\"\u003enearly $12,000 posting\u003c/a\u003e on Twitter, giving him a financial incentive to keep his audience engaged and inflamed. He said nothing when \u003ca href=\"https://www.youtube.com/watch?v=ua638tFwl4Y\u0026amp;t=3s\"\u003eDr. Marty Makary endorsed\u003c/a\u003e RFK Jr.’s most vile lies about vaccines. That was not a deal-breaker for Dr. Ioannidis. None of this was part of the “war on science,” apparently.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis is not to say Dr. Ioannidis didn’t have his pandemic villains. Last month, Dr. Ioannidis published an article titled \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/40032597/\" title=\"\"\u003eCOVID-19 Advocacy Bias in the \u003cem\u003eBMJ\u003c/em\u003e: Meta-Research Evaluation\u003c/a\u003e, which concluded that:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003eBMJ\u003c/em\u003e had a strong bias in favour of authors advocating an aggressive approach to COVID-19 mitigation. Advocacy bias may influence public opinion and policy decisions and should be mitigated in future health crises in favour of open and balanced debate of different policy options.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIn \u003cem\u003ethis\u003c/em\u003e moment, with all that’s happening, that is the hill he is willing to die on. This seems to be this the “war on science” that Dr. Ioannidis had in mind. I got my start here debunking \u003ca href=\"https://sciencebasedmedicine.org/covid-19-vaccine-children-under-an-emergency-use-authorization/\" title=\"\"\u003eanti-vaccine balderdash\u003c/a\u003e from the BMJ. Should the BMJ have published more of it? Did the BMJ owe space to Dr. Ioannidis simply because of who he is? Is Dr. Ioannidis a causality in the “war on science?”\u003c/p\u003e\n\n\n\n\u003cp\u003eFor the most part, I don’t think so. Dr. Ioannidis reported that he received threats, which is of course abhorrent and completely unacceptable. However, he’s healthy and employed, thankfully, and any dents to his reputation are his own doing. He didn’t have to that \u003ca href=\"https://sciencebasedmedicine.org/10000-deaths/\"\u003eclaim the flu would be worse than COVID and that it would kill 40,000 Americans\u003c/a\u003e. No one forced him to repeatedly minimize COVID on \u003ca href=\"https://www.washingtonpost.com/dc-md-va/2020/12/16/john-ioannidis-coronavirus-lockdowns-fox-news/\"\u003eFox News\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, when discussing the “war on science”, I can’t recall Dr. Ioannidis ever lamenting the tragedy of \u003ca href=\"https://www.news10.com/news/florida-dad-regrets-not-getting-covid-vaccine-after-daughter-15-dies/\" title=\"\"\u003eyoung people\u003c/a\u003e who died due to \u003ca href=\"https://sciencebasedmedicine.org/is-subclinical-myocarditis-worse-than-death/\"\u003eanti-vaccine misinformation\u003c/a\u003e spread by doctors he’s collaborated with. I’ve not seen seen him bemoan the attacks on universities, the mass purges, or the chaos and dysfunction at the FDA and NIH. Given our mutual concern about this “war on science,” I’d be curious to hear Dr. Ioannidis’ thoughts on these headlines and the men responsible for them. As far as I know, he’s said nothing.  If there are examples, let me know in the comments and I will add them to this article.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"950\" height=\"662\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9.png\" alt=\"A collage of news headlines about U.S. health agencies: Left, NIH faces leadership resignations and layoffs; top right, FDA called “finished” as leaders are fired and drug stocks fall; bottom right, a man speaks at a congressional hearing.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9.png 950w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9-480x334.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9-200x139.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9-768x535.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-9-650x453.png 650w\" sizes=\"(max-width: 950px) 100vw, 950px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eRead these articles \u003ca href=\"https://www.nature.com/articles/d41586-025-01016-z\"\u003ehere \u003c/a\u003eand \u003ca href=\"https://www.barrons.com/articles/fda-hhs-firings-peter-stein-healthcare-stocks-05c129c7\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eInstead of recognizing this sad reality, Dr. Ioannidis continues to vaguely worry about “science becoming a political battleground” as if that is something that might happen one day if we are not careful. “That’s not going to help anyone. The winners and the losers, they’re both going to be losers,” he added in a recent speech.  In the video below he warns about “the wrong way to go”, implying that things are OK now. Dr. Ioannidis is trying to warn us about a potential dark future in a very serious and sober way, but he’s got nothing to say about the present. In the same way headlines of mass morgues didn’t impress him 5 years ago, headlines about mass purges don’t seem to bother him today.  One wonders what would have to happen for him to care more about actual disasters than theoretical threats.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Dr. John Ioannidis, who appeared on Fox News many times, worries about science becoming political\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/SENBN6sflHk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eWell, I have bad news for Dr. Ioannidis. We weren’t careful, science became a political battleground, and the headlines leave no doubt as to whom is responsible. Widespread indifference to misinformation spread by doctors for the past 5 years directly led us to this moment. The same doctors who relentlessly spread fake COVID nonsense, are today pictured in articles about “purges” and “firings.”\u003c/p\u003e\n\n\n\n\u003cp\u003eI suspect that if Dr. Ioannidis were to acknowledge this, he’d be forced to confront the uncomfortable fact that he \u003ca href=\"https://sciencebasedmedicine.org/misinformation-doctors-start-a-misinformation-journal-to-spread-misinformation/\"\u003epartnered with\u003c/a\u003e these doctors, \u003ca href=\"https://www.youtube.com/watch?v=dJgDWFKqnM8\" title=\"\"\u003elegitimized them\u003c/a\u003e, and shared their pandemic vision. He overlooked everything they did. When science was under attack, he played the role of enabler. Along with his copious COVID misinformation, that will be his legacy.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe’s right about some things though- science is the \u003ca href=\"https://x.com/ZNeveri/status/1316826156906221574/video/1\"\u003ebest thing that has happened to humans\u003c/a\u003e, and when it becomes a political battleground, there are only losers.  All this is happening right now.  Just read a newspaper.\u003c/p\u003e\n\n\n\n\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                                                                                                    Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                                                                                                \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#355f5a5b54415d545b1b5d5a42544751755b4c4059545b525a5b501b5a4752\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                            \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-04-17T03:04:00-04:00",
  "modifiedTime": "2025-04-17T15:23:23Z"
}
