{
  "id": "e96a3c66-5eb4-463c-84ec-39c7d353287f",
  "title": "Gaps in our knowledge of ancient Rome could be filled by AI",
  "link": "https://www.bbc.com/news/articles/c04dwqr5lkvo",
  "description": "A new system fills in missing words from ancient inscriptions carved on monuments and everyday objects.",
  "author": "",
  "published": "Wed, 23 Jul 2025 15:01:11 GMT",
  "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
  "categories": null,
  "byline": "Pallab Ghosh",
  "length": 5211,
  "excerpt": "A new system fills in missing words from ancient inscriptions carved on monuments and everyday objects.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/apple-touch-icon.png",
  "text": "Gaps in our knowledge of ancient Rome could be filled by AIThe Metropolitan Museum of ArtArtwork: The new system predicts missing text from broken inscriptions, their date and original locationA new AI tool has the potential to turbocharge our understanding of all human history, researchers say.Artificial intelligence has already been used to fill in gaps in ancient Roman scrolls, but a new system goes much further.It can fill in missing words from ancient Roman inscriptions carved on monuments and everyday objects, as well as dating and placing them geographically.AI often introduces errors in its analysis of even simple modern texts, so there are concerns that relying too much on this technology might distort rather than enhance our understanding of history.But historian Prof Dame Mary Beard of Cambridge University has described the technology as potentially \"transformative\" to our study of past events.She said that the system, called Aeneas, after a Greek and Roman mythological figure, could accelerate the rate at which historians piece together the past from ancient texts.\"Breakthroughs in this very difficult field have tended to rely on the memory, the subjective judgement and the hunch/guesswork of individual scholars, supported by traditional, encyclopaedic databases. Aeneas opens up entirely new horizons.\"AtilimGunesBaydinInscriptions are found on ancient monuments across the globe. This one at the Temple of Augustus in Ankara in Turkey is known as the queen of inscriptionsAncient inscriptions are usually incomplete, of unknown origin and date, and often all three. Historians and classicists attempt to fill in the blanks by drawing on texts that are similar in wording, grammar, appearance and cultural setting, known as 'parallels'. Ancient inscriptions tend to be formulaic so historians can often infer what the missing part of a sentence goes on to say.The process is painstaking and can take months and years but opens new vistas in our understanding of the past, according to Dr Thea Sommerschield, an historian at Nottingham University, who co-led the research.\"Inscriptions are the earliest forms of writing. They are so precious to historians because they offer first-hand evidence for ancient histories, languages and societies.\"But they degrade over the centuries and interpreting them is like solving a gigantic jigsaw puzzle with tens of thousands of pieces, of which 90 per cent are lost.\"Thea SommerschieldA Roman bronze military diploma dates 94 CE. Like most inscriptions it is incompleteIt's not the first time AI has been used to join up the missing dots in Roman history.Earlier this year, another team of scientists digitally \"unwrapped\" a badly burnt scroll from the Roman town of Herculaneum using a combination of X-ray imaging and AI, revealing rows and columns of text.Dr Sommerschield developed Aeneas along with her co-research leader Dr Yannis Assael, an AI specialist at Google DeepMind. It automates the process of contextualising based on parallels, in the blink of an eye. Aeneas draws on a vast database of of 176,000 Roman inscriptions including images and uses a carefully designed AI system to pull up a range of relevant historical parallels, to support the work of historians, according to Dr Assael.\"What the historian can't do is assess these parallels in a matter of seconds across tens of thousands of inscriptions, and that is where AI can come in as an assistant.\"The team tested out the system in dating a famous Roman text at the Temple of Augustus in Ankara in Turkey, known as the queen of inscriptions because of its importance to our understanding of Roman history. The Res Gestae Divi Augusti was composed by the first Roman Emperor, Augustus, giving an account of his life and accomplishments. Its date is hotly contested among historians.Aeneas was able to narrow down the options to two possible ranges, the most likely being between 10 and 20 CE and a second slightly less likely range from 10 to 1 BCE. This showed the system's accuracy as most historians agree on these two as the most likely possibilities.Google DeepmindArtwork: An earlier version of the system filled in missing words in ancient Greek. Aeneas is much more powerfulIn tests of the system with 23 historians the team found that an historian working with Aeneas came up with more accurate results than either Aeneas on its own or an historian on their own. \"The feedback was that Aeneas was not only allowing the historians to accelerate their work but it also revealed parallels that they had previously not identified,\" according to Dr Sommerschield.\"And that is the future value of this work, not just to do what we do faster and better but also to do things we didn't think to do before.\"AI interpretation of even modern texts can be glitchy, so there is concern that mistakes could be made. But according to Dr Assael, Aeneas is a tool to guide historians, not a replacement for them.\"We acknowledge that AI might not be able to get everything right all the time and I don't think historians will work under that expectation,\" he said.He said it would be down to human historians to weigh up Aeneas' predictions and decide which made more sense.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/728f/live/752125d0-67ba-11f0-8dbd-f3d32ebd3327.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"headline-block\"\u003e\u003ch2\u003eGaps in our knowledge of ancient Rome could be filled by AI\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9504/live/8eaa6660-6797-11f0-8dbd-f3d32ebd3327.jpg.webp\" loading=\"lazy\" alt=\"Pallab Ghosh profile image\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/08e9/live/c634d840-6797-11f0-89ea-4d6f9851f623.png.webp\" loading=\"eager\" alt=\"The Metropolitan Museum of Art This is an image of a rectagular bronze inscription which has been broken in half. The text on the right hand side is missing but has been shown as restored by AI with its predicted text\"/\u003e\u003cspan\u003eThe Metropolitan Museum of Art\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eArtwork: The new system predicts missing text from broken inscriptions, their date and original location\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA new AI tool has the potential to turbocharge our understanding of all human history, researchers say.\u003c/p\u003e\u003cp\u003eArtificial intelligence has already been used to fill in gaps in ancient Roman scrolls, but a new system goes much further.\u003c/p\u003e\u003cp\u003eIt can fill in missing words from ancient Roman inscriptions carved on monuments and everyday objects, as well as dating and placing them geographically.\u003c/p\u003e\u003cp\u003eAI often introduces errors in its analysis of even simple modern texts, so there are concerns that relying too much on this technology might distort rather than enhance our understanding of history.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBut historian Prof Dame Mary Beard of Cambridge University has described the technology as potentially \u0026#34;transformative\u0026#34; to our study of past events.\u003c/p\u003e\u003cp\u003eShe said that the system, called Aeneas, after a Greek and Roman mythological figure, could accelerate the rate at which historians piece together the past from ancient texts.\u003c/p\u003e\u003cp\u003e\u0026#34;Breakthroughs in this very difficult field have tended to rely on the memory, the subjective judgement and the hunch/guesswork of individual scholars, supported by traditional, encyclopaedic databases. Aeneas opens up entirely new horizons.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ef74/live/daedf350-6799-11f0-89ea-4d6f9851f623.jpg.webp\" loading=\"lazy\" alt=\"AtilimGunesBaydin A large white stone monument which used to be a rectangular temple but has only one complete wall withthe other three broken \"/\u003e\u003cspan\u003eAtilimGunesBaydin\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eInscriptions are found on ancient monuments across the globe. This one at the Temple of Augustus in Ankara in Turkey is known as the queen of inscriptions\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAncient inscriptions are usually incomplete, of unknown origin and date, and often all three. Historians and classicists attempt to fill in the blanks by drawing on texts that are similar in wording, grammar, appearance and cultural setting, known as \u0026#39;parallels\u0026#39;. Ancient inscriptions tend to be formulaic so historians can often infer what the missing part of a sentence goes on to say.\u003c/p\u003e\u003cp\u003eThe process is painstaking and can take months and years but opens new vistas in our understanding of the past, according to Dr Thea Sommerschield, an historian at Nottingham University, who co-led the research.\u003c/p\u003e\u003cp\u003e\u0026#34;Inscriptions are the earliest forms of writing. They are so precious to historians because they offer first-hand evidence for ancient histories, languages and societies.\u003c/p\u003e\u003cp\u003e\u0026#34;But they degrade over the centuries and interpreting them is like solving a gigantic jigsaw puzzle with tens of thousands of pieces, of which 90 per cent are lost.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1f32/live/6a1cf4c0-67a6-11f0-8979-21e9e3d3b0da.jpg.webp\" loading=\"lazy\" alt=\"Thea Sommerschield A square stone coloured plaque with a big chunk on its right hand side missing\"/\u003e\u003cspan\u003eThea Sommerschield\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eA Roman bronze military diploma dates 94 CE. Like most inscriptions it is incomplete\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt\u0026#39;s not the first time AI has been used to join up the missing dots in Roman history.\u003c/p\u003e\u003cp\u003eEarlier this year, another team of scientists \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c5yvrq7dyg6o\"\u003edigitally \u0026#34;unwrapped\u0026#34; a badly burnt scroll\u003c/a\u003e from the Roman town of Herculaneum using a combination of X-ray imaging and AI, revealing rows and columns of text.\u003c/p\u003e\u003cp\u003eDr Sommerschield developed Aeneas along with her co-research leader Dr Yannis Assael, an AI specialist at Google DeepMind. It automates the process of contextualising based on parallels, in the blink of an eye. \u003c/p\u003e\u003cp\u003eAeneas draws on a vast database of of 176,000 Roman inscriptions including images and uses a carefully designed AI system to pull up a range of relevant historical parallels, to support the work of historians, according to Dr Assael.\u003c/p\u003e\u003cp\u003e\u0026#34;What the historian can\u0026#39;t do is assess these parallels in a matter of seconds across tens of thousands of inscriptions, and that is where AI can come in as an assistant.\u0026#34;\u003c/p\u003e\u003cp\u003eThe team tested out the system in dating a famous Roman text at the Temple of Augustus in Ankara in Turkey, known as the queen of inscriptions because of its importance to our understanding of Roman history. The \u003ci id=\"res-gestae-divi-augusti\"\u003eRes Gestae Divi Augusti\u003c/i\u003e was composed by the first Roman Emperor, Augustus, giving an account of his life and accomplishments. Its date is hotly contested among historians.\u003c/p\u003e\u003cp\u003eAeneas was able to narrow down the options to two possible ranges, the most likely being between 10 and 20 CE and a second slightly less likely range from 10 to 1 BCE. This showed the system\u0026#39;s accuracy as most historians agree on these two as the most likely possibilities.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250711-084946-a521911844-web-2.25.0-9/grey-placeholder.png\" aria-label=\"image unavailable\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3f14/live/5178c660-67b0-11f0-89ea-4d6f9851f623.png.webp\" loading=\"lazy\" alt=\"Google Deepmind Ancient Greek inscription with neon blue numbers imprinted on to illustrate the application of AI\"/\u003e\u003cspan\u003eGoogle Deepmind\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eArtwork: An earlier version of the system filled in missing words in ancient Greek. Aeneas is much more powerful\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn tests of the system with 23 historians the team found that an historian working with Aeneas came up with more accurate results than either Aeneas on its own or an historian on their own. \u003c/p\u003e\u003cp\u003e\u0026#34;The feedback was that Aeneas was not only allowing the historians to accelerate their work but it also revealed parallels that they had previously not identified,\u0026#34; according to Dr Sommerschield.\u003c/p\u003e\u003cp\u003e\u0026#34;And that is the future value of this work, not just to do what we do faster and better but also to do things we didn\u0026#39;t think to do before.\u0026#34;\u003c/p\u003e\u003cp\u003eAI interpretation of even modern texts can be glitchy, so there is concern that mistakes could be made. But according to Dr Assael, Aeneas is a tool to guide historians, not a replacement for them.\u003c/p\u003e\u003cp\u003e\u0026#34;We acknowledge that AI might not be able to get everything right all the time and I don\u0026#39;t think historians will work under that expectation,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eHe said it would be down to human historians to weigh up Aeneas\u0026#39; predictions and decide which made more sense.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-23T15:01:11.375Z",
  "modifiedTime": "2025-07-23T15:01:11.375Z"
}
