{
  "id": "ecdd0fb6-d8a8-4257-92ed-20243b7e0694",
  "title": "Scientists just mapped how the body rejects pig organs—and how to stop it",
  "link": "https://www.sciencedaily.com/releases/2025/06/250630073445.htm",
  "description": "Scientists have achieved an unprecedented look into how the human immune system attacks a transplanted pig kidney, using spatial molecular imaging to map immune activity down to the cellular level. They discovered early signs of rejection within 10 days and pinpointed key immune players—like macrophages—driving the response. Even more exciting: when targeted therapies were applied, the immune assault weakened. As U.S. clinical trials of pig kidney transplants begin, this breakthrough offers hope for overcoming the immune barrier that has long stood in the way of xenotransplantation.",
  "author": "",
  "published": "Tue, 01 Jul 2025 01:10:42 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4376,
  "excerpt": "Scientists have achieved an unprecedented look into how the human immune system attacks a transplanted pig kidney, using spatial molecular imaging to map immune activity down to the cellular level. They discovered early signs of rejection within 10 days and pinpointed key immune players—like macrophages—driving the response. Even more exciting: when targeted therapies were applied, the immune assault weakened. As U.S. clinical trials of pig kidney transplants begin, this breakthrough offers hope for overcoming the immune barrier that has long stood in the way of xenotransplantation.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A pioneering study has provided unprecedented insights into the immune response following pig-to-human kidney xenotransplantation.1 The findings, presented today at the ESOT Congress 2025, mark a significant step forward in overcoming the biggest challenge in xenotransplantation: rejection by the human immune system. Using cutting-edge spatial molecular imaging, researchers mapped how human immune cells interact with pig kidney tissue in transplanted organs, revealing critical early markers of rejection and potential intervention strategies. The study, led by Dr. Valentin Goutaudier and a collaborative international research team (Paris Institute for Transplantation and Organ Regeneration \u0026 NYU Langone Transplant Institute), highlights key molecular mechanisms that could shape the future of xenotransplantation. One of the most striking discoveries was that human immune cells were found in every part of the pig kidney's filtering system after the transplant. Researchers observed early molecular signs of antibody-mediated rejection as soon as Day 10 and peaking at Day 33, reinforcing previous findings that rejection begins rapidly but progresses over time.2 By tracking these immune responses for up to 61 days, the team identified a crucial window for targeted therapeutic intervention. \"Our study provides the most detailed molecular map to date of how the human immune system engages with a transplanted pig kidney,\" explained Dr. Goutaudier. \"By pinpointing specific immune cell behaviours and gene expressions, we can refine anti-rejection treatments and improve transplant viability.\" The study's innovative approach used a bioinformatic pipeline to distinguish human immune cells from pig structural cells, allowing for precise mapping of immune infiltration patterns. Notably, macrophages and myeloid cells were the most prevalent immune cell types across all time points, further confirming their role as key mediators in xenograft rejection. When targeted therapeutic interventions were introduced, immune-mediated signs of rejection were successfully weakened. Combined with novel spatial insights into how immune cells interact with pig kidney tissue, this marks a major breakthrough -- paving the way for more refined anti-rejection strategies. These advances come at a pivotal time as the first US-based clinical trials of pig kidney transplantation into living human recipients begin in 2025. With xenotransplantation poised to address the global organ shortage crisis, these findings bring researchers one step closer to making genetically modified pig kidneys a viable long-term solution. The next phase will focus on optimising anti-rejection treatments, refining genetic modifications in donor pigs, and developing early detection protocols to monitor and manage rejection responses. \"Understanding the specific immune interactions at a molecular level allows us to develop targeted interventions that can prevent rejection before it escalates,\" explained Dr. Goutaudier. \"This research lays the groundwork for safer and more effective pig-to-human transplants in the near future.\" As scientific progress accelerates, researchers remain cautiously optimistic that genetically modified pig kidneys could become a routine transplant option within the next decade. However, regulatory approvals will require consistent demonstration of safety and efficacy in diverse patient populations. References: Goutaudier V., Williams, C., Morgand, E., et al. Application of a Novel Spatial Transcriptomic 6000-Plex Panel in Pig-to-Human Xenotransplantation. Presented at ESOT Congress 2025; 30th June 2025; London, United Kingdom. Loupy, A., Goutaudier, V., Giarraputo, A. et al. (2023). Immune response after pig-to-human kidney xenotransplantation: A multimodal phenotyping study.The Lancet, 402(10408), 1158-1169. https://doi.org/10.1016/S0140-6736(23)01855-3 Montgomery RA, Stern JM, Lonze BE, Tatapudi VS, Mangiola M, Wu M, Weldon E, Lawson N, Deterville C, Dieter RA, Sullivan B, Boulton G, Parent B, Piper G, Sommer P, Cawthon S, Duggan E, Ayares D, Dandro A, Fazio-Kroll A, Kokkinaki M, Burdorf L, Lorber M, Boeke JD, Pass H, Keating B, Griesemer A, Ali NM, Mehta SA, Stewart ZA. Results of Two Cases of Pig-to-Human Kidney Xenotransplantation. N Engl J Med. 2022 May 19;386(20):1889-1898. doi: 10.1056/NEJMoa2120238. PMID: 35584156.",
  "image": "https://www.sciencedaily.com/images/1920/pig-kidney-transplant.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003e\u003cstrong\u003eA pioneering study has provided unprecedented insights into the immune response following pig-to-human kidney xenotransplantation.\u003csup\u003e1\u003c/sup\u003e \u003c/strong\u003e\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe findings, presented today at the ESOT Congress 2025, mark a significant step forward in overcoming the biggest challenge in xenotransplantation: rejection by the human immune system.\u003c/p\u003e\n\u003cp\u003eUsing cutting-edge spatial molecular imaging, researchers mapped how human immune cells interact with pig kidney tissue in transplanted organs, revealing critical early markers of rejection and potential intervention strategies. The study, led by Dr. Valentin Goutaudier and a collaborative international research team (Paris Institute for Transplantation and Organ Regeneration \u0026amp; NYU Langone Transplant Institute), highlights key molecular mechanisms that could shape the future of xenotransplantation.\u003c/p\u003e\n\u003cp\u003eOne of the most striking discoveries was that human immune cells were found in every part of the pig kidney\u0026#39;s filtering system after the transplant. Researchers observed early molecular signs of antibody-mediated rejection as soon as Day 10 and peaking at Day 33, reinforcing previous findings that rejection begins rapidly but progresses over time.\u003csup\u003e2\u003c/sup\u003e By tracking these immune responses for up to 61 days, the team identified a crucial window for targeted therapeutic intervention.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our study provides the most detailed molecular map to date of how the human immune system engages with a transplanted pig kidney,\u0026#34; explained Dr. Goutaudier. \u0026#34;By pinpointing specific immune cell behaviours and gene expressions, we can refine anti-rejection treatments and improve transplant viability.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe study\u0026#39;s innovative approach used a bioinformatic pipeline to distinguish human immune cells from pig structural cells, allowing for precise mapping of immune infiltration patterns. Notably, macrophages and myeloid cells were the most prevalent immune cell types across all time points, further confirming their role as key mediators in xenograft rejection.\u003c/p\u003e\n\u003cp\u003eWhen targeted therapeutic interventions were introduced, immune-mediated signs of rejection were successfully weakened. Combined with novel spatial insights into how immune cells interact with pig kidney tissue, this marks a major breakthrough -- paving the way for more refined anti-rejection strategies. These advances come at a pivotal time as the first US-based clinical trials of pig kidney transplantation into living human recipients begin in 2025.\u003c/p\u003e\n\n\n\u003cp\u003eWith xenotransplantation poised to address the global organ shortage crisis, these findings bring researchers one step closer to making genetically modified pig kidneys a viable long-term solution. The next phase will focus on optimising anti-rejection treatments, refining genetic modifications in donor pigs, and developing early detection protocols to monitor and manage rejection responses.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Understanding the specific immune interactions at a molecular level allows us to develop targeted interventions that can prevent rejection before it escalates,\u0026#34; explained Dr. Goutaudier. \u0026#34;This research lays the groundwork for safer and more effective pig-to-human transplants in the near future.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAs scientific progress accelerates, researchers remain cautiously optimistic that genetically modified pig kidneys could become a routine transplant option within the next decade. However, regulatory approvals will require consistent demonstration of safety and efficacy in diverse patient populations.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReferences: \u003c/strong\u003e\u003c/p\u003e\u003col\u003e    \u003cli\u003eGoutaudier V., Williams, C., Morgand, E., et al. \u003cem\u003eApplication of a Novel Spatial Transcriptomic 6000-Plex Panel in Pig-to-Human Xenotransplantation\u003c/em\u003e. Presented at ESOT Congress 2025; 30\u003csup\u003eth\u003c/sup\u003e June 2025; London, United Kingdom.\u003c/li\u003e    \u003cli\u003eLoupy, A., Goutaudier, V., Giarraputo, A. et al. (2023).\u003cem\u003e Immune response after pig-to-human kidney xenotransplantation: A multimodal phenotyping study\u003c/em\u003e.The Lancet, 402(10408), 1158-1169. \u003ca href=\"https://doi.org/10.1016/S0140-6736(23)01855-3\"\u003ehttps://doi.org/10.1016/S0140-6736(23)01855-3\u003c/a\u003e\u003c/li\u003e    \u003cli\u003eMontgomery RA, Stern JM, Lonze BE, Tatapudi VS, Mangiola M, Wu M, Weldon E, Lawson N, Deterville C, Dieter RA, Sullivan B, Boulton G, Parent B, Piper G, Sommer P, Cawthon S, Duggan E, Ayares D, Dandro A, Fazio-Kroll A, Kokkinaki M, Burdorf L, Lorber M, Boeke JD, Pass H, Keating B, Griesemer A, Ali NM, Mehta SA, Stewart ZA. \u003cem\u003eResults of Two Cases of Pig-to-Human Kidney Xenotransplantation\u003c/em\u003e. N Engl J Med. 2022 May 19;386(20):1889-1898. doi: 10.1056/NEJMoa2120238. PMID: 35584156.\u003c/li\u003e\u003c/ol\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
