{
  "id": "edd1abc1-d1b5-4f85-a77d-c824035b7ac1",
  "title": "Data-driven story on the first vaccine",
  "link": "https://flowingdata.com/2025/05/30/data-driven-story-on-the-first-vaccine/",
  "description": "As we enter a time when people question the usefulness of vaccines, even…Tags: documentary, Neil Halloran, smallpox, vaccine, video",
  "author": "Nathan Yau",
  "published": "Fri, 30 May 2025 10:03:10 +0000",
  "source": "https://flowingdata.com/feed",
  "categories": [
    "Infographics",
    "documentary",
    "Neil Halloran",
    "smallpox",
    "vaccine",
    "video"
  ],
  "byline": "Nathan Yau",
  "length": 668,
  "excerpt": "As we enter a time when people question the usefulness of vaccines, even though there are clear benefits, Neil Halloran revisits a time when vaccines did not exist. With a mix of charts, informatio…",
  "siteName": "FlowingData",
  "favicon": "https://flowingdata.com/wp-content/uploads/2025/01/logo-lone-square512x512-210x210.png",
  "text": "As we enter a time when people question the usefulness of vaccines, even though there are clear benefits, Neil Halloran revisits a time when vaccines did not exist. With a mix of charts, information graphics, and photographs, Halloran tells the story of the smallpox vaccine. High mortality rate and hundreds of millions dead transformed to zero. The Plinko imagery at the beginning is really affecting. I also appreciate the trip on the timeline to show the slow but steady progress over a span of decades. It is shocking to me that anyone would refuse proven vaccines for themselves and their family when the data shows results with little ambiguity. (Thanks, Zan)",
  "image": "https://flowingdata.com/wp-content/uploads/2025/05/vaccine-halloran.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                \n        \n        \u003cp\u003eAs we enter a time when people question the usefulness of vaccines, even though there are \u003ca href=\"https://flowingdata.com/2015/02/19/impact-of-vaccines-throughout-history/\"\u003eclear benefits\u003c/a\u003e, Neil Halloran revisits a time when vaccines did not exist. With a mix of charts, information graphics, and photographs, Halloran tells the story of the smallpox vaccine. High mortality rate and hundreds of millions dead transformed to zero.\u003cbr/\u003e\n\u003cspan id=\"more-78687\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003eThe Plinko imagery at the beginning is really affecting. I also appreciate the trip on the timeline to show the slow but steady progress over a span of decades.\u003c/p\u003e\n\u003cp\u003eIt is shocking to me that anyone would refuse proven vaccines for themselves and their family when the data shows results with little ambiguity. (Thanks, \u003ca href=\"https://www.zanarmstrong.com\"\u003eZan\u003c/a\u003e)\u003c/p\u003e\n    \n\t\n        \n\t\t\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2025-05-30T10:03:10Z",
  "modifiedTime": "2025-05-28T06:22:17Z"
}
