{
  "id": "ef5ee491-c70b-4d3b-989d-a76409f28586",
  "title": "Wealth tax linked to increased savings, study finds",
  "link": "https://phys.org/news/2025-01-wealth-tax-linked.html",
  "description": "With Uncle Sam running chronic trillion-dollar deficits, one proposal to increase revenue has been to raise it from the wealthiest Americans: through a tax, not on their yearly income, but on their accumulated wealth.",
  "author": "",
  "published": "Tue, 14 Jan 2025 17:00:03 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Economics \u0026 Business Political science"
  ],
  "byline": "Hope Reese",
  "length": 4137,
  "excerpt": "With Uncle Sam running chronic trillion-dollar deficits, one proposal to increase revenue has been to raise it from the wealthiest Americans: through a tax, not on their yearly income, but on their accumulated wealth.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Pixabay/CC0 Public Domain With Uncle Sam running chronic trillion-dollar deficits, one proposal to increase revenue has been to raise it from the wealthiest Americans: through a tax, not on their yearly income, but on their accumulated wealth. U.S. Sen. Elizabeth Warren, D-Mass., introduced one version of a wealth tax, which would tax net worth over $50 million at 2% and net worth over $1 billion at 3%. But it's never come to a vote, and critics charge it would reduce gross domestic product, partly by reducing people's incentives to save money. But new research from Texas McCombs questions whether wealth taxes reduce savings. Marius Ring, an assistant professor of finance, investigates the real-world effects of a wealth tax in Norway—one of the few countries that currently implements one. Surprisingly, the tax appears to motivate people to save more, he finds. The findings are published in the journal Review of Economic Studies. \"Wealth taxation does not seem to reduce how much people save,\" Ring says. \"Taxing someone's savings doesn't necessarily imply that they will want to save less.\" Norway levies a tax of 1% on wealth over $160,000, affecting 15% of taxpayers. Ring looked at geographic differences in how the tax was assessed from 2005 to 2015. He correlated that information with third-party data such as household savings, housing characteristics, and transaction prices. He found: For every 1 additional Norwegian Krone (NOK) paid out in wealth taxes, households increased their net savings by 3.76 NOK each year. These savings were mostly the result of working more, rather than consuming less. People work more, Ring says, because they don't want to cut back on their plans for future consumption. It's an effect economists call the income effect, because it involves greater income leading to greater consumption. \"It relates to how downward adjustment of consumption is unpleasant,\" he says. \"If I have my eyes set on a certain type of RV to buy at retirement, then I'll have to save more. It might be less painful to work more than to consume less in order to increase my savings.\" People don't necessarily work longer hours, he adds. Instead, they stay in the workforce longer and retire later. Besides boosting savings, higher wealth taxes did not affect people's portfolio allocations. People with larger tax bites set aside the same fractions of their financial wealth to invest in the stock market. Ring notes that he looked principally at the moderately wealthy: people in the 85th to 90th percentile of wealth distribution. But he doubts the ultra-rich would respond differently to a wealth tax. In fact, he argues, if they care more about adding wealth than spending it—for example, building a larger business empire—they might save even more. He emphasizes that he's not making policy recommendations for or against a wealth tax. He's simply assessing one of the arguments against it by showing that it doesn't always discourage saving. The broader implications of his findings, he says, lie in the design of an ideal tax system. Economists generally favor taxes that have fewer distortions: lesser effects on people's behavior. Ring's findings suggest that a wealth tax may be such a tax, but so might other kinds of taxes on savings, such as taxes on dividends or capital gains. \"My findings suggest that a wealth tax could fit this bill,\" he says. \"But they don't necessarily favor a wealth tax over other types of taxes on households' wealth.\" More information: Marius A K Ring, Wealth Taxation and Household Saving: Evidence from Assessment Discontinuities in Norway, Review of Economic Studies (2024). DOI: 10.1093/restud/rdae100",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/budget.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1194851\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/budget.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/budget.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/budget.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/budget.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/budget.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/budget.jpg\" width=\"800\" height=\"485\" alt=\"budget\" title=\"Credit: Pixabay/CC0 Public Domain\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pixabay/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eWith Uncle Sam running chronic trillion-dollar deficits, one proposal to increase revenue has been to raise it from the wealthiest Americans: through a tax, not on their yearly income, but on their accumulated wealth.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eU.S. Sen. Elizabeth Warren, D-Mass., introduced one version of a wealth tax, which would tax \u003ca href=\"https://phys.org/tags/net+worth/\" rel=\"tag\"\u003enet worth\u003c/a\u003e over $50 million at 2% and net worth over $1 billion at 3%. But it\u0026#39;s never come to a vote, and critics charge it would reduce \u003ca href=\"https://phys.org/tags/gross+domestic+product/\" rel=\"tag\"\u003egross domestic product\u003c/a\u003e, partly by reducing people\u0026#39;s incentives to save money.\u003c/p\u003e\n\u003cp\u003eBut new research from Texas McCombs questions whether wealth taxes reduce \u003ca href=\"https://phys.org/tags/savings/\" rel=\"tag\"\u003esavings\u003c/a\u003e. Marius Ring, an assistant professor of finance, investigates the real-world effects of a wealth tax in Norway—one of the few countries that currently implements one.\u003c/p\u003e\n\u003cp\u003eSurprisingly, the tax appears to motivate people to save more, he finds.\u003c/p\u003e\n\u003cp\u003eThe findings are \u003ca href=\"https://academic.oup.com/restud/advance-article/doi/10.1093/restud/rdae100/7822152\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eReview of Economic Studies\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Wealth taxation does not seem to reduce how much people save,\u0026#34; Ring says. \u0026#34;Taxing someone\u0026#39;s savings doesn\u0026#39;t necessarily imply that they will want to save less.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNorway levies a tax of 1% on wealth over $160,000, affecting 15% of taxpayers. Ring looked at geographic differences in how the tax was assessed from 2005 to 2015. He correlated that information with third-party data such as household savings, housing characteristics, and transaction prices. He found:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFor every 1 additional Norwegian Krone (NOK) paid out in wealth taxes, households increased their net savings by 3.76 NOK each year.\u003c/li\u003e\n\u003cli\u003eThese savings were mostly the result of working more, rather than consuming less.\u003c/li\u003e\n\u003c/ul\u003e\n\n                                                                                  \n                                                                    \u003cp\u003ePeople work more, Ring says, because they don\u0026#39;t want to cut back on their plans for future consumption. It\u0026#39;s an effect economists call the income effect, because it involves greater income leading to greater consumption.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It relates to how downward adjustment of consumption is unpleasant,\u0026#34; he says. \u0026#34;If I have my eyes set on a certain type of RV to buy at retirement, then I\u0026#39;ll have to save more. It might be less painful to work more than to consume less in order to increase my savings.\u0026#34;\u003c/p\u003e\n\u003cp\u003ePeople don\u0026#39;t necessarily work longer hours, he adds. Instead, they stay in the workforce longer and retire later.\u003c/p\u003e\n\u003cp\u003eBesides boosting savings, higher wealth taxes did not affect people\u0026#39;s portfolio allocations. People with larger tax bites set aside the same fractions of their financial wealth to invest in the stock market.\u003c/p\u003e\n\u003cp\u003eRing notes that he looked principally at the moderately wealthy: people in the 85th to 90th percentile of wealth distribution. But he doubts the ultra-rich would respond differently to a wealth tax. In fact, he argues, if they care more about adding wealth than spending it—for example, building a larger business empire—they might save even more.\u003c/p\u003e\n\u003cp\u003eHe emphasizes that he\u0026#39;s not making \u003ca href=\"https://phys.org/tags/policy+recommendations/\" rel=\"tag\"\u003epolicy recommendations\u003c/a\u003e for or against a wealth tax. He\u0026#39;s simply assessing one of the arguments against it by showing that it doesn\u0026#39;t always discourage saving.\u003c/p\u003e\n\u003cp\u003eThe broader implications of his findings, he says, lie in the design of an ideal tax system. Economists generally favor taxes that have fewer distortions: lesser effects on people\u0026#39;s behavior.\u003c/p\u003e\n\u003cp\u003eRing\u0026#39;s findings suggest that a wealth tax may be such a tax, but so might other kinds of taxes on savings, such as taxes on dividends or capital gains.\u003c/p\u003e\n\u003cp\u003e\u0026#34;My findings suggest that a wealth tax could fit this bill,\u0026#34; he says. \u0026#34;But they don\u0026#39;t necessarily favor a wealth tax over other types of taxes on households\u0026#39; wealth.\u0026#34;\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Marius A K Ring, Wealth Taxation and Household Saving: Evidence from Assessment Discontinuities in Norway, \u003ci\u003eReview of Economic Studies\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1093/restud/rdae100\" target=\"_blank\"\u003eDOI: 10.1093/restud/rdae100\u003c/a\u003e\n                            \u003c/p\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-14T17:00:03-05:00",
  "modifiedTime": null
}
