{
  "id": "ef97be9d-7782-4a8c-892d-61b146313b6b",
  "title": "Revealing the rhythms of ancient Arabia: Music connected cultures in the prehistoric Arabian Gulf",
  "link": "https://phys.org/news/2025-04-revealing-rhythms-ancient-arabia-music.html",
  "description": "Archaeologists have analyzed a pair of copper cymbals from Bronze Age Oman, suggesting a shared musical tradition connected cultures and helped facilitate trade around the Arabian Gulf.",
  "author": "",
  "published": "Mon, 07 Apr 2025 19:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Archaeology"
  ],
  "byline": "Antiquity",
  "length": 4443,
  "excerpt": "Archaeologists have analyzed a pair of copper cymbals from Bronze Age Oman, suggesting a shared musical tradition connected cultures and helped facilitate trade around the Arabian Gulf.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Copper cymbals in situ after removing part of the fill layer. They are on top of each other, perfectly aligned. Credit: Y. Al Rahbi Archaeologists have analyzed a pair of copper cymbals from Bronze Age Oman, suggesting a shared musical tradition connected cultures and helped facilitate trade around the Arabian Gulf. Music is a universal aspect of human life that is present in all societies. Whether used in religious ceremonies, cultural events or simply for entertainment, music has often acted as a force for bringing people together. However, musical instruments are often made of materials such as wood and metal, which do not commonly survive in the archaeological record. This makes it difficult to learn how music shaped prehistoric cultures. Therefore, a pair of copper alloy cymbals excavated from the third millennium BC \"Umm an-Nar\" culture site of Dahwa, Oman, is a rare and important find. \"These copper alloy cymbals are the first of their kind to have been found in good archaeological contexts in Oman and are from a particularly early context that questions some of the assumptions on their origin and development,\" says lead author of the research, Professor Khaled Douglas from Sultan Qaboos University, Oman. To investigate the origins of the cymbals, archaeologists from Sultan Qaboos University analyzed them visually and performed isotope analysis of the copper. Their results are published in the journal Antiquity. Despite being stylistically similar to examples of cymbals from the contemporary Indus Valley, isotope analysis indicates the cymbals were produced in Oman. Aerial photograph of the building in which the cymbals were found. Credit: Antiquity This suggests that production of the cymbals was influenced through contact between the Umm an-Nar culture and the Indus Valley civilization. Trade around the Arabian Gulf is well-attested during the Bronze Age. Many examples of ceramics, beads and metal objects that share similarities with those from the Indus Valley have been found in Arabia. However, these discoveries have predominantly been examined economically, and the social implications of this extensive interaction remain unclear. \"The Early Bronze Age (Umm-an-Nar period) has already shown rich evidence of interregional contact,\" says co-author Professor Nasser Al-Jahwari. \"However, the exact nature of these contacts is still a matter of study and debate.\" The discovery of the cymbals, therefore, indicates that the connections between the Gulf's Bronze Age cultures were not purely based on trade. Cultural practices likely flowed between the Arabian Peninsula and Indus Valley as much as materials. Musical traditions were likely a key aspect of life around the entire Arabian Gulf, possibly even indicating shared rituals or religious beliefs. Music may have been the glue holding these different cultures together and ensuring their harmonious relationships. \"Discovery of the Dahwa cymbals encourages the view that already during the late third millennium BC, music, chanting and communal dancing set the tone for mediating contact between various communities in this region for the millennia to follow,\" conclude the authors. More information: Bronze Age cymbals from Dahwa: Indus musical traditions in Oman, Antiquity (2025). doi.org/10.15184/aqy.2025.23 Citation: Revealing the rhythms of ancient Arabia: Music connected cultures in the prehistoric Arabian Gulf (2025, April 7) retrieved 7 April 2025 from https://phys.org/news/2025-04-revealing-rhythms-ancient-arabia-music.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/revealing-the-rhythms-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/revealing-the-rhythms-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/revealing-the-rhythms-1.jpg\" data-sub-html=\"Copper cymbals in situ after removing part of the fill layer. They are on top of each other, perfectly aligned. Credit: Y. Al Rahbi\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/revealing-the-rhythms-1.jpg\" alt=\"Revealing the rhythms of ancient Arabia: music connected cultures in the prehistoric Arabian Gulf\" title=\"Copper cymbals in situ after removing part of the fill layer. They are on top of each other, perfectly aligned. Credit: Y. Al Rahbi\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Copper cymbals in situ after removing part of the fill layer. They are on top of each other, perfectly aligned. Credit: Y. Al Rahbi\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eArchaeologists have analyzed a pair of copper cymbals from Bronze Age Oman, suggesting a shared musical tradition connected cultures and helped facilitate trade around the Arabian Gulf.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eMusic is a universal aspect of human life that is present in all societies. Whether used in religious ceremonies, cultural events or simply for entertainment, music has often acted as a force for bringing people together.\u003c/p\u003e\n\u003cp\u003eHowever, \u003ca href=\"https://phys.org/tags/musical+instruments/\" rel=\"tag\"\u003emusical instruments\u003c/a\u003e are often made of materials such as wood and metal, which do not commonly survive in the \u003ca href=\"https://phys.org/tags/archaeological+record/\" rel=\"tag\"\u003earchaeological record\u003c/a\u003e. This makes it difficult to learn how music shaped prehistoric cultures.\u003c/p\u003e\n\u003cp\u003eTherefore, a pair of copper alloy cymbals excavated from the third millennium BC \u0026#34;Umm an-Nar\u0026#34; culture site of Dahwa, Oman, is a rare and important find.\u003c/p\u003e\n\u003cp\u003e\u0026#34;These copper alloy cymbals are the first of their kind to have been found in good archaeological contexts in Oman and are from a particularly early context that questions some of the assumptions on their origin and development,\u0026#34; says lead author of the research, Professor Khaled Douglas from Sultan Qaboos University, Oman.\u003c/p\u003e\n\u003cp\u003eTo investigate the origins of the cymbals, archaeologists from Sultan Qaboos University analyzed them visually and performed isotope analysis of the copper. Their results are \u003ca href=\"https://doi.org/10.15184/aqy.2025.23\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eAntiquity\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eDespite being stylistically similar to examples of cymbals from the contemporary Indus Valley, isotope analysis indicates the cymbals were produced in Oman.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/revealing-the-rhythms.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/revealing-the-rhythms.jpg\" data-sub-html=\"Aerial photograph of the building in which the cymbals were found. Credit: Antiquity\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/revealing-the-rhythms.jpg\" alt=\"Revealing the rhythms of ancient Arabia: music connected cultures in the prehistoric Arabian Gulf\" title=\"Aerial photograph of the building in which the cymbals were found. Credit: Antiquity\"/\u003e\n             \u003cfigcaption\u003e\n                Aerial photograph of the building in which the cymbals were found. Credit: Antiquity\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eThis suggests that production of the cymbals was influenced through contact between the Umm an-Nar culture and the Indus Valley civilization.\u003c/p\u003e\n\u003cp\u003eTrade around the Arabian Gulf is well-attested during the Bronze Age. Many examples of ceramics, beads and metal objects that share similarities with those from the Indus Valley have been found in Arabia.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eHowever, these discoveries have predominantly been examined economically, and the social implications of this extensive interaction remain unclear.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The Early Bronze Age (Umm-an-Nar period) has already shown rich evidence of interregional contact,\u0026#34; says co-author Professor Nasser Al-Jahwari. \u0026#34;However, the exact nature of these contacts is still a matter of study and debate.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe discovery of the cymbals, therefore, indicates that the connections between the Gulf\u0026#39;s Bronze Age cultures were not purely based on trade. Cultural practices likely flowed between the Arabian Peninsula and Indus Valley as much as materials.\u003c/p\u003e\n\u003cp\u003eMusical traditions were likely a key aspect of life around the entire Arabian Gulf, possibly even indicating shared rituals or \u003ca href=\"https://phys.org/tags/religious+beliefs/\" rel=\"tag\"\u003ereligious beliefs\u003c/a\u003e. Music may have been the glue holding these different cultures together and ensuring their harmonious relationships.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Discovery of the Dahwa cymbals encourages the view that already during the late third millennium BC, \u003ca href=\"https://phys.org/tags/music/\" rel=\"tag\"\u003emusic\u003c/a\u003e, chanting and communal dancing set the tone for mediating contact between various communities in this region for the millennia to follow,\u0026#34; conclude the authors.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tBronze Age cymbals from Dahwa: Indus musical traditions in Oman, \u003ci\u003eAntiquity\u003c/i\u003e (2025). \u003ca href=\"https://doi.org/10.15184/aqy.2025.23\" target=\"_blank\"\u003edoi.org/10.15184/aqy.2025.23\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tRevealing the rhythms of ancient Arabia: Music connected cultures in the prehistoric Arabian Gulf (2025, April 7)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 7 April 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-04-revealing-rhythms-ancient-arabia-music.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-07T19:00:01-04:00",
  "modifiedTime": null
}
