{
  "id": "f01705b4-c1dc-4691-889b-4d8120e7c5be",
  "title": "How parents can develop kids' consumer competence",
  "link": "https://phys.org/news/2025-03-parents-kids-consumer.html",
  "description": "Taking children to the supermarket isn't always top of the list for parents, but the family grocery shop can have a positive influence on children's future buying habits.",
  "author": "",
  "published": "Thu, 13 Mar 2025 17:00:04 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences Economics \u0026 Business"
  ],
  "byline": "University of Otago",
  "length": 5180,
  "excerpt": "Taking children to the supermarket isn't always top of the list for parents, but the family grocery shop can have a positive influence on children's future buying habits.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: CC0 Public Domain Taking children to the supermarket isn't always top of the list for parents, but the family grocery shop can have a positive influence on children's future buying habits. New University of Otago–Ōtākou Whakaihu Waka research, published in Young Consumers, found that parents can help their children become competent consumers by involving them in supermarket shopping, and explaining the reasons for their purchasing choices and the values that underpin them. Co-authors Associate Professor Leah Watkins and Professor Rob Aitken, from the Department of Marketing at Otago Business School, set out to discover what factors can help children make thoughtful spending decisions as they grow up. Associate Professor Watkins says a central concern for researchers is how individuals become competent consumers and develop the ability to make independent and informed choices between competing alternatives in relation to economic, social and personal considerations. \"Given the growing commercialization of childhood, understanding how children learn about the consumption environments in which they live and develop the competencies needed to negotiate them is increasingly important.\" They studied pairs of parents and children aged 10–12 years old, who were tasked with undertaking a week's shopping for their family. While loading their trolleys, the children made sure they stocked up on essential food items as well as salt, pepper, cooking oil and general household items such as tissues, food wrap and toiletries. They made sure to include specific items that other family members preferred, such as a favorite shampoo. Importantly, they were conscious of making healthy choices—allocating a large portion of their shop to fresh fruit, bread and vegetables—and echoed their parents' values around frugality and ethical consumption. When considering pricing, the children recognized the need to keep within a budget and contemplate price promotions, balancing this with determining which products were the best value for money. Associate Professor Watkins says the study revealed the children to be competent, thoughtful and engaged consumers. \"Results show children are highly aware of the competing demands of individual and family needs and exhibited complex decision making that recognized the necessity of reconciling the needs of different family members.\" What makes a positive difference is how parents speak to their children about buying choices, she says. Many parent participants in the study identified grocery shopping as an opportunity to teach their children the values and principles that underpinned their decision-making and motivated their product preferences, including the importance of healthy eating behaviors and ethical consumption. \"Although children gained considerable practical knowledge from observing parents' behavior around planning meals, selecting products and provisioning the household for example, they also acquired underpinning knowledge from parents' intentional explanations of the values and justifications for their consumption choices.\" The parental influence on the children's consumption behavior is pivotal to the development of long-term attitudes and beliefs, she says. Professor Aitken says their research was inspired by a previous study in the 1950s, where researchers attempted to discover what consumption choices children would make in the supermarket if they were free from parental control and relieved of financial constraint. \"An assumption was that the children would make decisions based on self-interest and personal indulgence,\" he says. The 1950s children made sensible choices, but researchers put this down to their experiences living through shortages and austerity following World War II. \"With our study, we wanted to find out if the escalating rates of consumption in today's world would affect children's choices, but we were pleasantly surprised to see the children making conscientious decisions.\" More information: Leah Watkins et al, The nature and development of children's consumer competence: evidence from the aisles, Young Consumers (2024). DOI: 10.1108/YC-05-2024-2080 Citation: How parents can develop kids' consumer competence (2025, March 13) retrieved 13 March 2025 from https://phys.org/news/2025-03-parents-kids-consumer.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2018/2-supermarket.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2018/2-supermarket.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2018/2-supermarket.jpg\" data-sub-html=\"Credit: CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2018/2-supermarket.jpg\" alt=\"supermarket\" title=\"Credit: CC0 Public Domain\" width=\"800\" height=\"529\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eTaking children to the supermarket isn\u0026#39;t always top of the list for parents, but the family grocery shop can have a positive influence on children\u0026#39;s future buying habits.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eNew University of Otago–Ōtākou Whakaihu Waka research, \u003ca href=\"https://www.emerald.com/insight/content/doi/10.1108/YC-05-2024-2080/full/html\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eYoung Consumers\u003c/i\u003e, found that parents can help their children become competent consumers by involving them in supermarket shopping, and explaining the reasons for their purchasing choices and the values that underpin them.\u003c/p\u003e\n\u003cp\u003eCo-authors Associate Professor Leah Watkins and Professor Rob Aitken, from the Department of Marketing at Otago Business School, set out to discover what factors can help children make thoughtful spending decisions as they grow up.\u003c/p\u003e\n\u003cp\u003eAssociate Professor Watkins says a central concern for researchers is how individuals become competent consumers and develop the ability to make independent and informed choices between competing alternatives in relation to economic, social and personal considerations.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Given the growing commercialization of childhood, understanding how children learn about the consumption environments in which they live and develop the competencies needed to negotiate them is increasingly important.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThey studied pairs of parents and children aged 10–12 years old, who were tasked with undertaking a week\u0026#39;s shopping for their family.\u003c/p\u003e\n\u003cp\u003eWhile loading their trolleys, the children made sure they stocked up on essential food items as well as salt, pepper, cooking oil and general household items such as tissues, food wrap and toiletries.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThey made sure to include specific items that other \u003ca href=\"https://phys.org/tags/family+members/\" rel=\"tag\"\u003efamily members\u003c/a\u003e preferred, such as a favorite shampoo.\u003c/p\u003e\n\u003cp\u003eImportantly, they were conscious of making healthy choices—allocating a large portion of their shop to fresh fruit, bread and vegetables—and echoed their parents\u0026#39; values around frugality and ethical consumption.\u003c/p\u003e\n\u003cp\u003eWhen considering pricing, the children recognized the need to keep within a budget and contemplate price promotions, balancing this with determining which products were the best value for money.\u003c/p\u003e\n\u003cp\u003eAssociate Professor Watkins says the study revealed the children to be competent, thoughtful and engaged consumers.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Results show children are highly aware of the competing demands of individual and family needs and exhibited complex decision making that recognized the necessity of reconciling the needs of different family members.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhat makes a positive difference is how parents speak to their children about buying choices, she says.\u003c/p\u003e\n\u003cp\u003eMany parent participants in the study identified grocery shopping as an opportunity to teach their children the values and principles that underpinned their decision-making and motivated their product preferences, including the importance of healthy eating behaviors and ethical consumption.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Although children gained considerable practical knowledge from observing parents\u0026#39; behavior around planning meals, selecting products and provisioning the household for example, they also acquired underpinning knowledge from parents\u0026#39; intentional explanations of the values and justifications for their consumption choices.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe parental influence on the children\u0026#39;s consumption behavior is pivotal to the development of long-term attitudes and beliefs, she says.\u003c/p\u003e\n\u003cp\u003eProfessor Aitken says their research was inspired by a previous study in the 1950s, where researchers attempted to discover what consumption choices children would make in the supermarket if they were free from parental control and relieved of financial constraint.\u003c/p\u003e\n\u003cp\u003e\u0026#34;An assumption was that the children would make decisions based on self-interest and personal indulgence,\u0026#34; he says.\u003c/p\u003e\n\u003cp\u003eThe 1950s children made sensible choices, but researchers put this down to their experiences living through shortages and austerity following World War II.\u003c/p\u003e\n\u003cp\u003e\u0026#34;With our study, we wanted to find out if the escalating rates of \u003ca href=\"https://phys.org/tags/consumption/\" rel=\"tag\"\u003econsumption\u003c/a\u003e in today\u0026#39;s world would affect children\u0026#39;s choices, but we were pleasantly surprised to see the children making conscientious decisions.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tLeah Watkins et al, The nature and development of children\u0026#39;s consumer competence: evidence from the aisles, \u003ci\u003eYoung Consumers\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1108/YC-05-2024-2080\" target=\"_blank\"\u003eDOI: 10.1108/YC-05-2024-2080\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tHow parents can develop kids\u0026#39; consumer competence (2025, March 13)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 13 March 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-03-parents-kids-consumer.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-13T17:00:04-04:00",
  "modifiedTime": null
}
