{
  "id": "f3e17e0f-01ca-4935-baf6-56fa4e7ead2b",
  "title": "‘They're Not Breathing’: Inside the Chaos of ICE Detention Center 911 Calls",
  "link": "https://www.wired.com/story/ice-detention-center-911-emergencies/",
  "description": "Records of hundreds of emergency calls from ICE detention centers obtained by WIRED—including audio recordings—show a system inundated by life-threatening incidents, delayed treatment, and overcrowding.",
  "author": "Dhruv Mehrotra, Dell Cameron",
  "published": "Wed, 25 Jun 2025 21:21:09 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Security",
    "Security / National Security",
    "Security / Security News",
    "Politics / Policy",
    "Science / Health",
    "On the Line"
  ],
  "byline": "Dhruv Mehrotra, Dell Cameron",
  "length": 23295,
  "excerpt": "Records of hundreds of emergency calls from ICE detention centers obtained by WIRED—including audio recordings—show a system inundated by life-threatening incidents, delayed treatment, and overcrowding.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "On April 28, a nurse at the Aurora ICE Processing Center near Denver called 911. A woman in custody, four months pregnant, had arrived at the facility’s medical unit, bleeding and in pain. As the staff rushed to get vitals, the dispatcher rattled off questions: How old was she? Was the pregnancy high risk? The nurse hesitated: “She just came to us three days ago.”On 911 audio obtained by WIRED, the dispatcher’s voice cuts in:“Is there any sign of life?”“Have we heard a heartbeat?”“Does she feel any kicking?”“We don’t have the equipment to do that,” the nurse replies.It was just one incident in a spike of emergencies playing out inside Immigration and Customs Enforcement detention centers nationwide.A WIRED investigation into 911 calls from 10 of the nation's largest immigration detention centers found that serious medical incidents are rising at many of the sites. The data, obtained through public records requests, show that at least 60 percent of the centers analyzed had reported serious pregnancy complications, suicide attempts, or sexual assault allegations. Since January, these 10 facilities have collectively placed nearly 400 emergency calls. Nearly 50 of those have involved potential cardiac episodes, 26 referenced seizures, and 17 reported head injuries. Seven calls described suicide attempts or self-harm, including overdoses and hangings. Six others involved allegations of sexual abuse—including at least one case logged as “staff on detainee.”WIRED spoke with immigration attorneys, local migrant advocates, national policy experts, and individuals who have been recently detained or have family currently in ICE custody. Their accounts echoed the data: a system overwhelmed, and at times, seemingly indifferent to medical crises.Experts believe the true number of medical emergencies is far higher.The records WIRED reviewed capture only the medical emergencies that resulted in a 911 call—typically made by facility staff. Experts say many serious incidents likely go unreported, citing years’ worth of reports and independent medical reviews. Even among those that did prompt outside help, a third of all the calls had vague or nonexistent descriptions, with details often withheld by authorities.For example, on March 16, a woman identifying herself as a detainee at the Stewart Detention Center in Lumpkin, Georgia, called 911. Communication was strained: The dispatcher spoke no Spanish, and the caller only a little English. \"I need help,” the woman said. \"I need … ayuda.\" The line goes abruptly dead, triggering a follow-up call from the emergency operator. A staff member at the facility answers the phone: “We're at a detention center, and the detainee called 911, I'm sorry.” The woman's voice is still audible in the background, still pleading. Records indicate no ambulance was dispatched.ICE detention facilities are operating over capacity. Detention has surged by more than 48 percent since January, pushing the detained population to over 59,000—an all-time high, according to available data. The 2025 emergency call data also reflects conditions before ICE’s latest enforcement surge—a May directive from Department of Homeland Security secretary Kristi Noem and White House adviser Stephen Miller to triple daily arrests. Accordingly, the crises documented here are likely to deepen.In pursuit of its eventual goal of detaining 100,000 people simultaneously, the agency is targeting not just high-priority criminal offenders, but those who report, check in, and otherwise follow the law. The result has stretched the detention system to its limit. ICE has responded by offloading detainees into federal penitentiaries and tent-like barracks in detention camps, while issuing a wave of no-bid contracts—financial windfalls for private prison giants like The GEO Group and CoreCivic, which operate the vast majority of the facilities named in this report.The human cost of ICE’s strategy is increasingly visible. Dispatch data from 911 calls reveal how quickly medical emergencies can spiral inside these remote, crowded facilities—places where urgent care delivery is often delayed, falls on overworked staff, or is hindered by “insufficient or malfunctioning” equipment.The DHS and ICE did not respond to multiple requests for comment.Care on the MarginsOne of America’s busiest detention centers sits on a plot of unincorporated land in the heart of rural Georgia. It’s isolated even by local standards.When emergencies strike at Stewart Detention Center, responders are often dispatched from a weathered brick building in the nearby town of Lumpkin, a former agricultural community steeped in plantation-era history, economically defined by the ebb and flow of Stewart’s detained population. The detention center is a leading source of both jobs and operating revenue for the county.Throughout 2024, Stewart logged a steady stream of medical emergencies and violent episodes, from seizures and head injuries to suicide attempts and abdominal pain. But medical emergencies at Stewart have increased in both volume and severity in the first four months of 2025 alone, compared to the same time last year. Though Stewart’s population is only roughly 10 percent larger now, serious medical emergencies—seizures, head traumas, and suspected heart issues—have more than tripled.In March, a Stewart staff member called 911 to report that multiple women were “not breathing” after they'd been pepper sprayed. At least one serious injury reported this year was self-inflicted: an inmate “beating his head against the wall.” Jesús Molina-Veya, a Stewart detainee, is also confirmed to have died by suicide on June 7.Stewart has reported more in-custody deaths since 2017 than any other facility nationwide.Stewart County is part of a region hit hard by rural hospital closures, leaving residents with some of the longest emergency transport times in the state. EMS crews are being called upon to stabilize patients for longer periods, with doctors that provide advanced care occasionally taking an hour or more to reach.In several instances since March, it has taken EMS crews hours to clear some of the most urgent medical calls at Stewart, including cases involving chest pain and abnormal heart readings. In April, EMS spent more than two hours handling a seizure at Stewart. The same month, a pregnant woman at the facility was discovered “spitting up blood.” EMS logs show the call took two and half hours to clear.Marc Stern, a physician and former subject matter expert for the DHS’s Office of Civil Rights and Civil Liberties, where he investigated equality-of-care issues at privately run ICE facilities, cautions that 911 records alone offer limited insight into why some calls took over two hours to resolve. But for people in ICE custody—who have no say in where they’re being held—being placed in areas with scarce medical infrastructure only deepens their vulnerability.“As a community member, you make a choice to live where you’re living, with all its pros and cons, including, in this case, distance from a hospital,” Stern says. When ICE detainees with chronic health conditions are transferred from urban areas like Los Angeles—where there’s greater hospital access and faster emergency response times—to isolated detention centers in rural towns with limited infrastructure and fewer emergency services, they’re forced to accept a significantly lower standard of care.CoreCivic, which runs Stewart, says its detention facilities are staffed with licensed, credentialed doctors, nurses, and mental health professionals. “CoreCivic does not enforce immigration laws, arrest anyone who may be in violation of immigration laws, or have any say whatsoever in an individual’s deportation or release,” says spokesperson Brian Todd.“CoreCivic also does not know the circumstances of individuals when they are placed in our facilities,” he says.El Refugio, a nonprofit based near Stewart supporting detainees and their families, has fielded a recent surge of allegations about overcrowding at the facility, as well as claims of medical neglect, according to Amilcar Valencia, the group’s executive director.“That’s been the story of the last eight weeks,” he says.During visits in recent months, Emelie says her husband, who was detained at Stewart until he was deported last month, described severe overcrowding. \"He told me once Trump took over, they were rolling out mats in the halls. People were sleeping out there.”Emelie is a pseudonym granted for privacy. She says the conditions took a visible toll on her husband, who lost weight, grew increasingly anxious, and struggled to sleep amid the noise and tension. He described having to wait long stretches between meals. When her husband came down with the flu and spiked a high fever, she says, he filed multiple sick call requests, but never received care. \"He had Covid-19 once,” she says. “Same thing. People would be sick and just left to get worse.”“You don’t stand a chance at Stewart,” Emelie says, “It’s a death sentence for you and your family.”When asked about overcrowding at Stewart, Todd told WIRED, “Everyone in our care is offered a bed.” But three attorneys who regularly visit the facility said their clients have consistently described sleeping on floors or in plastic containers fitted with thin mats. Three relatives of current and former detainees corroborated those accounts.CoreCivic did not respond when asked how it defines a “bed.”Scrambling to CopeThe consequences of overcrowding extend far beyond Stewart.“We’re seeing a lot more transfers happening abruptly and frantically,” says Jeff Migliozzi, the communications director for the nonprofit Freedom for Immigrants, which runs the National Immigration Detention Hotline. “They’re scrambling.” Hotline calls more than doubled from 700 in December to 1,600 in March. Many go unanswered, Migliozzi says, because the lines are often too busy.Dispatch data obtained from these detention facilities across the US reflect the surge. Six of the 10 facilities reviewed by WIRED experienced a sharp month-to-month spike in 911 calls at some point in 2025, with emergency dispatches more than tripling in certain cases. For example, nearly 80 emergency calls were placed from the remote South Texas ICE Processing Center between January and May. Logs show that the number of calls more than tripled in March, rising from 10 in February to 31. In one week, dispatchers fielded 11 separate calls at the facility, which is run by the GEO Group, one of the nation’s largest for-profit prison operators.Migliozzi cautions that a rise in 911 calls doesn’t necessarily signal worsening conditions but may simply reflect a surging detainee population within an already dire system. Other experts noted a rise in calls could, hypothetically, signal that staff are getting quicker to call for help—though, conversely, a decline might just as easily point to delayed responses, not fewer crisesThree of the seven 911 calls obtained by WIRED involving suicide attempts this year came from the South Texas center: In February, a 36-year-old man swallowed 20 over-the-counter pills. In March, a 37-year-old detainee ingested cleaning chemicals. Two weeks later, a 41-year-old man was found cutting himself.Immigration detention isn’t supposed to be punitive, says Anthony Enriquez, vice president of advocacy at Robert F. Kennedy Human Rights. “But the conditions of confinement in detention are so brutal,” he says, “that people have attempted suicide while waiting for their day in court.”Enriquez argues that the decision to locate facilities in such remote areas—limiting access to family, legal support, and community resources—is no accident. The volume and frequency of 911 calls nationwide, he says, reflect a system that not only isolates detainees but leaves them dangerously vulnerable to harm.As of May, over five dozen 911 calls have been placed this year from the Aurora ICE Processing Center in Colorado, another facility operated by the GEO Group. In April, the calls were more than double that of March. In one case, a nurse reported a 20-year-old woman detoxing from a drug commonly prescribed to treat anxiety and seizures. She was too weak to walk, the nurse said, and “barely weighs 90 pounds.” The facility, she explained, does not treat people in withdrawal, adding: “We want to make sure she doesn’t have a seizure.”Another 911 call was placed about a 20-year-old woman withdrawing from the same drug less than a week later. This time, she had a seizure and, according to the nurse, was “in and out of consciousness.”Since January, at least four 911 calls from detention facilities in Colorado, Texas, and Georgia have involved pregnant women in distress, bleeding or suffering severe pain—one of them a CoreCivic employee. Research links ICE detention to high rates of pregnancy complications, with physicians finding serious risks to both fetal and maternal health. As a result, ICE policy generally discourages the detention of pregnant individuals.Enforcement of this policy appears inconsistent. According to DHS data, ICE booked 158 pregnant, postpartum, and nursing individuals over a six-month period ending early last spring.Eunice Hyunhye Cho, a senior attorney for the American Civil Liberties Union, says that while it's hard to judge ICE’s compliance from 911 call data alone, it’s clear that the agency’s recent drive to boost the detained population has dramatically increased the number of people who would have never been detained in the past, including pregnant individuals. “Previous administrations have chosen to exercise discretion about who to detain and who to release, based on medical vulnerability, but there is less indication that this is happening now.”“As multiple medical experts and medical associations have noted, placing individuals who are pregnant, postpartum, or nursing in detention is simply not a safe practice,” Cho adds, “particularly in light of poor nutrition and medical care in detention settings, as well as the harm it causes to children and families.”Visitors enter the Stewart Detention Center in Lumpkin, Georgia. Photograph: Don Bartletti/Getty ImagesIn an email, CoreCivic spokesperson Brian Todd says detainees have “daily access to sign up for medical care, including mental health services,” adding that Stewart’s clinic is staffed with licensed professionals who “contractually meet the highest standards of care as verified by multiple audits and inspections.”“Our onsite health services team at SDC, as with every facility where we provide medical care, takes seriously their role and responsibility to provide high-quality health care,” he says.Meredyth Yoon, litigation director at Asian Americans Advancing Justice – Atlanta, says her office has documented cases of pregnant people suffering miscarriages in custody after being denied proper medical attention. “We know specific instances where people have made repeated medical requests for weeks and not been seen,” she says. In other cases, she adds, pregnant detainees have gone months without any prenatal care.“When you hear about someone bleeding for days without being seen, locked alone in a room with no medical attention, it’s deeply disturbing,” she says. \"But it's not out of line with the types of things that we see at Stewart.”CoreCivic's Todd says the company is barred by privacy laws from commenting on specific medical cases.Silence on the LineFor every 911 call, advocates say, many more emergencies go unreported. Structural barriers often prevent detainees from receiving timely care. To see a provider, people in ICE custody normally submit a written “sick call” request. But responses can take days, and even then, evaluations are often cursory, according to detainees and their families.“A 911 call usually means someone’s in a condition the facility can’t handle,” says Cho. ICE detention centers typically rely on on-site medical units that operate more like basic clinics, she explains, able to dispense medication and check symptoms, but may not be equipped to handle most emergencies. When staff can’t manage a detainee’s condition, policy requires them to call 911 and notify supervisors through specific emergency protocols. But in practice, these steps have often been poorly followed or lead to delays.Rodney Taylor, a double amputee detained at Stewart Detention Center, has never been taken to a hospital despite multiple medical emergencies, according to his fiancée, Mildred Pierre. “It has taken three to four days for detainees to be seen,” she says. “They don’t have the capacity to support people with disabilities,” she adds. “It’s automatic medical neglect.”Three weeks ago, Taylor fell and seriously injured himself, breaking the prosthetic limbs he’d waited months to receive. He also hurt his hand trying to brace the fall. “Bruised. Swollen. The thumb won’t bend at all,” Pierre says of his injuries.Taylor suffers from chronic conditions, including diverticulitis and a history of heart disease, according to Pierre. While in custody, she recalls, his blood pressure once spiked to a dangerously high reading that warrants emergency care when combined with other symptoms. “He was having blurred vision and a headache,” she says. “He was having tingly feelings in his arms. I'm like, ‘It sounds like you're having a stroke.’” When he was finally seen by onsite medical staff, she says, they gave him Tylenol and his usual blood pressure medicine.Allison Bustillo, a 23-year-old nursing student with scoliosis, has spent the past four months in ICE custody in Georgia. Her mother, Keily Chinchilla, says Bustillo has often been forced to sleep on the floor, her spine seizing from inflammation, her left arm and half her face numb. Chinchilla says her daughter relies on a cocktail of anti-inflammatories and other drugs to manage her condition, but she isn't receiving them regularly.Since her detention began, Bustillo’s condition has worsened markedly. She has reported blood in her stool, severe stomach pain, and episodes of dangerously low blood pressure that once led staff to rush her to the infirmary. Most days, though, her mother says her pleas for help go ignored or are met with indifference. Unable to tolerate the facility’s food, which she says exacerbates her pain, Bustillo survives mostly on commissary oatmeal and canned tuna, funded by her mother from far.“I'm the only one trying to help my daughter,” she says. “She's not a criminal. She's sick and needs help.”Other 911 calls from facilities around the country suggest that even when emergencies are recognized, access to medical care can be delayed—or denied entirely.At the South Texas ICE Processing Center, a woman called 911 on March 31 to report that her husband, detained inside, had been too weak to get out of bed all day and “they have not helped.”In Denver, a female nurse at the Aurora ICE Processing Center called 911 on April 30 to report that a detainee on Level 1 suicide watch—the highest risk tier—had intentionally slammed his head into a wall and was bleeding from the mouth. Midway through the call, there's some commotion in the background, and a man can be heard telling the nurse to cancel the call. “You know what, never mind,” she says. When the dispatcher asks, “Are you sure?” she responds: “The provider cancelled it.”What Gets Buried InsideAt least six 911 calls placed from two GEO Group facilities this year reference possible forced sexual contact.The company says it enforces a “zero-tolerance” policy for sexual abuse and complies with federal regulations under the Prison Rape Elimination Act (PREA), a 2003 law aimed at curbing the epidemic of sexual violence in US prisons and jails. Experts warn that in the absence of meaningful oversight under the Trump administration, written rules cannot guarantee real-world protections.One of the facilities is the Adelanto ICE Processing Center in California, which reopened early this year after years of relative dormancy due to reports of unsafe conditions. Within its first three months back in operation, the facility generated at least 13 emergency calls—including at least two involving reported sexual assaults or threats of sexual assaults in March and April.At the South Texas ICE Processing Center, another GEO-run facility, the pattern continues. One 911 dispatch from March states simply: “Staff on detainee.” Since January, at least three other emergency calls have referenced sexual abuse.In recent months, the Trump administration has quietly gutted two critical oversight bodies at DHS responsible for investigating abuses in detention: the immigration detention ombuds office and the Office for Civil Rights and Civil Liberties. According to Zain Lakhani of the Women’s Refugee Commission, their dismantling has left detained migrants with virtually no channel to report sexual assault, medical neglect, or violations of parental rights. “These statutory obligations that they have to prevent and respond to sexual abuse, there’s no one to actually do this work now,” she says.The administration hasn’t said how it will handle the abandoned complaints or meet its obligations under PREA. Groups like WRC, once granted regular access to ICE facilities to document abuses and escalate reports, have been effectively cut off—resulting in what Lakhani calls a “black box of impunity.\"Like other experts, Lakhani says gauging the true scale of sexual abuse in detention is nearly impossible. “I think using 911 calls at the best of times is only going to capture a very, very small fraction of the number of cases,” she says. “And migrants are also terrified. They're calling from inside detention and they don't know what's going to happen to them.”At least hundreds of immigrants have reported sexual abuse while in ICE custody over the past decade, according to an investigation by Futuro Media, whose reporting found that “most sexual abuse complaints aren’t being investigated.” Analysis of internal records by the nonprofit newsroom revealed allegations of 308 sexual abuse or assault complaints filed across ICE facilities between 2015 and 2021. More than half implicated staff.Similarly, The Intercept reported that ICE records revealed more than 1,200 allegations of sexual abuse and assault between 2010 and 2017. Only 43 were investigated by DHS.Like GEO Group, CoreCivic says it's committed to combatting sexual abuse and harassment, citing regulations imposed under PREA, adding that its staff receive “pre-service and in-service” education and training.Both companies cited oversight and accreditations from the American Correctional Association (ACA) and the National Commission on Correctional Health Care (NCCHC) as evidence of their adherence to national guidelines.Accreditation shows whether a facility checks boxes—not whether people inside get care, says Dr. Stern. Facilities can score points just by writing policies or hiring staff, regardless of outcomes.“It’s like saying someone has a driver’s license,” says Stern. “They passed a test. But that doesn’t mean they won’t run a red light tomorrow.”Updated 5:35 pm ET, June 25, 2025: Added additional comment from a CoreCivic spokesperson regarding the company's policies around pregnant detainees.",
  "image": "https://media.wired.com/photos/6849d15a048bdf1148d68d32/191:100/w_1280,c_limit/061125-ice-detention-centre-911-calls.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cspan\u003eOn April 28,\u003c/span\u003e a nurse at the Aurora ICE Processing Center near Denver called 911. A woman in custody, four months pregnant, had arrived at the facility’s medical unit, bleeding and in pain. As the staff rushed to get vitals, the dispatcher rattled off questions: How old was she? Was the pregnancy high risk? The nurse hesitated: “She just came to us three days ago.”\u003c/p\u003e\u003cp\u003eOn 911 audio obtained by WIRED, the dispatcher’s voice cuts in:\u003c/p\u003e\u003cp\u003e\u003cem\u003e“Is there any sign of life?”\u003c/em\u003e\u003cbr/\u003e\u003cem\u003e“Have we heard a heartbeat?”\u003c/em\u003e\u003cbr/\u003e\u003cem\u003e“Does she feel any kicking?”\u003c/em\u003e\u003c/p\u003e\u003cp\u003e“We don’t have the equipment to do that,” the nurse replies.\u003c/p\u003e\u003cp\u003eIt was just one incident in a spike of emergencies playing out inside Immigration and Customs Enforcement detention centers nationwide.\u003c/p\u003e\u003cp\u003eA WIRED investigation into 911 calls from 10 of the nation\u0026#39;s largest immigration detention centers found that serious medical incidents are rising at many of the sites. The data, obtained through public records requests, show that at least 60 percent of the centers analyzed had reported serious pregnancy complications, suicide attempts, or sexual assault allegations. Since January, these 10 facilities have collectively placed nearly 400 emergency calls. Nearly 50 of those have involved potential cardiac episodes, 26 referenced seizures, and 17 reported head injuries. Seven calls described suicide attempts or self-harm, including overdoses and hangings. Six others involved allegations of sexual abuse—including at least one case logged as “staff on detainee.”\u003c/p\u003e\u003cp\u003eWIRED spoke with immigration attorneys, local migrant advocates, national policy experts, and individuals who have been recently detained or have family currently in ICE custody. Their accounts echoed the data: a system overwhelmed, and at times, seemingly indifferent to medical crises.\u003c/p\u003e\u003cp\u003eExperts believe the true number of medical emergencies is far higher.\u003c/p\u003e\u003cp\u003eThe records WIRED reviewed capture only the medical emergencies that resulted in a 911 call—typically made by facility staff. Experts say many serious incidents likely go unreported, citing years’ worth of reports and independent medical reviews. Even among those that did prompt outside help, a third of all the calls had vague or nonexistent descriptions, with details often withheld by authorities.\u003c/p\u003e\u003cp\u003eFor example, on March 16, a woman identifying herself as a detainee at the Stewart Detention Center in Lumpkin, Georgia, called 911. Communication was strained: The dispatcher spoke no Spanish, and the caller only a little English. \u0026#34;I need help,” the woman said. \u0026#34;I need … \u003cem\u003eayuda\u003c/em\u003e.\u0026#34; The line goes abruptly dead, triggering a follow-up call from the emergency operator. A staff member at the facility answers the phone: “We\u0026#39;re at a detention center, and the detainee called 911, I\u0026#39;m sorry.” The woman\u0026#39;s voice is still audible in the background, still pleading. Records indicate no ambulance was dispatched.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eICE detention facilities are operating over capacity. Detention has surged by more than 48 percent since January, pushing the detained population to over 59,000—an all-time high, according to available data. The 2025 emergency call data also reflects conditions before ICE’s latest enforcement surge—a May directive from Department of Homeland Security secretary Kristi Noem and White House adviser Stephen Miller to \u003ca href=\"https://www.axios.com/2025/05/28/immigration-ice-deportations-stephen-miller\"\u003etriple daily arrests\u003c/a\u003e. Accordingly, the crises documented here are likely to deepen.\u003c/p\u003e\u003cp\u003eIn pursuit of its eventual goal of detaining \u003ca href=\"https://apnews.com/article/immigration-enforcement-border-trump-ice-6fecdf2313788bd889b51adfb003ca7a\"\u003e100,000 people\u003c/a\u003e simultaneously, the agency is targeting not just high-priority criminal offenders, but those who report, check in, and otherwise follow the law. The result has stretched the detention system to its limit. ICE has responded by offloading detainees into \u003ca data-offer-url=\"https://abcnews.go.com/US/males-detained-ice-housed-federal-prisons-new-memo/story?id=118850412\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://abcnews.go.com/US/males-detained-ice-housed-federal-prisons-new-memo/story?id=118850412\u0026#34;}\" href=\"https://abcnews.go.com/US/males-detained-ice-housed-federal-prisons-new-memo/story?id=118850412\" rel=\"nofollow noopener\" target=\"_blank\"\u003efederal penitentiaries\u003c/a\u003e and \u003ca data-offer-url=\"https://www.washingtonpost.com/business/2025/04/24/immigrant-detention-tent-krome-florida/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.washingtonpost.com/business/2025/04/24/immigrant-detention-tent-krome-florida/\u0026#34;}\" href=\"https://www.washingtonpost.com/business/2025/04/24/immigrant-detention-tent-krome-florida/\" rel=\"nofollow noopener\" target=\"_blank\"\u003etent-like barracks\u003c/a\u003e in \u003ca data-offer-url=\"https://elpasomatters.org/2025/06/15/ice-moves-detainees-to-el-paso-after-escape-at-new-jersey-delaney-hall/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://elpasomatters.org/2025/06/15/ice-moves-detainees-to-el-paso-after-escape-at-new-jersey-delaney-hall/\u0026#34;}\" href=\"https://elpasomatters.org/2025/06/15/ice-moves-detainees-to-el-paso-after-escape-at-new-jersey-delaney-hall/\" rel=\"nofollow noopener\" target=\"_blank\"\u003edetention camps\u003c/a\u003e, while issuing a wave of \u003ca href=\"https://apnews.com/article/immigration-detention-centers-ice-deportations-trump-e92b67a388f041b84593d7a29fd93c54\"\u003eno-bid contracts\u003c/a\u003e—financial windfalls for private prison giants like The GEO Group and CoreCivic, which operate the vast majority of the facilities named in this report.\u003c/p\u003e\u003cp\u003eThe human cost of ICE’s strategy is increasingly visible. Dispatch data from 911 calls reveal how quickly medical emergencies can spiral inside these remote, crowded facilities—places where urgent care delivery is often delayed, falls on overworked staff, or is hindered by “\u003ca href=\"https://assets.aclu.org/live/uploads/2024/06/2024-07-01-ICE-Detainee-Deaths.pdf\"\u003einsufficient or malfunctioning\u003c/a\u003e” equipment.\u003c/p\u003e\u003cp\u003eThe DHS and ICE did not respond to multiple requests for comment.\u003c/p\u003e\u003ch2\u003eCare on the Margins\u003c/h2\u003e\u003cp\u003eOne of America’s busiest detention centers sits on a plot of unincorporated land in the heart of rural Georgia. It’s isolated even by local standards.\u003c/p\u003e\u003cp\u003eWhen emergencies strike at Stewart Detention Center, responders are often dispatched from a weathered brick building in the nearby town of Lumpkin, a former agricultural community steeped in plantation-era history, economically defined by the ebb and flow of Stewart’s detained population. The detention center is a leading source of both jobs and operating revenue for the county.\u003c/p\u003e\u003cp\u003eThroughout 2024, Stewart logged a steady stream of medical emergencies and violent episodes, from seizures and head injuries to suicide attempts and abdominal pain. But medical emergencies at Stewart have increased in both volume and severity in the first four months of 2025 alone, compared to the same time last year. Though Stewart’s population is only roughly 10 percent larger now, serious medical emergencies—seizures, head traumas, and suspected heart issues—have more than tripled.\u003c/p\u003e\u003cp\u003eIn March, a Stewart staff member called 911 to report that multiple women were “not breathing” after they\u0026#39;d been pepper sprayed. At least one serious injury reported this year was self-inflicted: an inmate “beating his head against the wall.” Jesús Molina-Veya, a Stewart detainee, is also confirmed to have died by suicide on June 7.\u003c/p\u003e\u003cfigure data-testid=\"IframeEmbed\"\u003e\u003c/figure\u003e\u003cp\u003eStewart has reported more in-custody deaths since 2017 than any other facility nationwide.\u003c/p\u003e\u003cp\u003eStewart County is part of a region hit hard by rural hospital closures, leaving residents with some of the longest emergency transport times in the state. EMS crews are being called upon to stabilize patients for longer periods, with doctors that provide advanced care occasionally taking an hour or more to reach.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn several instances since March, it has taken EMS crews hours to clear some of the most urgent medical calls at Stewart, including cases involving chest pain and abnormal heart readings. In April, EMS spent more than two hours handling a seizure at Stewart. The same month, a pregnant woman at the facility was discovered “spitting up blood.” EMS logs show the call took two and half hours to clear.\u003c/p\u003e\u003cp\u003eMarc Stern, a physician and former subject matter expert for the DHS’s Office of Civil Rights and Civil Liberties, where he investigated equality-of-care issues at privately run ICE facilities, cautions that 911 records alone offer limited insight into why some calls took over two hours to resolve. But for people in ICE custody—who have no say in where they’re being held—being placed in areas with scarce medical infrastructure only deepens their vulnerability.\u003c/p\u003e\u003cp\u003e“As a community member, you make a choice to live where you’re living, with all its pros and cons, including, in this case, distance from a hospital,” Stern says. When ICE detainees with chronic health conditions are transferred from urban areas like Los Angeles—where there’s greater hospital access and faster emergency response times—to isolated detention centers in rural towns with limited infrastructure and fewer emergency services, they’re forced to accept a significantly lower standard of care.\u003c/p\u003e\u003cp\u003eCoreCivic, which runs Stewart, says its detention facilities are staffed with licensed, credentialed doctors, nurses, and mental health professionals. “CoreCivic does not enforce immigration laws, arrest anyone who may be in violation of immigration laws, or have any say whatsoever in an individual’s deportation or release,” says spokesperson Brian Todd.\u003c/p\u003e\u003cp\u003e“CoreCivic also does not know the circumstances of individuals when they are placed in our facilities,” he says.\u003c/p\u003e\u003cp\u003eEl Refugio, a nonprofit based near Stewart supporting detainees and their families, has fielded a recent surge of allegations about overcrowding at the facility, as well as claims of medical neglect, according to Amilcar Valencia, the group’s executive director.\u003c/p\u003e\u003cp\u003e“That’s been the story of the last eight weeks,” he says.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eDuring visits in recent months, Emelie says her husband, who was detained at Stewart until he was deported last month, described severe overcrowding. \u0026#34;He told me once Trump took over, they were rolling out mats in the halls. People were sleeping out there.”\u003c/p\u003e\u003cp\u003eEmelie is a pseudonym granted for privacy. She says the conditions took a visible toll on her husband, who lost weight, grew increasingly anxious, and struggled to sleep amid the noise and tension. He described having to wait long stretches between meals. When her husband came down with the flu and spiked a high fever, she says, he filed multiple sick call requests, but never received care. \u0026#34;He had Covid-19 once,” she says. “Same thing. People would be sick and just left to get worse.”\u003c/p\u003e\u003cp\u003e“You don’t stand a chance at Stewart,” Emelie says, “It’s a death sentence for you and your family.”\u003c/p\u003e\u003cp\u003eWhen asked about overcrowding at Stewart, Todd told WIRED, “Everyone in our care is offered a bed.” But three attorneys who regularly visit the facility said their clients have consistently described sleeping on floors or in plastic containers fitted with thin mats. Three relatives of current and former detainees corroborated those accounts.\u003c/p\u003e\u003cp\u003eCoreCivic did not respond when asked how it defines a “bed.”\u003c/p\u003e\u003ch2\u003eScrambling to Cope\u003c/h2\u003e\u003cp\u003eThe consequences of overcrowding extend far beyond Stewart.\u003c/p\u003e\u003cp\u003e“We’re seeing a lot more transfers happening abruptly and frantically,” says Jeff Migliozzi, the communications director for the nonprofit Freedom for Immigrants, which runs the National Immigration Detention Hotline. “They’re scrambling.” Hotline calls more than doubled from 700 in December to 1,600 in March. Many go unanswered, Migliozzi says, because the lines are often too busy.\u003c/p\u003e\u003cp\u003eDispatch data obtained from these detention facilities across the US reflect the surge. Six of the 10 facilities reviewed by WIRED experienced a sharp month-to-month spike in 911 calls at some point in 2025, with emergency dispatches more than tripling in certain cases. For example, nearly 80 emergency calls were placed from the remote South Texas ICE Processing Center between January and May. Logs show that the number of calls more than tripled in March, rising from 10 in February to 31. In one week, dispatchers fielded 11 separate calls at the facility, which is run by the GEO Group, one of the nation’s largest for-profit prison operators.\u003c/p\u003e\u003cp\u003eMigliozzi cautions that a rise in 911 calls doesn’t necessarily signal worsening conditions but may simply reflect a surging detainee population within an already dire system. Other experts noted a rise in calls could, hypothetically, signal that staff are getting quicker to call for help—though, conversely, a decline might just as easily point to delayed responses, not fewer crises\u003c/p\u003e\u003cp\u003eThree of the seven 911 calls obtained by WIRED involving suicide attempts this year came from the South Texas center: In February, a 36-year-old man swallowed 20 over-the-counter pills. In March, a 37-year-old detainee ingested cleaning chemicals. Two weeks later, a 41-year-old man was found cutting himself.\u003c/p\u003e\u003cp\u003eImmigration detention isn’t supposed to be punitive, says Anthony Enriquez, vice president of advocacy at Robert F. Kennedy Human Rights. “But the conditions of confinement in detention are so brutal,” he says, “that people have attempted suicide while waiting for their day in court.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eEnriquez argues that the decision to locate facilities in such remote areas—limiting access to family, legal support, and community resources—is no accident. The volume and frequency of 911 calls nationwide, he says, reflect a system that not only isolates detainees but leaves them dangerously vulnerable to harm.\u003c/p\u003e\u003cp\u003eAs of May, over five dozen 911 calls have been placed this year from the Aurora ICE Processing Center in Colorado, another facility operated by the GEO Group. In April, the calls were more than double that of March. In one case, a nurse reported a 20-year-old woman detoxing from a drug commonly prescribed to treat anxiety and seizures. She was too weak to walk, the nurse said, and “barely weighs 90 pounds.” The facility, she explained, does not treat people in withdrawal, adding: “We want to make sure she doesn’t have a seizure.”\u003c/p\u003e\u003cp\u003eAnother 911 call was placed about a 20-year-old woman withdrawing from the same drug less than a week later. This time, she had a seizure and, according to the nurse, was “in and out of consciousness.”\u003c/p\u003e\u003cp\u003eSince January, at least four 911 calls from detention facilities in Colorado, Texas, and Georgia have involved pregnant women in distress, bleeding or suffering severe pain—one of them a CoreCivic employee. Research links ICE detention to \u003ca href=\"https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2812358\"\u003ehigh rates\u003c/a\u003e of pregnancy complications, with physicians finding \u003ca data-offer-url=\"https://phr.org/wp-content/uploads/2019/12/PHR-Pregnant-Women-in-Immigration-Custody-Fact-Sheet-Nov-2019.pdf\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://phr.org/wp-content/uploads/2019/12/PHR-Pregnant-Women-in-Immigration-Custody-Fact-Sheet-Nov-2019.pdf\u0026#34;}\" href=\"https://phr.org/wp-content/uploads/2019/12/PHR-Pregnant-Women-in-Immigration-Custody-Fact-Sheet-Nov-2019.pdf\" rel=\"nofollow noopener\" target=\"_blank\"\u003eserious risks\u003c/a\u003e to both fetal and maternal health. As a result, \u003ca href=\"https://www.ice.gov/doclib/detention/11032.4_IdentificationMonitoringPregnantPostpartumNursingIndividuals.pdf\"\u003eICE policy\u003c/a\u003e generally discourages the detention of pregnant individuals.\u003c/p\u003e\u003cp\u003eEnforcement of this policy appears inconsistent. According to \u003ca href=\"https://www.dhs.gov/sites/default/files/2024-09/0802_2024_ice_pregnant_postpartum_and_lactating_individuals_in_immigration_detention_semiannual_1.pdf\"\u003eDHS data\u003c/a\u003e, ICE booked 158 pregnant, postpartum, and nursing individuals over a six-month period ending early last spring.\u003c/p\u003e\u003cp\u003eEunice Hyunhye Cho, a senior attorney for the American Civil Liberties Union, says that while it\u0026#39;s hard to judge ICE’s compliance from 911 call data alone, it’s clear that the agency’s recent drive to boost the detained population has dramatically increased the number of people who would have never been detained in the past, including pregnant individuals. “Previous administrations have chosen to exercise discretion about who to detain and who to release, based on medical vulnerability, but there is less indication that this is happening now.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“As multiple medical experts and medical associations have noted, placing individuals who are pregnant, postpartum, or nursing in detention is simply not a safe practice,” Cho adds, “particularly in light of poor nutrition and medical care in detention settings, as well as the harm it causes to children and families.”\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eVisitors enter the Stewart Detention Center in Lumpkin, Georgia.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Don Bartletti/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eIn an email, CoreCivic spokesperson Brian Todd says detainees have “daily access to sign up for medical care, including mental health services,” adding that Stewart’s clinic is staffed with licensed professionals who “contractually meet the highest standards of care as verified by multiple audits and inspections.”\u003c/p\u003e\u003cp\u003e“Our onsite health services team at SDC, as with every facility where we provide medical care, takes seriously their role and responsibility to provide high-quality health care,” he says.\u003c/p\u003e\u003cp\u003eMeredyth Yoon, litigation director at Asian Americans Advancing Justice – Atlanta, says her office has documented cases of pregnant people suffering miscarriages in custody after being denied proper medical attention. “We know specific instances where people have made repeated medical requests for weeks and not been seen,” she says. In other cases, she adds, pregnant detainees have gone months without any prenatal care.\u003c/p\u003e\u003cp\u003e“When you hear about someone bleeding for days without being seen, locked alone in a room with no medical attention, it’s deeply disturbing,” she says. \u0026#34;But it\u0026#39;s not out of line with the types of things that we see at Stewart.”\u003c/p\u003e\u003cp\u003eCoreCivic\u0026#39;s Todd says the company is barred by privacy laws from commenting on specific medical cases.\u003c/p\u003e\u003ch2\u003eSilence on the Line\u003c/h2\u003e\u003cp\u003eFor every 911 call, advocates say, many more emergencies go unreported. Structural barriers often prevent detainees from receiving timely care. To see a provider, people in ICE custody normally submit a written “sick call” request. But responses can take days, and even then, evaluations are often cursory, according to detainees and their families.\u003c/p\u003e\u003cp\u003e“A 911 call usually means someone’s in a condition the facility can’t handle,” says Cho. ICE detention centers typically rely on on-site medical units that operate more like basic clinics, she explains, able to dispense medication and check symptoms, but may not be equipped to handle most emergencies. When staff can’t manage a detainee’s condition, policy requires them to call 911 and notify supervisors through specific emergency protocols. But in practice, these steps have often been \u003ca data-offer-url=\"https://americanoversight.org/resource/deadly-failures-preventable-deaths-in-u-s-immigration-detention/#:~:text=5%3A26%20p,ambulance%2C%20when%20a%20sergeant%20asked\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://americanoversight.org/resource/deadly-failures-preventable-deaths-in-u-s-immigration-detention/#:~:text=5%3A26%20p,ambulance%2C%20when%20a%20sergeant%20asked\u0026#34;}\" href=\"https://americanoversight.org/resource/deadly-failures-preventable-deaths-in-u-s-immigration-detention/#:~:text=5%3A26%20p,ambulance%2C%20when%20a%20sergeant%20asked\" rel=\"nofollow noopener\" target=\"_blank\"\u003epoorly followed\u003c/a\u003e or \u003ca href=\"https://www.thelancet.com/journals/lanam/article/PIIS2667-193X(21)00032-6/fulltext\"\u003elead to delays\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eRodney Taylor, a double amputee detained at Stewart Detention Center, has never been taken to a hospital despite multiple medical emergencies, according to his fiancée, Mildred Pierre. “It has taken three to four days for detainees to be seen,” she says. “They don’t have the capacity to support people with disabilities,” she adds. “It’s automatic medical neglect.”\u003c/p\u003e\u003cp\u003eThree weeks ago, Taylor fell and seriously injured himself, breaking the prosthetic limbs he’d waited months to receive. He also hurt his hand trying to brace the fall. “Bruised. Swollen. The thumb won’t bend at all,” Pierre says of his injuries.\u003c/p\u003e\u003cp\u003eTaylor suffers from chronic conditions, including diverticulitis and a history of heart disease, according to Pierre. While in custody, she recalls, his blood pressure once spiked to a dangerously high reading that warrants emergency care when combined with other symptoms. “He was having blurred vision and a headache,” she says. “He was having tingly feelings in his arms. I\u0026#39;m like, ‘It sounds like you\u0026#39;re having a stroke.’” When he was finally seen by onsite medical staff, she says, they gave him Tylenol and his usual blood pressure medicine.\u003c/p\u003e\u003cp\u003eAllison Bustillo, a 23-year-old nursing student with scoliosis, has spent the past four months in ICE custody in Georgia. Her mother, Keily Chinchilla, says Bustillo has often been forced to sleep on the floor, her spine seizing from inflammation, her left arm and half her face numb. Chinchilla says her daughter relies on a cocktail of anti-inflammatories and other drugs to manage her condition, but she isn\u0026#39;t receiving them regularly.\u003c/p\u003e\u003cp\u003eSince her detention began, Bustillo’s condition has worsened markedly. She has reported blood in her stool, severe stomach pain, and episodes of dangerously low blood pressure that once led staff to rush her to the infirmary. Most days, though, her mother says her pleas for help go ignored or are met with indifference. Unable to tolerate the facility’s food, which she says exacerbates her pain, Bustillo survives mostly on commissary oatmeal and canned tuna, funded by her mother from far.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“I\u0026#39;m the only one trying to help my daughter,” she says. “She\u0026#39;s not a criminal. She\u0026#39;s sick and needs help.”\u003c/p\u003e\u003cp\u003eOther 911 calls from facilities around the country suggest that even when emergencies are recognized, access to medical care can be delayed—or denied entirely.\u003c/p\u003e\u003cp\u003eAt the South Texas ICE Processing Center, a woman called 911 on March 31 to report that her husband, detained inside, had been too weak to get out of bed all day and “they have not helped.”\u003c/p\u003e\u003cp\u003eIn Denver, a female nurse at the Aurora ICE Processing Center called 911 on April 30 to report that a detainee on Level 1 suicide watch—the highest risk tier—had intentionally slammed his head into a wall and was bleeding from the mouth. Midway through the call, there\u0026#39;s some commotion in the background, and a man can be heard telling the nurse to cancel the call. “You know what, never mind,” she says. When the dispatcher asks, “Are you sure?” she responds: “The provider cancelled it.”\u003c/p\u003e\u003ch2\u003eWhat Gets Buried Inside\u003c/h2\u003e\u003cp\u003eAt least six 911 calls placed from two GEO Group facilities this year reference possible forced sexual contact.\u003c/p\u003e\u003cp\u003eThe company says it enforces a “zero-tolerance” policy for sexual abuse and complies with federal regulations under the Prison Rape Elimination Act (PREA), a 2003 law aimed at curbing the epidemic of sexual violence in US prisons and jails. Experts warn that in the absence of meaningful oversight under the Trump administration, written rules cannot guarantee real-world protections.\u003c/p\u003e\u003cp\u003eOne of the facilities is the Adelanto ICE Processing Center in California, which \u003ca href=\"https://www.latimes.com/california/story/2025-01-29/adelanto-immigration-facility-to-resume-housing-migrants\"\u003ereopened early this year\u003c/a\u003e after years of relative dormancy due to reports of unsafe conditions. Within its first three months back in operation, the facility generated at least 13 emergency calls—including at least two involving reported sexual assaults or threats of sexual assaults in March and April.\u003c/p\u003e\u003cp\u003eAt the South Texas ICE Processing Center, another GEO-run facility, the pattern continues. One 911 dispatch from March states simply: “Staff on detainee.” Since January, at least three other emergency calls have referenced sexual abuse.\u003c/p\u003e\u003cp\u003eIn recent months, the Trump administration has quietly gutted two critical oversight bodies at DHS responsible for investigating abuses in detention: the immigration detention ombuds office and the Office for Civil Rights and Civil Liberties. According to Zain Lakhani of the Women’s Refugee Commission, their dismantling has left detained migrants with virtually no channel to report sexual assault, medical neglect, or violations of parental rights. “These statutory obligations that they have to prevent and respond to sexual abuse, there’s no one to actually do this work now,” she says.\u003c/p\u003e\u003cp\u003eThe administration hasn’t said how it will handle the abandoned complaints or meet its obligations under PREA. Groups like WRC, once granted regular access to ICE facilities to document abuses and escalate reports, have been effectively cut off—resulting in what Lakhani calls a “black box of impunity.\u0026#34;\u003c/p\u003e\u003cp\u003eLike other experts, Lakhani says gauging the true scale of sexual abuse in detention is nearly impossible. “I think using 911 calls at the best of times is only going to capture a very, very small fraction of the number of cases,” she says. “And migrants are also terrified. They\u0026#39;re calling from inside detention and they don\u0026#39;t know what\u0026#39;s going to happen to them.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eAt least hundreds of immigrants have reported sexual abuse while in ICE custody over the past decade, according to \u003ca data-offer-url=\"https://futuroinvestigates.org/investigative-stories/immensely-invisible/immensely-invisible-women-fighting-ices-inaction-on-sexual-abuses/#The%20Aftermath%20at%20Stewart%20Detention%20Center\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://futuroinvestigates.org/investigative-stories/immensely-invisible/immensely-invisible-women-fighting-ices-inaction-on-sexual-abuses/#The%20Aftermath%20at%20Stewart%20Detention%20Center\u0026#34;}\" href=\"https://futuroinvestigates.org/investigative-stories/immensely-invisible/immensely-invisible-women-fighting-ices-inaction-on-sexual-abuses/#The%20Aftermath%20at%20Stewart%20Detention%20Center\" rel=\"nofollow noopener\" target=\"_blank\"\u003ean investigation\u003c/a\u003e by Futuro Media, whose reporting found that “most sexual abuse complaints aren’t being investigated.” Analysis of internal records by the nonprofit newsroom revealed allegations of 308 sexual abuse or assault complaints filed across ICE facilities between 2015 and 2021. More than half implicated staff.\u003c/p\u003e\u003cp\u003eSimilarly, The Intercept reported that ICE records revealed more than \u003ca data-offer-url=\"https://theintercept.com/2018/04/11/immigration-detention-sexual-abuse-ice-dhs/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://theintercept.com/2018/04/11/immigration-detention-sexual-abuse-ice-dhs/\u0026#34;}\" href=\"https://theintercept.com/2018/04/11/immigration-detention-sexual-abuse-ice-dhs/\" rel=\"nofollow noopener\" target=\"_blank\"\u003e1,200 allegations\u003c/a\u003e of sexual abuse and assault between 2010 and 2017. Only 43 were investigated by DHS.\u003c/p\u003e\u003cp\u003eLike GEO Group, CoreCivic says it\u0026#39;s committed to combatting sexual abuse and harassment, citing regulations imposed under PREA, adding that its staff receive “pre-service and in-service” education and training.\u003c/p\u003e\u003cp\u003eBoth companies cited oversight and accreditations from the American Correctional Association (ACA) and the National Commission on Correctional Health Care (NCCHC) as evidence of their adherence to national guidelines.\u003c/p\u003e\u003cp\u003eAccreditation shows whether a facility checks boxes—not whether people inside get care, says Dr. Stern. Facilities can score points just by writing policies or hiring staff, regardless of outcomes.\u003c/p\u003e\u003cp\u003e“It’s like saying someone has a driver’s license,” says Stern. “They passed a test. But that doesn’t mean they won’t run a red light tomorrow.”\u003c/p\u003e\u003cp\u003e\u003cem\u003eUpdated 5:35 pm ET, June 25, 2025: Added additional comment from a CoreCivic spokesperson regarding the company\u0026#39;s policies around pregnant detainees.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "25 min read",
  "publishedTime": "2025-06-25T17:21:09.592-04:00",
  "modifiedTime": "2025-06-25T21:21:09.592Z"
}
