{
  "id": "f4f3c200-27d9-43d0-a4ec-b5f4d2df7afd",
  "title": "Forget About It!",
  "link": "https://www.stitcher.com",
  "description": "Forgetting something — whether it's a colleague's name or where we put our keys — can be deeply frustrating. This week, psychologist Ciara Greene helps us explore the science of forgetting. We look at why our minds hold on to some memories for a lifetime, but discard others within seconds. And we grapple with a question many people ask themselves: Is my forgetfulness a sign that something is wrong with me?In this episode, you'll learn about: *The neurological underpinnings of memory*Why forgetting is a core part of how our minds work *Why this process of forgetting can sometimes be a good thing*How our psychological states shape what we remember, and how we frame our memories*Why we should treat our memories with skepticism and our forgetfulness with compassion Hidden Brain is going on tour! Join us as Shankar shares key insights from the first decade of the show — more info and tickets can be found here: https://hiddenbrain.org/tour",
  "author": "Hidden Brain Media",
  "published": "Mon, 12 May 2025 19:00:00 +0000",
  "source": "https://feeds.npr.org/510308/podcast.xml",
  "categories": null,
  "byline": "",
  "length": 162,
  "excerpt": "Subscribers with streaming access can now enjoy a unique mix of podcasts via the SiriusXM mobile app or online.",
  "siteName": "SiriusXM",
  "favicon": "https://www.siriusxm.com/apple-touch-icon.png",
  "text": "Curated music channels, live sports, news across the spectrum, celebrity-hosted talk, comedy, and more. The entertainment you choose, wherever you want to listen.",
  "image": "/content/dam/sxm-com/programming-content/podcast/landing-page/Podcast-OG-EVEREST-2882-v5.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eCurated music channels, live sports, news across the spectrum, celebrity-hosted talk, comedy, and more. The entertainment you choose, wherever you want to listen.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
