{
  "id": "f6d5230a-fd50-4c8e-845d-2a0bd0d9d4b1",
  "title": "The NCCIH embraces the quackery that is “functional medicine”",
  "link": "https://sciencebasedmedicine.org/the-nccih-embraces-the-quackery-that-is-functional-medicine/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=the-nccih-embraces-the-quackery-that-is-functional-medicine",
  "description": "The process of \"integrating\" quackery with medicine continues apace as the National Center for Complementary and Integrative Health embraces the quackery that is \"functional medicine.\" The post The NCCIH embraces the quackery that is “functional medicine” first appeared on Science-Based Medicine.",
  "author": "David Gorski",
  "published": "Mon, 30 Sep 2024 07:00:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Herbs \u0026 Supplements",
    "Politics and Regulation",
    "Public Health",
    "Science and Medicine",
    "Functional medicine",
    "Helene Langevin",
    "MAHA",
    "make America healthy again",
    "National Center for Complementary and Alternative Medic",
    "National Center for Complementary and Alternative Medicine",
    "National Institutes of Health",
    "NCCIH Coalition for Whole Person Health",
    "NIH",
    "whole person health",
    "whole person medicine"
  ],
  "byline": "David Gorski",
  "length": 23923,
  "excerpt": "The National Center for Complementary and Integrative Health continues to promote the integration of quackery with medicine, this time functional medicine.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "[Editor note: Regular readers might—or might not have—noticed last Monday that, for the first time in more years than I can remember, I failed to post anything and didn’t even repost something from the archives or announce my absence. The explanation is unfortunately all too simple. The Sunday before, I spent something like 13 hours in the hall of at the emergency room of a local hospital with my father, who had called me early Sunday morning. (Fortunately, he’s OK now, but was admitted for a couple of days.) The exact nature of the medical problem that precipitated this ER visit is not something I’m going to discuss publicly other than to note that our ER sojourn made it impossible for me to complete a post by Monday and that, unfortunately, no one could fill in at the last moment, not even Dr. Howard. In any case, I’m back. To get back into the groove, I thought I’d discuss something that’s been sitting in my fodder folder since June about NCCIH, because, well, you’ll see. Hint: It involves functional medicine.] On this blog, we have been very critical of the National Center for Complementary and Integrative Health (NCCIH), which until several ago had gone under the name the National Center for Complementary and Alternative Medicine (which produced the easier-to-remember NCCAM). It was a rebranding that began a decade ago, when NCCAM director Dr. Josephine Briggs proposed renaming NCCAM (mainly because, wanting to be—or at least seem to be—all about the science, she didn’t like the word “alternative” in the name) and asked the public for suggestions. Unsurprisingly, I likened it to “polishing a turd.” A few months later, NCCAM was rebranded as NCCIH, the better to “integrate” quackery into health. A few years later, Dr. Briggs retired, to be replaced by a true believer in acupuncture, Dr. Helene Langevin. Thus ended a ten year stint in which NCCAM tried to pivot to be more scientific, mainly by trying to rebrand lifestyle medicine such as diet and exercise as “alternative” or “integrative” and some fairly meaningless outreach to critics such as Dr. Steve Novella, Dr. Kimball Atwood IV, and myself. (Unfortunately, she also met with homeopaths.) From what I can see, with Dr. Langevin’s ascension, NCCIH started to revert back to its old ways, “integrating” more pseudoscience into medicine. Before I tell you what I mean, let’s go back to when I discussed how longtime antivax activist Robert F. Kennedy, Jr. had suspended his presidential campaign in order to endorse Donald Trump for President. The two of them cooked up a health-related slogan that, if you know anything about RFK Jr. or Trump, will make you laugh: “Make America healthy again,” or MAHA. When I discussed it in detail three weeks ago, I noted that RFK Jr. had assiduously left out any mention of his signature health-related issue for the last two decades, namely fear mongering about vaccines as a supposed cause of autism and chronic disease in children and adults, to focus on a plan whose points ranged from the defensible (curtailing undue regulatory capture of regulatory agencies by big pharmaceutical companies) to the usual bonkers claims that today’s children represent the “sickest generation” to proposals like: Devote half of research budgets from the NIH toward preventive, alternative and holistic approaches to health. In the current system, researchers don’t have enough incentive to study generic drugs and root-cause therapies that look at things like diet. In other words, give NCCIH half of the NIH budget, as opposed to its 2024 appropriation of $174 million (compared to the overall 2024 NIH budget of $48.8 billion). Unless Congress were to double the NIH budget, that would mean massive cuts in all the science-based programs run by the NIH to accommodate the shift towards studying quackery. Another of RFK Jr.’s proposals involved functional medicine: Require nutrition classes and functional medicine in federally funded medical schools. Today, 7 out of 10 of the leading killers of Americans are chronic diseases that are preventable, sometimes through improved eating habits. Yet about 80% of medical schools don’t require a course in nutrition. As I noted at the time, RFK Jr. yoked a relatively unobjectionable idea (depending on the specifics, of course) that increasing the teaching of nutrition in medical schools might be desirable to the pure quackery that is functional medicine, or, as I like to call it, reams of useless tests in one hand and a huge invoice in the other. I also noted that his complaint that there isn’t a specific class on nutrition in many medical schools was a bit deceptive. There are a lot of topics that we cover in medical school for which there is no specific class but instead the topic is covered in multiple classes, with a lot of time dedicated to it in different classes in different contexts. I also note that the late Dr. Harriet Hall once wrote about how in 2014 the American Academy of Family Physicians (AAFP) placed a moratorium on continuing medical education (CME) credit for all programs related to Functional Medicine (FM) through 2018 because of “a lack of accompanying evidence existed to support the practice of Functional Medicine . . . [and the AAFP] identified some treatments as harmful and dangerous.” Unfortunately (and, sadly, predictably) the AAFP reversed itself in 2018, although it did decide to determine what functional medicine courses could be eligible depending on the specific topics, part of its general drift towards more tolerance of “integrative medicine” quackery. Amusingly, but unfortunately ineffectively, pathologists at The Cleveland Clinic, one of the most egregious quackademic supporters of functional medicine, called out the “specialty” for worthless genetic testing and prescribing of supplements. All of this brings me to note that the NIH is already cozying up with functional medicine quacks, as I discovered three months ago in a post by NCCIH Director Dr. Langevin entitled New Coalition Is Another Stepping Stone Toward Whole Person Health. Let’s take a look. NCCIH Coalition for Whole Person Health: Run by a functional medicine quack In June, Dr. Langevin announced a new NCCIH initiative that she sounded quite proud of: I am proud of the progress that the National Center for Complementary and Integrative Health (NCCIH) has made, taking distinct steps toward supporting the health of the whole person. Not only did we prioritize whole person health within NCCIH by incorporating it into our strategic plan, but we have also taken the lead in engaging colleagues within the National Institutes of Health (NIH) and stakeholders outside of NIH to encourage a wider conversation on integrating a whole person approach into research. Additionally, we defined a framework for discussion and fostered the necessary work to develop research methods that support increasingly complex studies on whole person health.  Now, I am excited to announce a new endeavor that will help to engage patients, health care professionals, and researchers, called the NCCIH Coalition for Whole Person Health (the Coalition). This independent coalition of nonprofit organizations will allow interested stakeholders to coalesce under a common umbrella to discuss challenges and opportunities in the research field related to delivering whole person care to individuals. The Coalition will represent perspectives of patients, communities, and professionals about the importance of whole person research, interprofessional collaboration, and keeping people and patients at the center of the conversation. NCCIH will interact with the Coalition through events such as scientific meetings, retreats, roundtable discussions, webinars, and listening sessions, including an inaugural meeting this fall. Interactions with the Coalition’s volunteer representatives will foster information sharing, bring valuable external perspectives to NCCIH’s work, and, conversely, ensure that stakeholders are aware of and can amplify NCCIH’s research. This two-way flow of information and forum for collaboration will help to tackle important challenges related to the work of advancing research on whole person health, such as building greater research capacity, fostering interprofessional collaboration, and identifying the most promising areas of research. Note the common trope used by proponents of “integrative health” or “integrative medicine,” namely that conventional science-based medicine is not “holistic” and does not treat the “whole person.” As I like to say, a good science-based physician in primary care, internal medicine, family practice, pediatrics, or any specialty involved in primary care already delivers “whole person care” to their patients. It’s a false dichotomy that I’ve long complained about, namely the claim that as a physician you have to embrace quackery in order to provide “holistic” or “whole person” care, which is utter nonsense. True, far be it from me to deny that physicians can fall short of this ideal, largely because the current reimbursement model for medicine tends to make it very difficult for primary care doctors to earn an income if they don’t see lots and lots of patients, limiting the time spent with each one. My response to this complaint is that the solution is to fix the system and reimburse primary care docs enough to be able to afford to spend more time with each patient, something that the vast majority of doctors would appreciate, not to outsource “holistic” or “whole person” care to quacks like naturopaths and functional medicine doctors, most of whom can charge whatever the market will bear because they are not reimbursed by health insurance. For example, in 2021 NCCIH published on its website, Whole Person Health: What It Is and Why It’s Important: Whole person health involves looking at the whole person—not just separate organs or body systems—and considering multiple factors that promote either health or disease. It means helping and empowering individuals, families, communities, and populations to improve their health in multiple interconnected biological, behavioral, social, and environmental areas. Instead of just treating a specific disease, whole person health focuses on restoring health, promoting resilience, and preventing diseases across a lifespan. See what I mean? Again, a good science-based primary care doctor already does most of this, and as for the rest (communities, etc.), a good science-based public health program will help as well. But let’s get back to one thing: Why do I keep harping on functional medicine? This is why. Look who will be leading the Coalition: The Coalition will be led by two experienced professionals who are passionate about addressing the health challenges that patients face and the role that a whole person approach can play in meeting the health needs of people. Amy Mack, M.S.E.S./M.P.A., is chief executive officer of The Institute for Functional Medicine, and Samantha Simmons, M.P.H., is chief executive officer of the Academic Consortium for Integrative Medicine \u0026 Health. Together, they will serve as cochairs of the Coalition and lead a steering committee of eight founding member organizations.  The Institute for Functional Medicine (IFM)? You might remember that we at SBM have been writing about the quackery promoted by IFM going back nearly to the beginning of this blog, when the late great Dr. Wally Sampson first asked just what the heck “functional medicine” even was, finding copious examples of quackery and scientific nonsense on the IFM website. I myself once called “functional medicine” the ultimate misnomer in the world of integrative medicine, because of how it combines one of the worst features of conventional science-based medicine (namely overtesting and overtreatment based on that overcasting) with some of the worst quackery you can imagine, including naturopathy and even homeopathy. There’s a reason that in another post I referred to functional medicine as “reams of useless tests in one hand, a huge invoice in the other,” a play on the famous description of homeopathy by the comic duo Mitchel \u0026 Webb: When someone comes in with a vague sense of unease or a touch of the nerves or even just more money than sense, you’ll be there for them, a bottle of basically just water in one hand, and a huge invoice in the other. Heck, even though the main topic of this post is functional medicine and not homeopathy, I can’t resist dropping a video of Mitchell \u0026 Webb’s famous “Homeopathic A\u0026E” sketch into this post before moving on: Always a classic, and I’ll use any excuse to include this in a post, no matter how tangential. As I noted in my post, in my functional medicine version of this sketch, all I’d change would be the part about a “bottle of basically just water in one hand, a huge invoice in the other,” for which I’d substitute something like “reams of useless and impossible-to-interpret lab results with a plan to correct each and every one of them in one hand, a huge invoice in the other.” That basically sums up functional medicine. But has functional medicine changed, or, more specifically, has IFM changed? Who knows? Maybe it’s more scientific now, worthy of teaming up with a major NIH center. IFM: NCCIH’s new partner in promoting functional medicine and “whole person medicine” It’s been several years since I’ve perused the website of The Institute for Functional Medicine. Perusing the leadership page of IFM, I did indeed find it odd that the leadership of IFM contains only one MD. The rest of the membership consists of a naturopath and an MPH, with the rest being mostly laypeople, led by Amy R. Mack: Amy holds a BS degree in Biology and master’s degrees in Public Affairs and Environmental Science. Amy spent the last 30 years in mission and service-oriented organizations focused on empowering individuals and community to drive systems change. As the daughter of a gastroenterologist, Amy understands the importance of patient engagement in their own health and witnessed the sacrifices of a physician in the search for good medicine. Today she pulls from these experiences to lead IFM in its mission of ensuring the widespread adoption of functional medicine. But she is a daughter of a gastroenterologist! Let’s just take a look at the “functional medicine model.” Hopefully longtime readers will forgive me if this is a bit repetitive of what I’ve written before, but I do feel the need every so often to reiterate our objections to functional medicine. Looking over the IFM website, I can’t help but note that a lot of what used to be public information is now either restricted content on members-only pages or otherwise unfindable. A lot of it seems to have been incorporated into a series of courses, some free, most paid. So I will use Archive.org when needed, for example, to refer to this page What Is Functional Medicine? Here’ are a couple of excerpts. First, here are its main principles: Functional medicine is personalized medicine that deals with primary prevention and underlying causes instead of symptoms for serious chronic disease. It is a science-based field of health care that is grounded in the following principles: Biochemical individuality describes the importance of individual variations in metabolic function that derive from genetic and environmental differences among individuals. Patient-centered medicine emphasizes “patient care” rather than “disease care,” following Sir William Osler’s admonition that “It is more important to know what patient has the disease than to know what disease the patient has.” Dynamic balance of internal and external factors. Web-like interconnections of physiological factors – an abundance of research now supports the view that the human body functions as an orchestrated network of interconnected systems, rather than individual systems functioning autonomously and without effect on each other. For example, we now know that immunological dysfunctions can promote cardiovascular disease, that dietary imbalances can cause hormonal disturbances, and that environmental exposures can precipitate neurologic syndromes such as Parkinson’s disease. Health as a positive vitality – not merely the absence of disease. Promotion of organ reserve as the means to enhance health span. In any post about functional medicine, I feel compelled to remind our readers that the very first principle is, in essence, functional medicine’s “get out of jail free” card for basically anything its practitioners want to do. They can always find ways to justify any form of treatment, be it science-based or quackery, simply by invoking the “biochemical individuality” of the human being they are treating. I also like to remind my readers of my retort to this: Yes, human beings are individuals, and each human being is unique. However, we’re not so unique that our bodies don’t all work pretty much the same way. In other words, in terms of biology, physiology, and yes, systems biology, human beings are far more alike than they are different. If that weren’t the case, modern medicine, developed before we had the tools to probe our genetic individuality, wouldn’t work as well as it does. FM fetishizes “biochemical individuality,” not so much because humans are so incredibly different that each one absolutely has to have a markedly different treatment. We’re not. Functional medicine fetishizes “individuality” because it distinguishes functional medicine as a brand from science-based medicine and, I suspect, because it makes its practitioners feel good, like “total” doctors never at a loss for an explanation for a patient’s symptoms or clinical condition, and makes patients feel like special snowflakes whose every bit of “individuality” is being catered to. As for the last bit about FM being a “science-using” profession, FM “uses” science more as a means of justifying whatever its practitioners do rather than guiding them to scientifically-proven treatments. Also, functional medicine is all about the “imbalances”: Functional medicine is anchored by an examination of the core clinical imbalances that underlie various disease conditions. Those imbalances arise as environmental inputs such as diet, nutrients (including air and water), exercise, and trauma are processed by one’s body, mind, and spirit through a unique set of genetic predispositions, attitudes, and beliefs. The fundamental physiological processes include communication, both outside and inside the cell; bioenergetics, or the transformation of food into energy; replication, repair, and maintenance of structural integrity, from the cellular to the whole body level; elimination of waste; protection and defense; and transport and circulation. The core clinical imbalances that arise from malfunctions within this complex system include: Hormonal and neurotransmitter imbalances Oxidation-reduction imbalances and mitochondropathy Detoxification and biotransformational imbalances Immune imbalances Inflammatory imbalances Digestive, absorptive, and microbiological imbalances Structural imbalances from cellular membrane function to the musculoskeletal system Imbalances such as these are the precursors to the signs and symptoms by which we detect and label (diagnose) organ system disease. Improving balance – in the patient’s environmental inputs and in the body’s fundamental physiological processes – is the precursor to restoring health and it involves much more than treating the symptoms. Functional medicine is dedicated to improving the management of complex, chronic disease by intervening at multiple levels to address these core clinical imbalances and to restore each patient’s functionality and health. Functional medicine is not a unique and separate body of knowledge. It is grounded in scientific principles and information widely available in medicine today, combining research from various disciplines into highly detailed yet clinically relevant models of disease pathogenesis and effective clinical management. Functional medicine emphasizes a definable and teachable process of integrating multiple knowledge bases within a pragmatic intellectual matrix that focuses on functionality at many levels, rather than a single treatment for a single diagnosis. Functional medicine uses the patient’s story as a key tool for integrating diagnosis, signs and symptoms, and evidence of clinical imbalances into a comprehensive approach to improve both the patient’s environmental inputs and his or her physiological function. It is a clinician’s discipline, and it directly addresses the need to transform the practice of primary care. No. It is not a clinician’s discipline, and it does not address the “need to transform the practice of primary care.” Also, does the focus on “imbalances” remind you of anything? How about “imbalances” in the four humors? Or “imbalances” in the Five Elements in traditional Chinese medicine. Basically, functional medicine also fetishizes “balance” in a way that sounds very much like both ancient Asian and European medicine.  In fairness, here I generally mention that there are some things that functional medicine (sort of) gets right, although these things tend to be no different than the sorts of things every primary care doctor should be getting right anyway, such as emphasizing healthy lifestyles, good nutrition, enough exercise, adequate sleep, cessation of habits known to be deleterious to health (e.g., smoking). Functional medicine also claims to emphasize prevention, which is a good thing as far as it goes, but again something that good primary care doctors do anyway. Moreover, the functional version of “prevention” isn’t always in line with the SBM version of prevention. Where functional medicine doctors go so very wrong is in what Grant Ritchey once described as a major unstated premise. That premise is that functional really does address the root causes of disease better than conventional medicine. It also also encompasses a lot of quackery, such as acupuncture, chiropractic adjustments, and especially “detoxification” programs. No wonder it’s a perfect partner for NCCIH. The other perfect partner for NCCIH is the Academic Consortium for Integrative Medicine and Health, led by the other co-chair of the NCCIH Coalition for Whole Person Health, Samantha Simmons, MPH. You’ll recall that the ACIMH is one of the foremost organizations promoting quackademic medicine; i.e., the “integration” of quackery under the guise of “integrative health” and “integrative medicine” into academic medical centers. When last I wrote about NCCIH’s most recent strategic plan (from 2021-2025), I noted how the groundwork had been laid for “whole person health” that appealed to a traditional Chinese medicine framework for multimodality diagnoses and treatments but also pointed out that in “conventional” medicine, diagnoses are based on science, as is the “framework” that ties the interventions together in multimodality treatments, which is very much in contrast with traditional Chinese medicine. One notes that the report referred to TCM as being more “holistic.” The bottom line here is that “whole person health” and “whole person medicine” serve the same purpose that the “holistic” has always served among advocates of medicine that is not science-based, namely an excuse to bring in all manner of quackery in the name of being “holistic” (or treating the “whole person), particularly adding a dash of “biochemical individuality to justify doing whatever quackery a practitioner wants. And if Donald Trump wins and actually keeps his word to RFK Jr., look for the role of NCCIH and the quackery in the federal government to expand exponentially.",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2021/06/NCCIHLogo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003cp\u003e[\u003cem\u003e\u003cstrong\u003eEditor note:\u003c/strong\u003e Regular readers might—or might not have—noticed last Monday that, for the first time in more years than I can remember, I failed to post anything and didn’t even repost something from the archives or announce my absence. The explanation is unfortunately all too simple. The Sunday before, I spent something like 13 hours in the hall of at the emergency room of a local hospital with my father, who had called me early Sunday morning. (Fortunately, he’s OK now, but was admitted for a couple of days.) The exact nature of the medical problem that precipitated this ER visit is not something I’m going to discuss publicly other than to note that our ER sojourn made it impossible for me to complete a post by Monday and that, unfortunately, no one could fill in at the last moment, not even Dr. Howard. In any case, I’m back. To get back into the groove, I thought I’d discuss something that’s been sitting in my fodder folder since June about \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e, because, well, you’ll see. Hint: It involves functional medicine.\u003c/em\u003e]\u003c/p\u003e\n\n\n\n\u003cp\u003eOn this blog, we have been very critical of the \u003ca href=\"https://sciencebasedmedicine.org/tag/national-center-for-complementary-and-integrative-health/\" title=\"\"\u003eNational Center for Complementary and Integrative Health\u003c/a\u003e (\u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e), which until several ago had gone under the name the National Center for Complementary and Alternative Medicine (which produced the easier-to-remember \u003cabbr title=\"National Center for Complementary and Alternative Medicine\"\u003eNCCAM\u003c/abbr\u003e). It was a rebranding that began a decade ago, when \u003cabbr title=\"National Center for Complementary and Alternative Medicine\"\u003eNCCAM\u003c/abbr\u003e director Dr. Josephine Briggs proposed renaming \u003cabbr title=\"National Center for Complementary and Alternative Medicine\"\u003eNCCAM\u003c/abbr\u003e (mainly because, wanting to be—or at least seem to be—all about the science, she didn’t like the word “alternative” in the name) and asked the public for suggestions. Unsurprisingly, I likened it to “\u003ca href=\"https://sciencebasedmedicine.org/nccam-tries-to-polish-a-turd/\" title=\"\"\u003epolishing a turd\u003c/a\u003e.” A few months later, \u003cabbr title=\"National Center for Complementary and Alternative Medicine\"\u003eNCCAM\u003c/abbr\u003e was \u003ca href=\"https://www.nccih.nih.gov/about/nccih-timeline\" title=\"\"\u003erebranded as \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e\u003c/a\u003e, the better to “integrate” quackery into health. A few years later, Dr. Briggs retired, to be \u003ca href=\"https://sciencebasedmedicine.org/nccih-has-a-new-director-and-shes-a-true-believer-in-acupuncture/\" title=\"\"\u003ereplaced by a true believer in acupuncture\u003c/a\u003e, \u003ca href=\"https://sciencebasedmedicine.org/tag/helene-langevin/\" title=\"Dr. Helene Langevin\"\u003eDr. Helene Langevin\u003c/a\u003e. Thus ended a ten year stint in which \u003cabbr title=\"National Center for Complementary and Alternative Medicine\"\u003eNCCAM\u003c/abbr\u003e tried to pivot to be more scientific, mainly by trying to rebrand lifestyle medicine such as diet and exercise as “alternative” or “integrative” and some fairly meaningless \u003ca href=\"https://sciencebasedmedicine.org/our-visit-with-nccam/\" title=\"\"\u003eoutreach to critic\u003c/a\u003es such as Dr. Steve Novella, Dr. Kimball Atwood IV, and myself. (Unfortunately, she also \u003ca href=\"https://sciencebasedmedicine.org/cam-believers-notice-our-visit-with-the-director-of-nccam/\" title=\"\"\u003emet with homeopaths\u003c/a\u003e.) From what I can see, with Dr. Langevin’s ascension, \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e started to \u003ca href=\"https://sciencebasedmedicine.org/nccih-strategic-plan-2021%E2%81%A0-%E2%81%A02025-meet-the-new-plan-same-as-the-old-plan/\" title=\"\"\u003erevert back to its old ways\u003c/a\u003e, “integrating” more pseudoscience into medicine.\u003c/p\u003e\n\n\n\n\u003cp\u003eBefore I tell you what I mean, let’s go back to when I discussed how longtime antivax activist Robert F. Kennedy, Jr. had suspended his presidential campaign in order to endorse Donald Trump for President. The two of them cooked up a health-related slogan that, if you know anything about RFK Jr. or Trump, will make you laugh: “Make America healthy again,” or MAHA. When I discussed it in detail three weeks ago, I noted that RFK Jr. had assiduously left out any mention of his signature health-related issue for the last two decades, namely fear mongering about vaccines as a supposed cause of autism and chronic disease in children and adults, to focus on a plan whose points ranged from the defensible (curtailing undue regulatory capture of regulatory agencies by big pharmaceutical companies) to the usual bonkers claims that today’s children represent the “sickest generation” to proposals like:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eDevote half of research budgets from the NIH toward preventive, alternative and holistic approaches to health. In the current system, researchers don’t have enough incentive to study generic drugs and root-cause therapies that look at things like diet.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIn other words, give \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e half of the NIH budget, as opposed to \u003ca href=\"https://crsreports.congress.gov/product/pdf/R/R43341\" title=\"\"\u003eits 2024 appropriation of $174 million\u003c/a\u003e (compared to the overall 2024 NIH budget of $48.8 billion). Unless Congress were to double the NIH budget, that would mean massive cuts in all the science-based programs run by the NIH to accommodate the shift towards studying quackery.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnother of RFK Jr.’s proposals involved functional medicine:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eRequire nutrition classes and functional medicine in federally funded medical schools. Today, 7 out of 10 of the leading killers of Americans are chronic diseases that are preventable, sometimes through improved eating habits. Yet about 80% of medical schools \u003ca href=\"https://archive.is/o/bFDeW/https://www.hsph.harvard.edu/news/hsph-in-the-news/nutrition-education-lacking-at-most-medical-schools/%23:~:text=A%202015%20survey%20of%20121,20%25%20required%20a%20nutrition%20course.\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edon’t require\u003c/a\u003e a course in nutrition.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAs I noted at the time, RFK Jr. yoked a relatively unobjectionable idea (depending on the specifics, of course) that increasing the teaching of nutrition in medical schools might be desirable to the pure quackery that is \u003ca href=\"https://sciencebasedmedicine.org/tag/functional-medicine/\"\u003efunctional medicine\u003c/a\u003e, or, as I like to call it, \u003ca href=\"https://sciencebasedmedicine.org/functional-medicine-reams-of-useless-tests-in-one-hand-a-huge-invoice-in-the-other/\"\u003ereams of useless tests in one hand and a huge invoice in the other\u003c/a\u003e. I also noted that his complaint that there isn’t a specific class on nutrition in many medical schools was a bit deceptive. There are a lot of topics that we cover in medical school for which there is no specific class but instead the topic is covered in multiple classes, with a lot of time dedicated to it in different classes in different contexts. I also note that the late Dr. Harriet Hall \u003ca href=\"https://sciencebasedmedicine.org/aafp-functional-medicine-lacks-supporting-evidence-includes-harmful-and-dangerous-treatments/\" title=\"\"\u003eonce wrote\u003c/a\u003e about how in 2014 the American Academy of Family Physicians (AAFP) \u003ca href=\"http://www.aafp.org/cme/creditsys/about/eligibility.html\"\u003eplaced a moratorium\u003c/a\u003e on continuing medical education (CME) credit for all programs related to Functional Medicine (FM) through 2018 because of “a lack of accompanying evidence existed to support the practice of Functional Medicine . . . [and the AAFP] identified some treatments as harmful and dangerous.” Unfortunately (and, sadly, predictably) the AAFP \u003ca href=\"https://www.aafp.org/news/education-professional-development/20180328functionalmed.html\" title=\"\"\u003ereversed itself in 2018\u003c/a\u003e, although it did decide to determine what functional medicine courses could be eligible depending on the specific topics, part of its \u003ca href=\"https://sciencebasedmedicine.org/american-academy-of-family-physicians-supports-integrative-medicine/\" title=\"\"\u003egeneral drift towards more tolerance\u003c/a\u003e of “integrative medicine” quackery. Amusingly, but unfortunately ineffectively, pathologists at The Cleveland Clinic, one of the \u003ca href=\"https://sciencebasedmedicine.org/cleveland-clinic-publishes-functional-medicine/\" title=\"\"\u003emost egregious quackademic supporters of functional medicine\u003c/a\u003e, \u003ca href=\"https://sciencebasedmedicine.org/cleveland-clinic-genetic-experts-call-out-functional-medicine-on-worthless-genetic-testing-and-supplement-prescribing/\" title=\"\"\u003ecalled out the “specialty”\u003c/a\u003e for worthless genetic testing and prescribing of supplements.\u003c/p\u003e\n\n\n\n\u003cp\u003eAll of this brings me to note that the NIH is already cozying up with functional medicine quacks, as I discovered three months ago in a post by \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e Director Dr. Langevin entitled \u003ca href=\"https://www.nccih.nih.gov/about/offices/od/director/past-messages/new-coalition-is-another-stepping-stone-toward-whole-person-health\" title=\"\"\u003eNew Coalition Is Another Stepping Stone Toward Whole Person Health\u003c/a\u003e. Let’s take a look.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e Coalition for Whole Person Health: Run by a functional medicine quack\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn June, Dr. Langevin \u003ca href=\"https://www.nccih.nih.gov/about/offices/od/director/past-messages/new-coalition-is-another-stepping-stone-toward-whole-person-health\" title=\"\"\u003eannounced a new \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e initiative\u003c/a\u003e that she sounded quite proud of:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eI am proud of the progress that the National Center for Complementary and Integrative Health (\u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e) has made, taking distinct steps toward supporting the health of the whole person. Not only did we prioritize whole person health within \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e by incorporating it into our strategic plan, but we have also taken the lead in engaging colleagues within the National Institutes of Health (NIH) and stakeholders outside of NIH to encourage a wider conversation on integrating a whole person approach into research. Additionally, we defined a framework for discussion and fostered the necessary work to develop research methods that support increasingly complex studies on whole person health. \u003c/p\u003e\n\n\n\n\u003cp\u003eNow, I am excited to announce a new endeavor that will help to engage patients, health care professionals, and researchers, called the \u003ca href=\"https://www.nccih.nih.gov/about/partnerships/nccih-coalition-for-whole-person-health\"\u003e\u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e Coalition for Whole Person Health (the Coalition)\u003c/a\u003e. This independent coalition of nonprofit organizations will allow interested stakeholders to coalesce under a common umbrella to discuss challenges and opportunities in the research field related to delivering whole person care to individuals. The Coalition will represent perspectives of patients, communities, and professionals about the importance of whole person research, interprofessional collaboration, and keeping people and patients at the center of the conversation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e will interact with the Coalition through events such as scientific meetings, retreats, roundtable discussions, webinars, and listening sessions, including an inaugural meeting this fall. Interactions with the Coalition’s volunteer representatives will foster information sharing, bring valuable external perspectives to \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e’s work, and, conversely, ensure that stakeholders are aware of and can amplify \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e’s research. This two-way flow of information and forum for collaboration will help to tackle important challenges related to the work of advancing research on whole person health, such as building greater research capacity, fostering interprofessional collaboration, and identifying the most promising areas of research.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eNote the common trope used by proponents of “integrative health” or “integrative medicine,” namely that conventional science-based medicine is not “holistic” and does not treat the “whole person.” As I like to say, a good science-based physician in primary care, internal medicine, family practice, pediatrics, or any specialty involved in primary care already delivers “whole person care” to their patients. It’s a false dichotomy that I’ve long complained about, namely the claim that as a physician you have to embrace quackery in order to provide “holistic” or “whole person” care, which is utter nonsense. True, far be it from me to deny that physicians can fall short of this ideal, largely because the current reimbursement model for medicine tends to make it very difficult for primary care doctors to earn an income if they don’t see lots and lots of patients, limiting the time spent with each one. My response to this complaint is that the solution is to fix the system and reimburse primary care docs enough to be able to afford to spend more time with each patient, something that the vast majority of doctors would appreciate, not to outsource “holistic” or “whole person” care to quacks like naturopaths and functional medicine doctors, most of whom can charge whatever the market will bear because they are not reimbursed by health insurance.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, in 2021 \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e published on its website, Whole Person Health: What It Is and Why It’s Important:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhole person health involves looking at the whole person—not just separate organs or body systems—and considering multiple factors that promote either health or disease. It means helping and empowering individuals, families, communities, and populations to improve their health in multiple interconnected biological, behavioral, social, and environmental areas. Instead of just treating a specific disease, whole person health focuses on restoring health, promoting resilience, and preventing diseases across a lifespan.\u003c/p\u003e\n\n\n\n\u003cp\u003eSee what I mean? Again, a good science-based primary care doctor already does most of this, and as for the rest (communities, etc.), a good science-based public health program will help as well.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eBut let’s get back to one thing: Why do I keep harping on functional medicine? This is why. Look who will be leading the Coalition:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe Coalition will be led by two experienced professionals who are passionate about addressing the health challenges that patients face and the role that a whole person approach can play in meeting the health needs of people. Amy Mack, M.S.E.S./M.P.A., is chief executive officer of The Institute for Functional Medicine, and Samantha Simmons, M.P.H., is chief executive officer of the Academic Consortium for Integrative Medicine \u0026amp; Health. Together, they will serve as cochairs of the Coalition and lead a steering committee of eight founding member organizations. \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThe Institute for Functional Medicine (IFM)? You might remember that we at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e have been \u003ca href=\"https://sciencebasedmedicine.org/tag/institute-for-functional-medicine/\" title=\"\"\u003ewriting about the quackery promoted by IFM\u003c/a\u003e going back nearly to the beginning of this blog, when the late great Dr. Wally Sampson first asked \u003ca href=\"https://sciencebasedmedicine.org/fuctional-medicine-fm-what-is-it/\" title=\"\"\u003ejust what the heck “functional medicine” even was\u003c/a\u003e, finding copious examples of quackery and scientific nonsense on the IFM website. I myself once called “functional medicine” the \u003ca href=\"https://sciencebasedmedicine.org/functional-medicine-the-ultimate-misnomer-in-the-world-of-integrative-medicine/\" title=\"\"\u003eultimate misnomer in the world of integrative medicine\u003c/a\u003e, because of how it combines one of the worst features of conventional science-based medicine (namely overtesting and overtreatment based on that overcasting) with some of the worst quackery you can imagine, including naturopathy and even homeopathy. There’s a reason that in another post I referred to functional medicine as “\u003ca href=\"https://sciencebasedmedicine.org/functional-medicine-reams-of-useless-tests-in-one-hand-a-huge-invoice-in-the-other/\" title=\"\"\u003ereams of useless tests in one hand, a huge invoice in the other\u003c/a\u003e,” a play on the famous description of homeopathy by the comic duo Mitchel \u0026amp; Webb:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eWhen someone comes in with a vague sense of unease or a touch of the nerves or even just more money than sense, you’ll be there for them, a bottle of basically just water in one hand, and a huge invoice in the other.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHeck, even though the main topic of this post is functional medicine and not homeopathy, I can’t resist dropping a video of Mitchell \u0026amp; Webb’s famous “Homeopathic A\u0026amp;E” sketch into this post before moving on:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Homeopathic A\u0026amp;E\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/cLoMGb5CaXE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003cfigcaption\u003eAlways a classic, and I’ll use any excuse to include this in a post, no matter how tangential.\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAs I noted in my \u003ca href=\"https://sciencebasedmedicine.org/functional-medicine-reams-of-useless-tests-in-one-hand-a-huge-invoice-in-the-other/\" title=\"\"\u003epost\u003c/a\u003e, in my functional medicine version of this sketch, all I’d change would be the part about a “bottle of basically just water in one hand, a huge invoice in the other,” for which I’d substitute something like “reams of useless and impossible-to-interpret lab results with a plan to correct each and every one of them in one hand, a huge invoice in the other.” That basically sums up functional medicine.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut has functional medicine changed, or, more specifically, has IFM changed? Who knows? Maybe it’s more scientific now, worthy of teaming up with a major NIH center. \u003c/p\u003e\n\n\n\n\u003ch2\u003eIFM: \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e’s new partner in promoting functional medicine and “whole person medicine”\u003c/h2\u003e\n\n\n\n\u003cp\u003eIt’s been several years since I’ve perused the website of \u003ca href=\"https://www.ifm.org\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"\u003eThe Institute for Functional Medicine\u003c/a\u003e. Perusing the leadership page of IFM, I did indeed find it odd that the leadership of IFM contains only one MD. The rest of the membership consists of a naturopath and an MPH, with the rest being mostly laypeople, led by \u003ca href=\"https://www.ifm.org/about/profile/amy-r-mack/\" title=\"\"\u003eAmy R. Mack\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eAmy holds a BS degree in Biology and master’s degrees in Public Affairs and Environmental Science. Amy spent the last 30 years in mission and service-oriented organizations focused on empowering individuals and community to drive systems change. As the daughter of a gastroenterologist, Amy understands the importance of patient engagement in their own health and witnessed the sacrifices of a physician in the search for good medicine. Today she pulls from these experiences to lead IFM in its mission of ensuring the widespread adoption of functional medicine.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eBut she is a daughter of a gastroenterologist!\u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s just take a look at the “functional medicine model.” Hopefully longtime readers will forgive me if this is a bit repetitive of what I’ve written before, but I do feel the need every so often to reiterate our objections to functional medicine. Looking over the IFM website, I can’t help but note that a lot of what used to be public information is now either restricted content on members-only pages or otherwise unfindable. A lot of it seems to have been incorporated into a series of courses, some free, most paid. So I will use Archive.org when needed, for example, to refer to this page \u003ca href=\"https://web.archive.org/web/20090220132250/http://www.functionalmedicine.org/about/whatis.asp\" title=\"\"\u003eWhat Is Functional Medicine?\u003c/a\u003e  Here’ are a couple of excerpts. First, here are its main principles:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\nFunctional medicine is personalized medicine that deals with primary prevention and underlying causes instead of symptoms for serious chronic disease. It is a science-based field of health care that is grounded in the following principles:\n\u003cul\u003e\n\t\u003cli\u003e\u003cstrong\u003eBiochemical individuality\u003c/strong\u003e describes the importance of individual variations in metabolic function that derive from genetic and environmental differences among individuals.\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003ePatient-centered medicine\u003c/strong\u003e emphasizes “patient care” rather than “disease care,” following Sir William Osler’s admonition that “It is more important to know what patient has the disease than to know what disease the patient has.”\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eDynamic balance\u003c/strong\u003e of internal and external factors.\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eWeb-like interconnections of physiological factors\u003c/strong\u003e – an abundance of research now supports the view that the human body functions as an orchestrated network of interconnected systems, rather than individual systems functioning autonomously and without effect on each other. For example, we now know that immunological dysfunctions can promote cardiovascular disease, that dietary imbalances can cause hormonal disturbances, and that environmental exposures can precipitate neurologic syndromes such as Parkinson’s disease.\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eHealth as a positive vitality\u003c/strong\u003e – not merely the absence of disease.\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003ePromotion of organ reserve\u003c/strong\u003e as the means to enhance health span.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eIn any post about functional medicine, I feel compelled to remind our readers that the very first principle is, in essence, functional medicine’s “get out of jail free” card for basically anything its practitioners want to do. They can always find ways to justify \u003cem\u003eany\u003c/em\u003e form of treatment, be it science-based or quackery, simply by invoking the “biochemical individuality” of the human being they are treating. I also like to remind my readers of my retort to this: Yes, human beings are individuals, and each human being is unique. However, we’re not \u003cem\u003eso\u003c/em\u003e unique that our bodies don’t all work pretty much the same way. In other words, in terms of biology, physiology, and yes, systems biology, human beings are far more alike than they are different. If that weren’t the case, modern medicine, developed before we had the tools to probe our genetic individuality, wouldn’t work as well as it does. FM fetishizes “biochemical individuality,” not so much because humans are so incredibly different that each one absolutely has to have a markedly different treatment. We’re not. Functional medicine fetishizes “individuality” because it distinguishes functional medicine as a brand from science-based medicine and, I suspect, because it makes its practitioners feel good, like “total” doctors never at a loss for an explanation for a patient’s symptoms or clinical condition, and makes patients feel like special snowflakes whose every bit of “individuality” is being catered to. As for the last bit about FM being a “science-using” profession, FM “uses” science more as a means of justifying whatever its practitioners do rather than guiding them to scientifically-proven treatments.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlso, functional medicine is all about the “imbalances”:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003eFunctional medicine \u003c/strong\u003eis anchored by an examination of the core clinical imbalances that underlie various disease conditions. Those imbalances arise as \u003cstrong\u003eenvironmental inputs\u003c/strong\u003e such as diet, nutrients (including air and water), exercise, and trauma \u003cstrong\u003eare processed\u003c/strong\u003e by one’s body, mind, and spirit through a unique set of genetic predispositions, attitudes, and beliefs. The \u003cstrong\u003efundamental physiological processes\u003c/strong\u003e include communication, both outside and inside the cell; bioenergetics, or the transformation of food into energy; replication, repair, and maintenance of structural integrity, from the cellular to the whole body level; elimination of waste; protection and defense; and transport and circulation. The \u003cstrong\u003ecore clinical imbalances\u003c/strong\u003e that arise from malfunctions within this complex system include:\u003c/p\u003e\n\u003cul\u003e\n\t\u003cli\u003e\u003cstrong\u003eHormonal and neurotransmitter imbalances\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eOxidation-reduction imbalances and mitochondropathy\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eDetoxification and biotransformational imbalances\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eImmune imbalances\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eInflammatory imbalances\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eDigestive, absorptive, and microbiological imbalances\u003c/strong\u003e\u003c/li\u003e\n\t\u003cli\u003e\u003cstrong\u003eStructural imbalances from cellular membrane function to the musculoskeletal system\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eImbalances such as these are the precursors to the signs and symptoms by which we detect and label (diagnose) organ system disease. Improving balance – in the patient’s environmental inputs and in the body’s fundamental physiological processes – is the precursor to restoring health and it involves much more than treating the symptoms. Functional medicine is dedicated to improving the management of complex, chronic disease by intervening at multiple levels to address these core clinical imbalances and to restore each patient’s functionality and health. Functional medicine is not a unique and separate body of knowledge. It is grounded in scientific principles and information widely available in medicine today, combining research from various disciplines into highly detailed yet clinically relevant models of disease pathogenesis and effective clinical management.\u003c/p\u003e\n\u003cp\u003eFunctional medicine emphasizes a definable and teachable process of integrating multiple knowledge bases within a pragmatic intellectual matrix that focuses on functionality at many levels, rather than a single treatment for a single diagnosis. Functional medicine uses the patient’s story as a key tool for integrating diagnosis, signs and symptoms, and evidence of clinical imbalances into a comprehensive approach to improve both the patient’s environmental inputs and his or her physiological function. It is a clinician’s discipline, and it directly addresses the need to transform the practice of primary care.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eNo. It is not a clinician’s discipline, and it does not address the “need to transform the practice of primary care.” Also, does the focus on “imbalances” remind you of anything? How about “imbalances” in the four humors? Or “imbalances” in the Five Elements in traditional Chinese medicine. Basically, functional medicine also fetishizes “balance” in a way that sounds very much like both ancient Asian and European medicine. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn fairness, here I generally mention that  there are some things that functional medicine (sort of) gets right, although these things tend to be no different than the sorts of things every primary care doctor should be getting right anyway, such as emphasizing healthy lifestyles, good nutrition, enough exercise, adequate sleep, cessation of habits known to be deleterious to health (e.g., smoking). Functional medicine also claims to emphasize prevention, which is a good thing as far as it goes, but again something that good primary care doctors do anyway. Moreover, the functional version of “prevention” isn’t always in line with the \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e version of prevention. Where functional medicine doctors go so very wrong is in what \u003ca href=\"https://www.sciencebasedmedicine.org/dys-functional-medicine-comes-to-dentistry/\"\u003eGrant Ritchey once described\u003c/a\u003e as a major unstated premise. That premise is that functional really does address the root causes of disease better than conventional medicine. It also also encompasses a lot of quackery, such as acupuncture, chiropractic adjustments, and especially “detoxification” programs.\u003c/p\u003e\n\n\n\n\u003cp\u003eNo wonder it’s a perfect partner for \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe other perfect partner for \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e is the Academic Consortium for Integrative Medicine and Health, led by the other co-chair of the \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e Coalition for Whole Person Health, Samantha Simmons, MPH. You’ll recall that the \u003cabbr title=\"Academic Consortium for Integrative Medicine and Health\"\u003eACIMH\u003c/abbr\u003e is one of the foremost organizations promoting quackademic medicine; i.e., the “integration” of quackery under the guise of “integrative health” and “integrative medicine” into academic medical centers.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen last I wrote about \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e’s most recent strategic plan (from 2021-2025), I \u003ca href=\"https://sciencebasedmedicine.org/nccih-strategic-plan-2021%E2%81%A0-%E2%81%A02025-meet-the-new-plan-same-as-the-old-plan/\" title=\"\"\u003enoted how the\u003c/a\u003e groundwork had been laid for “whole person health” that appealed to a traditional Chinese medicine framework for multimodality diagnoses and treatments but also pointed out that in “conventional” medicine, diagnoses are based on science, as is the “framework” that ties the interventions together in multimodality treatments, which is very much in contrast with traditional Chinese medicine. One notes that the report referred to TCM as being more “holistic.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe bottom line here is that “whole person health” and “whole person medicine” serve the same purpose that the “holistic” has always served among advocates of medicine that is not science-based, namely an excuse to bring in all manner of quackery in the name of being “holistic” (or treating the “whole person), particularly adding a dash of “biochemical individuality to justify doing whatever quackery a practitioner wants.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if Donald Trump wins and actually keeps his word to RFK Jr., look for the role of \u003cabbr title=\"National Center for Complementary and Integrative Health\"\u003eNCCIH\u003c/abbr\u003e and the quackery in the federal government to expand exponentially.\u003c/p\u003e\n                \n                    \n\n                    \n                    \n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "25 min read",
  "publishedTime": "2024-09-30T03:00:00-04:00",
  "modifiedTime": "2024-10-06T11:34:58Z"
}
