{
  "id": "f8594cd9-c3f4-4e31-85a6-8a28fc5578c4",
  "title": "How we treat catchment water to make it safe to drink",
  "link": "https://phys.org/news/2025-01-catchment-safe.html",
  "description": "Most of us are fortunate that, when we turn on the tap, clean, safe and high-quality water comes out.",
  "author": "",
  "published": "Sun, 26 Jan 2025 13:00:01 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Environment"
  ],
  "byline": "Mark Patrick Taylor, Antti Mikkonen, Minna Saaristo",
  "length": 6953,
  "excerpt": "Most of us are fortunate that, when we turn on the tap, clean, safe and high-quality water comes out.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Unsplash/CC0 Public Domain Most of us are fortunate that, when we turn on the tap, clean, safe and high-quality water comes out. But a senate inquiry into the presence of PFAS or \"forever chemicals\" is putting the safety of our drinking water back in the spotlight. Lidia Thorpe, the independent senator leading the inquiry, says Elders in the Aboriginal community of Wreck Bay in New South Wales are \"buying bottled water out of their aged care packages\" due to concerns about the health impacts of PFAS in their drinking water. So, how is water deemed safe to drink in Australia? And why does water quality differ in some areas? Here's what happens between a water catchment and your tap. Human intervention in the water cycle There is no \"new\" water on Earth. The water we drink can be up to 4.5 billion years old and is continuously recycled through the hydrological cycle. This transfers water from the ground to the atmosphere through evaporation and back again (for example, through rain). Humans interfere with this natural cycle by trapping and redirecting water from various sources to use. A lot happens before it reaches your home. The quality of the water when you turn on the tap depends on a range of factors, including the local geology, what kind of activities happen in catchment areas, and the different treatments used to process it. How do we decide what's safe? The Australian Drinking Water Guidelines define what is considered safe, good-quality drinking water. The guidelines set acceptable water quality values for more than 250 physical, chemical and bacterial contaminants. They take into account any potential health impact of drinking the contaminant over a lifetime as well as aesthetics—the taste and color of the water. The guidelines are not mandatory but provide the basis for determining if the quality of water to be supplied to consumers in all parts of Australia is safe to drink. The guidelines undergo rolling revision to ensure they represent the latest scientific evidence. From water catchment to tap Australians' drinking water mainly comes from natural catchments. Sources include surface water, groundwater and seawater (via desalination). Public access to these areas is typically limited to preserve optimal water quality. Filtration and purification of water occurs naturally in catchments as it passes through soil, sediments, rocks and vegetation. But catchment water is subject to further treatment via standard processes that typically focus on: removing particulates (for example, soil and sediment) filtration (to remove particles and their contaminants) disinfection (for example, using chlorine and chloramine to kill bacteria and viruses) adding fluoride to prevent tooth decay adjusting pH to balance the chemistry of the water and to aid filtration. This water is delivered to our taps via a reticulated system—a network of underground reservoirs, pipes, pumps and fittings. In areas where there is no reticulated system, drinking water can also be sourced from rainwater tanks. This means the quality of drinking water can vary. Sources of contamination can come from roof catchments feeding rainwater tanks as well from the tap due to lead in plumbing fittings and materials. So, does all water meet these standards? Some rural and remote areas, especially First Nations communities, rely on poor-quality surface water and groundwater for their drinking water. Rural and regional water can exceed recommended guidelines for salt, microbial contaminants and trace elements, such as lead, manganese and arsenic. The federal government and other agencies are trying to address this. There are many impacts of poor regional water quality. These include its implication in elevated rates of tooth decay in First Nations people. This occurs when access to chilled, sugary drinks is cheaper and easier than access to good quality water. What about PFAS? There is also renewed concern about the presence of PFAS or \"forever\" chemicals in drinking water. Recent research examining the toxicity of PFAS chemicals along with their presence in some drinking water catchments in Australia and overseas has prompted a recent assessment of water source contamination. A review by the National Health and Medical Research Council (NHMRC) proposed lowering the limits for four PFAS chemicals in drinking water: PFOA, PFOS, PFHxS and PFBS. The review used publicly available data and found most drinking water supplies are currently below the proposed new guideline values for PFAS. However, \"hotspots\" of PFAS remain where drinking water catchments or other sources (for example, groundwater) have been impacted by activities where PFAS has been used in industrial applications. And some communities have voiced concerns about an association between elevated PFAS levels in their communities and cancer clusters. While some PFAS has been identified as carcinogenic, it's not certain that PFAS causes cancer. The link is still being debated. Importantly, assessment of exposure levels from all sources in the population shows PFAS levels are falling meaning any exposure risk has also reduced over time. How about removing PFAS from water? Most sources of drinking water are not associated with industrial contaminants like PFAS. So water sources are generally not subject to expensive treatment processes, like reverse osmosis, that can remove most waterborne pollutants, including PFAS. These treatments are energy-intensive and expensive and based on recent water quality assessments by the NHMRC will not be needed. While contaminants are everywhere, it is the dose that makes the poison. Ultra-low concentrations of chemicals including PFAS, while not desirable, may not be harmful and total removal is not warranted. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: How we treat catchment water to make it safe to drink (2025, January 26) retrieved 26 January 2025 from https://phys.org/news/2025-01-catchment-safe.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/drinking-water-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/drinking-water-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/drinking-water-1.jpg\" data-sub-html=\"Credit: Unsplash/CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/drinking-water-1.jpg\" alt=\"drinking water\" title=\"Credit: Unsplash/CC0 Public Domain\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: Unsplash/CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eMost of us are fortunate that, when we turn on the tap, clean, safe and high-quality water comes out.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBut a \u003ca href=\"https://www.aph.gov.au/Parliamentary_Business/Committees/Senate/PFAS_per_and_polyfluoroalkyl_substances/PFAS\" target=\"_blank\"\u003esenate inquiry\u003c/a\u003e into the presence of PFAS or \u0026#34;forever chemicals\u0026#34; is putting the safety of our \u003ca href=\"https://phys.org/tags/drinking/\" rel=\"tag\"\u003edrinking\u003c/a\u003e water back in the spotlight.\u003c/p\u003e\n\u003cp\u003eLidia Thorpe, the independent senator leading the inquiry, \u003ca href=\"https://www.abc.net.au/listen/programs/radionational-breakfast/senate-inquiry-calls-for-far-reaching-pfas-ban/104848914\" target=\"_blank\"\u003esays\u003c/a\u003e Elders in the Aboriginal community of Wreck Bay in New South Wales are \u0026#34;buying bottled water out of their aged care packages\u0026#34; due to concerns about the health impacts of PFAS in their drinking water.\u003c/p\u003e\n\u003cp\u003eSo, how is water deemed safe to drink in Australia? And why does water quality differ in some areas?\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s what happens between a water catchment and your tap.\u003c/p\u003e\n\u003ch2\u003eHuman intervention in the water cycle\u003c/h2\u003e\n\u003cp\u003eThere is no \u0026#34;new\u0026#34; water on Earth. The water we drink can be up to \u003ca href=\"https://pubs.geoscienceworld.org/msa/elements/article-abstract/18/3/155/618795/We-Drink-Good-4-5-Billion-Year-Old-Water?redirectedFrom=fulltext\" target=\"_blank\"\u003e4.5 billion\u003c/a\u003e years old and is continuously recycled through the \u003ca href=\"https://www.noaa.gov/jetstream/atmosphere/hydro#:~:text=The%20hydrologic%20cycle%20involves%20the,evaporation\" target=\"_blank\"\u003ehydrological cycle\u003c/a\u003e. This transfers water from the ground to the atmosphere through evaporation and back again (for example, through rain).\u003c/p\u003e\n\u003cp\u003eHumans interfere with this natural cycle by trapping and redirecting water from various sources to use. A lot happens before it reaches your home.\u003c/p\u003e\n\u003cp\u003eThe quality of the water when you turn on the tap \u003ca href=\"https://doi.org/10.1029/2017WR022172\" target=\"_blank\"\u003edepends on a range of factors\u003c/a\u003e, including the local geology, what kind of activities happen in catchment areas, and the different treatments used to process it.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eHow do we decide what\u0026#39;s safe?\u003c/h2\u003e\n\u003cp\u003eThe \u003ca href=\"https://www.nhmrc.gov.au/about-us/publications/australian-drinking-water-guidelines\" target=\"_blank\"\u003eAustralian Drinking Water Guidelines\u003c/a\u003e define what is considered safe, good-quality drinking water.\u003c/p\u003e\n\u003cp\u003eThe guidelines set acceptable water quality values for more than 250 physical, chemical and bacterial contaminants. They take into account any potential health impact of drinking the contaminant over a lifetime as well as aesthetics—the taste and color of the water.\u003c/p\u003e\n\u003cp\u003eThe guidelines are not mandatory but provide the basis for determining if the quality of water to be supplied to consumers in all parts of Australia is safe to drink. The guidelines undergo rolling revision to ensure they represent the latest scientific evidence.\u003c/p\u003e\n\u003ch2\u003eFrom water catchment to tap\u003c/h2\u003e\n\u003cp\u003eAustralians\u0026#39; drinking water mainly comes from \u003ca href=\"https://australian.museum/get-involved/citizen-science/streamwatch/streamwatch-what-is-a-catchment/\" target=\"_blank\"\u003enatural catchments\u003c/a\u003e. Sources include \u003ca href=\"https://phys.org/tags/surface+water/\" rel=\"tag\"\u003esurface water\u003c/a\u003e, groundwater and seawater (via desalination).\u003c/p\u003e\n\u003cp\u003ePublic access to these areas is typically limited to \u003ca href=\"https://www.waternsw.com.au/water-services/catchment-protection/protected-and-special-areas\" target=\"_blank\"\u003epreserve optimal water quality\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFiltration and purification of water occurs \u003ca href=\"https://www.waterworld.com/residential-commercial/article/14309334/soil-earths-largest-natural-water-filter\" target=\"_blank\"\u003enaturally in catchments\u003c/a\u003e as it passes through soil, sediments, rocks and vegetation.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBut catchment water is subject to further treatment via \u003ca href=\"https://www.melbournewater.com.au/water-and-environment/water-management/water-quality/water-treatment\" target=\"_blank\"\u003estandard processes\u003c/a\u003e that typically focus on:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eremoving particulates (for example, soil and sediment)\u003c/li\u003e\n\u003cli\u003efiltration (to remove particles and their contaminants)\u003c/li\u003e\n\u003cli\u003edisinfection (for example, using chlorine and chloramine to kill bacteria and viruses)\u003c/li\u003e\n\u003cli\u003eadding fluoride to prevent tooth decay\u003c/li\u003e\n\u003cli\u003eadjusting pH to balance the chemistry of the water and to aid filtration.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis water is delivered to our taps via a reticulated system—a network of underground reservoirs, pipes, pumps and fittings.\u003c/p\u003e\n\u003cp\u003eIn areas where there is no reticulated system, drinking water can also be sourced from rainwater tanks. This means the quality of drinking water can vary.\u003c/p\u003e\n\u003cp\u003eSources of contamination can come from \u003ca href=\"https://www.epa.nsw.gov.au/-/media/epa/corporate-site/resources/community/cadia/24p4536-cadia-region-lead-isotope-tank-sediment-testing.pdf\" target=\"_blank\"\u003eroof catchments feeding rainwater tanks\u003c/a\u003e as well from the tap due to \u003ca href=\"https://www.abcb.gov.au/sites/default/files/resources/2022/Lead-in-plumbing-products-materials.pdf\" target=\"_blank\"\u003elead in plumbing fittings and materials\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eSo, does all water meet these standards?\u003c/h2\u003e\n\u003cp\u003eSome rural and \u003ca href=\"https://phys.org/tags/remote+areas/\" rel=\"tag\"\u003eremote areas\u003c/a\u003e, especially First Nations communities, rely on \u003ca href=\"https://www.dcceew.gov.au/water/policy/first-nations#:~:text=First%20Nations%20Peoples\u0026#39;%20access%20to%20water\u0026amp;text=Research%20shows%20there%20are%20hundreds,helping%20to%20Close%20the%20Gap\" target=\"_blank\"\u003epoor-quality surface water and groundwater\u003c/a\u003e for their drinking water.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eRural and regional water can exceed \u003ca href=\"https://www.dcceew.gov.au/water/policy/first-nations#:~:text=First%20Nations%20Peoples\u0026#39;%20access%20to%20water\u0026amp;text=Research%20shows%20there%20are%20hundreds,helping%20to%20Close%20the%20Gap\" target=\"_blank\"\u003erecommended guidelines\u003c/a\u003e for salt, microbial contaminants and trace elements, such as lead, manganese and arsenic.\u003c/p\u003e\n\u003cp\u003eThe federal government and other agencies are \u003ca href=\"https://www.nationalwatergrid.gov.au/about/news/closing-gap-150-million-towards-first-nations-water-security\" target=\"_blank\"\u003etrying to address this\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThere are many impacts of poor regional water quality. These include its implication in \u003ca href=\"https://www.cambridge.org/core/journals/public-health-nutrition/article/sugarsweetened-beverage-consumption-among-indigenous-australian-children-aged-03-years-and-association-with-sociodemographic-life-circumstances-and-health-factors/AFECE18993F097218F1C7B8E082F62BF\" target=\"_blank\"\u003eelevated rates of tooth decay\u003c/a\u003e in First Nations people. This occurs when access to chilled, sugary drinks is cheaper and easier than access to good quality water.\u003c/p\u003e\n\u003ch2\u003eWhat about PFAS?\u003c/h2\u003e\n\u003cp\u003eThere is also renewed concern about the presence of PFAS or \u0026#34;forever\u0026#34; chemicals in drinking water.\u003c/p\u003e\n\u003cp\u003eRecent research examining the toxicity of PFAS chemicals \u003ca href=\"https://www.abc.net.au/news/2024-08-14/farmers-pull-pfos-chemical-from-belubula-river-nsw-pfas/104193746\" target=\"_blank\"\u003ealong with their presence in some drinking water catchments\u003c/a\u003e in Australia and \u003ca href=\"https://doi.org/10.1016/j.envint.2023.108033\" target=\"_blank\"\u003eoverseas\u003c/a\u003e has prompted a recent assessment of water source contamination.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eA review by the National Health and Medical Research Council (NHMRC) proposed lowering the limits for four PFAS chemicals in drinking water: PFOA, PFOS, PFHxS and PFBS.\u003c/p\u003e\n\u003cp\u003eThe review used publicly available data and found most drinking \u003ca href=\"https://phys.org/tags/water+supplies/\" rel=\"tag\"\u003ewater supplies\u003c/a\u003e are currently below the \u003ca href=\"https://www.nhmrc.gov.au/about-us/news-centre/australian-drinking-water-guidelines-public-consultation-now-open#:~:text=The%20information%20available%20shows%20that,small%20potential%20risks%20are%20addressed\" target=\"_blank\"\u003eproposed new guideline values\u003c/a\u003e for PFAS.\u003c/p\u003e\n\u003cp\u003eHowever, \u0026#34;hotspots\u0026#34; of PFAS remain where drinking water catchments or other sources (for example, groundwater) have been impacted by activities where PFAS has been used in industrial applications. And some communities have voiced concerns about an association between \u003ca href=\"https://www.abc.net.au/listen/programs/radionational-breakfast/concerns-over-pfas-cancer-claims/104852936\" target=\"_blank\"\u003eelevated PFAS levels in their communities and cancer clusters\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWhile some PFAS has been \u003ca href=\"https://www.iarc.who.int/news-events/iarc-monographs-evaluate-the-carcinogenicity-of-perfluorooctanoic-acid-pfoa-and-perfluorooctanesulfonic-acid-pfos/\" target=\"_blank\"\u003eidentified as carcinogenic\u003c/a\u003e, it\u0026#39;s not certain that PFAS causes cancer. The link is \u003ca href=\"https://nceph.anu.edu.au/research/research-projects/pfas-health-study/reports\" target=\"_blank\"\u003estill being debated\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eImportantly, assessment of exposure levels from all sources in the population shows \u003ca href=\"https://doi.org/10.1016/j.ijheh.2019.03.004\" target=\"_blank\"\u003ePFAS levels are falling\u003c/a\u003e meaning any exposure risk has also reduced over time.\u003c/p\u003e\n\u003ch2\u003eHow about removing PFAS from water?\u003c/h2\u003e\n\u003cp\u003eMost sources of drinking water are not associated with industrial contaminants like PFAS. So water sources are generally not subject to \u003ca href=\"https://www.epa.gov/sciencematters/reducing-pfas-drinking-water-treatment-technologies\" target=\"_blank\"\u003eexpensive treatment processes, like reverse osmosis\u003c/a\u003e, that can remove most waterborne pollutants, including PFAS. These treatments are energy-intensive and expensive and based on recent \u003ca href=\"https://phys.org/tags/water+quality/\" rel=\"tag\"\u003ewater quality\u003c/a\u003e assessments \u003ca href=\"https://www.nhmrc.gov.au/about-us/news-centre/australian-drinking-water-guidelines-public-consultation-now-open#:~:text=The%20information%20available%20shows%20that,small%20potential%20risks%20are%20addressed\" target=\"_blank\"\u003eby the NHMRC\u003c/a\u003e will not be needed.\u003c/p\u003e\n\u003cp\u003eWhile contaminants are everywhere, it is \u003ca href=\"https://www.aaas.org/taxonomy/term/10/paracelsus-man-who-brought-chemistry-medicine\" target=\"_blank\"\u003ethe dose that makes the poison\u003c/a\u003e. Ultra-low concentrations of chemicals including PFAS, while not desirable, may not be harmful and total removal is not warranted.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/how-we-treat-catchment-water-to-make-it-safe-to-drink-242206\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/242206/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tHow we treat catchment water to make it safe to drink (2025, January 26)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 26 January 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-01-catchment-safe.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-26T13:00:01-05:00",
  "modifiedTime": null
}
