{
  "id": "156628d5-04df-48ff-803d-9a1f6709f5f4",
  "title": "Kid Rock Meets with Trump’s Attorney General Nominee to “Open a Can of Whoop Ass” on Concert Ticket Industry",
  "link": "https://consequence.net/2024/12/kid-rock-attorney-general-nominee-concert-ticket-industry/",
  "description": "The musician vows to work with Pam Bondi to \"help fix the fiasco of buying concert tickets.\" Kid Rock Meets with Trump’s Attorney General Nominee to “Open a Can of Whoop Ass” on Concert Ticket Industry Spencer Kaufman",
  "author": "Spencer Kaufman",
  "published": "Mon, 16 Dec 2024 21:25:24 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Heavy Consequence",
    "Heavy Music News",
    "Music",
    "News",
    "Country Rock",
    "Hard Rock",
    "Rap-Rock"
  ],
  "byline": "Spencer Kaufman",
  "length": 2739,
  "excerpt": "Kid Rock vows to work with Donald Trump's Attorney General nominee Pam Bondi to \"help fix the fiasco of buying concert tickets.\"",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "Kid Rock is taking aim at the concert-ticket industry, and plans to work closely with the person who may have the biggest say in the matter when the new administration takes over the White House in January. The “American Bad Ass” recently met with president-elect Donald Trump’s nominee for Attorney General, Pam Bondi, with plans to “open a can of whoop ass on the bots, scalpers, venues, ticketing companies, managers and artists alike who rip off and deceive the public.” Get Kid Rock Tickets Here As Consequence pointed out earlier this year, tickets today cost two to three times as much as inflation-adjusted tickets from a few decades ago. On top of that, there’s been a number of high-profile ticket fiascos in recent years, including fan frustration with Live Nation and Ticketmaster over Taylor Swift’s “Eras Tour,” and complaints over “dynamic pricing” for Bruce Springsteen’s 2023 tour. Bondi is not the only potential cabinet member who can have a major impact on the ticket industry. Earlier this year, the US Justice Department sued Live Nation and Ticketmaster for monopolization. Trump’s pick to serve as Assistant Attorney General and to head the Justice Department’s antitrust division, Gail Slater, has earned praise from anti-monopoly advocates, and could very well make the legal action against Live Nation and Ticketmaster a priority. As Kid Rock stated, he’s not only going after the ticket-selling companies, but the artists, venues, and scalpers, as well. Along with a photo of himself with Bondi, Kid Rock posted the following message on Instagram: “What a treat to break bread with our soon to be Attorney General @pambondi. I look forward to working with her and the whole administration to help fix the fiasco of buying concert tickets. Gonna open a can of whoop ass on the bots, scalpers, venues, ticketing companies, managers and artists alike who rip off and deceive the public with the horse shit that has gone on for decades and only gotten worse. Whoever in charge that wants to help fix this, get your ass to the table, otherwise, Fuck Around and Find Out. Kid Rock #MAGA.” Pam Bondi, who was Florida’s attorney general from 2011 to 2019, has to be confirmed by the Senate before officially becoming Attorney General of the United States. She recently replaced Trump’s initial nominee, embattled Florida congressman Matt Gaetz. Kid Rock, meanwhile, was recently announced as a co-headliner with Nickelback on the 2025 “Rock the Country” traveling festival tour, featuring such acts as Hank Williams Jr., Lynyrd Skynyrd, 3 Doors Down, Travis Tritt, Staind’s Aaron Lewis, and more. Weekend passes in each city for that tour range from $140 to $150. See Kid Rock’s aforementioned Instagram post below.",
  "image": "https://consequence.net/wp-content/uploads/2024/12/Kid-Rock.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1454883\" data-title=\"Kid Rock Meets with Trump’s Attorney General Nominee to “Open a Can of Whoop Ass” on Concert Ticket Industry\" data-url=\"https://consequence.net/2024/12/kid-rock-attorney-general-nominee-concert-ticket-industry/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1454883\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Kid Rock Meets with Trump’s Attorney General Nominee to “Open a Can of Whoop Ass” on Concert Ticket Industry\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003e\u003ca href=\"https://consequence.net/artist/kid-rock/\" target=\"_blank\" rel=\"noopener\"\u003eKid Rock\u003c/a\u003e is taking aim at the concert-ticket industry, and plans to work closely with the person who may have the biggest say in the matter when the new administration takes over the White House in January.\u003c/p\u003e\n\u003cp\u003eThe “American Bad Ass” recently met with president-elect Donald Trump’s nominee for Attorney General, Pam Bondi, with plans to “open a can of whoop ass on the bots, scalpers, venues, ticketing companies, managers and artists alike who rip off and deceive the public.”\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://stubhub.prf.hn/click/camref:1100l9Pt3/pubref:kid-rock*ticket-fight-button/destination:https%3A%2F%2Fwww.stubhub.com%2Fkid-rock-tickets%2Fperformer%2F4382\" target=\"_blank\" rel=\"nofollow noopener\"\u003eGet Kid Rock Tickets Here\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAs \u003cem\u003eConsequence\u003c/em\u003e pointed out earlier this year, tickets today \u003ca href=\"https://consequence.net/2023/03/fair-ticket-price-income-inequality-ticketmaster/\" target=\"_blank\" rel=\"noopener\"\u003ecost two to three times\u003c/a\u003e as much as inflation-adjusted tickets from a few decades ago. On top of that, there’s been a number of high-profile ticket fiascos in recent years, including \u003ca href=\"https://consequence.net/2023/01/senate-taylor-swift-live-nation/\" target=\"_blank\" rel=\"noopener\"\u003efan frustration\u003c/a\u003e with Live Nation and Ticketmaster over Taylor Swift’s “Eras Tour,” and complaints over \u003ca href=\"https://consequence.net/2022/07/ticketmaster-bruce-springsteen-pricing-tickets/\" target=\"_blank\" rel=\"noopener\"\u003e“dynamic pricing”\u003c/a\u003e for Bruce Springsteen’s 2023 tour.\u003c/p\u003e\n\u003cp\u003eBondi is not the only potential cabinet member who can have a major impact on the ticket industry. Earlier this year, the US Justice Department \u003ca href=\"https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert\" target=\"_blank\" rel=\"noopener nofollow\"\u003esued Live Nation and Ticketmaster\u003c/a\u003e for monopolization. Trump’s pick to serve as Assistant Attorney General and to head the Justice Department’s antitrust division, Gail Slater, has earned praise from anti-monopoly advocates, and could very well make the legal action against Live Nation and Ticketmaster \u003ca href=\"https://www.hearingthings.co/universal-loathing-of-live-nation-might-help-save-the-dojs-antitrust-lawsuit-under-trump/\" target=\"_blank\" rel=\"noopener nofollow\"\u003ea priority\u003c/a\u003e.\n\t\u003c/p\u003e\n\n\n\u003cp\u003eAs Kid Rock stated, he’s not only going after the ticket-selling companies, but the artists, venues, and scalpers, as well. Along with a photo of himself with Bondi, Kid Rock posted the following message on Instagram:\u003c/p\u003e\n\u003cp\u003e“What a treat to break bread with our soon to be Attorney General @pambondi. I look forward to working with her and the whole administration to help fix the fiasco of buying concert tickets. Gonna open a can of whoop ass on the bots, scalpers, venues, ticketing companies, managers and artists alike who rip off and deceive the public with the horse shit that has gone on for decades and only gotten worse. Whoever in charge that wants to help fix this, get your ass to the table, otherwise, Fuck Around and Find Out. Kid Rock #MAGA.”\u003c/p\u003e\n\u003cp\u003ePam Bondi, who was Florida’s attorney general from 2011 to 2019, has to be confirmed by the Senate before officially becoming Attorney General of the United States. She recently replaced Trump’s initial nominee, embattled Florida congressman Matt Gaetz.\u003c/p\u003e\n\u003cp\u003eKid Rock, meanwhile, was recently announced as a co-headliner with Nickelback on the \u003ca href=\"https://consequence.net/2024/11/kid-rock-nickelback-2025-rock-the-country-traveling-festival/\" target=\"_blank\" rel=\"noopener\"\u003e2025 “Rock the Country” traveling festival tour\u003c/a\u003e, featuring such acts as Hank Williams Jr., Lynyrd Skynyrd, 3 Doors Down, Travis Tritt, Staind’s Aaron Lewis, and more. Weekend passes in each city for that tour range from $140 to $150.\u003c/p\u003e\n\u003cp\u003eSee Kid Rock’s aforementioned Instagram post below.\u003c/p\u003e\n\u003cblockquote data-instgrm-captioned=\"\" data-instgrm-permalink=\"https://www.instagram.com/p/DDiDKl3Pnen/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\n\n\u003c/blockquote\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-16T16:25:24-05:00",
  "modifiedTime": "2024-12-16T16:58:40-05:00"
}
