{
  "id": "262d378e-2a2a-4110-a56e-57eb4041ec9d",
  "title": "EDSEL DOPE Talks STATIC-X Revival: \"It's About Reigniting The Fun And Legacy For The Fans\"",
  "link": "https://metalinjection.net/news/edsel-dope-talks-static-x-revival-its-about-reigniting-the-fun-and-legacy-for-the-fans",
  "description": "\"There's no doubt in my mind Wayne Static is more on the minds and in the hearts of the fans than he's ever been\"",
  "author": "Joel Barrios",
  "published": "Sat, 02 Nov 2024 13:54:25 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "DOPE",
    "featured",
    "static-x"
  ],
  "byline": "By Joel Barrios Published 10 hours ago",
  "length": 7321,
  "excerpt": "\"There's no doubt in my mind Wayne Static is more on the minds and in the hearts of the fans than he's ever been\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "In a recent interview on The Adventures of Pipeman, Edsel Dope, known as the frontman of Dope and widely rumored to be the masked vocalist Xer0 for Static-X, shared his thoughts on helping bassist Tony Campos, drummer Ken Jay, and guitarist Koichi Fukuda preserve and celebrate Static-X’s legacy. Reflecting on his history with Static-X, Edsel stated (via Blabbermouth), “I was always a big Static-X fan and the two bands have so much synergy. We both came out in 1999. If you look back at the touring that the two bands did as we were cutting our teeth, aside from Ozzfest, practically every tour that both bands did, we did together. It was like Static-X, Dope, Powerman 5000; Static-X, Dope, Fear Factory; Static-X and Dope and Sevendust; and Static-X and Dope by ourselves. We did 250 shows together in the span of our first album. That’s a lot of connectivity to those same fans.” Edsel explained that his years of experience building an independent infrastructure allowed him to envision a new chapter for Static-X, especially in the absence of Wayne Static. “I felt like I had a real clear vision as a fan and as a friend and as a band that unlike Static-X, who always had a major label, always had a big management firm, without all of that, and especially without their main guy, Wayne there, they, for a lack of better words, were in very unfamiliar territory. Whereas for me, I had built an independent infrastructure over the last several years. And as a fan of Static-X, I looked at it sitting down with Tony and going, ’I think I can help you guys. With the 20 years of building my own independent infrastructure, you can sort of just put this through that same prism. And you guys are very close to this. So I'm sure you've had ideas of how to bring this back. But as a fan of the band, I know what I would like to see.'” Adapting the band’s legacy was met with mixed reactions at first, but Edsel remained focused on the goal of creating an experience that would resonate with long-time fans. “Of course, everything’s gonna be received with skepticism and, like, ‘I don’t know about this,’ and there was a lot of that, ‘No Wayne Static, no Static-X’ in the beginning. But, again, if you’re doing it for the right reasons and you have a vision for something that really can help the music live and can really help people have those experiences… I know how much I miss the band, and I know that I’m one of millions of fans out there who wanted to get fucking hammered and listen to ‘I’m With Stupid’ loud and live in a room and going, like, ‘We’re never gonna have those experiences again.’ Well, how can we change that and do it in the right way to where people can not feel guilty when they’re smiling at a Static-X show?” Edsel also noted that Static-X brought a distinctive, energetic vibe to metal, one that was important to carry forward. “Because in the beginning, it’s a mourning, it’s sad. But that was a big part of it, was to keep throwing as much positive energy and, for a lack of better words, fun at it, because Static-X was always such a fun band with fun songs. There are a lot of metal bands that are serious. That wasn’t Static-X. Static-X was always this fun, almost smile-on-your-face metal band. So it was important for us to figure out how to reconnect fans to that and allow them to participate in a Static-X experience without feeling guilty about it.” Addressing the common approach of replacing iconic members or rebranding, Edsel felt Static-X deserved to maintain its original identity. “Or they try to move on. They try to rebrand it as something new. And it was, like, Static-X is a legacy band, bro. You try to take the legacy out, what the [expletive] are you doing? You’re trying to take the Wayne Static out of Static-X, what are you doing? Why would you do that?” He saw Static-X’s identity as more than just the music; the “evil disco” concept was now enhanced by technological advances that let the band expand its visual storytelling. “So I don’t know. To me, it wasn’t hard. It was just, again, trying to make sure that you really make it fun and let it be about the music. And then, with today’s technology, we were able to look at ‘evil disco’ as something more than a sound and go, ‘Well, how do we represent the visual of evil disco?’ Because Static-X really checked out in, like, 2009. So 10, 12, 15 years of technology development for LED screens and just big production props that didn’t really exist back then that you can put through the evil disco filter. And there was a lot of really cool, fun shit to come out of that too. So I couldn't be more proud and more happy for my friends who are able to go out there and continue on with something that they all worked very hard on” Edsel praised each original member’s role in crafting Static-X’s sound, highlighting the team effort behind their classic album Wisconsin Death Trip. “Static-X was — of course, Wayne was the head chef. He was the Gordon Ramsey of it. But if you take any one of those guys away from that first album when the band was really defining their sound, it’s not the same band. Imagine Wisconsin Death Trip without Tony Campos’s voice and without his low-end thunder. It was a huge part of the sound. Kenny was the guy who got in his car and moved from the Midwest out to L.A. with Wayne to start the band. That’s your partner in crime, dude. It doesn’t happen without that. And then Koichi came in at the end and was, like, ‘Oh, I play guitar, but I do lots of programming.’ And he was a big part of that electronic techno rave sound that made Wisconsin Death Trip not just an industrial album, but almost like a techno rave evil disco album.” Reflecting on the impact of Static-X’s revival, Edsel spoke to the band’s continued legacy and its appeal to new fans. “So all four of those guys together are responsible for that sound, and to think that those guys wouldn’t be able to go out and celebrate the anniversaries of that album that went platinum, it wouldn’t have been fair. So I’m really happy for them because it was such an achievement for all of them. And also for Wayne’s family who’s been part of this with us the whole time and gets to watch their son’s band go to another level, which — and I say this with respect, in the end, Wayne wasn't doing well and the community wasn't really supporting his choices anymore either. And rightfully so. So he's caught up in all of this refound success. And in many ways, it allows us to sort of overlook those darker years at the end where he was kind of phoning it in and didn't care anymore because he was just caught in another trip.” Through this journey, Edsel believes that Wayne’s spirit and music remain as powerful as ever. “So it's really nice for the legacy of the whole thing that the band has been so successful in bringing it back and bringing it to a new generation of fans that can appreciate it. And I can say with the most purity in the world that there's no doubt in my mind Wayne Static is more on the minds and in the hearts of the fans than he's ever been. And what more can you ask for than that?” Want More Metal? Subscribe To Our Daily Newsletter Enter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/10/Aftershock-2024-51-Dope-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIn a recent interview on \u003cem\u003eThe Adventures of Pipeman\u003c/em\u003e, \u003cstrong\u003eEdsel Dope\u003c/strong\u003e, known as the frontman of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Dope\"\u003eDope\u003c/a\u003e\u003c/strong\u003e and widely rumored to be the masked vocalist \u003cstrong\u003eXer0\u003c/strong\u003e for \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, shared his thoughts on helping bassist \u003cstrong\u003eTony Campos\u003c/strong\u003e, drummer \u003cstrong\u003eKen Jay\u003c/strong\u003e, and guitarist \u003cstrong\u003eKoichi Fukuda\u003c/strong\u003e preserve and celebrate \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e’s legacy. \u003c/p\u003e\n\n\n\n\u003cp\u003eReflecting on his history with \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003eEdsel\u003c/strong\u003e stated (via \u003cem\u003e\u003ca href=\"https://blabbermouth.net/news/edsel-dope-wanted-to-help-fans-reconnect-to-static-x-without-feeling-guilty-about-it\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBlabbermouth\u003c/a\u003e\u003c/em\u003e), “I was always a big \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e fan and the two bands have so much synergy. We both came out in 1999. If you look back at the touring that the two bands did as we were cutting our teeth, aside from Ozzfest, practically every tour that both bands did, we did together. It was like \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Dope\"\u003eDope\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003ePowerman 5000\u003c/strong\u003e; \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Dope\"\u003eDope\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Fear-Factory\"\u003eFear Factory\u003c/a\u003e\u003c/strong\u003e; \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e and \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Dope\"\u003eDope\u003c/a\u003e\u003c/strong\u003e and \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Sevendust\"\u003eSevendust\u003c/a\u003e\u003c/strong\u003e; and \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e and \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Dope\"\u003eDope\u003c/a\u003e\u003c/strong\u003e by ourselves. We did 250 shows together in the span of our first album. That’s a lot of connectivity to those same fans.”\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEdsel\u003c/strong\u003e explained that his years of experience building an independent infrastructure allowed him to envision a new chapter for \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, especially in the absence of \u003cstrong\u003eWayne Static\u003c/strong\u003e. “I felt like I had a real clear vision as a fan and as a friend and as a band that unlike \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, who always had a major label, always had a big management firm, without all of that, and especially without their main guy, \u003cstrong\u003eWayne \u003c/strong\u003ethere, they, for a lack of better words, were in very unfamiliar territory. Whereas for me, I had built an independent infrastructure over the last several years. And as a fan of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, I looked at it sitting down with \u003cstrong\u003eTony\u003c/strong\u003e and going, ’I think I can help you guys. With the 20 years of building my own independent infrastructure, you can sort of just put this through that same prism. And you guys are very close to this. So I\u0026#39;m sure you\u0026#39;ve had ideas of how to bring this back. But as a fan of the band, I know what \u003cem\u003eI\u003c/em\u003e would like to see.\u0026#39;”\n\n\n\n\u003c/p\u003e\u003cp\u003eAdapting the band’s legacy was met with mixed reactions at first, but \u003cstrong\u003eEdsel\u003c/strong\u003e remained focused on the goal of creating an experience that would resonate with long-time fans. “Of course, everything’s gonna be received with skepticism and, like, ‘I don’t know about this,’ and there was a lot of that, ‘No \u003cstrong\u003eWayne Static\u003c/strong\u003e, no \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e’ in the beginning. But, again, if you’re doing it for the right reasons and you have a vision for something that really can help the music live and can really help people have those experiences… I know how much I miss the band, and I know that I’m one of millions of fans out there who wanted to get fucking hammered and listen to ‘I’m With Stupid’ loud and live in a room and going, like, ‘We’re never gonna have those experiences again.’ Well, how can we change that and do it in the right way to where people can not feel guilty when they’re smiling at a \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e show?”\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEdsel\u003c/strong\u003e also noted that \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e brought a distinctive, energetic vibe to metal, one that was important to carry forward. “Because in the beginning, it’s a mourning, it’s sad. But that was a big part of it, was to keep throwing as much positive energy and, for a lack of better words, fun at it, because Static-X was always such a fun band with fun songs. There are a lot of metal bands that are serious. That wasn’t \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e. \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e was always this fun, almost smile-on-your-face metal band. So it was important for us to figure out how to reconnect fans to that and allow them to participate in a \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e experience without feeling guilty about it.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAddressing the common approach of replacing iconic members or rebranding, \u003cstrong\u003eEdsel\u003c/strong\u003e felt \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e deserved to maintain its original identity. “Or they try to move on. They try to rebrand it as something new. And it was, like, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e is a legacy band, bro. You try to take the legacy out, what the [expletive] are you doing? You’re trying to take the \u003cstrong\u003eWayne Static\u003c/strong\u003e out of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e, what are you doing? Why would you do that?”\n\n\n\n\u003c/p\u003e\u003cp\u003eHe saw \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e’s identity as more than just the music; the “evil disco” concept was now enhanced by technological advances that let the band expand its visual storytelling. “So I don’t know. To me, it wasn’t hard. It was just, again, trying to make sure that you really make it fun and let it be about the music. And then, with today’s technology, we were able to look at ‘evil disco’ as something more than a sound and go, ‘Well, how do we represent the visual of evil disco?’ Because \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e really checked out in, like, 2009. So 10, 12, 15 years of technology development for LED screens and just big production props that didn’t really exist back then that you can put through the evil disco filter. And there was a lot of really cool, fun shit to come out of that too. So I couldn\u0026#39;t be more proud and more happy for my friends who are able to go out there and continue on with something that they all worked very hard on”\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eEdsel\u003c/strong\u003e praised each original member’s role in crafting \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e’s sound, highlighting the team effort behind their classic album \u003cem\u003eWisconsin Death Trip.\u003c/em\u003e “\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e was — of course, \u003cstrong\u003eWayne\u003c/strong\u003e was the head chef. He was the Gordon Ramsey of it. But if you take any one of those guys away from that first album when the band was really defining their sound, it’s not the same band. Imagine \u003cem\u003eWisconsin Death Trip\u003c/em\u003e without \u003cstrong\u003eTony\u003c/strong\u003e \u003cstrong\u003eCampos\u003c/strong\u003e’s voice and without his low-end thunder. It was a huge part of the sound. \u003cstrong\u003eKenny\u003c/strong\u003e was the guy who got in his car and moved from the Midwest out to L.A. with \u003cstrong\u003eWayne\u003c/strong\u003e to start the band. That’s your partner in crime, dude. It doesn’t happen without that. And then \u003cstrong\u003eKoichi\u003c/strong\u003e came in at the end and was, like, ‘Oh, I play guitar, but I do lots of programming.’ And he was a big part of that electronic techno rave sound that made \u003cem\u003eWisconsin Death Trip\u003c/em\u003e not just an industrial album, but almost like a techno rave evil disco album.”\n\n\n\n\u003c/p\u003e\u003cp\u003eReflecting on the impact of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Static-X\"\u003eStatic-X\u003c/a\u003e\u003c/strong\u003e’s revival, \u003cstrong\u003eEdsel\u003c/strong\u003e spoke to the band’s continued legacy and its appeal to new fans. “So all four of those guys together are responsible for that sound, and to think that those guys wouldn’t be able to go out and celebrate the anniversaries of that album that went platinum, it wouldn’t have been fair. So I’m really happy for them because it was such an achievement for all of them. And also for \u003cstrong\u003eWayne\u003c/strong\u003e’s family who’s been part of this with us the whole time and gets to watch their son’s band go to another level, which — and I say this with respect, in the end, \u003cstrong\u003eWayne\u003c/strong\u003e wasn\u0026#39;t doing well and the community wasn\u0026#39;t really supporting his choices anymore either. And rightfully so. So he\u0026#39;s caught up in all of this refound success. And in many ways, it allows us to sort of overlook those darker years at the end where he was kind of phoning it in and didn\u0026#39;t care anymore because he was just caught in another trip.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThrough this journey, \u003cstrong\u003eEdsel\u003c/strong\u003e believes that \u003cstrong\u003eWayne\u003c/strong\u003e’s spirit and music remain as powerful as ever. “So it\u0026#39;s really nice for the legacy of the whole thing that the band has been so successful in bringing it back and bringing it to a new generation of fans that can appreciate it. And I can say with the most purity in the world that there\u0026#39;s no doubt in my mind \u003cstrong\u003eWayne Static\u003c/strong\u003e is more on the minds and in the hearts of the fans than he\u0026#39;s ever been. And what more can you ask for than that?”\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"PipemanRadio Interviews Edsel of Dope at Aftershock 2024\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/T2sRgAfgSDI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003ch5\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/h5\u003e\n\t\t\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-02T09:54:25-04:00",
  "modifiedTime": "2024-11-02T09:54:42-04:00"
}
