{
  "id": "37bcecb7-f15c-464e-ae6f-dd80ee56cd4b",
  "title": "THE NEW PORNOGRAPHERS' Drummer JOSEPH SEIDERS Arrested For Child Porn",
  "link": "https://metalinjection.net/metal-crimes/the-new-pornographers-drummer-joseph-seiders-arrested-for-child-porn",
  "description": "Seiders was booked for possession of child pornography, annoying/molesting a child, invasion of privacy, and attempted invasion of privacy. The post THE NEW PORNOGRAPHERS' Drummer JOSEPH SEIDERS Arrested For Child Porn appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Fri, 18 Apr 2025 18:44:44 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Metal Crimes",
    "The New Pornographers",
    "featured2"
  ],
  "byline": "By Greg Kennelty Published 5 hours ago",
  "length": 1905,
  "excerpt": "Seiders was booked for possession of child pornography, annoying/molesting a child, invasion of privacy, and attempted invasion of privacy.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "The New Pornographers drummer Joseph Seiders apparently took the band's name way too literally and has been arrested for alleged possession of child pornography. Which is y'know, utterly vile on every single level. According to the Riverside Sheriff's Department of Riverside, CA, suspicion originally arose when the Palm Desert Sheriff’s Station were dispatched to talk with an 11-year old boy at the 73000 block of Dinah Shore Drive, Palm Desert who said \"an unknown male adult recorded him on a cell phone while he was using the restroom at the location.\" This instance was repeated on April 9, where an employee of the location \"stated a male was entering and exiting the restroom with juvenile males at the business.\" The cops showed up again, identified the guy as 44-year-old Joseph Seiders of Palm Desert, and arrested him. \"The Palm Desert Station Investigations Bureau continued the investigation, serving search warrants for Seiders' residence, vehicle, and cell phone,\" reads the release from the Riverside Sheriff's Department. \"Evidence was located implicating him in the two reported incidents, along with additional crimes, including possessing child pornography.\" Seiders was booked into the John Benoit Detention Center in Indio, CA for possession of child pornography, annoying/molesting a child, invasion of privacy, and attempted invasion of privacy. Naturally, The New Pornographers have distanced themselves from Seiders. In a statement, the band noted: \"Everyone in the band is absolutely shocked, horrified and devastated by the news of the charges against Joe Seiders — and we have immediately severed all ties with him. Our hearts go out to everyone who has been impacted by his actions.\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/04/Seiders.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eThe New Pornographers\u003c/strong\u003e drummer \u003cstrong\u003eJoseph Seiders\u003c/strong\u003e apparently took the band\u0026#39;s name way too literally and has been arrested for alleged possession of child pornography. Which is y\u0026#39;know, utterly vile on every single level.\u003c/p\u003e\n\n\n\n\u003cp\u003eAccording to the \u003ca href=\"https://www.riversidesheriff.org/CivicAlerts.aspx?AID=6286\"\u003eRiverside Sheriff\u0026#39;s Department\u003c/a\u003e of Riverside, CA, suspicion originally arose when the Palm Desert Sheriff’s Station were dispatched to talk with an 11-year old boy at the 73000 block of Dinah Shore Drive, Palm Desert who said \u0026#34;an unknown male adult recorded him on a cell phone while he was using the restroom at the location.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eThis instance was repeated on April 9, where an employee of the location \u0026#34;stated a male was entering and exiting the restroom with juvenile males at the business.\u0026#34; The cops showed up again, identified the guy as 44-year-old \u003cstrong\u003eJoseph Seiders\u003c/strong\u003e of Palm Desert, and arrested him.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;The Palm Desert Station Investigations Bureau continued the investigation, serving search warrants for Seiders\u0026#39; residence, vehicle, and cell phone,\u0026#34; reads the release from the Riverside Sheriff\u0026#39;s Department. \u0026#34;Evidence was located implicating him in the two reported incidents, along with additional crimes, including possessing child pornography.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSeiders\u003c/strong\u003e was booked into the John Benoit Detention Center in Indio, CA for possession of child pornography, annoying/molesting a child, invasion of privacy, and attempted invasion of privacy.\u003c/p\u003e\n\n\n\n\u003cp\u003eNaturally, \u003cstrong\u003eThe New Pornographers\u003c/strong\u003e have distanced themselves from \u003cstrong\u003eSeiders\u003c/strong\u003e. In a statement, the band noted: \u0026#34;Everyone in the band is absolutely shocked, horrified and devastated by the news of the charges against \u003cstrong\u003eJoe Seiders\u003c/strong\u003e — and we have immediately severed all ties with him. Our hearts go out to everyone who has been impacted by his actions.\u0026#34;\n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-18T14:44:44-04:00",
  "modifiedTime": "2025-04-18T14:53:49-04:00"
}
