{
  "id": "4615746c-6296-45f9-b343-7adfeeb0cf21",
  "title": "MARTY FRIEDMAN Discusses Why MEGADETH's \"Symphony Of Destruction\" Was Sort Of A Pop Song",
  "link": "https://metalinjection.net/news/marty-friedman-discusses-why-megadeths-symphony-of-destruction-was-sort-of-a-pop-song",
  "description": "\"It was maybe our first pop song. It was like a pop song, if you could say that.\" The post MARTY FRIEDMAN Discusses Why MEGADETH's \"Symphony Of Destruction\" Was Sort Of A Pop Song appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Mon, 12 May 2025 18:34:37 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Megadeth"
  ],
  "byline": "By Greg Kennelty Published 6 hours ago",
  "length": 1916,
  "excerpt": "\"It was maybe our first pop song. It was like a pop song, if you could say that.\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Megadeth was on a tear in 1992. The band released their iconic 1990 record Rust In Peace two years prior, and continued that hot streak with Countdown To Extinction. The latter contained some of the band's biggest hits, including \"Symphony of Destruction\" – a song that former Megadeth guitarist Marty Friedman considers to be kind of a pop song. In an interview with Brazil's Gustavo Maiato, Friedman called the song \"maybe our first pop song\" and I totally get what he means in that it's got hooks. Not that it was something that might get played next to the major pop hits of 1992. \"I wrote a lot about this in my autobiography. I have a autobiography called Dreaming Japanese, and I wrote in great detail about the writing process in Megadeth. And an important thing that I wrote in the book was the fact that no matter whose name was on the song, whose credit, all four bandmembers worked exactly the same amount of time on that writing. They all worked the same amount of time songwriting, starting the song from zero and completing it.\" He continued: \"And so if I remember, 'Symphony Of Destruction' was on the second album that I did with the band, and at that time I was more comfortable in the band because I'd been in the band for almost two years. And it was maybe our first pop song. It was like a pop song, if you could say that. And I was glad because you've gotta have pop songs if you wanna reach massive amounts of people. And I think we did it without losing our heavy metal fans, you know what I mean? You can make a pop song, but if you lose your core audience, it's not something that we wanted to do.\" And clearly it worked, as \"Symphony Of Destruction\" is far and away Megadeth's most streamed song. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2023/03/Marty-Friedman-01756.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eMegadeth\u003c/strong\u003e was on a tear in 1992. The band released their iconic 1990 record \u003cem\u003eRust In Peace\u003c/em\u003e two years prior, and continued that hot streak with \u003cem\u003eCountdown To Extinction\u003c/em\u003e. The latter contained some of the band\u0026#39;s biggest hits, including \u0026#34;Symphony of Destruction\u0026#34; – a song that former \u003cstrong\u003eMegadeth\u003c/strong\u003e guitarist \u003cstrong\u003eMarty Friedman\u003c/strong\u003e considers to be kind of a pop song.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn an interview with Brazil\u0026#39;s \u003cstrong\u003eGustavo Maiato\u003c/strong\u003e, \u003cstrong\u003eFriedman\u003c/strong\u003e called the song \u0026#34;maybe our first pop song\u0026#34; and I totally get what he means in that it\u0026#39;s got hooks. Not that it was something that might get played next to the major pop hits of 1992.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;I wrote a lot about this in my autobiography. I have a autobiography called \u003cem\u003eDreaming Japanese\u003c/em\u003e, and I wrote in great detail about the writing process in \u003cstrong\u003eMegadeth\u003c/strong\u003e. And an important thing that I wrote in the book was the fact that no matter whose name was on the song, whose credit, all four bandmembers worked exactly the same amount of time on that writing. They all worked the same amount of time songwriting, starting the song from zero and completing it.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eHe continued: \u0026#34;And so if I remember, \u0026#39;Symphony Of Destruction\u0026#39; was on the second album that I did with the band, and at that time I was more comfortable in the band because I\u0026#39;d been in the band for almost two years. And it was maybe our first pop song. It was like a pop song, if you could say that. And I was glad because you\u0026#39;ve gotta have pop songs if you wanna reach massive amounts of people. And I think we did it without losing our heavy metal fans, you know what I mean? You can make a pop song, but if you lose your core audience, it\u0026#39;s not something that we wanted to do.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eAnd clearly it worked, as \u0026#34;Symphony Of Destruction\u0026#34; is far and away \u003cstrong\u003eMegadeth\u003c/strong\u003e\u0026#39;s most streamed song.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Entrevista com Marty Friedman\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/RAVdvlXNsFE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-12T14:34:37-04:00",
  "modifiedTime": "2025-05-12T14:34:38-04:00"
}
