{
  "id": "52d39527-fb0b-4ed7-abde-5e91c8a82d54",
  "title": "PRESIDENT Gets Interpretative In Music Video For Their New Single, \"RAGE,\" And Announce Debut EP",
  "link": "https://metalinjection.net/video/president-gets-interpretative-in-music-video-for-their-new-single-rage-and-announce-debut-ep",
  "description": "The EP is due out in September. The post PRESIDENT Gets Interpretative In Music Video For Their New Single, \"RAGE,\" And Announce Debut EP appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Sat, 19 Jul 2025 18:20:39 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "PRESIDENT"
  ],
  "byline": "By Isabella Ambrosio Published 5 hours ago",
  "length": 2538,
  "excerpt": "The EP is due out in September.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "It was pretty easy to jump on the PRESIDENT bandwagon with their first song, \"In The Name Of The Father,\" within the first 30 seconds due to the layered complexity of percussive synthesizers and distorted vocals before a crashing, guitar-filled chorus. \"Fearless,\" swung with the same intensity, but did have half a point docked for the automated children screaming, 'fearless!' in the pre-chorus. The track ripped and roared though, and may actually be a favourite – especially with the chugging outro – but \"In The Name Of The Father\" felt like it carved out the anonymous bands' ethos with a bit more detail. Now, the newest single \"RAGE,\" can be taken one of two ways. Yes, it can fit in the realm that PRESIDENT is beginning to set up for themselves. But, it can also be taken as a bit of a muddled mess of synthesizers that don't quite sing in the same way as the lead single. And that can sometimes be the problem with releasing your strongest single at the beginning of the cycle. By the time the two minute mark comes around on \"RAGE,\" that is when we get the crash-and-bang we're expecting, and it can feel a little too late, even though the instrumentals shine in their own right. Alongside the release of \"RAGE,\" yesterday (18th July), PRESIDENT announced their debut EP, titled KING OF TERRORS, due out on September 26th. PRESIDENT ambiguously stated alongside the release: KING OF TERRORS The Inaugural EP.Forged in solitude. Shaped by memory.These are chapters drawn from theshadows we tend to sidestep—because facing them demands morethan most are willing to give.PRESIDENT began as an attempt toconfront the uncomfortable.To watch others embrace thatconfrontation has been quietly profound.There is still work to be done.We press forward. There are six tracks due to be released on the EP, with three of them already out. You can check out the full tracklist below. It's interesting to be able to critique a band that only has three songs in its catalogue like this, because objectively standing back, even \"RAGE\" really isn't all that weak. But it's just how hard PRESIDENT seem to be swinging out of the gate that knocks you off balance. You can stream \"RAGE\" here, and pre-order KING OF TERRORS here. \"In The Name of the Father\" \"Fearless\" \"RAGE\" \"Destroy Me\" \"Dionysus\" \"Conclave\" Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/07/PRESIDENT-FEARLESS-PROMO-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIt was pretty easy to jump on the \u003cstrong\u003ePRESIDENT\u003c/strong\u003e bandwagon with their first song, \u0026#34;In The Name Of The Father,\u0026#34; within the first 30 seconds due to the layered complexity of percussive synthesizers and distorted vocals before a crashing, guitar-filled chorus. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Fearless,\u0026#34; swung with the same intensity, but did have half a point docked for the automated children screaming, \u0026#39;fearless!\u0026#39; in the pre-chorus. The track ripped and roared though, and may actually be a favourite – especially with the chugging outro – but \u0026#34;In The Name Of The Father\u0026#34; felt like it carved out the anonymous bands\u0026#39; ethos with a bit more detail.\n\n\n\n\u003c/p\u003e\u003cp\u003eNow, the newest single \u0026#34;RAGE,\u0026#34; can be taken one of two ways. Yes, it can fit in the realm that \u003cstrong\u003ePRESIDENT\u003c/strong\u003e is beginning to set up for themselves. But, it can also be taken as a bit of a muddled mess of synthesizers that don\u0026#39;t quite sing in the same way as the lead single. \n\n\n\n\u003c/p\u003e\u003cp\u003eAnd that can sometimes be the problem with releasing your strongest single at the beginning of the cycle. \n\n\n\n\u003c/p\u003e\u003cp\u003eBy the time the two minute mark comes around on \u0026#34;RAGE,\u0026#34; \u003cem\u003ethat \u003c/em\u003eis when we get the crash-and-bang we\u0026#39;re expecting, and it can feel a little too late, even though the instrumentals shine in their own right.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlongside the release of \u0026#34;RAGE,\u0026#34; yesterday (18th July), \u003cstrong\u003ePRESIDENT\u003c/strong\u003e announced their debut EP, titled \u003cem\u003eKING OF TERRORS\u003c/em\u003e, due out on September 26th. \n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePRESIDENT\u003c/strong\u003e ambiguously stated alongside the release:\n\n\n\n\u003c/p\u003e\u003cblockquote\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eKING OF TERRORS\u003c/em\u003e The Inaugural EP.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eForged in solitude. Shaped by memory.\u003cbr/\u003eThese are chapters drawn from the\u003cbr/\u003eshadows we tend to sidestep—\u003cbr/\u003ebecause facing them demands more\u003cbr/\u003ethan most are willing to give.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePRESIDENT\u003c/strong\u003e began as an attempt to\u003cbr/\u003econfront the uncomfortable.\u003cbr/\u003eTo watch others embrace that\u003cbr/\u003econfrontation has been quietly profound.\u003cbr/\u003eThere is still work to be done.\u003cbr/\u003eWe press forward.\n\u003c/p\u003e\u003c/div\u003e\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThere are six tracks due to be released on the EP, with three of them already out. You can check out the full tracklist below.\n\n\n\n\u003c/p\u003e\u003cp\u003eIt\u0026#39;s interesting to be able to critique a band that only has three songs in its catalogue like this, because objectively standing back, even \u0026#34;RAGE\u0026#34; really isn\u0026#39;t all that weak. But it\u0026#39;s just how hard \u003cstrong\u003ePRESIDENT\u003c/strong\u003e seem to be swinging out of the gate that knocks you off balance.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou can stream \u0026#34;RAGE\u0026#34; \u003ca href=\"https://president.lnk.to/RAGE\"\u003ehere\u003c/a\u003e, and pre-order \u003cem\u003eKING OF TERRORS\u003c/em\u003e \u003ca href=\"https://www.presidentband.com/\"\u003ehere\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"PRESIDENT - RAGE\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/_n_XmyEhSNY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u0026#34;In The Name of the Father\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Fearless\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;RAGE\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Destroy Me\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Dionysus\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003e\u0026#34;Conclave\u0026#34;\u003c/li\u003e\n\u003c/ol\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
