{
  "id": "61c1aac8-d987-4ac8-85d6-8eba5d2f9f30",
  "title": "JOSH FREESE Publishes His Top 10 Reasons He Probably Got Fired From FOO FIGHTERS",
  "link": "https://metalinjection.net/news/josh-freese-publishes-his-top-10-reasons-he-probably-got-fired-from-foo-fighters",
  "description": "All very valid reasons. The post JOSH FREESE Publishes His Top 10 Reasons He Probably Got Fired From FOO FIGHTERS appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Mon, 19 May 2025 18:35:16 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "Foo Fighters",
    "featured"
  ],
  "byline": "By Greg Kennelty Published 6 hours ago",
  "length": 1973,
  "excerpt": "All very valid reasons.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Drummer Josh Freese was recently and very mysteriously fired from Foo Fighters. As the time, Freese noted he was not given a reason – which is wild considering Freese joined Foo Fighters in 2023 after the death of Taylor Hawkins, and the band made a pretty big deal of it. \"The Foo Fighters called me Monday night to let me know they've decided 'to go in a different direction with their drummer,'\" wrote Freese on being fired. \"No reason was given. :( Regardless, I enjoyed the past two years with them, both on and off stage, and I support whatever they feel is best for the band,\" wrote Freese. \"In my 40 years of drumming professionally, I've never been let go from a band, so while I'm not angry—just a bit shocked and disappointed. But as most of you know I've always worked freelance and bounced between bands so, I'm fine. Stay tuned for my 'Top 10 possible reasons Josh got booted from the Foo Fighters' list.\" While Freese still has no clue why he got fired, he's at least published a list of the top 10 reasons why it might've happened. Personally, I'm guessing it's the metronome reason – maybe Freese is just too much of a mutant behind the kit. Once whistled \"My Hero\" for a week solid on tour. Could only name one Fugazi song. Two words: polyrhythms. Metronome-like precision behind the kit deemed \"soulless.\" Demanded starting every rehearsal with a 20 minute cowbell sound bath. Never even once tried growing a beard. Didn't show up to studio because Mercury was in retrograde. Promised Noodles he could be 4th guitarist. Refused to perform unless he was guaranteed a Ouija board and nunchucks after every show. The whole poodle thing was getting to be a bit much. And no – Foo Fighters has still not commented on Freese being fired. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/03/Josh-Freese.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eDrummer\u003cstrong\u003e Josh Freese\u003c/strong\u003e was recently and very mysteriously fired from Foo Fighters. As the time, \u003cstrong\u003eFreese\u003c/strong\u003e noted he was not given a reason – which is wild considering \u003cstrong\u003eFreese\u003c/strong\u003e joined \u003cstrong\u003eFoo Fighters\u003c/strong\u003e in 2023 after the death of \u003cstrong\u003eTaylor Hawkins\u003c/strong\u003e, and the band made a pretty big deal of it. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;The \u003cstrong\u003eFoo Fighters\u003c/strong\u003e called me Monday night to let me know they\u0026#39;ve decided \u0026#39;to go in a different direction with their drummer,\u0026#39;\u0026#34; wrote \u003cstrong\u003eFreese\u003c/strong\u003e on being fired. \u0026#34;No reason was given. :( Regardless, I enjoyed the past two years with them, both on and off stage, and I support whatever they feel is best for the band,\u0026#34; wrote \u003cstrong\u003eFreese\u003c/strong\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;In my 40 years of drumming professionally, I\u0026#39;ve never been let go from a band, so while I\u0026#39;m not angry—just a bit shocked and disappointed. But as most of you know I\u0026#39;ve always worked freelance and bounced between bands so, I\u0026#39;m fine. Stay tuned for my \u0026#39;Top 10 possible reasons Josh got booted from the \u003cstrong\u003eFoo Fighters\u003c/strong\u003e\u0026#39; list.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eWhile \u003cstrong\u003eFreese\u003c/strong\u003e still has no clue why he got fired, he\u0026#39;s at least published a list of the top 10 reasons why it might\u0026#39;ve happened. Personally, I\u0026#39;m guessing it\u0026#39;s the metronome reason – maybe \u003cstrong\u003eFreese\u003c/strong\u003e is just too much of a mutant behind the kit.\n\n\n\n\u003c/p\u003e\u003cul\u003e\n\u003cli\u003eOnce whistled \u0026#34;My Hero\u0026#34; for a week solid on tour.\u003c/li\u003e\n\n\n\n\u003cli\u003eCould only name one \u003cstrong\u003eFugazi\u003c/strong\u003e song.\u003c/li\u003e\n\n\n\n\u003cli\u003eTwo words: polyrhythms.\u003c/li\u003e\n\n\n\n\u003cli\u003eMetronome-like precision behind the kit deemed \u0026#34;soulless.\u0026#34;\u003c/li\u003e\n\n\n\n\u003cli\u003eDemanded starting every rehearsal with a 20 minute cowbell sound bath.\u003c/li\u003e\n\n\n\n\u003cli\u003eNever even once tried growing a beard.\u003c/li\u003e\n\n\n\n\u003cli\u003eDidn\u0026#39;t show up to studio because Mercury was in retrograde.\u003c/li\u003e\n\n\n\n\u003cli\u003ePromised Noodles he could be 4\u003csup\u003eth\u003c/sup\u003e guitarist.\u003c/li\u003e\n\n\n\n\u003cli\u003eRefused to perform unless he was guaranteed a Ouija board and nunchucks after every show.\u003c/li\u003e\n\n\n\n\u003cli\u003eThe whole poodle thing was getting to be a bit much.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eAnd no – \u003cstrong\u003eFoo Fighters\u003c/strong\u003e has still not commented on \u003cstrong\u003eFreese\u003c/strong\u003e being fired.\n\n\n\u003c/p\u003e\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/p/DJ2Az7FORJi/\" data-instgrm-version=\"14\" data-instgrm-captioned=\"\"\u003e\u003c/blockquote\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-19T14:35:16-04:00",
  "modifiedTime": "2025-05-19T14:35:17-04:00"
}
