{
  "id": "69e0cb27-8ab1-469d-b1f2-3f67dfbaf21f",
  "title": "SERJ TANKIAN Remembers Facing SLAYER's Infamously Hostile Fans: \"At One Point, I Was Hit In The Face, And I Lost My Sh*t\"",
  "link": "https://metalinjection.net/news/serj-tankian-remembers-facing-slayers-infamously-hostile-fans-at-one-point-i-was-hit-in-the-face-and-i-lost-my-sht",
  "description": "\"I launched into an angry tirade and threatened to start kicking people’s asses. When I finished, the venue went dead silent.\"",
  "author": "Joel Barrios",
  "published": "Thu, 23 Jan 2025 20:00:40 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured",
    "System Of A Down",
    "Slayer"
  ],
  "byline": "By Joel Barrios Published 5 hours ago",
  "length": 4949,
  "excerpt": "\"I launched into an angry tirade and threatened to start kicking people’s asses. When I finished, the venue went dead silent.\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "It's hard to imagine now, but there was a time when System Of A Down wasn't the household name it is today. Despite now boasting Billboard-topping albums and songs that have surpassed a billion streams on Spotify, their early days as an opening act were far from glamorous. In fact, for a band as unconventional as System Of A Down, hostility was almost a rite of passage. The late '90s were a different era for metal. Dominated by the likes of Metallica, Korn, Pantera, and Marilyn Manson, the scene wasn't exactly primed for a group of Armenian-American musicians blending heavy metal, punk, Armenian folk influences, and avant-garde absurdity. That dissonance became glaringly evident during a defining moment in 1998 when System Of A Down joined Slayer on tour. In his 2024 memoir, Down With The System, frontman Serj Tankian recounts (via Metal Hammer) the experience as a trial by fire. \"We were opening for Slayer, which was a massive opportunity for a band who hadn't yet released their first album,\" he writes. \"But that tour was like going to rock 'n' roll boot camp. Slayer fans famously love Slayer and hate just about everything and everyone else.\" Slayer fans are a breed unto themselves — intense, loyal, and unyielding in their preferences. As Serj recalls, their reception was less than welcoming: \"As their opening act, the crowd saw us as the one thing standing between them and Slayer.\" The mismatch between System of a Down's flamboyant stage presence — complete with tribal makeup and pink hair — and the rugged Slayer aesthetic only heightened the tension. \"This was a group of fans for whom 'homemade' knife-carved tattoos were not unusual, so when we'd turn up – me in tribal makeup, Daron [Malakian, guitarist] sporting pink hair and a glammy little outfit, they were not necessarily predisposed to welcome us with open arms. In fact, when we'd take the stage, we'd often be facing a wall of crossed arms and extended middle fingers,\" Serj notes, painting a vivid picture of the crowds they faced. Despite the animosity, the band's determination to win over the audience never wavered. Serj reflects that their \"sheer moxie eventually started winning fans over,\" even as some nights devolved into chaos. At a particularly memorable show in Utah, a sudden rainstorm forced the cancellation of the concert, unleashing a torrent of frustration: \"Sometimes, though, shit just got out of hand. At a show in Utah, when it started to rain, the concert was canceled, much to the dismay of the fans who'd turned up there. Trash started flying, fights broke out all over the place, and I jumped behind our merch table to help our merch person pack up all our stuff. After a few minutes, I realized it was a lost cause.\" While some in Slayer's fanbase eventually came around, Serj also remembers moments of open hostility that crossed the line. One particularly tense incident pushed him to his limits, leading to a response that left an entire room of Slayer fans stunned into silence — a rare feat in a crowd so notoriously vocal. \"A small subset of Slayer fans had a disturbing practice of showing up to gigs in full Nazi regalia. I distinctly recall watching a team of African-American bouncers at a club in Detroit called Harpos brawling with these Slayer fans outside the club after we'd finished our set,\" he recalled. \"Later that year, while we were touring with Slayer through Europe, we were onstage in Poland being pelted with coins by fans who were also raising Nazi salutes in our direction. At one point, I was hit in the face with a bagel and I lost my shit,\" Serj admits. \"I told our lighting guy to point the lights into the audience and target the bagel-thrower. Then I launched into an angry tirade and threatened to start kicking people's asses. When I finished, the venue went dead silent. You could literally hear a pin drop in that place. Then we walked off.\" Even after the release of their now-classic debut album, System Of A Down continued to face resistance during Slayer's European tour. But the band found creative ways to win over audiences. Daron Malakian humorously recalled their tactic in Berlin: \"I said, ‘Look, if these guys don't applaud for us after we play the first song, Know, we're gonna play it again, over and over, until they react.'\" When the crowd stayed silent after the first performance, the band restarted the song. \"Halfway through, they were actually cheering for us,\" Daron remembers. \"My attitude was, ‘You're gonna love us whether you like it or not.'\" Ultimately, System of a Down's persistence paid off, and by the release of Toxicity in 2001, they had cemented their place as one of the most beloved — and still wonderfully strange — bands in metal history.  Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2020/02/System-of-a-Down_19.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIt\u0026#39;s hard to imagine now, but there was a time when \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/System-Of-A-Down\"\u003eSystem Of A Down\u003c/a\u003e\u003c/strong\u003e wasn\u0026#39;t the household name it is today. Despite now boasting Billboard-topping albums and songs that have surpassed a billion streams on Spotify, their early days as an opening act were far from glamorous. In fact, for a band as unconventional as \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/System-Of-A-Down\"\u003eSystem Of A Down\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e, hostility was almost a rite of passage.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe late \u0026#39;90s were a different era for metal. Dominated by the likes of \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Metallica\"\u003eMetallica\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Korn\"\u003eKorn\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Pantera\"\u003ePantera\u003c/a\u003e\u003c/strong\u003e, and \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Marilyn-Manson\"\u003eMarilyn Manson\u003c/a\u003e\u003c/strong\u003e, the scene wasn\u0026#39;t exactly primed for a group of Armenian-American musicians blending heavy metal, punk, Armenian folk influences, and avant-garde absurdity. That dissonance became glaringly evident during a defining moment in 1998 when \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/System-Of-A-Down\"\u003eSystem Of A Down\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e joined \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e on tour.\n\n\n\n\u003c/p\u003e\u003cp\u003eIn his 2024 memoir, \u003cem\u003eDown With The System\u003c/em\u003e, frontman \u003cstrong\u003eSerj Tankian\u003c/strong\u003e recounts (via \u003cem\u003e\u003ca href=\"https://www.loudersound.com/features/serj-tankian-slayer-tour-early-days\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMetal Hammer\u003c/a\u003e\u003c/em\u003e) the experience as a trial by fire. \u0026#34;We were opening for \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e, which was a massive opportunity for a band who hadn\u0026#39;t yet released their first album,\u0026#34; he writes. \u0026#34;But that tour was like going to rock \u0026#39;n\u0026#39; roll boot camp. \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e fans famously love \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e and hate just about everything and everyone else.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e fans are a breed unto themselves — intense, loyal, and unyielding in their preferences. As \u003cstrong\u003eSerj\u003c/strong\u003e recalls, their reception was less than welcoming: \u0026#34;As their opening act, the crowd saw us as the one thing standing between them and \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eThe mismatch between \u003cstrong\u003eSystem of a Down\u0026#39;s\u003c/strong\u003e flamboyant stage presence — complete with tribal makeup and pink hair — and the rugged \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e aesthetic only heightened the tension. \u0026#34;This was a group of fans for whom \u0026#39;homemade\u0026#39; knife-carved tattoos were not unusual, so when we\u0026#39;d turn up – me in tribal makeup, \u003cstrong\u003eDaron\u003c/strong\u003e [\u003cstrong\u003eMalakian\u003c/strong\u003e, guitarist] sporting pink hair and a glammy little outfit, they were not necessarily predisposed to welcome us with open arms. In fact, when we\u0026#39;d take the stage, we\u0026#39;d often be facing a wall of crossed arms and extended middle fingers,\u0026#34; \u003cstrong\u003eSerj\u003c/strong\u003e notes, painting a vivid picture of the crowds they faced.\u003c/p\u003e\n\n\n\n\u003cp\u003eDespite the animosity, the band\u0026#39;s determination to win over the audience never wavered. \u003cstrong\u003eSerj\u003c/strong\u003e reflects that their \u0026#34;sheer moxie eventually started winning fans over,\u0026#34; even as some nights devolved into chaos. \n\n\n\n\u003c/p\u003e\u003cp\u003eAt a particularly memorable show in Utah, a sudden rainstorm forced the cancellation of the concert, unleashing a torrent of frustration: \u0026#34;Sometimes, though, shit just got out of hand. At a show in Utah, when it started to rain, the concert was canceled, much to the dismay of the fans who\u0026#39;d turned up there. Trash started flying, fights broke out all over the place, and I jumped behind our merch table to help our merch person pack up all our stuff. After a few minutes, I realized it was a lost cause.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eWhile some in \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e\u0026#39;s fanbase eventually came around, \u003cstrong\u003eSerj\u003c/strong\u003e also remembers moments of open hostility that crossed the line. One particularly tense incident pushed him to his limits, leading to a response that left an entire room of \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e fans stunned into silence — a rare feat in a crowd so notoriously vocal.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;A small subset of \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e fans had a disturbing practice of showing up to gigs in full Nazi regalia. I distinctly recall watching a team of African-American bouncers at a club in Detroit called Harpos brawling with these \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e fans outside the club after we\u0026#39;d finished our set,\u0026#34; he recalled.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Later that year, while we were touring with \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e through Europe, we were onstage in Poland being pelted with coins by fans who were also raising Nazi salutes in our direction. At one point, I was hit in the face with a bagel and I lost my shit,\u0026#34; \u003cstrong\u003eSerj\u003c/strong\u003e admits. \n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;I told our lighting guy to point the lights into the audience and target the bagel-thrower. Then I launched into an angry tirade and threatened to start kicking people\u0026#39;s asses. When I finished, the venue went dead silent. You could literally hear a pin drop in that place. Then we walked off.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eEven after the release of their now-classic debut album, \u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/System-Of-A-Down\"\u003eSystem Of A Down\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e continued to face resistance during \u003cstrong\u003e\u003cstrong\u003e\u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/Slayer\"\u003eSlayer\u003c/a\u003e\u003c/strong\u003e\u003c/strong\u003e\u003c/strong\u003e\u0026#39;s European tour. But the band found creative ways to win over audiences. \u003cstrong\u003eDaron Malakian\u003c/strong\u003e humorously recalled their tactic in Berlin: \u0026#34;I said, ‘Look, if these guys don\u0026#39;t applaud for us after we play the first song, \u003cem\u003eKnow\u003c/em\u003e, we\u0026#39;re gonna play it again, over and over, until they react.\u0026#39;\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eWhen the crowd stayed silent after the first performance, the band restarted the song. \u0026#34;Halfway through, they were actually cheering for us,\u0026#34; \u003cstrong\u003eDaron\u003c/strong\u003e remembers. \u0026#34;My attitude was, ‘You\u0026#39;re gonna love us whether you like it or not.\u0026#39;\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eUltimately, \u003cstrong\u003eSystem of a Down\u0026#39;s\u003c/strong\u003e persistence paid off, and by the release of \u003cem\u003eToxicity\u003c/em\u003e in 2001, they had cemented their place as one of the most beloved — and still wonderfully strange — bands in metal history. \n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-23T15:00:40-05:00",
  "modifiedTime": "2025-01-23T15:00:58-05:00"
}
