{
  "id": "8d353b8e-7d2a-4169-b463-82a043055437",
  "title": "22,100 artists generated over $50k on Spotify last year. The company argues that ‘way more artists are generating meaningful money now than in any previous era of the music industry’.",
  "link": "https://www.musicbusinessworldwide.com/charlie-hellman-22100-artists-generated-over-50-meaningful/",
  "description": "There are two ways to look at how much artists are earning on Spotify. On the one hand, more artists than ever are creating music, while the overall percentage of acts who find financial success from streaming appears to be shrinking. Nearly 12 million artists had music on Spotify last year, a +2 million artist … Continued Source",
  "author": "Murray Stassen",
  "published": "Thu, 27 Mar 2025 19:35:37 +0000",
  "source": "https://www.musicbusinessworldwide.com/feed/",
  "categories": [
    "Interviews",
    "Spotify"
  ],
  "byline": "Murray Stassen",
  "length": 10629,
  "excerpt": "There are two ways to look at how much artists are earning on Spotify. On the one hand, more artists than ever are creating music, while the overall percentage…",
  "siteName": "Music Business Worldwide",
  "favicon": "https://www.musicbusinessworldwide.com/wp-content/themes/mb/assets/img/icons/favicon-192x192.png",
  "text": "There are two ways to look at how much artists are earning on Spotify.On the one hand, more artists than ever are creating music, while the overall percentage of acts who find financial success from streaming appears to be shrinking.Nearly 12 million artists had music on Spotify last year, a +2 million artist increase from 2023. Some 71,200 of these artists – just 0.6% – generated over $10,000 on the platform in 2024.Yet Spotify’s latest Loud \u0026 Clear report shows that the actual volume of artists earning significant amounts from the platform has significantly increased in size since 2017.For example: 22,100 artists generated $50,000 or above in combined recording and publishing royalties from Spotify in 2024, up 200% from 2017 (when 7,400 artists generated $50,000+).Meanwhile, 2,940 artists generated over $500,000 on the platform last year – up 205% on 2017.What’s more, Spotify highlights that just 235,000 artists on its service have released over 10 songs to date and average at least 10,000 monthly listeners — two key indicators, it says, of “professional” and/or “emerging” artists. (Aka… not hobbyists.)Amongst this subset of 235,000 artists? Nearly a third (30.3%) generated more than $10,000 in royalties on Spotify last year, and nearly one in ten (22,100) generated over $50,000. For Charlie Hellman, Spotify’s Global Head of Music Vertical, “it’s clear to see that way more artists are able to be in the game and generate meaningful money now than at any previous era of the music industry”.Hellman adds: “We need to keep that going. I don’t think it’s a bad thing that there are also now millions more who are hobbyists or aspiring [artists] as well. In previous eras, those folks couldn’t even share their music.”“Way more artists are able to be in the game and generate meaningful money now than at any previous era of the music industry.”Charlie Hellman, SpotifyHighlighting the scale of hobbyists releasing music on the platform, Spotify confirms that 8 million, or over 66%, of those 12 million artists on its service, haven’t uploaded more than 10 tracks.Hellman argues, however, that “the fraction of hobbyists to professionals is [not] something to worry about”.“The thing that really matters for a healthy ecosystem is that the absolute number of sustainable professional artists is growing,” he says. “And on that point, the data is irrefutable.”He notes that more artists generated $100,000 per year from Spotify in 2024 than generated $10,000 from Spotify in 2014. Overall, as previously reported, Spotify paid out $10 billion to the music industry in 2024, across record companies and music publishers, plus independent distributors, performance rights organizations, and collecting societies.That figure was approximately $1 billion higher than it paid out in 2023, and $9 billion higher than it paid out 10 years ago, in 2014.“In 2014, when the recorded music industry hit its low point, people were doubtful that streaming was the answer and said it would need to pay more,” says Hellman. “Say, 77% of our revenue instead of 70%.”“Instead, we focused on growing the pie by getting more people around the world to pay. And by growing the pie we didn’t grow our payouts by 10% or 100% or 500%. We grew it 900%: from $1 billion in payouts in 2014 to $10 billion in 2024.”As of the end of 2024, Spotify had paid out nearly $60 billion to music rightsholders since the company was founded in 2008.Below, Hellman gives us an overview of Spotify’s latest Loud \u0026 Clear report, highlighting trends across payout thresholds, languages and how, despite what people think, streaming is not a “hits economy…”Could you give us an overview of this year’s report, including a few of the biggest trends, and maybe highlight the most surprising trends you identified?I think the biggest highlight is also the most surprising – the astounding growth in payouts to music rights holders over the last decade driven by the growth of streaming worldwide.2014’s low point wasn’t due to a lack of good music (it was actually an incredible year for music). It was because we weren’t, as an industry, packaging music in a way that was getting the world to pay.Spotify has since put billions into R\u0026D to make the most engaging service. Billions into marketing to sell the world on paying for a music subscription.Those investments we make have yielded incredible returns for not only us but every single participant in the industry. Our incentives are completely aligned.The more motivated we are to grow our own revenue, the more revenue it generates for labels, publishers, artists and songwriters.People talk about whether streaming “devalued” music. If you measure how much people value music by how much they pay, streaming didn’t devalue music. It massively increased the value of music.You can see it in the massive sums of money catalogs are being bought and sold for now. [It’s the] same music as it was 10 years ago, but way more valuable now because people are valuing it and paying. Source: SpotifyThe number of artists uploading music to Spotify grew by 2 million to nearly 12 million in 2024. What does that tell us about the wider music-making landscape and what are the challenges and opportunities presented by the scale of music creators uploading music to the platform?There are no more barriers. Millions, not thousands, now have the tools to share their art globally.While the competition is fierce – it always has been – the volume of successful artists has dramatically increased year over year.Looking at the royalty thresholds below, could you tell us how these thresholds have grown over time, and where you would like each of them to be over the next 10 years?12,500 more than $100,000 in royalties [in 2024]; 71,200 more than $10,000; 1,450 more than $1 million.Propelled by the continued adoption of streaming subscriptions around the world, the number of artists making more than $10k, more than $100k, more than $1 million, have each tripled over the last seven years. They can triple again.By and large it will come down to this: Today, there are more than 500 million paying listeners across all music streaming services. If we as an industry can work together to reach 1 billion paying subscribers or even more, that will directly translate to more revenues being able to sustain more artists achieving all of those earning milestones.According to Spotify, “as a rule of thumb on Spotify, artists can start approaching $1 million per year with around 4-5 million monthly listeners or 20-25 million monthly streams.” How has this listener/streams/ earnings ratio changed over time?Yes, we felt that’s a helpful, easy-to-understand guide. But the ratio that actually dictates earnings is an artist’s streams as a share of total streams. Your readers will know that streamshare is the actual way payouts on every major streaming service are calculated — not a fixed per-stream rate (there is a lot of misinformation out there about per-stream rates being how payouts work, but it’s not the case). If you get 1% of streams, you get 1% of the royalty pool.In 2024, an artist who received one in every million streams on Spotify generated over $10,000 on average. That’s 10x what the same streamshare would have generated a decade ago — when one in every one million streams generated only $1,000 on average.Every streaming service basically has the same music catalog. And so, as an artist, you have the same chance to reach the same level of popularity across each service. But the difference is, for that same exact level of popularity, Spotify pays the most. And that’s not by some obscure metric — that’s based on the literal metric that royalties are calculated with by every major streaming service. 80% of artists who generated $1m+ last year didn’t have a song reach the Spotify Global Daily Top 50 – what does this tell us about the changing dynamics of the music industry?It means that independent musicians, less mainstream artists and niche genres can all thrive in the new streaming economy.People think streaming is a “hits” economy — it’s not.Over 80% of those reaching $1M+ per year were actively touring in 2024 (with at least one event listed on Spotify), so they are active artists currently building their career.Success in the streaming era isn’t about chart-topping hits or legacy catalogs. It’s about building a loyal fanbase that keeps coming back.Source: SpotifySpotify claims in the report that in 2024, independent artists and labels collectively generated $5bn-plus, or about half of Spotify’s total payout to the industry. How do you predict the trend highlighted in the previous Q will impact this stat in the coming years?There are simply more paths to success than there were previously. Compared to the CD era, there are more major signed successes, more indie successes and more DIY successes – all pathways are growing.In its heyday, the biggest record store could hold the music of a few thousand artists. And it was only for those with the means to get there – you needed real investment to record your music, have it physically produced, and distributed around the world.For indie artists to have carved out half of all revenues from the world’s largest retailer was unthinkable back then. Today, they’re building sustainable careers, gaining global audiences, and breaking down barriers.Of the artists who generated $1,000+ in royalties on Spotify in 2024, more than half saw most of their royalties come from listeners outside of their home countries – what does this tell us about the globalization of music?Listeners today, especially young people, don’t care about rigid genres and they are open minded about new sounds.As Spotify’s global reach expands, artists are breaking into new markets faster and more successfully than ever before.What other trends did you identify this year that tie into this globalization narrative?The 1,450 artists who generated $1 million-plus also record music in 17 different languages, which is pretty incredible. You think back ten or twenty years with a mostly US/EU-focused industry, and this definitely wasn’t the case.Over 50 languages were represented among artists earning at least $100,000.What else should we know about the report?Being a bit abstract… To me the most important thing about the report is that it exists. For our industry to have constructive dialogue about the health of the ecosystem and where it can improve, transparency is vital.“I would love to see every corner of the industry share the data that they have so we can see an even more complete picture.Music Business Worldwide",
  "image": "https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThere are two ways to look at how much artists are earning on \u003ca title=\"Companies \u0026gt; Spotify [4,211 articles]\" href=\"https://www.musicbusinessworldwide.com/companies/spotify/\"\u003eSpotify\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eOn the one hand, more artists than ever are creating music, while the overall percentage of acts who find financial success from streaming appears to be shrinking.\u003c/p\u003e\u003cp\u003eNearly \u003cstrong\u003e12 million\u003c/strong\u003e artists had music on Spotify last year, a \u003cstrong\u003e+2 million\u003c/strong\u003e artist increase from 2023. Some \u003cstrong\u003e71,200\u003c/strong\u003e of these artists – just \u003cstrong\u003e0.6%\u003c/strong\u003e – generated over \u003cstrong\u003e$10,000\u003c/strong\u003e on the platform in 2024.\u003c/p\u003e\u003cp\u003eYet Spotify’s latest \u003ca href=\"https://loudandclear.byspotify.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cem\u003eLoud \u0026amp; Clear\u003c/em\u003e report\u003c/a\u003e shows that the actual \u003cem\u003evolume\u003c/em\u003e of artists earning significant amounts from the platform has significantly increased in size since 2017.\u003c/p\u003e\u003cp\u003eFor example: \u003cstrong\u003e22,100\u003c/strong\u003e artists generated \u003cstrong\u003e$50,000 \u003c/strong\u003eor above in combined recording and publishing royalties from Spotify in 2024, up \u003cspan\u003e\u003cstrong\u003e200%\u003c/strong\u003e\u003c/span\u003e from 2017 (when \u003cstrong\u003e7,400\u003c/strong\u003e artists generated $50,000+).\u003c/p\u003e\u003cp\u003eMeanwhile, \u003cstrong\u003e2,940\u003c/strong\u003e artists generated over \u003cstrong\u003e$500,000\u003c/strong\u003e on the platform last year – up \u003cspan\u003e\u003cstrong\u003e205%\u003c/strong\u003e\u003c/span\u003e on 2017.\u003c/p\u003e\u003cp\u003eWhat’s more, Spotify highlights \u003cspan\u003ethat just \u003cstrong\u003e235,000\u003c/strong\u003e artists on its service have released \u003cstrong\u003eover 10 songs to date\u003c/strong\u003e \u003cem\u003eand\u003c/em\u003e average at least \u003cstrong\u003e10,000 monthly listeners \u003c/strong\u003e— \u003c/span\u003etwo key indicators, it says, of “professional” and/or “emerging” artists. (Aka… not hobbyists.)\u003c/p\u003e\u003cp\u003eAmongst this subset of\u003cstrong\u003e 235,000\u003c/strong\u003e artists? Nearly a third (\u003cstrong\u003e30.3%\u003c/strong\u003e) generated more than \u003cstrong\u003e$10,000\u003c/strong\u003e in royalties on Spotify last year, and nearly one in ten (\u003cstrong\u003e22,100\u003c/strong\u003e) generated over \u003cstrong\u003e$50,000\u003c/strong\u003e.\u003c/p\u003e  \u003cp\u003e\u003cstrong\u003eFor Charlie Hellman\u003c/strong\u003e, Spotify’s Global Head of Music Vertical, “it’s clear to see that way more artists are able to be in the game and generate meaningful money now than at any previous era of the music industry”.\u003c/p\u003e\u003cp\u003eHellman adds: “We need to keep that going. I don’t think it’s a bad thing that there are also now millions more who are hobbyists or aspiring [artists] as well. In previous eras, those folks couldn’t even share their music.”\u003c/p\u003e\u003cblockquote\u003e\u003cp\u003e“Way more artists are able to be in the game and generate meaningful money now than at any previous era of the music industry.”\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCharlie Hellman, Spotify\u003c/span\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cspan\u003eHighlighting the scale of hobbyists releasing music on the platform, Spotify confirms that \u003cstrong\u003e8 million\u003c/strong\u003e, or over 66%, of those \u003cstrong\u003e12 million\u003c/strong\u003e artists on its service, haven’t uploaded more than 10 tracks.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eHellman argues, however, that “the fraction of hobbyists to professionals is [not] something to worry about”.\u003c/p\u003e\u003cp\u003e“The thing that really matters for a healthy ecosystem is that the absolute number of sustainable professional artists is growing,” he says. “And on that point, the data is irrefutable.”\u003c/p\u003e\u003cp\u003eHe notes that more artists generated \u003cstrong\u003e$100,000\u003c/strong\u003e per year from Spotify in 2024 than generated \u003cstrong\u003e$10,000\u003c/strong\u003e from Spotify in 2014.\u003c/p\u003e  \u003cp\u003eOverall, as previously reported, Spotify \u003ca href=\"https://www.musicbusinessworldwide.com/spotify-paid-out-10-billion-to-the-music-industry-in-2024-a-full-1bn-more-than-in-2023/\" target=\"_blank\" rel=\"noopener\"\u003epaid out\u003c/a\u003e \u003cstrong\u003e$10 billion\u003c/strong\u003e to the music industry in 2024, across record companies and music publishers, plus independent distributors, performance rights organizations, and collecting societies.\u003c/p\u003e\u003cp\u003eThat figure was approximately \u003cstrong\u003e$1 billion\u003c/strong\u003e higher than it paid out in 2023, and $9 billion higher than it paid out 10 years ago, in 2014.\u003c/p\u003e\u003cp\u003e“In 2014, when the recorded music industry hit its low point, people were doubtful that streaming was the answer and said it would need to pay more,” says Hellman. “Say,\u003cstrong\u003e 77%\u003c/strong\u003e of our revenue instead of\u003cstrong\u003e 70%\u003c/strong\u003e.”\u003c/p\u003e\u003cp\u003e“Instead, we focused on \u003cstrong\u003egrowing the pie\u003c/strong\u003e by getting more people around the world to pay. And by growing the pie we didn’t grow our payouts by 10% or 100% or 500%. We grew it \u003cstrong\u003e900%\u003c/strong\u003e: from \u003cstrong\u003e$1 billion\u003c/strong\u003e in payouts in 2014 to \u003cstrong\u003e$10 billion\u003c/strong\u003e in 2024.”\u003c/p\u003e\u003cp\u003eAs of the end of 2024, Spotify had paid out nearly \u003cstrong\u003e$60 billion\u003c/strong\u003e to music rightsholders since the company was founded in 2008.\u003c/p\u003e\u003cp\u003eBelow, Hellman gives us an overview of Spotify’s latest Loud \u0026amp; Clear report, highlighting trends across payout thresholds, languages and how, despite what people think, streaming is not a “hits economy…”\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eCould you give us an overview of this year’s report, including a few of the biggest trends, and maybe highlight the most surprising trends you identified?\u003c/h6\u003e\u003cp\u003eI think the biggest highlight is also the most surprising – the astounding growth in payouts to music rights holders over the last decade driven by the growth of streaming worldwide.\u003c/p\u003e\u003cp\u003e2014’s low point wasn’t due to a lack of good music (it was actually an incredible year for music). It was because we weren’t, as an industry, packaging music in a way that was getting the world to pay.\u003c/p\u003e\u003cp\u003eSpotify has since put billions into R\u0026amp;D to make the most engaging service. Billions into marketing to sell the world on paying for a music subscription.\u003c/p\u003e\u003cp\u003eThose investments we make have yielded incredible returns for not only us but every single participant in the industry. Our incentives are completely aligned.\u003c/p\u003e\u003cp\u003eThe more motivated we are to grow our own revenue, the more revenue it generates for labels, publishers, artists and songwriters.\u003c/p\u003e\u003cp\u003ePeople talk about whether streaming “devalued” music. If you measure how much people value music by how much they pay, streaming didn’t devalue music. It massively increased the value of music.\u003c/p\u003e\u003cp\u003eYou can see it in the massive sums of money catalogs are being bought and sold for now. [It’s the] same music as it was 10 years ago, but way more valuable now because people are valuing it and paying.\u003c/p\u003e\u003chr/\u003e\u003cfigure\u003e\n\n\u003cimg src=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-80x40.jpg\" data-srcset=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-80x40.jpg 80w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-160x80.jpg 160w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-320x159.jpg 320w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-418x208.jpg 418w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-648x323.jpg 648w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-836x417.jpg 836w\" data-sizes=\"auto\" data-cfsrc=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-80x40.jpg\" srcset=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-80x40.jpg 80w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-160x80.jpg 160w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-320x159.jpg 320w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-418x208.jpg 418w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-648x323.jpg 648w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.20.32-836x417.jpg 836w\"/\u003e\u003cfigcaption\u003eSource: Spotify\u003c/figcaption\u003e\u003c/figure\u003e\u003chr/\u003e\u003ch6\u003eThe number of artists uploading music to Spotify grew by 2 million to nearly 12 million in 2024. What does that tell us about the wider music-making landscape and what are the challenges and opportunities presented by the scale of music creators uploading music to the platform?\u003c/h6\u003e\u003cp\u003eThere are no more barriers. Millions, not thousands, now have the tools to share their art globally.\u003c/p\u003e\u003cp\u003eWhile the competition is fierce – it always has been – the volume of successful artists has dramatically increased year over year.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eLooking at the royalty thresholds below, could you tell us how these thresholds have grown over time, and where you would like each of them to be over the next 10 years?\u003c/h6\u003e\u003cp\u003e\u003cstrong\u003e12,500\u003c/strong\u003e more than $100,000 in royalties [in 2024]; \u003cstrong\u003e71,200\u003c/strong\u003e more than $10,000; \u003cstrong\u003e1,450\u003c/strong\u003e more than $1 million.\u003c/p\u003e\u003cp\u003ePropelled by the continued adoption of streaming subscriptions around the world, the number of artists making more than $10k, more than $100k, more than $1 million, have each tripled over the last seven years. They can triple again.\u003c/p\u003e\u003cp\u003eBy and large it will come down to this: Today, there are more than \u003cstrong\u003e500 million\u003c/strong\u003e paying listeners across all music streaming services. If we as an industry can work together to reach 1 billion paying subscribers or even more, that will directly translate to more revenues being able to sustain more artists achieving all of those earning milestones.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eAccording to Spotify, “as a rule of thumb on Spotify, artists can start approaching $1 million per year with around 4-5 million monthly listeners or 20-25 million monthly streams.” How has this listener/streams/ earnings ratio changed over time?\u003c/h6\u003e\u003cp\u003eYes, we felt that’s a helpful, easy-to-understand guide. But the ratio that actually dictates earnings is an artist’s streams as a share of total streams. Your readers will know that streamshare is the actual way payouts on every major streaming service are calculated — not a fixed per-stream rate (there is a lot of misinformation out there about per-stream rates being how payouts work, but it’s not the case). If you get 1% of streams, you get 1% of the royalty pool.\u003c/p\u003e\u003cp\u003eIn 2024, an artist who received one in every million streams on Spotify generated over $10,000 on average. That’s 10x what the same streamshare would have generated a decade ago — when one in every one million streams generated only $1,000 on average.\u003c/p\u003e\u003cp\u003eEvery streaming service basically has the same music catalog. And so, as an artist, you have the same chance to reach the same level of popularity across each service. But the difference is, for that same exact level of popularity, Spotify pays the most. And that’s not by some obscure metric — that’s based on the literal metric that royalties are calculated with by every major streaming service.\u003c/p\u003e  \u003ch6\u003e80% of artists who generated $1m+ last year didn’t have a song reach the Spotify Global Daily Top 50 – what does this tell us about the changing dynamics of the music industry?\u003c/h6\u003e\u003cp\u003eIt means that independent musicians, less mainstream artists and niche genres can all thrive in the new streaming economy.\u003c/p\u003e\u003cp\u003ePeople think streaming is a “hits” economy — it’s not.\u003c/p\u003e\u003cp\u003eOver 80% of those reaching $1M+ per year were actively touring in 2024 (with at least one event listed on Spotify), so they are active artists currently building their career.\u003c/p\u003e\u003cp\u003eSuccess in the streaming era isn’t about chart-topping hits or legacy catalogs. It’s about building a loyal fanbase that keeps coming back.\u003c/p\u003e\u003chr/\u003e\u003cfigure\u003e\u003cimg src=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-80x40.jpg\" data-srcset=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-80x40.jpg 80w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-160x81.jpg 160w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-320x162.jpg 320w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-418x211.jpg 418w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-648x328.jpg 648w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-836x423.jpg 836w\" data-sizes=\"auto\" data-cfsrc=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-80x40.jpg\" srcset=\"https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-80x40.jpg 80w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-160x81.jpg 160w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-320x162.jpg 320w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-418x211.jpg 418w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-648x328.jpg 648w, https://www.musicbusinessworldwide.com/files/2025/03/Screenshot-2025-03-27-at-19.21.41-836x423.jpg 836w\"/\u003e\u003cfigcaption\u003eSource: Spotify\u003c/figcaption\u003e\u003c/figure\u003e\u003chr/\u003e\u003ch6\u003eSpotify claims in the report that in 2024, independent artists and labels collectively generated $5bn-plus, or about half of Spotify’s total payout to the industry. How do you predict the trend highlighted in the previous Q will impact this stat in the coming years?\u003c/h6\u003e\u003cp\u003eThere are simply more paths to success than there were previously. Compared to the CD era, there are more major signed successes, more indie successes and more DIY successes – all pathways are growing.\u003c/p\u003e\u003cp\u003eIn its heyday, the biggest record store could hold the music of a few thousand artists. And it was only for those with the means to get there – you needed real investment to record your music, have it physically produced, and distributed around the world.\u003c/p\u003e\u003cp\u003eFor indie artists to have carved out half of all revenues from the world’s largest retailer was unthinkable back then. Today, they’re building sustainable careers, gaining global audiences, and breaking down barriers.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eOf the artists who generated $1,000+ in royalties on Spotify in 2024, more than half saw most of their royalties come from listeners outside of their home countries – what does this tell us about the globalization of music?\u003c/h6\u003e\u003cp\u003eListeners today, especially young people, don’t care about rigid genres and they are open minded about new sounds.\u003c/p\u003e\u003cp\u003eAs Spotify’s global reach expands, artists are breaking into new markets faster and more successfully than ever before.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eWhat other trends did you identify this year that tie into this globalization narrative?\u003c/h6\u003e\u003cp\u003eThe 1,450 artists who generated $1 million-plus also record music in 17 different languages, which is pretty incredible. You think back ten or twenty years with a mostly US/EU-focused industry, and this definitely wasn’t the case.\u003c/p\u003e\u003cp\u003eOver 50 languages were represented among artists earning at least $100,000.\u003c/p\u003e\u003chr/\u003e\u003ch6\u003eWhat else should we know about the report?\u003c/h6\u003e\u003cp\u003eBeing a bit abstract… To me the most important thing about the report is that it exists. For our industry to have constructive dialogue about the health of the ecosystem and where it can improve, transparency is vital.\u003c/p\u003e\u003cp\u003e“I would love to see every corner of the industry share the data that they have so we can see an even more complete picture.\u003cspan\u003eMusic Business Worldwide\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-03-27T19:35:37Z",
  "modifiedTime": "2025-03-27T19:35:37Z"
}
