{
  "id": "be7342b5-7c39-4862-a8e3-25a5a2ff9012",
  "title": "RICHIE FAULKNER of JUDAS PRIEST Talks About Side Project, ELEGANT WEAPONS: “We Are Almost Finished Recording The Second Record”",
  "link": "https://metalinjection.net/news/richie-faulkner-of-judas-priest-talks-about-side-project-elegant-weapons-we-are-almost-finished-recording-the-second-record",
  "description": "Maybe Elegant Weapons fans can expect some new music soon? The post RICHIE FAULKNER of JUDAS PRIEST Talks About Side Project, ELEGANT WEAPONS: “We Are Almost Finished Recording The Second Record” appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Sun, 13 Apr 2025 19:23:28 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "judas priest",
    "richie faulkner"
  ],
  "byline": "By Isabella Ambrosio Published 5 hours ago",
  "length": 1470,
  "excerpt": "Maybe Elegant Weapons fans can expect some new music soon?",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Is it us, or does it feel like there's just new music coming from every angle? Richie Faulkner of Judas Priest just had a chat with Rolling Stone Brazil where he discussed the current status of a potential new record with his project, Elegant Weapons. Faulkner was happy to detail that the side project was \"almost finished recording the second record. We were recording vocals a couple of weeks ago. So it's nearly finished.\" However, the music isn't quite ready yet, and the band aren't sure when they would even be able to debut the new material: \"We don't know when it'll be released because we have commitments with Priest and other bands…\" Faulkner does say though, to \"keep an eye out\" for the upcoming music that which he says is an \"evolution the second time around because the band is solidified with Dave Rimmer (Uriah Heep) on bass and Christopher Williams (Accept).\"  It's safe to assume that's a fair bit in the future though, especially with Faulkner's commitment to Judas Priest and their incredibly packed summer schedule, playing three dates in Brazil in April, before stopping in Chile, Argentina, Colombia, El Salvador, and Mexico before heading off to Europe in June for a good ol' festival run. Check out what tour dates Judas Priest have coming up here. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/10/LTL-2024-D4-57-Judas-Priest-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eIs it us, or does it feel like there\u0026#39;s just new music coming from every angle? \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eRichie\u003c/strong\u003e \u003cstrong\u003eFaulkner\u003c/strong\u003e of \u003cstrong\u003eJudas\u003c/strong\u003e \u003cstrong\u003ePriest\u003c/strong\u003e just had a chat with \u003cem\u003eRolling Stone Brazil\u003c/em\u003e where he discussed the current status of a potential new record with his project, Elegant Weapons.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFaulkner\u003c/strong\u003e was happy to detail that the side project was \u0026#34;almost finished recording the second record. We were recording vocals a couple of weeks ago. So it\u0026#39;s nearly finished.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003eHowever, the music isn\u0026#39;t \u003cem\u003equite \u003c/em\u003eready yet, and the band aren\u0026#39;t sure when they would even be able to debut the new material: \u0026#34;We don\u0026#39;t know when it\u0026#39;ll be released because we have commitments with \u003cstrong\u003ePriest\u003c/strong\u003e and other bands…\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFaulkner\u003c/strong\u003e does say though, to \u0026#34;keep an eye out\u0026#34; for the upcoming music that which he says is an \u0026#34;evolution the second time around because the band is solidified with \u003cstrong\u003eDave\u003c/strong\u003e \u003cstrong\u003eRimmer\u003c/strong\u003e (\u003cstrong\u003eUriah\u003c/strong\u003e \u003cstrong\u003eHeep\u003c/strong\u003e) on bass and \u003cstrong\u003eChristopher\u003c/strong\u003e \u003cstrong\u003eWilliams\u003c/strong\u003e (\u003cstrong\u003eAccept\u003c/strong\u003e).\u0026#34; \u003c/p\u003e\n\n\n\n\u003cp\u003eIt\u0026#39;s safe to assume that\u0026#39;s a fair bit in the future though, especially with Faulkner\u0026#39;s commitment to Judas Priest and their incredibly packed summer schedule, playing three dates in Brazil in April, before stopping in Chile, Argentina, Colombia, El Salvador, and Mexico before heading off to Europe in June for a good ol\u0026#39; festival run.\n\n\n\n\u003c/p\u003e\u003cp\u003eCheck out what tour dates \u003cstrong\u003eJudas Priest\u003c/strong\u003e have coming up \u003ca href=\"https://judaspriest.com/tour/\"\u003ehere\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-13T15:23:28-04:00",
  "modifiedTime": "2025-04-13T15:40:43-04:00"
}
