{
  "id": "c6dc01cc-5bf8-44b0-8df2-46bf7db18588",
  "title": "A Vacation For Everyone With A Tribal Tattoo: MÖTLEY CRÜE \u0026 DEF LEPPARD Announce Destination Festival",
  "link": "https://metalinjection.net/tour-dates/a-vacation-for-everyone-with-a-tribal-tattoo-motley-crue-def-leppard-announce-destination-festival",
  "description": "Happening in Mexico. The post A Vacation For Everyone With A Tribal Tattoo: MÖTLEY CRÜE \u0026 DEF LEPPARD Announce Destination Festival appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Thu, 17 Apr 2025 19:58:15 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Tour Dates"
  ],
  "byline": "By Greg Kennelty Published 4 hours ago",
  "length": 1175,
  "excerpt": "Happening in Mexico.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Mötley Crüe and Def Leppard have teamed up for a brand-new destination festival in Riviera Maya, Mexico. The festival is called Rock The Tides, it's happening in November 2025, and unfortunately you will have to see Mötley Crüe live if you're attending. Sorry in advance. Def Leppard is excellent, though. The rest of the lineup is: Bret Michaels Extreme The Struts Buckcherry Dorothy Living Colour Moon Walker Velvet Daydream \"Mexico has always been one of the most electric places we've played – the energy is just unreal,\" said Mötley Crüe in a statement about the festival Rolling Stone. \"Some of our most unforgettable shows have happened there, and we know this one will be no different. We're excited to head back, team up with Def Leppard, and throw one hell of a party for everyone making the trip. It’s going to be an epic night.\" Tickets for the festival are available here. And for an extra $100, you get shielded from having to see Vince Neil in a Speedo. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2023/12/Motley-Crue-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003e\u003cstrong\u003eMötley Crüe\u003c/strong\u003e and \u003cstrong\u003eDef Leppard\u003c/strong\u003e have teamed up for a brand-new destination festival in Riviera Maya, Mexico. The festival is called Rock The Tides, it\u0026#39;s happening in November 2025, and unfortunately you will have to see \u003cstrong\u003eMötley Crüe\u003c/strong\u003e live if you\u0026#39;re attending. Sorry in advance. \u003cstrong\u003eDef Leppard\u003c/strong\u003e is excellent, though. The rest of the lineup is:\n\n\n\n\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eBret Michaels\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eExtreme\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eThe Struts\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eBuckcherry\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eDorothy\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eLiving Colour\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eMoon Walker\u003c/strong\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cstrong\u003eVelvet Daydream\u003c/strong\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u0026#34;Mexico has always been one of the most electric places we\u0026#39;ve played – the energy is just unreal,\u0026#34; said \u003cstrong\u003eMötley Crüe\u003c/strong\u003e in a statement about the festival \u003cem\u003eRolling Stone\u003c/em\u003e. \u0026#34;Some of our most unforgettable shows have happened there, and we know this one will be no different. We\u0026#39;re excited to head back, team up with \u003cstrong\u003eDef Leppard\u003c/strong\u003e, and throw one hell of a party for everyone making the trip. It’s going to be an epic night.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003eTickets for the \u003ca href=\"https://rockthetides.com/\"\u003efestival are available here\u003c/a\u003e. And for an extra $100, you get shielded from having to see \u003cstrong\u003eVince Neil\u003c/strong\u003e in a Speedo.\n\t\t\t\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-17T15:58:15-04:00",
  "modifiedTime": "2025-04-17T15:58:17-04:00"
}
