{
  "id": "ce288b6c-01e2-43eb-aa94-e94346e74dc6",
  "title": "Pete Townshend Says The Who Will Return in 2025",
  "link": "https://consequence.net/2024/10/the-who-reunion-2025-pete-towshend/",
  "description": "\"We're now eager to make a noise and make a mess and make mistakes.\" Pete Townshend Says The Who Will Return in 2025 Mary Siroky",
  "author": "Mary Siroky",
  "published": "Mon, 28 Oct 2024 20:30:37 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Music",
    "News",
    "Classic Rock",
    "Rock"
  ],
  "byline": "Mary Siroky",
  "length": 1404,
  "excerpt": "In a new interview, Pete Townshend has teased plans for a The Who reunion, relaying recent conversations with bandmate Roger Daltrey.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "While The Who haven’t been active as a group over the past year, the band’s co-founder, Pete Townshend, says good news is on the horizon for fans. In an interview with UK publication The London Standard, Townshend teased the potential of band activities in 2025. “I met with Roger for lunch a couple of weeks ago,” he revealed. “We’re in good form. We love each other. We’re both getting a bit creaky, but we will definitely do something next year.” While such plans could sound like new music or a set of live shows, Townshend explained that they’re currently leaning towards the latter, a reversal of a previous comment from Roger Daltrey about the financial stress of live performance. “The album side of it…Roger’s not keen,” Townshend shared. “But I would love to do another album and I may try to bully him on that. The last big tours that we’ve done have been with a full orchestra, which was glorious, but we’re now eager to make a noise and make a mess and make mistakes.” Earlier this year, Daltrey successfully executed a solo, “semi-acoustic” tour that hit 11 cities over the course of a month, which perhaps served as inspiration for more shows as a team. Elsewhere in the interview, the guitarist shared his perspective on another high-profile reunion, saying he’s “disappointed” to hear that Oasis are back together for upcoming live shows. “I really like their solo albums,” he explained.",
  "image": "https://consequence.net/wp-content/uploads/2024/10/the-who-2025-reunion.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1439161\" data-title=\"Pete Townshend Says The Who Will Return in 2025\" data-url=\"https://consequence.net/2024/10/the-who-reunion-2025-pete-towshend/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1439161\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"Pete Townshend Says The Who Will Return in 2025\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eWhile \u003ca href=\"https://consequence.net/artist/the-who/\" target=\"_blank\" rel=\"noopener\"\u003eThe Who\u003c/a\u003e haven’t been active as a group over the past year, the band’s co-founder, \u003ca href=\"https://consequence.net/artist/pete-townshend/\" target=\"_blank\" rel=\"noopener\"\u003ePete Townshend\u003c/a\u003e, says good news is on the horizon for fans.\u003c/p\u003e\n\u003cp\u003eIn an \u003ca href=\"https://www.standard.co.uk/culture/music/pete-townshend-the-who-keyboards-b1189594.html\" target=\"_blank\" rel=\"noopener nofollow\"\u003einterview\u003c/a\u003e with UK publication \u003cem\u003eThe London Standard\u003c/em\u003e, Townshend teased the potential of band activities in 2025. “I met with Roger for lunch a couple of weeks ago,” he revealed. “We’re in good form. We love each other. We’re both getting a bit creaky, but we will definitely do something next year.”\u003c/p\u003e\n\u003cp\u003eWhile such plans could sound like new music or a set of live shows, Townshend explained that they’re currently leaning towards the latter, a reversal of a \u003ca href=\"https://consequence.net/2023/04/the-who-roger-daltrey-too-expensive-tour-america/\" target=\"_blank\" rel=\"noopener\"\u003eprevious comment\u003c/a\u003e from \u003ca href=\"https://consequence.net/artist/roger-daltrey/\" target=\"_blank\" rel=\"noopener\"\u003eRoger Daltrey\u003c/a\u003e about the financial stress of live performance.\u003c/p\u003e\n\u003cp\u003e“The album side of it…Roger’s not keen,” Townshend shared. “But I would love to do another album and I may try to bully him on that. The last big tours that we’ve done have been with a full orchestra, which was glorious, but we’re now eager to make a noise and make a mess and make mistakes.” Earlier this year, Daltrey successfully executed a \u003ca href=\"https://consequence.net/2024/03/roger-daltrey-2024-solo-tour/\" target=\"_blank\" rel=\"noopener\"\u003esolo\u003c/a\u003e, “semi-acoustic” tour that hit 11 cities over the course of a month, which perhaps served as inspiration for more shows as a team.\u003c/p\u003e\n\u003cp\u003eElsewhere in the interview, the guitarist shared his perspective on another \u003ca href=\"https://consequence.net/2024/08/oasis-reunion-concerts-2025/\" target=\"_blank\" rel=\"noopener\"\u003ehigh-profile reunion\u003c/a\u003e, saying he’s “disappointed” to hear that Oasis are back together for upcoming live shows. “I really like their solo albums,” he explained.\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-10-28T16:30:37-04:00",
  "modifiedTime": null
}
