{
  "id": "cf970764-e46c-451b-9713-6dbdbb5014dd",
  "title": "Bassist FIELDY Hasn't Spoken To KORN \"Since 2019\"",
  "link": "https://metalinjection.net/news/bassist-fieldy-hasnt-spoken-to-korn-since-2019",
  "description": "Well, that's a new one – a member of a band who hasn't spoken to said-band in over 5 years... The post Bassist FIELDY Hasn't Spoken To KORN \"Since 2019\" appeared first on Metal Injection.",
  "author": "Isabella Ambrosio",
  "published": "Sat, 22 Feb 2025 21:05:40 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Latest News",
    "featured1",
    "fieldy",
    "korn"
  ],
  "byline": "By Isabella Ambrosio Published 4 hours ago",
  "length": 1318,
  "excerpt": "Well, that's a new one – a member of a band who hasn't spoken to said-band in over 5 years...",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Even though Fieldy is technically still a member of Korn, a recent interview with Basement Talk – a series on YouTube – reveals that the bassist actually hasn't spoken to the band since 2019. Intentionally vague when responding to a question about his status in the band, Fieldy admits, \"I haven't talked to those guys since 2019.\" It appears he starts to say, \"We kind of just both…\" before redirecting his answer, \"They're truckin'. They're a machine. They're going. It's insane. It's dope that they can keep on going like that. It's cool to see them keep on going, but I need to chill.\" Fieldy has not been apart of the official Korn roster for some time now. Even if he's still listed as a band member, Wikipedia clarifies he has been on hiatus from the band since 2021. Since then, Ra Díaz has stepped in as Korn's touring bassist. Planning on revamping his previous project Stillwell with P.O.D. drummer Noah \"Wuv\" Benardo and vocalist/guitarist Q-Unique, Fieldy elaborated that he was working on some new material with the group alongside the addition of some new members. You can check out the Fieldy interview below. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/02/IMG_3805.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eEven though \u003cstrong\u003eFieldy\u003c/strong\u003e is technically still a member of \u003cstrong\u003eKorn\u003c/strong\u003e, a recent interview with Basement Talk – a series on YouTube – reveals that the bassist actually hasn\u0026#39;t spoken to the band since 2019.\u003c/p\u003e\n\n\n\n\u003cp\u003eIntentionally vague when responding to a question about his status in the band, \u003cstrong\u003eFieldy\u003c/strong\u003e admits, \u0026#34;I haven\u0026#39;t talked to those guys since 2019.\u0026#34; It appears he starts to say, \u0026#34;We kind of just both…\u0026#34; before redirecting his answer, \u0026#34;They\u0026#39;re truckin\u0026#39;. They\u0026#39;re a machine. They\u0026#39;re going. It\u0026#39;s insane. It\u0026#39;s dope that they can keep on going like that. It\u0026#39;s cool to see them keep on going, but I need to chill.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFieldy\u003c/strong\u003e has not been apart of the official \u003cstrong\u003eKorn\u003c/strong\u003e roster for some time now. Even if he\u0026#39;s still listed as a band member, Wikipedia clarifies he has been on hiatus from the band since 2021. Since then, \u003cstrong\u003eRa Díaz\u003c/strong\u003e has stepped in as \u003cstrong\u003eKorn\u003c/strong\u003e\u0026#39;s touring bassist.\n\n\n\n\u003c/p\u003e\u003cp\u003ePlanning on revamping his previous project \u003cstrong\u003eStillwell\u003c/strong\u003e with \u003cstrong\u003eP.O.D.\u003c/strong\u003e drummer \u003cstrong\u003eNoah \u0026#34;Wuv\u0026#34; Benardo\u003c/strong\u003e and vocalist/guitarist \u003cstrong\u003eQ-Unique\u003c/strong\u003e, \u003cstrong\u003eFieldy\u003c/strong\u003e elaborated that he was working on some new material with the group alongside the addition of some new members.\n\n\n\n\u003c/p\u003e\u003cp\u003eYou can check out the \u003cstrong\u003eFieldy\u003c/strong\u003e interview below.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"\u0026#39;Fieldy\u0026#39; Reginald Arvizu on Untold KoRn Stories, First Show Ever, \u0026amp; Rockstar Lifestyle\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/cH9Gyw-3_cs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-22T16:05:40-05:00",
  "modifiedTime": "2025-02-22T16:07:58-05:00"
}
