{
  "id": "d2bae9c1-ff97-442a-bfb8-9c4852833f5f",
  "title": "Grammys 2025 Winners: See the Full List Here",
  "link": "https://pitchfork.com/news/grammys-2025-winners-see-the-full-list-here",
  "description": "Who’ll win Best New Artist, Album of the Year, Song of the Year, and Record of the Year? Check here for the full list.",
  "author": "Madison Bloom, Eric Torres",
  "published": "Mon, 03 Feb 2025 00:22:19 +0000",
  "source": "http://pitchfork.com/rss/news",
  "categories": [
    "News"
  ],
  "byline": "Madison Bloom, Eric Torres",
  "length": 22582,
  "excerpt": "Who’ll win Best New Artist, Album of the Year, Song of the Year, and Record of the Year? Check here for the full list.",
  "siteName": "Pitchfork",
  "favicon": "",
  "text": "The 2025 Grammy Awards take place today in Los Angeles, and the biggest names in music are vying for the coveted golden gramophone—or several. Beyoncé enters the day with a whopping 11 nominations—an achievement that brought her career total to 99, and broke her tie with husband Jay-Z. Will tonight mark the first time she takes home Album of the Year?Post Malone and Kendrick Lamar are sitting pretty with eight and seven nominations, respectively. Repeat Grammy favorites Billie Eilish and Taylor Swift, as well as newcomers Sabrina Carpenter and Chappell Roan, earned six nods each this year, while Charli XCX is competing in seven categories this evening thanks to her wildly popular Brat.Trevor Noah will handle hosting duties during the main Grammys ceremony for the fifth year running. Performers during the show include Billie Eilish, Charli XCX, Doechii, Chappell Roan, Sabrina Carpenter, Shakira, Benson Boone, and Teddy Swims, among several others.Last year’s Big Four winners were Taylor Swift (Album of the Year), Miley Cyrus (Record of the Year), Billie Eilish (Song of the Year), and Victoria Monét (Best New Artist). The night also included wins for SZA, Karol G, Killer Mike, and more.Get ready with Pitchfork’s predictions for who will snatch up trophies, and follow along with all of Pitchfork’s coverage of the 2025 Grammy Awards.Best Contemporary Classical CompositionAndrea Casarrubios - Casarrubios: Seven for Solo CelloDecoda - Coleman: RevelryEsa-Pekka Salonen, Fleur Barron, Nicholas Phan, Christopher Purves, Axelle Fanyo \u0026 San Francisco Symphony Chorus \u0026 Orchestra - Saariaho: Adriana MaterEighth Blackbird - Lang: Composition as ExplanationWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026 Los Angeles Master Chorale - Ortiz: Revolución DiamantinaBest Classical CompendiumAmy Porter, Nikki Chooi, Buffalo Philharmonic Orchestra \u0026 JoAnn Falletta - Lukas Foss: Symphony No. 1 \u0026 Renaissance ConcertoAndy Akiho \u0026 Imani Winds - BeLongingDanaë Xanthe Vlasse, Royal Philharmonic Orchestra \u0026 Michael Shapiro - Mythologies IIExperiential Orchestra, James Blachly \u0026 Curtis J Stewart - American CounterpointsWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026 María Dueñas - Gabriela Ortiz: Revolución DiamantinaBest Arrangement, Instruments and VocalsCody Fry Featuring Sleeping at Last - The Sound of SilenceJohn Legend - Always Come BackWINNER: Säje Featuring Regina Carter - AlmaWillow - Big FeelingsThe 8-Bit Big Band Featuring Jonah Nilsson \u0026 Button Masher - Last Surprise (From “Persona 5”)Best Arrangement, Instrumental or A CappellaBéla Fleck - Rhapsody in Blue(Grass)Henry Mancini \u0026 Snarky Puppy - Baby Elephant Walk (Encore)WINNER: Jacob Collier Featuring John Legend \u0026 Tori Kelly - Bridge Over Troubled WaterSäje - Silent NightScott Hoying Featuring Säje \u0026 Tonality - Rose Without the ThornsBest Musical Theater AlbumWINNER: Hell’s KitchenMerrily We Roll AlongThe NotebookThe OutsidersSuffsThe WizBest Spoken Word Poetry AlbumMalik Yusef - Good M.U.S.I.C. Universe Sonic Sinema Episode 1: In the Beginning Was the WordOmari Hardwick - Concrete \u0026 Whiskey Act II Part 1: A Bourbon 30 SeriesQueen Sheba - Civil Writes: The South Got Something to SaySkillz - The Seven Number OnesWINNER: Tank and the Bangas - The Heart, the Mind, the SoulBest Classical Solo Vocal AlbumFotina Naumenko - Bespoke SongsJoyce DiDonato, Il Pomo d’Oro \u0026 Maxim Emelyanychev - Wagner: Wesendonck LiederWINNER: Karen Slack \u0026 Michelle Cann - Beyond the YearsNicholas Phan, Farayi Malek \u0026 Palaver Strings - A Change Is Gonna ComeWill Liverman \u0026 Jonathan King - Show Me the WayBest Classical Instrumental SoloAndy Akiho - Akiho: LongingCurtis J Stewart, James Blachly \u0026 Experiential Orchestra - Perry: Concerto for Violin and OrchestraMak Grgić \u0026 Ensemble Dissonance - EntourerSeth Parker Woods - Eastman The Holy Presence of Joan d’ArcWINNER: Víkingur Ólafsson - J. S. Bach: Goldberg VariationsBest Chamber Music/Small Ensemble PerformanceWINNER: Caroline Shaw \u0026 Sō Percussion - Rectangles and CircumstanceJACK Quartet - John Luther Adams: Waves \u0026 ParticlesLorelei Ensemble \u0026 Christopher Cerrone - Christopher Cerrone: Beaufort ScalesMiró Quartet - HomeYo-Yo Ma, Leonidas Kavakos \u0026 Emanuel Ax - Beethoven for Three: Symphony No. 4 and Op. 97 “Archduke”Best Choral PerformanceApollo’s Fire \u0026 Jeannette Sorrell - Handel: Israel in Egypt, HWV 54The Choir of Trinity Wall Street, Artefact Ensemble \u0026 Novus NY - Sheehan: AkathistWINNER: The Crossing, Donald Nally \u0026 Dan Schwartz - OchreSkylark Vocal Ensemble \u0026 Matthew Guard - Clear Voices in the DarkTrue Concord Voices \u0026 Orchestra, Jeffrey Biegel \u0026 Eric Holtan - A Dream So Bright: Choral Music of Jake RunestadBest Opera RecordingLos Angeles Philharmonic, John Adams \u0026 Los Angeles Master Chorale - John Adams: Girls of the Golden WestLyric Opera of Kansas City \u0026 Gerard Schwarz - Moravec: The ShiningThe Metropolitan Opera Orchestra \u0026 The Metropolitan Opera Chorus - Catán: Florencia en el AmazonasThe Metropolitan Opera Orchestra \u0026 The Metropolitan Opera Chorus - Puts: The HoursWINNER: San Francisco Symphony Chorus \u0026 San Francisco Symphony - Saariaho: Adriana MaterBest Orchestral PerformanceBuffalo Philharmonic Orchestra \u0026 JoAnn Falletta - Kodály: Háry János Suite, Nyári este \u0026 Symphony in C MajorEsa-Pekka Salonen \u0026 San Francisco Symphony - Stravinsky: The FirebirdWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026 María Dueñas - Gabriela Ortiz: Revolución DiamantinaORF Vienna Radio Symphony Orchestra \u0026 Marin Alsop - John Adams: City Noir, Fearful Symmetries \u0026 Lola Montez Does the Spider DanceSusanna Mälkki \u0026 Helsinki Philharmonic Orchestra - Sibelius: Karelia Suite, Rakastava \u0026 LemminkäinenBest Instrumental CompositionWINNER: Akropolis Reed Quintet, Pascal Le Boeuf \u0026 Christian Euman - StrandsAndré 3000 - I Swear, I Really Wanted to Make a “Rap” Album but This Is Literally the Way the Wind Blew Me This TimeChick Corea \u0026 Béla Fleck - RemembranceChristopher Zuar Orchestra - CommunionShelly Berg - At LastBest Immersive Audio AlbumEnsemble 96, Current Saxophone Quartet \u0026 Nina T. Karlsen - PaxWINNER: Peter Gabriel - I/O (In-Side Mix)Ray Charles \u0026 Various Artists - Genius Loves CompanyRoxy Music - AvalonTrondheim Symphony Orchestra \u0026 Nick Davies - Henning Sommerro: BordersProducer of the Year, ClassicalChristoph FrankeDirk SobotkaDmitriy LipayWINNER: Elaine MartoneErica BrennerMorten LindbergBest Engineered Album, ClassicalLos Angeles Philharmonic, Gustavo Dudamel \u0026 María Dueñas - Gabriela Ortiz: Revolución DiamantinaLos Angeles Philharmonic, John Adams \u0026 Los Angeles Master Chorale - John Adams: Girls of the Golden WestWINNER: Pittsburgh Symphony Orchestra \u0026 Manfred Honeck - Bruckner: Symphony No. 7 – Bates: Resurrexit (Live)Skylark Vocal Ensemble \u0026 Matthew Guard - Clear Voices in the DarkTimo Andres, Andrew Cyr \u0026 Metropolis Ensemble - Timo Andres: The Blind BanisterBest New Age, Ambient, or Chant AlbumAnoushka Shankar - Chapter II: How Dark It Is Before DawnChris Redding - Visions of Sounds De LuxeRadhika Vekaria - Warriors of LightRicky Kej - Break of DawnRyuichi Sakamoto - OpusWINNER: Wouter Kellerman, Éru Matsumoto \u0026 Chandrika Tandon - TriveniBest Reggae AlbumCollie Buddz - Take It EasyShenseea - Never Gets Late HereWINNER: Various Artists - Bob Marley: One Love - Music Inspired By the Film (Deluxe)Vybz Kartel - Party With MeThe Wailers - EvolutionBest Global Music AlbumAntonio Rey - Historias de un FlamencoCiro Hurtado - PaisajesWINNER: Matt B \u0026 Royal Philharmonic Orchestra - Alkebulan IIRema - HeisTems - Born in the WildBest African Music PerformanceAsake \u0026 Wizkid - MMSBurna Boy - HigherChris Brown Featuring Davido \u0026 Lojay - SensationalWINNER: Tems - Love Me JeJeYemi Alade - TomorrowBest Global Music PerformanceAngélique Kidjo \u0026 Soweto Gospel Choir - Sunlight to My SoulArooj Aftab - Raat Ki RaniJacob Collier Featuring Anoushka Shankar \u0026 Varijashree Venugopal - A Rock SomewhereMasa Takumi Featuring Ron Korb, Noshir Mody \u0026 Dale Edward Chung - KashiraRocky Dawuni - RiseWINNER: Sheila E. Featuring Gloria Estefan \u0026 Mimy Succar - Bemba ColoráBest Contemporary Instrumental AlbumBéla Fleck - Rhapsody in BlueBill Frisell - Orchestras (Live)Julian Lage - Speak to MeMark Guiliana - MarkWINNER: Taylor Eigsti - Plot ArmorBest Alternative Jazz AlbumArooj Aftab - Night ReignAndré 3000 - New Blue SunKeyon Harrold - ForeverlandWINNER: Meshell Ndegeocello - No More Water: The Gospel of James BaldwinRobert Glasper - Code DerivationBest Latin Jazz AlbumDonald Vega Featuring Lewis Nash, John Patitucci \u0026 Luisito Quintero- As I TravelEliane Elias - Time and AgainHamilton de Holanda \u0026 Gonzalo Rubalcaba - CollabHoracio ‘El Negro’ Hernandez, John Beasley \u0026 Jose Gola - El Trio: Live in ItalyMichel Camilo \u0026 Tomatito - Spain Forever AgainWINNER: Zaccai Curtis - Cubop Lives!Best Large Jazz Ensemble AlbumThe Clayton-Hamilton Jazz Orchestra - And So It GoesWINNER: Dan Pugach - Bianca ReimaginedJohn Beasley Featuring Frankfurt Radio Big Band - Returning to ForeverMiguel Zenón - Golden CityOrrin Evans \u0026 The Captain Black Big Band - Walk a Mile in My ShoeBest Jazz Instrumental AlbumAmbrose Akinmusire - Owl SongWINNER: Chick Corea \u0026 Béla Fleck - RemembranceKenny Barron - Beyond This PlaceLakecia Benjamin - Phoenix Reimagined (Live)Sullivan Fortner - Solo GameBest Jazz Vocal AlbumCatherine Russell \u0026 Sean Mason - My IdealChristie Dashiell - Journey in BlackKurt Elling \u0026 Sullivan Fortner - Wildflowers Vol. 1Milton Nascimento \u0026 Esperanza Spalding - Milton + EsperanzaWINNER: Samara Joy - A Joyful HolidayBest Jazz PerformanceThe Baylor Project - Walk With Me, Lord (Sound | Spirit)Chick Corea \u0026 Béla Fleck - JunoDan Pugach \u0026 Nicole Zuraitis Featuring Troy Roberts - Little FearsLakecia Benjamin Featuring Randy Brecker, Jeff “Tain” Watts \u0026 John Scofield - Phoenix Reimagined (Live)WINNER: Samara Joy Featuring Sullivan Fortner - Twinkle Twinkle Little MeBest Engineered Album, Non-ClassicalCharlotte Day Wilson - Cyan BlueKacey Musgraves - Deeper WellLucky Daye - AlgorithmWINNER: Peter Gabriel - I/OSabrina Carpenter - Short n’ SweetWillow - EmpathogenBest Song Written for Visual MediaBarbra Streisand - Love Will Survive (From The Tattooist of Auschwitz)WINNER: Jon Batiste - It Never Went Away (From the Netflix Documentary “American Symphony”)Luke Combs - Ain’t No Love in Oklahoma (From Twisters: The Album)*NSync \u0026 Justin Timberlake - Better Place (From Trolls Band Together)Olivia Rodrigo - Can’t Catch Me Now (From The Hunger Games: The Ballad of Songbirds \u0026 Snakes)Best Score Soundtrack for Video Games and Other Interactive MediaBear McCreary - God of War Ragnarök: ValhallaJohn Paesano - Marvel’s Spider-Man 2Pinar Toprak - Avatar: Frontiers of PandoraWilbert Roget II - Star Wars OutlawsWINNER: Winifred Phillips - Wizardry: Proving Grounds of the Mad OverlordBest Score Soundtrack for Visual Media (Includes Film and Television)Kris Bowers - The Color PurpleWINNER: Hans Zimmer - Dune: Part TwoLaura Karpman - American FictionNick Chuba, Atticus Ross \u0026 Leopold Ross - ShōgunTrent Reznor \u0026 Atticus Ross - ChallengersBest Compilation Soundtrack for Visual MediaWINNER: London Symphony Orchestra, Yannick Nézet-Séguin \u0026 Bradley Cooper - Maestro: Music by Leonard BernsteinVarious Artists - The Color PurpleVarious Artists - Deadpool \u0026 WolverineVarious Artists - SaltburnVarious Artists - Twisters: The AlbumBest Alternative Music AlbumBrittany Howard - What NowClairo - CharmKim Gordon - The CollectiveNick Cave \u0026 the Bad Seeds - Wild GodWINNER: St. Vincent - All Born ScreamingBest Alternative Music PerformanceCage the Elephant - Neon PillFontaines D.C. - StarbursterKim Gordon - Bye ByeNick Cave \u0026 the Bad Seeds - Song of the LakeWINNER: St. Vincent - FleaBest Rock AlbumThe Black Crowes - Happiness BastardsFontaines D.C. - RomanceGreen Day - SaviorsIdles - TangkJack White - No NamePearl Jam - Dark MatterWINNER: The Rolling Stones - Hackney DiamondsBest Rock SongThe Black Keys - Beautiful People (Stay High)Green Day - DilemmaIdles - Gift HorsePearl Jam - Dark MatterWINNER: St. Vincent - Broken ManBest Metal PerformanceWINNER: Gojira, Marina Viotti \u0026 Victor le Masne - Mea Culpa (Ah! Ça ira!)Judas Priest - Crown of HornsKnocked Loose Featuring Poppy - SuffocateMetallica - Screaming SuicideSpiritbox - Cellar DoorBest Rock PerformanceWINNER: The Beatles - Now and ThenThe Black Keys - Beautiful People (Stay High)Green Day - The American Dream Is Killing MeIdles - Gift HorsePearl Jam - Dark MatterSt. Vincent - Broken ManProducer of the Year, Non-ClassicalAlissiaWINNER: Daniel NigroDernst “D’Mile” Emile IIIan FitchukMustardBest Historical AlbumWINNER: King Oliver’s Creole Jazz Band \u0026 Various Artists - CentennialPaul Robeson - Paul Robeson – Voice of Freedom: His Complete Columbia, RCA, HMV, and Victor RecordingsPepe de Lucía \u0026 Paco de Lucía - Pepito y PaquitoPrince \u0026 the New Power Generation - Diamonds and Pearls (Super Deluxe Edition)Rodgers \u0026 Hammerstein \u0026 Julie Andrews - The Sound of Music (Original Soundtrack Recording) (Super Deluxe Edition)Best Album NotesAlice Coltrane - The Carnegie Hall Concert (Live)Ford Dabney’s Syncopated Orchestras - After MidnightJohn Culshaw - John Culshaw - The Art of the Producer - The Early Years 1948-55WINNER: King Oliver’s Creole Jazz Band \u0026 Various Artists - CentennialVarious Artists - SONtrack Original de la Película “Al Son de Beno”Best Boxed or Special Limited Edition PackageAlpha Wolf - Half Living ThingsWINNER: John Lennon - Mind GamesKate Bush - Hounds of Love (The Boxes of Lost at Sea)Nirvana - In UteroUnsuk Chin \u0026 Berliner Philharmoniker - Unsuk Chin90 Day Men - We Blame ChicagoBest Recording PackageThe Avett Brothers - The Avett BrothersWINNER: Charli XCX - BratiWhoiWhoo - Pregnancy, Breakdown, and DiseaseKate Bush - Hounds of Love (Baskerville Edition)The Muddy Basin Ramblers - Jug Band MillionairePost Malone - F-1 TrillionWilliam Clark Green - Baker HotelBest Audio Book, Narration, and Storytelling RecordingBarbra Streisand - My Name Is BarbraDolly Parton - Behind the Seams: My Life in RhinestonesGeorge Clinton - ...And Your Ass Will FollowWINNER: Jimmy Carter - Last Sundays in Plains: A Centennial CelebrationVarious Artists - All You Need Is Love: The Beatles in Their Own WordsBest Comedy AlbumWINNER: Dave Chappelle - The DreamerJim Gaffigan - The PrisonerNikki Glaser - Someday You’ll DieRicky Gervais - ArmageddonTrevor Noah - Where Was IBest Children’s Music AlbumDivinity Roxx \u0026 Divi Roxx Kids - World Wide PlaydateJohn Legend - My Favorite DreamWINNER: Lucky Diaz and the Family Jam Band - ¡Brillo, Brillo!Lucy Kalantari \u0026 the Jazz Cats - CreciendoRock for Children - Solid Rock RevivalBest Traditional Pop Vocal AlbumAaron Lazar - Impossible DreamCyrille Aimée - À Fleur de PeauGregory Porter - Christmas WishLake Street Dive - Good TogetherWINNER: Norah Jones - VisionsBest Music FilmWINNER: Jon Batiste - American SymphonyJune Carter Cash - JuneRun-DMC - Kings From QueensSteven Van Zandt - Stevie Van Zandt: DiscipleVarious Artists - The Greatest Night in PopBest Music VideoA$AP Rocky - Tailor SwifCharli XCX - 360Eminem - HoudiniWINNER: Kendrick Lamar - Not Like UsTaylor Swift Featuring Post Malone - FortnightBest Rap SongFuture, Metro Boomin \u0026 Kendrick Lamar - Like ThatGlorilla - Yeah Glo!WINNER: Kendrick Lamar - Not Like UsRapsody \u0026 Hit-Boy - Asteroids¥$, Kanye West, Ty Dolla $ign \u0026 Rich the Kid Featuring Playboi Carti - CarnivalBest Melodic Rap PerformanceBeyoncé, Linda Martell \u0026 Shaboozey - SpaghettiiFuture, Metro Boomin \u0026 The Weeknd - We Still Don’t Trust YouJordan Adetunji Featuring Kehlani - Kehlani (Remix)Latto - Big MamaWINNER: Rapsody Featuring Erykah Badu - 3:AMBest Rap PerformanceCardi B - Enough (Miami)Common \u0026 Pete Rock Featuring Posdnuos - When the Sun Shines AgainDoechii - Nissan AltimaEminem - HoudiniFuture, Metro Boomin \u0026 Kendrick Lamar - Like ThatGlorilla - Yeah Glo!WINNER: Kendrick Lamar - Not Like UsBest R\u0026B AlbumWINNER: Chris Brown - 11:11 (Deluxe)Lalah Hathaway - VantablackLucky Daye - AlgorithmMuni Long - RevengeUsher - Coming HomeBest Progressive R\u0026B AlbumWINNER: Avery*Sunshine - So Glad to Know YouChildish Gambino - Bando Stone and the New WorldDurand Bernarr - En RouteKehlani - CrashWINNER: NxWorries - Why Lawd?Best R\u0026B SongCoco Jones - Here We Go (Uh Oh)Kehlani - After HoursMuni Long - Ruined MeWINNER: SZA - SaturnTems - BurningBest Traditional R\u0026B PerformanceKenyon Dixon - Can I Have This GrooveLalah Hathaway Featuring Michael McDonald - No LieWINNER: Lucky Daye - That’s YouMarsha Ambrosius - WetMuni Long - Make Me ForgetBest R\u0026B PerformanceChris Brown - ResidualsCoco Jones - Here We Go (Uh Oh)Jhené Aiko - GuidanceWINNER: Muni Long - Made for Me (Live on BET)SZA - SaturnSongwriter of the Year, Non-ClassicalWINNER: Amy AllenEdgar BarreraJessi AlexanderJessie Jo DillonRayeBest Tropical Latin AlbumJuan Luis Guerra 4.40 - Radio GüiraKiki Valera - Vacilón SantiagueroMarc Anthony - MuevenseSheila E. - BailarWINNER: Tony Succar \u0026 Mimy Succar - Alma, Corazón y Salsa (Live at Gran Teatro Nacional)Best Música Mexicana Album (Including Tejano)WINNER: Carín León - Boca Chueca, Vol. 1Chiquis - DiamantesJessi Uribe - De LejitosPeso Pluma - ÉxodoBest Latin Rock or Alternative AlbumCimafunk - Pa’ Tu CuerpaEl David Aguilar - Compita del DestinoMon Laferte - AutopoiéticaNathy Peluso - GrasaWINNER: Rawayana - ¿Quién Trae las Cornetas?Best Música Urbana AlbumBad Bunny - Nadie Sabe Lo Que Va a Pasar MañanaFeid - FerxxocalipsisJ Balvin - RayoWINNER: Residente - Las Letras Ya No ImportanYoung Miko - Att.Best Contemporary Blues AlbumAntonio Vergara - The FuryJoe Bonamassa - Blues Deluxe Vol. 2WINNER: Ruthie Foster - MileageShemekia Copeland - Blame It on EveSteve Cropper \u0026 The Midnight Hour - FriendlytownBest Traditional Blues AlbumCedric Burnside - Hill Country LoveThe Fabulous Thunderbirds - Struck DownLittle Feat - Sam’s PlaceSue Foley - One Guitar WomanWINNER: Taj Mahal - Swingin’: Live at the Church in TulsaBest American Roots PerformanceThe Fabulous Thunderbirds Featuring Bonnie Raitt, Keb’ Mo’, Taj Mahal \u0026 Mick Fleetwood - Nothing in RamblingRhiannon Giddens - The Ballad of Sally AnneShemekia Copeland - Blame It on EveWINNER: Sierra Ferrell - LighthouseBest Country SongBeyoncé - Texas Hold ’EmJelly Roll - I Am Not OkayWINNER: Kacey Musgraves - The ArchitectPost Malone Featuring Morgan Wallen - I Had Some HelpShaboozey - A Bar Song (Tipsy)Best Country Duo/Group PerformanceWINNER: Beyoncé \u0026 Miley Cyrus - II Most WantedBrothers Osborne - Break MineDan + Shay - Bigger HousesKelsea Ballerini \u0026 Noah Kahan - Cowboys Cry TooPost Malone Featuring Morgan Wallen - I Had Some HelpBest Country Solo PerformanceBeyoncé - 16 CarriagesWINNER: Chris Stapleton - It Takes a WomanJelly Roll - I Am Not OkayKacey Musgraves - The ArchitectShaboozey - A Bar Song (Tipsy)Best Roots Gospel AlbumAuthentic Unlimited - The Gospel Sessions, Vol. 2WINNER: Cory Henry - ChurchThe Harlem Gospel Travelers - RhapsodyMark D. Conklin - The Gospel According to MarkThe Nelons - Loving YouBest Contemporary Christian Music AlbumBrandon Lake - Coat of Many ColorsWINNER: Doe - Heart of a HumanElevation Worship - When Wind Meets FireForrest Frank - Child of GodMaverick City Music, Chandler Moore \u0026 Naomi Raine - The Maverick Way CompleteBest Gospel AlbumWINNER: CeCe Winans - More Than ThisKaren Clark Sheard - Still KarenKirk Franklin - Father’s DayMelvin Crispell III - Covered Vol. 1Ricky Dillard - Choirmaster II (Live)Best Contemporary Christian Music Performance/SongBethel Music, Jenn Johnson Featuring CeCe Winans - Holy Forever (Live)WINNER: CeCe Winans - That’s My KingElevation Worship Featuring Brandon Lake, Chris Brown \u0026 Chandler Moore - PraiseHonor \u0026 Glory \u0026 Disciple - Firm Foundation (He Won’t)Jwlkrs Worship \u0026 Maverick City Music Featuring Chandler Moore - In the Name of JesusMaverick City Music, Naomi Raine \u0026 Chandler Moore Featuring Tasha Cobbs Leonard - In the RoomBest Gospel Performance/SongDoe - Holy HandsMelvin Crispell III - YesterdayRicky Dillard - Hold On (Live)WINNER: Tasha Cobbs Leonard, Erica Campbell \u0026 Israel Houghton Featuring Jonathan McReynolds \u0026 Jekalyn Carr - One HallelujahYolanda Adams - Church DoorsBest Regional Roots Music AlbumBig Chief Monk Featuring J’wan Boudreaux - Live at the 2024 New Orleans Jazz \u0026 Heritage FestivalWINNER: Kalani Pe'a - KuiniNew Breed Brass Band Featuring Trombone Shorty - Live at the 2024 New Orleans Jazz \u0026 Heritage FestivalThe Rumble - Stories From the BattlefieldSean Ardoin \u0026 Kreole Rock and Soul - 25 Back to My RootsBest Folk AlbumAdrianne Lenker - Bright FutureAmerican Patchwork Quartet - American Patchwork QuartetAoife O’Donovan - All My FriendsWINNER: Gillian Welch \u0026 David Rawlings - WoodlandMadi Diaz - Weird FaithBest Bluegrass AlbumWINNER: Billy Strings - Live Vol. 1Bronwyn Keith-Hynes - I Built a WorldDan Tyminski - Dan Tyminski: Live From the RymanThe Del McCoury Band - Songs of Love and LifeSister Sadie - No FearTony Trischka - Earl JamBest Americana AlbumCharley Crockett - $10 CowboyMaggie Rose - No One Gets Out AliveSarah Jarosz - Polaroid LoversWINNER: Sierra Ferrell - Trail of FlowersT Bone Burnett - The Other SideWaxahatchee - Tigers BloodBest American Roots SongAoife O’Donovan - All My FriendsIron \u0026 Wine \u0026 Fiona Apple - All in Good TimeMark Knopfler - Ahead of the GameShemekia Copeland - Blame It on EveWINNER: Sierra Ferrell - American DreamingBest Americana PerformanceBeyoncé - Ya YaGillian Welch \u0026 David Rawlings - Empty Trainload of SkyMadi Diaz \u0026 Kacey Musgraves - Don’t Do Me GoodMadison Cunningham - SubtitlesSarah Jarosz - Runaway TrainWINNER: Sierra Ferrell - American DreamingBest Remixed RecordingCharli XCX - Von Dutch A. G. Cook Remix Featuring Addison RaeDoechii \u0026 Kaytranada Featuring JT - Alter Ego (Kaytranada Remix)Julian Marley \u0026 Antaeus - Jah Sees Them (Amapiano Remix)WINNER: Sabrina Carpenter - Espresso (Mark Ronson x FNZ Working Late Remix)Shaboozey \u0026 David Guetta - A Bar Song (Tipsy) (Remix)Best Dance/Electronic Music AlbumWINNER: Charli XCX - BratFour Tet - ThreeJustice - HyperdramaKaytranada - TimelessZedd - TelosBest Dance Pop RecordingAriana Grande - Yes, And?Billie Eilish - L’Amour de Ma Vie [Over Now Extended Edit]WINNER: Charli XCX - Von DutchMadison Beer - Make You MineTroye Sivan - Got Me StartedBest Dance/Electronic RecordingDisclosure - She’s Gone, Dance OnFour Tet - LovedFred Again.. \u0026 Baby Keem - LeavemealoneWINNER: Justice \u0026 Tame Impala - NeverenderKaytranada Featuring Childish Gambino - WitchyBest Pop Solo PerformanceBeyoncé - BodyguardBillie Eilish - Birds of a FeatherChappell Roan - Good Luck, Babe!Charli XCX - AppleWINNER: Sabrina Carpenter - Espresso",
  "image": "https://media.pitchfork.com/photos/679fa99d55e69a42e4190274/16:9/w_1280,c_limit/Grammy-Winners-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe \u003ca href=\"https://pitchfork.com/topics/grammys/\"\u003e2025 Grammy Awards\u003c/a\u003e take place today in Los Angeles, and the biggest names in music are vying for the coveted golden gramophone—or several. \u003ca href=\"https://pitchfork.com/artists/4910-beyonce/\"\u003eBeyoncé\u003c/a\u003e enters the day with a whopping 11 nominations—an achievement that brought her career total to 99, and broke her tie with husband Jay-Z. Will tonight mark the first time she takes home Album of the Year?\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://pitchfork.com/artists/33674-post-malone/\"\u003ePost Malone\u003c/a\u003e and \u003ca href=\"https://pitchfork.com/artists/29812-kendrick-lamar/\"\u003eKendrick Lamar\u003c/a\u003e are sitting pretty with eight and seven nominations, respectively. Repeat Grammy favorites \u003ca href=\"https://pitchfork.com/artists/billie-eilish/\"\u003eBillie Eilish\u003c/a\u003e and \u003ca href=\"https://pitchfork.com/artists/28495-taylor-swift/\"\u003eTaylor Swift\u003c/a\u003e, as well as newcomers \u003ca href=\"https://pitchfork.com/artists/sabrina-carpenter/\"\u003eSabrina Carpenter\u003c/a\u003e and \u003ca href=\"https://pitchfork.com/reviews/albums/chappell-roan-the-rise-and-fall-of-a-midwest-princess/\"\u003eChappell Roan\u003c/a\u003e, earned six nods each this year, while \u003ca href=\"https://pitchfork.com/artists/29761-charli-xcx/\"\u003eCharli XCX\u003c/a\u003e is competing in seven categories this evening thanks to her wildly popular \u003ca href=\"https://pitchfork.com/reviews/albums/charli-xcx-brat/\"\u003e\u003cem\u003eBrat\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eTrevor Noah will handle \u003ca data-offer-url=\"https://www.grammy.com/news/trevor-noah-host-2025-grammys\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.grammy.com/news/trevor-noah-host-2025-grammys\u0026#34;}\" href=\"https://www.grammy.com/news/trevor-noah-host-2025-grammys\" rel=\"nofollow noopener\" target=\"_blank\"\u003ehosting\u003c/a\u003e duties during the main Grammys ceremony for the fifth year running. \u003ca href=\"https://pitchfork.com/news/grammys-2025-billie-eilish-charli-xcx-chappell-roan-doechii-and-more-to-perform/\"\u003ePerformers\u003c/a\u003e during the show include Billie Eilish, Charli XCX, Doechii, Chappell Roan, Sabrina Carpenter, Shakira, Benson Boone, and Teddy Swims, among several others.\u003c/p\u003e\u003cp\u003eLast year’s Big Four winners were Taylor Swift (\u003ca href=\"https://pitchfork.com/news/taylor-swift-sets-new-record-with-album-of-the-year-victory-for-midnights-at-2024-grammys/\"\u003eAlbum of the Year\u003c/a\u003e), Miley Cyrus (\u003ca href=\"https://pitchfork.com/news/miley-cyrus-wins-record-of-the-year-for-flowers-at-2024-grammys/\"\u003eRecord of the Year\u003c/a\u003e), Billie Eilish (\u003ca href=\"https://pitchfork.com/news/billie-eilish-wins-song-of-the-year-for-what-was-i-made-for-at-2024-grammys/\"\u003eSong of the Year\u003c/a\u003e), and Victoria Monét (\u003ca href=\"https://pitchfork.com/news/victoria-monet-wins-best-new-artist-at-2024-grammys/\"\u003eBest New Artist\u003c/a\u003e). The night also included wins for \u003ca href=\"https://pitchfork.com/news/sza-wins-best-randb-song-for-snooze-at-2024-grammys/\"\u003eSZA\u003c/a\u003e, \u003ca href=\"https://pitchfork.com/news/karol-g-wins-best-musica-urbana-album-for-manana-sera-bonito-at-2024-grammys/\"\u003eKarol G\u003c/a\u003e, \u003ca href=\"https://pitchfork.com/news/2024-grammys-killer-mike-wins-best-rap-album-song-performance/\"\u003eKiller Mike\u003c/a\u003e, and more.\u003c/p\u003e\u003cp\u003eGet ready with \u003ca href=\"https://pitchfork.com/thepitch/grammys-2025-predictions-who-will-win-and-who-should-win/\"\u003ePitchfork’s predictions\u003c/a\u003e for who will snatch up trophies, and \u003ca href=\"https://pitchfork.com/topics/grammys/\"\u003efollow along with all of Pitchfork’s coverage of the 2025 Grammy Awards\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-testid=\"ContentCardEmbedWrapper\"\u003e\u003cp\u003e\u003ca data-testid=\"ContentCardEmbedImage\" href=\"https://pitchfork.com/thepitch/grammys-2025-predictions-who-will-win-and-who-should-win/\" target=\"_blank\"\u003e\u003cspan\u003e\u003cpicture\u003e\u003cimg alt=\"Kendrick Lamar, Beyoncé, Chappell Roan, and Charli XCX\" src=\"https://media.pitchfork.com/photos/679a5c5c969c845f09ccbe16/master/w_775%2Cc_limit/P4K25_Grammys_WillWinShouldWin-2x1.png\" srcset=\"https://media.pitchfork.com/photos/679a5c5c969c845f09ccbe16/master/w_120,c_limit/P4K25_Grammys_WillWinShouldWin-2x1.png 120w, https://media.pitchfork.com/photos/679a5c5c969c845f09ccbe16/master/w_240,c_limit/P4K25_Grammys_WillWinShouldWin-2x1.png 240w, https://media.pitchfork.com/photos/679a5c5c969c845f09ccbe16/master/w_320,c_limit/P4K25_Grammys_WillWinShouldWin-2x1.png 320w, https://media.pitchfork.com/photos/679a5c5c969c845f09ccbe16/master/w_640,c_limit/P4K25_Grammys_WillWinShouldWin-2x1.png 640w\" sizes=\"100vw\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eBest Contemporary Classical Composition\u003c/strong\u003e\u003cbr/\u003eAndrea Casarrubios - Casarrubios: Seven for Solo Cello\u003cbr/\u003eDecoda - Coleman: Revelry\u003cbr/\u003eEsa-Pekka Salonen, Fleur Barron, Nicholas Phan, Christopher Purves, Axelle Fanyo \u0026amp; San Francisco Symphony Chorus \u0026amp; Orchestra - Saariaho: Adriana Mater\u003cbr/\u003eEighth Blackbird - Lang: Composition as Explanation\u003cbr/\u003e\u003cstrong\u003eWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026amp; Los Angeles Master Chorale - Ortiz: Revolución Diamantina\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Classical Compendium\u003c/strong\u003e\u003cbr/\u003eAmy Porter, Nikki Chooi, Buffalo Philharmonic Orchestra \u0026amp; JoAnn Falletta - Lukas Foss: Symphony No. 1 \u0026amp; Renaissance Concerto\u003cbr/\u003eAndy Akiho \u0026amp; Imani Winds - BeLonging\u003cbr/\u003eDanaë Xanthe Vlasse, Royal Philharmonic Orchestra \u0026amp; Michael Shapiro - Mythologies II\u003cbr/\u003eExperiential Orchestra, James Blachly \u0026amp; Curtis J Stewart - American Counterpoints\u003cbr/\u003e\u003cstrong\u003eWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026amp; María Dueñas - Gabriela Ortiz: Revolución Diamantina\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Arrangement, Instruments and Vocals\u003c/strong\u003e\u003cbr/\u003eCody Fry Featuring Sleeping at Last - The Sound of Silence\u003cbr/\u003eJohn Legend - Always Come Back\u003cbr/\u003e\u003cstrong\u003eWINNER: Säje Featuring Regina Carter - Alma\u003c/strong\u003e\u003cbr/\u003eWillow - Big Feelings\u003cbr/\u003eThe 8-Bit Big Band Featuring Jonah Nilsson \u0026amp; Button Masher - Last Surprise (From “Persona 5”)\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Arrangement, Instrumental or A Cappella\u003c/strong\u003e\u003cbr/\u003eBéla Fleck - Rhapsody in Blue(Grass)\u003cbr/\u003eHenry Mancini \u0026amp; Snarky Puppy - Baby Elephant Walk (Encore)\u003cbr/\u003e\u003cstrong\u003eWINNER: Jacob Collier Featuring John Legend \u0026amp; Tori Kelly - Bridge Over Troubled Water\u003c/strong\u003e\u003cbr/\u003eSäje - Silent Night\u003cbr/\u003eScott Hoying Featuring Säje \u0026amp; Tonality - Rose Without the Thorns\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Musical Theater Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Hell’s Kitchen\u003c/strong\u003e\u003cbr/\u003eMerrily We Roll Along\u003cbr/\u003eThe Notebook\u003cbr/\u003eThe Outsiders\u003cbr/\u003eSuffs\u003cbr/\u003eThe Wiz\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Spoken Word Poetry Album\u003c/strong\u003e\u003cbr/\u003eMalik Yusef - Good M.U.S.I.C. Universe Sonic Sinema Episode 1: In the Beginning Was the Word\u003cbr/\u003eOmari Hardwick - Concrete \u0026amp; Whiskey Act II Part 1: A Bourbon 30 Series\u003cbr/\u003eQueen Sheba - Civil Writes: The South Got Something to Say\u003cbr/\u003eSkillz - The Seven Number Ones\u003cbr/\u003e\u003cstrong\u003eWINNER: Tank and the Bangas - The Heart, the Mind, the Soul\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Classical Solo Vocal Album\u003c/strong\u003e\u003cbr/\u003eFotina Naumenko - Bespoke Songs\u003cbr/\u003eJoyce DiDonato, Il Pomo d’Oro \u0026amp; Maxim Emelyanychev - Wagner: Wesendonck Lieder\u003cbr/\u003e\u003cstrong\u003eWINNER: Karen Slack \u0026amp; Michelle Cann - Beyond the Years\u003c/strong\u003e\u003cbr/\u003eNicholas Phan, Farayi Malek \u0026amp; Palaver Strings - A Change Is Gonna Come\u003cbr/\u003eWill Liverman \u0026amp; Jonathan King - Show Me the Way\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Classical Instrumental Solo\u003c/strong\u003e\u003cbr/\u003eAndy Akiho - Akiho: Longing\u003cbr/\u003eCurtis J Stewart, James Blachly \u0026amp; Experiential Orchestra - Perry: Concerto for Violin and Orchestra\u003cbr/\u003eMak Grgić \u0026amp; Ensemble Dissonance - Entourer\u003cbr/\u003eSeth Parker Woods - Eastman The Holy Presence of Joan d’Arc\u003cbr/\u003e\u003cstrong\u003eWINNER: Víkingur Ólafsson - J. S. Bach: Goldberg Variations\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Chamber Music/Small Ensemble Performance\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Caroline Shaw \u0026amp; Sō Percussion - Rectangles and Circumstance\u003c/strong\u003e\u003cbr/\u003eJACK Quartet - John Luther Adams: Waves \u0026amp; Particles\u003cbr/\u003eLorelei Ensemble \u0026amp; Christopher Cerrone - Christopher Cerrone: Beaufort Scales\u003cbr/\u003eMiró Quartet - Home\u003cbr/\u003eYo-Yo Ma, Leonidas Kavakos \u0026amp; Emanuel Ax - Beethoven for Three: Symphony No. 4 and Op. 97 “Archduke”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Choral Performance\u003c/strong\u003e\u003cbr/\u003eApollo’s Fire \u0026amp; Jeannette Sorrell - Handel: Israel in Egypt, HWV 54\u003cbr/\u003eThe Choir of Trinity Wall Street, Artefact Ensemble \u0026amp; Novus NY - Sheehan: Akathist\u003cbr/\u003e\u003cstrong\u003eWINNER: The Crossing, Donald Nally \u0026amp; Dan Schwartz - Ochre\u003c/strong\u003e\u003cbr/\u003eSkylark Vocal Ensemble \u0026amp; Matthew Guard - Clear Voices in the Dark\u003cbr/\u003eTrue Concord Voices \u0026amp; Orchestra, Jeffrey Biegel \u0026amp; Eric Holtan - A Dream So Bright: Choral Music of Jake Runestad\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Opera Recording\u003c/strong\u003e\u003cbr/\u003eLos Angeles Philharmonic, John Adams \u0026amp; Los Angeles Master Chorale - John Adams: Girls of the Golden West\u003cbr/\u003eLyric Opera of Kansas City \u0026amp; Gerard Schwarz - Moravec: The Shining\u003cbr/\u003eThe Metropolitan Opera Orchestra \u0026amp; The Metropolitan Opera Chorus - Catán: Florencia en el Amazonas\u003cbr/\u003eThe Metropolitan Opera Orchestra \u0026amp; The Metropolitan Opera Chorus - Puts: The Hours\u003cbr/\u003e\u003cstrong\u003eWINNER: San Francisco Symphony Chorus \u0026amp; San Francisco Symphony - Saariaho: Adriana Mater\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Orchestral Performance\u003c/strong\u003e\u003cbr/\u003eBuffalo Philharmonic Orchestra \u0026amp; JoAnn Falletta - Kodály: Háry János Suite, Nyári este \u0026amp; Symphony in C Major\u003cbr/\u003eEsa-Pekka Salonen \u0026amp; San Francisco Symphony - Stravinsky: The Firebird\u003cbr/\u003e\u003cstrong\u003eWINNER: Los Angeles Philharmonic, Gustavo Dudamel \u0026amp; María Dueñas - Gabriela Ortiz: Revolución Diamantina\u003c/strong\u003e\u003cbr/\u003eORF Vienna Radio Symphony Orchestra \u0026amp; Marin Alsop - John Adams: City Noir, Fearful Symmetries \u0026amp; Lola Montez Does the Spider Dance\u003cbr/\u003eSusanna Mälkki \u0026amp; Helsinki Philharmonic Orchestra - Sibelius: Karelia Suite, Rakastava \u0026amp; Lemminkäinen\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Instrumental Composition\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Akropolis Reed Quintet, Pascal Le Boeuf \u0026amp; Christian Euman - Strands\u003c/strong\u003e\u003cbr/\u003eAndré 3000 - I Swear, I Really Wanted to Make a “Rap” Album but This Is Literally the Way the Wind Blew Me This Time\u003cbr/\u003eChick Corea \u0026amp; Béla Fleck - Remembrance\u003cbr/\u003eChristopher Zuar Orchestra - Communion\u003cbr/\u003eShelly Berg - At Last\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Immersive Audio Album\u003c/strong\u003e\u003cbr/\u003eEnsemble 96, Current Saxophone Quartet \u0026amp; Nina T. Karlsen - Pax\u003cbr/\u003e\u003cstrong\u003eWINNER: Peter Gabriel - I/O (In-Side Mix)\u003c/strong\u003e\u003cbr/\u003eRay Charles \u0026amp; Various Artists - Genius Loves Company\u003cbr/\u003eRoxy Music - Avalon\u003cbr/\u003eTrondheim Symphony Orchestra \u0026amp; Nick Davies - Henning Sommerro: Borders\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eProducer of the Year, Classical\u003c/strong\u003e\u003cbr/\u003eChristoph Franke\u003cbr/\u003eDirk Sobotka\u003cbr/\u003eDmitriy Lipay\u003cbr/\u003e\u003cstrong\u003eWINNER: Elaine Martone\u003c/strong\u003e\u003cbr/\u003eErica Brenner\u003cbr/\u003eMorten Lindberg\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Engineered Album, Classical\u003c/strong\u003e\u003cbr/\u003eLos Angeles Philharmonic, Gustavo Dudamel \u0026amp; María Dueñas - Gabriela Ortiz: Revolución Diamantina\u003cbr/\u003eLos Angeles Philharmonic, John Adams \u0026amp; Los Angeles Master Chorale - John Adams: Girls of the Golden West\u003cbr/\u003e\u003cstrong\u003eWINNER: Pittsburgh Symphony Orchestra \u0026amp; Manfred Honeck - Bruckner: Symphony No. 7 – Bates: Resurrexit (Live)\u003c/strong\u003e\u003cbr/\u003eSkylark Vocal Ensemble \u0026amp; Matthew Guard - Clear Voices in the Dark\u003cbr/\u003eTimo Andres, Andrew Cyr \u0026amp; Metropolis Ensemble - Timo Andres: The Blind Banister\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest New Age, Ambient, or Chant Album\u003c/strong\u003e\u003cbr/\u003eAnoushka Shankar - Chapter II: How Dark It Is Before Dawn\u003cbr/\u003eChris Redding - Visions of Sounds De Luxe\u003cbr/\u003eRadhika Vekaria - Warriors of Light\u003cbr/\u003eRicky Kej - Break of Dawn\u003cbr/\u003eRyuichi Sakamoto - Opus\u003cbr/\u003e\u003cstrong\u003eWINNER: Wouter Kellerman, Éru Matsumoto \u0026amp; Chandrika Tandon - Triveni\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Reggae Album\u003c/strong\u003e\u003cbr/\u003eCollie Buddz - Take It Easy\u003cbr/\u003eShenseea - Never Gets Late Here\u003cbr/\u003e\u003cstrong\u003eWINNER: Various Artists - Bob Marley: One Love - Music Inspired By the Film (Deluxe)\u003c/strong\u003e\u003cbr/\u003eVybz Kartel - Party With Me\u003cbr/\u003eThe Wailers - Evolution\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Global Music Album\u003c/strong\u003e\u003cbr/\u003eAntonio Rey - Historias de un Flamenco\u003cbr/\u003eCiro Hurtado - Paisajes\u003cbr/\u003e\u003cstrong\u003eWINNER: Matt B \u0026amp; Royal Philharmonic Orchestra - Alkebulan II\u003c/strong\u003e\u003cbr/\u003eRema - Heis\u003cbr/\u003eTems - Born in the Wild\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest African Music Performance\u003c/strong\u003e\u003cbr/\u003eAsake \u0026amp; Wizkid - MMS\u003cbr/\u003eBurna Boy - Higher\u003cbr/\u003eChris Brown Featuring Davido \u0026amp; Lojay - Sensational\u003cbr/\u003e\u003cstrong\u003eWINNER: Tems - Love Me JeJe\u003c/strong\u003e\u003cbr/\u003eYemi Alade - Tomorrow\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Global Music Performance\u003c/strong\u003e\u003cbr/\u003eAngélique Kidjo \u0026amp; Soweto Gospel Choir - Sunlight to My Soul\u003cbr/\u003eArooj Aftab - Raat Ki Rani\u003cbr/\u003eJacob Collier Featuring Anoushka Shankar \u0026amp; Varijashree Venugopal - A Rock Somewhere\u003cbr/\u003eMasa Takumi Featuring Ron Korb, Noshir Mody \u0026amp; Dale Edward Chung - Kashira\u003cbr/\u003eRocky Dawuni - Rise\u003cbr/\u003e\u003cstrong\u003eWINNER: Sheila E. Featuring Gloria Estefan \u0026amp; Mimy Succar - Bemba Colorá\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Contemporary Instrumental Album\u003c/strong\u003e\u003cbr/\u003eBéla Fleck - Rhapsody in Blue\u003cbr/\u003eBill Frisell - Orchestras (Live)\u003cbr/\u003eJulian Lage - Speak to Me\u003cbr/\u003eMark Guiliana - Mark\u003cbr/\u003e\u003cstrong\u003eWINNER: Taylor Eigsti - Plot Armor\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Alternative Jazz Album\u003c/strong\u003e\u003cbr/\u003eArooj Aftab - Night Reign\u003cbr/\u003eAndré 3000 - New Blue Sun\u003cbr/\u003eKeyon Harrold - Foreverland\u003cbr/\u003e\u003cstrong\u003eWINNER: Meshell Ndegeocello - No More Water: The Gospel of James Baldwin\u003c/strong\u003e\u003cbr/\u003eRobert Glasper - Code Derivation\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Latin Jazz Album\u003c/strong\u003e\u003cbr/\u003eDonald Vega Featuring Lewis Nash, John Patitucci \u0026amp; Luisito Quintero- As I Travel\u003cbr/\u003eEliane Elias - Time and Again\u003cbr/\u003eHamilton de Holanda \u0026amp; Gonzalo Rubalcaba - Collab\u003cbr/\u003eHoracio ‘El Negro’ Hernandez, John Beasley \u0026amp; Jose Gola - El Trio: Live in Italy\u003cbr/\u003eMichel Camilo \u0026amp; Tomatito - Spain Forever Again\u003cbr/\u003e\u003cstrong\u003eWINNER: Zaccai Curtis - Cubop Lives!\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Large Jazz Ensemble Album\u003c/strong\u003e\u003cbr/\u003eThe Clayton-Hamilton Jazz Orchestra - And So It Goes\u003cbr/\u003e\u003cstrong\u003eWINNER: Dan Pugach - Bianca Reimagined\u003c/strong\u003e\u003cbr/\u003eJohn Beasley Featuring Frankfurt Radio Big Band - Returning to Forever\u003cbr/\u003eMiguel Zenón - Golden City\u003cbr/\u003eOrrin Evans \u0026amp; The Captain Black Big Band - Walk a Mile in My Shoe\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Jazz Instrumental Album\u003c/strong\u003e\u003cbr/\u003eAmbrose Akinmusire - Owl Song\u003cbr/\u003e\u003cstrong\u003eWINNER: Chick Corea \u0026amp; Béla Fleck - Remembrance\u003c/strong\u003e\u003cbr/\u003eKenny Barron - Beyond This Place\u003cbr/\u003eLakecia Benjamin - Phoenix Reimagined (Live)\u003cbr/\u003eSullivan Fortner - Solo Game\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Jazz Vocal Album\u003c/strong\u003e\u003cbr/\u003eCatherine Russell \u0026amp; Sean Mason - My Ideal\u003cbr/\u003eChristie Dashiell - Journey in Black\u003cbr/\u003eKurt Elling \u0026amp; Sullivan Fortner - Wildflowers Vol. 1\u003cbr/\u003eMilton Nascimento \u0026amp; Esperanza Spalding - Milton + Esperanza\u003cbr/\u003e\u003cstrong\u003eWINNER: Samara Joy - A Joyful Holiday\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Jazz Performance\u003c/strong\u003e\u003cbr/\u003eThe Baylor Project - Walk With Me, Lord (Sound | Spirit)\u003cbr/\u003eChick Corea \u0026amp; Béla Fleck - Juno\u003cbr/\u003eDan Pugach \u0026amp; Nicole Zuraitis Featuring Troy Roberts - Little Fears\u003cbr/\u003eLakecia Benjamin Featuring Randy Brecker, Jeff “Tain” Watts \u0026amp; John Scofield - Phoenix Reimagined (Live)\u003cbr/\u003e\u003cstrong\u003eWINNER: Samara Joy Featuring Sullivan Fortner - Twinkle Twinkle Little Me\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Engineered Album, Non-Classical\u003c/strong\u003e\u003cbr/\u003eCharlotte Day Wilson - Cyan Blue\u003cbr/\u003eKacey Musgraves - Deeper Well\u003cbr/\u003eLucky Daye - Algorithm\u003cbr/\u003e\u003cstrong\u003eWINNER: Peter Gabriel - I/O\u003c/strong\u003e\u003cbr/\u003eSabrina Carpenter - Short n’ Sweet\u003cbr/\u003eWillow - Empathogen\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Song Written for Visual Media\u003c/strong\u003e\u003cbr/\u003eBarbra Streisand - Love Will Survive (From The Tattooist of Auschwitz)\u003cbr/\u003e\u003cstrong\u003eWINNER: Jon Batiste - It Never Went Away (From the Netflix Documentary “American Symphony”)\u003c/strong\u003e\u003cbr/\u003eLuke Combs - Ain’t No Love in Oklahoma (From Twisters: The Album)\u003cbr/\u003e*NSync \u0026amp; Justin Timberlake - Better Place (From Trolls Band Together)\u003cbr/\u003eOlivia Rodrigo - Can’t Catch Me Now (From The Hunger Games: The Ballad of Songbirds \u0026amp; Snakes)\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Score Soundtrack for Video Games and Other Interactive Media\u003c/strong\u003e\u003cbr/\u003eBear McCreary - God of War Ragnarök: Valhalla\u003cbr/\u003eJohn Paesano - Marvel’s Spider-Man 2\u003cbr/\u003ePinar Toprak - Avatar: Frontiers of Pandora\u003cbr/\u003eWilbert Roget II - Star Wars Outlaws\u003cbr/\u003e\u003cstrong\u003eWINNER: Winifred Phillips - Wizardry: Proving Grounds of the Mad Overlord\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Score Soundtrack for Visual Media (Includes Film and Television)\u003c/strong\u003e\u003cbr/\u003eKris Bowers - The Color Purple\u003cbr/\u003e\u003cstrong\u003eWINNER: Hans Zimmer - Dune: Part Two\u003c/strong\u003e\u003cbr/\u003eLaura Karpman - American Fiction\u003cbr/\u003eNick Chuba, Atticus Ross \u0026amp; Leopold Ross - Shōgun\u003cbr/\u003eTrent Reznor \u0026amp; Atticus Ross - Challengers\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Compilation Soundtrack for Visual Media\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: London Symphony Orchestra, Yannick Nézet-Séguin \u0026amp; Bradley Cooper - Maestro: Music by Leonard Bernstein\u003c/strong\u003e\u003cbr/\u003eVarious Artists - The Color Purple\u003cbr/\u003eVarious Artists - Deadpool \u0026amp; Wolverine\u003cbr/\u003eVarious Artists - Saltburn\u003cbr/\u003eVarious Artists - Twisters: The Album\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Alternative Music Album\u003c/strong\u003e\u003cbr/\u003eBrittany Howard - What Now\u003cbr/\u003eClairo - Charm\u003cbr/\u003eKim Gordon - The Collective\u003cbr/\u003eNick Cave \u0026amp; the Bad Seeds - Wild God\u003cbr/\u003e\u003cstrong\u003eWINNER: St. Vincent - All Born Screaming\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Alternative Music Performance\u003c/strong\u003e\u003cbr/\u003eCage the Elephant - Neon Pill\u003cbr/\u003eFontaines D.C. - Starburster\u003cbr/\u003eKim Gordon - Bye Bye\u003cbr/\u003eNick Cave \u0026amp; the Bad Seeds - Song of the Lake\u003cbr/\u003e\u003cstrong\u003eWINNER: St. Vincent - Flea\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Rock Album\u003c/strong\u003e\u003cbr/\u003eThe Black Crowes - Happiness Bastards\u003cbr/\u003eFontaines D.C. - Romance\u003cbr/\u003eGreen Day - Saviors\u003cbr/\u003eIdles - Tangk\u003cbr/\u003eJack White - No Name\u003cbr/\u003ePearl Jam - Dark Matter\u003cbr/\u003e\u003cstrong\u003eWINNER: The Rolling Stones - Hackney Diamonds\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Rock Song\u003c/strong\u003e\u003cbr/\u003eThe Black Keys - Beautiful People (Stay High)\u003cbr/\u003eGreen Day - Dilemma\u003cbr/\u003eIdles - Gift Horse\u003cbr/\u003ePearl Jam - Dark Matter\u003cbr/\u003e\u003cstrong\u003eWINNER: St. Vincent - Broken Man\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Metal Performance\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Gojira, Marina Viotti \u0026amp; Victor le Masne - Mea Culpa (Ah! Ça ira!)\u003c/strong\u003e\u003cbr/\u003eJudas Priest - Crown of Horns\u003cbr/\u003eKnocked Loose Featuring Poppy - Suffocate\u003cbr/\u003eMetallica - Screaming Suicide\u003cbr/\u003eSpiritbox - Cellar Door\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Rock Performance\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: The Beatles - Now and Then\u003c/strong\u003e\u003cbr/\u003eThe Black Keys - Beautiful People (Stay High)\u003cbr/\u003eGreen Day - The American Dream Is Killing Me\u003cbr/\u003eIdles - Gift Horse\u003cbr/\u003ePearl Jam - Dark Matter\u003cbr/\u003eSt. Vincent - Broken Man\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eProducer of the Year, Non-Classical\u003c/strong\u003e\u003cbr/\u003eAlissia\u003cbr/\u003e\u003cstrong\u003eWINNER: Daniel Nigro\u003c/strong\u003e\u003cbr/\u003eDernst “D’Mile” Emile II\u003cbr/\u003eIan Fitchuk\u003cbr/\u003eMustard\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Historical Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: King Oliver’s Creole Jazz Band \u0026amp; Various Artists - Centennial\u003c/strong\u003e\u003cbr/\u003ePaul Robeson - Paul Robeson – Voice of Freedom: His Complete Columbia, RCA, HMV, and Victor Recordings\u003cbr/\u003ePepe de Lucía \u0026amp; Paco de Lucía - Pepito y Paquito\u003cbr/\u003ePrince \u0026amp; the New Power Generation - Diamonds and Pearls (Super Deluxe Edition)\u003cbr/\u003eRodgers \u0026amp; Hammerstein \u0026amp; Julie Andrews - The Sound of Music (Original Soundtrack Recording) (Super Deluxe Edition)\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Album Notes\u003c/strong\u003e\u003cbr/\u003eAlice Coltrane - The Carnegie Hall Concert (Live)\u003cbr/\u003eFord Dabney’s Syncopated Orchestras - After Midnight\u003cbr/\u003eJohn Culshaw - John Culshaw - The Art of the Producer - The Early Years 1948-55\u003cbr/\u003e\u003cstrong\u003eWINNER: King Oliver’s Creole Jazz Band \u0026amp; Various Artists - Centennial\u003c/strong\u003e\u003cbr/\u003eVarious Artists - SONtrack Original de la Película “Al Son de Beno”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Boxed or Special Limited Edition Package\u003c/strong\u003e\u003cbr/\u003eAlpha Wolf - Half Living Things\u003cbr/\u003e\u003cstrong\u003eWINNER: John Lennon - Mind Games\u003c/strong\u003e\u003cbr/\u003eKate Bush - Hounds of Love (The Boxes of Lost at Sea)\u003cbr/\u003eNirvana - In Utero\u003cbr/\u003eUnsuk Chin \u0026amp; Berliner Philharmoniker - Unsuk Chin\u003cbr/\u003e90 Day Men - We Blame Chicago\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Recording Package\u003c/strong\u003e\u003cbr/\u003eThe Avett Brothers - The Avett Brothers\u003cbr/\u003e\u003cstrong\u003eWINNER: Charli XCX - Brat\u003c/strong\u003e\u003cbr/\u003eiWhoiWhoo - Pregnancy, Breakdown, and Disease\u003cbr/\u003eKate Bush - Hounds of Love (Baskerville Edition)\u003cbr/\u003eThe Muddy Basin Ramblers - Jug Band Millionaire\u003cbr/\u003ePost Malone - F-1 Trillion\u003cbr/\u003eWilliam Clark Green - Baker Hotel\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Audio Book, Narration, and Storytelling Recording\u003c/strong\u003e\u003cbr/\u003eBarbra Streisand - My Name Is Barbra\u003cbr/\u003eDolly Parton - Behind the Seams: My Life in Rhinestones\u003cbr/\u003eGeorge Clinton - ...And Your Ass Will Follow\u003cbr/\u003e\u003cstrong\u003eWINNER: Jimmy Carter - Last Sundays in Plains: A Centennial Celebration\u003c/strong\u003e\u003cbr/\u003eVarious Artists - All You Need Is Love: The Beatles in Their Own Words\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Comedy Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Dave Chappelle - The Dreamer\u003c/strong\u003e\u003cbr/\u003eJim Gaffigan - The Prisoner\u003cbr/\u003eNikki Glaser - Someday You’ll Die\u003cbr/\u003eRicky Gervais - Armageddon\u003cbr/\u003eTrevor Noah - Where Was I\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Children’s Music Album\u003c/strong\u003e\u003cbr/\u003eDivinity Roxx \u0026amp; Divi Roxx Kids - World Wide Playdate\u003cbr/\u003eJohn Legend - My Favorite Dream\u003cbr/\u003e\u003cstrong\u003eWINNER: Lucky Diaz and the Family Jam Band - ¡Brillo, Brillo!\u003c/strong\u003e\u003cbr/\u003eLucy Kalantari \u0026amp; the Jazz Cats - Creciendo\u003cbr/\u003eRock for Children - Solid Rock Revival\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Traditional Pop Vocal Album\u003c/strong\u003e\u003cbr/\u003eAaron Lazar - Impossible Dream\u003cbr/\u003eCyrille Aimée - À Fleur de Peau\u003cbr/\u003eGregory Porter - Christmas Wish\u003cbr/\u003eLake Street Dive - Good Together\u003cbr/\u003e\u003cstrong\u003eWINNER: Norah Jones - Visions\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Music Film\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Jon Batiste - American Symphony\u003c/strong\u003e\u003cbr/\u003eJune Carter Cash - June\u003cbr/\u003eRun-DMC - Kings From Queens\u003cbr/\u003eSteven Van Zandt - Stevie Van Zandt: Disciple\u003cbr/\u003eVarious Artists - The Greatest Night in Pop\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Music Video\u003c/strong\u003e\u003cbr/\u003eA$AP Rocky - Tailor Swif\u003cbr/\u003eCharli XCX - 360\u003cbr/\u003eEminem - Houdini\u003cbr/\u003e\u003cstrong\u003eWINNER: Kendrick Lamar - Not Like Us\u003c/strong\u003e\u003cbr/\u003eTaylor Swift Featuring Post Malone - Fortnight\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Rap Song\u003c/strong\u003e\u003cbr/\u003eFuture, Metro Boomin \u0026amp; Kendrick Lamar - Like That\u003cbr/\u003eGlorilla - Yeah Glo!\u003cbr/\u003e\u003cstrong\u003eWINNER: Kendrick Lamar - Not Like Us\u003c/strong\u003e\u003cbr/\u003eRapsody \u0026amp; Hit-Boy - Asteroids\u003cbr/\u003e¥$, Kanye West, Ty Dolla $ign \u0026amp; Rich the Kid Featuring Playboi Carti - Carnival\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Melodic Rap Performance\u003c/strong\u003e\u003cbr/\u003eBeyoncé, Linda Martell \u0026amp; Shaboozey - Spaghettii\u003cbr/\u003eFuture, Metro Boomin \u0026amp; The Weeknd - We Still Don’t Trust You\u003cbr/\u003eJordan Adetunji Featuring Kehlani - Kehlani (Remix)\u003cbr/\u003eLatto - Big Mama\u003cbr/\u003e\u003cstrong\u003eWINNER: Rapsody Featuring Erykah Badu - 3:AM\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Rap Performance\u003c/strong\u003e\u003cbr/\u003eCardi B - Enough (Miami)\u003cbr/\u003eCommon \u0026amp; Pete Rock Featuring Posdnuos - When the Sun Shines Again\u003cbr/\u003eDoechii - Nissan Altima\u003cbr/\u003eEminem - Houdini\u003cbr/\u003eFuture, Metro Boomin \u0026amp; Kendrick Lamar - Like That\u003cbr/\u003eGlorilla - Yeah Glo!\u003cbr/\u003e\u003cstrong\u003eWINNER: Kendrick Lamar - Not Like Us\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest R\u0026amp;B Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Chris Brown - 11:11 (Deluxe)\u003c/strong\u003e\u003cbr/\u003eLalah Hathaway - Vantablack\u003cbr/\u003eLucky Daye - Algorithm\u003cbr/\u003eMuni Long - Revenge\u003cbr/\u003eUsher - Coming Home\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Progressive R\u0026amp;B Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Avery*Sunshine - So Glad to Know You\u003c/strong\u003e\u003cbr/\u003eChildish Gambino - Bando Stone and the New World\u003cbr/\u003eDurand Bernarr - En Route\u003cbr/\u003eKehlani - Crash\u003cbr/\u003e\u003cstrong\u003eWINNER: NxWorries - Why Lawd?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest R\u0026amp;B Song\u003c/strong\u003e\u003cbr/\u003eCoco Jones - Here We Go (Uh Oh)\u003cbr/\u003eKehlani - After Hours\u003cbr/\u003eMuni Long - Ruined Me\u003cbr/\u003e\u003cstrong\u003eWINNER: SZA - Saturn\u003c/strong\u003e\u003cbr/\u003eTems - Burning\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Traditional R\u0026amp;B Performance\u003c/strong\u003e\u003cbr/\u003eKenyon Dixon - Can I Have This Groove\u003cbr/\u003eLalah Hathaway Featuring Michael McDonald - No Lie\u003cbr/\u003e\u003cstrong\u003eWINNER: Lucky Daye - That’s You\u003c/strong\u003e\u003cbr/\u003eMarsha Ambrosius - Wet\u003cbr/\u003eMuni Long - Make Me Forget\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest R\u0026amp;B Performance\u003c/strong\u003e\u003cbr/\u003eChris Brown - Residuals\u003cbr/\u003eCoco Jones - Here We Go (Uh Oh)\u003cbr/\u003eJhené Aiko - Guidance\u003cbr/\u003e\u003cstrong\u003eWINNER: Muni Long - Made for Me (Live on BET)\u003c/strong\u003e\u003cbr/\u003eSZA - Saturn\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSongwriter of the Year, Non-Classical\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Amy Allen\u003c/strong\u003e\u003cbr/\u003eEdgar Barrera\u003cbr/\u003eJessi Alexander\u003cbr/\u003eJessie Jo Dillon\u003cbr/\u003eRaye\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Tropical Latin Album\u003c/strong\u003e\u003cbr/\u003eJuan Luis Guerra 4.40 - Radio Güira\u003cbr/\u003eKiki Valera - Vacilón Santiaguero\u003cbr/\u003eMarc Anthony - Muevense\u003cbr/\u003eSheila E. - Bailar\u003cbr/\u003e\u003cstrong\u003eWINNER: Tony Succar \u0026amp; Mimy Succar - Alma, Corazón y Salsa (Live at Gran Teatro Nacional)\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Música Mexicana Album (Including Tejano)\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Carín León - Boca Chueca, Vol. 1\u003c/strong\u003e\u003cbr/\u003eChiquis - Diamantes\u003cbr/\u003eJessi Uribe - De Lejitos\u003cbr/\u003ePeso Pluma - Éxodo\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Latin Rock or Alternative Album\u003c/strong\u003e\u003cbr/\u003eCimafunk - Pa’ Tu Cuerpa\u003cbr/\u003eEl David Aguilar - Compita del Destino\u003cbr/\u003eMon Laferte - Autopoiética\u003cbr/\u003eNathy Peluso - Grasa\u003cbr/\u003e\u003cstrong\u003eWINNER: Rawayana - ¿Quién Trae las Cornetas?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Música Urbana Album\u003c/strong\u003e\u003cbr/\u003eBad Bunny - Nadie Sabe Lo Que Va a Pasar Mañana\u003cbr/\u003eFeid - Ferxxocalipsis\u003cbr/\u003eJ Balvin - Rayo\u003cbr/\u003e\u003cstrong\u003eWINNER: Residente - Las Letras Ya No Importan\u003c/strong\u003e\u003cbr/\u003eYoung Miko - Att.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Contemporary Blues Album\u003c/strong\u003e\u003cbr/\u003eAntonio Vergara - The Fury\u003cbr/\u003eJoe Bonamassa - Blues Deluxe Vol. 2\u003cbr/\u003e\u003cstrong\u003eWINNER: Ruthie Foster - Mileage\u003c/strong\u003e\u003cbr/\u003eShemekia Copeland - Blame It on Eve\u003cbr/\u003eSteve Cropper \u0026amp; The Midnight Hour - Friendlytown\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Traditional Blues Album\u003c/strong\u003e\u003cbr/\u003eCedric Burnside - Hill Country Love\u003cbr/\u003eThe Fabulous Thunderbirds - Struck Down\u003cbr/\u003eLittle Feat - Sam’s Place\u003cbr/\u003eSue Foley - One Guitar Woman\u003cbr/\u003e\u003cstrong\u003eWINNER: Taj Mahal - Swingin’: Live at the Church in Tulsa\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest American Roots Performance\u003c/strong\u003e\u003cbr/\u003eThe Fabulous Thunderbirds Featuring Bonnie Raitt, Keb’ Mo’, Taj Mahal \u0026amp; Mick Fleetwood - Nothing in Rambling\u003cbr/\u003eRhiannon Giddens - The Ballad of Sally Anne\u003cbr/\u003eShemekia Copeland - Blame It on Eve\u003cbr/\u003e\u003cstrong\u003eWINNER: Sierra Ferrell - Lighthouse\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Country Song\u003c/strong\u003e\u003cbr/\u003eBeyoncé - Texas Hold ’Em\u003cbr/\u003eJelly Roll - I Am Not Okay\u003cbr/\u003e\u003cstrong\u003eWINNER: Kacey Musgraves - The Architect\u003c/strong\u003e\u003cbr/\u003ePost Malone Featuring Morgan Wallen - I Had Some Help\u003cbr/\u003eShaboozey - A Bar Song (Tipsy)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Country Duo/Group Performance\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Beyoncé \u0026amp; Miley Cyrus - II Most Wanted\u003c/strong\u003e\u003cbr/\u003eBrothers Osborne - Break Mine\u003cbr/\u003eDan + Shay - Bigger Houses\u003cbr/\u003eKelsea Ballerini \u0026amp; Noah Kahan - Cowboys Cry Too\u003cbr/\u003ePost Malone Featuring Morgan Wallen - I Had Some Help\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Country Solo Performance\u003c/strong\u003e\u003cbr/\u003eBeyoncé - 16 Carriages\u003cbr/\u003e\u003cstrong\u003eWINNER: Chris Stapleton - It Takes a Woman\u003c/strong\u003e\u003cbr/\u003eJelly Roll - I Am Not Okay\u003cbr/\u003eKacey Musgraves - The Architect\u003cbr/\u003eShaboozey - A Bar Song (Tipsy)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Roots Gospel Album\u003c/strong\u003e\u003cbr/\u003eAuthentic Unlimited - The Gospel Sessions, Vol. 2\u003cbr/\u003e\u003cstrong\u003eWINNER: Cory Henry - Church\u003c/strong\u003e\u003cbr/\u003eThe Harlem Gospel Travelers - Rhapsody\u003cbr/\u003eMark D. Conklin - The Gospel According to Mark\u003cbr/\u003eThe Nelons - Loving You\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Contemporary Christian Music Album\u003c/strong\u003e\u003cbr/\u003eBrandon Lake - Coat of Many Colors\u003cbr/\u003e\u003cstrong\u003eWINNER: Doe - Heart of a Human\u003c/strong\u003e\u003cbr/\u003eElevation Worship - When Wind Meets Fire\u003cbr/\u003eForrest Frank - Child of God\u003cbr/\u003eMaverick City Music, Chandler Moore \u0026amp; Naomi Raine - The Maverick Way Complete\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Gospel Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: CeCe Winans - More Than This\u003c/strong\u003e\u003cbr/\u003eKaren Clark Sheard - Still Karen\u003cbr/\u003eKirk Franklin - Father’s Day\u003cbr/\u003eMelvin Crispell III - Covered Vol. 1\u003cbr/\u003eRicky Dillard - Choirmaster II (Live)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Contemporary Christian Music Performance/Song\u003c/strong\u003e\u003cbr/\u003eBethel Music, Jenn Johnson Featuring CeCe Winans - Holy Forever (Live)\u003cbr/\u003e\u003cstrong\u003eWINNER: CeCe Winans - That’s My King\u003c/strong\u003e\u003cbr/\u003eElevation Worship Featuring Brandon Lake, Chris Brown \u0026amp; Chandler Moore - Praise\u003cbr/\u003eHonor \u0026amp; Glory \u0026amp; Disciple - Firm Foundation (He Won’t)\u003cbr/\u003eJwlkrs Worship \u0026amp; Maverick City Music Featuring Chandler Moore - In the Name of Jesus\u003cbr/\u003eMaverick City Music, Naomi Raine \u0026amp; Chandler Moore Featuring Tasha Cobbs Leonard - In the Room\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Gospel Performance/Song\u003c/strong\u003e\u003cbr/\u003eDoe - Holy Hands\u003cbr/\u003eMelvin Crispell III - Yesterday\u003cbr/\u003eRicky Dillard - Hold On (Live)\u003cbr/\u003e\u003cstrong\u003eWINNER: Tasha Cobbs Leonard, Erica Campbell \u0026amp; Israel Houghton Featuring Jonathan McReynolds \u0026amp; Jekalyn Carr - One Hallelujah\u003c/strong\u003e\u003cbr/\u003eYolanda Adams - Church Doors\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cstrong\u003eBest Regional Roots Music Album\u003c/strong\u003e\u003cbr/\u003eBig Chief Monk Featuring J’wan Boudreaux - Live at the 2024 New Orleans Jazz \u0026amp; Heritage Festival\u003cbr/\u003e\u003cstrong\u003eWINNER: Kalani Pe\u0026#39;a - Kuini\u003c/strong\u003e\u003cbr/\u003eNew Breed Brass Band Featuring Trombone Shorty - Live at the 2024 New Orleans Jazz \u0026amp; Heritage Festival\u003cbr/\u003eThe Rumble - Stories From the Battlefield\u003cbr/\u003eSean Ardoin \u0026amp; Kreole Rock and Soul - 25 Back to My Roots\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Folk Album\u003c/strong\u003e\u003cbr/\u003eAdrianne Lenker - Bright Future\u003cbr/\u003eAmerican Patchwork Quartet - American Patchwork Quartet\u003cbr/\u003eAoife O’Donovan - All My Friends\u003cbr/\u003e\u003cstrong\u003eWINNER: Gillian Welch \u0026amp; David Rawlings - Woodland\u003c/strong\u003e\u003cbr/\u003eMadi Diaz - Weird Faith\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Bluegrass Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Billy Strings - Live Vol. 1\u003c/strong\u003e\u003cbr/\u003eBronwyn Keith-Hynes - I Built a World\u003cbr/\u003eDan Tyminski - Dan Tyminski: Live From the Ryman\u003cbr/\u003eThe Del McCoury Band - Songs of Love and Life\u003cbr/\u003eSister Sadie - No Fear\u003cbr/\u003eTony Trischka - Earl Jam\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Americana Album\u003c/strong\u003e\u003cbr/\u003eCharley Crockett - $10 Cowboy\u003cbr/\u003eMaggie Rose - No One Gets Out Alive\u003cbr/\u003eSarah Jarosz - Polaroid Lovers\u003cbr/\u003e\u003cstrong\u003eWINNER: Sierra Ferrell - Trail of Flowers\u003c/strong\u003e\u003cbr/\u003eT Bone Burnett - The Other Side\u003cbr/\u003eWaxahatchee - Tigers Blood\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest American Roots Song\u003c/strong\u003e\u003cbr/\u003eAoife O’Donovan - All My Friends\u003cbr/\u003eIron \u0026amp; Wine \u0026amp; Fiona Apple - All in Good Time\u003cbr/\u003eMark Knopfler - Ahead of the Game\u003cbr/\u003eShemekia Copeland - Blame It on Eve\u003cbr/\u003e\u003cstrong\u003eWINNER: Sierra Ferrell - American Dreaming\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Americana Performance\u003c/strong\u003e\u003cbr/\u003eBeyoncé - Ya Ya\u003cbr/\u003eGillian Welch \u0026amp; David Rawlings - Empty Trainload of Sky\u003cbr/\u003eMadi Diaz \u0026amp; Kacey Musgraves - Don’t Do Me Good\u003cbr/\u003eMadison Cunningham - Subtitles\u003cbr/\u003eSarah Jarosz - Runaway Train\u003cbr/\u003e\u003cstrong\u003eWINNER: Sierra Ferrell - American Dreaming\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Remixed Recording\u003c/strong\u003e\u003cbr/\u003eCharli XCX - Von Dutch A. G. Cook Remix Featuring Addison Rae\u003cbr/\u003eDoechii \u0026amp; Kaytranada Featuring JT - Alter Ego (Kaytranada Remix)\u003cbr/\u003eJulian Marley \u0026amp; Antaeus - Jah Sees Them (Amapiano Remix)\u003cbr/\u003e\u003cstrong\u003eWINNER: Sabrina Carpenter - Espresso (Mark Ronson x FNZ Working Late Remix)\u003c/strong\u003e\u003cbr/\u003eShaboozey \u0026amp; David Guetta - A Bar Song (Tipsy) (Remix)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Dance/Electronic Music Album\u003c/strong\u003e\u003cbr/\u003e\u003cstrong\u003eWINNER: Charli XCX - Brat\u003c/strong\u003e\u003cbr/\u003eFour Tet - Three\u003cbr/\u003eJustice - Hyperdrama\u003cbr/\u003eKaytranada - Timeless\u003cbr/\u003eZedd - Telos\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Dance Pop Recording\u003c/strong\u003e\u003cbr/\u003eAriana Grande - Yes, And?\u003cbr/\u003eBillie Eilish - L’Amour de Ma Vie [Over Now Extended Edit]\u003cbr/\u003e\u003cstrong\u003eWINNER: Charli XCX - Von Dutch\u003c/strong\u003e\u003cbr/\u003eMadison Beer - Make You Mine\u003cbr/\u003eTroye Sivan - Got Me Started\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Dance/Electronic Recording\u003c/strong\u003e\u003cbr/\u003eDisclosure - She’s Gone, Dance On\u003cbr/\u003eFour Tet - Loved\u003cbr/\u003eFred Again.. \u0026amp; Baby Keem - Leavemealone\u003cbr/\u003e\u003cstrong\u003eWINNER: Justice \u0026amp; Tame Impala - Neverender\u003c/strong\u003e\u003cbr/\u003eKaytranada Featuring Childish Gambino - Witchy\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest Pop Solo Performance\u003c/strong\u003e\u003cbr/\u003eBeyoncé - Bodyguard\u003cbr/\u003eBillie Eilish - Birds of a Feather\u003cbr/\u003eChappell Roan - Good Luck, Babe!\u003cbr/\u003eCharli XCX - Apple\u003cbr/\u003e\u003cstrong\u003eWINNER: Sabrina Carpenter - Espresso\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure data-testid=\"IframeEmbed\"\u003e\u003cdiv data-testid=\"IframeEmbedContainer\"\u003e\u003cp\u003e\u003ciframe height=\"113\" width=\"200\" sandbox=\"allow-scripts allow-popups allow-same-origin allow-presentation allow-popups-to-escape-sandbox\" title=\"Embedded Frame\" data-src=\"https://www.youtube-nocookie.com/embed/Ot6ia8KDi9o\" allow=\"autoplay *; encrypted-media *; clipboard-write; autoplay; fullscreen; picture-in-picture\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2025-02-02T15:10:21.023-05:00",
  "modifiedTime": "2025-02-03T00:22:19.824Z"
}
