{
  "id": "d3b84b39-9afd-4519-b37f-6c5c6f0ea435",
  "title": "The CMAs Chose Two Mediocre White Guys and You’ll Never Guess What Happened Next",
  "link": "https://consequence.net/2024/11/cma-awards-2024-post-malone-jelly-roll-beyonce/",
  "description": "The Country Music Association sought a weird, narrow definition of country, with predictably unwatchable results. The CMAs Chose Two Mediocre White Guys and You’ll Never Guess What Happened Next Wren Graves",
  "author": "Wren Graves",
  "published": "Thu, 21 Nov 2024 20:51:25 +0000",
  "source": "http://consequenceofsound.net/feed",
  "categories": [
    "Features",
    "Editorials",
    "Music",
    "CMA Awards",
    "Country"
  ],
  "byline": "wrengraves",
  "length": 3628,
  "excerpt": "The 2024 CMA Awards set up the group as arbiters over recent country converts, choosing Post Malone and Jelly Roll while snubbing Beyonce.",
  "siteName": "Consequence",
  "favicon": "https://consequence.net/wp-content/themes/cosv2/images/apple-touch-icon.png",
  "text": "In the year that pop went country, the 2024 CMA Awards set themselves up as arbiters of which recent country converts would be welcomed and which would not. Beyoncé they placed outside the gate, her COWBOY CARTER snubbed with zero nominations, while embracing former rappers Post Malone and Jelly Roll with multiple nods each. The Country Music Association even invited Mr. Malone and Mr. Roll to perform at their annual award spectacle Wednesday night. In the process they accidentally told everyone the truth, in the same way that a toddler who insists he did not poop might prove it by pulling down his pants and smearing shit everywhere. It’s not that Posty and Jelly were godawful, but neither could be defended as great. Malone kicked off the award ceremony with “California Sober” alongside Chris Stapleton, and while he was perfectly visible, it was harder to hear him. Some online observers blamed the audio mix, and perhaps there’s something to it, though I don’t think it’s entirely the fault of the sound engineers that Malone’s thin trickles were out-of-balance with Stapleton’s firehose. Throughout the performance, he gives up on almost every long note that Stapleton rides to the end; Stapleton literally out-sings him. Jelly Roll put himself in an even more awkward situation as he stood next to Kix Brooks’ piano, reciting Ronnie Dunn’s monologue from “Believe” about “Old Man Wrigley,” in a stilted manner. it suggested while he’d like to spend more time on Hollywood lots in the future, he wasn’t sure which camera to look at presently. When Dunn himself emerged onto the stage, it seemed like Roll joined the audience in breathing a sigh of relief. The monologue sounded warm wrapped in Dunn’s 71-year-old voice of velvet, and the crowd that Jelly Roll failed to engage in a sing-along suddenly remembered the words. Post Malone shines in some settings — he can sing the hell out of a grunge cover — but his solo rendition of “Yours” was perhaps the lowest point of an uninspiring evening. Posty’s “Yours” received an avalanche of online hate, and as of the time of this writing, neither Malone nor the CMAs have bothered to load it to YouTube. Cell phone footage captured some pitchy runs, though this was hardly the worst of it. Perhaps Post Malone was suffering through an off-night, and maybe Jelly Roll has been rehearsing the “Believe” monologue since he was selling Gamblin’ on the White Boy mixtapes out of his car. Maybe these genre-hopping artists are true believers in the power of country, instead of what they looked like, which is opportunists cashing in on a trend. Maybe they’re not frauds, but the Country Music Association certainly is. Across a more-than 60-year-legacy of mediocrity, the CMAs have enforced a narrow definition of country. They walled it off from Jason Isbell, Sturgill Simpson, and too many talented women to count, long before they snubbed Beyoncé. And after all those years of gatekeeping, what have they preserved? What have they saved for country, as Jelly Roll and Post Malone scan the horizon for the next trend out of Nashville? The answer, as loud as a Stapleton solo, is nothing. Every fake emotional quiver in Jelly Roll’s monologue, and every note that Post Malone couldn’t quite locate, can be thrown onto the piles of evidence that the gatekeepers don’t care about quality, or tradition, or even singing on-key; they never had any goal except continuing to work the gates. Because of the CMAs, country music’s tent is a little smaller, and its pitch a little farther afield. They made their award show worse on purpose, and deserved exactly what they got.",
  "image": "https://consequence.net/wp-content/uploads/2024/11/cma-awards-2024-post-malone-jelly-roll-beyonce.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"1443773\" data-title=\"The CMAs Chose Two Mediocre White Guys and You’ll Never Guess What Happened Next\" data-url=\"https://consequence.net/2024/11/cma-awards-2024-post-malone-jelly-roll-beyonce/\" data-page=\"1\" data-pages=\"1\" data-total-posts=\"1\" aria-live=\"polite\" aria-atomic=\"true\" data-nextpage=\"true\" data-nextpage-urls=\"true\" data-nextpage-pageviews=\"false\" data-nextpage-post-id=\"1443773\" data-nextpage-scroll=\"false\" data-nextpage-startpage=\"1\" data-nextpage-post-title=\"The CMAs Chose Two Mediocre White Guys and You’ll Never Guess What Happened Next\" data-container-type=\"ul\" data-loading-style=\"infinite fading-circles\" data-repeater=\"default\" data-post-type=\"post\" data-order=\"DESC\" data-orderby=\"date\" data-offset=\"0\" data-posts-per-page=\"5\" data-scroll-distance=\"-200\" data-pause-override=\"true\" data-pause=\"true\" data-button-label=\"Load More\"\u003e\u003cp\u003eIn the year that pop went country, the 2024 \u003ca href=\"https://consequence.net/tag/cma-awards/\" target=\"_blank\" rel=\"noopener\"\u003eCMA Awards\u003c/a\u003e set themselves up as arbiters of which recent country converts would be welcomed and which would not. \u003ca href=\"https://consequence.net/artist/beyonce/\" target=\"_blank\" rel=\"noopener\"\u003eBeyoncé\u003c/a\u003e they placed outside the \u003ca href=\"https://consequence.net/2023/07/country-music-gatekeepers-record-breaking-billboard/\" target=\"_blank\" rel=\"noopener\"\u003egate\u003c/a\u003e, her \u003cem\u003eCOWBOY CARTER \u003c/em\u003esnubbed with zero nominations, while embracing former rappers \u003ca href=\"https://consequence.net/artist/post-malone/\" target=\"_blank\" rel=\"noopener\"\u003ePost Malone\u003c/a\u003e and \u003ca href=\"https://consequence.net/artist/jelly-roll/\" target=\"_blank\" rel=\"noopener\"\u003eJelly Roll\u003c/a\u003e with multiple nods each.\u003c/p\u003e\n\u003cp\u003eThe Country Music Association even invited Mr. Malone and Mr. Roll to perform at their annual award spectacle Wednesday night. In the process they accidentally told everyone the truth, in the same way that a toddler who insists he did \u003cem\u003enot\u003c/em\u003e poop might prove it by pulling down his pants and smearing shit everywhere.\u003c/p\u003e\n\u003cp\u003eIt’s not that Posty and Jelly were godawful, but neither could be defended as great. Malone kicked off the award ceremony with “California Sober” alongside Chris Stapleton, and while he was perfectly visible, it was harder to hear him. Some online observers blamed the audio mix, and perhaps there’s something to it, though I don’t think it’s entirely the fault of the sound engineers that Malone’s thin trickles were out-of-balance with Stapleton’s firehose. Throughout the performance, he gives up on almost every long note that Stapleton rides to the end; Stapleton literally out-sings him.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ciframe loading=\"lazy\" width=\"100%\" height=\"360\" src=\"https://www.youtube.com/embed/GEG6_q0yybo?version=3\u0026amp;rel=1\u0026amp;showsearch=0\u0026amp;showinfo=1\u0026amp;iv_load_policy=1\u0026amp;fs=1\u0026amp;hl=en-US\u0026amp;autohide=2\u0026amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eJelly Roll put himself in an even more awkward situation as he stood next to Kix Brooks’ piano, reciting Ronnie Dunn’s monologue from “Believe” about “Old Man Wrigley,” in a stilted manner. it suggested while he’d like to spend more time on Hollywood lots in the future, he wasn’t sure which camera to look at presently. When Dunn himself emerged onto the stage, it seemed like Roll joined the audience in breathing a sigh of relief. The monologue sounded warm wrapped in Dunn’s 71-year-old voice of velvet, and the crowd that Jelly Roll failed to engage in a sing-along suddenly remembered the words.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ciframe loading=\"lazy\" width=\"100%\" height=\"360\" src=\"https://www.youtube.com/embed/ZEbqlvqBLg0?version=3\u0026amp;rel=1\u0026amp;showsearch=0\u0026amp;showinfo=1\u0026amp;iv_load_policy=1\u0026amp;fs=1\u0026amp;hl=en-US\u0026amp;autohide=2\u0026amp;wmode=transparent\" allowfullscreen=\"true\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003ePost Malone shines in some settings — he can sing the hell out of a \u003ca href=\"https://consequence.net/2022/06/post-malone-best-covers-list/\" target=\"_blank\" rel=\"noopener\"\u003egrunge cover\u003c/a\u003e — but his solo rendition of “Yours” was perhaps the lowest point of an uninspiring evening. Posty’s “Yours” received an \u003ca href=\"https://www.dailymail.co.uk/tvshowbiz/article-14108429/post-malone-voice-cma-awards-2024-performance.html\" target=\"_blank\" rel=\"noopener nofollow\"\u003eavalanche of online hate\u003c/a\u003e, and as of the time of this writing, neither Malone nor the CMAs have bothered to load it to YouTube. Cell phone footage captured some \u003ca href=\"https://x.com/visitmusiccity/status/1859426353847705674\" target=\"_blank\" rel=\"noopener nofollow\"\u003epitchy runs\u003c/a\u003e, though this was hardly the worst of it.\u003c/p\u003e\n\u003cp\u003ePerhaps Post Malone was suffering through an off-night, and maybe Jelly Roll has been rehearsing the “Believe” monologue since he was selling \u003cem\u003eGamblin’ on the White Boy \u003c/em\u003emixtapes out of his car. Maybe these genre-hopping artists are true believers in the power of country, instead of what they looked like, which is opportunists cashing in on a trend. Maybe they’re not frauds, but the Country Music Association certainly is.\u003c/p\u003e\n\u003cp\u003eAcross a more-than 60-year-legacy of mediocrity, the CMAs have enforced a narrow definition of country. They walled it off from Jason Isbell, Sturgill Simpson, and too many talented women to count, long before they snubbed Beyoncé. And after all those years of gatekeeping, what have they preserved? What have they saved for country, as Jelly Roll and Post Malone scan the horizon for the next trend out of Nashville?\u003c/p\u003e\n\u003cp\u003eThe answer, as loud as a Stapleton solo, is nothing. Every fake emotional quiver in Jelly Roll’s monologue, and every note that Post Malone couldn’t quite locate, can be thrown onto the piles of evidence that the gatekeepers don’t care about quality, or tradition, or even singing on-key; they never had any goal except continuing to work the gates.\u003c/p\u003e\n\u003cp\u003eBecause of the CMAs, country music’s tent is a little smaller, and its pitch a little farther afield. They made their award show worse on purpose, and deserved exactly what they got.\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-21T15:51:25-05:00",
  "modifiedTime": null
}
