{
  "id": "e2309f50-8640-4fea-8995-29983a32bea6",
  "title": "10 Essential Trap Metal Songs",
  "link": "https://metalinjection.net/lists/10-essential-trap-metal-songs",
  "description": "Like nü-metal? Check out trap metal! The post 10 Essential Trap Metal Songs appeared first on Metal Injection.",
  "author": "Graham Hartmann",
  "published": "Thu, 20 Mar 2025 17:24:41 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Lists",
    "Scarlxrd",
    "Ghostemane",
    "City Morgue",
    "Trap Metal",
    "Travis Barker",
    "Suicideboys"
  ],
  "byline": "By Graham Hartmann Published 7 hours ago",
  "length": 6460,
  "excerpt": "Like nü-metal? Check out trap metal!",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Trap metal is difficult to define, because aggressive hip-hop often doesn't often cross into metal territory.  The trap metal genre, which grew from the Soundcloud hip-hop underground of the mid-2010s, can be best characterized by the use of heavily distorted 808 drum machine beats, tuned-down guitars, screaming vocals, industrial or nü-metal soundscapes, hip-hop flows, and lyricism which blends together modern trap with gothic themes.  Trap metal grates on the ears like early black metal and distorts traditional hip-hop beats to create uncomfortable levels of over-modulation. It's as anti-social as modern hardcore and delves into depraved lyrical hellscapes akin to grindcore or drug-fueled industrial music. The acts which influenced trap metal are too numerous to count. City Morgue's ZillaKami has cited Slipknot, DMX, Radiohead and Title Fight as major influences, while artists like Ghostemane drew from acts like Bathory, Outcast, Carcass and Three 6 Mafia. Like nü-metal or emo rap, trap metal is a bizarre Frankenstein of contrary art forms, and its result is both subversive and polarizing.  Most trap metal fans will agree that the genre's golden era was a short one — roughly from 2016-2019. And as the genre became more publicized and copy-pasted, its raw power began to diminish. However, the genre's originators continue to release phenomenal cuts and lead cult-like fan bases, with a new tour featuring $uicideboy$, Ghostemane and City Morgue hitting arenas. Here's a look through some of trap metal's greatest and most essential songs.  Bones – \"RestInPeace\" (2016) One of the earliest and most influential innovators of trap metal, American rapper Bones helped send the sub-genre in motion with his 2016 mixtape Useless. \"RestInPeace\" starts out with no hint of where its second half will take the listener. Out of nowhere, Bones goes harsh with his vocals, shredding his throat as an 808 beat drops. Bones continues his aggressive streak with the dreamlike \"GladWeHaveAnUnderstanding,\" which is highly recommended if you dig \"RestInPeace.\" Ski Mask the Slump God \u0026 XXXTENTACION – \"Take a Step Back\" (2016) It's not a pure trap metal song, but the energy in Ski Mask the Slump God and XXXTentacion's \"Take a Step Back\" is WILD, and it's another key component to what would become trap metal. X pushed distorted beats to their absolute zenith on tracks like \"ImSippinTeaInYoHood\" and \"YuNg BrAtZ,\" but this collab with Ski Mask led to one of the most insane performances in the history of the Rolling Loud festival. Scarlxrd – \"HEART ATTACK\" (2017) When the history books are written, \"HEART ATTACK\" by British rapper Scarlxrd will likely be enshrined as the first, and perhaps greatest, pure trap metal song. This shit is absolute creative brilliance and insanity, from its unsettling intro sample to Scarlxrd's piercing screams and rapid-fire bars. Scar even helped define the trap metal aesthetic, both with his clothing and how the \"HEART ATTACK\" music video was shot. This is the genre's founding moment. Ghostemane – \"Mercury: Retrograde\" (2017) One of trap metal's purely gothic pioneers, Ghostemane defined his sound with tracks like \"Mercury: Retrograde.\" The massively popular cut seamlessly switches between Southern-influenced trap and vicious screaming, brought to life thanks to Ghostemane's black metal influences. Ghostemane has also brought down-tuned metal guitars into tracks like \"AI\" and \"LAZARETTO.\" ITSOKTOCRY – \"I've Seen Satan, He Has Dreadlocks\" (2017) If trap music had a bastard love child with the DOOM 2016 soundtrack, it'd be ITSOKTOCRY's \"I've Seen Satan, He Has Dreadlocks.\" Though it's one of the more slept on trap metal bangers, it's one of the heaviest and most guitar-based tracks within the genre, especially for 2017. This cut is a pivotal moment when metal began to blatantly assert its influence into underground trap.  Cameron Azi – \"SLITYAWRIST\" (feat. $ubjectz) (2017) This shit is rawwwww. It's like the Patient Zero of trap metal, combining the basic elements of the still-burgeoning genre into a track that'll open the pit every time. Beginning with a creepy guitar intro, distorted vocals and horror-movie samples, \"SLITYAWRIST\" doesn't let up once the first verse drops. It's pure aggression for just over a minute and then it dips. This is what the replay button was built for.  Killstation – \"Claustrophobia\" (2017) Killstation's trap metal career was short-lived, but the artist's discography is one of the most well-produced and consistent in the genre's history. Killstation ran the trap genre gamut with a diversity of styles, but \"Claustrophobia\" may be his grimiest offering. The abyss of a soundscape creates a nightmare bound in hushed gutturals. Make sure to bump \"Filth\" too if you're interested in going down the Killstation rabbit hole.  City Morgue – \"33rd Blakk Glass\" (2018) Pound-for-pound, City Morgue (aka ZillaKami x SosMula) is arguably the greatest trap metal act. Where other acts merely dabble in trap metal, City Morgue trafficks almost exclusively in the genre. With three albums released and another on the way, City Morgue's collection of bangers is unrivaled. \"SHINNERS13\"… \"NECK BRACE\"… \"Caligula\"… \"THE ELECTRIC EXPERIENCE\"… \"33rd Blakk Glass\"… all phenomenal. Binge the whole discography NOW. $uicideboy$ and Travis Barker – \"Don't Trust Anyone\" (2019) $uicideboy$ have long lurked in the darkest corners of hip-hop, creating a unique blend of horrorcore and southern rap that's balanced as perfectly as an Olympic gymnast. They've crossed into the trap metal realm more than a few times, most blatantly on \"DON'T TRUST ANYONE!\" from their collab with Travis Barker, LIVE FAST DIE WHENEVER. Don't sleep on \"Nightmare Choir (I Been Asleep Too Long)\" either.   Tokyo's Revenge – \"Body Count\" (feat. Jasiah) (2020) Tokyo's Revenge and Jasiah are both more than worthy of an inclusion on this list, and \"Body Count\" is a collab that calls back to the days of XXX and Ski Mask while also planting a flag into the modern age. \"Body Count\" is a speedball of trap metal — chill while aggressive as fuck, and unbelievably addictive. Turn up for this one. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/09/ITSOKTOCRY.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eTrap metal is difficult to define, because aggressive hip-hop often doesn\u0026#39;t often cross into metal territory.  The trap metal genre, which grew from the Soundcloud hip-hop underground of the mid-2010s, can be best characterized by the use of heavily distorted 808 drum machine beats, tuned-down guitars, screaming vocals, industrial or nü-metal soundscapes, hip-hop flows, and lyricism which blends together modern trap with gothic themes. \u003c/p\u003e\n\n\n\n\u003cp\u003eTrap metal grates on the ears like early black metal and distorts traditional hip-hop beats to create uncomfortable levels of over-modulation. It\u0026#39;s as anti-social as modern hardcore and delves into depraved lyrical hellscapes akin to grindcore or drug-fueled industrial music.\n\n\n\n\u003c/p\u003e\u003cp\u003eThe acts which influenced trap metal are too numerous to count. \u003cstrong\u003eCity Morgue\u003c/strong\u003e\u0026#39;s \u003cstrong\u003eZillaKami\u003c/strong\u003e has cited \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/slipknot\"\u003eSlipknot\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003eDMX\u003c/strong\u003e, \u003cstrong\u003eRadiohead\u003c/strong\u003e and \u003cstrong\u003eTitle Fight\u003c/strong\u003e as major influences, while artists like \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/ghostemane\"\u003eGhostemane\u003c/a\u003e\u003c/strong\u003e drew from acts like \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/bathory\"\u003eBathory\u003c/a\u003e\u003c/strong\u003e, Outcast, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/carcass\"\u003eCarcass\u003c/a\u003e\u003c/strong\u003e and Three 6 Mafia. Like nü-metal or emo rap, trap metal is a bizarre Frankenstein of contrary art forms, and its result is both subversive and polarizing. \n\n\n\n\u003c/p\u003e\u003cp\u003eMost trap metal fans will agree that the genre\u0026#39;s golden era was a short one — roughly from 2016-2019. And as the genre became more publicized and copy-pasted, its raw power began to diminish. However, the genre\u0026#39;s originators continue to release phenomenal cuts and lead cult-like fan bases, with a new tour featuring \u003cstrong\u003e$uicideboy$\u003c/strong\u003e, \u003cstrong\u003eGhostemane\u003c/strong\u003e and \u003cstrong\u003eCity Morgue\u003c/strong\u003e hitting arenas.\n\n\n\n\u003c/p\u003e\u003cp\u003eHere\u0026#39;s a look through some of trap metal\u0026#39;s greatest and most essential songs. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-bones-restinpeace-2016\"\u003eBones – \u0026#34;RestInPeace\u0026#34; (2016)\u003c/h2\u003e\n\n\n\n\u003cp\u003eOne of the earliest and most influential innovators of trap metal, American rapper \u003cstrong\u003eBones\u003c/strong\u003e helped send the sub-genre in motion with his 2016 mixtape \u003cem\u003eUseless\u003c/em\u003e. \u0026#34;RestInPeace\u0026#34; starts out with no hint of where its second half will take the listener. Out of nowhere, \u003cstrong\u003eBones\u003c/strong\u003e goes harsh with his vocals, shredding his throat as an 808 beat drops. Bones continues his aggressive streak with the dreamlike \u0026#34;GladWeHaveAnUnderstanding,\u0026#34; which is highly recommended if you dig \u0026#34;RestInPeace.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Bones - RestInPeace\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/ewZZNeYDiLo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eSki Mask the Slump God \u0026amp; XXXTENTACION – \u0026#34;Take a Step Back\u0026#34; (2016)\u003c/h2\u003e\n\n\n\n\u003cp\u003eIt\u0026#39;s not a pure trap metal song, but the energy in \u003cstrong\u003eSki Mask the Slump God\u003c/strong\u003e and \u003cstrong\u003eXXXTentacion\u003c/strong\u003e\u0026#39;s \u0026#34;Take a Step Back\u0026#34; is \u003cem\u003eWILD\u003c/em\u003e, and it\u0026#39;s another key component to what would become trap metal. \u003cstrong\u003eX\u003c/strong\u003e pushed distorted beats to their absolute zenith on tracks like \u0026#34;ImSippinTeaInYoHood\u0026#34; and \u0026#34;YuNg BrAtZ,\u0026#34; but this collab with \u003cstrong\u003eSki Mask\u003c/strong\u003e led to one of the most insane performances in the history of the Rolling Loud festival.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Take A Step Back\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/PbiWPUxGygs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eScarlxrd – \u0026#34;HEART ATTACK\u0026#34; (2017)\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen the history books are written, \u0026#34;HEART ATTACK\u0026#34; by British rapper \u003cstrong\u003eScarlxrd\u003c/strong\u003e will likely be enshrined as the first, and perhaps greatest, pure trap metal song. This shit is absolute creative brilliance and insanity, from its unsettling intro sample to \u003cstrong\u003eScarlxrd\u003c/strong\u003e\u0026#39;s piercing screams and rapid-fire bars. \u003cstrong\u003eScar\u003c/strong\u003e even helped define the trap metal aesthetic, both with his clothing and how the \u0026#34;HEART ATTACK\u0026#34; music video was shot. This is the genre\u0026#39;s founding moment.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"scarlxrd - HEART ATTACK [Prod. JVCXB]\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/OC7cNS0GINo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eGhostemane – \u0026#34;Mercury: Retrograde\u0026#34; (2017)\u003c/h2\u003e\n\n\n\n\u003cp\u003eOne of trap metal\u0026#39;s purely gothic pioneers, \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/ghostemane\"\u003eGhostemane\u003c/a\u003e\u003c/strong\u003e defined his sound with tracks like \u0026#34;Mercury: Retrograde.\u0026#34; The massively popular cut seamlessly switches between Southern-influenced trap and vicious screaming, brought to life thanks to \u003cstrong\u003eGhostemane\u003c/strong\u003e\u0026#39;s black metal influences. \u003cstrong\u003eGhostemane\u003c/strong\u003e has also brought down-tuned metal guitars into tracks like \u0026#34;AI\u0026#34; and \u0026#34;LAZARETTO.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"GHOSTEMANE - Mercury\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/31j4DIpgY9U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eITSOKTOCRY – \u0026#34;I\u0026#39;ve Seen Satan, He Has Dreadlocks\u0026#34; (2017)\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf trap music had a bastard love child with the \u003cem\u003eDOOM 2016\u003c/em\u003e soundtrack, it\u0026#39;d be \u003cstrong\u003eITSOKTOCRY\u003c/strong\u003e\u0026#39;s \u0026#34;I\u0026#39;ve Seen Satan, He Has Dreadlocks.\u0026#34; Though it\u0026#39;s one of the more slept on trap metal bangers, it\u0026#39;s one of the heaviest and most guitar-based tracks within the genre, especially for 2017. This cut is a pivotal moment when metal began to blatantly assert its influence into underground trap. \n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"ITSOKTOCRY - I\u0026#39;ve Seen Satan, He Has Dreadlocks\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/o80n9oK3xnI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eCameron Azi – \u0026#34;SLITYAWRIST\u0026#34; (feat. $ubjectz) (2017)\u003c/h2\u003e\n\n\n\n\u003cp\u003eThis shit is rawwwww. It\u0026#39;s like the Patient Zero of trap metal, combining the basic elements of the still-burgeoning genre into a track that\u0026#39;ll open the pit every time. Beginning with a creepy guitar intro, distorted vocals and horror-movie samples, \u0026#34;SLITYAWRIST\u0026#34; doesn\u0026#39;t let up once the first verse drops. It\u0026#39;s pure aggression for just over a minute and then it dips. This is what the replay button was built for. \n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Cameronazi ft. $ubjectz - SLITYAWRIST (Official Music Video)\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/ogVS1zsxR1k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eKillstation – \u0026#34;Claustrophobia\u0026#34; (2017)\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eKillstation\u003c/strong\u003e\u0026#39;s trap metal career was short-lived, but the artist\u0026#39;s discography is one of the most well-produced and consistent in the genre\u0026#39;s history. \u003cstrong\u003eKillstation\u003c/strong\u003e ran the trap genre gamut with a diversity of styles, but \u0026#34;Claustrophobia\u0026#34; may be his grimiest offering. The abyss of a soundscape creates a nightmare bound in hushed gutturals. Make sure to bump \u0026#34;Filth\u0026#34; too if you\u0026#39;re interested in going down the \u003cstrong\u003eKillstation\u003c/strong\u003e rabbit hole. \n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Claustrophobia\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/qRkq9NRCtIY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eCity Morgue – \u0026#34;33rd Blakk Glass\u0026#34; (2018)\u003c/h2\u003e\n\n\n\n\u003cp\u003ePound-for-pound, \u003cstrong\u003eCity Morgue\u003c/strong\u003e (aka \u003cstrong\u003eZillaKami x SosMula\u003c/strong\u003e) is arguably the greatest trap metal act. Where other acts merely dabble in trap metal, \u003cstrong\u003eCity Morgue\u003c/strong\u003e trafficks almost exclusively in the genre. With three albums released and another on the way, \u003cstrong\u003eCity Morgue\u003c/strong\u003e\u0026#39;s collection of bangers is unrivaled. \u0026#34;SHINNERS13\u0026#34;… \u0026#34;NECK BRACE\u0026#34;… \u0026#34;Caligula\u0026#34;… \u0026#34;THE ELECTRIC EXPERIENCE\u0026#34;… \u0026#34;33rd Blakk Glass\u0026#34;… all phenomenal. Binge the whole discography \u003cem\u003eNOW\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"ZillaKami x SosMula - 33rd Blakk Glass (AUDIO)\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/FkP3PmrNcJY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003e$uicideboy$ and Travis Barker – \u0026#34;Don\u0026#39;t Trust Anyone\u0026#34; (2019)\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e$uicideboy$\u003c/strong\u003e have long lurked in the darkest corners of hip-hop, creating a unique blend of horrorcore and southern rap that\u0026#39;s balanced as perfectly as an Olympic gymnast. They\u0026#39;ve crossed into the trap metal realm more than a few times, most blatantly on \u0026#34;DON\u0026#39;T TRUST ANYONE!\u0026#34; from their collab with \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/travis-barker\"\u003eTravis Barker\u003c/a\u003e\u003c/strong\u003e, \u003cem\u003eLIVE FAST DIE WHENEVER\u003c/em\u003e. Don\u0026#39;t sleep on \u0026#34;Nightmare Choir (I Been Asleep Too Long)\u0026#34; either.  \n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"DON\u0026#39;T TRUST ANYONE!\" width=\"880\" height=\"660\" src=\"https://www.youtube.com/embed/5-06BVABkkk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eTokyo\u0026#39;s Revenge – \u0026#34;Body Count\u0026#34; (feat. Jasiah) (2020)\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eTokyo\u0026#39;s Revenge\u003c/strong\u003e and \u003cstrong\u003eJasiah\u003c/strong\u003e are both more than worthy of an inclusion on this list, and \u0026#34;Body Count\u0026#34; is a collab that calls back to the days of \u003cstrong\u003eXXX\u003c/strong\u003e and \u003cstrong\u003eSki Mask\u003c/strong\u003e while also planting a flag into the modern age. \u0026#34;Body Count\u0026#34; is a speedball of trap metal — chill while aggressive as fuck, and unbelievably addictive. Turn up for this one.\n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"TOKYO\u0026#39;S REVENGE FT. JASIAH - BODY COUNT\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/WhsBg90XZec?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\t\t\t\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-20T13:24:41-04:00",
  "modifiedTime": "2025-03-20T14:46:33-04:00"
}
