{
  "id": "ed76d5db-3c6b-45b1-94a2-7944d798dacb",
  "title": "Album Review: SÓLSTAFIR Hin Helga Kvöl",
  "link": "https://metalinjection.net/reviews/album-review-solstafir-hin-helga-kvol",
  "description": "\"A great deal of diversity and expert songwriting gives Hin helga kvöl a clearly distinguished place in the band's brilliant catalog.\"",
  "author": "Jeff Podoshen",
  "published": "Tue, 05 Nov 2024 18:58:18 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Reviews",
    "solstafir"
  ],
  "byline": "By Jeff Podoshen Published 5 hours ago",
  "length": 2977,
  "excerpt": "\"A great deal of diversity and expert songwriting gives Hin helga kvöl a clearly distinguished place in the band's brilliant catalog.\"",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "Everyone's favorite Icelandic cowboys are back, this time with their most mature and refined record to date. Sólstafir's Hin helga kvöl is nothing short of a masterpiece. I first discovered Sólstafir when they player Maryland Death Fest a good number of years back. This when most of the bands played in the giant parking lot out in the middle of downtown Baltimore. Sólstafir have been a fervent part of the underground scene for many years, flying just below the radar. One distinctive feature of the band that might have prevented them from greater mainstream success has been their practice to only sing song in their native Icelandic, (short of one song, \"Her Fall From Grace\" on their previous record, Endless Twilight of Codependent Love released back in 2020). While Icelandic might be one of the most difficult languages for foreigners to learn, I've never minded the fact that I couldn't fully understand what's being sung. The music really helps tell the story in their songs and I like to think of the lyrics as something that adds another unique texture to their already complex sonicspheres. \"Hun Andar\" is the opening track. The lush guitars have almost an indie sound to them while the percussion and rhythm form a rather upbeat backdrop. Layered vocals give the song some brilliant texture. The title track, \"Hin Helga Kvöl\" is a speed-infused rocker that is reveals the band's solid roots in metal. Of course, in their typical style, the foursome give us some twists and turns rather than rely on pure velocity or heft. It's a rather raw cut, sonically, entrenched in black metal origins. \"Nu Mun Ljosio Deyja\" is a similar track that also will satisfy those looking for something particularly heavy. \"Blakkrakki\" is a fun track with a an equally fun video that has the band on a moving flatbed playing across the Icelandic landscape. A departure from the heavy emotions usually found in their music, this is a more playful cut that shows that Solstafir can just have some all out good times as well. And if you're wondering what a \"blakkrakki\" is, it's simply a black dog. I hear some early U2 influence in this track, perhaps that's why I can't seem to get it out of my head. \"Vor As\" is a rocker. Perhaps their closest thing to something you might hear in an arena. Replete with female backing vocals, the band seems to pull a rabbit out of a hat here. \"Freygatan\" is another song that's firmly entrenched in classic rock roots. This one will evoke a bit of David Gilmour with it's guitar solo that comes in towards the end of the track. Emotions run high in both \"Gryla\" and \"Kuml.\" Both very moving and somewhat bleak, however, fans of the band would expect nothing less. Speaking of the bands' fan following, I've come to think that many will find lots to love in this newest record. A great deal of diversity and expert songwriting gives Hin helga kvöl a clearly distinguished place in the band's brilliant catalog.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2024/11/Album-Review-SOLSTAFIR-Hin-Helga-Kvol.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\n\u003cp\u003eEveryone\u0026#39;s favorite Icelandic cowboys are back, this time with their most mature and refined record to date. \u003cstrong\u003e\u003ca href=\"https://metalinjection.net/tag/solstafir\"\u003eSólstafir\u003c/a\u003e\u003c/strong\u003e\u0026#39;s \u003cem\u003eHin helga kvöl \u003c/em\u003eis nothing short of a masterpiece. I first discovered \u003cstrong\u003eSólstafir\u003c/strong\u003e when they player Maryland Death Fest a good number of years back. This when most of the bands played in the giant parking lot out in the middle of downtown Baltimore.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"SÓLSTAFIR - Hún andar (OFFICIAL VIDEO)\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/ES5TmL6y5ug?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSólstafir\u003c/strong\u003e have been a fervent part of the underground scene for many years, flying just below the radar. One distinctive feature of the band that might have prevented them from greater mainstream success has been their practice to only sing song in their native Icelandic, (short of \u003ca href=\"https://www.youtube.com/watch?v=NkZH0sCWGK8\u0026amp;list=RDEMlHY4lZ_j5QUV7nqkTgWQQQ\u0026amp;index=2\u0026amp;ab_channel=SeasonofMist\"\u003eone song, \u0026#34;Her Fall From Grace\u0026#34;\u003c/a\u003e on their previous record, \u003cem\u003eEndless Twilight of Codependent Love\u003c/em\u003e released back in 2020). While Icelandic might be one of the most difficult languages for foreigners to learn, I\u0026#39;ve never minded the fact that I couldn\u0026#39;t fully understand what\u0026#39;s being sung. The music really helps tell the story in their songs and I like to think of the lyrics as something that adds another unique texture to their already complex sonicspheres.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Hun Andar\u0026#34; is the opening track. The lush guitars have almost an indie sound to them while the percussion and rhythm form a rather upbeat backdrop. Layered vocals give the song some brilliant texture. \n\n\n\n\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Sólstafir - Hin Helga Kvöl (OFFICIAL VIDEO)\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/s6qKV8s9-BA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe title track, \u0026#34;Hin Helga Kvöl\u0026#34; is a speed-infused rocker that is reveals the band\u0026#39;s solid roots in metal. Of course, in their typical style, the foursome give us some twists and turns rather than rely on pure velocity or heft. It\u0026#39;s a rather raw cut, sonically, entrenched in black metal origins. \u0026#34;Nu Mun Ljosio Deyja\u0026#34; is a similar track that also will satisfy those looking for something particularly heavy.\n\n\n\n\u003c/p\u003e\u003cp\u003e\u0026#34;Blakkrakki\u0026#34; is a fun track with a an equally fun video that has the band on a moving flatbed playing across the Icelandic landscape. A departure from the heavy emotions usually found in their music, this is a more playful cut that shows that Solstafir can just have some all out good times as well. And if you\u0026#39;re wondering what a \u0026#34;blakkrakki\u0026#34; is, it\u0026#39;s simply a black dog. I hear some early U2 influence in this track, perhaps that\u0026#39;s why I can\u0026#39;t seem to get it out of my head.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"SÓLSTAFIR - Blakkrakki (OFFICIAL VIDEO)\" width=\"880\" height=\"495\" src=\"https://www.youtube.com/embed/qlDOokjBApo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u0026#34;Vor As\u0026#34; is a rocker. Perhaps their closest thing to something you might hear in an arena. Replete with female backing vocals, the band seems to pull a rabbit out of a hat here. \u0026#34;Freygatan\u0026#34; is another song that\u0026#39;s firmly entrenched in classic rock roots. This one will evoke a bit of \u003cstrong\u003eDavid Gilmour\u003c/strong\u003e with it\u0026#39;s guitar solo that comes in towards the end of the track.\n\n\n\n\u003c/p\u003e\u003cp\u003eEmotions run high in both \u0026#34;Gryla\u0026#34; and \u0026#34;Kuml.\u0026#34; Both very moving and somewhat bleak, however, fans of the band would expect nothing less. Speaking of the bands\u0026#39; fan following, I\u0026#39;ve come to think that many will find lots to love in this newest record. A great deal of diversity and expert songwriting gives \u003cem\u003eHin helga kvöl\u003c/em\u003e a clearly distinguished place in the band\u0026#39;s brilliant catalog.\n\t\t\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-05T13:58:18-05:00",
  "modifiedTime": "2024-11-05T13:58:23-05:00"
}
