{
  "id": "fe399704-e70b-4533-9c9b-a04c752728eb",
  "title": "HACKTIVIST Splits With Their Guitarist, Bassist \u0026 Drummer",
  "link": "https://metalinjection.net/news/breakups/hacktivist-splits-with-their-guitarist-bassist-drummer",
  "description": "Hacktivist – down to two guys at the moment. The post HACKTIVIST Splits With Their Guitarist, Bassist \u0026 Drummer appeared first on Metal Injection.",
  "author": "Greg Kennelty",
  "published": "Mon, 24 Mar 2025 21:31:10 +0000",
  "source": "http://feeds.feedburner.com/metalinjection",
  "categories": [
    "Breakups \u0026 Shakeups",
    "Hacktivist"
  ],
  "byline": "By Greg Kennelty Published 2 hours ago",
  "length": 1107,
  "excerpt": "Hacktivist – down to two guys at the moment.",
  "siteName": "Metal Injection",
  "favicon": "https://metalinjection.net/apple-touch-icon.png",
  "text": "British djenty nü-metal act Hactivist has undergone a pretty drastic lineup change. Hacktivist is currently vocalists Jermaine Hurley and JJ Olifent, as they've split with drummer Richard Hawking, guitarist James Hewitt, and bassist Josh Gurner. Hactivist only notes that they've got a new lineup on the way and for fans to stay tuned. \"Today we're announcing that drummer; Richard Hawking, guitarist; James Hewitt, and bassist; Josh Gurner, will not be continuing in the band with us,\" wrote Hactivist. \"We're super grateful for their contributions and wish them all the best in their future endeavors. Tough decisions have been made on all sides, but we can assure all of our supporters that there's no bad blood between us. It's all love. Updates to follow about a fresh new line up this week so keep your eyes and ears peeled.\" Hawking was an original member from back in 2011, while Hewitt and Gurner both joined in 2018. Want More Metal? Subscribe To Our Daily NewsletterEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.",
  "image": "https://cdn-p.smehost.net/sites/7f9737f2506941499994d771a29ad47a/wp-content/uploads/2025/03/Hacktivist-Breakup.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\n\n\n\n\n\t\t\n\u003cp\u003eBritish djenty nü-metal act \u003cstrong\u003eHactivist\u003c/strong\u003e has undergone a pretty drastic lineup change. Hacktivist is currently vocalists \u003cstrong\u003eJermaine Hurley\u003c/strong\u003e and \u003cstrong\u003eJJ Olifent\u003c/strong\u003e, as they\u0026#39;ve split with drummer \u003cstrong\u003eRichard Hawking\u003c/strong\u003e, guitarist \u003cstrong\u003eJames Hewitt\u003c/strong\u003e, and bassist Josh\u003cstrong\u003e Gurner\u003c/strong\u003e. \u003cstrong\u003eHactivist\u003c/strong\u003e only notes that they\u0026#39;ve got a new lineup on the way and for fans to stay tuned.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u0026#34;Today we\u0026#39;re announcing that drummer; \u003cstrong\u003eRichard Hawking\u003c/strong\u003e, guitarist; \u003cstrong\u003eJames Hewitt\u003c/strong\u003e, and bassist; \u003cstrong\u003eJosh Gurner\u003c/strong\u003e, will not be continuing in the band with us,\u0026#34; wrote \u003cstrong\u003eHactivist\u003c/strong\u003e. \u0026#34;We\u0026#39;re super grateful for their contributions and wish them all the best in their future endeavors. Tough decisions have been made on all sides, but we can assure all of our supporters that there\u0026#39;s no bad blood between us. It\u0026#39;s all love. Updates to follow about a fresh new line up this week so keep your eyes and ears peeled.\u0026#34;\n\n\n\n\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHawking\u003c/strong\u003e was an original member from back in 2011, while \u003cstrong\u003eHewitt\u003c/strong\u003e and \u003cstrong\u003eGurner\u003c/strong\u003e both joined in 2018.\n\n\n\n\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cstrong\u003eWant More Metal? Subscribe To Our Daily Newsletter\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEnter your information below to get a daily update with all of our headlines and receive The Orchard Metal newsletter.\u003c/p\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-24T17:31:10-04:00",
  "modifiedTime": "2025-03-24T17:31:11-04:00"
}
