{
  "id": "6d055117-6be2-4e7f-99ef-deedb7d986ba",
  "title": "Hackaday Links: February 2, 2025",
  "link": "https://hackaday.com/2025/02/02/hackaday-links-february-2-2025/",
  "description": "All things considered, it was a very bad week for aviation here in the United States. Three separate crashes, two of which involved US military aircraft, have left over 70 …read more",
  "author": "Dan Maloney",
  "published": "Mon, 03 Feb 2025 00:00:56 +0000",
  "source": "https://hackaday.com/blog/feed/",
  "categories": [
    "Hackaday Columns",
    "Hackaday links",
    "Slider",
    "abduction",
    "asteroid",
    "boom",
    "electron",
    "hackaday links",
    "IP bullying",
    "kidnapping",
    "nintendo",
    "orbitals",
    "quantum",
    "Roadster",
    "robot server",
    "super mario",
    "supersonic",
    "tesla",
    "test flight",
    "wave function",
    "XB-1"
  ],
  "byline": "",
  "length": 4848,
  "excerpt": "All things considered, it was a very bad week for aviation here in the United States. Three separate crashes, two of which involved US military aircraft, have left over 70 people dead. We’ll …",
  "siteName": "Hackaday",
  "favicon": "https://hackaday.com/wp-content/themes/hackaday-2/img/hackaday-logo_1024x1024.png?v=3",
  "text": "All things considered, it was a very bad week for aviation here in the United States. Three separate crashes, two of which involved US military aircraft, have left over 70 people dead. We’ll spare you the details since there are plenty of other places to get news like that, but we did want to touch on one bright spot in this week’s aviation news: the first successful supersonic flight by a US-made civilian aircraft. There are a lot of caveats to that claim, but it’s clear that Boom Supersonic is on a path to commercializing supersonic air transportation for the first time since the Concorde was retired. Their XB-1 “Baby Boom” test aircraft managed three separate supersonic runs during the January 28 test flight over the Mojave test range. As usual, Scott Manley has excellent coverage of the test flight, including a look at how Boom used a Starlink terminal and an iPhone to stream cockpit video. It’s been more than 20 years since Concorde was retired, and while the planes were an engineering marvel, they always seemed like a solution in search of a problem. The Analog’s Weekend Wire has a good rundown of the economics driving the design of Boom’s Overture airliner, including a look at how a plane with fewer seats than the Concorde and a slow top speed can make money for airlines. The company is targeting service on more than 600 routes, and they’ve already got orders from three major carriers and the US Department of Defense for a plane that hasn’t been built yet, so they must be onto something. It’ll be interesting to see how this pans out, and how supersonic planes will change air travel. “Look, up in the sky! Is that an asteroid with a chance to wipe out humanity?” Sorry, no, it’s just a Tesla Roadster. Elon’s former ride was briefly mistaken for an asteroid after spotting it in early January. The object was given the designation 2018 CN41 for about a day before astronomers deleted the entry from the International Astronomical Union’s Minor Planet Electronic Circular once it became clear that the object’s orbital matched “artificial object 2018-017A, Falcon Heavy upper stage with Tesla Roadster.” So, disappointing news to those looking for a cosmic solution to our woes, but cheer up — there’s always 2024 YR4 to look forward to. So is robot kidnapping going to be a thing now? It appears so if this attempted abduction of a robot server is any indication. The alleged crime took place at a pho joint in San Jose, California, which uses a robot to deliver food to its customers. The perp entered the establishment under the guise of needing the restroom, but once he emerged he tried to abscond with the service bot, which appears to be a BellaBot from Pudu Robotics. He was either pretty motivated or pretty jacked — the bot weighs in at a hefty 55 kilos, and he just dead-lifted the awkwardly shaped bot and headed for the door. He was foiled by restaurant employees as he tried to wrestle it into the back of a Honda CR-V before giving up and fleeing the scene. No word if the $18,000 bot was damaged during the attempted heist, or if the wait staff would have been on the hook for the replacement cost had the thief succeeded. Score one for the little guy as a grocery store in Costa Rica wins a trademark battle against gaming giant Nintendo. The shop in question is owned by a chap named Mario and calls itself “Super Mario,” a fact which caught the attention of Nintendo’s IP team when Mario’s son Charlito went to renew their trademark application with the Cost Rican trademark authority. Nintendo sent out a nastygram, Mario and Carlito stood their ground, and the Costa Rica National Registry backed them up. As a bonus, Super Mario has had a bump in business as a result of coverage of the dustup. Streisand Effect much? And finally, if you remember the good old days when the atomic model was just a small solar system with electron planets whizzing around a nucleus star, you’ll probably remember the cognitive dissonance of learning that that’s not at all how electrons work. Having to wrap your head around probablity clouds and oddly shaped orbitals was a real challenge, one that we never fully managed. Until now, that is, with the help of Mahesh over at FloatHeadPhysics and his excellent walkthrough of atomic orbitals. The key insight for us was realizing the “wave function” of electrons is analogous to standing waves on a string, and that the probability of finding a electron at any point along the string is least at the nodes. Expanding that concept to three dimensions and throwing in a little of Schrödinger’s magic makes is much easier to visualize how the various orbitals get their shapes. There’s still a little hand-waving, at least for us — we’re still not sure how these orbitals interact with each other, for example — but we’re a lot further along now. Thanks, Mahesh!",
  "image": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n        \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n            \n\u003carticle itemscope=\"\" itemtype=\"http://schema.org/Article\" id=\"post-756661\"\u003e\n    \n\n    \u003cdiv itemprop=\"articleBody\"\u003e\n        \u003cp\u003eAll things considered, it was a very bad week for aviation here in the United States. Three separate crashes, two of which involved US military aircraft, have left over 70 people dead. We’ll spare you the details since there are plenty of other places to get news like that, but we did want to touch on one bright spot in this week’s aviation news: \u003ca href=\"https://techcrunch.com/2025/01/28/booms-xb-1-becomes-first-civil-aircraft-to-go-supersonic/?guccounter=1\" target=\"_blank\"\u003ethe first successful supersonic flight by a US-made civilian aircraft\u003c/a\u003e. There are a lot of caveats to that claim, but it’s clear that Boom Supersonic is on a path to commercializing supersonic air transportation for the first time since the Concorde was retired. Their XB-1 “Baby Boom” test aircraft managed three separate supersonic runs during the January 28 test flight over the Mojave test range. As usual, Scott Manley has \u003ca href=\"https://www.youtube.com/watch?v=Fo6ZyNl9ISY\" target=\"_blank\"\u003eexcellent coverage of the test flight\u003c/a\u003e, including a look at how Boom used a Starlink terminal and an iPhone to stream cockpit video.\u003c/p\u003e\n\n\u003cp\u003eIt’s been more than 20 years since Concorde was retired, and while the planes were an engineering marvel, they always seemed like a solution in search of a problem. The Analog’s \u003ca href=\"https://hardwarefyi.substack.com/p/weekend-wire-11-the-return-of-supersonic?utm_campaign=email-half-post\u0026amp;r=2z1uj4\u0026amp;utm_source=substack\u0026amp;utm_medium=email\" target=\"_blank\"\u003eWeekend Wire\u003c/a\u003e has a good rundown of the economics driving the design of Boom’s Overture airliner, including a look at how a plane with fewer seats than the Concorde and a slow top speed can make money for airlines. The company is targeting service on more than 600 routes, and they’ve already got orders from three major carriers and the US Department of Defense for a plane that hasn’t been built yet, so they must be onto something. It’ll be interesting to see how this pans out, and how supersonic planes will change air travel.\u003c/p\u003e\n\u003cp\u003e“Look, up in the sky! Is that an asteroid with a chance to wipe out humanity?” Sorry, no, \u003ca href=\"https://www.theregister.com/2025/01/27/elon_musk_tesla_asteroid/\" target=\"_blank\"\u003eit’s just a Tesla Roadster\u003c/a\u003e. Elon’s former ride was briefly mistaken for an asteroid after spotting it in early January. The object was given the designation 2018 CN41 for about a day before astronomers deleted the entry from the International Astronomical Union’s \u003ca href=\"https://minorplanetcenter.net/mpec/K25/K25A49.html\" target=\"_blank\"\u003eMinor Planet Electronic Circular\u003c/a\u003e once it became clear that the object’s orbital matched “artificial object 2018-017A, Falcon Heavy upper stage with Tesla Roadster.” So, disappointing news to those looking for a cosmic solution to our woes, but cheer up — there’s always \u003ca href=\"https://apnews.com/article/newly-discovered-asteroid-nasa-space-6f81d82acc55c899764d2a900d33f1d0\" target=\"_blank\"\u003e2024 YR4 to look forward to\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eSo is robot kidnapping going to be a thing now? It appears so if \u003ca href=\"https://abc7news.com/post/pho-real-san-jose-restaurant-employees-wrestle-attempted-robot-server-kidnapper/15837443/\" target=\"_blank\"\u003ethis attempted abduction of a robot server\u003c/a\u003e is any indication. The alleged crime took place at a pho joint in San Jose, California, which uses a robot to deliver food to its customers. The perp entered the establishment under the guise of needing the restroom, but once he emerged he tried to abscond with the service bot, which appears to be \u003ca href=\"https://www.pudurobotics.com/products/bellabot\" target=\"_blank\"\u003ea BellaBot\u003c/a\u003e from Pudu Robotics. He was either pretty motivated or pretty jacked — the bot weighs in at a hefty 55 kilos, and he just dead-lifted the awkwardly shaped bot and headed for the door. He was foiled by restaurant employees as he tried to wrestle it into the back of a Honda CR-V before giving up and fleeing the scene. No word if the $18,000 bot was damaged during the attempted heist, or if the wait staff would have been on the hook for the replacement cost had the thief succeeded.\u003c/p\u003e\n\u003cp\u003e\u003ciframe title=\"San Jose restaurant workers wrestle with attempted \u0026#39;robot server kidnapper\u0026#39;\" width=\"800\" height=\"450\" src=\"https://www.youtube.com/embed/Dpdh6m2NedM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eScore one for the little guy as \u003ca href=\"https://www.techdirt.com/2025/01/29/nintendo-loses-after-trying-to-oppose-the-trademark-for-a-costa-rican-grocery-store/\" target=\"_blank\"\u003ea grocery store in Costa Rica wins a trademark battle against gaming giant Nintendo\u003c/a\u003e. The shop in question is owned by a chap named Mario and calls itself “Super Mario,” a fact which caught the attention of Nintendo’s IP team when Mario’s son Charlito went to renew their trademark application with the Cost Rican trademark authority. Nintendo sent out a nastygram, Mario and Carlito stood their ground, and the Costa Rica National Registry backed them up. As a bonus, Super Mario has had a bump in business as a result of coverage of the dustup. \u003ca href=\"https://en.wikipedia.org/wiki/Streisand_effect\" target=\"_blank\"\u003eStreisand Effect\u003c/a\u003e much?\u003c/p\u003e\n\u003cp\u003eAnd finally, if you remember the good old days when the atomic model was just a small solar system with electron planets whizzing around a nucleus star, you’ll probably remember the cognitive dissonance of learning that that’s not at all how electrons work. Having to wrap your head around probablity clouds and oddly shaped orbitals was a real challenge, one that we never fully managed. Until now, that is, with the help of Mahesh over at FloatHeadPhysics and \u003ca href=\"https://www.youtube.com/watch?v=M--6_0F62pQ\" target=\"_blank\"\u003ehis excellent walkthrough of atomic orbitals\u003c/a\u003e. The key insight for us was realizing the “wave function” of electrons is analogous to standing waves on a string, and that the probability of finding a electron at any point along the string is least at the nodes. Expanding that concept to three dimensions and throwing in a little of Schrödinger’s magic makes is much easier to visualize how the various orbitals get their shapes. There’s still a little hand-waving, at least for us — we’re still not sure how these orbitals interact with each other, for example — but we’re a lot further along now. Thanks, Mahesh!\u003c/p\u003e\n\u003cp\u003e\u003ciframe title=\"I never intuitively understood atomic orbitals...until now!\" width=\"800\" height=\"450\" src=\"https://www.youtube.com/embed/M--6_0F62pQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\t            \u003c/div\u003e\n    \u003cul\u003e\n    \t\t\t\t\t\u003cli\u003e\n    \t\t\t\t\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F02%2Fhackaday-links-february-2-2025%2F\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_face.png\"/\u003e \u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n                        \u003ca href=\"https://twitter.com/intent/tweet?text=Hackaday%20Links:%20February%202,%202025%20via%20@hackaday\u0026amp;url=https://hackaday.com/2025/02/02/hackaday-links-february-2-2025/\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_twitter.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n    \t\t\t\t\u003ca href=\"https://www.linkedin.com/shareArticle?url=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F02%2Fhackaday-links-february-2-2025%2F\" target=\"_blank\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_in.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\t\t\u003cli\u003e\n                \u003ca href=\"mailto:?subject=Hackaday+Links%3A+February+2%2C+2025 | Hackaday\u0026amp;body=https%3A%2F%2Fhackaday.com%2F2025%2F02%2F02%2Fhackaday-links-february-2-2025%2F\"\u003e\n    \t\t\t\t\t\u003ci\u003e\u003cimg src=\"https://hackaday.com/wp-content/themes/hackaday-2/img/share_mail1.png\"/\u003e\u003c/i\u003e\n    \t\t\t\t\t\t\t\t\t\u003c/a\u003e\n    \t\t\t\u003c/li\u003e\n    \t\t\t\u003c/ul\u003e\n    \n\u003c/article\u003e\n\n            \t\n\t\n            \n\n            \n\n\n        \n        \n\n        \n        \n\n        \n        \u003c/main\u003e\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-03T00:00:56Z",
  "modifiedTime": "2025-02-02T19:10:20Z"
}
