{
  "id": "ba24fa33-2794-40a1-8c5e-ac74416135a6",
  "title": "Don't Skip These 5 Underrated Apple Music Features",
  "link": "https://www.makeuseof.com/underrated-apple-music-features/",
  "description": "Apple Music is packed with amazing features—so why aren't you using them all?",
  "author": "Brent Dirks",
  "published": "Fri, 18 Apr 2025 17:00:16 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "IPhone",
    "Apple Music",
    "Apple",
    "Streaming Music"
  ],
  "byline": "Brent Dirks",
  "length": 10355,
  "excerpt": "Apple Music is packed with amazing features—so why aren\u0026#039;t you using them all?",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "Apple Music is one of the best music streaming services out there, and for good reason. Apple offers a wide variety of features for every music fan. But here are some of the features you might not know about. 5 Create a Radio Station from a Single Song While Apple Music has millions of songs to choose from, it can sometimes still be hard to find exactly what you want to hear. One of the best ways to go on a unique musical exploration journey is to create a radio station from a single song, album, artist, or genre. Tell Apple Music a tune you like, and then it will create a station with other similar music you might like. It’s a great way to expand your musical boundaries from the same old songs. To create a radio station, find the song, album, artist, or genre you’d like to use for the station. Long press it until a new menu pops up on the screen. Then choose Create Station. Head to the Recently Played section in the Home tab to find the station. It’s one of my favorite ways to break up my usual music routine with some new songs that I usually enjoy. Creating a radio station is far from the only way to find new music. Try these handy tips to find new tunes on Apple Music. 4 Wake Up to a Custom Alarm Every Morning There’s also a better way to wake up in the morning instead of the loud droning of an alarm. On your iPhone, it’s easy to choose a specific Apple Music song as an alarm tone. To begin, just open up the Clock app on your iPhone. Select + to add an alarm. Set the time and if it should repeat. You can also set a label. Choose Sound and then head to the Songs section and choose Pick a song. And instead of getting jolted wide awake, I can enjoy one of my favorite tunes as I gently say good morning. It really does make a huge difference. Make sure to try it out with one of your favorite songs. 3 Enjoy Spatial and Lossless Audio Even though music can oftentimes be a group experience, Apple Music has two great options that take the experience to a different level when you use compatible headphones—Spatial Audio and Lossless Audio. Spatial Audio on Apple Music uses Dolby Atmos technology to provide a 3D soundstage with sound seemingly coming from all around you. While many modern Apple devices support the feature, you’ll need compatible headphones like Apple’s AirPods or Beats to really experience the technology as it should. While the technology can sometimes be a work in progress, with a good song, the result is astounding. Instead of simple stereo, you can close your eyes and imagine being directly in front of the band or artist while they perform. There are hundreds of thousands of songs in Spatial Audio—just look for the Dolby Atmos icon in Apple Music. There are also a number of tailor-made playlists with Spatial Audio tunes. Along with Spatial Audio, Lossless Audio on Apple Music can provide an even better listening experience. The format preserves all original audio information, meaning nothing is lost during compression. It has a higher bitrate and sample rate than other formats. Because of the high-quality music, you can’t listen to lossless music via Bluetooth on your iPhone. You’ll need a wired connection to your iPhone or other device. To make sure lossless audio is turned on, go to Settings \u003e Apps \u003e Music. Finally, tap Audio Quality and make sure Lossless Audio is toggled on. 2 Become the Song With Apple Music Sing There are just times when you want to start singing a song. You could be happy, sad, or something else. It just feels good to sing at the top of your lungs. It’s easy to use Apple Music Sing to live out your best rock star fantasies. With the feature, you can sing along to your favorite song as real-time lyrics appear on the screen. Special technology separates the song’s vocals and background music so you can only focus on your voice. To activate Apple Music Sing, select the Lyrics icon and the Quotation mark on the bottom left of any song page. When the lyrics appear, choose the microphone icon to start singing. And since karaoke is better with duets, the Duet View will appear on any track with multiple artists. If you’d rather not use Apple, make sure to check out some of the best karaoke apps available. 1 A Monthly Replay Playlist Sure, Spotify might get all of the press with its year-end roundup. But Apple Music doesn’t make you wait 12 months to see your most popular songs. The unique Monthly Replay Playlist will give you a monthly replay of some of the songs you couldn’t get enough of. To see your monthly recap, head to the Home tab on Apple Music via a mobile device, browser, or desktop app. Scroll down, choose the Replay 2025 playlist card, and add it to your library.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2024/08/temporarily-disable-apple-music-listening-history-on-iphone-16.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eApple Music is one of the best music streaming services out there, and for good reason. Apple offers a wide variety of features for every music fan. But here are some of the features you might not know about.\u003c/p\u003e    \u003ch2 id=\"create-a-radio-station-from-a-single-song\"\u003e\n            \u003cspan\u003e5 \u003c/span\u003e\n        \u003cspan\u003e\n                            Create a Radio Station from a Single Song\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                    \n    \n\n\u003cp\u003eWhile Apple Music has millions of songs to choose from, it can sometimes still be hard to find exactly what you want to hear. One of the best ways to go on a unique musical exploration journey is to create a radio station from a single song, album, artist, or genre. Tell Apple Music a tune you like, and then it will create a station with other similar music you might like. It’s a great way to expand your musical boundaries from the same old songs.\u003c/p\u003e    \n\u003cp\u003eTo create a radio station, find the song, album, artist, or genre you’d like to use for the station. Long press it until a new menu pops up on the screen. Then choose \u003cstrong\u003eCreate Station\u003c/strong\u003e. Head to the \u003cstrong\u003eRecently Played \u003c/strong\u003esection in the \u003cstrong\u003eHome\u003c/strong\u003e tab to find the station. It’s one of my favorite ways to break up my usual music routine with some new songs that I usually enjoy.\u003c/p\u003e    \n\u003cp\u003eCreating a radio station is far from the only way to find new music. Try these handy \u003ca href=\"https://www.makeuseof.com/heres-how-i-discover-new-music-in-apple-music/\" target=\"_blank\"\u003etips to find new tunes on Apple Music\u003c/a\u003e.\u003c/p\u003e    \u003ch2 id=\"wake-up-to-a-custom-alarm-every-morning\"\u003e\n            \u003cspan\u003e4 \u003c/span\u003e\n        \u003cspan\u003e\n                            Wake Up to a Custom Alarm Every Morning\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                                        \n    \n\n\u003cp\u003eThere’s also a better way to wake up in the morning instead of the loud droning of an alarm. On your iPhone, it’s easy to choose a specific Apple Music song as an alarm tone. To begin, just open up the Clock app on your iPhone. Select \u003cstrong\u003e+\u003c/strong\u003e to add an alarm. Set the time and if it should repeat. You can also set a label. Choose \u003cstrong\u003eSound\u003c/strong\u003e and then head to the \u003cstrong\u003eSongs\u003c/strong\u003e section and choose \u003cstrong\u003ePick a song\u003c/strong\u003e.\u003c/p\u003e    \n\u003cp\u003eAnd instead of getting jolted wide awake, I can enjoy one of my favorite tunes as I gently say good morning. It really does make a huge difference. Make sure to try it out with one of your favorite songs.\u003c/p\u003e    \u003ch2 id=\"enjoy-spatial-and-lossless-audio\"\u003e\n            \u003cspan\u003e3 \u003c/span\u003e\n        \u003cspan\u003e\n                            Enjoy Spatial and Lossless Audio\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                            \n    \n    \n    \n    \n    \n\n\u003cp\u003e Even though music can oftentimes be a group experience, Apple Music has two great options that take the experience to a different level when you use compatible headphones—Spatial Audio and Lossless Audio.\u003c/p\u003e    \n\u003cp\u003eSpatial Audio on Apple Music uses Dolby Atmos technology to provide a 3D soundstage with sound seemingly coming from all around you. While many modern Apple devices support the feature, you’ll need compatible headphones like Apple’s AirPods or Beats to really experience the technology as it should.\u003c/p\u003e    \n\u003cp\u003eWhile the technology can sometimes be a work in progress, with a good song, the result is astounding. Instead of simple stereo, you can close your eyes and imagine being directly in front of the band or artist while they perform. There are hundreds of thousands of songs in Spatial Audio—just look for the Dolby Atmos icon in Apple Music. There are also a number of tailor-made playlists with Spatial Audio tunes.\u003c/p\u003e    \n\u003cp\u003eAlong with Spatial Audio, Lossless Audio on Apple Music can provide an even better listening experience. The format preserves all original audio information, meaning nothing is lost during compression. It has a higher bitrate and sample rate than other formats. Because of the high-quality music, you can’t listen to lossless music via Bluetooth on your iPhone. You’ll need a wired connection to your iPhone or other device. To make sure lossless audio is turned on, go to \u003cstrong\u003eSettings \u0026gt; Apps \u0026gt; Music.\u003c/strong\u003e Finally, tap \u003cstrong\u003eAudio Quality\u003c/strong\u003e and make sure \u003cstrong\u003eLossless Audio\u003c/strong\u003e is toggled on.\u003c/p\u003e    \u003ch2 id=\"become-the-song-with-apple-music-sing\"\u003e\n            \u003cspan\u003e2 \u003c/span\u003e\n        \u003cspan\u003e\n                            Become the Song With Apple Music Sing\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                            \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2360\" height=\"1640\" loading=\"lazy\" decoding=\"async\" alt=\"The Apple Music Sing karaoke feature.\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/apple-music-sing-karaoke.PNG\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e There are just times when you want to start singing a song. You could be happy, sad, or something else. It just feels good to sing at the top of your lungs. It’s easy to use Apple Music Sing to live out your best rock star fantasies.\u003c/p\u003e    \n\u003cp\u003eWith the feature, you can sing along to your favorite song as real-time lyrics appear on the screen. Special technology separates the song’s vocals and background music so you can only focus on your voice.\u003c/p\u003e    \n\u003cp\u003eTo activate \u003cstrong\u003eApple Music Sing\u003c/strong\u003e, select the \u003cstrong\u003eLyrics\u003c/strong\u003e icon and the \u003cstrong\u003eQuotation mark\u003c/strong\u003e on the bottom left of any song page. When the lyrics appear, choose the microphone icon to start singing. And since karaoke is better with duets, the Duet View will appear on any track with multiple artists.\u003c/p\u003e    \n\u003cp\u003eIf you’d rather not use Apple, make sure to check out some of the \u003ca href=\"https://www.makeuseof.com/best-free-karaoke-apps/\" target=\"_blank\"\u003ebest karaoke apps available\u003c/a\u003e.\u003c/p\u003e    \u003ch2 id=\"a-monthly-replay-playlist\"\u003e\n            \u003cspan\u003e1 \u003c/span\u003e\n        \u003cspan\u003e\n                            A Monthly Replay Playlist\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                            \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"1398\" height=\"954\" loading=\"lazy\" decoding=\"async\" alt=\"The Apple music monthly replay. \" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/04/apple-music-replay.jpg\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e Sure, Spotify might get all of the press with its year-end roundup. But Apple Music doesn’t make you wait 12 months to see your most popular songs. The unique Monthly Replay Playlist will give you a monthly replay of some of the songs you couldn’t get enough of. To see your monthly recap, head to the \u003cstrong\u003eHome\u003c/strong\u003e tab on Apple Music via a mobile device, browser, or desktop app. Scroll down\u003cspan\u003e, choose the \u003cstrong\u003eReplay 2025\u003c/strong\u003e playlist card, and\u003c/span\u003e add it to your library.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-04-18T17:00:16Z",
  "modifiedTime": "2025-04-18T17:00:16Z"
}
