{
  "id": "c4f16f8a-8f0d-4c6a-b25c-40208080b399",
  "title": "This Nasty Malware Reminds Us Why Pirating Games Is Dangerous",
  "link": "https://www.makeuseof.com/nasty-malware-reminds-pirating-games-dangerous/",
  "description": "Your pirated games come with a side of infostealer malware.",
  "author": "Yadullah Abidi",
  "published": "Thu, 05 Jun 2025 21:34:30 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Security",
    "Malware",
    "Cybersecurity",
    "Browser Security"
  ],
  "byline": "Yadullah Abidi",
  "length": 13254,
  "excerpt": "Your pirated games come with a side of infostealer malware.",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "Sign in to your MUO account One of the primary reasons not to pirate software is that hackers often upload legitimate software with malicious malware attached. There is a similar malware circulating, targeting video games this time. Your Pirated Game Comes With a Side of Malware GamesBeat reports that security researchers have discovered a new infostealer malware called Myth Stealer. This malware is available as a weekly or monthly subscription to cybercriminals who then embed it in games and set up fake gaming websites to distribute it. It's not just video games either. The malware is also being embedded in cracks and cheats for other games that are often available as standalone archives you can download and run. Once installed on your PC, Myth Stealer targets Gecko and Chromium-based browsers and steals data like saved passwords, payment data, cookies, and autofill information. Since the malware covers both Gecko and Chromium, it covers the most popular browsers like Chrome, Edge, Firefox, and Brave, among others. The malware was first spotted in late December 2024 when its developers made a Telegram group to market it and also offered it free for others to try out. Telegram reportedly shut down the original channel, but the developers have kept the malware alive by jumping between groups and frequently updating the source code to throw off antivirus detectors. Myth Stealer is coded in Rust, a programming language known for its cross-platform compatibility and performance benefits. Updates to the malware have since added more features and better evasion methods. It can also pass a VirusTotal scan, meaning you'll likely not spot it until it's too late. Another layer of protection for the malware developers is the fact that they aren't the ones carrying out the attack. Instead, they're offering a subscription service where other cybercriminals can pay to use the malware either via crypto or Razer Gold gift cards, adding distance between the malware developers and any victims. Don’t Download Pirated Software The best way to protect yourself against such attacks is to simply not pirate software. By pirating, not only are you downloading illegal software, but you're also inviting trouble by visiting shady websites that try to scam you or downloading software that comes with malware attached. Related I Don't Download Cracked Software to Avoid These 4 Real Dangers Cracked software comes with a whole host of worrying dangers that it's simply best to avoid. Hackers often abuse legitimate software or web apps to deliver malware. There are ways you can check a downloaded file is safe before running, but prevention is better than a cure. Even Steam isn't safe from malware, so if a site or download seems shady, it's best to avoid it entirely and save yourself the hassle.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/person-browsing-internet-on-laptop-with-malware-sign.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n        \n        \n        \n\n\n\n            \u003carticle\u003e\n\n        \n                \n    \n\n\n\n    \n    \n    \n        \n           \u003cheader\u003e\n            \n                                                \n\n\n    \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                \n\n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                    \n                        \n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F662749420094d-bew.jpg?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n            \n    \n            \u003ca id=\"login-button-article-sidebar\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                                            \n                                                                \n    \n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/header\u003e\n\n                            \n        \n\n        \n                                        \n                                \n            \n                        \n        \n        \n\n    \n            \n    \n                                                            \n            \n    \n    \n                                                                            \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n                                                    \n                        \n    \n                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                                                    \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                                    \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                                                        \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                                                        \n            \n    \n    \n        \n                \n                    \n                        \n                                    \u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\u003cp\u003eOne of the primary reasons not to pirate software is that hackers often upload legitimate software with malicious malware attached. There is a similar malware circulating, targeting video games this time.\u003c/p\u003e    \u003ch2 id=\"your-pirated-game-comes-with-a-side-of-malware\"\u003e\n                        Your Pirated Game Comes With a Side of Malware\n               \u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://venturebeat.com/games/demystifying-myth-stealer-an-infostealer-that-targeted-video-games-trellix/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eGamesBeat reports\u003c/a\u003e that security researchers have discovered a new infostealer malware called Myth Stealer. This malware is available as a weekly or monthly subscription to cybercriminals who then embed it in games and set up fake gaming websites to distribute it.\u003c/p\u003e    \u003cp\u003eIt\u0026#39;s not just video games either. The malware is also being embedded in cracks and cheats for other games that are often available as standalone archives you can download and run.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \n\u003cp\u003e Once installed on your PC, Myth Stealer targets Gecko and Chromium-based browsers and steals data like saved passwords, payment data, cookies, and autofill information. Since the malware covers both Gecko and Chromium, it covers the most popular browsers like Chrome, Edge, Firefox, and Brave, among others.\u003c/p\u003e    \u003cp\u003eThe malware was first spotted in late December 2024 when its developers made a Telegram group to market it and also offered it free for others to try out. Telegram reportedly shut down the original channel, but the developers have kept the malware alive by jumping between groups and frequently updating the source code to throw off antivirus detectors.\u003c/p\u003e    \u003cp\u003eMyth Stealer is coded in Rust, a programming language known for its cross-platform compatibility and performance benefits. Updates to the malware have since added more features and better evasion methods. It can also pass a VirusTotal scan, meaning you\u0026#39;ll likely not spot it until it\u0026#39;s too late.\u003c/p\u003e    \u003cp\u003eAnother layer of protection for the malware developers is the fact that they aren\u0026#39;t the ones carrying out the attack. Instead, they\u0026#39;re offering a subscription service where other cybercriminals can pay to use the malware either via crypto or Razer Gold gift cards, adding distance between the malware developers and any victims.\u003c/p\u003e    \u003ch2 id=\"dont-download-pirated-software\"\u003e\n                        Don’t Download Pirated Software\n               \u003c/h2\u003e\u003cp\u003eThe best way to protect yourself against such attacks is to simply not pirate software. By pirating, not only are you downloading illegal software, but you\u0026#39;re also inviting trouble by visiting shady websites that try to scam you or downloading software that comes with malware attached.\u003c/p\u003e            \n    \n                    \n                        \n    \n    \n                                        \n    \n        \n    \n        \n                \n        \n    \u003cdiv data-include-community-rating=\"false\" id=\"886e-43fc-aebe8db11cae\" data-nosnippet=\"\"\u003e\n        \n        \n                        \t                \n\t\t\u003ca href=\"https://www.makeuseof.com/dangers-downloading-cracked-software/\"\u003e\n\t\n\t\u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=422\u0026amp;h=268\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=310\u0026amp;h=220\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=720\u0026amp;h=400\u0026amp;dpr=2\"/\u003e\n                    \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg?q=49\u0026amp;fit=crop\u0026amp;w=432\u0026amp;h=260\u0026amp;dpr=2\"/\u003e\n                             \n                    \u003cimg width=\"2100\" height=\"1400\" loading=\"lazy\" decoding=\"async\" alt=\"person using laptop with large malware warning\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/09/person-using-laptop-with-large-malware-warning.jpg\"/\u003e\n                \n    \u003c/picture\u003e\n                \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\t\t\u003c/a\u003e\n\t\n\n        \n                    \u003cp\u003e\u003cspan data-field=\"label\"\u003eRelated\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\n\n                \n                 \n                \t\n\u003ch5\u003e\n\t\n\n\t\t\t\t\t        \t\t\t\t\n\t\t\u003ca href=\"https://www.makeuseof.com/dangers-downloading-cracked-software/\" title=\"I Don\u0026#39;t Download Cracked Software to Avoid These 4 Real Dangers\" target=\"_blank\"\u003e\n\t\t\tI Don\u0026#39;t Download Cracked Software to Avoid These 4 Real Dangers\n\t\t\u003c/a\u003e\n\t\u003c/h5\u003e\n\n                                                    \n                \t\t\t\t\t\t\t\t\t\u003cp\u003eCracked software comes with a whole host of worrying dangers that it\u0026#39;s simply best to avoid.\u003c/p\u003e\n\t\t\t\n\n                    \n\n\n                \n                \n                \n                \n\n                \n                \n                \n                \t\n\n\n                \n\n                \n                \n                \n            \u003c/div\u003e\n                \n        \n        \n        \n            \u003c/div\u003e\n\u003cp\u003eHackers often abuse legitimate software or web apps to deliver malware. There are ways you can \u003ca href=\"https://www.makeuseof.com/how-check-downloaded-file-is-safe/\" target=\"_blank\"\u003echeck a downloaded file is safe before running\u003c/a\u003e, but prevention is better than a cure. \u003ca href=\"https://www.makeuseof.com/not-even-steam-safe-malware/\" target=\"_blank\"\u003eEven Steam isn\u0026#39;t safe from malware\u003c/a\u003e, so if a site or download seems shady, it\u0026#39;s best to avoid it entirely and save yourself the hassle.\u003c/p\u003e    \u003c/div\u003e\n    \n                \n        \n        \n\n\n        \n\n\n\n\n\n                                            \n\n    \n\n\n        \n    \u003c/article\u003e\n\n    \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-06-05T21:34:30Z",
  "modifiedTime": "2025-06-05T21:34:30Z"
}
