{
  "id": "002a9934-bf96-43c9-8352-b25001b4f79b",
  "title": "Android Weekly Issue #684",
  "link": "https://androidweekly.net/issues/issue-684/rss.xml",
  "description": "Articles \u0026 Tutorials Sponsored Fast, flake-free, and fully parallel automated testing for Apps QA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. They create and maintain your test suite in open-source Appium and WebdriverIO, so no vendor lock-in. Also, they provide unlimited, 100% parallel test runs with zero flakes—so you can execute thousands of tests in minutes without a device farm, Grid, or TestNG. Add Android app testing to your QA process. Learn more. Exploring PausableComposition internals in Jetpack Compose Shreyas Patil dives into Compose’s experimental PausableComposition feature, explaining internals and how enabling it can improve UI smoothness. Live Templates in Android Studio Segun Famisa demonstrates a live template to quickly generate Kotlin test functions with backticks and cursor positioning in Android Studio. Sponsored Advertise to more than 80k Android developers! We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! Compose stability tips and tricks Jakub Ledwoń offers actionable tips for improving Compose performance through stability diagnostics, annotations, immutable collections, compiler config, and strong skipping mode. ​​Add Speed Effects to Your Android Videos Using Media3 Kubra Harmankaya shows how to use Media3’s experimental speed-change effect for previewing and exporting variable-speed videos in Android apps. Understanding derivedStateOf in Jetpack Compose : Optimize your recompositions Richa Sharma highlights using derivedStateOf to cache derived state dependencies and reduce unnecessary recalculations in Jetpack Compose. A Journey with KSP and KotlinPoet Muhammad Sarim Mehdi showcases Kombinator, a KSP + KotlinPoet tool for generating exhaustive combinations of data-class constructor parameters for testing and demos. Building Your First Kotlin Multiplatform App Faisal Ahmed shows how to build a shared-code subscription app for Android and iOS using Compose Multiplatform, SQLDelight, and Clean Architecture. Breaking to Build: Fuzzing the Kotlin Compiler Katie Fraser highlights using fuzzing techniques to uncover and fix deep-seated bugs in Kotlin’s K1 and K2 compilers via collaboration with TU Delft. How to Answer Hashing Like a Java/Kotlin Expert Shakarim Bazhenov outlines core equals/hashCode behavior, bucket indexing, collision handling, and tuning hash-based collections for efficiency in Kotlin/Java. Jobs Senior Android Engineer (Remote) Join DuckDuckGo, a remote-first company dedicated to raising online trust standards, where a culture of trust, inclusivity, and empowered project management allows team members to take full ownership of their projects. We're looking for an experienced Android engineer with 7+ years in native apps, s Libraries \u0026 Code loremgibson Lorem Gibson is placeholder text generator built using Compose Multiplatform. play-store-mcp An MCP server that connects to Play Store Console and release new App versions from an MCP Client. Kombinator Open-source Kotlin library to generate all possible distinct objects of a data class compose-floating-tab-bar A Jetpack Compose floating tab bar that mimics the iOS 26 Liquid Glass tab bar behavior. News New tools to help drive success for one-time products Google Play is revamping the way developers can manage one time products, providing greater flexibility and new ways to sell Agent mode in Android Studio Gemini’s new Agent mode automates complex development tasks in Android Studio through planned multi-file edits and iterative fixes under your review. Free webinar — Mastering Kotlin Flow Marcin Moskala hosts a free July 22 session unraveling Flow’s internal mechanics, concurrency, essential operators, and live Q\u0026A. Videos \u0026 Podcasts What is Firebase AI Logic? Firebase AI Logic helps you to bring the power of generative AI to your mobile and web apps. Project Creation \u0026 First Hello World App - Spring Boot 4 Basics With Kotlin Philipp Lackner shows what Spring Boot and a backend is, why Kotlin is a great language for it and how you can build your very first hello world URL endpoint for it. Get Started with Firebase AI Logic on Android Add AI-powered features to your Android apps with Firebase AI Logic. Marina covers project setup, dependency management, and generating text. Learn how to begin building with Firebase AI Logic. Build a Runtime-Enabled SDK This video provides a step by step guide on how to build an SDK that's compatible with the SDK Runtime, an Android 14 architecture designed to safeguard user data and increase trust by isolating SDKs THIS Brand New Attribute Makes Compose Texts Fully Responsive (Auto-Scaling!) Philipp Lackner shows how you can use the new autoTextSize attribute from Compose texts to build responsive texts that automatically scale between a minimum and maximum font size. How To Create Stacked Avatars | Jetpack Compose Jov Mit shows how to create overlapping avatars in the live-stream recording.",
  "author": "",
  "published": "Sun, 20 Jul 2025 10:19:56 +0000",
  "source": "https://androidweekly.net/rss.xml",
  "categories": null,
  "byline": "",
  "length": 2303,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "QA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. They create and maintain your test suite in open-source Appium and WebdriverIO, so no vendor lock-in. Also, they provide unlimited, 100% parallel test runs with zero flakes—so you can execute thousands of tests in minutes without a device farm, Grid, or TestNG. Add Android app testing to your QA process. Learn more. Segun Famisa demonstrates a live template to quickly generate Kotlin test functions with backticks and cursor positioning in Android Studio. We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product! Jakub Ledwoń offers actionable tips for improving Compose performance through stability diagnostics, annotations, immutable collections, compiler config, and strong skipping mode. Muhammad Sarim Mehdi showcases Kombinator, a KSP + KotlinPoet tool for generating exhaustive combinations of data-class constructor parameters for testing and demos. Join DuckDuckGo, a remote-first company dedicated to raising online trust standards, where a culture of trust, inclusivity, and empowered project management allows team members to take full ownership of their projects. We're looking for an experienced Android engineer with 7+ years in native apps, s Lorem Gibson is placeholder text generator built using Compose Multiplatform. An MCP server that connects to Play Store Console and release new App versions from an MCP Client. Open-source Kotlin library to generate all possible distinct objects of a data class Gemini’s new Agent mode automates complex development tasks in Android Studio through planned multi-file edits and iterative fixes under your review. Add AI-powered features to your Android apps with Firebase AI Logic. Marina covers project setup, dependency management, and generating text. Learn how to begin building with Firebase AI Logic. This video provides a step by step guide on how to build an SDK that's compatible with the SDK Runtime, an Android 14 architecture designed to safeguard user data and increase trust by isolating SDKs ]]\u003e",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.qawolf.com/solutions/android-testing?utm_source=androidweekly\u0026amp;utm_medium=newsletter\u0026amp;utm_campaign=ACQ_All_Demo_Conversions__NewsletterAudience_-_Newsletter_FasterAndroidAppReleases_20250720-None_Experiment-FALSE\u0026amp;utm_term=cta-learnmore\u0026amp;utm_content=FasterAndroidAppReleases_LearnMore_None_Headline%3AFasterAndroidAppReleasesWithAutomatedQA_3B3BEF_0DF2CC%2CFFFFFF_1200x1200_Newsletter-PrimaryPlacement_20250720_v2_QAWolfIllustration\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/687cc1/773c93bc5b0d009fe0/square_Android_1200x1200.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eQA Wolf delivers 80% automated coverage in weeks, running tests on high-fidelity Android emulators with full gesture, sensor, and visual support. They create and maintain your test suite in open-source Appium and WebdriverIO, so no vendor lock-in. Also, they provide unlimited, 100% parallel test runs with zero flakes—so you can execute thousands of tests in minutes without a device farm, Grid, or TestNG.\nAdd Android app testing to your QA process. Learn more.\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eSegun Famisa demonstrates a live template to quickly generate Kotlin test functions with backticks and cursor positioning in Android Studio.\n\u003c/p\u003e\u003c/div\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://androidweekly.net/jobs/new\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/687cc0/be3c93bc5b0d009fc0/square_aw.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eWe reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development related service or product!\n\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eJakub Ledwoń offers actionable tips for improving Compose performance through stability diagnostics, annotations, immutable collections, compiler config, and strong skipping mode.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003cdiv\u003e\u003cp\u003eMuhammad Sarim Mehdi showcases Kombinator, a KSP + KotlinPoet tool for generating exhaustive combinations of data-class constructor parameters for testing and demos.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\u003cdiv\u003e\u003cp\u003eJoin DuckDuckGo, a remote-first company dedicated to raising online trust standards, where a culture of trust, inclusivity, and empowered project management allows team members to take full ownership of their projects. We\u0026#39;re looking for an experienced Android engineer with 7+ years in native apps, s\n\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://github.com/terrakok/loremgibson\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/687c2b/5f3c93bc5b0d008bfa/square_Bildschirmfoto_2025-07-20_um_12.18.40.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eLorem Gibson is placeholder text generator built using Compose Multiplatform.\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAn MCP server that connects to Play Store Console and release new App versions from an MCP Client.\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eOpen-source Kotlin library to generate all possible distinct objects of a data class \n\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eGemini’s new Agent mode automates complex development tasks in Android Studio through planned multi-file edits and iterative fixes under your review.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.youtube.com/watch?v=EpRSIFVtMng\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/687c0b/343c93bc5b0d008717/square_Bildschirmfoto_2025-07-20_um_12.17.41.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eAdd AI-powered features to your Android apps with Firebase AI Logic. Marina  covers project setup, dependency management, and generating text. Learn how to begin building with Firebase AI Logic.\n\n\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eThis video provides a step by step guide on how  to build an SDK that\u0026#39;s compatible with the SDK Runtime, an Android 14 architecture designed to safeguard user data and increase trust by isolating SDKs\n\u003c/p\u003e\u003c/div\u003e\n\n\n]]\u0026gt;\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
