{
  "id": "7b657b8a-3aa6-4b5b-ab78-20109a634e21",
  "title": "Android Weekly Issue #666 🐐",
  "link": "https://androidweekly.net/issues/issue-666/rss.xml",
  "description": "Articles \u0026 Tutorials Sponsored Why mobile releases need to be managed [webinar] The hidden costs of mobile releases—wasted time, rising risks, and developer frustration—add up quickly. Watch our on-demand webinar to learn why mobile releases are challenging—and how teams are cutting release times by 25% to deliver features faster and with confidence. Centering top-level dialog windows in Compose Multiplatform Thomas Künneth provides a method to center top-level dialog windows within their parent windows in Compose Multiplatform applications, enhancing user experience on desktop platforms. Man-in-the-Middle (MITM) Attacks in Android Development Dobri Kostadinov explains MITM attacks in Android and recommends using TLS, certificate pinning, and security libraries to protect app communications. Sponsored New: Secure In-Person Payments for Mobile Apps Highlights of Square’s Mobile Payments SDK: *PCI-compliant, embedded payment system *Supports diverse hardware for in-person payments *Reliable on the move, over the counter, \u0026 at a kiosk *Free to integrate and no API usage costs. Try Square Mobile Payments now Creating a Logo with Frosted Glass Effect in Jetpack Compose Roman Khrupa demonstrates creating a frosted glass effect for logos in Jetpack Compose using the Haze library and custom composables. Swipeable Image Carousel with Smooth Animations in Jetpack Compose Sahil Thakar demonstrates creating a swipeable image carousel in Jetpack Compose using the HorizontalPager component, incorporating contentPadding and pageSpacing to ensure smooth animations and partial visibility of adjacent images. Enhancing Dropdown Menus with Searchable Selection Kerry Bisset demonstrates enhancing Jetpack Compose dropdown menus by introducing a dedicated search field within the dropdown, improving usability for extensive lists. Android Developers Blog: Jetpack WindowManager 1.4 is stable Xiaodao Wu announces the stable release of Jetpack WindowManager 1.4, introducing features like activity stack pinning, pane expansion, and dialog full-screen dimming to enhance multi-window experiences on large-screen devices Unit Testing Lifecycle and State in ViewModels Marcello Galhardo introduces ViewModelScenario, a helper in Lifecycle 2.9.0-alpha01, to facilitate unit testing of ViewModels by simulating lifecycle events and state restoration. How to Develop Firebase Genkit Flows Nozomi Koborinai provides a guide on enhancing local testing environments for Firebase Genkit functions by integrating the Firebase Local Emulator Suite. Automating Hoax Classification with Vertex AI and Cloud Functions Esther Irawati demonstrates using Google’s Vertex AI and Vertex AI Endpoints to automate the classification of hoax content, aiming to combat the rapid spread of misinformation online. Fastlane in Kotlin Multiplatform projects Gustavo Fão Valvassori demonstrates how to integrate Fastlane into Kotlin Multiplatform projects, detailing the creation of platform-specific lanes in the Fastfile to automate build, test, and deployment processes for both Android and iOS applications. Understanding Flow Operators: Buffer, Conflate, Debounce, and Sample Ignacio Carrión delves into Kotlin Flow operators—buffer, conflate, debounce, and sample—explaining their roles in managing data emission and collection, especially when dealing with fast producers and slow consumers. Place a sponsored post Advertise your Android dev course to over 80k readers We reach out to more than 80k Android developers around the world, every week, through our email newsletter and social media channels. Advertise your Android development course! Libraries \u0026 Code OpenNote-Compose Markdown Editor \u0026 Notebook for Android entirely based on Jetpack Compose. News Android Developers Blog: The Third Beta of Android 16 Android 16 has officially reached Platform Stability today with Beta 3! Health Connect Jetpack SDK is now in beta and new feature updates Google announced significant Health Connect updates like the Jetpack SDK Beta, new datatypes and new permissions that will enable richer, more insightful app functionalities. Building excellent games with better graphics and performance Vulkan is now Android’s official graphics API and find more updates to the Android Dynamic Performance Framework (ADPF) for improved game graphics and stability. Multimodal image attachment is now available for Gemini in Android Studio Paris Hsu announces that Gemini in Android Studio now supports multimodal inputs, allowing developers to attach images directly to prompts, enabling features like converting wireframes into Jetpack Compose code, explaining diagrams, and troubleshooting UI issues. Videos \u0026 Podcasts http4k with David Denton Dive into the world of http4k with David Denton, exploring how you can treat your server as a function! Top 4 Security Best Practices for Your Android App Philipp Lackner shares 4 best practices with you that you should stick to in order to make your Android app very secure. Debug Your Kotlin Apps Right in Your IDE with the Koin IDE Plugin Kotzilla introduces the Koin IDE Plugin v1.0.0, a powerful tool designed to help developers debug and optimize their Kotlin apps directly within Android Studio. Can Junie generate Kotlin code from UML? Dave Leeds tasks Junie - JetBrains' new AI coding agent - with writing Kotlin code for some UML diagrams. Let's see if it can implement functions and properties based on context, notes, and other clues! Fix Kotlin App Issues in Minutes - Stop Debugging the Hard Way! Fix Kotlin App Issues in Minutes - Stop Debugging the Hard Way! Multimodal for Gemini in Android Studio, the latest devices at MWC, XR and more! Here's the winter episode of #TheAndroidShow from Barcelona, to give you the latest from Mobile World Congress and across the Android Developer world. XR Unlocked '24 Google announced Android XR at XR Unlocked. Get a firsthand look at the new platform for headsets and glasses. Build the future of XR! Google I/O 2025, Android Studio at 10, Android 16 Betas, and more! Learn about the return of Google I/O, Android Studio Turning 10, the Android 16 Betas, Imagen in Firebase, the latest in AndroidX, and more! Port your Android App to the Web - Part 2 In this episode, convert Android specific code to common code and refactor, the UI, business logic and unit tests. Compose Navigation: Scalable \u0026 Maintainable Setup Jov Mit teaches about a scalable \u0026 maintainable setup of Compose Navigation.",
  "author": "",
  "published": "Sun, 16 Mar 2025 09:07:13 +0000",
  "source": "https://androidweekly.net/rss.xml",
  "categories": null,
  "byline": "",
  "length": 1512,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "The hidden costs of mobile releases—wasted time, rising risks, and developer frustration—add up quickly. Watch our on-demand webinar to learn why mobile releases are challenging—and how teams are cutting release times by 25% to deliver features faster and with confidence. Highlights of Square’s Mobile Payments SDK: *PCI-compliant, embedded payment system *Supports diverse hardware for in-person payments *Reliable on the move, over the counter, \u0026 at a kiosk *Free to integrate and no API usage costs. Try Square Mobile Payments now Nozomi Koborinai provides a guide on enhancing local testing environments for Firebase Genkit functions by integrating the Firebase Local Emulator Suite. Gustavo Fão Valvassori demonstrates how to integrate Fastlane into Kotlin Multiplatform projects, detailing the creation of platform-specific lanes in the Fastfile to automate build, test, and deployment processes for both Android and iOS applications. Markdown Editor \u0026 Notebook for Android entirely based on Jetpack Compose. Dive into the world of http4k with David Denton, exploring how you can treat your server as a function! Dave Leeds tasks Junie - JetBrains' new AI coding agent - with writing Kotlin code for some UML diagrams. Let's see if it can implement functions and properties based on context, notes, and other clues! Google announced Android XR at XR Unlocked. Get a firsthand look at the new platform for headsets and glasses. Build the future of XR! ]]\u003e",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.runway.team/webinar/why-mobile-releases-need-to-be-managed?utm_source=newsletter\u0026amp;utm_medium=android-weekly\u0026amp;utm_campaign=jan-26-25\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/67d5b3/173c93bc72fa011e60/square_black_box.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eThe hidden costs of mobile releases—wasted time, rising risks, and developer frustration—add up quickly. Watch our on-demand webinar to learn why mobile releases are challenging—and how teams are cutting release times by 25% to deliver features faster and with confidence.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://fnf.dev/4kNHQPs\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/67d5b3/7e3c93bc72fa011e6e/square_Square_85x85.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eHighlights of Square’s Mobile Payments SDK: *PCI-compliant, embedded payment system *Supports diverse hardware for in-person payments *Reliable on the move, over the counter, \u0026amp; at a kiosk *Free to integrate and no API usage costs. Try Square Mobile Payments now\n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\u003cdiv\u003e\u003cp\u003eNozomi Koborinai provides a guide on enhancing local testing environments for Firebase Genkit functions by integrating the Firebase Local Emulator Suite.\n\u003c/p\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eGustavo Fão Valvassori demonstrates how to integrate Fastlane into Kotlin Multiplatform projects, detailing the creation of platform-specific lanes in the Fastfile to automate build, test, and deployment processes for both Android and iOS applications.  \n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://androidweekly.net/jobs/new\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/67d5b2/9b3c93bc72fa011e4f/square_aw.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cp\u003eMarkdown Editor \u0026amp; Notebook for Android entirely based on Jetpack Compose.\n\u003c/p\u003e\u003c/div\u003e\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://android-developers.googleblog.com/2025/03/the-third-beta-of-android-16.html\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/67d646/813c93bc72fa0134ed/square_Bildschirmfoto_2025-03-16_um_10.05.11.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\n\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://thebakery.dev/95/\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" width=\"90\" src=\"https://androidweekly.net/system/images/67d64a/913c93bc72fa0135bd/square_Bildschirmfoto_2025-03-16_um_10.06.09.png\"/\u003e\n\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003ctd\u003e\u003cdiv\u003e\u003cp\u003eDive into the world of http4k with David Denton, exploring how you can treat your server as a function! \n\u003c/p\u003e\u003c/div\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" width=\"5\" height=\"1\" src=\"https://imgssl.constantcontact.com/letters/images/1101116784221/S.gif\"/\u003e\u003c/p\u003e\u003c/div\u003e\n\n\u003cdiv\u003e\u003cp\u003eDave Leeds tasks Junie - JetBrains\u0026#39; new AI coding agent - with writing Kotlin code for some UML diagrams. Let\u0026#39;s see if it can implement functions and properties based on context, notes, and other clues!\n\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003cdiv\u003e\u003cp\u003eGoogle announced Android XR at XR Unlocked. Get a firsthand look at the new platform for headsets and glasses. Build the future of XR!\n\u003c/p\u003e\u003c/div\u003e\n\n\n\n]]\u0026gt;\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
