{
  "id": "bc98b9d0-787f-4e25-9272-4e30f64ae4b6",
  "title": "Toolbox App 2.4 Gets a Refreshed UI Theme, Right-Click Context Menu, and Other Updates",
  "link": "https://blog.jetbrains.com/toolbox-app/2024/07/toolbox-app-2-4-gets-a-refreshed-ui-theme-right-click-context-menu-and-other-updates/",
  "description": "Toolbox App 2.4 comes with a reworked UI theme, a new way to open the context menu for tools, and other updates. If you’re using Gitee, check out the JetBrains Toolbox browser extension update as well. New UI theme Toolbox App 2.4 got a facelift! The navigation remains the same, but we’ve reworked the interface […]",
  "author": "Aleksandra Krupskaya",
  "published": "Tue, 02 Jul 2024 16:05:50 +0000",
  "source": "https://blog.jetbrains.com/blog/feed",
  "categories": [
    "jetbrains-toolbox",
    "toolbox-app"
  ],
  "byline": "Aleksandra Krupskaya",
  "length": 3167,
  "excerpt": "Toolbox App 2.4 comes with a reworked UI theme, a new way to open the context menu for tools, and other updates. If you’re using Gitee, check out the JetBrains Toolbox browser extension update as w",
  "siteName": "The JetBrains Blog",
  "favicon": "https://blog.jetbrains.com/wp-content/uploads/2024/01/cropped-mstile-310x310-1-180x180.png",
  "text": "Toolbox App 2.4 Gets a Refreshed UI Theme, Right-Click Context Menu, and Other Updates Read this post in other languages: Toolbox App 2.4 comes with a reworked UI theme, a new way to open the context menu for tools, and other updates. If you’re using Gitee, check out the JetBrains Toolbox browser extension update as well. New UI theme Toolbox App 2.4 got a facelift! The navigation remains the same, but we’ve reworked the interface to look more modern and sleek. There’s also a new toggle called Use background effects in Settings that allows you to enable or disable the gradient. We hope you enjoy it! Right-click context menu The context menu for tools is now easier to reach – just right-click on the name of a tool in the list to access tool update settings, an overview of the new features in the installed version, links to log files, and more. Right-clicking also works on the Projects and Services tabs. The three dots option is still there as well, in case you’re more comfortable with that. Improved error handling We hope you never run into issues when using the Toolbox App, but if you do, we’re working on making error handling more user-friendly. In version 2.4, we’ve introduced an error screen containing a restart button, a link to log files, and a link to YouTrack where you can create an issue for our team to look into. When you create the issue, it’ll be pre-filled with the Toolbox App version, your OS, and the error stack trace. We always encourage you to describe your problem and attach log files, too. Option to quit on by right-clicking on macOS We’ve implemented a small yet useful update for our macOS users. You can now quit the Toolbox App by right-clicking the Toolbox App icon in the menu bar and choosing the Quit action. Gitee support in Chrome extension On top of Toolbox App 2.4, we’ve also updated the JetBrains Toolbox browser extension for Chrome and Firefox. The extension allows you to clone and open projects in your JetBrains IDEs right from the GitHub, GitLab, and Bitbucket project pages. We’ve added support for Gitee, a China-based hosting service. To clone a project and open it in your JetBrains IDE, make sure you have the browser extension installed. Then, go to the Gitee project page, and click on the Toolbox extension icon in the browser. The extension will give you a choice of JetBrains IDEs based on the languages specified in the project itself. Enterprise-focused updates Toolbox App 2.4 has a few improvements for enterprise users. We’ve introduced silent and headless installations of the Toolbox App, making it easier to manage the Toolbox App on user machines in bulk. You can now install and uninstall the Toolbox App on Windows using CLI commands. This option is not limited to IDE Services users – it’s available to anyone. The onboarding wizard for IDE Services received a few updates to enhance the user experience along with a few bug fixes for the Toolbox App. For more information on the changes in this version, head over to the full release notes. Yours, The Toolbox App team",
  "image": "https://blog.jetbrains.com/wp-content/uploads/2024/07/tb-social-social_share_blog_1280x720_en.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                        \u003ch2 id=\"major-updates\"\u003eToolbox App 2.4 Gets a Refreshed UI Theme, Right-Click Context Menu, and Other Updates\u003c/h2\u003e                    \u003cdiv\u003e\u003cp data-nosnippet=\"\"\u003eRead this post in other languages:\u003c/p\u003e\u003c/div\u003e\n                    \n\u003cp\u003eToolbox App 2.4 comes with a reworked UI theme, a new way to open the context menu for tools, and other updates.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you’re using Gitee, check out the JetBrains Toolbox browser extension update as well.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eNew UI theme\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eToolbox App 2.4 got a facelift! The navigation remains the same, but we’ve reworked the interface to look more modern and sleek. There’s also a new toggle called \u003cem\u003eUse background effects\u003c/em\u003e in \u003cem\u003eSettings\u003c/em\u003e that allows you to enable or disable the gradient. We hope you enjoy it!\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" fetchpriority=\"high\" width=\"4600\" height=\"3536\" src=\"https://blog.jetbrains.com/wp-content/uploads/2024/07/Section-1-1.png\" alt=\"\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eRight-click context menu\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe context menu for tools is now easier to reach – just right-click on the name of a tool in the list to access tool update settings, an overview of the new features in the installed version, links to log files, and more. Right-clicking also works on the \u003cem\u003eProjects\u003c/em\u003e and \u003cem\u003eServices\u003c/em\u003e tabs. The three dots option is still there as well, in case you’re more comfortable with that.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eImproved error handling\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eWe hope you never run into issues when using the Toolbox App, but if you do, we’re working on making error handling more user-friendly. In version 2.4, we’ve introduced an error screen containing a restart button, a link to log files, and a link to YouTrack where you can create an issue for our team to look into. When you create the issue, it’ll be pre-filled with the Toolbox App version, your OS, and the error stack trace. We always encourage you to describe your problem and attach log files, too.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eOption to quit on by right-clicking on macOS\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eWe’ve implemented a small yet useful update for our macOS users. You can now quit the Toolbox App by right-clicking the Toolbox App icon in the menu bar and choosing the \u003cem\u003eQuit\u003c/em\u003e action.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eGitee support in Chrome extension\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eOn top of Toolbox App 2.4, we’ve also updated the JetBrains Toolbox browser extension for \u003ca href=\"https://chromewebstore.google.com/detail/jetbrains-toolbox-extensi/offnedcbhjldheanlbojaefbfbllddna?hl=en\" target=\"_blank\" rel=\"noopener\"\u003eChrome\u003c/a\u003e and \u003ca href=\"https://addons.mozilla.org/en-US/firefox/addon/jetbrains-toolbox/\" target=\"_blank\" rel=\"noopener\"\u003eFirefox\u003c/a\u003e. The extension allows you to clone and open projects in your JetBrains IDEs right from the GitHub, GitLab, and Bitbucket project pages.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe’ve added support for Gitee, a China-based hosting service. To clone a project and open it in your JetBrains IDE, make sure you have the browser extension installed. Then, go to the Gitee project page, and click on the Toolbox extension icon in the browser. The extension will give you a choice of JetBrains IDEs based on the languages specified in the project itself.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eEnterprise-focused updates\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eToolbox App 2.4 has a few improvements for enterprise users.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe’ve introduced silent and headless installations of the Toolbox App, making it easier to manage the Toolbox App on user machines in bulk. You can now install and uninstall the Toolbox App on Windows using CLI commands. This option is not limited to IDE Services users – it’s available to anyone.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe onboarding wizard for IDE Services received a few updates to enhance the user experience along with a few bug fixes for the Toolbox App.\u003c/p\u003e\n\n\n    \n\n\n\n\n\n\n\n\u003cp\u003eFor more information on the changes in this version, head over to the full \u003ca href=\"https://youtrack.jetbrains.com/releaseNotes/TBX?q=Fix%20versions:%202.4%20%23Resolved%20-Duplicate%20-Answered\u0026amp;title=Toolbox%20App%202.4%20Release%20Notes\" target=\"_blank\" rel=\"noreferrer noopener\"\u003erelease notes\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eYours,\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Toolbox App team\u003c/p\u003e\n                    \n                                                                                                                                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
