{
  "id": "bde82211-0882-4697-a132-d9792581521c",
  "title": "The lesser known world of spans",
  "link": "https://saket.me/lesser-known-world-of-spans/",
  "description": "Do you know what’s common between the blinking cursor, hyperlinks and text highlighting in TextViews? They’re all implemented using spans. Spans are tiny objects that Android uses heavily across the framework. If you’ve worked with text styling such as bold or italics, then you’re already familiar with the basic usages of spans. But they are […] The post The lesser known world of spans appeared first on Saket Narayan.",
  "author": "Saket Narayan",
  "published": "Sun, 05 Nov 2017 14:52:27 +0000",
  "source": "https://saket.me/feed/",
  "categories": [
    "Public speaking"
  ],
  "byline": "Saket Narayan",
  "length": 770,
  "excerpt": "Do you know what’s common between the blinking cursor, hyperlinks and text highlighting in TextViews? They’re all implemented using spans. Spans are tiny objects that Android uses heavily across the framework.",
  "siteName": "Saket Narayan",
  "favicon": "",
  "text": "Do you know what’s common between the blinking cursor, hyperlinks and text highlighting in TextViews? They’re all implemented using spans. Spans are tiny objects that Android uses heavily across the framework. If you’ve worked with text styling such as bold or italics, then you’re already familiar with the basic usages of spans. But they are capable of much more than just modifying the visual representation of text like changing indentation, receiving URL clicks, listening to text changes, displaying spelling suggestions, images and much more. This talk does a deep dive into the various spans that Android offers out of the box as well as custom spans and how they can be used for displaying text in any way imaginable. The slides for this talk can be found here.",
  "image": "https://saket.me/wp-content/uploads/2018/09/san_francisco.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\t\t\t\u003cp\u003eDo you know what’s common between the blinking cursor, hyperlinks and text highlighting in TextViews? They’re all implemented using spans. Spans are tiny objects that Android uses heavily across the framework.\u003c/p\u003e\n\u003cp\u003eIf you’ve worked with text styling such as bold or italics, then you’re already familiar with the basic usages of spans. But they are capable of much more than just modifying the visual representation of text like changing indentation, receiving URL clicks, listening to text changes, displaying spelling suggestions, images and much more.\u003c/p\u003e\n\u003cp\u003eThis talk does a deep dive into the various spans that Android offers out of the box as well as custom spans and how they can be used for displaying text in any way imaginable.\u003c/p\u003e\n\u003cp\u003eThe slides for this talk can be \u003ca href=\"https://photos.app.goo.gl/NuAw1KDTb9S5iplm1\"\u003efound here\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003ciframe type=\"text/html\" width=\"880\" height=\"525\" src=\"https://www.youtube.com/embed/G55mJvel7iI?version=3\u0026amp;rel=1\u0026amp;fs=1\u0026amp;autohide=2\u0026amp;showsearch=0\u0026amp;showinfo=1\u0026amp;iv_load_policy=1\u0026amp;wmode=transparent\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e\u003c/span\u003e\u003c/p\u003e\n\n\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2017-11-05T14:52:27Z",
  "modifiedTime": "2018-09-12T13:17:59Z"
}
