{
  "id": "1458f66e-35ae-407f-99a2-15acfbd4da60",
  "title": "Archinectors Articulate: ChatGPT for architectural codes, When to hire more staff, Residential inquiries slowdown, OXMAN, AIA layoffs",
  "link": "https://archinect.com/news/article/150441947/archinectors-articulate-chatgpt-for-architectural-codes-when-to-hire-more-staff-residential-inquiries-slowdown-oxman-aia-layoffs",
  "description": "",
  "author": "Archinect",
  "published": "2024-10-08T19:59:00-04:00",
  "source": "https://archinect.com/feed/1/news",
  "categories": null,
  "byline": "",
  "length": 6712,
  "excerpt": "Happy beginning of fall, Archinectors! With October officially kicked off, the Fed cutting interest rates, and workload for the architecture industry expected to pick up again (fingers crossed), let's take a look at what the Archinect community is talking about at the moment. When to hire more...",
  "siteName": "Archinect",
  "favicon": "https://archinect.com/apple-touch-icon.png",
  "text": "Happy beginning of fall, Archinectors! With October officially kicked off, the Fed cutting interest rates, and workload for the architecture industry expected to pick up again (fingers crossed), let's take a look at what the Archinect community is talking about at the moment. When to hire more employees? Over in our Discussion Forum, readers engaged in this timely employment and professional practice thread, When to hire more employees. \"I am wondering if there is an industry metric or KPI that indicates when to hire more staff, backed by data?,\" user ellerystudio asked. I am wondering if there is an industry metric or KPI that indicates when to hire more staff, backed by data? — Discussion Forum question The discussion emphasizes that to grow revenue, businesses must invest in hiring and building capacity ahead of securing projects, with many participants sharing strategies for timing new hires to meet future demand. \"You can't grow revenue if you don't grow capacity first,\" one response from gwharton declared. \"This is a fundamental principle of business. So you need to figure out what your target revenue is 12 months out at least, and then hire enough people to do that work now.\" Another reader, Chad Miller, stated, \"In my opinion - If you're going to hire for a 'big project' you need to do so at least 6 months prior to the project starting. Preferably nine months. That will give you the minimal amount of time to train and integrate the new team member into your firm.\" \"We want to see enough available money in 12 consecutive months of our upcoming revenue forecasts to fund the monthly expense of the new person,\" a response from user reallynotmyname read. \"That means we can afford them now and have a multiple month runway to bring in a flow of subsequent work for them.\" ChatGPT for architectural codes? The potential benefits and pitfalls of using generative AI tools for code-related issues are the center of the discussion, Using chatgpt/ AI for code questions. \"Anyone have any success doing this or is this something chatgpt is not up to speed on?,\" user greenlander1 asked. \"I would think in theory it would be of some help but maybe Im just giving the wrong prompts.\" Anyone have any success doing this or is this something chatgpt is not up to speed on? — Discussion Forum question Most responses agree that using ChatGPT for this specific purpose was helpful for general direction but unreliable for specific, nuanced answers without verification. \"Why outsource one of our basic services to AI?,\" Non Sequitur replied. lacalr had this to share: \"I generally only use it to get a quick starting point or reference code section, then I go into the actual code and check/confirm what ChatGPT is telling me. I've noticed its about 50/50. I would still never take anything AI told me and base the designs off it before vetting.\" \"It may be an option in the future. In my opinion, it's still not accurate enough to do this,\" user OddArchitect noted, adding, \"If you want to see a real world example of where this has caused issues look at UpCodes. They use a narrow AI system and have been known to get some really inaccurate responses / cross references.\" Decline in residential inquiries? Business and economic trends are also being discussed in the new thread, Is anyone else noticing a drop in residential inquiries lately? \"Curious if this is a broader trend or something specific to my area,\" user therestwo added to their question. Is anyone else noticing a drop in residential inquiries lately? — Discussion Forum question The conversation highlights a slowdown in architectural projects among some readers, driven by factors like high interest rates and election uncertainty. While some sectors, like single-family homes, are seeing declines, others report growth in multi-family housing or smaller-scale projects. \"Maybe a slight slowdown in inquiries, or at least in quality if inquiries,\" answered Wood Guy. \"But I don't advertise and have a 12+ month backlog so I'm not nervous yet.\" \"things are up where I am — not sure how we’re going get it all done,\" was proto's chipper response. User whistler wasn't quite so upbeat: \"Definitely quieter... our local building department just released data indicating a 39% drop in revenue. Big shift from full build application to smaller renos and additions.\" \"Definitely slower where I am,\" said reallynotmyname. \"I attended a local town design review commission meeting and the staff remarked on the steep decline in permit applications they have seen in past 6 months or so. Interest rates and higher homeowner's insurance rates have really reduced the available money people used to have for home additions and remodels.\" They also identified a not-uncommon current sentiment in the AEC industry: \"There's also a (dumb in my opinion) all-around hesitation happening among the local builder and developer crowd about the presidential election.\" Archinect has been covering business, economic, and employment conditions for the architecture industry in-depth over the last few years. To get started, our new State of AEC series offers a compact, up-to-date monthly analysis of what architects and building professionals should pay attention to. More stories related to business in the Archinect News, like the Architecture Billings Index, Dodge Momentum Index, construction starts, or construction input prices, can be followed here. Oxman goes OXMAN A lively conversation is also happening here in the News section right now, with readers debating in the comments of our recent story about Neri Oxman's new design research practice (and NYC lab space designed in collaboration with Foster + Partners), aptly titled OXMAN. She's not a serious researcher anymore, ever since she left the Media Lab. — News article comment Commenters debate the depth of Oxman’s new venture, with some viewing it as an art-driven innovation in design, while others critique it as overly reliant on wealth and status without meaningful architectural substance. The tone is mixed, ranging from intrigue and admiration to skepticism and frustration over Oxman's influence and the role of privilege in her work's acclaim. What's your take? Take a look and join the discussion. AIA layoffs, what? Our story about the AIA reportedly laying off 16% of its national staff (h/t Architectural Record) also stoked an active discussion. Contributions highlight frustration over AIA leadership spending funds on luxuries while laying off staff, with members feeling that the organization's priorities are out of touch with the profession's realities. What have you been reading/debating/discovering on Archinect lately? Let us know in the comments!",
  "image": "https://archinect.gumlet.io/uploads/8d/8db6a0861cbad02d7c87a0b7ff441919.jpg?fit=crop\u0026auto=compress%2Cformat\u0026enlarge=true\u0026crop=faces\u0026w=1200\u0026h=707",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eHappy beginning of fall, Archinectors! With October officially kicked off, the \u003ca href=\"https://archinect.com/features/article/150449395/the-industry-reacts-to-interest-rate-cuts-archinect-s-state-of-aec-september-2024\" target=\"_blank\"\u003eFed cutting interest rates\u003c/a\u003e, and workload for the architecture industry expected to pick up again (fingers crossed), let\u0026#39;s take a look at what the Archinect community is talking about at the moment.\u003c/p\u003e\n\u003ch3\u003eWhen to hire more employees?\u003c/h3\u003e\n\u003cp\u003eOver in our \u003ca href=\"https://archinect.com/forum\" target=\"_blank\"\u003eDiscussion Forum\u003c/a\u003e, readers engaged in this timely employment and professional practice thread, \u003ca href=\"https://archinect.com/forum/thread/150444037/when-to-hire-more-employees\" target=\"_blank\"\u003e\u003cstrong\u003eWhen to hire more employees\u003c/strong\u003e\u003c/a\u003e. \u0026#34;I am wondering if there is an industry metric or KPI that indicates when to hire more staff, backed by data?,\u0026#34; user ellerystudio asked. \u003cbr/\u003e\u003c/p\u003e\n\u003cblockquote\u003eI am wondering if there is an industry metric or KPI that indicates when to hire more staff, backed by data? — Discussion Forum question\u003c/blockquote\u003e\n\u003cp\u003eThe discussion emphasizes that to grow revenue, businesses must invest in hiring and building capacity ahead of securing projects, with many participants sharing strategies for timing new hires to meet future demand.\u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;You can\u0026#39;t grow revenue if you don\u0026#39;t grow capacity first,\u0026#34; one response from gwharton declared. \u0026#34;This is a fundamental principle of business. So you need to figure out what your target revenue is 12 months out at least, and then hire enough people to do that work now.\u0026#34; \u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003eAnother reader, Chad Miller, stated, \u0026#34;In my opinion - If you\u0026#39;re going to hire for a \u0026#39;big project\u0026#39; you need to do so at least 6 months prior to the project starting. Preferably nine months. That will give you the minimal amount of time to train and integrate the new team member into your firm.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;We want to see enough available money in 12 consecutive months of our upcoming revenue forecasts to fund the monthly expense of the new person,\u0026#34; a response from user reallynotmyname read. \u0026#34;That means we can afford them now and have a multiple month runway to bring in a flow of subsequent work for them.\u0026#34;\u003c/p\u003e\n\u003ch3\u003eChatGPT for architectural codes?\u003c/h3\u003e\n\u003cp\u003eThe potential benefits and pitfalls of using generative AI tools for code-related issues are the center of the discussion, \u003cstrong\u003e\u003ca href=\"https://archinect.com/forum/thread/150446547/using-chatgpt-ai-for-code-questions\" target=\"_blank\"\u003eUsing chatgpt/ AI for code questions\u003c/a\u003e\u003c/strong\u003e. \u0026#34;Anyone have any success doing this or is this something chatgpt is not up to speed on?,\u0026#34; user greenlander1 asked. \u0026#34;I would think in theory it would be of some help but maybe Im just giving the wrong prompts.\u0026#34;\u003c/p\u003e\n\u003cblockquote\u003eAnyone have any success doing this or is this something chatgpt is not up to speed on? — Discussion Forum question\u003c/blockquote\u003e\n\u003cp\u003eMost responses agree that using ChatGPT for this specific purpose was helpful for general direction but unreliable for specific, nuanced answers without verification.\u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;Why outsource one of our basic services to AI?,\u0026#34; Non Sequitur replied.\u003c/p\u003e\n\u003cp\u003elacalr had this to share: \u0026#34;I generally only use it to get a quick starting point or reference code section, then I go into the actual code and check/confirm what ChatGPT is telling me. I\u0026#39;ve noticed its about 50/50. I would still never take anything AI told me and base the designs off it before vetting.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;It may be an option in the future. In my opinion, it\u0026#39;s still not accurate enough to do this,\u0026#34; user OddArchitect noted, adding, \u0026#34;If you want to see a real world example of where this has caused issues look at UpCodes. They use a narrow AI system and have been known to get some really inaccurate responses / cross references.\u0026#34;\u003c/p\u003e\n\u003ch3\u003eDecline in residential inquiries?\u003c/h3\u003e\n\u003cp\u003eBusiness and economic trends are also being discussed in the new thread, \u003cstrong\u003e\u003ca href=\"https://archinect.com/forum/thread/150449324/is-anyone-else-noticing-a-drop-in-residential-inquiries-lately\" target=\"_blank\"\u003eIs anyone else noticing a drop in residential inquiries lately?\u003c/a\u003e\u003c/strong\u003e \u0026#34;Curious if this is a broader trend or something specific to my area,\u0026#34; user therestwo added to their question.\u003c/p\u003e\n\u003cblockquote\u003eIs anyone else noticing a drop in residential inquiries lately? — Discussion Forum question\u003c/blockquote\u003e\n\u003cp\u003eThe conversation highlights a slowdown in architectural projects among some readers, driven by factors like high interest rates and election uncertainty. While some sectors, like single-family homes, are seeing declines, others report growth in multi-family housing or smaller-scale projects.\u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;Maybe a slight slowdown in inquiries, or at least in quality if inquiries,\u0026#34; answered Wood Guy. \u0026#34;But I don\u0026#39;t advertise and have a 12+ month backlog so I\u0026#39;m not nervous yet.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;things are up where I am — not sure how we’re going get it all done,\u0026#34; was proto\u0026#39;s chipper response.\u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003eUser whistler wasn\u0026#39;t quite so upbeat: \u0026#34;Definitely quieter... our local building department just released data indicating a 39% drop in revenue. Big shift from full build application to smaller renos and additions.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Definitely slower where I am,\u0026#34; said reallynotmyname. \u0026#34;I attended a local town design review commission meeting and the staff remarked on the steep decline in permit applications they have seen in past 6 months or so. Interest rates and higher homeowner\u0026#39;s insurance rates have really reduced the available money people used to have for home additions and remodels.\u0026#34; They also identified a not-uncommon current sentiment in the AEC industry: \u0026#34;There\u0026#39;s also a (dumb in my opinion) all-around hesitation happening among the local builder and developer crowd about the presidential election.\u0026#34;\u003c/p\u003e\n\u003cp\u003eArchinect has been covering business, economic, and employment conditions for the architecture industry in-depth over the last few years. To get started, our new \u003cem\u003e\u003ca href=\"https://archinect.com/features/tag/2534772/archinect-state-of-aec\" target=\"_blank\"\u003eState of AEC\u003c/a\u003e\u003c/em\u003e series offers a compact, up-to-date monthly analysis of what architects and building professionals should pay attention to. More stories related to business in the Archinect News, like the Architecture Billings Index, Dodge Momentum Index, construction starts, or construction input prices, can be followed \u003ca href=\"https://archinect.com/news/tag/8184/business\" target=\"_blank\"\u003ehere\u003c/a\u003e. \u003cbr/\u003e\u003c/p\u003e\n\u003ch3\u003eOxman goes OXMAN\u003c/h3\u003e\n\u003cp\u003eA lively conversation is also happening here in the News section right \u003cbr/\u003enow, with readers debating in the comments of our recent story about Neri Oxman\u0026#39;s \u003ca href=\"https://archinect.com/news/article/150448277/neri-oxman-announces-formation-of-oxman-research-practice-in-nyc\" target=\"_blank\"\u003enew design research practice\u003c/a\u003e (and NYC lab space designed in collaboration with Foster + Partners), aptly titled OXMAN. \u003cbr/\u003e\u003c/p\u003e\n\u003cblockquote\u003eShe\u0026#39;s not a serious researcher anymore, ever since she left the Media Lab. — News article comment\u003c/blockquote\u003e\n\u003cp\u003eCommenters debate the depth of Oxman’s new venture, with some viewing it as an art-driven innovation in design, while others critique it as overly reliant on wealth and status without meaningful architectural substance. The tone is mixed, ranging from intrigue and admiration to skepticism and frustration over Oxman\u0026#39;s influence and the role of privilege in her work\u0026#39;s acclaim.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s your take? Take a look and join the discussion.\u003cbr/\u003e\u003c/p\u003e\n\u003ch3\u003eAIA layoffs, what?\u003c/h3\u003e\n\u003cp\u003eOur story about the \u003ca href=\"https://archinect.com/news/article/150447431/aia-lays-off-16-of-workforce\" target=\"_blank\"\u003eAIA reportedly laying off 16% of its national staff\u003c/a\u003e (h/t \u003cem\u003eArchitectural Record\u003c/em\u003e) also stoked an active discussion. Contributions highlight frustration over AIA leadership spending funds on luxuries while laying off staff, with members feeling that the organization\u0026#39;s priorities are out of touch with the profession\u0026#39;s realities. \u003cbr/\u003e\u003c/p\u003e\n\u003cp\u003eWhat have you been reading/debating/discovering on Archinect lately? Let us know in the comments!\u003cbr/\u003e\u003c/p\u003e\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
