{
  "id": "175a6478-b250-458c-bb98-f2791868d23b",
  "title": "This Home in Spain Is a Contemporary Mountain Cabin Hybrid",
  "link": "https://www.architecturaldigest.com/story/this-home-in-spain-is-a-contemporary-mountain-cabin-hybrid",
  "description": "BeAr Studio used a limited budget and an unusual site to create an inviting contemplative retreat",
  "author": "María Noval-Quílez",
  "published": "Sun, 30 Mar 2025 12:00:00 +0000",
  "source": "https://www.architecturaldigest.com/feed/rss",
  "categories": [
    "Architecture + Design",
    "Home Tour"
  ],
  "byline": "María Noval-Quílez, Luis Díaz Díaz",
  "length": 5998,
  "excerpt": "BeAr Studio used a limited budget and an unusual site to create an inviting contemplative retreat",
  "siteName": "Architectural Digest",
  "favicon": "",
  "text": "All products featured on Architectural Digest are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“We don’t like homes where you have to ask for permission to sit down. We don’t even like houses where you have to put on a robe. You should be free to wander about in your slippers,” says Íñigo Berasategui, half of the architecture studio BeAr (along with Ana Arce). He makes it clear that this duo has its own unique style. Their latest project, in a residential area about 20 miles from Bilbao, is a unique combination: a mountain cabin within the exterior of a contemporary modernist house.If one thing defines the work of BeAr, it’s the playful atmosphere that characterizes many of their designs. That doesn’t happen by chance. “It is a recurring focus of ours. We try to ensure that every project has a fun aspect to it. Everything is very well thought out and planned, including the lighter side,” the architects explain. The spacious home encourages us to reconsider how we define luxury with its 16-foot ceilings and an abundance of natural light Its owner is a veterinarian who is set to retire soon. For him, the most important part of the project was having a garden and a small pond. “He told us he was tired of taking care of animals, that now he wanted a space where he could simply go and enjoy observing them from his home,” explains Berasategui.The first challenge was the site: long but narrow and with a steep slope. “If we built a traditional home, there wouldn’t be any space left for a garden so we proposed a design where the house floats above it. And the owner liked it,” Berasategui says.To make room for a garden on the narrow, uneven plot, the house was built atop a large structure and it appears almost as if it’s levitating. The project had a limited budget and a rather complex structure that tested the creativity of the architects. “To save on the costs of the foundation, we located the supports of the house where the bedrock was highest,” BeAr explains. The finishes had to be inexpensive while the house has a plain exterior. “For us it was important that this felt like an ‘honest’ house, that it isn’t pretending to be something that it isn’t. The wood elements were very important and we selected the materials and the different pieces after a lot of thought. For example, it was important to us to use rough sawn wood on the porches instead of laminated wood,” Berasategui says.The concrete bases of the structure were located at the points where the bedrock is highest, reducing the cost of building the house’s foundations. The interior of the house has an atmosphere like that of a log cabin where wood is the main element and everything is reduced to the bare essentials. While it appears simple, every aspect of the house was very much calculated and designed. However, when you explore the house, it in no way feels like corners have been cut. “The real luxury of this house is space. It has ceiling heights of almost 16 feet and a lot of natural light coming in from the west and from above. That’s something that’s hard to find in the city,” he adds.The long house is laid out almost like a large fluid space with all the different areas connected to each other except for the bedroom and part of the bathroom. The owner, who likes to entertain, wanted a large kitchen and a big sink, which the studio created with quarried stone. “He doesn’t have a dishwasher because he finds the routine of washing up relaxing,” explains Berasategui. The kitchen, on the west side, was created with different modules of water-resistant MDF, an inexpensive but very moisture-resistant material.The kitchen units, divided into different modules and interspersed with the house’s windows, are covered with water-repellent MDF in an olive green. It’s an inexpensive material that is still very resistant to moisture. To hide the kitchen island’s extraction fan, BeAr designed a ladder-shaped shelf which also functions as a spice rack. “We gave the kitchen island a more playful design, a kidney-bean shape. As the extractor had to be under it, we created a kind of red stepladder to hide it and which can double as a spice rack,” he says.Some designer pieces that the owner already had, such as a Japanese futon, a Jean Prouvé table, some Noguchi lamps, and others by Jacobsen for Flos, were added to the space. And to create a guest room when needed, a system of curtain rails was installed around a daybed. It can then be enclosed behind a wall of opaque curtains in a warm red.An elegant ode to functionality, the studio installed a curtain rail around a daybed, allowing the space to be turned into an impromptu extra guest room. Et voilà! The space with the red curtains drawn. “As the project doesn’t have a lot of color beyond that of the wood, we wanted to add some so it would feel a little bit less like a bare cabin,” the architects from BeAr explain. “We tried many pigments and many different shades of green and red. We tried to look at vernacular architecture here, and in the South of France too, in a different way, without being too literal. We wanted to use colors that the people of the neighborhood would recognize as their own.” In the end, a combination of an almost wine-red, a soft gray green, and the tone of concrete and galvanized sheet metal are the major colors in the house’s palette. It’s a modern but friendly ensemble that help to create an inviting home.The project’s name, by the way, was Nahinuena, which in Basque means “the desired one.” And, yes, she is.This country house originally appeared in AD Spain. It was translated by John Newton.The bath is located in an alcove between the common area and the principal bedroom. Despite its contemporary nature, the house blends in perfectly with the neighboring houses in the relatively rural area, thanks to that interplay of greens and reds that evokes the architecture of the South of France.",
  "image": "https://media.architecturaldigest.com/photos/67e2cde95b821f7ea2d28f99/16:9/w_1280,c_limit/Gorliz_by_BEAR_photo_luis_diaz_diaz_10.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e All products featured on Architectural Digest are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“We don’t like homes where you have to ask for permission to sit down. We don’t even like houses where you have to put on a robe. You should be free to wander about in your slippers,” says Íñigo Berasategui, half of the architecture studio BeAr (along with Ana Arce). He makes it clear that this duo has its own unique style. Their latest project, in a residential area about 20 miles from \u003ca href=\"https://www.architecturaldigest.com/story/bilbao-spain-design-travel-guide\" target=\"_blank\"\u003eBilbao\u003c/a\u003e, is a unique combination: a mountain cabin within the exterior of a contemporary modernist house.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIf one thing defines the work of \u003ca href=\"https://bear-rabe.com/\" target=\"_blank\"\u003eBeAr,\u003c/a\u003e it’s the playful atmosphere that characterizes many of their designs. That doesn’t happen by chance. “It is a recurring focus of ours. We try to ensure that every project has a fun aspect to it. Everything is very well thought out and planned, including the lighter side,” the architects explain.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe spacious home encourages us to reconsider how we define luxury with its 16-foot ceilings and an abundance of natural light\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eIts owner is a veterinarian who is set to retire soon. For him, the most important part of the project was having a garden and a small pond. “He told us he was tired of taking care of animals, that now he wanted a space where he could simply go and enjoy observing them from his home,” explains Berasategui.\u003c/p\u003e\u003cp\u003eThe first challenge was the site: long but narrow and with a steep slope. “If we built a traditional home, there wouldn’t be any space left for a garden so we proposed a design where the house floats above it. And the owner liked it,” Berasategui says.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTo make room for a garden on the narrow, uneven plot, the house was built atop a large structure and it appears almost as if it’s levitating.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eThe project had a limited budget and a rather complex structure that tested the creativity of the architects. “To save on the costs of the foundation, we located the supports of the house where the bedrock was highest,” \u003ca data-offer-url=\"https://bear-rabe.com/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://bear-rabe.com/\u0026#34;}\" href=\"https://bear-rabe.com/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eBeAr\u003c/a\u003e explains. The finishes had to be inexpensive while the house has a plain exterior. “For us it was important that this felt like an ‘honest’ house, that it isn’t pretending to be something that it isn’t. The wood elements were very important and we selected the materials and the different pieces after a lot of thought. For example, it was important to us to use rough sawn wood on the porches instead of laminated wood,” Berasategui says.\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe concrete bases of the structure were located at the points where the bedrock is highest, reducing the cost of building the house’s foundations.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe interior of the house has an atmosphere like that of a log cabin where wood is the main element and everything is reduced to the bare essentials. While it appears simple, every aspect of the house was very much calculated and designed.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eHowever, when you explore the house, it in no way feels like corners have been cut. “The real luxury of this house is space. It has ceiling heights of almost 16 feet and a lot of natural light coming in from the west and from above. That’s something that’s hard to find in the city,” he adds.\u003c/p\u003e\u003cp\u003eThe long house is laid out almost like a large fluid space with all the different areas connected to each other except for the bedroom and part of the bathroom. The owner, who likes to entertain, wanted a large kitchen and a big sink, which the studio created with quarried stone. “He doesn’t have a dishwasher because he finds the routine of washing up relaxing,” explains Berasategui. The kitchen, on the west side, was created with different modules of water-resistant MDF, an inexpensive but very moisture-resistant material.\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe kitchen units, divided into different modules and interspersed with the house’s windows, are covered with water-repellent MDF in an olive green. It’s an inexpensive material that is still very resistant to moisture.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTo hide the kitchen island’s extraction fan, BeAr designed a ladder-shaped shelf which also functions as a spice rack.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e“We gave the kitchen island a more playful design, a kidney-bean shape. As the extractor had to be under it, we created a kind of red stepladder to hide it and which can double as a spice rack,” he says.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSome designer pieces that the owner already had, such as a Japanese futon, a \u003ca data-offer-url=\"https://www.1stdibs.com/creators/jean-prouve/furniture/tables/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://cna.st/affiliate-link/4Q5NDE1dgN4W3hxAoR1NKG8Xpw9ePtQvPQCvQTAvL7uUaE12aKi4XFi3EYjUJ7sbqSkHyqmLThPyXifFXGZFTeuJ2D7T1jtzZzdA7gkCE42tgTXcyTg3t1hhKfMTe3Z4fNuVk9mpWu7Bwt5WC7XL49v7tMp36CjYxkyMaCh6Pkf\u0026#34;}\" href=\"https://cna.st/affiliate-link/4Q5NDE1dgN4W3hxAoR1NKG8Xpw9ePtQvPQCvQTAvL7uUaE12aKi4XFi3EYjUJ7sbqSkHyqmLThPyXifFXGZFTeuJ2D7T1jtzZzdA7gkCE42tgTXcyTg3t1hhKfMTe3Z4fNuVk9mpWu7Bwt5WC7XL49v7tMp36CjYxkyMaCh6Pkf\" rel=\"sponsored\" target=\"_blank\"\u003eJean Prouvé table\u003c/a\u003e, some \u003ca data-offer-url=\"https://shop.noguchi.org/collections/akari-light-sculptures\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://cna.st/affiliate-link/3Hvxm9czoAnBvzX1ZamMbDeEcS4nQbPVRqanshHjWERwmxM2T8KXu2pFa961aiBTBvQDREohWWJ1MR5xpB62YdMvgo2PtueZT5Y4Puk9qY99BfLCtw1dsdQ4JSdBqPxZHqi2WKRj2hXkkjm7vSUxmq97qXoDouTG5sv6SY3\u0026#34;}\" href=\"https://cna.st/affiliate-link/3Hvxm9czoAnBvzX1ZamMbDeEcS4nQbPVRqanshHjWERwmxM2T8KXu2pFa961aiBTBvQDREohWWJ1MR5xpB62YdMvgo2PtueZT5Y4Puk9qY99BfLCtw1dsdQ4JSdBqPxZHqi2WKRj2hXkkjm7vSUxmq97qXoDouTG5sv6SY3\" rel=\"sponsored\" target=\"_blank\"\u003eNoguchi lamps\u003c/a\u003e, and others by Jacobsen for Flos, were added to the space. And to create a guest room when needed, a system of curtain rails was installed around a daybed. It can then be enclosed behind a wall of opaque curtains in a warm red.\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAn elegant ode to functionality, the studio installed a curtain rail around a daybed, allowing the space to be turned into an impromptu extra guest room.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eEt voilà! The space with the red curtains drawn.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e“As the project doesn’t have a lot of color beyond that of the wood, we wanted to add some so it would feel a little bit less like a bare cabin,” the architects from BeAr explain. “We tried many pigments and many different shades of green and red. We tried to look at vernacular architecture here, and in the South of France too, in a different way, without being too literal. We wanted to use colors that the people of the neighborhood would recognize as their own.” In the end, a combination of an almost wine-red, a soft gray green, and the tone of concrete and galvanized sheet metal are the major colors in the house’s palette. It’s a modern but friendly ensemble that help to create an inviting home.\u003c/p\u003e\u003cp\u003eThe project’s name, by the way, was Nahinuena, which in Basque means “the desired one.” And, yes, she is.\u003c/p\u003e\u003cp\u003e\u003cem\u003eThis country house originally appeared in\u003c/em\u003e AD Spain. \u003cem\u003eIt was translated by John Newton.\u003c/em\u003e\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe bath is located in an alcove between the common area and the principal bedroom.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eDespite its contemporary nature, the house blends in perfectly with the neighboring houses in the relatively rural area, thanks to that interplay of greens and reds that evokes the architecture of the South of France.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-30T08:00:00-04:00",
  "modifiedTime": "2025-03-30T12:00:00Z"
}
