{
  "id": "196c0404-c5d9-4e12-ad66-ac6c4150a2ff",
  "title": "Narwal Freo Z10 Robot Vacuum Review (2025)",
  "link": "https://www.architecturaldigest.com/story/narwal-freo-z10-robot-vacuum-review",
  "description": "This high-end robot vacuum is a whiz at crossing all sorts of thresholds in my two-story historical home",
  "author": "Yelena Moroz Alpert",
  "published": "Mon, 19 May 2025 21:23:05 +0000",
  "source": "https://www.architecturaldigest.com/feed/rss",
  "categories": [
    "Shopping",
    "I Tried It"
  ],
  "byline": "Yelena Moroz Alpert",
  "length": 8919,
  "excerpt": "The high-end Narwal Freo Z10 is the best robot vacuum for gently tackling hard floors and rugs. Read this review on how it cleaned a two-story historical home",
  "siteName": "Architectural Digest",
  "favicon": "",
  "text": "All products featured on Architectural Digest are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.I have a confession to make: I hate mopping floors. So when I heard that the Narwal Freo Z10 robovac has a self-cleaning mop feature, I jumped at the chance to test it out. Currently, my cleaning arsenal includes a wet-dry vacuum cleaner, an upright vacuum for carpet and area rugs, and a seven-year-old basic robot vacuum—still, my floors could use more love.Narwal Freo Z10 Robot Vacuum and MopTo be honest, I just don’t have time to keep up with the hardwood floor cleaning in my two-level house. On the first floor, my kids are constantly tracking in dirt from soccer practice, and the second floor is now a residence for dust bunnies. I needed something that could vacuum up crumbs, dust, and pet hair with anti-tangle technology, and then polish it off with a cleaning solution to remove any streakiness. Then there is the carpet in my family room, and several area rugs as accent pieces that always need to be cleaned. Most of the time I just run the old robot vacuum but it’s really shoddy and constantly getting tangled in cat toys, cords, and all sorts of randomness. Half the time I find it stuck or the dust compartment is so full it’s not really picking anything up. I think one of the brushes is done for. Emptying the dust compartment is fine, but I usually end up spilling some debris. And you definitely don’t want to see the roller brush, which usually includes a monstrous mess of hair tangles. It typically needs snips from scissors for detangling.On the other hand, the Freo Z10 has a DualFlow Tangle-Free System which works by implementing the side brushes to scoot the hair to the roller brush section, which is then sucked into the dust bin. Its bragging rights are that the Freo Z10 has 15,000 Pa hyper suction. (Pa stands for Pascal, a measurement of pressure. When it comes to vacuums, the higher the better. A standard robot vac has 2,500 to 6,000 Pa.) The two mop pads, which are removable, oscillate and actually reach out beyond the circular form of the robot vacuum. The smart robot also senses when the mop is getting dingy and goes back to the station to clean it. It can sense if the floor is still dirty and goes back for a second pass until whatever is stuck to it is no longer there. The very best part is that I don’t have to get my hands dirty cleaning the vacuum itself. It goes back to the station, which takes care of everything. In fact, the mop pads are air drying as I type this and all I hear is the sweet hum of a clean house.The setupPhoto: Yelena Mroz AlpertPhoto: Yelena Mroz AlpertThe Freo Z10 shipped quickly and arrived at my doorstep in a medium-size box. It was a bit heavy, but not so heavy that I couldn’t maneuver it in place. Plus, there are two side handles to help with lifting.I decided to set up the station centrally on the first floor in what we call the piano room (because all it has is a piano, a chair and a rug, but officially it is a dining room). The robot vacuum came with a user manual that outlined the setup instructions. My favorite part is that the front panel is magnetic and comes away easily and there is a special ramp for the robot to enter the station. No aimless bumping here.Once this was set up, I hit the triangle button, assuming that it would start cleaning. In fact, it was mapping the first floor, which I didn’t pick up as well as I should have, so then I had to keep picking up the Freo and it might have messed up the mapping, so I just had to remap it again once I downloaded the Freo Mind app.The map editing feature is very specific, you can merge rooms, add furniture management and carpet, and create no-go zones. You can also identify the floor material by room, which is very specific and includes the following: hardwood, tile, tatami, marble, and cobblestone. Freo Mind will adjust the humidity level and suction power to each material, which makes sense because clearly marble is not the same as hardwood floors. My kitchen has laminate floors, which is not one of the features so I have it run on hardwood floors throughout. The carpet is also clearly marked on the maps.The SpecsWhile the physical setup was pretty intuitive, the app navigation was much more challenging. I really wish Narwal included a special app booklet outlining all the features, because there are a lot and I had to learn trial by error.When I added a second map for the second floor, it took me a minute to figure out how to select the area that will be cleaned. I assumed it would be the entire space that was mapped, but for some reason it was a small square that needed to be stretched out across the entire space. Still, this is a good feature because it lets me select zones, say clean my bedroom but not my son’s room if he has Legos on the floor.Photo: Yelena Mroz AlpertPhoto: Yelena Mroz AlpertBefore each cleaning, I could choose the type of vacuuming/mopping features. There is “vacuum and mop,” “vacuum then mop,” “vacuum,” and “mop.” Since the robot vacuum uses Freo Mind, a feature that uses AI technology to go back to areas with remaining dirt, the mopping requires the machine to return to the station to clean the pads. Because the base station is on the first floor, that’s not possible, so I have only used the vacuum feature upstairs.The mop combo feature is great thanks to the drying capabilities. I have definitely left my wet-dry vac with a wet roller inside the cleaning closet to find it smelling musty and icky days later. Instead of standard mop washing and drying by hand, the app tells me the mop drying progress, which is a bit long, but it is quiet and does not interfere with my daily life so I don’t even think about it. The Manage Accessories feature tells me how many hours I have until brushes and mops need replacement. (You can buy the accessories pack on Amazon for a reasonable $30 for a 15-piece set that includes a roller, mop pads and HEPA filters. Additional dust bags and disinfection detergent are also sold separately.) My first reaction was that having to buy replacement pieces is annoying, but I bet if my basic robot vac had these, it would run better, and that’s just part of the functionality.Once the Freo Z10 is running, I can see its movement in real time and you can tell how it is thinking, going around the room to identify the debris and then returning to get the dirt in a linear fashion.The verdictIt took two hours and 43 minutes to clean the first floor (914 square feet) with the “vacuum then mop” feature. I blissfully ignored the ultra robot vacuum while working and ran to the grocery store as it was scooting around my kitchen, moving the mop pads under the fridge and the kitchen cabinet toe kick. The robot vac alerted me when I needed to refill the water, and once I did, it resumed cleaning. My floors are nice and shiny and I was impressed in the obstacle avoidance to see that it maneuvered around the dining room chairs instead of just jamming into the legs. I also liked that it was able to climb over different threshold levels, specifically the high one between the original hardwood floors of the house and the transition into the laminate floor of the kitchen. (I had my doubts, but Freo Z10 proved to be the little robot that could!)Overall, my house is nice and clean, especially around the baseboard and perimeter, which always shows a dust trail on my dark floor. The Freo lifted the dust by the chalkboard and at the foot of the stairs, a spot that is often ignored.I do think it is still learning the landscape because every once in a while I will see an errant piece of lint or whatever else my kids track in, but since I don’t have to do anything but push buttons on my phone, I don’t mind too much. Once I figured out the app features, the hardest thing about the whole experience is refilling the water tank and dumping the dirty water out.Yes, at over $1,000, the Freo Z10 is expensive, but other high-tech and high-end all-in-one mop and vacuum models fall in this price range, so it is not a price anomaly for this type of machine. At 55dB, it is one of the quietest models and does not interfere with my work. Plus, I can schedule cleaning when I am out.The only thing that I am not thrilled about is that it only comes in white, which actually looks very sleek, but it just stands out against my blue wall. But that’s on me—I probably shouldn’t keep it in my music room anyway. I think in a spot under the windowsill in my kitchen it will blend it much better. All in all, I would recommend the Narwal Freo Z10 robot vacuum—especially to anyone who wants the qualities of a smart home without the fuss. In fact, my mom is visiting and was so impressed by this little machine that she is looking into getting one to keep her floors spotless too.",
  "image": "https://media.architecturaldigest.com/photos/682b62ed4ba116474d2688f7/16:9/w_1280,c_limit/narwhal-vacuum.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eAll products featured on Architectural Digest are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eI have a confession to make: I hate mopping floors. So when I heard that the \u003ca data-offer-url=\"https://www.amazon.com/NARWAL-Suction-Self-Emptying-Obstacle-Avoidance/dp/B0DS3ZYK3G\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://cna.st/affiliate-link/5562jUBkjoEKArs1QqsT5mzjb5YS6Yk6hQChb3FpQj2ejXZCFwFmuh3wjLUw4Zxyru1WNq1cdjgbtstKsZHdojUhobqHaY3dqNFPxjJNaWqsdrmbVWuMfsdgLJp89tht43d5n4H22xFZV5kHBD8BiqnGoZBxHZuRewy37aEy23WUKkBb7V1rCyknfHTSumfG4DUdK7PTP\u0026#34;}\" href=\"https://cna.st/affiliate-link/5562jUBkjoEKArs1QqsT5mzjb5YS6Yk6hQChb3FpQj2ejXZCFwFmuh3wjLUw4Zxyru1WNq1cdjgbtstKsZHdojUhobqHaY3dqNFPxjJNaWqsdrmbVWuMfsdgLJp89tht43d5n4H22xFZV5kHBD8BiqnGoZBxHZuRewy37aEy23WUKkBb7V1rCyknfHTSumfG4DUdK7PTP\" rel=\"sponsored\" target=\"_blank\"\u003eNarwal Freo Z10\u003c/a\u003e robovac has a self-cleaning mop feature, I jumped at the chance to test it out. Currently, my cleaning arsenal includes a \u003ca href=\"https://www.architecturaldigest.com/story/best-wet-dry-vacuums\" target=\"_blank\"\u003ewet-dry vacuum\u003c/a\u003e cleaner, an upright vacuum for carpet and \u003ca href=\"https://www.architecturaldigest.com/story/best-area-rugs\" target=\"_blank\"\u003earea rugs\u003c/a\u003e, and a seven-year-old basic \u003ca href=\"https://www.architecturaldigest.com/story/best-robot-vacuum\" target=\"_blank\"\u003erobot vacuum\u003c/a\u003e—still, my floors could use more love.\u003c/p\u003e\u003cdiv type=\"embed\" data-item=\"{\u0026#34;ctaHref\u0026#34;:\u0026#34;https://cna.st/p/2dznjpHfDESnL3MbMeUu2WmUMCxXoX2jsEa4wHKVxujXoHthVLV7yzQ4zLVN924fYMofTH6mPWtxkH84RHb8bkdPauseskJwFAWo5zFS8PzXxSJGWhWReV2TSXZwU4bpqzadSg55imPdv2eFPmq7GnsQqcGa4q2Yw4Gy4deDYUZGLxkieqyZJCFCdujJ4XtdABHbtKtfCYx2cR2qHRoMupedMZPFrYA8sDGWZvhjUS\u0026#34;,\u0026#34;dangerousDek\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;productBrand\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;dangerousHed\u0026#34;:\u0026#34;Narwal Freo Z10 Robot Vacuum and Mop\u0026#34;,\u0026#34;embedSize\u0026#34;:null,\u0026#34;isFirstProduct\u0026#34;:true,\u0026#34;isSponsored\u0026#34;:false,\u0026#34;offerRetailer\u0026#34;:\u0026#34;Amazon\u0026#34;,\u0026#34;offerUrl\u0026#34;:\u0026#34;https://www.amazon.com/dp/B0DS3ZYK3G?\u0026#34;,\u0026#34;contentType\u0026#34;:\u0026#34;product\u0026#34;,\u0026#34;productId\u0026#34;:\u0026#34;682b5c6f46d9175fbf5e33ac\u0026#34;,\u0026#34;showOfferUrl\u0026#34;:false,\u0026#34;showPriceOnButton\u0026#34;:true,\u0026#34;showAffiliateDisclaimerOnFirstProduct\u0026#34;:false,\u0026#34;dangerousCredit\u0026#34;:null,\u0026#34;showLocalisedOffers\u0026#34;:true,\u0026#34;isUpcEnabled\u0026#34;:true,\u0026#34;showClampedProductDescription\u0026#34;:false,\u0026#34;productDescriptionLineLength\u0026#34;:5,\u0026#34;hasReadMoreFeature\u0026#34;:false,\u0026#34;index\u0026#34;:0,\u0026#34;hasAffiliateLinkDisabled\u0026#34;:false,\u0026#34;isMobileView\u0026#34;:false,\u0026#34;hasMultipleImageSupport\u0026#34;:true,\u0026#34;showImageCreditText\u0026#34;:true,\u0026#34;showMultipleImageCount\u0026#34;:4,\u0026#34;hasProsConsFeature\u0026#34;:false,\u0026#34;hasRatingFeature\u0026#34;:false,\u0026#34;pros\u0026#34;:[],\u0026#34;cons\u0026#34;:[],\u0026#34;rating\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;isPrimeExclusive\u0026#34;:false,\u0026#34;shouldUseAmazonPrimeDayLiveAPIData\u0026#34;:true,\u0026#34;id\u0026#34;:\u0026#34;682b5c6f46d9175fbf5e33ac\u0026#34;,\u0026#34;brand\u0026#34;:{\u0026#34;name\u0026#34;:\u0026#34;\u0026#34;},\u0026#34;offers\u0026#34;:[{\u0026#34;offerUrl\u0026#34;:\u0026#34;https://www.amazon.com/dp/B0DS3ZYK3G?\u0026#34;,\u0026#34;price\u0026#34;:\u0026#34;$1,100\u0026#34;,\u0026#34;currency\u0026#34;:\u0026#34;USD\u0026#34;,\u0026#34;purchaseUri\u0026#34;:\u0026#34;https://cna.st/p/2dznjpHfDESnL3MbMeUu2WmUMCxXoX2jsEa4wHKVxujXoHthVLV7yzQ4zLVN924fYMofTH6mPWtxkH84RHb8bkdPauseskJwFAWo5zFS8PzXxSJGWhWReV2TSXZwU4bpqzadSg55imPdv2eFPmq7GnsQqcGa4q2Yw4Gy4deDYUZGLxkieqyZJCFCdujJ4XtdABHbtKtfCYx2cR2qHRoMupedMZPFrYA8sDGWZvhjUS\u0026#34;,\u0026#34;sellerName\u0026#34;:\u0026#34;Amazon\u0026#34;,\u0026#34;countryCode\u0026#34;:\u0026#34;US\u0026#34;,\u0026#34;reducedPrice\u0026#34;:\u0026#34;\u0026#34;},{\u0026#34;offerUrl\u0026#34;:\u0026#34;https://us.narwal.com/products/narwal-freo-z10-robot-vacuum-mop\u0026#34;,\u0026#34;price\u0026#34;:\u0026#34;$1,100\u0026#34;,\u0026#34;currency\u0026#34;:\u0026#34;USD\u0026#34;,\u0026#34;purchaseUri\u0026#34;:\u0026#34;https://cna.st/p/Dqg6mLFMxVSCS5tjCZzehCfeaN1CbbYg8K5MgR5S3ecwPiZgB6mPYNQyu2gaDdKd34xFxUzVKaWUgUSAMNDodRvzm2jiabQS841dS8Cbf8XQxDCDQ3YArALAxfrko5k51BcLsGWPG4zbxgYHwfGgQGHrbhqAghViqBEH6EFzEy5PT32ZsfeN9rFXjMbtomfhAik269SXjA8s87GJgcPBohqSCT5x9sGJmnWrHTieTzMFffmurc2YAiuxbrnzXyr4PiwsnefLZJ6Px\u0026#34;,\u0026#34;sellerName\u0026#34;:\u0026#34;Narwal\u0026#34;,\u0026#34;countryCode\u0026#34;:\u0026#34;US\u0026#34;,\u0026#34;reducedPrice\u0026#34;:\u0026#34;\u0026#34;}],\u0026#34;component\u0026#34;:\u0026#34;enhanced_product_card\u0026#34;,\u0026#34;total_index\u0026#34;:3,\u0026#34;hasMultipleImage\u0026#34;:true,\u0026#34;componentType\u0026#34;:true,\u0026#34;showProsConsData\u0026#34;:false,\u0026#34;showBadge\u0026#34;:false,\u0026#34;videoIds\u0026#34;:[]}\"\u003e\u003cp\u003e\u003ch3 id=\"upc_682b5c6f46d9175fbf5e33ac\" type=\"embed\"\u003eNarwal Freo Z10 Robot Vacuum and Mop\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eTo be honest, I just don’t have time to keep up with the \u003ca href=\"https://www.architecturaldigest.com/story/vacuums-for-hardwood-floors\" target=\"_blank\"\u003ehardwood floor cleaning\u003c/a\u003e in my two-level house. On the first floor, my kids are constantly tracking in dirt from soccer practice, and the second floor is now a residence for dust bunnies. I needed something that could vacuum up crumbs, dust, and pet hair with anti-tangle technology, and then polish it off with a cleaning solution to remove any streakiness. Then there is the carpet in my family room, and several area rugs as accent pieces that always need to be cleaned. Most of the time I just run the old robot vacuum but it’s really shoddy and constantly getting tangled in cat toys, \u003ca href=\"https://www.architecturaldigest.com/gallery/extension-cords-power-strips-shopping-guide\" target=\"_blank\"\u003ecords\u003c/a\u003e, and all sorts of randomness. Half the time I find it stuck or the dust compartment is so full it’s not really picking anything up. I think one of the brushes is done for. Emptying the dust compartment is fine, but I usually end up spilling some debris. And you definitely don’t want to see the roller brush, which usually includes a monstrous mess of hair tangles. It typically needs snips from scissors for detangling.\u003c/p\u003e\u003cp\u003eOn the other hand, the Freo Z10 has a DualFlow Tangle-Free System which works by implementing the side brushes to scoot the hair to the roller brush section, which is then sucked into the dust bin. Its bragging rights are that the Freo Z10 has 15,000 Pa hyper suction. (Pa stands for Pascal, a measurement of pressure. When it comes to \u003ca href=\"https://www.architecturaldigest.com/story/best-vacuums-on-amazon\" target=\"_blank\"\u003evacuums\u003c/a\u003e, the higher the better. A standard robot vac has 2,500 to 6,000 Pa.) The two mop pads, which are removable, oscillate and actually reach out beyond the circular form of the robot vacuum. The smart robot also senses when the mop is getting dingy and goes back to the station to clean it. It can sense if the floor is still dirty and goes back for a second pass until whatever is stuck to it is no longer there. The very best part is that I don’t have to get my hands dirty cleaning the vacuum itself. It goes back to the station, which takes care of everything. In fact, the mop pads are air drying as I type this and all I hear is the sweet hum of a clean house.\u003c/p\u003e\u003ch2\u003eThe setup\u003c/h2\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003ePhoto: Yelena Mroz Alpert\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003ePhoto: Yelena Mroz Alpert\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eThe Freo Z10 shipped quickly and arrived at my doorstep in a medium-size box. It was a bit heavy, but not so heavy that I couldn’t maneuver it in place. Plus, there are two side handles to help with lifting.\u003c/p\u003e\u003cp\u003eI decided to set up the station centrally on the first floor in what we call the piano room (because all it has is a piano, a chair and a rug, but officially it is a dining room). The robot vacuum came with a user manual that outlined the setup instructions. My favorite part is that the front panel is magnetic and comes away easily and there is a special ramp for the robot to enter the station. No aimless bumping here.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOnce this was set up, I hit the triangle button, assuming that it would start cleaning. In fact, it was mapping the first floor, which I didn’t pick up as well as I should have, so then I had to keep picking up the Freo and it might have messed up the mapping, so I just had to remap it again once I downloaded the Freo Mind app.\u003c/p\u003e\u003cp\u003eThe map editing feature is very specific, you can merge rooms, add furniture management and carpet, and create no-go zones. You can also identify the floor material by room, which is very specific and includes the following: hardwood, tile, tatami, marble, and cobblestone. Freo Mind will adjust the humidity level and suction power to each material, which makes sense because clearly marble is not the same as hardwood floors. My kitchen has laminate floors, which is not one of the features so I have it run on hardwood floors throughout. The carpet is also clearly marked on the maps.\u003c/p\u003e\u003ch2\u003eThe Specs\u003c/h2\u003e\u003cp\u003eWhile the physical setup was pretty intuitive, the app navigation was much more challenging. I really wish Narwal included a special app booklet outlining all the features, because there are a lot and I had to learn trial by error.\u003c/p\u003e\u003cp\u003eWhen I added a second map for the second floor, it took me a minute to figure out how to select the area that will be cleaned. I assumed it would be the entire space that was mapped, but for some reason it was a small square that needed to be stretched out across the entire space. Still, this is a good feature because it lets me select zones, say clean my \u003ca href=\"https://www.architecturaldigest.com/story/how-to-decorate-a-bedroom\" target=\"_blank\"\u003ebedroom\u003c/a\u003e but not my son’s room if he has Legos on the floor.\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003ePhoto: Yelena Mroz Alpert\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003ePhoto: Yelena Mroz Alpert\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003eBefore each cleaning, I could choose the type of vacuuming/mopping features. There is “vacuum and mop,” “vacuum then mop,” “vacuum,” and “mop.” Since the robot vacuum uses Freo Mind, a feature that uses AI technology to go back to areas with remaining dirt, the mopping requires the machine to return to the station to clean the pads. Because the base station is on the first floor, that’s not possible, so I have only used the vacuum feature upstairs.\u003c/p\u003e\u003cp\u003eThe mop combo feature is great thanks to the drying capabilities. I have definitely left my wet-dry vac with a wet roller inside the cleaning closet to find it smelling musty and icky days later. Instead of standard mop washing and drying by hand, the app tells me the mop drying progress, which is a bit long, but it is quiet and does not interfere with my daily life so I don’t even think about it. The Manage Accessories feature tells me how many hours I have until brushes and mops need replacement. (You can buy the accessories pack on Amazon for a reasonable $30 for a \u003ca data-offer-url=\"https://www.amazon.com/Replacement-Accessories-Compatible-Narwal-Freo/dp/B0CYPK99PN/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://cna.st/affiliate-link/5562jUBkjoEKArs1QqsT5mzjb5YS6Yk6hQChb3FpQj2ejXZCFwFmuh3wjLUw4Zxyru1WNq1cdjgbtstL25wT5mF1FBwwfSYMLbHdaazjxzaQdDqRWGtM3Fk2tQd6PFqTwRyUUJEC9qpDJuHwAmhQNTcniNPvkdbR2mkuRPqLC9MP1kfmrqgHjvRKE78jtdN4S4dkgDqTF\u0026#34;}\" href=\"https://cna.st/affiliate-link/5562jUBkjoEKArs1QqsT5mzjb5YS6Yk6hQChb3FpQj2ejXZCFwFmuh3wjLUw4Zxyru1WNq1cdjgbtstL25wT5mF1FBwwfSYMLbHdaazjxzaQdDqRWGtM3Fk2tQd6PFqTwRyUUJEC9qpDJuHwAmhQNTcniNPvkdbR2mkuRPqLC9MP1kfmrqgHjvRKE78jtdN4S4dkgDqTF\" rel=\"sponsored\" target=\"_blank\"\u003e15-piece set\u003c/a\u003e that includes a roller, mop pads and HEPA filters. Additional dust bags and disinfection detergent are also sold separately.) My first reaction was that having to buy replacement pieces is annoying, but I bet if my basic robot vac had these, it would run better, and that’s just part of the functionality.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOnce the Freo Z10 is running, I can see its movement in real time and you can tell how it is thinking, going around the room to identify the debris and then returning to get the dirt in a linear fashion.\u003c/p\u003e\u003ch2\u003eThe verdict\u003c/h2\u003e\u003cp\u003eIt took two hours and 43 minutes to clean the first floor (914 square feet) with the “vacuum then mop” feature. I blissfully ignored the ultra robot vacuum while working and ran to the grocery store as it was scooting around my kitchen, moving the mop pads under the fridge and the kitchen cabinet toe kick. The robot vac alerted me when I needed to refill the water, and once I did, it resumed cleaning. My floors are nice and shiny and I was impressed in the obstacle avoidance to see that it maneuvered around the dining room chairs instead of just jamming into the legs. I also liked that it was able to climb over different threshold levels, specifically the high one between the original hardwood floors of the house and the transition into the laminate floor of the kitchen. (I had my doubts, but Freo Z10 proved to be the little robot that could!)\u003c/p\u003e\u003cp\u003eOverall, my house is nice and clean, especially around the baseboard and perimeter, which always shows a dust trail on my dark floor. The Freo lifted the dust by the chalkboard and at the foot of the stairs, a spot that is often ignored.\u003c/p\u003e\u003cp\u003eI do think it is still learning the landscape because every once in a while I will see an errant piece of lint or whatever else my kids track in, but since I don’t have to do anything but push buttons on my phone, I don’t mind too much. Once I figured out the app features, the hardest thing about the whole experience is refilling the water tank and dumping the dirty water out.\u003c/p\u003e\u003cp\u003eYes, at over $1,000, the Freo Z10 is expensive, but other high-tech and high-end all-in-one mop and vacuum models fall in this price range, so it is not a price anomaly for this type of machine. At 55dB, it is one of the quietest models and does not interfere with my work. Plus, I can schedule cleaning when I am out.\u003c/p\u003e\u003cp\u003eThe only thing that I am not thrilled about is that it only comes in white, which actually looks very sleek, but it just stands out against my blue wall. But that’s on me—I probably shouldn’t keep it in my music room anyway. I think in a spot under the windowsill in my kitchen it will blend it much better. All in all, I would recommend the Narwal Freo Z10 robot vacuum—especially to anyone who wants the qualities of a smart home without the fuss. In fact, my mom is visiting and was so impressed by this little machine that she is looking into getting one to keep her floors spotless too.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-19T17:23:05.803-04:00",
  "modifiedTime": "2025-05-19T21:23:05.803Z"
}
