{
  "id": "4227ebd1-b8c5-43e7-96ac-9b2871529199",
  "title": "Louis Vuitton flagship construction disguised as stack of luggage trunks",
  "link": "https://www.dezeen.com/2024/11/18/louis-vuitton-flagship-construction-disguised-stack-luggage-trunks/",
  "description": "Part of a multi-year renovation of its New York flagship store, fashion brand Louis Vuitton has concealed its construction with a \"luggage\"  facade and relocated to a temporary store that features OMA-designed sculptures. Louis Vuitton covered its flagship at East 57th Street and 5th Avenue in a facade modelled after the brand's distinctive trunks, while The post Louis Vuitton flagship construction disguised as stack of luggage trunks appeared first on Dezeen.",
  "author": "Ellen Eberhardt",
  "published": "Mon, 18 Nov 2024 20:03:01 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Public and leisure",
    "Design",
    "Installations",
    "Cafes",
    "Chocolate",
    "Fashion",
    "Louis Vuitton",
    "Midtown Manhattan",
    "New York City",
    "USA"
  ],
  "byline": "Ellen Eberhardt",
  "length": 8264,
  "excerpt": "As part of renovating its NYC flagship, Louis Vuitton has wrapped its construction in a \"luggage\" facade and relocated to a shop with OMA-designed sculptures",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Part of a multi-year renovation of its New York flagship store, fashion brand Louis Vuitton has concealed its construction with a \"luggage\"  facade and relocated to a temporary store that features OMA-designed sculptures. Louis Vuitton covered its flagship at East 57th Street and 5th Avenue in a facade modelled after the brand's distinctive trunks, while simultaneously opening a temporary location around the corner, with sculptures developed with OMA partner Shohei Shigematsu that rise through an atrium. As part of a multi-year renovation, Louis Vuitton has covered its NYC flagship in a facade that resembles luggage. The top photo is by Brad Dickson. This photo is by Ricky ZehaviDesigned by Louis Vuitton's in-house team, the luggage facade wraps completely around the construction underway at the New York City flagship. It resembles six, grey trunks of various sizes stacked in descending size. According to the team, the design pays homage to the brand's Trianon Grey canvas, a light grey textile which dates back to the 19th century. Real metal details were used to cover the facade. The photo is by Brad DicksonDetails such as handles, locks, rivets and silver hardware are also represented on the facade, with the team noting the largest of the handles \"weighs 5,000 pounds\". \"It is finished with the classic detailing synonymous with Louis Vuitton's savoir-faire including handles, signature locks, and silver hardware rendered in chrome-plated, laser-cut steel,\" said Louis Vuitton. The facade is informed by a heritage grey canvas used by the brand. The photo is by Brad Dickson\"3D scans of real Louis Vuitton hard-sided trunks were used to create the locks and latches, and the steel corners have been hand-welded. The stack features 840 rivets, each etched with the moniker 'Louis Vuitton'.\" Strips of lighting run along each of the trunk's perimeters, while bands of black and brown represent leather lining. As part of the renovation, the brand relocated its flagship to a temporary location around the cornerWhile construction takes place at the flagship, the brand has relocated its retail operations to a five-storey building around the corner at 6 East 57th Street, which contains four floors inhabited by a chocolate shop, men's and women's wear, and the debut of the brand's first cafe in the US. The building's exterior architecture and interior floorplan remain unchanged according to the team, although it is now outfitted in a material palette of light woods, creams and shades of brown amongst an exposed concrete structure. Four, towering 16-meter-tall sculptures developed by Shigematsu sit in the lobby atrium, similarly modelled after \"iconic\" trunks. \"The trunks are built at the ateliers to actual product specifications and stacked to erect shifting, counterbalancing, twisting and zigzagging forms showcasing strength and lightness,\" said the team. The store contains towering sculptures developed with OMA partner Shohei Shigematsu\"Each is further distinguished by using different Louis Vuitton materials – historic stripes, classic Monogram canvas, white Damier, and a metallic Monogram – which have redefined the timeless piece from the past to today.\" Elsewhere in the store, furniture pieces from the nearby flagship \"reappear\" in keeping with the brand's \"commitment to circular creativity\" and were mixed with new pieces by designers such as Carlo Mollino, Charlotte Perriand, Christophe Delcourt and Pierre Augustin Rose. It contains the brand's first Louis Vuitton cafe in the USOversized, sculptures of a giraffe and ostrich and a screen with Louis Vuitton motifs cover the building's facade, which was also lined with bright exterior pendants. The flagship construction could \"potentially\" double the size of the store, according to New York Yimby, while the temporary location will shut down after the renovation is complete. A chocolate shop and women's and men's wear are also located throughout the temporary location\"Between the store's engaging spaces and the whimsical world within the cafe, Louis Vuitton 57th Street NYC is a temporary store that aspires to leave a lasting impression for New Yorkers and travellers alike,\" said the team. Louis Vuitton often taps luminaries from the design and architecture industries for its projects. Frank Gehrey recently designed a watch and handbag for the brand, while the North American head of its parent company LVMH recently spoke about an overarching commitment to sustainability. The photography is courtesy of Louis Vuitton unless otherwise noted. Read more: Cafes Chocolate Fashion Installations Louis Vuitton Midtown Manhattan New York City USA Architecture Public and leisure Design Subscribe to our newsletters Your email address New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_hero-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2143299\" data-article-id=\"2143299\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_hero-852x479.jpg\" alt=\"LV trunks\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_hero-1704x958.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003ePart of a multi-year renovation of its \u003ca href=\"https://www.dezeen.com/tag/new-york-city/\"\u003eNew York\u003c/a\u003e flagship store, fashion brand \u003ca href=\"https://www.dezeen.com/tag/louis-vuitton/\"\u003eLouis Vuitton\u003c/a\u003e has concealed its construction with a \u0026#34;luggage\u0026#34;  facade and relocated to a temporary store that features \u003ca href=\"https://www.dezeen.com/tag/oma/\"\u003eOMA\u003c/a\u003e-designed sculptures.\u003cspan id=\"more-2143299\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLouis Vuitton covered its flagship at East 57th Street and 5th Avenue in a facade modelled after the brand\u0026#39;s distinctive trunks, while simultaneously opening a temporary location around the corner, with sculptures developed with OMA partner \u003ca href=\"https://www.oma.com/partners/shohei-shigematsu\"\u003eShohei Shigematsu\u003c/a\u003e that rise through an atrium.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2143332\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_24-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_24-852x1239.jpg\" alt=\"LV trunk scaffolding\" width=\"1626\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_24-852x1239.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_24-1704x2477.jpg 2x\" sizes=\"(max-width: 1626px) 100vw, 1626px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143332\"\u003eAs part of a multi-year renovation, Louis Vuitton has covered its NYC flagship in a facade that resembles luggage. The top photo is by Brad Dickson. This photo is by Ricky Zehavi\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDesigned by Louis Vuitton\u0026#39;s in-house team, the luggage facade wraps completely around the construction underway at the New York City flagship. It resembles six, grey trunks of various sizes stacked in descending size.\u003c/p\u003e\n\u003cp\u003eAccording to the team, the design pays homage to the brand\u0026#39;s Trianon Grey canvas, a light grey textile which \u003ca href=\"https://www.1stdibs.com/furniture/more-furniture-collectibles/home-accents/trunks-luggage/1870s-louis-vuitton-grey-trianon-canvas-trunk/id-f_6268423/\"\u003edates back to the 19th century\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2143326\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_18-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_18-852x1029.jpg\" alt=\"LV trunk scaffolding\" width=\"1957\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_18-852x1029.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_18-1704x2058.jpg 2x\" sizes=\"(max-width: 1957px) 100vw, 1957px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143326\"\u003eReal metal details were used to cover the facade. The photo is by Brad Dickson\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eDetails such as handles, locks, rivets and silver hardware are also represented on the facade, with the team noting the largest of the handles \u0026#34;weighs 5,000 pounds\u0026#34;.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;It is finished with the classic detailing synonymous with Louis Vuitton\u0026#39;s savoir-faire including handles, signature locks, and silver hardware rendered in chrome-plated, laser-cut steel,\u0026#34; said Louis Vuitton.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2143328\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_20.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_20-852x568.jpg\" alt=\"LV trunk scaffolding\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_20-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_20-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143328\"\u003eThe facade is informed by a heritage grey canvas used by the brand. The photo is by Brad Dickson\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;3D scans of real Louis Vuitton hard-sided trunks were used to create the locks and latches, and the steel corners have been hand-welded. The stack features 840 rivets, each etched with the moniker \u0026#39;Louis Vuitton\u0026#39;.\u0026#34;\u003c/p\u003e\n\u003cp\u003eStrips of lighting run along each of the trunk\u0026#39;s perimeters, while bands of black and brown represent leather lining.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2143318\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_10.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_10-852x568.jpg\" alt=\"Louis Vuitton cafe\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_10-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_10-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143318\"\u003eAs part of the renovation, the brand relocated its flagship to a temporary location around the corner\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWhile construction takes place at the flagship, the brand has relocated its retail operations to a five-storey building around the corner at 6 East 57th Street, which contains four floors inhabited by a \u003ca href=\"https://www.dezeen.com/tag/chocolate/\"\u003echocolate shop\u003c/a\u003e, men\u0026#39;s and women\u0026#39;s wear, and the debut of the brand\u0026#39;s first \u003ca href=\"https://www.dezeen.com/tag/cafes/\"\u003ecafe\u003c/a\u003e in the US.\u003c/p\u003e\n\u003cp\u003eThe building\u0026#39;s exterior architecture and interior floorplan remain unchanged according to the team, although it is now outfitted in a material palette of light woods, creams and shades of brown amongst an exposed \u003ca href=\"https://www.dezeen.com/tag/concrete/\"\u003econcrete\u003c/a\u003e structure.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eFour, towering 16-meter-tall sculptures developed by Shigematsu sit in the lobby atrium, similarly modelled after \u0026#34;iconic\u0026#34; trunks.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The trunks are built at the ateliers to actual product specifications and stacked to erect shifting, counterbalancing, twisting and zigzagging forms showcasing strength and lightness,\u0026#34; said the team.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2143320\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_12-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_12-852x1278.jpg\" alt=\"Louis Vuitton cafe\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_12-852x1278.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_12-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143320\"\u003eThe store contains towering sculptures developed with OMA partner Shohei Shigematsu\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Each is further distinguished by using different Louis Vuitton materials – historic stripes, classic Monogram canvas, white Damier, and a metallic Monogram – which have redefined the timeless piece from the past to today.\u0026#34;\u003c/p\u003e\n\u003cp\u003eElsewhere in the store, furniture pieces from the nearby flagship \u0026#34;reappear\u0026#34; in keeping with the brand\u0026#39;s \u0026#34;commitment to circular creativity\u0026#34; and were mixed with new pieces by designers such as \u003ca href=\"https://www.carlomollino.org/\"\u003eCarlo Mollino\u003c/a\u003e, \u003ca href=\"https://www.dezeen.com/tag/charlotte-perriand/\"\u003eCharlotte Perriand\u003c/a\u003e, \u003ca href=\"https://www.christophedelcourt.com/en/\"\u003eChristophe Delcourt\u003c/a\u003e and \u003ca href=\"https://pierreaugustinrose.com/en\"\u003ePierre Augustin Rose\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2143304\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_3-852x639.jpg\" alt=\"Louis Vuitton cafe\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_3-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_3-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143304\"\u003eIt contains the brand\u0026#39;s first Louis Vuitton cafe in the US\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOversized, sculptures of a giraffe and ostrich and a screen with Louis Vuitton motifs cover the building\u0026#39;s facade, which was also lined with bright exterior pendants.\u003c/p\u003e\n\u003cp\u003eThe flagship construction could \u0026#34;potentially\u0026#34; double the size of the store, according to \u003ca href=\"https://newyorkyimby.com/2024/09/demolition-to-begin-for-new-louis-vuitton-flagship-at-1-east-57th-street-in-midtown-manhattan.html\"\u003eNew York Yimby\u003c/a\u003e, while the temporary location will shut down after the renovation is complete.\u003c/p\u003e\n\u003cfigure id=\"preload-6\" aria-describedby=\"caption-attachment-2143303\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_2.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_2-852x568.jpg\" alt=\"Louis Vuitton cafe\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_2-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/11/louis-vuitton-flagship-oma-new-york-city_dezeen_2364_col_2-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2143303\"\u003eA chocolate shop and women\u0026#39;s and men\u0026#39;s wear are also located throughout the temporary location\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Between the store\u0026#39;s engaging spaces and the whimsical world within the cafe, Louis Vuitton 57th Street NYC is a temporary store that aspires to leave a lasting impression for New Yorkers and travellers alike,\u0026#34; said the team.\u003c/p\u003e\n\u003cp\u003eLouis Vuitton often taps luminaries from the design and architecture industries for its projects.\u003c/p\u003e\n\u003cp\u003eFrank Gehrey recently designed \u003ca href=\"https://www.dezeen.com/2024/03/21/frank-gehry-transparent-watch-louis-vuitton/\"\u003ea watch\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2023/12/08/frank-gehry-louis-vuitton-handbag-art-basel-miami-beach/\"\u003ehandbag\u003c/a\u003e for the brand, while the \u003ca href=\"https://www.dezeen.com/2023/12/14/anish-melwani-interview-lvmh-us-head/\"\u003eNorth American head of its parent company LVMH recently spoke about an overarching commitment to sustainability\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is courtesy of Louis Vuitton unless otherwise noted.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"3437\" href=\"https://www.dezeen.com/tag/cafes/\"\u003eCafes\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3931\" href=\"https://www.dezeen.com/tag/chocolate/\"\u003eChocolate\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"412\" href=\"https://www.dezeen.com/tag/fashion-tag/\"\u003eFashion\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6402\" href=\"https://www.dezeen.com/design/installations/\"\u003eInstallations\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"656\" href=\"https://www.dezeen.com/tag/louis-vuitton/\"\u003eLouis Vuitton\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"12544\" href=\"https://www.dezeen.com/tag/midtown-manhattan/\"\u003eMidtown Manhattan\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"9095\" href=\"https://www.dezeen.com/tag/new-york-city/\"\u003eNew York City\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"76\" href=\"https://www.dezeen.com/tag/usa/\"\u003eUSA\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6036\" href=\"https://www.dezeen.com/architecture/public-and-leisure/\"\u003ePublic and leisure\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3\" href=\"https://www.dezeen.com/design/\"\u003eDesign\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#e9999b809f888a90a98d8c938c8c87c78a8684\"\u003e\u003cspan data-cfemail=\"0373716a7562607a4367667966666d2d606c6e\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-18T20:03:01Z",
  "modifiedTime": "2024-11-18T20:30:37Z"
}
