{
  "id": "a8189e47-f808-4953-bb1f-41e69ad82bb9",
  "title": "42 Years of Critical Regionalism",
  "link": "http://archidose.blogspot.com/2023/09/42-years-of-critical-regionalism.html",
  "description": "",
  "author": "John Hill",
  "published": "2023-09-25T08:00:00.780-04:00",
  "source": "http://feeds.feedburner.com/archidose",
  "categories": [
    "ucl press"
  ],
  "byline": "John Hill",
  "length": 13662,
  "excerpt": "(Covers of some of the books discussed in this post) If your first reaction to the title of this post is something along the lines of, \"...",
  "siteName": "Blogger",
  "favicon": "",
  "text": "(Covers of some of the books discussed in this post)If your first reaction to the title of this post is something along the lines of, \"Wait, isn't critical regionalism just 40 years old?,\" then everything you think know about critical regionalism is partial, in both senses of the term: incomplete and biased. Yes, Kenneth Frampton's \"Towards a Critical Regionalism: Six Points for an Architecture of Resistance\" was published in Hal Foster's The Anti-Aesthetic: Essays on Postmodern Culture in 1983, exactly 40 years ago, but the term \"critical regionalism\" was coined two years earlier by Alexander Tzonis and Liane Lefaivre in their article \"The Grid and the Pathway: An Introduction to the Work of Dimitris and Susana Antonakakis\" in Architecture in Greece. But as the term took hold in architectural circles that decade, and to a lesser but still lasting degree in the decades since, it has more often been associated with Frampton's essay, even though he acknowledged the earlier essay at the time and that acknowledgment brought Tzonis and Lefaivre a good deal of attention beyond their native Greece. Yet, if critical regionalism is some sort of –ism, then should it be defined by just one critic? Is it unfair, in other words, that Frampton's take should take precedence over Tzonis and Lefaivre's?First thing's first: what is critical regionalism? If we take a step back and look at the more general term \"regionalism,\" the entry for it in the three-volume Encyclopedia of 20th-Century Architecture (2004, edited by R. Stephen Sennott) describes regionalism in architecture as \"the desire to shape buildings according to the particular characteristics of a specific place.\" Further describing it as \"the oldest and most pervasive of all building ideas,\" the entry omits mention of critical regionalism but includes Frampton's essay in its bibliography. Richard Weston, in his excellent introduction to architecture from 2011, 100 Ideas that Changed Architecture, while he doesn't include critical regionalism among the hundred, he describes it in the entry for regionalism like so: \"Attempting to come to terms with the ethical dilemmas of practicing in a globalized world, [... Tzonis and Lefaivre] argued that while welcoming the benefits of interaction and exchange, designers should think critically about their impact and value the uniqueness of the local/regional culture, environment, and resources.\" Furthermore, they \"hoped to avoid both the commercialization of 'folk' traditions and their political use — as in Hitler's promotion of volkisch culture — as a means of excluding others.\" Weston goes on to describe how Frampton took up the couple's approach but \"argued for an emphasis on topography, climate, light, and the tactile rather than the visual [...] advocating tectonic rather than scenographic form as exemplary of the approach,\" as found in the work of Alvar Aalto and Jørn Utzon.In just a few sentences, Weston draws a basic distinction between the concepts of critical regionalism proffered by Tzonis, Lefaivre, and Frampton, namely that the social and political implications of regionalism nullified the concept for Tzonis and Lefaivre, thereby requiring a critical approach to regionalism, while Frampton saw critical regionalism as a valid response to \"scenographic form,\" by which he means the postmodern architecture that was taking hold of the American architecture profession at the time. Although the architecture and ideas influencing Frampton's \"Six Points for an Architecture of Resistance\" date back to at least the mid-1960s, the direct impetus for his essay was the 1980 Venice Architecture Biennale, curated by Paolo Portoghesi with its famous \"street,\" the Strada Novissima. Frampton was invited by Portoghesi, alongside fellow critics Charles Jencks, Christian Norberg-Schultz, and Vincent Scully, to contribute to the inaugural architecture biennale in Venice, but he stepped down, writing in a letter to Robert A. M. Stern (a page of it is shown in OASE #103: Critical Regionalism Revisited) that the exhibition \"seems to represent the triumph of Post-Modernism\" and that he had already \"written a text which is categorically critical of this position.\"Frampton's letter to Stern was dated May 13, 1980, but the text he mentions he had already written was not \"Towards a Critical Regionalism\" as it would be found in The Anti-Aesthetic. Most likely it was \"The Need for Roots: Venice 1980,\" which was published in the winter 1981 issue of GA Document. (I have not seen that essay so can't comment on it.) Between the Biennale in 1980 and the release of Foster's collection of postmodern essays, Frampton worked out his concept of critical regionalism, or at least the seeds of the concept can be seen in those years. Modern Architecture and the Critical Present, published by AD in 1982, was basically devoted to his 1980 book Modern Architecture: A Critical History (the fifth edition arrived in 2020), so alongside its other contents it included \"Place, Production and Architecture: Towards a Critical Theory of Building,\" an excerpt of the book's last chapter. It also included \"The Isms of Contemporary Architecture,\" revised to add \"Regionalism\" as one of the –isms. Although Frampton mentions the thesis of a \"hybrid 'world culture'\" advanced by philosopher Paul Ricoeur, whose words preface his Anti-Aesthetic essay, and he discusses the work of Aalto, Mario Botta, Alvaro Siza, Gino Valle, and other architects who fit the mold of critical regionalism, the –ism was not yet explicitly \"critical.\"That same year, 1982, Frampton contributed \"Proposals for a Critical Regionalism\" to Perspecta 20: The Journal of the Yale School of Architecture. Similarities to the essay that will follow in 1983 are found in the Ricoeur quote prefacing the article and a mention of \"The Grid and the Pathway.\" While the \"Six Points\" essay is abstract, with mention of just two or three architects, the Perspecta article is loaded with buildings and projects that illustrate Frampton's concept. Tadao Ando, J. A. Coderch, Ricardo Bofill, Raimund Abraham, Botta, Valle, and others serve as examples of \"recent regional 'schools' whose aim has been to represent and serve, in a critical sense, the limited constituencies in which they are grounded.\" The essay concludes with mention of \"The Grid and the Pathway,\" but Frampton does not give credit to the authors for coining \"critical regionalism,\" instead using their subjects, Dimitris and Susana Antonakakis, as exemplars of the regional \"school\" in Greece. Curiously, even though the Perspecta editors give full credit to Tzonis and Lefaivre in the citation to their text, Frampton only mentions Tzonis, referring to \"The Grid and the Pathway\" as \"his article\"; this is indicative of the sexism still entrenched at the time but also a lack of understanding of Tzonis and Lefaivre's concept for critical regionalism beyond their 1981 essay.The information described above can be cobbled together from various sources, as cited, as well as from the recently published Kenneth Frampton: Conversations with Daniel Talesnik, in which Frampton is forthcoming about the origins of \"Towards a Critical Regionalism\" and the debt it owed to Tzonis and Lefaivre. (His recital of the facts to Talesnik makes it seem that it is a story he has told numerous times in the decades since his essay.) But to gain a considerably deeper understanding of the overlapping theories of critical regionalism and their origins, one recently published book is extremely valuable and highly recommended:There are too many revelations in Giamarelos's history/historiography of critical regionalism, but only enough space here to mention three. First is the role of Robert A. M. Stern in the 1980 Venice Architecture Biennale, The Presence of the Past. Giamarelos describes Stern as \"the show's overlooked protagonist [...] historically overshadowed by Portoghesi.\" Frampton, remember, was invited to participate, but by the time he and the other critics went to Venice, in November 1979, the direction of the exhibition was already determined during a September 1979 meeting where Stern presented his detailed proposal that \"practically formed the backbone of the exhibition,\" per Giamarelos. No wonder most of the architects contributing to the Strada Novissima were from North America rather than Europe or Asia, and no wonder Frampton addressed his resignation letter to Stern.A second revelation is the contribution of Anthony Alofsin, who was a student of Tzonis's in the 1970s, when he was teaching at Ivy League schools in the US. Alofsin is known now for numerous books on Frank Lloyd Wright, but in the 1970s his work as a sculptor and architect in New Mexico \"stimulated his interest in the historic processes that lay beneath\" the area's historic buildings. He brought this interest in regionalism to Harvard GSD in 1978, where he took courses from Tzonis that \"familiarized him with critical theory,\" per Giamarelos. Alofsin ended up joining Tzonis and Lefaivre on a paper, \"The Question of Regionalism,\" for a conference in 1980 organized by Swiss sociologist Lucius Burckhardt. Alofsin's text submitted to Tzonis, \"Constructive Regionalism,\" served as the basis for the paper, but Tzonis and Lefaivre modified Alofsin's conclusion, introducing the critical regionalism they would expand upon for the Architecture in Greece esssay. (Vincent B. Canizaro's excellent Architectural Regionalism: Collected Writings on Place, Identity, Modernity and Tradition includes Alofsin's original text.) So, while \"The Question of Regionalism,\" when published in 1981, was the first appearance of critical regionalism in print, it was only in German and therefore not cited by Frampton, unlike the bilingual \"The Grid and the Pathway.\"A third illuminating thread of information from the book involves Frampton's proposed 18-book series of \"monographs on critical architecture practices of 'unsentimental regionality'\" for Rizzoli, who would have published them over a period of two to four years. First proposed at the end of 1981, Frampton moved forward with two titles — on Tadao Ando and Atelier 66, the practice of Dimitris and Susana Antonakakis, published in 1984 and 85, respectively — before Rizzoli discontinued the series. (Such an ambitious, audacious proposal no doubt stemmed from Frampton serving as an acquisitions and editorial consultant at Rizzoli from 1979 to 1988.) Outside of Vittorio Gregotti, whom Frampton would have written about on his own, each book would have been edited by Frampton, included a short introduction by him, and featured a longer essay by an author familiar with their work; naturally, then, Tzonis and Lefaivre contributed to the book on Atelier 66. Giamarelos also discusses the book Frampton started to work about critical regionalism, given that his essay made such an impact in the 1980s that it warranted a book-length exposition. That never happened, but Frampton rolled some of his version of critical regionalism into Studies in Tectonic Culture: The Poetics of Construction in Nineteenth and Twentieth Century Architecture, an excellent and well-respected book but not one with the lasting impact of the 1983 essay.So, if Frampton did not write the book on critical regionalism, who did, assuming one exists? The first architecture book bearing the critical regionalism moniker was written by none other than Tzonis and Lefaivre. Critical Regionalism: Architecture and Identity in a Globalized World was published in 2003, the third in Prestel's \"Architecture in Focus\" series, which also included books on \"Minimal Architecture\" and \"Light, Mobile and Floating Architecture.\" The authors used the book to provide a deeper history of regionalism, tracing it from Ancient Greece to ca. World War II in an essay by Tzonis, and delving into the ideas of Lewis Mumford in an essay by Lefaivre that looked at the three decades after the war. The other half of the book has twenty examples of critical regionalism, mainly in photos, making it as much a picture book as a text of history and theory. Given the impact of critical regionalism on architects — it is one of the few architectural concepts/theories with direct application to professional practice — I wanted to include something on it in Buildings in Print: 100 Influential and Inspiring Illustrated Architecture Books. Although Critical Regionalism is the book I chose, Giamarelos describes their later book, Architecture of Regionalism in the Age of Globalization: Peaks and Valleys in the Flat World (first published in 2011 and expanded in 2020) as the couple's definitive statement on critical regionalism, signaling its greater importance.While this review can only touch on a few points in Resisting Postmodern Architecture: Critical Regionalism Before Globalisation, Giamarelos's goals are two-fold: articulating the formulation of critical regionalism by Tzonis and Lefaivre, since it has long been overshadowed by Frampton's concept; and, in the book's second half, exploring the cross-cultural roots of critical regionalism in Greece, the home of Tzonis, Lefaivre, and their original subjects, Dimitris and Susana Antonakakis. Giamarelos wraps up the book by arguing for the continued relevance of critical regionalism today, shifting it from \"an architectural theory of the 1980s into a manifesto for architectural historiography in the 21st century.\" If architectural historians embrace the seven points of Giamarelos's manifesto remains to be seen, but the value of the history the book tells is abundantly clear, given the lack of a history of critical regionalism before it.",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgword2K0pc9bTpDNMqdXTh1MHdWy7aBqPAAuWM5fJWUqunlwkbeDE3ulkrgyczzsQ4gQDQBzpVZgyD5vYlMBwcZmijikHRnIqsDUjVSyA5srQPmOKEBd-d8fMPnf2IQg-wW71YinaNdmHCXm7zC8KPcgCDzvFPyYI4qUh_0aPozax2j4T6VW9L/w1200-h630-p-k-no-nu/critical-regionalism.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-body-5339862670187437968\"\u003e\n\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgword2K0pc9bTpDNMqdXTh1MHdWy7aBqPAAuWM5fJWUqunlwkbeDE3ulkrgyczzsQ4gQDQBzpVZgyD5vYlMBwcZmijikHRnIqsDUjVSyA5srQPmOKEBd-d8fMPnf2IQg-wW71YinaNdmHCXm7zC8KPcgCDzvFPyYI4qUh_0aPozax2j4T6VW9L/s1336/critical-regionalism.jpg\"\u003e\u003cspan\u003e\u003cimg alt=\"\" data-original-height=\"1082\" data-original-width=\"1336\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgword2K0pc9bTpDNMqdXTh1MHdWy7aBqPAAuWM5fJWUqunlwkbeDE3ulkrgyczzsQ4gQDQBzpVZgyD5vYlMBwcZmijikHRnIqsDUjVSyA5srQPmOKEBd-d8fMPnf2IQg-wW71YinaNdmHCXm7zC8KPcgCDzvFPyYI4qUh_0aPozax2j4T6VW9L/s600/critical-regionalism.jpg\" width=\"600\"/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e\u003cp\u003e\u003ci\u003e(Covers of some of the books discussed in this post)\u003c/i\u003e\u003c/p\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003cp\u003e\u003cspan\u003eIf your first reaction to the title of this post is something along the lines of, \u0026#34;Wait, isn\u0026#39;t critical regionalism just 40 years old?,\u0026#34; then everything you think know about critical regionalism is partial, in both senses of the term: incomplete and biased. Yes, Kenneth Frampton\u0026#39;s \u0026#34;Towards a Critical Regionalism: Six Points for an Architecture of Resistance\u0026#34; was published in Hal Foster\u0026#39;s \u003ci\u003e\u003ca href=\"https://amzn.to/3RlPNzj\" target=\"_blank\"\u003eThe Anti-Aesthetic: Essays on Postmodern Culture\u003c/a\u003e\u003c/i\u003e in 1983, exactly 40 years ago, but the term \u0026#34;critical regionalism\u0026#34; was coined two years earlier by Alexander Tzonis and Liane Lefaivre in their article \u0026#34;The Grid and the Pathway: An Introduction to the Work of Dimitris and Susana Antonakakis\u0026#34; in \u003ci\u003eArchitecture in Greece\u003c/i\u003e. But as the term took hold in architectural circles that decade, and to a lesser but still lasting degree in the decades since, it has more often been associated with Frampton\u0026#39;s essay, even though he acknowledged the earlier essay at the time and that acknowledgment brought Tzonis and Lefaivre a good deal of attention beyond their native Greece. Yet, if critical regionalism is some sort of –ism, then should it be defined by just one critic? Is it unfair, in other words, that Frampton\u0026#39;s take should take precedence over Tzonis and Lefaivre\u0026#39;s?\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFirst thing\u0026#39;s first: what is critical regionalism? If we take a step back and look at the more general term \u0026#34;regionalism,\u0026#34; the entry for it in the three-volume \u003ci\u003e\u003ca href=\"https://amzn.to/3LyahkC\" target=\"_blank\"\u003eEncyclopedia of 20th-Century Architecture\u003c/a\u003e\u003c/i\u003e (2004, edited by R. Stephen Sennott) describes regionalism in architecture as \u0026#34;the desire to shape buildings according to the particular characteristics of a specific place.\u0026#34; Further describing it as \u0026#34;the oldest and most pervasive of all building ideas,\u0026#34; the entry omits mention of critical regionalism but includes Frampton\u0026#39;s essay in its bibliography. Richard Weston, in his excellent introduction to architecture from 2011, \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/2012/01/book-review-100-ideas-that-changed.html\"\u003e100 Ideas that Changed Architecture\u003c/a\u003e\u003c/i\u003e, while he doesn\u0026#39;t include critical regionalism among the hundred, he describes it in the entry for regionalism like so: \u0026#34;Attempting to come to terms with the ethical dilemmas of practicing in a globalized world, [... Tzonis and Lefaivre] argued that while welcoming the benefits of interaction and exchange, designers should think critically about their impact and value the uniqueness of the local/regional culture, environment, and resources.\u0026#34; Furthermore, they \u0026#34;hoped to avoid both the commercialization of \u0026#39;folk\u0026#39; traditions and their political use — as in Hitler\u0026#39;s promotion of \u003ci\u003evolkisch\u003c/i\u003e culture — as a means of excluding others.\u0026#34; Weston goes on to describe how Frampton took up the couple\u0026#39;s approach but \u0026#34;argued for an emphasis on topography, climate, light, and the tactile rather than the visual [...] advocating tectonic rather than scenographic form as exemplary of the approach,\u0026#34; as found in the work of Alvar Aalto and Jørn Utzon.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn just a few sentences, Weston draws a basic distinction between the concepts of critical regionalism proffered by Tzonis, Lefaivre, and Frampton, namely that the social and political implications of regionalism nullified the concept for Tzonis and Lefaivre, thereby requiring a critical approach to regionalism, while Frampton saw critical regionalism as a valid response to \u0026#34;scenographic form,\u0026#34; by which he means the postmodern architecture that was taking hold of the American architecture profession at the time. Although the architecture and ideas influencing Frampton\u0026#39;s \u0026#34;Six Points for an Architecture of Resistance\u0026#34; date back to at least the mid-1960s, the direct impetus for his essay was the 1980 Venice Architecture Biennale, curated by Paolo Portoghesi with its famous \u0026#34;street,\u0026#34; the \u003ca href=\"https://www.domusweb.it/en/from-the-archive/2012/08/25/-em-la-strada-novissima-em--the-1980-venice-biennale.html\" target=\"_blank\"\u003eStrada Novissima\u003c/a\u003e. Frampton was invited by Portoghesi, alongside fellow critics Charles Jencks, Christian Norberg-Schultz, and Vincent Scully, to contribute to the inaugural architecture biennale in Venice, but he stepped down, writing in a letter to Robert A. M. Stern (a page of it is shown in \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/2019/09/oase-103.html\"\u003eOASE #103: Critical Regionalism Revisited\u003c/a\u003e\u003c/i\u003e) that the exhibition \u0026#34;seems to represent the triumph of Post-Modernism\u0026#34; and that he had already \u0026#34;written a text which is categorically critical of this position.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eFrampton\u0026#39;s letter to Stern was dated May 13, 1980, but the text he mentions he had already written was not \u0026#34;Towards a Critical Regionalism\u0026#34; as it would be found in \u003ci\u003eThe Anti-Aesthetic\u003c/i\u003e. Most likely it was \u0026#34;The Need for Roots: Venice 1980,\u0026#34; which was published in the \u003ca href=\"https://amzn.to/3PRQqQ5\" target=\"_blank\"\u003ewinter 1981 issue of \u003ci\u003eGA Document\u003c/i\u003e\u003c/a\u003e. (I have not seen that essay so can\u0026#39;t comment on it.) Between the Biennale in 1980 and the release of Foster\u0026#39;s collection of postmodern essays, Frampton worked out his concept of critical regionalism, or at least the seeds of the concept can be seen in those years. \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/2021/01/modern-architecture-and-critical-present.html\"\u003eModern Architecture and the Critical Present\u003c/a\u003e\u003c/i\u003e, published by AD in 1982, was basically devoted to his 1980 book \u003ci\u003eModern Architecture: A Critical History\u003c/i\u003e (\u003ca href=\"https://archidose.blogspot.com/2021/01/modern-architecture.html\"\u003ethe fifth edition arrived in 2020\u003c/a\u003e), so alongside its other contents it included \u0026#34;Place, Production and Architecture: Towards a Critical Theory of Building,\u0026#34; an excerpt of the book\u0026#39;s last chapter. It also included \u0026#34;The Isms of Contemporary Architecture,\u0026#34; revised to add \u0026#34;Regionalism\u0026#34; as one of the –isms. Although Frampton mentions the thesis of a \u0026#34;hybrid \u0026#39;world culture\u0026#39;\u0026#34; advanced by philosopher Paul Ricoeur, whose words preface his \u003ci\u003eAnti-Aesthetic\u003c/i\u003e essay, and he discusses the work of Aalto, Mario Botta, Alvaro Siza, Gino Valle, and other architects who fit the mold of critical regionalism, the –ism was not yet explicitly \u0026#34;critical.\u0026#34;\u003c/p\u003e\u003cp\u003eThat same year, 1982, Frampton contributed \u0026#34;Proposals for a Critical Regionalism\u0026#34; to \u003ca href=\"https://amzn.to/44SxQLH\" target=\"_blank\"\u003e\u003ci\u003ePerspecta 20: The Journal of the Yale School of Architecture\u003c/i\u003e\u003c/a\u003e. Similarities to the essay that will follow in 1983 are found in the Ricoeur quote prefacing the article and a mention of \u0026#34;The Grid and the Pathway.\u0026#34; While the \u0026#34;Six Points\u0026#34; essay is abstract, with mention of just two or three architects, the Perspecta article is loaded with buildings and projects that illustrate Frampton\u0026#39;s concept. Tadao Ando, J. A. Coderch, Ricardo Bofill, Raimund Abraham, Botta, Valle, and others serve as examples of \u0026#34;recent regional \u0026#39;schools\u0026#39; whose aim has been to represent and serve, in a critical sense, the limited constituencies in which they are grounded.\u0026#34; The essay concludes with mention of \u0026#34;The Grid and the Pathway,\u0026#34; but Frampton does not give credit to the authors for coining \u0026#34;critical regionalism,\u0026#34; instead using their subjects, Dimitris and Susana Antonakakis, as exemplars of the regional \u0026#34;school\u0026#34; in Greece. Curiously, even though the Perspecta editors give full credit to Tzonis and Lefaivre in the citation to their text, Frampton only mentions Tzonis, referring to \u0026#34;The Grid and the Pathway\u0026#34; as \u0026#34;his article\u0026#34;; this is indicative of the sexism still entrenched at the time but also a lack of understanding of Tzonis and Lefaivre\u0026#39;s concept for critical regionalism beyond their 1981 essay.\u003c/p\u003e\u003cp\u003eThe information described above can be cobbled together from various sources, as cited, as well as from the recently published \u003ci\u003e\u003ca href=\"https://cup.columbia.edu/book/kenneth-frampton-conversations-with-daniel-talesnik/9781941332641\" target=\"_blank\"\u003eKenneth Frampton: Conversations with Daniel Talesnik\u003c/a\u003e\u003c/i\u003e, in which Frampton is forthcoming about the origins of \u0026#34;Towards a Critical Regionalism\u0026#34; and the debt it owed to Tzonis and Lefaivre. (His recital of the facts to Talesnik makes it seem that it is a story he has told numerous times in the decades since his essay.) But to gain a considerably deeper understanding of the overlapping theories of critical regionalism and their origins, one recently published book is \u003cspan\u003eextremely valuable and highly recommended:\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are too many revelations in Giamarelos\u0026#39;s history/historiography of critical regionalism, but only enough space here to mention three. First is the role of Robert A. M. Stern in the 1980 Venice Architecture Biennale, \u003ci\u003e\u003ca href=\"https://amzn.to/3tcKiZx\" target=\"_blank\"\u003eThe Presence of the Past\u003c/a\u003e\u003c/i\u003e. \u003c/span\u003eGiamarelos describes Stern as \u0026#34;the show\u0026#39;s overlooked protagonist [...] historically overshadowed by Portoghesi.\u0026#34; Frampton, remember, was invited to participate, but by the time he and the other critics went to Venice, in November 1979, the direction of the exhibition was already determined during a September 1979 meeting where Stern presented his detailed proposal that \u0026#34;practically formed the backbone of the exhibition,\u0026#34; per Giamarelos. No wonder most of the architects contributing to the Strada Novissima were from North America rather than Europe or Asia, and no wonder Frampton addressed his resignation letter to Stern.\u003c/p\u003e\u003cp\u003eA second revelation is the contribution of Anthony Alofsin, who was a student of Tzonis\u0026#39;s in the 1970s, when he was teaching at Ivy League schools in the US. Alofsin is known now for \u003ca href=\"https://www.amazon.com/stores/Anthony-Alofsin/author/B001HMP9G0\" target=\"_blank\"\u003enumerous books on Frank Lloyd Wright\u003c/a\u003e, but in the 1970s his work as a sculptor and architect in New Mexico \u0026#34;stimulated his interest in the historic processes that lay beneath\u0026#34; the area\u0026#39;s historic buildings. He brought this interest in regionalism to Harvard GSD in 1978, where he took courses from Tzonis that \u0026#34;familiarized him with critical theory,\u0026#34; per Giamarelos. Alofsin ended up joining Tzonis and Lefaivre on a paper, \u0026#34;The Question of Regionalism,\u0026#34; for a conference in 1980 organized by Swiss sociologist \u003ca href=\"https://archidose.blogspot.com/2022/11/the-minimal-intervention.html\"\u003eLucius Burckhardt\u003c/a\u003e. Alofsin\u0026#39;s text submitted to Tzonis, \u0026#34;Constructive Regionalism,\u0026#34; served as the basis for the paper, but Tzonis and Lefaivre modified Alofsin\u0026#39;s conclusion, introducing the critical regionalism they would expand upon for the \u003ci\u003eArchitecture in Greece\u003c/i\u003e esssay. (Vincent B. Canizaro\u0026#39;s excellent \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/2007/11/book-review-architectural-regionalism.html\"\u003eArchitectural Regionalism: Collected Writings on Place, Identity, Modernity and Tradition\u003c/a\u003e\u003c/i\u003e includes Alofsin\u0026#39;s original text.) So, while \u0026#34;The Question of Regionalism,\u0026#34; when published in 1981, was the first appearance of critical regionalism in print, it was only in German and therefore not cited by Frampton, unlike the bilingual \u0026#34;The Grid and the Pathway.\u0026#34;\u003c/p\u003e\u003cp\u003eA third illuminating thread of information from the book involves Frampton\u0026#39;s proposed 18-book series of \u0026#34;monographs on critical architecture practices of \u0026#39;unsentimental regionality\u0026#39;\u0026#34; for Rizzoli, who would have published them over a period of two to four years. First proposed at the end of 1981, Frampton moved forward with two titles — on Tadao Ando and Atelier 66, the practice of Dimitris and Susana Antonakakis, published in 1984 and 85, respectively — before Rizzoli discontinued the series. (Such an ambitious, audacious proposal no doubt stemmed from Frampton serving as an acquisitions and editorial consultant at Rizzoli from 1979 to 1988.) Outside of Vittorio Gregotti, whom Frampton would have written about on his own, each book would have been edited by Frampton, included a short introduction by him, and featured a longer essay by an author familiar with their work; naturally, then, Tzonis and Lefaivre contributed to the book on Atelier 66. Giamarelos also discusses the book Frampton started to work about critical regionalism, given that his essay made such an impact in the 1980s that it warranted a book-length exposition. That never happened, but Frampton rolled some of his version of critical regionalism into \u003ci\u003e\u003ca href=\"https://amzn.to/464dkZW\" target=\"_blank\"\u003eStudies in Tectonic Culture: The Poetics of Construction in Nineteenth and Twentieth Century Architecture\u003c/a\u003e\u003c/i\u003e, an excellent and well-respected book but not one with the lasting impact of the 1983 essay.\u003c/p\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSo, if Frampton did not write \u003ci\u003ethe\u003c/i\u003e book on critical regionalism, who did, assuming one exists? The first architecture book bearing the critical regionalism moniker was written by none other than Tzonis and Lefaivre. \u003ci\u003e\u003ca href=\"https://amzn.to/3LspoMk\" target=\"_blank\"\u003eCritical Regionalism: Architecture and Identity in a Globalized World\u003c/a\u003e\u003c/i\u003e\u003cspan\u003e was \u003c/span\u003epublished in 2003, the third in Prestel\u0026#39;s \u0026#34;Architecture in Focus\u0026#34; series, which also included books on \u003ca href=\"https://amzn.to/3POyqpv\" target=\"_blank\"\u003e\u0026#34;Minimal Architecture\u0026#34;\u003c/a\u003e and \u003ca href=\"https://amzn.to/3PwWDPO\" target=\"_blank\"\u003e\u0026#34;Light, Mobile and Floating Architecture.\u0026#34;\u003c/a\u003e The authors used the book to provide a deeper history of regionalism, tracing it from Ancient Greece to ca. World War II in an essay by Tzonis, and delving into the ideas of Lewis Mumford in an essay by Lefaivre that looked at the three decades after the war. The other half of the book has twenty examples of critical regionalism, mainly in photos, making it as much a picture book as a text of history and theory. Given the impact of critical regionalism on architects — it is one of the few architectural concepts/theories with direct application to professional practice — I wanted to include something on it in \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/p/buildings-in-print.html\"\u003eBuildings in Print: 100 Influential and Inspiring Illustrated Architecture Books\u003c/a\u003e\u003c/i\u003e. Although \u003ci\u003eCritical Regionalism\u003c/i\u003e is the book I chose, Giamarelos describes their later book, \u003ci\u003eArchitecture of Regionalism in the Age of Globalization: Peaks and Valleys in the Flat World\u003c/i\u003e (\u003ca href=\"https://amzn.to/3LzvV8i\" target=\"_blank\"\u003efirst published in 2011\u003c/a\u003e and \u003ca href=\"https://amzn.to/3Lzw0sC\" target=\"_blank\"\u003eexpanded in 2020\u003c/a\u003e) as the couple\u0026#39;s definitive statement on critical regionalism, signaling its greater importance.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003cbr/\u003eWhile this review can only touch on a few points in \u003ci\u003eResisting Postmodern Architecture: Critical Regionalism Before Globalisation\u003c/i\u003e, Giamarelos\u0026#39;s goals are two-fold: articulating the formulation of critical regionalism by Tzonis and Lefaivre, since it has long been overshadowed by Frampton\u0026#39;s concept; and, in the book\u0026#39;s second half, exploring the cross-cultural roots of critical regionalism in Greece, the home of Tzonis, Lefaivre, and their original subjects, Dimitris and Susana Antonakakis. Giamarelos wraps up the book by arguing for the continued relevance of critical regionalism today, shifting it from \u0026#34;an architectural theory of the 1980s into a manifesto for architectural historiography in the 21st century.\u0026#34; If architectural historians embrace the seven points of \u003c/span\u003eGiamarelos\u0026#39;s manifesto remains to be seen, but the value of the history the book tells is abundantly clear, given the lack of a history of critical regionalism before it.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2023-09-25T08:00:00-04:00",
  "modifiedTime": null
}
