{
  "id": "bc8575a4-48f3-4cb8-bcf0-a3dcfe0acd51",
  "title": "DRM Arquitectura uses prefabricated structure for Buenos Aires ice cream shop",
  "link": "https://www.dezeen.com/2024/12/14/drm-arquitectura-buenos-aires-ice-cream-shop/",
  "description": "Local studio DRM Arquitectura has designed a space-framed drive-through ice cream parlour lifted on inverted V-shaped columns in Buenos Aires, Argentina. The Veneciana Canning Ice Cream Drive Thru is situated on a busy roadside plot near National Route No. 58 that challenged the DRM Arquitectura team to create a calm atmosphere without disconnecting from the The post DRM Arquitectura uses prefabricated structure for Buenos Aires ice cream shop appeared first on Dezeen.",
  "author": "Kate Mazade",
  "published": "Sat, 14 Dec 2024 18:00:47 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Public and leisure",
    "Buenos Aires",
    "Argentina",
    "Metal",
    "Terraces",
    "Restaurants",
    "ice cream",
    "Perforated metal"
  ],
  "byline": "Kate Mazade",
  "length": 7684,
  "excerpt": "DRM Arquitectura has designed a space-framed drive-through ice cream parlour lifted on inverted V-shaped columns in Buenos Aires, Argentina.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Local studio DRM Arquitectura has designed a space-framed drive-through ice cream parlour lifted on inverted V-shaped columns in Buenos Aires, Argentina. The Veneciana Canning Ice Cream Drive Thru is situated on a busy roadside plot near National Route No. 58 that challenged the DRM Arquitectura team to create a calm atmosphere without disconnecting from the fast access road. DRM Arquitectura created an ice cream parlour in Buenos AiresFollowing the studio's three-part design concept – product, person, place – the 300-square metre (3,230 square foot) parlour was a \"quick-build roadside stop\" that serves as an \"announcement sign\" for travellers in the bustling area. The building is raised on two inverted V-shaped white columns and two simple columns to make it more visible, free up the ground floor, and create a semi-covered terrace with a view of the La Esperanza Golf Club. It has a drive-thru and is situated off a busy strreet\"The metal structure is undoubtedly the protagonist of the space; making architecture from the structure is what we are passionate about,\" the team said. Set back from the perimeter of the building, the prefabricated columns create a large plan and absorb all of the horizontal load from the upper level, serving as the only link to the second story. It has a metal structure that creates a semi-covered terraceThe furniture and staircase \"hang\" from the space frame while the bar and floating circular restroom \"folds\" up from the floor. \"The ground floor proposes the dissolution of the building's limits both as a commercial strategy, aiming not to create barriers of entry and as a strategy to anchor to an environment with attributes valuable to the landscape, which can be incorporated as part of the building’s architecture,\" the team said. The staircase \"hangs\" from the steel structureMeanwhile, the upper floor is wrapped in a perimeter terrace shaded by a series of pergolas that control light and open dining space to the sounds and sights of the city. The interior of the upper floor houses an isolated children's play area. A service tower – with mechanical equipment stacked on top of the staircase – adds a vertical counterpoint to the horizontal building that is nearly square in plan. In order to expedite construction, the 15-tonne structural frame was prefabricated while the foundation was poured, and was transported to the site and hoisted into place. Taking cues from the diagonal bracing in the trusses, the team replicated triangular patterns throughout the design including 45-degree patterns in the formwork of the precast white walls, perforated and sinusoidal white sheet metal, wood details, and welded tube ironwork. Mechanical systems and the metal ceiling were left exposed\"Depending on the time of day, some diagonal patterns are illuminated, and others are not due to the concavities and convexities, generating permanent mutations in the facades,\" the team said. Other notable ice cream parlour designs include a compact Czech shop in Brno by Holky Rády Architeckturu, a blue-tiled \"theatre of gelato\" in Melbourne by Ewert Leaf, and a black and white \"Instagrammable\" interior for a Milk Train shop in London by FormRoom. The photography is by Javier Agustin Rojas. Project credits: Architect: DRM ArquitecturaTeam: Dimaio Luciano, Rocca Nicolás, Muerza Esteban, Ramiro Barraza, Augusto Latzke Blake, Lautaro Egui, Giuliana Scatuerchio, Sofía Prytoluk, Ignacio Llaneza, Fabián Bruno, Ezequiel Basso, Florencia Chumbes, Lucía BinettiEngineering: Andres MoscatelliConstruction: Hernan Sotelo, Eduardo Tabaracci, Mauricio Chiarello Read more: Buenos Aires Argentina Metal Terraces Restaurants ice cream Perforated metal Architecture Public and leisure Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_hero-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2137857\" data-article-id=\"2137857\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_hero.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_hero-852x479.jpg\" alt=\"Buenos Aires white-metal ice cream shop\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_hero-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_hero-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eLocal studio DRM Arquitectura has designed a space-framed drive-through \u003ca href=\"https://www.dezeen.com/tag/ice-cream/\" target=\"_blank\" rel=\"noopener\"\u003eice cream parlour\u003c/a\u003e lifted on inverted V-shaped columns in \u003ca href=\"https://www.dezeen.com/tag/buenos-aires/\" target=\"_blank\" rel=\"noopener\"\u003eBuenos Aires\u003c/a\u003e, Argentina.\u003cspan id=\"more-2137857\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Veneciana Canning Ice Cream Drive Thru is situated on a busy roadside plot near National Route No. 58 that challenged the \u003ca href=\"https://drmarquitectura.com.ar/\" target=\"_blank\" rel=\"noopener\"\u003eDRM Arquitectura\u003c/a\u003e team to create a calm atmosphere without disconnecting from the fast access road.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2152949\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_11.jpg\" data-orientation=\"square\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_11-852x852.jpg\" alt=\"White metal structure building with red chairs in foregrond\" width=\"2364\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_11-852x852.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_11-1704x1704.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2152949\"\u003eDRM Arquitectura created an ice cream parlour in Buenos Aires\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFollowing the studio\u0026#39;s three-part design concept – product, person, place – the 300-square metre (3,230 square foot) parlour was a \u0026#34;quick-build roadside stop\u0026#34; that serves as an \u0026#34;announcement sign\u0026#34; for travellers in the bustling area.\u003c/p\u003e\n\u003cp\u003eThe building is raised on two inverted V-shaped white columns and two simple columns to make it more visible, free up the ground floor, and create a semi-covered terrace with a view of the La Esperanza Golf Club.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2152959\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_21.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_21-852x479.jpg\" alt=\"White metal structure building in Buenos Aires\" width=\"2364\" height=\"1330\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_21-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_21-1704x959.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2152959\"\u003eIt has a drive-thru and is situated off a busy strreet\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The metal structure is undoubtedly the protagonist of the space; making architecture from the structure is what we are passionate about,\u0026#34; the team said.\u003c/p\u003e\n\n\n\u003cp\u003eSet back from the perimeter of the building, the prefabricated columns create a large plan and absorb all of the horizontal load from the upper level, serving as the only link to the second story.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2152950\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_12.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_12-852x639.jpg\" alt=\"Patio with metal screen\" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_12-852x639.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_12-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2152950\"\u003eIt has a metal structure that creates a semi-covered terrace\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe furniture and staircase \u0026#34;hang\u0026#34; from the space frame while the bar and floating circular restroom \u0026#34;folds\u0026#34; up from the floor.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The ground floor proposes the dissolution of the building\u0026#39;s limits both as a commercial strategy, aiming not to create barriers of entry and as a strategy to anchor to an environment with attributes valuable to the landscape, which can be incorporated as part of the building’s architecture,\u0026#34; the team said.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2152947\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_9-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_9-852x1278.jpg\" alt=\"White metal ice cream parlour with playground in background\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_9-852x1278.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_9-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2152947\"\u003eThe staircase \u0026#34;hangs\u0026#34; from the steel structure\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eMeanwhile, the upper floor is wrapped in a perimeter terrace shaded by a series of pergolas that control light and open dining space to the sounds and sights of the city. The interior of the upper floor houses an isolated children\u0026#39;s play area.\u003c/p\u003e\n\u003cp\u003eA service tower – with mechanical equipment stacked on top of the staircase – adds a vertical counterpoint to the horizontal building that is nearly square in plan.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eIn order to expedite construction, the 15-tonne structural frame was prefabricated while the foundation was poured, and was transported to the site and hoisted into place.\u003c/p\u003e\n\u003cp\u003eTaking cues from the diagonal bracing in the trusses, the team replicated triangular patterns throughout the design including 45-degree patterns in the formwork of the precast white walls, perforated and sinusoidal white sheet metal, wood details, and welded tube ironwork.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2152951\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_13.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_13-852x426.jpg\" alt=\"Interior of ice cream parlour in Buenos Aires\" width=\"2364\" height=\"1182\" srcset=\"https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_13-852x426.jpg 1x, https://static.dezeen.com/uploads/2024/11/drm-architets-ice-cream-parlour-argentina_dezeen_2364_col_13-1704x852.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2152951\"\u003eMechanical systems and the metal ceiling were left exposed\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;Depending on the time of day, some diagonal patterns are illuminated, and others are not due to the concavities and convexities, generating permanent mutations in the facades,\u0026#34; the team said.\u003c/p\u003e\n\u003cp\u003eOther notable ice cream parlour designs include a \u003ca href=\"https://www.dezeen.com/2022/07/04/holky-rady-architekturu-jeste-jednu-brno-interior/\" target=\"_blank\" rel=\"noopener\"\u003ecompact Czech shop\u003c/a\u003e in Brno by Holky Rády Architeckturu, a blue-tiled \u0026#34;\u003ca href=\"https://www.dezeen.com/2020/03/28/little-sky-ice-cream-shop-interiors-melbourne/\" target=\"_blank\" rel=\"noopener\"\u003etheatre of gelato\u003c/a\u003e\u0026#34; in Melbourne by Ewert Leaf, and a \u003ca href=\"https://www.dezeen.com/2019/02/22/milk-train-london-ice-cream-instagrammable-interiors-shops-formroom-uk/\" target=\"_blank\" rel=\"noopener\"\u003eblack and white \u0026#34;Instagrammable\u0026#34; interior\u003c/a\u003e for a Milk Train shop in London by FormRoom.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://javieragustinrojas.com\" target=\"_blank\" rel=\"noopener\"\u003eJavier Agustin Rojas\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eProject credits:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eArchitect:\u003c/strong\u003e DRM Arquitectura\u003cbr/\u003e\u003cstrong\u003eTeam:\u003c/strong\u003e Dimaio Luciano, Rocca Nicolás, Muerza Esteban, Ramiro Barraza, Augusto Latzke Blake, Lautaro Egui, Giuliana Scatuerchio, Sofía Prytoluk, Ignacio Llaneza, Fabián Bruno, Ezequiel Basso, Florencia Chumbes, Lucía Binetti\u003cbr/\u003e\u003cstrong\u003eEngineering:\u003c/strong\u003e Andres Moscatelli\u003cbr/\u003e\u003cstrong\u003eConstruction:\u003c/strong\u003e Hernan Sotelo, Eduardo Tabaracci, Mauricio Chiarello\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"2410\" href=\"https://www.dezeen.com/tag/buenos-aires/\"\u003eBuenos Aires\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"2411\" href=\"https://www.dezeen.com/tag/argentina/\"\u003eArgentina\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"2572\" href=\"https://www.dezeen.com/tag/metal/\"\u003eMetal\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"2812\" href=\"https://www.dezeen.com/tag/terrace/\"\u003eTerraces\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3431\" href=\"https://www.dezeen.com/tag/restaurants/\"\u003eRestaurants\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6497\" href=\"https://www.dezeen.com/tag/ice-cream/\"\u003eice cream\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"7380\" href=\"https://www.dezeen.com/tag/perforated-metal/\"\u003ePerforated metal\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6036\" href=\"https://www.dezeen.com/architecture/public-and-leisure/\"\u003ePublic and leisure\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#8dfdffe4fbeceef4cde9e8f7e8e8e3a3eee2e0\"\u003e\u003cspan data-cfemail=\"7303011a0512100a3317160916161d5d101c1e\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-14T18:00:47Z",
  "modifiedTime": "2024-12-13T19:59:02Z"
}
