{
  "id": "f014b2b5-8f8b-49dd-88aa-cff5628e3633",
  "title": "Reading About Drawings",
  "link": "http://archidose.blogspot.com/2024/01/reading-about-drawings.html",
  "description": "",
  "author": "John Hill",
  "published": "2024-01-08T08:00:00.371-05:00",
  "source": "http://feeds.feedburner.com/archidose",
  "categories": [
    "mit press"
  ],
  "byline": "John Hill",
  "length": 7107,
  "excerpt": "Instead of digesting a new book or diving into a novel, something others do often but I do rarely, I spent my holiday break reading a five-y...",
  "siteName": "Blogger",
  "favicon": "",
  "text": "Instead of digesting a new book or diving into a novel, something others do often but I do rarely, I spent my holiday break reading a five-year-old book about a trio of intertwined topics I'm particularly fond of: drawings, exhibitions, and New York City.As the book's subtitle indicates, Drawing Architecture covers a two-decade period — the 1970s and 80s — when architectural drawings produced by contemporary architects increased in popularity: with architects, with museums, and with the wider art market. These decades, especially the 70s, are known for its so-called \"Paper Architecture,\" which arose due to architects encountering a glut of commissions and offsetting it through theorizing and exploring ideas on paper. Although Jordan Kauffman, a researcher at MIT when he wrote the book and now an assistant professor at the University of Nottingham, does not restrict himself to New York City, much of the book takes place there, given the city's role as the epicenter of the art market, the numerous art galleries holding exhibitions of architectural drawings, and the willingness of local architects to promote themselves through those galleries. These display spaces included Judith York Newman's Spaced: Gallery of Architecture, the Leo Castelli Gallery, and the Max Protetch Gallery. There were also a number of museums and other institutions in and beyond NYC — CCA, DAM, MoMA, Getty — that increased their holdings of architectural drawings, in turn increasing value of such drawings until around 1990. Then, as architects found themselves with more projects and computers entered the realm of architectural drawing, the two-decade trend came to an end.I missed Kauffman's book when it was released in 2018, though I have to disagree with George Baird's review published in Architectural Record at that time. He finds the thorough documentation and explanation of this important moment in recent history \"not completely satisfactory,\" due to the inability to grasp the individual drawings in the numerous photographs of gallery shows reproduced in black and white, as in the one below. Baird did appreciate the reproductions of individual drawings that are almost as numerous as the gallery photographs, but not enough to give the book a ringing endorsement. I'd counter that, since the book is about the galleries and institutions marketing and collecting the drawings rather than the drawings themselves, the illustrations selected for the book are ideal. They capture the seminal shows that led to the phenomenon that is the subject of Kauffman's book; without them, readers would be frustrated and have to rely on the author's extensive descriptions of the displays — descriptions that are important for the historical record but stultifying for narrative flow. (Kauffman also separately lists each piece in each seminal show, complete with values ascribed to the individual drawings.) Another review, by Paul Emmons at EAHN, is more gracious toward the book, calling it \"a primary resource on the history of the commodification of architectural drawing.\"Installation view of \"Architecture I\" exhibition at Leo Castelli Gallery, 1977 (Image source)Being a scourer of used bookstores and having a strong interest in the period explored by Kauffman, many of the museum exhibitions and gallery shows described in the book as \"seminal\" were known to me before I cracked it open last month. For example, the three \"Architecture\" shows held at Leo Castelli Gallery every three years between 1977 and 1983 were each accompanied by catalogs: the first one is short, unpaginated and stapled, but the second and third were published by Rizzoli, the publisher of choice for American postmodern architecture in the 1980s. Even though I'm familiar with these shows — and others, including Arthur Drexler's The Architecture of the École des Beaux-Arts (MoMA, 1975) and The Drawings of Antonio Gaudi by George R. Collins (The Drawing Center, 1977) — through their printed companions, Kauffman is able to elucidate considerably more information about the exhibitions themselves as well as how they relate to the publications. Architecture I, the catalog, would lead us now to assume that just a few drawings were in Architecture I, the exhibition, for each of the seven included architects (Raimund Abraham, Emilio Ambasz, Richard Meier, Walter Pichler, Aldo Rossi, James Stirling, Venturi and Rauch), but Kauffman reveals how misleading this assumption is, by describing the circumstances of the show, illustrating it through gallery shots like the one above, and exhaustively documenting what was on display. In this sense, Emmons' description of the book as \"a primary resource\" is spot-on.Covers of catalogs for three \"Architecture\" series exhibitions — \"Architecture I,\" \"Houses for Sale,\" \"Follies\" — held at Leo Castelli Gallery in 1977, 1980, and 1983, respectivelyWhile I found it rewarding to learn more about these and other exhibitions I had previous awareness of, Drawing on Architecture was not short on revealing new information to me. Take, for instance, Spaced, the gallery run by Judith York Newman, a name considerably less familiar all these years later than Castelli, Protetch, and the like. The first iteration of Spaced was located on the Upper West Side between 1975 and 1983, making it the first gallery in the city to display architectural drawings and therefore leading the way toward other art galleries doing the same. Although Newman was integral to the reception of architectural drawings in the period, as were Martha Beck, Barbara Jakobsen (aka B.J. Archer), and Pierre Apraxine, their names border on the forgotten, at least relative to the more famous gallerists mentioned above as well as Phyllis Lambert (CCA), Heinrich Klotz (DAM), and Kristin Feireiss (Aedes) outside of NYC. Drawing on Architecture therefore serves, in its focus, to give them much-deserved attention.The shift of architectural drawings toward art and as architecture in and of themselves can also be found in Drawing Ambience: Alvin Boyarsky and the Architectural Association, the exhibition and companion publication from 2015 about the drawings collected by Boyarsky when he was head of the AA in London. Although Boyarsky's two-decade directorship overlapped almost exactly with Kauffman's book, he is only touched on briefly. Instead, we learn a good deal about fellow Londoner Ben Weinreb, \"the most eminent antiquarian bookseller of architectural books, prints, and drawings,\" per Kauffman. Not only did he buy and sell drawings (many of them to Lambert at the CCA), making him relevant to Drawing on Architecture, he produced 58 catalogs over the course of four decades: catalogs that \"set new standards for cataloging and connoisseurship,\" in Kauffman's words. The value of Drawing on Architecture is in discovering about Weinreb and other lesser-known players, carried out through exhaustive research and scholarship, but it is also found in the vivid portrait of 1970s/80s New York, when the architecture and art scenes overlapped and converged, unlike any times before then or since.",
  "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCNLGpx_kzs-uWVKWSF1t9-AepmCKTZRY8fPmZYMjAG491XU9U0zDNz-0DdcxvhdpqKiH1AsNxPUb2GlNLoTEzKjXMWgQOPHDDstDnM4kV_u1PRnY79kCxh4JOiSIVC0VLH-4RB5bBF6CUiSjY5z0iHdtn6_p_p_73vAfIjW6kRZerbnN5EbRU/w1200-h630-p-k-no-nu/drawings1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"post-body-1726506032525559959\"\u003e\u003cp\u003e\nInstead of digesting a new book or diving into a novel, something others do often but I do rarely, I spent my holiday break reading a five-year-old book about a trio of intertwined topics I\u0026#39;m particularly fond of: drawings, exhibitions, and New York City.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCNLGpx_kzs-uWVKWSF1t9-AepmCKTZRY8fPmZYMjAG491XU9U0zDNz-0DdcxvhdpqKiH1AsNxPUb2GlNLoTEzKjXMWgQOPHDDstDnM4kV_u1PRnY79kCxh4JOiSIVC0VLH-4RB5bBF6CUiSjY5z0iHdtn6_p_p_73vAfIjW6kRZerbnN5EbRU/s1000/drawings1.jpg\"\u003e\u003cimg alt=\"\" data-original-height=\"1000\" data-original-width=\"775\" height=\"600\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCNLGpx_kzs-uWVKWSF1t9-AepmCKTZRY8fPmZYMjAG491XU9U0zDNz-0DdcxvhdpqKiH1AsNxPUb2GlNLoTEzKjXMWgQOPHDDstDnM4kV_u1PRnY79kCxh4JOiSIVC0VLH-4RB5bBF6CUiSjY5z0iHdtn6_p_p_73vAfIjW6kRZerbnN5EbRU/s600/drawings1.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eAs the book\u0026#39;s subtitle indicates, \u003ci\u003eDrawing Architecture\u003c/i\u003e covers a two-decade period — the 1970s and 80s — when architectural drawings produced by contemporary architects increased in popularity: with architects, with museums, and with the wider art market. These decades, especially the 70s, are known for its so-called \u0026#34;Paper Architecture,\u0026#34; which arose due to architects encountering a glut of commissions and offsetting it through theorizing and exploring ideas on paper. Although Jordan Kauffman, a researcher at MIT when he wrote the book and now an assistant professor at the University of Nottingham, does not restrict himself to New York City, much of the book takes place there, given the city\u0026#39;s role as the epicenter of the art market, the numerous art galleries holding exhibitions of architectural drawings, and the willingness of local architects to promote themselves through those galleries. These display spaces included Judith York Newman\u0026#39;s Spaced: Gallery of Architecture, the Leo Castelli Gallery, and the Max Protetch Gallery. There were also a number of museums and other institutions in and beyond NYC — CCA, DAM, MoMA, Getty — that increased their holdings of architectural drawings, in turn increasing value of such drawings until around 1990. Then, as architects found themselves with more projects and computers entered the realm of architectural drawing, the two-decade trend came to an end.\u003c/p\u003e\u003cp\u003eI missed Kauffman\u0026#39;s book when it was released in 2018, though I have to disagree with \u003ca href=\"https://www.architecturalrecord.com/articles/13724-drawing-on-architecture-the-object-of-lines-1970-1990\" target=\"_blank\"\u003eGeorge Baird\u0026#39;s review published in \u003ci\u003eArchitectural Record\u003c/i\u003e\u003c/a\u003e at that time. He finds the thorough documentation and explanation of this important moment in recent history \u0026#34;not completely satisfactory,\u0026#34; due to the inability to grasp the individual drawings in the numerous photographs of gallery shows reproduced in black and white, as in the one below. Baird did appreciate the reproductions of individual drawings that are almost as numerous as the gallery photographs, but not enough to give the book a ringing endorsement. I\u0026#39;d counter that, since the book is about the galleries and institutions marketing and collecting the drawings rather than the drawings themselves, the illustrations selected for the book are ideal. They capture the seminal shows that led to the phenomenon that is the subject of Kauffman\u0026#39;s book; without them, readers would be frustrated and have to rely on the author\u0026#39;s extensive descriptions of the displays — descriptions that are important for the historical record but stultifying for narrative flow. (Kauffman also separately lists each piece in each seminal show, complete with values ascribed to the individual drawings.) Another review, by \u003ca href=\"https://journal.eahn.org/article/id/7577/\" target=\"_blank\"\u003ePaul Emmons at EAHN\u003c/a\u003e, is more gracious toward the book, calling it \u0026#34;a primary resource on the history of the commodification of architectural drawing.\u0026#34;\u003c/p\u003e\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh5TTnfb3BxPKYYHEwalGTAVZrIz908woGKDj_NddQwm43d3zrP3df191ZPEtR9E_sXWFrbczx6WGSh1XiBoHe2B2F8FcUaRLvR4hKtLy4mBZ7E82ZaO9u_CUAlrvOz6GI3IFdFdtPwZa4gMtmoGpuTI7-nzg8XjhByGeIM_v4qxm8gN45OqroF/s1195/drawings2.jpg\"\u003e\u003cimg alt=\"\" data-original-height=\"700\" data-original-width=\"1195\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh5TTnfb3BxPKYYHEwalGTAVZrIz908woGKDj_NddQwm43d3zrP3df191ZPEtR9E_sXWFrbczx6WGSh1XiBoHe2B2F8FcUaRLvR4hKtLy4mBZ7E82ZaO9u_CUAlrvOz6GI3IFdFdtPwZa4gMtmoGpuTI7-nzg8XjhByGeIM_v4qxm8gN45OqroF/s600/drawings2.jpg\" width=\"600\"/\u003e\u003c/a\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e\u003cp\u003e\u003ci\u003eInstallation view of \u0026#34;Architecture I\u0026#34; exhibition at Leo Castelli Gallery, 1977 (\u003ca href=\"https://www.castelligallery.com/exhibitions/architecture-i\" target=\"_blank\"\u003eImage source\u003c/a\u003e)\u003c/i\u003e\u003c/p\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eBeing a scourer of used bookstores and having a strong interest in the period explored by Kauffman, many of the museum exhibitions and gallery shows described in the book as \u0026#34;seminal\u0026#34; were known to me before I cracked it open last month. For example, the three \u0026#34;Architecture\u0026#34; shows held at Leo Castelli Gallery every three years between 1977 and 1983 were each accompanied by catalogs: \u003ca href=\"https://www.castelligallery.com/publications/architecture-i\" target=\"_blank\"\u003ethe first one\u003c/a\u003e is short, unpaginated and stapled, but the second and third were published by Rizzoli, \u003ci\u003ethe \u003c/i\u003epublisher of choice for American postmodern architecture in the 1980s. Even though I\u0026#39;m familiar with these shows — and others, including Arthur Drexler\u0026#39;s \u003ci\u003e\u003ca href=\"https://www.moma.org/calendar/exhibitions/2483\" target=\"_blank\"\u003eThe Architecture of the École des Beaux-Arts\u003c/a\u003e\u003c/i\u003e (MoMA, 1975) and \u003ci\u003e\u003ca href=\"https://drawingcenter.org/exhibitions/the-drawings-of-antonio-gaudi\" target=\"_blank\"\u003eThe Drawings of Antonio Gaudi\u003c/a\u003e\u003c/i\u003e by George R. Collins (The Drawing Center, 1977) — through their printed companions, Kauffman is able to elucidate considerably more information about the exhibitions themselves as well as how they relate to the publications. \u003ci\u003eArchitecture I\u003c/i\u003e, the catalog, would lead us now to assume that just a few drawings were in \u003ca href=\"https://www.castelligallery.com/exhibitions/architecture-i\" target=\"_blank\"\u003e\u003ci\u003eArchitecture I\u003c/i\u003e, the exhibition\u003c/a\u003e, for each of the seven included architects (Raimund Abraham, Emilio Ambasz, Richard Meier, Walter Pichler, Aldo Rossi, James Stirling, Venturi and Rauch), but Kauffman reveals how misleading this assumption is, by describing the circumstances of the show, illustrating it through gallery shots like the one above, and exhaustively documenting what was on display. In this sense, Emmons\u0026#39; description of the book as \u0026#34;a primary resource\u0026#34; is spot-on.\u003c/p\u003e\u003cdiv\u003e\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003ca href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhAz0IwbZx-yAX2sDX3X1pb1GSWMAtSms5g4LhourYrUbWFuGZOF2PpsIfY11oKHjD1se3f9WT5K4laK_PVgZJ-AZ2DdquJRsrQ6qSeXerlmetC7lXwMXLwz8vRiY-UeopoWfIZOg7F09kMD1CpHJM8i2Xfax-u8JUlBne5UZINp5jdM7C4OkeW/s1600/drawings3.jpg\"\u003e\u003cimg alt=\"\" data-original-height=\"700\" data-original-width=\"1600\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhAz0IwbZx-yAX2sDX3X1pb1GSWMAtSms5g4LhourYrUbWFuGZOF2PpsIfY11oKHjD1se3f9WT5K4laK_PVgZJ-AZ2DdquJRsrQ6qSeXerlmetC7lXwMXLwz8vRiY-UeopoWfIZOg7F09kMD1CpHJM8i2Xfax-u8JUlBne5UZINp5jdM7C4OkeW/s600/drawings3.jpg\" width=\"600\"/\u003e\u003c/a\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003e\u003ci\u003eCovers of catalogs for three \u0026#34;Architecture\u0026#34; series exhibitions — \u0026#34;Architecture I,\u0026#34; \u0026#34;Houses for Sale,\u0026#34; \u0026#34;Follies\u0026#34; — held at Leo Castelli Gallery in 1977, 1980, and 1983, respectively\u003c/i\u003e\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003eWhile I found it rewarding to learn more about these and other exhibitions I had previous awareness of, \u003ci\u003eDrawing on Architecture\u003c/i\u003e was not short on revealing new information to me. Take, for instance, Spaced, the gallery run by Judith York Newman, a name considerably less familiar all these years later than Castelli, Protetch, and the like. The first iteration of Spaced was located on the Upper West Side between 1975 and 1983, making it the first gallery in the city to display architectural drawings and therefore leading the way toward other art galleries doing the same. Although Newman was integral to the reception of architectural drawings in the period, as were Martha Beck, Barbara Jakobsen (aka B.J. Archer), and Pierre Apraxine, their names border on the forgotten, at least relative to the more famous gallerists mentioned above as well as Phyllis Lambert (CCA), Heinrich Klotz (DAM), and Kristin Feireiss (Aedes) outside of NYC. \u003ci\u003eDrawing on Architecture\u003c/i\u003e therefore serves, in its focus, to give them much-deserved attention.\u003c/p\u003e\u003cp\u003eThe shift of architectural drawings toward art and as architecture in and of themselves can also be found in \u003ci\u003e\u003ca href=\"https://archidose.blogspot.com/2021/02/drawing-ambience.html\"\u003eDrawing Ambience: Alvin Boyarsky and the Architectural Association\u003c/a\u003e\u003c/i\u003e, the exhibition and companion publication from 2015 about the drawings collected by Boyarsky when he was head of the AA in London. Although Boyarsky\u0026#39;s two-decade directorship overlapped almost exactly with Kauffman\u0026#39;s book, he is only touched on briefly. Instead, we learn a good deal about fellow Londoner Ben Weinreb, \u0026#34;the most eminent antiquarian bookseller of architectural books, prints, and drawings,\u0026#34; per Kauffman. Not only did he buy and sell drawings (many of them to Lambert at the CCA), making him relevant to \u003ci\u003eDrawing on Architecture\u003c/i\u003e, he produced \u003ca href=\"https://www.robinhalwas.com/114000-ben-weinreb-stock-catalogues\" target=\"_blank\"\u003e58 catalogs\u003c/a\u003e over the course of four decades: catalogs that \u0026#34;set new standards for cataloging and connoisseurship,\u0026#34; in Kauffman\u0026#39;s words. The value of \u003ci\u003eDrawing on Architecture \u003c/i\u003eis in discovering about Weinreb and other lesser-known players, carried out through exhaustive research and scholarship, but it is also found in the vivid portrait of 1970s/80s New York, when the architecture and art scenes overlapped and converged, unlike any times before then or since.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-01-08T08:00:00-05:00",
  "modifiedTime": null
}
