{
  "id": "fc3942c6-294c-4230-8917-c7204537b3de",
  "title": "One month later, how are architects, artists, and policy experts in North Carolina and Tennessee responding to Hurricane Helene?",
  "link": "https://www.archpaper.com/2024/10/architects-artists-policy-experts-north-carolina-tennessee-hurricane-helene/",
  "description": "More than 100 North Carolinians died during Hurricane Helene last month, and thousands more were displaced. In Tennessee, the disaster claimed almost 20 lives. Entire energy systems and even towns The post One month later, how are architects, artists, and policy experts in North Carolina and Tennessee responding to Hurricane Helene? appeared first on The Architect’s Newspaper.",
  "author": "Daniel Jonas Roche",
  "published": "Tue, 22 Oct 2024 19:11:39 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Architecture",
    "News",
    "Southeast",
    "Disaster Relief",
    "Hurricanes",
    "North Carolina",
    "Reconstruction",
    "Tennessee"
  ],
  "byline": "Daniel Jonas Roche",
  "length": 9643,
  "excerpt": "Many North Carolina and Tennessee towns were wiped out by Hurricane Helene. Now, people in western North Carolina and eastern Tennessee are regrouping, and thinking about how to rebuild after Hurricane Helene for both the short and long term.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "More than 100 North Carolinians died during Hurricane Helene last month, and thousands more were displaced. In Tennessee, the disaster claimed almost 20 lives. Entire energy systems and even towns in Appalachia “washed away” as folks in those parts put it. “We’re still in search and recovery mode,” shared Ashley Cates, AIA Tennessee executive vice president.  Indeed, Hurricane Helene dispelled a longstanding myth that inland “climate havens” far from the coasts are somehow insulated from rising sea levels. It served as a chilling reminder that we’re all in this one together and that, when it comes to global warming, nowhere is safe.  “I don’t think we’re going to know the damage’s full extent for some time,” David Crawford, executive president of AIA North Carolina, told AN. “But the flooding we saw in the rivers and tributaries of North Carolina’s mountains has never been as widespread as this. Climate scientists never anticipated this much water in such a short period of time.”  A cleanup crew in Marshall, North Carolina (Jack Flame Sorokin) “My sister’s basement in Elizabethton is totally flooded,” added Cameron Bolin, president-elect of AIA East Tennessee. “Right now, the immediate need is to get water out of people’s houses, and things like that. But we’re also thinking more broadly about how to build back better.”  “One Big Project” Among the North Carolina towns wiped out by Hurricane Helene were Asheville, Swannanoa, Black Mountain, Chimney Rock, Marshall, Hot Springs, Burnsville, Spruce Pine, and others. Now, people in western North Carolina and eastern Tennessee like Bolin are regrouping, and thinking about how to rebuild for both the short and long term.  Architects may be familiar with Black Mountain, North Carolina, thanks to Black Mountain College—the avant-garde design school where Anni and Josef Albers, Walter Gropius, Merce Cunningham, and Buckminster Fuller all taught. But an equally enthralling, albeit lesser known, Appalachian town impacted by Hurricane Helene is Marshall, North Carolina—a regional arts haven known for its picturesque main street. “Marshall is on the National Register of Historic Places. Our downtown is beautiful; it’s basically a time capsule,” said Josh Copus, an artist and small business owner based in Marshall. “Every business in downtown Marshall was effectively destroyed by the flood, but we think this town is worth saving.” Not long ago, Copus and his friends bought an old jail house in Marshall and converted it into a restaurant, hotel, and museum. During Hurricane Helene, water went all the way up to the second story of Copus’s business. Thankfully, the old jail—which Copus jovially said was “built like a brick shithouse”—has good bones, so it remained somewhat intact. Many of his neighbors however weren’t so lucky. Marshall, North Carolina, before Hurricane Helene (Jack Flame Sorokin) Today in Marshall, Copus has started a fundraiser to help fix his building, and residents are trying to figure out how to bounce back from political and natural disasters beyond their control, something that they’re sadly used to. The town of about 800 people was once a thriving commercial destination thanks to its location along an interstate highway. That stayed true until the 1960s when planners rerouted it. This brought traffic in Marshall to a standstill, shuttering businesses. Marshall stagnated for years until artists like Copus started moving there, opening up shops, restaurants, and studios. But just when things seemed like they were on the up and up, Hurricane Helene came to town. Nevertheless, Copus, who grew up in Appalachia, said optimism runs high in the place he calls home. “What’s happening here isn’t a story of destruction. It’s a story of human resilience,” he elaborated. “We’re thinking about rebuilding Marshall as one big project, as opposed to a bunch of disparate projects.” Marshall’s riverfront (Jack Flame Sorokin) Politics as Usual? Moving forward, troubling questions linger. David Crawford is concerned about how reconstruction will be financed given that the wide majority of homeowners in the region don’t have flood insurance. Madison County, North Carolina’s high altitude and distance from the coast made hurricanes an afterthought, until now.  “These towns that washed away,” Crawford said wearily, “what are they going to do? Can they be rebuilt? More than 80, or even 90 percent of people in these areas aren’t going to have the money to rebuild. So what happens?”  “This is not a region where people expected to be hit really hard,” said Sarah​​​​ Labowitz, a Washington Post contributor and nonresident scholar at Carnegie Endowment for International Peace’s Sustainability, Climate and Geopolitics program. Labowitz has studied the U.S. federal government’s responses to natural disasters for some time now. She spent years working for the City of Houston after Hurricane Harvey. In her research, Labowitz noticed smaller scale disasters that aren’t big enough to have their own names still wreak billions of dollars of havoc but often go unnoticed in the press.  Marshall, North Carolina, after Hurricane Helene (Jack Flame Sorokin) (Jack Flame Sorokin) “The images that typically come up of natural disasters are of big hurricanes, like Helene or Harvey,” Labowitz shared. “But if you look at the Disaster Dollar Database that shows where in the U.S. people are applying for help from FEMA, it’s coming from places like Michigan and Illinois too.” Labowitz continued: “Roughly 250,000 people in Michigan applied for help from unnamed flooding and storms last year. And about 100,000 people applied from Illinois.” For Labowitz, a big question is how people without flood insurance—or deep pockets—can rebuild in ways that take weeks, not years. And there’s also this other elephant in the room: The impending U.S. presidential election. “The primary program for covering low- and middle-income households that don’t have insurance is HUD’s Community Development Grant-Disaster Recovery. This is where the majority of reconstruction funding will have to come from, while other smaller sources will be private philanthropy and nonprofits,” Labowitz added. “Unlike FEMA, HUD’s spending has to be approved by Congress. So the big question is when and how much funding will be authorized by Congress for people who need it.” Marshall, North Carolina, in the weeks after Hurricane Helene (Jack Flame Sorokin) Deregulation and its Discontents In Tennessee, Cates said that the state’s AIA chapter has a memorandum of understanding (MOU) with TNSave for damage control. Together, AIA Tennessee and TNSave are conducting building assessments and coordinating disaster response. Cates also said that AIA Tennessee is in contact with Tennessee Emergency Management Agency (TEMA) and Volunteer Tennessee for relief efforts. “We’re reaching out to members to make sure they’re okay, and that they and their communities have what they need,” Cates said. Crawford, who’s based in Raleigh, noted that, like so many natural disasters, Hurricane Helene brought into focus structural issues afflicting his community. More specifically, it highlighted the lack of building regulations that could have lessened the magnitude of such a catastrophe. “We’ve got a lot of people in North Carolina that are very unhappy with the Home Builders Association because for many, many years, they have ruled the roost,” Crawford said.  “[Home Builders Associations] stopped the modernization of our building codes,” Crawford continued. “Are we pointing fingers directly at them for the damage that has been caused? No. But there are things that could have been done in the building codes the last ten years or so, especially in areas with steep slopes and hillsides, that maybe should have been passed that were not passed because of [Home Builders Association] interference.” Asheville before Hurricane Helene (Jack Flame Sorokin) Cameron Bolin, based in Knoxville, echoed Crawford’s concerns. “Many of the towns that were impacted don’t even have building or zoning codes,” Bolin said. “There’s a sentiment in the mountains of ‘You can’t tell me what to do or how to build.’ Lots of people don’t even hire architects and just use general contractors instead. So they end up spending their money on something that’s subpar, and not in the spirit of health, safety and welfare that we want as architects to provide.” Cates in turn agreed with the need for garnering trust between architects, politicians, and the rural communities she hopes to serve. “I grew up in southern middle Tennessee,” she said. “It’s one of those places where people don’t like to be told how to build, right? But it’s really unfortunate when this mentality starts to impact the livelihood of residents. People are starting to wake up however and realize the impact that this mindset can have.” Residents of Marshall, North Carolina discussing reconstruction (Jack Flame Sorokin) What does building trust look like? In Tennessee, Cates and Bolin have helped create workshops for people to learn how to negotiate with contractors and apply for building permits. But AIA Tennessee’s work doesn’t stop there.  “We have chapter members who are massively ingrained in policy in regard to building codes and housing,” Bolin shared. “So this is one focus area I can see us getting more involved in, updating building codes to prevent construction in flood plains, and so forth. We’re going to help spread awareness about best practices, but also try to influence municipalities and legislation in regard to policy. It’s a massive goal, but it’s a long-term goal.”",
  "image": "https://www.archpaper.com/wp-content/uploads/2024/10/JFS9404.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003eMore than 100 \u003ca href=\"https://www.archpaper.com/tag/north-carolina/\"\u003eNorth Carolinians\u003c/a\u003e died during \u003ca href=\"https://www.archpaper.com/tag/hurricanes/\"\u003eHurricane Helene\u003c/a\u003e last month, and thousands more were displaced. In \u003ca href=\"https://www.archpaper.com/tag/tennessee/\"\u003eTennessee\u003c/a\u003e, the \u003ca href=\"https://www.archpaper.com/tag/disaster-relief/\"\u003edisaster\u003c/a\u003e claimed almost 20 lives. Entire energy systems and even towns in Appalachia “washed away” as folks in those parts put it. “We’re still in search and recovery mode,” shared Ashley Cates, AIA Tennessee executive vice president. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003eIndeed, Hurricane Helene dispelled a longstanding myth that inland “\u003c/span\u003e\u003ca href=\"https://www.bpr.org/news/2021-03-16/come-hell-or-high-water-asheville-is-climate-winner\"\u003e\u003cspan\u003eclimate havens\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e” far from the coasts are somehow insulated from rising sea levels. It served as a chilling reminder that we’re all in this one together and that, when it comes to global warming, nowhere is safe.\u003c/span\u003e\u003cb\u003e \u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“I don’t think we’re going to know the damage’s full extent for some time,” David Crawford, executive president of AIA North Carolina, told \u003c/span\u003e\u003ci\u003e\u003cspan\u003eAN\u003c/span\u003e\u003c/i\u003e\u003cspan\u003e. “But the flooding we saw in the rivers and tributaries of North Carolina’s mountains has never been as widespread as this. Climate scientists never anticipated this much water in such a short period of time.” \u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384897\" aria-describedby=\"caption-attachment-384897\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/DSC4379.jpg\" alt=\"people removing water in Marshall, North Carolina\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384897\"\u003eA cleanup crew in Marshall, North Carolina (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003e“My sister’s basement in Elizabethton is totally flooded,” added Cameron Bolin, president-elect of AIA East Tennessee. “Right now, the immediate need is to get water out of people’s houses, and things like that. But we’re also thinking more broadly about how to build back better.” \u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e“One Big Project”\u003c/h3\u003e\n\u003cp\u003e\u003cspan\u003eAmong the North Carolina towns wiped out by Hurricane Helene were Asheville, Swannanoa, Black Mountain, Chimney Rock, Marshall, Hot Springs, Burnsville, Spruce Pine, and others. Now, people in western North Carolina and eastern Tennessee like Bolin are regrouping, and thinking about how to rebuild for both the short and long term. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eArchitects may be familiar with Black Mountain, North Carolina, thanks to Black Mountain College—the avant-garde design school where Anni and Josef Albers, Walter Gropius, Merce Cunningham, and Buckminster Fuller all taught. But an equally enthralling, albeit lesser known, Appalachian town impacted by Hurricane Helene is Marshall, North Carolina—a regional arts haven known for its picturesque main street.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e“Marshall is on the National Register of Historic Places. Our downtown is beautiful; it’s basically a time capsule,” said Josh Copus, an artist and small business owner based in Marshall. “Every business in downtown Marshall was effectively destroyed by the flood, but we think this town is worth saving.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNot long ago, Copus and his friends bought an old jail house in Marshall and converted it into a \u003ca href=\"https://oldmarshalljail.com/\"\u003erestaurant, hotel, and museum\u003c/a\u003e. During Hurricane Helene, water went all the way up to the second story of Copus’s business. Thankfully, the old jail—which Copus jovially said was “built like a brick shithouse”—has good bones, so it remained somewhat intact. Many of his neighbors however weren’t so lucky.\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384899\" aria-describedby=\"caption-attachment-384899\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/DSC6493.jpg\" alt=\"aerial view of Marshall, North Carolina\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384899\"\u003eMarshall, North Carolina, before Hurricane Helene (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eToday in Marshall, Copus has started a \u003ca href=\"https://www.gofundme.com/f/help-rebuild-the-old-marshall-jail-and-zadies-restaurant\"\u003efundraiser to help fix his building\u003c/a\u003e, and residents are trying to figure out how to bounce back from political and natural disasters beyond their control, something that they’re sadly used to.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe town of about 800 people was once a thriving commercial destination thanks to its location along an interstate highway. That stayed true until the 1960s when planners rerouted it. This brought traffic in Marshall to a standstill, shuttering businesses.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003eMarshall stagnated for years until artists like Copus started moving there, opening up shops, restaurants, and studios. \u003c/span\u003e\u003cspan\u003eBut just when things seemed like they were on the up and up, Hurricane Helene came to town. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eNevertheless, Copus, who grew up in Appalachia, said optimism runs high in the place he calls home. “What’s happening here isn’t a story of destruction. It’s a story of human resilience,” he elaborated. “We’re thinking about rebuilding Marshall as one big project, as opposed to a bunch of disparate projects.”\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384898\" aria-describedby=\"caption-attachment-384898\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/DSC4726.jpg\" alt=\"Marshall, North Carolina\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384898\"\u003eMarshall’s riverfront (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch3\u003ePolitics as Usual?\u003c/h3\u003e\n\u003cp\u003e\u003cspan\u003eMoving forward, troubling questions linger. David Crawford is concerned about how \u003ca href=\"https://www.archpaper.com/tag/reconstruction/\"\u003ereconstruction\u003c/a\u003e will be financed given that the wide majority of homeowners in the region don’t have flood insurance. Madison County, North Carolina’s high altitude and distance from the coast made hurricanes an afterthought, until now. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“These towns that washed away,” Crawford said wearily, “what are they going to do? Can they be rebuilt? More than 80, or even 90 percent of people in these areas aren’t going to have the money to rebuild. So what happens?” \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e“This is not a region where people expected to be hit really hard,” said Sarah​​​​ Labowitz, a \u003cem\u003eWashington Post\u003c/em\u003e contributor and nonresident scholar at Carnegie Endowment for International Peace’s Sustainability, Climate and Geopolitics program.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLabowitz has studied the \u003ca href=\"https://www.washingtonpost.com/opinions/2024/10/18/hurricane-disaster-recovery-helene-milton/\"\u003eU.S. federal government’s responses to natural disasters\u003c/a\u003e for some time now. She spent years working for the City of Houston after Hurricane Harvey. In her research, Labowitz noticed smaller scale disasters that aren’t big enough to have their own names still wreak billions of dollars of havoc but often go unnoticed in the press. \u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384905\" aria-describedby=\"caption-attachment-384905\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/JFS9651.jpg\" alt=\"a street completely washed away by Hurricane Helene \" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384905\"\u003eMarshall, North Carolina, after Hurricane Helene (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cfigure id=\"attachment_384904\" aria-describedby=\"caption-attachment-384904\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/JFS9529.jpg\" alt=\"a street completely washed away by Hurricane Helene\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384904\"\u003e(Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003e“The images that typically come up of natural disasters are of big hurricanes, like Helene or Harvey,” Labowitz shared. “But if you look at the \u003ca href=\"https://carnegieendowment.org/research/2024/08/disaster-dollar-database\"\u003eDisaster Dollar Database\u003c/a\u003e that shows where in the U.S. people are applying for help from FEMA, it’s coming from places like Michigan and Illinois too.” Labowitz continued: “Roughly 250,000 people in Michigan applied for help from unnamed flooding and storms last year. And about 100,000 people applied from Illinois.”\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003eFor Labowitz, a big question is how people without flood insurance—or deep pockets—can rebuild in ways that take weeks, not years. And there’s also this other elephant in the room: The impending U.S. presidential election.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“The primary program for covering low- and middle-income households that don’t have insurance is \u003ca href=\"https://www.hud.gov/program_offices/comm_planning/cdbg-dr\"\u003eHUD’s Community Development Grant-Disaster Recovery\u003c/a\u003e. This is where the majority of reconstruction funding will have to come from, while other smaller sources will be private philanthropy and nonprofits,” Labowitz added. “Unlike FEMA, HUD’s spending has to be approved by Congress. So the big question is when and how much funding will be authorized by Congress for people who need it.”\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384907\" aria-describedby=\"caption-attachment-384907\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/JFS9661.jpg\" alt=\"destroyed buildings in north Caroline\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384907\"\u003eMarshall, North Carolina, in the weeks after Hurricane Helene (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch3\u003eDeregulation and its Discontents\u003c/h3\u003e\n\u003cp\u003e\u003cspan\u003eIn Tennessee, Cates said that the state’s AIA chapter has a memorandum of understanding (MOU) with \u003c/span\u003e\u003ca href=\"https://aiatn.us7.list-manage.com/track/click?u=47850ee620cdb67d1fd746829\u0026amp;id=83628495c4\u0026amp;e=dfc053a4d0\"\u003e\u003cspan\u003eTNSave\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for damage control. Together, AIA Tennessee and TNSave are conducting building assessments and coordinating disaster response. Cates also said that AIA Tennessee is in contact with Tennessee Emergency Management Agency (TEMA) and \u003c/span\u003e\u003ca href=\"https://aiatn.us7.list-manage.com/track/click?u=47850ee620cdb67d1fd746829\u0026amp;id=56aedca50d\u0026amp;e=dfc053a4d0\"\u003e\u003cspan\u003eVolunteer Tennessee\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for relief efforts. “We’re reaching out to members to make sure they’re okay, and that they and their communities have what they need,” Cates said.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003eCrawford, who’s based in Raleigh, noted that, like so many natural disasters, Hurricane Helene brought into focus structural issues afflicting his community. More specifically, it highlighted the lack of building regulations that could have lessened the magnitude of such a catastrophe. “We’ve got a lot of people in North Carolina that are \u003c/span\u003e\u003ca href=\"https://www.nytimes.com/2024/10/03/climate/north-carolina-homes-helene-building-codes.html\"\u003e\u003cspan\u003every unhappy with the Home Builders Association\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e because for many, many years, they have ruled the roost,” Crawford said. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“[Home Builders Associations] stopped the modernization of our building codes,” Crawford continued. “Are we pointing fingers directly at them for the damage that has been caused? No. But there are things that could have been done in the building codes the last ten years or so, especially in areas with steep slopes and hillsides, that maybe should have been passed that were not passed because of [Home Builders Association] interference.”\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384900\" aria-describedby=\"caption-attachment-384900\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/DSC7144.jpg\" alt=\"downtown Asheville, North Carolina prior to Hurricane Helene\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384900\"\u003eAsheville before Hurricane Helene (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eCameron Bolin, based in Knoxville, echoed Crawford’s concerns. “Many of the towns that were impacted don’t even have building or zoning codes,” Bolin said. “There’s a sentiment in the mountains of ‘You can’t tell me what to do or how to build.’ Lots of people don’t even hire architects and just use general contractors instead. So they end up spending their money on something that’s subpar, and not in the spirit of health, safety and welfare that we want as architects to provide.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eCates in turn agreed with the need for garnering trust between architects, politicians, and the rural communities she hopes to serve. “I grew up in southern middle Tennessee,” she said. “It’s one of those places where people don’t like to be told how to build, right? But it’s really unfortunate when this mentality starts to impact the livelihood of residents. People are starting to wake up however and realize the impact that this mindset can have.”\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384901\" aria-describedby=\"caption-attachment-384901\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/JFS0062.jpg\" alt=\"a group of people in Marshall, North Carolina discusses cleanup and reconstruction efforts\" width=\"1700\" height=\"1133\"/\u003e\u003cfigcaption id=\"caption-attachment-384901\"\u003eResidents of Marshall, North Carolina discussing reconstruction (Jack Flame Sorokin)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eWhat does building trust look like? In Tennessee, Cates and Bolin have helped create workshops for people to learn how to negotiate with contractors and apply for building permits. But AIA Tennessee’s work doesn’t stop there. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“We have chapter members who are massively ingrained in policy in regard to building codes and housing,” Bolin shared. “So this is one focus area I can see us getting more involved in, updating building codes to prevent construction in flood plains, and so forth. We’re going to help spread awareness about best practices, but also try to influence municipalities and legislation in regard to policy. It’s a massive goal, but it’s a long-term goal.”\u003c/span\u003e\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-10-22T19:11:39Z",
  "modifiedTime": "2024-10-22T20:41:29Z"
}
