[
  {
    "id": "a42f7271-9d7e-40e6-aaa2-e308414ecaee",
    "title": "NARS Light Reflecting Luminizing Powder + Afterglow Lip Shine (New Shades)",
    "link": "https://thebeautylookbook.com/2025/06/nars-light-reflecting-luminizing-powder-afterglow-lip-shine-new-shades.html",
    "description": "NARS Light Reflecting Luminizing Powder + Afterglow Lip Shine (New Shades). Sharing a look at the latest launches from NARS.",
    "author": "Sabrina",
    "published": "Thu, 19 Jun 2025 19:02:08 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/06/New-NARS-Afterglow-Lip-Shine-Gloss-Light-Reflecting-Highlighters.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/nars' target='_blank' style='color:currentColor;text-decoration:none;'\u003eNARS\u003c/a\u003e",
      "NARS"
    ]
  },
  {
    "id": "ba7a64e0-8704-4140-b196-bf1825fb039b",
    "title": "New Prada Beauty Launches",
    "link": "https://thebeautylookbook.com/2025/06/new-prada-beauty-launches.html",
    "description": "New Prada Beauty Launches. A look at the new highlighters, lip oil stick and eyeshadow palettes from Prada.",
    "author": "Sabrina",
    "published": "Tue, 17 Jun 2025 17:56:42 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/06/PradaBeauty-Light-Glowing-Lip-Oil-Stick-Highlighter.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/highlighter' target='_blank' style='color:currentColor;text-decoration:none;'\u003eHighlighters\u003c/a\u003e"
    ]
  },
  {
    "id": "8672b8fc-8efe-48b7-b940-d44496b97617",
    "title": "The Unexpected Perfume Notes Set to Dominate Summer 2025",
    "link": "https://www.elle.com/beauty/a65104421/summer-perfume-trends-2025/",
    "description": "Vanilla and musks for summer? Hear me out.",
    "author": "",
    "published": "Thu, 26 Jun 2025 21:44:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "8356cc0f-e0e5-4db3-a696-d1569f063560",
    "title": "The Hair Wax Sticks ELLE Beauty Editors Actually Use for Sleek Styles",
    "link": "https://www.elle.com/beauty/hair/g42231298/best-hair-wax-sticks/",
    "description": "The key to model-off-duty updos.",
    "author": "",
    "published": "Thu, 26 Jun 2025 21:38:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "1138d125-e8f2-4312-9881-65cf193a91e5",
    "title": "DEI Is Good for Business, According to Beauty's Buzziest Investors",
    "link": "https://fashionista.com/2025/06/true-beauty-ventures-investors-diversity-inclusion-dei",
    "description": "The DEI discourse has — thanks to the current U.S. presidential administration and the major corporations buying into its anti-inclusion policies — reached an unfortunate fever pitch this year. But brushing conversations about diversity, equity and inclusion aside is detrimental to us all; and for ...Continue reading",
    "author": "Steph Saltzman",
    "published": "Thu, 26 Jun 2025 12:45:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1ODQ5Mjc3MzkyNDMwNDQ3/ami-cole-eye-shadow-campaign.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "How To Make It",
      "Diversity",
      "Beauty",
      "Funding",
      "Indie Beauty",
      "DEI",
      "Network",
      "Business",
      "McKinsey",
      "Inclusivity",
      "Rich Gersten",
      "Careers",
      "Investment",
      "True Beauty Ventures",
      "Cristina Nunez"
    ]
  },
  {
    "id": "8b9b6055-c2f1-4065-8b30-ce8a3c7ba6f2",
    "title": "Ideo: An 'Anti-Aging' Skin-Care Brand Founded by a Nobel-Nominated Neurochemist",
    "link": "https://fashionista.com/2025/06/ideo-skin-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. IdeoHeadquarters: New York, NYE-commerce: ideoskincare.comSocial Media: ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 25 Jun 2025 15:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjE1ODUxNTc0MTI2MTkyMTQ3/ideo-brand-bio-1.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Brand Bio Beauty",
      "Ideo",
      "Brand Bio",
      "Brand Bio Skin Care",
      "Beauty Brands",
      "Brand Bio",
      "Skin Care",
      "Network",
      "Beauty",
      "Indie Beauty",
      "Shopping"
    ]
  },
  {
    "id": "91bf324c-d7ae-4e37-83b1-521a80d50041",
    "title": "Karah Katenkamp, Curve Model",
    "link": "https://intothegloss.com/2025/03/karah-katenkamp-curve-model-beauty-routine/",
    "description": "With a probiotic rec to fight rosacea, under-the-radar tubing mascaras, and a masseter treatment that's not Botox",
    "author": "",
    "published": "Wed, 05 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "ea284d7d-9778-453f-bf57-9a05f6fcb7bf",
    "title": "How Tracey Cunningham Colored 17 Stars’ Hair For The Oscars",
    "link": "https://intothegloss.com/2025/03/tracey-cunningham-meche-celeb-colorist-oscars-diary/",
    "description": "5 days, 17 celebs, so much Olaplex",
    "author": "",
    "published": "Mon, 03 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "ef1ae248-6cc6-4ca0-9bb0-ca942b85ca47",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "7420a43a-0c37-40f7-8728-cc160eb9926c",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "904467a3-bc87-41a1-8e1a-cbe08697ae65",
    "title": "These 10 Beachy Perfumes Nail That Nostalgic Sunscreen Smell",
    "link": "https://www.refinery29.com/en-us/best-sunscreen-perfume-beach-summer-fragrance?utm_source=feed\u0026utm_medium=rss",
    "description": "There’s something uniquely uplifting about the smell of sunscreen. Perhaps it’s the way it instantly brings back childhood memories by the sea: sticky popsicles, salty hair, and afternoons spent burying your toes in the sand. Or maybe it’s the joy of having decent weather again. Now that temperatures are ticking upwards, it makes sense that beachy fragrances — with coconutty, skin-like notes that smell like sunshine mixed with our favourite SPF — are seeing a surge in popularity. Even if your upcoming plans don’t involve a tropical vacation abroad, these trending summer perfumes are here to lift your spirits with their nostalgic alchemy. From creamy coconut to citrus florals, the breezy scents ahead deserve a spot in your beach bag this summer. DashDividers_1_500x100 Phlur Beach Skin Body Mist, $25 “‘Scent of the summer’, ‘perfect summer spray’, and ‘summer in a bottle’ are just a few of the ways reviewers have described Phlur’s Beach Skin — and I’d say that secures its place as the ultimate warm-weather fragrance. Like its fruity counterpart, Peach Skin, it’s far more understated than I expected. I imagined a bold plume of coconut and citrus, but it’s actually light and airy, with top notes of salty air, bergamot and pink pepper. I love spritzing it in my hair on grey days; it catches the breeze as I walk and reminds me the sun does still exist.” — Jacqueline Kilikita, beauty director “Aftersun” by Vacation Eau de Toilette, $60 “I normally wouldn’t go near aquatic scents, but Vacation’s “After Sun” is the lone exception. (It also doesn’t hurt that it shares the same name as my favourite weekend Love Island recap episode.) Like all of Vacation’s products, it has a sort of nostalgic, endless summer vibe, but doesn’t rely on the cool factor alone. It’s a truly unique and unstereotypically summer: there are top notes of aloe vera gel (inspired by the brand’s actual post-beach aloe gel, which I also love), green tea, and cheekily, minibar gin. If a gin rickey were a perfume, it would be this. Each spritz is bright and refreshing, and as of this month, it’s nabbed the 2025 Fragrance Foundation Award for Fragrance of the Year. Need I say more?” — Karina Hoshikawa, senior writer Diptyque Ilio Eau de Toilette, $185 “To celebrate the season, Diptyque has unveiled the Dream Summer Fruit Garden, a limited-edition lineup of fragrances and candles decked in whimsical illustrations by Parisian artist Marie-Victoire de Bascher. But what I’m most excited about is the return of Ilio Eau de Toilette. Powdery iris (that’s where the likeness to sunscreen comes from) meets sweet orange blossom, zesty bergamot, and juicy prickly pear to form a balmy and well-rounded scent that captures the perfect Mediterranean getaway. It smells like my skin when I’ve just come out of the pool and reapplied SPF spray. Previously available only in the summer, Ilio will now be a part of the brand’s permanent collection, which is excellent news for me, as I simply can’t get enough.” — Venus Wong, senior writer Ellis Brooklyn Miami Nectar Eau de Parfum, $115 “I reviewed this scent when it first launched in 2024, and it’s still a go-to of mine. (I also recently waxed poetic on the dry shampoo version, made in collaboration with Amika.) I can’t think of a more perfect beach scent: Ellis Brooklyn’s ode to Miami has tropical notes of pineapple and coconut water, plus sweet plumeria and vanilla, rounded out with base notes of sensual amber and woods. It’s giving expensive cocktails, white sand beaches and dancing the night away.” — Karina Hoshikawa, senior writer Zara Solar Summer Skin Hair \u0026 Body Mist, $25.90 “If you want to smell like you’ve just spent a lazy day at the beach, Solar Summer Skin is the one. Salted caramel, jasmine, and sandalwood blend into a creamy, nectarous scent that radiates positivity without veering into cloying territory. It has a soft and powdery dry down that reminds me of the end of a summer holiday, when my skin still feels warm from soaking up all the sunlight. I wish the scent wouldn’t fade away so quickly, but for this very reasonable price, I’ll happily douse it all over my hair and arms. In fact, I recommend keeping this in the fridge for a cooling, juicy spritz.” — Venus Wong, senior writer LOEWE Paula’s Ibiza Cosmic Eau de Parfum, $175 “Perfume doesn’t get more beachy than this — and I’d expect nothing less from Paula’s Ibiza. The sweetness comes from coconut cream and juicy mango, but it’s balanced by cypress resin, cedarwood, amber, and sandalwood, which add a green, salty edge. As it dries down, it melts into a soft, skin-like scent — like wrapping yourself in a sun-warmed towel after a dip in the Mediterranean sea. Truly gorgeous. If you’re after something even fresher, try the original.” — Jacqueline Kilikita, beauty director Sol de Janeiro Agua Mistica Perfume Mist, $25 “In my opinion, a great beachy scent needs to smell like sea, sunshine and serotonin in a bottle, but also a) not be too expensive, and b) be packaged in a way that you don’t need to be too precious about tossing it into your beach bag. Sol de Janeiro’s Agua Mistica ticks all these boxes. Like all Sol de Janeiro scents, it packs a punch on a budget (at $25) and it comes in a plastic spray bottle. First, you’re greeted by an intoxicating cloud of neroli water and tangerine — it’s bright, bold, and juicy. This dries down into a warm, musky, and salty scent that lingers on the skin for a surprisingly long time considering the affordable price. It reminds me of the warm and heady post-sea swim feeling as you let the salt water dry in the sun. All in all, a delicious-smelling, budget- and travel-friendly perfume mist perfect for capturing your dream holiday mood.” — Esther Newman, affiliate writer Jo Malone Beach Blossom Cologne, $118 “Most sunscreen scents tend to make an aquatic or creamy first impression, but Jo Malone’s limited-edition summer cologne dials up the energy one step further. Upon first sniff, my nose is immediately hit with invigorating whiffs of lime and mint, while refreshing coconut water completes the zingy, cocktail-like profile. I can also smell bananas, though that’s probably the creamy tonka in the base note. In short, this is a happy-go-lucky fragrance that evokes sipping on an iced-cold piña colada on a palm-fringed private island. I’m sadly not due to make a trip like this anytime soon but spritzing this cologne is the next best thing.” — Venus Wong, senior writer Kayali Vacay in a Bottle Maui Eau de Parfum, $100 “When Mona Kattan launched her hotly anticipated Vacay in a Bottle fragrance collection, I was instantly drawn to Maui. To me, it smells like coming home from a sun-soaked day at the beach — after a cool shower, slathering on aftersun, slipping into a floaty linen dress and heading out for dinner. With creamy coconut, heady jasmine, and a hint of banana, it’s the closest I’ll get to a far-flung escape this year, and I’ve been dousing myself in it. Of all four, this is the most beachy scent in the collection. The amazing thing about Kayali is its lasting power. I sprayed this on a shirt yesterday, put it in the laundry, and I can still catch a whiff on the collar.” — Jacqueline Kilikita, beauty director Le Monde Gourmand Sel Océan Hair \u0026 Body Eau de Toilette, $28 “I’ve written at length about how Le Monde Gourmand is making some of the most multi-dimensional affordable perfumes at the moment, and the brand’s hair and body mist lineup is no different. Case in point: Sel Océan, which bottles up a salty sea breeze without smelling overwhelmingly marine. I attribute this to the pink sea salt, which has a more delicate, yet still noticeable aroma. A bouquet of pretty florals, including honeysuckle and lily of the valley, rounds out this gorgeous scent. Whenever I work from home during a heatwave, I love spraying this into my hair and turning the fan on full blast — it helps feed into my daydream about being by the sea.” — Venus Wong, senior writer Tom Ford Soleil Blanc Eau de Parfum, $195 “I first discovered Tom Ford’s Soleil Blanc in Duty Free before heading to Cannes. It came to define that summer holiday — and every one since. It’s a megamix of heady florals (think banana-like ylang ylang), warm, enveloping amber and splashes of citrus (that’ll be the bergamot). But it’s the addition of earthy pistachio accord that gives it a sexy, grown-up and luxurious edge. Whenever I wear it, I become a magnet for compliments. A rare feat: I never get sick of it — and that’s saying something, because I can be quite fickle when it comes to perfume.” — Jacqueline Kilikita, beauty director This story was originally published on Refinery29 UK. Like what you see? How about some more R29 goodness, right here?10 Summer Perfume Trends That Radiate Good VibesThe Under-$30 Perfume Brand Our Editors LoveThe Cool-Girl Perfume Brand Our Editors Love",
    "author": "Venus Wong",
    "published": "Thu, 26 Jun 2025 15:52:21 +0000",
    "image": "https://www.refinery29.com/images/11903349.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "ca15fbb1-9694-4e3b-a706-f2ce63ba0b23",
    "title": "I Didn’t Know I Needed A Medical Pedicure For Summer — Until I Got One",
    "link": "https://www.refinery29.com/en-us/medical-grade-pedicure-benefits-dry-feet?utm_source=feed\u0026utm_medium=rss",
    "description": "Until recently, my feet were in a sorry state. Months of back-to-back nail polish, overheating in fluffy socks, and being shoved into chunky boots had left my heels parched and my toenails stained and mottled. Honestly? A regular salon pedicure just wouldn’t cut it. Apparently, my algorithm agreed. Suddenly, I was being served weirdly hypnotic videos of medical pedicures, a treatment that nail experts (and those guilty of neglecting their soles) are calling a savior for summer feet. Also known as a medi-pedi, the medical pedicure has flooded TikTok ahead of sandal season — but it isn’t merely aesthetic. While nail polish can be a nice addition, the focus is primarily on the health of your skin and nails, with some key differences between this treatment and a standard salon pedicure. Of course, I had to try one myself first, and as expected, my feet felt brand new. So much so, it almost felt criminal to slip my sandals back on and trudge all the way home.  Here’s everything you need to know about medical pedicures before booking in for yours. What’s the difference between a medical pedicure and a salon pedicure? Session manicurist and pedicurist Ami Streets says that medical pedicures use podiatry-grade tools such as scalpels, diamond burrs, and electric files, which are designed for precision and the deeper treatment of foot issues like calluses (thickened, hard skin), thickened nails, and cracked heels.  “Medical pedicures are more corrective, addressing underlying problems while still delivering a groomed finish,” adds Streets. They are performed by a qualified podiatrist in a podiatry clinic. In contrast, she says salon pedicures typically use cosmetic tools like pumice stones, nail clippers, and foot files, which are aimed at surface-level grooming. In other words, a medical pedicure is a lot more thorough. Beyond the tools, medical pedicures also follow stricter hygiene protocols compared to salon pedicures, says Streets. “Medi-pedi services require that all tools are fully sterilized in a hospital-grade autoclave, and many items are single-use, especially anything that comes into contact with skin or nails.” She adds that treatments are carried out in a clinical or semi-clinical setting, with the practitioner wearing gloves and a mask, and using medical-grade disinfectants throughout.  What is a medical-grade pedicure? You might also have heard of “medical-grade” pedicures, which are slightly different. Brands like Footlogix offer similar treatments with qualified nail experts, often including the option of nail polish to finish, though the practitioners aren’t always podiatrists. One medical-grade pedicure brand, Elim, is taking over social media — and it’s beauty editor-approved. Elim’s medical-grade pedicure enlists a handful of topical products with active ingredients to break down tough calluses and deeply moisturize cracked feet, explains Faye Layton-McCann, director of education on behalf of Elim. One key product is the MediHeel Callus Tonic, which contains keratolytic alkaline to dissolve protein bonds, making it easier to remove hard, dead skin from the heels and toes. In fact, the “Elim scrape” — gently removing dissolved skin with a heel scraper — has gained fame on social media thanks to its oddly satisfying results. Pedicurist Faye Dennis — a fan and trained user of Elim — adds that exfoliating alpha hydroxy acids, such as glycolic and lactic acid, are also used to tackle dry heels and flaky skin. “These gently dissolve dry skin rather than using traditionally harsh, ablative methods, which can trigger faster skin cell re-growth — the exact opposite of what we’re trying to achieve,” says Dennis. Think of it as a clinically effective chemical peel for your feet, says Layton-McCann. Adding, “We’re actively changing the pH of the skin to treat the feet, not just improve physical appearance.”  Besides active ingredients, a clear sign that a pedicure is medical grade is that it’s performed by someone with specialized training to ensure these potent products are used safely and professionally, says Layton-McCann. In the case of Elim, each treatment is tailored to the client’s individual needs: “That could be severely dry, callused heels or specific conditions like foot odour, or fungal infections,” says Dennis. “Foot health is always our priority, so there is always a prescriptive, targeted approach that delivers both immediate and lasting results.” What are the benefits of a medical-grade pedicure? In addition to removing dry skin, medical and medical-grade pedicures give special attention to the toenails, which can become dull, stained, and dehydrated, especially if you’re not removing polish as often as recommended: every two to four weeks for gel and every one to two weeks for regular polish. (That’s pretty much most of us.) I recently booked in for an Elim medical-grade pedicure myself. Post-peel, the practitioner used a small e-file and nail brush to buff away remnants of old polish and the white, chalky patches that had built up on my nails due to dehydration. She followed with a nourishing foot mask and generous lashings of cuticle oil to moisturize my parched toenails, before applying Biosculpture gel polish — an optional extra for summer. It’s these finishing touches that elevate medical and medical-grade pedicures from a chore to a luxury, says Streets. Talking of toenails — during a medical-grade pedicure, fungal nail conditions can also be treated. With Elim, the brand’s Fungal Force serum and antibacterial foot soak, Spa Additive, are rich in antiseptic properties to fight bacteria, explains Layton-McCann. “Elim isn’t just for those with a bit of dry skin,” she says. Who is a medical-grade pedicure suitable for? Medical and medical-grade pedicures are suitable for everyone, says Streets: “Even those who regularly maintain their feet at home, or have pedicure treatments in a salon, would find one beneficial.” Streets herself likes to book in for an annual medical pedicure, complete with a deep clean and thorough filing, ahead of sandal season. “The treatment is ideal for anyone wanting elevated and more specialist foot care — even without any visible issues, as the service is great for prevention, not just treatment,” says Streets. Where Elim is concerned, Layton-McCann says that each treatment is prescriptive and differs for each client: “It allows you to adapt and offer bespoke treatments,” she says. “If someone came to me with a chronic condition and heavily chapped feet, we might start with weekly or bi-weekly appointments to restore the skin and get the feet to a good, manageable state.” Elim is and should always be long-lasting, says Layton-McCann: “This is so you can see and feel the difference after one sitting.”  Does a medical-grade pedicure hurt? Medical and medical-grade pedicures are generally painless. Only qualified podiatrists should be removing ingrown toenails, though, which can cause some discomfort. The area is usually numbed with a local anesthetic beforehand. How much does a medical-grade pedicure cost? Medical and medical-grade pedicures vary in price depending on location. In New York, a medical pedicure typically ranges from $100 to $200, but can cost more thanks to add-ons like gel polish. In the US, an Elim medical-grade pedicure typically starts at $70, with prices increasing based on the level of service — such as express, deluxe, or luxury — and any polish add-ons. Are medical and medical-grade pedicures worth it for summer? Once you’ve had a medical-grade pedicure, it’s hard to go back. The attention to detail, the focus on foot health — not just how your feet look — puts every other pedicure to shame. I’ve already booked in for my second Elim treatment. It’s that good. This story was originally published on Refinery29 UK. Like what you see? How about some more R29 goodness, right here?Summer’s 9 Hottest Pedicure Colors Are SurprisingHow To Tell A Good Pedicure From A Bad One9 Pedicure Tips I Learned From A Top Foot Doctor",
    "author": "Jacqueline Kilikita",
    "published": "Thu, 26 Jun 2025 15:09:53 +0000",
    "image": "https://www.refinery29.com/images/11909355.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "e5e30a8d-a25a-4e18-9e04-cb96545cff95",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "9528b2ea-4d88-4d9e-abd4-04e7c4c8f8c3",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "cd02f42e-b73c-4468-9d5f-d932fabce91e",
    "title": "\"Fishing Lure\" Nails Are the Hottest Thing For Summer",
    "link": "https://www.popsugar.com/beauty/fishing-lure-nails-49448135",
    "description": "The sardine trend has exploded on social media in the past few weeks. The aesthetic captures a unique summer vibe that's reminiscent of an Amalfi Coast vacation. It transports you to a yacht in Italy, Aperol Spritz in hand, taking you away from where you are actually are. We've seen clothing and accessories littered with fish iconography, but now, the trend has made its way to our fingertips with \"fishing lure\" nails. According to Molly Runty, a nail artist who recently crafted a set like this for her clients, this trend is \"inspired by real fishing lures, featuring colorful, shiny, iridescent finishes to create an eye-catching appeal.\" The trend is the perfect summer accessory and a great way to get in on the fun if you don't feel like stocking up on bags and tank tops with sardines on them (though we're big supporters of doing both). Ahead, get inspiration for your own fishing lure nails for summer, with options ranging from short natural sets to extra-long extensions. Plus, you'll find expert tips from Runty on how to achieve this look.",
    "author": "Brittany Leitner",
    "published": "Thu, 26 Jun 2025 08:15:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/460Vj9UbGa9ZxMBbqLwY_OkqFJk/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/24/752/n/1922153/3e67572e685ada83884794.43885448_.png",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Trends",
      "Summer Beauty",
      "Nails",
      "Nail Trends",
      "Nail Art"
    ]
  },
  {
    "id": "8c14b9c3-fdcd-4327-824e-d23f61adf120",
    "title": "I Tried Sydney Sweeney's Bathwater Soap, and I'm Only a Little Grossed Out",
    "link": "https://www.popsugar.com/beauty/sydney-sweeney-bathwater-soap-review-49448855",
    "description": "I feel pretty clean for having just showered with someone else's bathwater. Yes, you read that right. In all fairness, the water once belonged to \"Euphoria\" it-girl and Gen-Z bombshell Sydney Sweeney. It comes encapsulated in an unassuming turquoise bar of Dr. Squatch soap (aptly named \"Sydney's Bathwater Bliss\"), has already sold out, and is continuing to inspire some passionate think-pieces. While supporters applaud Sweeney for profiting off the very demographic that sexualizes her, others say her pandering to men is setting women back decades. Admittedly, her \"hey boys\" advertising isn't exactly subtle. But marketing aside, people have also expressed some valid concerns about washing with a celebrity's old bathwater. Given its divisiveness, I decided to try it for myself. One thing to note: I understand the majority of people are not buying this product purely for its antimicrobial properties. But as a more (ahem) unbiased consumer, I feel I can share an honest review of the soap itself - the good, the bad, and the gross. Read on to get my initial thoughts, feelings, and a few legitimate red flags about bathing in someone else's bathwater (even if it is Sweeney's). First Impressions of the Dr. Squatch Sydney's Bathwater Bliss Soap Waiting on the curb for my bar of bathwater soap was a deeply humbling experience. I accepted the parcel as if it were contraband, scurrying into my apartment lest someone spot the suspicious transaction taking place. I smelled the soap before I even freed it from its packaging - a strong pine scent that reminded me of a men's cologne or my dad's deodorant. Upon further inspection, I read that the scent (pine, moss, and Douglas fir) is called \"morning wood\" . . . groan. Contrary to rumors on the internet, the soap does not have a hole in the middle of it. I'm not sure where this theory came from, but a part of me feels like people were just looking for another reason to hate on the soap. While the marketing certainly isn't discreet, it's disappointing to see people criticizing Sweeney for a nonexistent product feature. And frankly, if thousands of men are willing to buy her literal bathwater . . . that feels like more of a \"them\" problem. What I Liked I've done plenty of editor experiments over the years, but this one gave me pause. Despite its sexy marketing, the idea of using someone else's bathwater still teetered into \"gross\" territory for me. But I took one for the team, and used the bar in the shower . . . for science. The soap had a soft lather and added grittiness made from sand and pumice granules for exfoliation purposes. The pine scent was pleasant, if not a little manly, and I was happy that my skin didn't feel dried out afterward (as it often does with bar soap). When all was said and done, I felt pretty clean, despite having just washed myself with someone else's bathwater. There's also something to be said about the novelty of it all, especially if you're a do-it-for-the-plot type of person. What to Consider Per the ingredient list, each bar of soap allegedly contains a small amount of Sweeney's real bathwater (consequently, there were only 5,000 bars made). Still, washing in someone else's bathwater does present a few health concerns. For starters, bathwater can contain contaminants like bacteria and other microorganisms. This may increase the risk of infection or skin irritation, especially for people with compromised immune systems. As previously noted on Walmart's website, the soap should not be used on any cuts or abrasions, presumably for this exact reason. The Bottom Line I can't say I'd jump to wash with someone else's bathwater again, but I also think the hate is a little forced. To me, Sweeney's bathwater soap felt like more of a gimmick than anything else . . . but at least it was relatively functional (and priced at only $9). Calling a bar of soap anti-feminist when we know that men have been sexualizing Sweeney from the jump feels like a bit of a reach. The marketing isn't my personal favorite either, but I'm glad she's getting paid. I'm glad there's no hole. And frankly, if it encourages men to wash themselves more thoroughly, I'm all for it. Related: I Tried the Viral David Protein Bars You Can't Escape - Here's My Honest Take Chandler Plante (she/her) is an assistant health and fitness editor for PS. She has over four years of professional journalism experience, previously working as an editorial assistant for People magazine and contributing to Ladygunn, Millie, and Bustle Digital Group.",
    "author": "Chandler Plante",
    "published": "Thu, 26 Jun 2025 07:10:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/U5_AijyjB1nHvBrtHHZIN9Lb6Ug/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/06/25/843/n/1922153/476e4b01685c4aa4195a53.98553610_.png",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Reviews",
      "Sydney Sweeney",
      "Body Wash",
      "Hype Check",
      "Editor Experiments"
    ]
  }
]
