[
  {
    "id": "22a845be-da65-43e4-af78-0b72bb27341f",
    "title": "New YSL Loveshine Plumping Lip Oil, Loveshine + Candy Glaze Shades",
    "link": "https://thebeautylookbook.com/2025/03/ysl-loveshine-plumping-lip-oil-loveshine-candy-glaze.html",
    "description": "New YSL Loveshine Plumping Lip Oil, Loveshine + Candy Glaze Shades. A look at some of the latest lip launches from YSL Beauty.",
    "author": "Sabrina",
    "published": "Wed, 19 Mar 2025 19:07:05 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/03/NEW-YSL-loveshine-plumping-lipgloss-oil-loveshine.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/ysl' target='_blank' style='color:currentColor;text-decoration:none;'\u003eYSL Beauty\u003c/a\u003e"
    ]
  },
  {
    "id": "6880ebbb-9efb-4200-9ced-ca6d49b9c253",
    "title": "Chanel Camelia Futura Collection – Spring 2025",
    "link": "https://thebeautylookbook.com/2025/03/chanel-camelia-futura-collection-spring-2025.html",
    "description": "Chanel Camelia Futura - Spring 2025. A look at the newest makeup launch from Chanel Beauty.",
    "author": "Sabrina",
    "published": "Thu, 13 Mar 2025 14:46:25 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/03/Chanel-Camelia-Futura-Collection-Spring2025.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/chanel' target='_blank' style='color:currentColor;text-decoration:none;'\u003eChanel\u003c/a\u003e",
      "Chanel"
    ]
  },
  {
    "id": "be3e367f-279b-43b2-86b8-eee0a2e7ec9b",
    "title": "Gwyneth Paltrow Doesn’t Fear Controversy",
    "link": "https://www.elle.com/beauty/makeup-skin-care/a64315280/gwyneth-paltrow-goop-career-interview-2025/",
    "description": "",
    "author": "",
    "published": "Sun, 30 Mar 2025 12:00:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "98f4958c-4d5e-49bf-b089-7e475a862361",
    "title": "The Best Grapefruit Fragrances to Help You Welcome Spring Properly",
    "link": "https://www.elle.com/beauty/g64311348/best-grapefruit-perfumes/",
    "description": "Warm-weather notes perfect for year-round wear.",
    "author": "",
    "published": "Fri, 28 Mar 2025 22:12:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "eac741e2-1a16-4f45-a323-b788f9278415",
    "title": "May Lindstrom Skin: A Small-Batch Skin-Care Brand That Relies on Natural Ingredients",
    "link": "https://fashionista.com/2025/03/may-lindstrom-skin-skin-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. May Lindstrom SkinHeadquarters: CaliforniaE-commerce: maylindstrom.comSocial ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 26 Mar 2025 14:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEzNDM0NTQ0MjM2MzQwNjg3/may-lindstrom.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "May Lindstrom",
      "Brand Bio Beauty",
      "Skin Care",
      "Indie Beauty",
      "Shopping",
      "Beauty",
      "Brand Bio Skin Care",
      "Network",
      "Brand Bio"
    ]
  },
  {
    "id": "db043341-e7e3-4e3c-8a1c-204810094dbf",
    "title": "How Mara Roszak Went From Doing Her Friends' Bat Mitzvah Hair to Styling Emma Stone and Zoe Saldaña for the Oscars",
    "link": "https://fashionista.com/2025/03/mara-roszak-hairstylist-career-interview",
    "description": "In our long-running series, \"How I'm Making It,\" we talk to people making a living in the fashion and beauty industries about how they broke in and found success. Mara Roszak's entry into hairstyling is a relatable one, especially for those of us who experienced adolescence in the '90s and early ...Continue reading",
    "author": "Steph Saltzman",
    "published": "Wed, 26 Mar 2025 12:45:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEzNzE4NjIyNTAwMDM4MDk1/mara-roszak.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Sephora",
      "Network",
      "beauty careers",
      "How To Make It",
      "zoe saldana",
      "Beauty",
      "Mila Kunis",
      "hairstylist",
      "Roz Hair",
      "Chris McMillan",
      "emma stone",
      "Careers",
      "Roz",
      "Mara Roszak",
      "careers",
      "Sarah Michelle Gellar",
      "How I'm Making It",
      "hair"
    ]
  },
  {
    "id": "ff22e106-53f9-48b8-8210-8b3de51e9a5f",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "e2a737e6-7e40-43aa-ada4-56cc1a2fbc03",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "9008f2cb-5a6a-4cb0-886e-82c5d99c3afe",
    "title": "Karah Katenkamp, Curve Model",
    "link": "https://intothegloss.com/2025/03/karah-katenkamp-curve-model-beauty-routine/",
    "description": "With a probiotic rec to fight rosacea, under-the-radar tubing mascaras, and a masseter treatment that's not Botox",
    "author": "",
    "published": "Wed, 05 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "0ecdbe48-38eb-49f8-afbc-79ad544b820c",
    "title": "How Tracey Cunningham Colored 17 Stars’ Hair For The Oscars",
    "link": "https://intothegloss.com/2025/03/tracey-cunningham-meche-celeb-colorist-oscars-diary/",
    "description": "5 days, 17 celebs, so much Olaplex",
    "author": "",
    "published": "Mon, 03 Mar 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "bdc942b6-db71-48a0-9d0d-9296c34c4446",
    "title": "Collagen Manicures Are Trending, But Can They Actually Help Nail Growth?",
    "link": "https://www.refinery29.com/en-us/collagen-manicure-nail-growth-benefits?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Nail health is having a major moment. From the Japanese manicure — an intensive treatment that buffs vitamin-rich pastes into the nails — to the ‘nail facial’, which nourishes by using cuticle oils and strengthening base coats, it seems we’re all eager to undo the damage caused by years of acrylics and the (arguably satisfying) habit of peeling off gel polish. But there’s a new treatment on the block, and it promises healthier, stronger nails after just one session.  Enter: the collagen manicure. What is a collagen manicure? Before diving into how collagen benefits nails, it’s important to note that collagen is a natural protein found primarily in the skin, keeping it smooth, supple, and strong. As we age, our collagen levels run low, which is why skincare brands often add collagen to serums and moisturizers, most of which claim to plump the skin and reduce fine lines. But whether topical collagen products can boost deeper collagen reserves is still up for debate. What topical collagen products can do, however, is hydrate and moisturize the surface of the skin. Where does the collagen manicure come in, then? Session manicurist Ami Streets explains that the collagen manicure is a treatment that uses collagen-infused products. It might start with a hand scrub, followed by a collagen-packed hand mask, nail polish, a rich collagen lotion, and a heavy helping of cuticle oil to nourish and hydrate dry, brittle nails and the surrounding skin.  “One of my favorite products to use during manicure prep is collagen-infused pre-soaked gloves,” says Streets, referring to Caci’s Rejuvenating Hand Mask, which contains hydrolyzed collagen, hydrating hyaluronic acid, and deeply moisturizing shea butter to soften the skin. Also try VOESH Collagen Gloves, $19. How does a collagen manicure work, and what are the nail benefits? But here’s the thing: Streets says collagen-infused manicures and products tend to benefit the skin more than the nails themselves. That said, healthy, moisturized cuticles play a key role in promoting nail growth and strength, so the two go hand in hand: “Collagen molecules are typically too large to be absorbed directly into the nail plate,” explains Streets, “but they can improve the appearance of nails, cuticles and hands by softening skin and temporarily boosting hydration when topically applied.” While collagen-infused hand and nail products mainly provide surface-level hydration and temporary plumping effects, Streets notes they can still help maintain the skin barrier — the outermost layer of skin that locks in moisture and keeps out bacteria. She says this can improve skin and nail texture over time. But the specific type of collagen is important: “Collagen molecules are typically too large to penetrate deeply into the nail plate in their natural form, as skin and nails act as protective barriers,” says Streets. Instead, look out for treatments and products containing hydrolyzed collagen, which consists of smaller molecules that can penetrate more easily. “These stimulate the skin to produce more collagen and support skin hydration,” adds Streets. How much does a collagen manicure cost — and how long does it last? A professional collagen-infused manicure can cost between $30 and $100, depending on location. Streets says the effects of a collagen manicure are generally short-term: “Any hand- and cuticle-plumping effects tend to last a day or two,” she adds.  Can you do a collagen manicure at home? Besides hand masks (a staple in most professional collagen manicures), there are some at-home collagen-infused nail products, too. Nails Inc.’s Powered by Collagen Nail Polish Remover, $8, is acetone-free and packed with collagen to moisturize the skin while gently dissolving polish. Sally Hansen Nailgrowth Miracle Treatment, $8.49, is enriched with multivitamins, keratin, and moisturizing collagen to improve the look and feel of weak, peeling nails instantly (thanks to the subtle gloss finish) and over time. Streets also recommends several other ingredients that can improve collagen as well as skin and nail health. First, chemical exfoliators like alpha hydroxy acids (AHAs), such as glycolic and lactic acid. Dr. Dana Stern, a board-certified dermatologist and founder of nail care brand Dr. Dana, believes that, like skin, exfoliation is essential for improving nail damage and effectively hydrating nails. Her Nail Renewal System, $29, features the Glycolic Prep For Nails, a nail wand soaked with glycolic acid to buff away damaged nail cells.  Streets also recommends retinol, which kickstarts collagen production. Try a nightly slathering of hand cream like Nécessaire The Hand Retinol, $38, or Spice Beauty Hand Cream with CBD + Retinol, $42. Lastly, most manicurists link healthy nail growth to the use of cuticle oil, so consider one packed with a collagen-stimulating antioxidant ingredient like vitamin C. Try Nails Inc. Vit C Please Cuticle Oil, $9, with the addition of moisturizing vitamin E. “Vitamin C is essential for collagen synthesis”, says Streets. How can you improve the health of your nails and make them grow faster? Finally, as with any nail care routine, Streets emphasises consistency. If fortnightly collagen manicures aren’t feasible, she recommends nightly cuticle oil application, regular use of hand cream (those containing sunscreen further preserve collagen), and wearing gloves to protect skin and nails during tasks like cleaning. This story was originally published on Refinery29 UK. Like what you see? How about some more R29 goodness, right here?Am I Addicted To Gel Nails?5 Tips That Helped Me Grow Longer, Stronger NailsIs It Ever Okay To Refuse To Pay For A Manicure?",
    "author": "Jacqueline Kilikita",
    "published": "Fri, 28 Mar 2025 16:41:11 +0000",
    "image": "https://www.refinery29.com/images/11872388.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "c13080a1-3830-4a3e-b3f8-29daef99b1de",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In March",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-march?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find our editor-approved lineup of the best to shop and see in fashion and beauty right now. Both awards season and Fashion Month have ended, which means leaving red carpet glam, eye-catching street style, and show-stopping runway looks in the rearview mirror. But, as the old cliché goes, when one door closes, another must open — and that’s certainly true in the world of fashion and beauty. As spring weather approaches, nudging us out of our winter cocoons, a new crop of trends, buzzy campaigns, and launches are also emerging in the sunlight. Sabrina Carpenter is helping debut new Prada Beauty products, Refinery29-favorite brand Aligne is making its foray into bridal, and Glow Recipe is furthering its stronghold on the skincare-meets-makeup category with its latest cheek tints — and that’s just the start. Keep scrolling to discover more of the new fashion and beauty launches we’re excited about this month.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.Aligne Introduces Bridal Capsule Collection The British brand known for its collarless blazers is set to walk down the aisle with the launch of its debut bridal capsule collection. Designed to be versatile, bold, and tradition-skewing, the line is made up of four pieces that can be worn during or beyond wedding celebrations: a satin mini dress with bows on the shoulders, a peplum top with ribbon detailing, a satin mini dress with puff sleeves, and, of course, a tailored satin blazer that ties at the front. Prices start at $165. Shop now at Aligne Aligne Ivy Puff Sleeve Satin Mini Dress, $, available at AligneNew Fenty x Puma Collection Rihanna’s latest Fenty x Puma collection is here — and it’s impossible to miss. The eye-catching, neon-hued line features two shoe styles: a new take on the classic Avanti LS sneakers and the Cat Cleat Jelly sandals, available in highlighter yellow and orange shades. Also on offer is the lime green mini Fenty x Puma Pocket Bag that can double as a crossbody, making it perfect for running errands or low-effort, essentials-only beach days. Prices range from $75 to $120.   Shop now at Puma Fenty x Puma Cat Cleat Jelly, $, available at PUMABrunello Cucinelli Launches BC Duo Bag For its latest handbag style, Brunello Cucinelli creative directors, Camilla and Carolina Cucinelli. landed on the name “Duo.” Why? Well, to start, the slouchy tote bears the brand initials and balances modern design with traditional craftsmanship. Plus, what gives the bag its distinct, refined look is a pattern of stitches forming four trapezoid-like shapes on the outside, which act as mirror images of each other. Designed to be a practical, fashion-forward everyday bag, the style also comes in four sizes, a variety of finishes and colors (like leather, suede, metallic, and denim), and includes a removable zipper pouch inside.Shop now at Brunell CucinelliBrunello Cucinelli BC Duo Bag, $, available at Brunello CucinelliStarface Launches Skincare Starface changed the game when it launched its fun, irreverent, and effective star-shaped pimple patches. Now, it’s looking beyond spot treatments and expanding into skincare. The line boasts two salicylic acid-forward, acne-fighting products: a gentle foaming cleanser formulated for sensitive and breakout-prone skin and a lightweight, soothing, oil-free moisturizer that also contains shine-minimizing niacinamide and hydrating hyaluronic acid. Both are available now for $15.99 each.Shop now at Starface Starface Sal Acid Skincare Duo, $, available at StarfaceNordstrom Launches New Shoes With Reformation Reformation just dropped its spring shoe collection, and some of the It Girl-coveted styles are available exclusively at Nordstrom. Part of Nordstrom’s monthly “Make Room for Shoes” campaign — which pairs the retailer with popular shoe names like Birkenstock, Larroudé, and Sperry — the collection includes an array of ballet flats (including a covetable sheer pair with delicate floral embroidery), flat sandals, and versatile heels. Shop now at NordstromReformation Bethany Ballet Flat, $, available at NordstromRebecca Vallance Launches Denim CollectionRebecca Vallance is taking her ultra-glam occasionwear aesthetic and eye for sharp tailoring to a brand-new category. The Australian designer’s eponymous brand has just dropped its first-ever collection of denim, and it includes 15 pieces for a range of occasions — think high-waisted straight-leg jeans, cinched dresses, oversized jackets with cocoon sleeves, and a denim blazer. “Denim has always been a staple in everyday wardrobes, and I wanted to create pieces that can be seamlessly integrated into our customers’ existing collections while still offering the signature sophistication and elevated style that they expect from the brand,” Vallance said in a press release. Prices range from $285 to $570. Shop now at Rebecca Vallance Rebecca Vallance Dylan Mini Dress, $, available at Rebecca VallanceRebecca Vallance Gisele Flare Jean, $, available at Rebecca VallanceGlow Recipe Watermelon Glow Niacinamide Dewy FlushThe skincare-meets-makeup trend continues to grow strong thanks to Glow Recipe’s latest twist on its bestselling Dew Drops. Enter: Watermelon Glow Niacinamide Dewy Flush. The tinted cheek serum combines the rosiness of a soft blush with skin-boosting ingredients, like brightening and smoothing niacinamide and calming centella asiatica to hydrate skin, refine the appearance of pores, and impart a natural flush. Available in two shades — peachy Watermelon Flush and warmer Berry Flush — the formula is also buildable, so you can opt for a dewy and sheer look or a more pigmented finish. Shop now at Glow RecipeGlow Recipe Watermelon Glow Niacinamide Dewy Flush, $, available at SephoraJ.Crew’s Spring Catalog After relaunching it last year, J.Crew is back with the latest edition of its beloved catalog. This time around, the focus is on all things spring style and the American brand’s latest additions to its signature preppy, timeless offerings. Other than new pieces, inside you’ll find model Liya Kebede — 16 years after Kebede first appeared in a J.Crew catalog — and her daughter Raee, intimate snapshots of New York families, and so much more. J.Crew Barn Jacket, $, available at J.CrewJ.Crew Étienne Oversized Shirt, $, available at J.CrewJ.Crew Gwen Knee-Length Slip Skirt, $, available at J.CrewJ.Crew Driving Loafers, $, available at J.CrewJ.Crew Étienne Cropped Button-Up Shirt, $, available at J.CrewGU x Undercover Fresh off of debuting its latest collection at Paris Fashion Week, Undercover designer Jun Takahashi has once again collaborated with the Uniqlo sister brand GU. “Silent/noise” — Undercover’s slogan that nods to embracing the discomfort — was the starting point for every piece, which the team has interpreted with playful, convertible designs that can be worn and styled in several different ways. The line’s first drop features playful takes on GU’s wardrobe staples — think relaxed trousers and blazers and T-shirts with signature Undercover motifs illustrated by Takahashi, like the “Noise Burger” character. GU x Undercover collection is available now, with prices ranging from $5.99 to $69.99; a second drop is expected next month. Shop now at GUGU x Undercover Broadcloth Shirt, $, available at GUGU x Undercover Deck Shoes, $, available at GUK18 AstroLift Reparative Volume Spray Fed up with using multiple products in your hair care routine? Try K18’s AstroLift Reparative Volume Spray, which promises to amp up volume, hold curls and waves in place (without making your hair crunchy), and repair and reverse damage on your strands. Simply spray through wet, dry, or towel-dried lengths for bouncier, thicker, fuller-looking hair that lasts. Shop now at K18 K18 AstroLift Reparative Volume Spray, $, available at K18Cuyana’s New Paloma Tote Cuyana’s dove-shaped Paloma bag has long been a fan favorite: it has sold out twice and has even been spotted on the shoulder of Meghan Markle. Now the minimalist brand is expanding the collection with the Paloma Tote. The new bag is inspired by the silhouette of the OG, and is made with the same Italian double-faced leather that softens as it ages — but now comes with more room, plus extra exterior and interior zip pockets. Shop now at Cuyana Cuyana Paloma Tote, $, available at CuyanaZara x Style Not Com When Beka Gvishiani, founder of the mega-popular fashion Instagram account Style Not Com, was approached by Zara, he started the conversation by saying: “Let’s talk about fashion.” That phrase is now at the heart of the resulting Zara x Style Not Com collection, which takes the account’s signature cobalt blue hue and bold white text and splashes them across a variety of apparel. Get meta with pieces like a baseball cap with the text “No, I’m not selling my hat,” a reference to Gvishiani’s signature hat; a hoodie emblazoned with “This is a hoodie without an idea;” or a T-shirt that says, “Life is a fashion week with some normal days in between.” Prices range from $10.90 to $69.90. Shop now at Zara Zara x Style Not Com T-Shirt, $, available at ZaraPrada Beauty Pradascope Lash Extending Volume Mascara How do you launch a new product in a way that will make a splash? Well, if you’re Prada Beauty, you tap Sabrina Carpenter for the campaign. That’s how the Pradascope Lash Extending Volume Mascara was introduced to the world. Inspired by the brand’s durable Re-Nylon material, the buildable, clump-free product instantly and noticeably lifts and lengthens lashes for up to 24 hours. The mascara is also formulated with a hyaluronic acid complex to nourish lashes, while the 180° brush features nylon fiber bristles for easy application and definition. Shop this month at Prada Prada Pradascope Lash Lengthening Eye Mascara, $, available at PradaNew Hoops at Jenny Bird A new season approaching is the perfect time to refresh your jewelry collection, if you ask us. It seems like the team at the popular jewelry brand Jenny Bird agrees — they spent the last month dropping new hoop earring styles. Highlights include the Mega Faye Knocker hybrids, the high-shine Mini Tomes, miniature versions of the brand’s bestselling Florence stacked hoops, and the chunky — yet still lightweight! — Gemma Hoops, all of which are available in gold and silver finishes.Shop now at Jenny Bird Jenny Bird Gemma Hoop Earrings, $, available at Jenny BirdMother x La DoubleJ  California cool and Italian flair are coming together in the just-dropped Mother x La DoubleJ capsule collection. The 30-piece line brings La DoubeJ’s maximalist, ’70s-style prints to Mother’s effortless denim pieces, such as the Half-Pipe Ankle barrel jeans that are covered in illustrated dragonflies, a denim jacket with an embroidered tapestry of a goddess on the back, and a pair of flares with wave details at the hems. The collection isn’t all about denim either; also discover graphic tees, boho blouses, and flowy kaftans. Prices range from $130 to $1,290. Shop now at Mother and La DoubleJ La DoubleJ x Mother The Tomcat Roller, $, available at MotherLa DoubleJ x Mother The Sinful, $, available at MotherLike what you see? How about some more R29 goodness, right here?Refinery29 Loves: Everything To See \u0026 Shop In FebWinter Fashion Must-Haves R29 Editors Are WearingR29 Editors Try Rhode's New Lip Pencils",
    "author": "Patricia Karounos",
    "published": "Wed, 26 Mar 2025 20:00:42 +0000",
    "image": "https://www.refinery29.com/images/11862559.jpg?auto=webp\u0026width=960\u0026height=1440\u0026quality=85\u0026crop=2:3",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "3b7fb6cc-53d8-4e43-90b1-a31c430f5ad5",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "5e8362dd-9ea8-428f-ab3b-018a967c2f4c",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "e3071278-6bb6-4c78-b302-db909641e0cb",
    "title": "The \"Butterfly Haircut\" Is a Game Changer For My Thin Hair",
    "link": "https://www.popsugar.com/beauty/butterfly-haircut-editor-experiment-48955669",
    "description": "I'm not going to lie, I was very affected by the \"Rachel\" haircut when it first made an appearance in the late '90s. Of course, I begged my mom to bring me to the salon so I could get it cut into the iconic layered 'do. However, once I sat down in the stylist's chair, they would always tell me my hair was too thin and would fall flat. So when the butterfly haircut - a new hair trend that consists of face-framing layers and was originally coined by celebrity hairstylist Sunnie Brook - went viral on TikTok, I thought this would be my one chance to finally get the Rachel in an elevated way tailored to my specific hair type. When I went to see Lindsay Victoria, master stylist and educational director at Spoke \u0026 Weal in Los Angeles, I asked her to both keep my length and give me as much volume as possible. Keep reading for tips on what to expect from the butterfly haircut and how to style it based on your individual hair texture. Plus, check out how the butterfly haircut for thin hair worked for me. Experts Featured in This Article Lindsay Victoria is a master stylist and educational director at Spoke \u0026 Weal in Los Angeles. What Is a Butterfly Haircut? \"A heavily layered '90s-inspired cut, the butterfly haircut consists of a more uniform layer and carved-out face framing, with the shortest layer starting anywhere between the cheekbone and below the jaw line,\" Victoria says. \"The shape is typically more round, which allows the style to have a max amount of volume. This type of haircut has pushed the trend toward polished and refined with less of a messy undone style.\" Since there are slight variations of the butterfly haircut, Victoria says it's best to go to the salon equipped with photos of the style and length you're after. \"Based on what length you are currently at, face shape, texture, density, and curl pattern, ask your stylist what length the face-framing layers should be and what overall length would suit you best,\" she says. \"Talk about your daily routine, including the products you use, to see if any adjustments need to be made in achieving this look. If you have a curl pattern and would like the option to wear it natural, let your stylist know so it is taken into consideration when designing the haircut for you.\" How to Style a Butterfly Haircut \"Depending on your texture - fine, medium, or coarse - and your curl pattern, there can be technical adjustments made to customize a version of this style for you,\" Victoria says. \"This haircut can be worn with natural texture as well. Similar to a blown-out style, the shape will be round and voluminous.\" She explains that the best at-home tool for creating the butterfly effect is the Dyson Airwrap ($600)'s long barrel attachment, but it can also be achieved with a round brush or a medium to large curling iron. \"Using your tool of choice, split your hair in half down the center back, curling each side in the same direction (toward or away from the face), and let it cool before brushing out the wave for a smooth polished finish,\" Victoria says. \"Regardless if you are curling toward or away from the face, you want to curl the shortest front layer away from the face to create that signature butterfly wing.\" When it comes to products, she says they'll really be determined by your hair texture. People with fine or thin hair will want to look for products that are intended for volume and hold. \"A root-lifting spray, mousse, styling foam, thickener, dry shampoo, and dry texture spray,\" Victoria says. \"Stay away from oils and creams to not weigh down the hair.\" Medium textures will want a light blow-dry cream, volume spray or mousse, and a dry texture spray to finish. Coarse hair should look to a blow-dry cream, hair milk, or leave-in conditioner paired with a light hold product, finished with a light hair oil or styling cream. Butterfly Haircut Photos My butterfly haircut results were honestly perfect. On the left, you'll see what the haircut looked like when I used a blow dryer and a 3/4-inch-barrel curling iron, and on the right is the cut when I let my hair air-dry. The butterfly haircut has definitely given my hair much more movement and volume, especially when I let my natural curl pattern do its thing. I'm a big fan of the longer face-framing layers that Victoria added in, which curl around nicely to get that iconic butterfly-wing flip. Overall, it's been an extremely manageable style - I just use some texturizing cream or spray to keep it easy - that works both air-dried and blow-dried and gives that extra boost of volume to my thin hair without making it look stringy. In other words: it checks all my boxes. Aviel Kanter (she/her) is the director of branded content for Vox Media, and oversees lifestyle content across the portfolio of brands. She manages a team of editors that writes articles in the wellness, fitness, beauty, fashion, health, entertaining, pets, and finance categories. She is also a beauty enthusiast and contributes many articles to the PS Beauty editorial site.",
    "author": "Aviel Kanter",
    "published": "Fri, 28 Mar 2025 13:40:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/ohU028vOW3LHvJxGi0bVt0ijYOw/0x137:1284x1421/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2022/10/11/923/n/1922153/f1109f106345db9d735ec2.53716891_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Reviews",
      "Beauty Trends",
      "Hair",
      "Hair Trends",
      "Haircuts",
      "Hype Check",
      "Editor Experiments"
    ]
  },
  {
    "id": "1803b76b-d404-4206-a800-b3e46d18ca41",
    "title": "What Is My Skin Undertone? Take This Quiz to Find Out",
    "link": "https://www.popsugar.com/beauty/skin-undertones-49320617",
    "description": "When it comes to choosing the most flattering makeup hues (and especially when finding a concealer or foundation shade), it's important to consider your skin's undertone: are you a warm, cool, or neutral? How it works is basic color theory: picking the right colors based on your hair color, eye color, and natural skin undertones will accentuate your features and make you glow. Still, learning how to tell your undertone isn't always the easiest task. Unless you're a professional makeup artist, it can be tricky to tell if you're actually warm-toned or cool-toned (or somewhere in between). Luckily, there are hacks to make it easier - and they don't include paying a visit to a makeup counter. We created an easy quiz below to help you uncover more about your complexion. By answering just six quick questions, you'll learn how to tell how to find your undertone, putting to rest the question you've been asking yourself once and for all. Warm Undertone Skin If you have a warm undertone, it typically means you have skin with yellow undertones, as well as gold and peach. This means makeup with brown, gold, and copper-toned shades look best on you. So if you're feeling stumped on eyeshadow colors to try, those are always a safe bet. It also means foundations that lean more yellow and golden will complement your skin color. With the latter, you can also look for the letter \"W\" before a number in the shade name. Cool Undertone Skin If you have cool skin undertones, you probably have hints of pink skin undertones, as well as blue. Equally cool colors, such as jewel tones in the blue, purple, and green color family will look especially flattering on you. Your best foundation match will also have a bluish or pink tint to it. To make it easy, some brands add the letter \"C\" before a number in the shade name to help people with cool undertones skin find the right color. Neutral Undertone Skin A neutral undertone is neither warm nor cool - it's right in the middle. This means that you have options in terms of colors. Every shade, no matter if it's warm or cool, will complement your skin tone. With foundations, specifically, you'll be able to choose either undertone family or go for the neutral category, which many beauty brands have started adding to their lineups in recent years with an \"N\" on the label. Quiz: What Is My Undertone? If you're wondering how to find your undertone, this skin undertone test will help you determine if you're warm, cool, or neutral - plus, we'll offer helpful tips on making your makeup color selections a breeze. Note: it's best to do the following test in natural light (so move toward a window or go outside) with a freshly washed face. Also, pull your hair back and keep your shoulders bare so you get a true sense of your natural coloring. This is key for how to tell your skin undertone. So, what undertones do I have, you ask? Keep scrolling to find out. 1. Look at the inside of your wrist. What color do your veins predominately appear? A) More blue B) More green C) Hard to tell if they are blue or green 2. Picture yourself (or better yet, actually do it) in a yellow or orange shirt. How do you look? A) Not so great. Where's a blue top? B) Terrific - it gives me a great glow C) I can wear pretty much any color and look fine 3. What metal jewelry do you prefer on your skin? A) Silver B) Gold C) Either appeals to me! 4. Place a piece of white paper next to your bare face. How does your complexion look? A) Pretty good! I don't see any pronounced shadows here B) Pretty bad! My complexion is sallow and dull. Why did you make me do this? C) OK. Why am I holding this paper? 5. What happens to your skin when you are out in the sun without sunscreen? A) I burn - fast B) I tan C) I start with a tan but can burn if I stay out too long 6. What color flecks are in your eyes? A) Blue or gray B) A little bit of both C) Golden or hazel Undertone Results If You Got Mostly A's: You Have Cool Undertones If you fall into this category - like Billie Eilish, Anne Hathaway, and Lupita Nyong'o - try sticking to jewel-toned makeup and clothing, including blue, purple, blue-green, green, magenta, and bluish-red shades. For foundation, you'll probably look best in formulations with a bluish or pink undertone. And be sure to reach for the black, dark blue, or purple mascara when it comes to eye makeup: it's sure to make your eyes pop. Click over here to discover the makeup to buy and wear for cool undertones. If You Got Mostly B's: You Have Warm Undertones If you fall into this category - as celebrities like Jennifer Lopez and Beyoncé do - try sticking to earthier colors of makeup and clothing, such as yellow, orange, brown, orangey-reds, and yellow-green shades. For foundation, you'll probably look best in formulations with a yellow or golden undertone. And be sure to reach for the brick-red lipstick (as opposed to the bright blue-red) when it comes to a night out on the town: it's sure to make your complexion pop. Click over here to discover the makeup to buy and wear for warm undertones. If You Got Mostly C's: You Have Neutral Undertones Like Zendaya and Jennifer Aniston, you have neutral undertones, which means you can wear any shade that appeals to you. (Lucky you!) It's up to you if you prefer cooler makeup tones or warmer shades, so experiment with both to see what you like best, or switch it up depending on the jewelry or clothing you're wearing. Our best tip? Stay away from foundations that are geared for yellow skin tones - they'll make you look sallow. Experiment with rose gold shades since they have a little bit of warm and cool mixed in them. Click over here to discover the makeup to buy and wear for neutral undertones. - Additional reporting by Jessica Harrington Jessica Harrington (she/her) is the senior editor of PS Beauty, where she oversees coverage around makeup, skin care, hair, tattoos, and more. With more than eight years of industry experience, she has interviewed countless celebrities, reported on hundreds of beauty trends, and swatched more lipsticks than she can count. Prior to PS, Jessica worked for publications such as Makeup.com, Skincare.com, and The Zoe Report. Melissa Liebling-Goldberg was a former director of PS Beauty and Fashion.",
    "author": "Melissa Liebling-Goldberg",
    "published": "Fri, 28 Mar 2025 13:05:02 -0700",
    "image": "https://media1.popsugar-assets.com/files/thumbor/FK2-weFYaP7Jw1QlloGtZJJaJlo/1765x0:6901x5136/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/10/22/911/n/1922153/aa88019867181068efdf85.84425330_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Makeup",
      "Skin Care",
      "Quiz"
    ]
  }
]
