[
  {
    "id": "c4ba3007-7fff-4b2a-b0d2-08ff34adc132",
    "title": "Chanel Spring Summer 2025",
    "link": "https://thebeautylookbook.com/2025/01/chanel-spring-summer-2025.html",
    "description": "Chanel Spring Summer 2025. Starting off the year with a look at the prettiest spring colors from Chanel.",
    "author": "Sabrina",
    "published": "Thu, 09 Jan 2025 20:32:03 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2025/01/Chanel-Beauty-Spring-Summer-2025.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/brand/chanel' target='_blank' style='color:currentColor;text-decoration:none;'\u003eChanel\u003c/a\u003e",
      "Chanel"
    ]
  },
  {
    "id": "e09ea927-596b-41c9-8de0-af7879212bb2",
    "title": "Favorite Perfumes of 2024",
    "link": "https://thebeautylookbook.com/2024/12/favorite-perfumes-of-2024.html",
    "description": "Favorite Perfumes of 2024. Rounding up the best scents this year including a few new discoveries!",
    "author": "Sabrina",
    "published": "Wed, 18 Dec 2024 20:05:27 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/12/Best-Perfumes-2024-Celine-Phlur-CreedFragrance.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/beauty-favorites' target='_blank' style='color:currentColor;text-decoration:none;'\u003eBeauty Favorites\u003c/a\u003e",
      "Fragrance"
    ]
  },
  {
    "id": "f5661636-f821-428a-8354-0ca72a7df057",
    "title": "Here’s the Secret to Olivia Rodrigo’s Bambi Lashes",
    "link": "https://www.elle.com/beauty/makeup-skin-care/a63385782/olivia-rodrigo-lancome-mascara-campaign-2024/",
    "description": "The singer is in her long lash era.",
    "author": "",
    "published": "Wed, 15 Jan 2025 17:22:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "dd4e5545-1c9e-41b0-b74d-bc5ba5f878c7",
    "title": "The 10 Best Tinted Lip Balms for Easy Color On-the-Go",
    "link": "https://www.elle.com/beauty/makeup-skin-care/g63386240/best-tinted-lip-balm/",
    "description": "Soothe and dress up your pout in one swipe.",
    "author": "",
    "published": "Tue, 14 Jan 2025 21:31:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "685473f5-7234-4c1e-aba1-7adf61faba8b",
    "title": "SickScience: A 'Biohacking' Skin- and Hair-Care Brand Created by Molecular Scientists",
    "link": "https://fashionista.com/2025/01/sickscience-skin-hair-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. SickScienceHeadquarters: Istanbul, TurkeyE-commerce: sicksciencelabs.comSocial ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 15 Jan 2025 15:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyMDIzMDg4MzI4NDg0ODQw/sickscience-brand-bio-1.png",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Beauty",
      "Brand Bio Skin Care",
      "Brand Bio Hair Care",
      "Brand Bio",
      "Brand Bio Beauty",
      "Indie Beauty",
      "Sickscience",
      "Network",
      "Shopping",
      "Beauty"
    ]
  },
  {
    "id": "ee85d4ed-367a-4fae-b93c-910d4e4ccba1",
    "title": "SkinGPT Uses AI to Simulate the Long-Term Results of Skin-Care Products",
    "link": "https://fashionista.com/2025/01/skingpt-haut-ai-skin-care-results-simulation",
    "description": "Skin care is getting the virtual try-on treatment. It's one thing to virtually \"apply\" foundation or lipstick to find your best shade (a feature brands have been using on their e-commerce platforms for years). But it's a whole other feat to digitally augment skin's predicted appearance over time ...Continue reading",
    "author": "Janelle Sessoms",
    "published": "Wed, 15 Jan 2025 13:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjEyMTE4NjgxNjg0MDI2OTE1/skingpt-ai-skin-care.png",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Network",
      "technology",
      "AI",
      "fashion tech",
      "Skin Care",
      "Beauty",
      "Business",
      "facial recognition technology",
      "Skincare"
    ]
  },
  {
    "id": "75300edc-974b-47fd-868a-adabcd5d2a60",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "bce7b25b-1066-4069-990c-19d2b79cf154",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "9a8c5ec1-d901-4f48-996c-f738c446661f",
    "title": "Amber Grimes, Executive Vice President and General Manager, Love Renaissance",
    "link": "https://intothegloss.com/2025/01/amber-grimes-love-renaissance-beauty-routine/",
    "description": "\"If I walk in somewhere and someone doesn’t say, ‘Oh, you smell good,’ or ‘Someone in here smells good,’ we have a problem.\"",
    "author": "",
    "published": "Thu, 09 Jan 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "a5fc4a19-b423-49d3-8edd-1454c6572ee0",
    "title": "Making Up The Star of *Emilia Pérez*",
    "link": "https://intothegloss.com/2025/01/karla-sof%C3%ADa-gascon-palm-springs-film-festival-beauty/",
    "description": "Makeup artist Vincent Oquendo on how he prepped Karla Sofía Gascón for a winning night at the Palm Springs Film Festival",
    "author": "",
    "published": "Sat, 04 Jan 2025 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "9420277b-7379-4256-add7-7d40f0787969",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "3fc95ab2-feb2-40b9-a35d-d3564c194fff",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "b9220e30-dd8b-45e9-b4df-974ce52b17bf",
    "title": "Refinery29 Loves: Everything To See \u0026 Shop In January",
    "link": "https://www.refinery29.com/en-us/fashion-beauty-news-january?utm_source=feed\u0026utm_medium=rss",
    "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find the best things to shop and see in fashion and beauty right now.Stepping into a new year can often feel like you’re a bear who’s woken up halfway through hibernation. Thankfully, 2025 has plenty of glamorous occasions to keep us entertained as we shake off the shock, dust off our laptops, and jump back into the grind. The Golden Globes kicked off awards season with a long list of fashion and beauty knockout moments. Our favorites of the night were Ayo Edebiri’s ‘90s Julia Roberts-inspired gray Loewe suit, Zendaya’s burnt orange satin Louis Vuitton gown, and Kylie Jenner’s direct homage to Elizabeth Hurley’s backless Versace number, which really got the people talking. While our gaze is fixed on the red carpet for more amazing looks as the season ramps up, we’re also keeping an eye on the exciting launches happening in the fashion and beauty space this month. From a new Fenty Skin cleanser to a Louis Vuitton collaboration, click through to see all the new goodies heading your way this January.Louis Vuitton x Murakami Re-Edition CollectionWith Zendaya fronting the campaign, Louis Vuitton is straight out of the gate with the collaboration of the year. Twenty years after its first collection with Japanese artist Takashi Murakami, the French luxury house is back with an internet-breaking re-edition. Leaning into Y2K nostalgia in all the right ways (Paris and Britney were both OG fans), the assortment includes the iconic bright monogrammed Speedy Bandoulière 25 bag, slingback mules, patterned silk scarves, and even a skateboard complete with the Superflat Panda — because why not? Shop at Louis Vuitton nowLouis Vuitton x Takashi Murakami Speedy Bandoulière 25, $, available at Louis VuittonJ.Crew Teams Up With AraksBefore launching her luxury intimates line Araks, Araks Yeramyan was a member of J.Crew’s design team. Now, the two have reunited with a limited-edition collection of lingerie and loungewear. The Araks x J.Crew capsule features a range of underwear and sleepwear featuring bold colors and elegant design details — think ice blue cotton-silk embroidered pajamas, berry-tinted bralettes, and a color-blocked slip dress with scalloped trims. “The pieces are both effortless and considered, chic without trying too hard,” Yeramyan said of the collab. “These are the clothes you’ll reach for without thinking, yet always feel good in. They carry a quiet confidence, the kind of ease that makes them as much a gift to yourself as anyone else.” Shop now at J.Crew Araks x J.Crew Midi Slip Dress, $, available at J.CrewAraks x J.Crew Beatrice Bralette, $, available at J.CrewPHLUR Golden Rule EDPPHLUR, the brand behind the viral Missing Person fragrance, is back with a new hypnotic scent. Enter: Golden Rule. Encased in a shimmering gold bottle, the brand describes the eau de parfum as “sensual,” combining notes of juicy mandarin and pink pepper with smooth coconut milk, vanilla cream, and orange flower. Warm and feminine, the fragrance is perfect for imbuing a sprinkle of summer into cold winter nights.Shop now at PhlurPhlur Golden Rule Eau de Parfum, $, available at PhlurRixo x Stripe \u0026 StareRixo is known for its playful prints and feminine silhouettes; Stripe \u0026 Stare is recognized for its ultra-comfortable and consciously-made underwear. The only question we have is: How has it taken this long for the two London-based brands to join forces? The Rixo x Stripe \u0026 Stare features must-have essentials (different cuts of underwear, camisoles, bodysuits, and even baby tees) in covetable and cutesy patterns — such as heart- and leopard-prints and florals — and a pair of briefs with the phrase “forget me not” etched across them. Pieces are available in US sizes 2 to 22, and made with 95-percent biodegradable fabric.  Shop at Rixo and Stripe \u0026 Stare on January 16 Fenty Skin Cherry Dub CleanserWhile we start yet another year screaming “Where is the album?!” to the sky, Rihanna remains booked and busy, launching a new lightweight gel cleanser. The product is all about harnessing the Barbados cherry, which is rich in vitamin C. Here the brightening ingredient is combined with niacinamide to improve skin texture and aloe juice for soothing inflammation. Shop now at Fenty BeautyFenty Beauty Cherry Dub Pore Purify'r Gel Cleanser, $, available at Fenty BeautyLoewe x OnSwiss running shoe brand On is one of the fastest growing brands on the market, working with megawatt talent like Zendaya and collaborating with buzzy designers like Jonathan Anderson through Loewe. Having previously reimagined the original Cloudtilt silhouette, Loewe is now revamping the Cloudtilt 2.0 in four accent colorways: all white, fiery orange, khaki, and royal blue. With a sole made of ultra-light EVA foam, these shoes are as comfortable as they are coveted.Shop now at LoeweLoewe x On Cloudtilt 2.0 Sneaker, $, available at LoeweSleeper 10th Anniversary CollectionThe Ukrainian sleepwear experts celebrate its 10th anniversary by launching its very first jersey products as part of the pre-spring 2025 collection. Sitting firmly in the elevated loungewear category, the drop features long-sleeve stretch tees adorned with detachable white feather cuffs, ribbed cotton capri leggings, comfy sweatshirts, short-sleeve T-shirts, and wide-leg joggers alongside a host of more “classic” Sleeper styles, including pink asymmetric dresses and lavender gingham pajamas. Shop now at SleeperSleeper Long Sleeve Stretch-Cotton Jersey T-Shirt with Detachab, $, available at SleeperSol de Janeiro Beija Flor Elasti-Body OilEver since Jodie Turner-Smith preached the benefits of body oil in her epic shower routine, we’ve been on the hunt for a new one to try. Brazilian Bum Bum Cream creators Sol de Janeiro are stepping up to the plate this month with the launch of a lightweight body oil scented with pink dragon fruit and hibiscus. Cacay oil is said to boost collagen and elastin production, while squalane plumps and amaranthus flower seed extract moisturize deeply. Be sure to apply to damp skin for maximum hydration.Shop now at SephoraSol de Janeiro Beija Flor Body Oil, $, available at SephoraLevi's x UNDERCOVERIn honor of its 35th anniversary, Japanese luxury streetwear brand Undercover has once again teamed up with Levi’s. The second collaboration between the two brands fuses their rich heritages. The nine-piece collection includes pieces like a denim trucker jacket with detachable zip detailing (a reference to Undercover’s fall/winter 1998 collection), a pair of 501 jeans with an embroidered zigzag pattern, and apparel with archival Undercover graphics. Red Hot Chili Peppers bassist Flea stars in the campaign to promote the new drop. Shop at Levi’s on January 18 Jenny Bird Love CollectionValentine’s Day is just around the corner, meaning we’re allowed to continue buying gifts for others (and ourselves). Toronto-based jewelry designer Jenny Bird is keeping things classic with an array of heart-shaped accessories including a padlock heart pendant necklace, heart button studs, and a gold ring adorned with a dangling heart charm. Our favorites have to be the subtle heart puff earrings, which appear sculptural from the front and more abstract from the side view — perfect for the lovergirls who like to keep things on the down-low. Shop at Jenny BirdXO, Kitty x Good Light CosmeticsFor the rom-com lovers among us, the return of To All The Boys spinoff XO, Kitty is a welcome distraction from the miserable January weather. Not only is the show coming back to Netflix for a second season (with Peter Kavinsky in tow), it’s also teaming up with Korean beauty brand Good Light to launch a limited-edition lip bundle. The kit’s main gem is the Multi-Peptide Lip Nectar, a non-sticky lip hydrator with ingredients including lychee, vitamin C, glycerin, and yuzu seed peptide. There’s even a collectable keychain included in the backpack-inspired packaging.Shop from 16th January at Beauty BayLike what you see? How about some more R29 goodness, right here?These Are The Biggest Denim Trends For 2025These 8 Color Trends Will Dominate Fashion In 2025The 8 Shoe Trends You'll See Everywhere In 2025",
    "author": "Alicia Lansom",
    "published": "Wed, 15 Jan 2025 16:10:55 +0000",
    "image": "https://www.refinery29.com/images/11839332.jpg?auto=webp\u0026width=730\u0026height=730\u0026quality=85\u0026crop=1:1",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "b47ad192-ea1f-4e6f-ab8b-0a9627afe746",
    "title": "I Had My Hair Dyed Mocha Mousse \u0026 It Totally Reset My Confidence",
    "link": "https://www.refinery29.com/en-us/mocha-mousse-hair-color-trend?utm_source=feed\u0026utm_medium=rss",
    "description": "Every year, color-matching company Pantone picks a shade that is destined to dominate design, fashion and beauty over the next 12 months. For 2025, the much-anticipated hue was revealed to be Mocha Mousse. Described as a “warming, brown hue imbued with richness”, it’s milk chocolate and creamy coffee swirled into the most sophisticated neutral shade imaginable. TikTok is already eating it up. There you’ll find over 11,000 posts hashtagged #mochamousse, all showcasing how the shade can work everywhere, from interiors to fashion — and even hair.  Mocha Mousse is a noticeable pivot from last year’s loud-and-proud hair colors like cowgirl copper and cherry cola red, or the golden blonde with curtain bangs made famous by Sabrina Carpenter. By contrast, Mocha Mousse is more understated. It’s a multidimensional rich brown that puts brunettes firmly back in the spotlight. Celebrities like Hailey Bieber, Zendaya and Bella Hadid have all debuted their take on the trend recently, cementing its status as the hair color of the moment. @pantonetiktok Introducing Pantone Color of the Year 2025: PANTONE 17-1230 Mocha Mousse☕️🍫 An evocative soft brown that transports our senses into the pleasure and deliciousness it inspires as the Pantone Color of the Year selection for 2025. A warming rich brown hue, PANTONE 17-1230 Mocha Mouse nurtures with its suggestion of the delectable quality of cacao, chocolate and coffee, appealing to our desire for comfort. Infused with subtle elegance and earthy refinement, PANTONE 17-1230 Mocha Mousse presents a discrete and tasteful touch of glamour. A flavorful brown shade, PANTONE 17-1230 Mocha Mousse envelopes us with its sensorial warmth. Learn more about PANTONE 17-1230 Mocha Mousse in our link in our bio. #pantone. #pantonecoloroftheyear #mochamousse ♬ original sound – Pantonetiktok Naturally I’m a cool-toned brunette but my hair is quite light — and it can be dull, too. I’ve always chased golden or honeyed tones as well as dimension in my hair. Serena van der Woodsen’s iconic, sun-kissed lengths on Gossip Girl were my gold standard, leading to years of blonde highlights and balayage (plus one brief flirtation with liquid brunette). But after years of bleaching, I’ve found myself craving shine, depth and health without losing the warmth and those light-reflecting strands I love so much. When I spotted the Mocha Mousse trend, it felt like the perfect, non-intimidating way to transition back to my roots (pun intended) while keeping the warm tones and brightness intact. I booked an appointment at Hare \u0026 Bone salon in London’s Fitzrovia where I asked master stylist Chloe Phelps to work her magic. Without entirely spoiling the result, Mocha Mousse is just as transformative as I’d hoped it would be.  @haircvlt_hackney Why is everyone so disappointed when this is my favourite Pantone EVERRRRR!!! Hoping to see loads of Mocha Mousse inspired hair in 2025 🤎 . . . . #pantone2025 #mochamousse #eastlondonhairstylist #londonbalayage #londonhair #londonhairstylist #londonhairdresser #hackneyhairdresser #hackneyhair #eastlondon #hackney ♬ act ii: date @ 8 – 4Batz What actually is Mocha Mousse hair? Before I sat in the chair, I had to ask: What makes Mocha Mousse special? “The Mocha Mousse trend is a luxurious, expensive and multidimensional mix of browns and beiges,” Phelps explained. “Think rich, glossy tones that can be tailored to anyone.” The key lies in its adaptability; it’s not just another brown. What sets Mocha Mousse apart from your typical deep brunette shades is its ability to balance earthy tones with subtle hints of warmth or coolness depending on your personal preference. This gives it a truly bespoke feel. While Pantone’s announcement certainly catapulted Mocha Mousse into the spotlight, its appeal runs deeper. Winter typically brings a surge of clients craving richer, multitonal hair colors, Phelps explained, but unlike many seasonal trends that come and go, Mocha Mousse feels like it will remain a staple well into spring and summer. “This mix of tones is so diverse and adaptable that I think it will stay around for a while,” Phelps told me. Its versatility makes it more than just a fleeting trend, she said. In fact, it’s a classic in the making. How is the Mocha Mousse hair color achieved? The process of achieving the Mocha Mousse hair color depends on your starting point. For light blondes, Phelps suggests adding tone and depth back into lightened hair through a global application, which is the process of applying a single — or block color — dye to the hair from the root right through to the tip. In this case, it would be a shade of brunette that complements your individual skin tone.  For me, Phelps opted for a “reverse” brunette balayage — a hand-painting technique that blended darker hues seamlessly with my lighter strands. Phelps then added caramel-toned pieces to create a multidimensional look. The result was rich yet soft and natural. For those with natural brunette hair, Phelps said that your colorist is likely to add pops of color. This can be achieved using bleach or a high-lift tint. The latter allows you to lift the natural pigment in your hair by a handful of shades, resulting in lighter pieces. Typically, it’s not as extreme or damaging as bleach. Whether you’re starting with bleached hair like me, or a deep brunette base, the Mocha Mousse trend proves that brown hair is anything but boring. @hairbylisamathews Reverse balayage for the win My client wanted a more rooted look with dimension but still see brighter pops of blonde for fall. We were obsessed with how it turned out!! I used @matrix color sync for her root melt and @redken shades EQ for the lowlights and All over gloss Formula: Root Melt formula 5n 6na lowlights: 06G 06ABN All over gloss: 09P 09AA Board is by @Cooboard llc use code “Lisa20” for 20% off Foils are @STYLETEK® use code “Lisa20off” for 20% off Never let go foiling comb is by @pinkpewter Have questions drop them below #summertofallhair #hairtransformation #beforeandafterhair #hairreels #hairappointment #blondetolivedin #fallblonde #haireducation #haired #redkenshadeseqformulas #redkenshades #hairvideos #fallhairtrends #lowmaintenancehair #reversebalayage #mochamoussehair ♬ Dirty Cash (Money Talks) – PAWSA \u0026 Adventures Of Stevie V Who might suit the Mocha Mousse hair color trend? If you’re wondering whether the Mocha Mousse hair color trend is right for you, I have good news: There’s a version for everyone. “It’s a shade that can be customized for anyone looking for glossy, muted tones,” Phelps said. “The key is tailoring the amount of warmth or coolness to the client’s skin tone,” she continued.  A short consultation before your actual hair color appointment is crucial to achieving that perfect match. Happily, Mocha Mousse pairs beautifully with a wide range of hair textures and styles, too. “It would work on all hair types,” said Phelps. “Depending on length and thickness, different [dye] applications can be used to add the appearance of thickness, dimension and different hues. Shorter styles like pixies or crops look stunning with an all-over application, while bobs and longer styles benefit from added dimension,” Phelps added.  View this post on Instagram A post shared by Joanne Chung (@hairxjojo) How do you maintain Mocha Mousse hair color at home? The best thing about the Mocha Mousse hair color trend is that it’s refreshingly low maintenance. Phelps recommends semi-regular salon visits to keep the color rich and lustrous (typically every eight to 12 weeks), paired with color-protecting shampoos and conditioners to prevent fading.  R29 rates Color Wow Color Security Shampoo, $32.50, and L’Oréal Professionnel Vitamino Color Care Shampoo, $54. After years of expensive root touch-ups as a blonde, I’m embracing the simplicity, using this as a chance to give my hair some much-needed TLC. Repair masks and treatments are now in regular rotation as I work on growing out the broken, bleach-damaged pieces around my hairline. While my strands aren’t magically restored, they already look shinier and healthier.  View this post on Instagram A post shared by J A D E 🤍 (@jadebentxo) What is the Mocha Mousse hair colur like IRL? I’ll be honest: I was nervous about going back to being a brunette. Every time I’ve dabbled in darker hair before, it seemed to wash out my skin and so I relied on bronzer and fake tan to bring some life back to my face. This time it’s different.  When Phelps spun me around to face the mirror, I exclaimed, “Oh my god, where has this option been all my life?” I love it so much. My hair looked shiny, dynamic and, dare I say it, expensive. The rich tones made my light eyes pop, and for the first time as a brunette, I didn’t feel the urge to grab my makeup bag or self-tan.  I’m thrilled with the warmth and depth that Mocha Mousse has afforded my hair, and I can see myself sticking with it. With the arrival of summer, I might dream about tiptoeing into bronde territory for a sun-kissed, boho vibe, but for now I’m soaking up the compliments on my transformation, not to mention the sheer ease of it all.  Mocha Mousse feels like a reset for both my hair and my confidence. Whether you’re a brunette looking to switch things up or a blonde ready to give your hair (and bank balance) a break, it might just be the ticket to a glossy, low-maintenance hair color.  This story was originally published on Refinery29 UK. Like what you see? How about some more R29 goodness, right here?16 Fresh Hair Color Trends \u0026 How To Ask For ThemShould You Wash Your Hair After Every Workout?15 Fresh New Year Haircut Trends For January 2025",
    "author": "Izzie Deibe",
    "published": "Wed, 15 Jan 2025 16:00:38 +0000",
    "image": "https://www.refinery29.com/images/11840694.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "283a4a2c-87e7-47ef-85a2-e0865f82f9f7",
    "title": "There's No Way Banana Peels Are Better Than Botox, Right?",
    "link": "https://www.popsugar.com/beauty/banana-peels-wrinkles-49155233",
    "description": "Oh, TikTok. Some days we love you, and some days we want to delete you from our phones forever. There are times when we truly can't imagine living without you - I mean, you have taught us about some of our favorite skin-care trends, like \"skin cycling,\" \"streaming,\" and even \"skin flooding.\" However, you've also taught us plenty of things that are better left forgotten - like using hemorrhoid cream to get rid of undereye bags and slathering on calamine lotion as a makeup primer. The app's latest claim? Rubbing banana peels all over your face can get rid of wrinkles and replace the need for neurotoxins like Botox. Sounds wild, right? While initially we weren't convinced, the number of people on the platform claiming it really works gave us pause. To settle the debate once and for all, ahead, we speak with skin-care experts to pick their brains about whether or not using banana peels on your face is beneficial. Experts Featured in This Article Greeta Yadav, MD, is a board-certified dermatologist and founder of FACET Dermatology. Kunal Malik, MD, is a board-certified general and cosmetic dermatologist. Nina Sedighi, PA-C, is a physician associate in Beverly Hills. The Benefits of Using Banana Peels on Your Skin Put simply: yes, there are some benefits to rubbing banana peels on your skin - but TikTok doesn't have it completely right. \"There are no concrete, scientific studies supporting the use of banana peels on the face or skin in general,\" board-certified dermatologist Kunal Malik, MD, says. \"We do know that banana peels contain many bioactive compounds including antioxidants such as ascorbic acid, carotene, and cyanidin, and antioxidants protect the skin from inflammatory activity and damage.\" Additionally, Dr. Malik adds, \"Banana peels additionally are rich in tannins and vitamin A, which is found in retinols and retinoids, and both of these compounds can be helpful for toning and tightening the skin.\" However, despite being packed with these good-for-you ingredients, Dr. Malik says that it's unlikely they'll do anything when used in this form. \"The reality is that the skin-beneficial compounds found in [banana peels] are likely not being absorbed by the skin at the molecular level, and any topical benefits, if at all, would be short-lived and temporary. You're better off eating bananas than putting them on your skin.\" Are Banana Peels Safe For Your Skin? If you want to go ahead and try rubbing banana peels all over your face in hopes that it might reduce wrinkles, experts say you can totally go for it - with one caveat. \"There's nothing hazardous about using banana peels on your face,\" Dr. Yadav says. \"Unlike the lemon skin-brightening 'hack,' banana peels are not acidic and are nonirritating.\" It should go without saying that anyone with a known banana allergy should avoid doing this. \"Allergic reactions to banana peels will counterproductively produce inflammation, which can then lead to stubborn hyperpigmentation that can be difficult to treat,\" Dr. Malik says. Can Using Banana Peels on Your Face Replace Neurotoxins? The short answer? No. \"Any topical ingredient, especially banana peels, are unlikely to have a comparable wrinkle-reducing impact to a neurotoxin such as botox,\" Dr. Malik says. Board-certified dermatologist Greeta Yadav, MD, agrees, adding, \"While topical products help reduce the look of wrinkles on the surface, neurotoxins like Botox prevent the muscles underneath the skin from contracting and creating those wrinkles in the first place.\" Proven Wrinkle Treatments to Try Instead \"Botox is the most effective treatment for wrinkles,\" says physician associate Nina Sedighi, PA-C. \"The results generally last three to four months, and it's also a preventative treatment because it works by tackling the causes of wrinkles, which is facial muscle activity.\" In addition to using neurotoxins to treat wrinkles, both Dr. Malik and Dr. Yadav say that they recommend a skin-care regimen that includes vitamin C, retinoids, and sunscreen. \"Retinoids are the only class of ingredients clinically proven to reverse the signs of aging by promoting new collagen and stimulating cellular turnover,\" Dr. Yadav says. \"Vitamin C also triggers new collagen production while protecting skin against damaging free radicals, and sunscreen is critical for defending your skin against UV damage.\" Can Eating Bananas Impact Your Skin? If you're dead set on using bananas in your routine, Dr. Malik and Dr. Yadav both agree that consuming them might be a better option. \"Bananas are a valuable part of a balanced diet,\" Dr. Yadav says. \"They're naturally rich in potassium, which helps balance your body's hydration, and hydrated skin glows and looks healthier than dehydrated skin.\" Renee Rodriguez (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for PS's TikTok and Instagram accounts.",
    "author": "Renee Rodriguez",
    "published": "Wed, 15 Jan 2025 14:35:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/vWCNXdupEPbIhCnyjpEXtMs6EJE/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2025/01/15/950/n/1922153/8b23b50d67882d1f597237.55854408_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty News",
      "Beauty Trends",
      "TikTok",
      "Skin Care"
    ]
  },
  {
    "id": "3e65b722-495a-4683-9172-4969441b031f",
    "title": "I Never Liked My Hair Air-Dried Until I Tried the \"Twist and Clip\" Method",
    "link": "https://www.popsugar.com/beauty/twist-clip-hair-editor-experiment-48908792",
    "description": "I am a minimalist at heart. I love simple outfits, easy makeup, and hairstyles that take little to no effort. While I occasionally find myself going all out with my looks, more often than not, you can find me doing the bare minimum, especially when it comes to my hair. I only wash it twice a week at most, which means I only style it twice a week as well. I typically give myself a blowout, but in the summer months when the weather is warmer, I try to give my hair a break from heat as much as possible, which often leaves me searching for different heatless hair methods. I recently stumbled across a video of Dianna Cohen, the founder of hair-care brand Crown Affair, showcasing her \"twist and clip\" method for air-drying her hair. In the video, Cohen utilizes two hair clips to give herself heatless waves that look incredible. When I heard her describing her method as the \"no-makeup-makeup vibe for hair,\" I knew I needed to test it out for myself. @crownaffairhq Our Founder, @Dianna Cohen, shares her technique for heatless waves using our haircare favorites as well as our newest launch, The Clips. #clawclip ♬ original sound - Crown Affair To test the hack, the only things I needed were two small clips. Then, after washing my hair and hopping out of the shower, I wrapped it in a microfiber towel to soak up some of the moisture. After about 20 minutes, once my hair was damp but mostly dry, I took it out of the towel and applied my favorite leave-in conditioner, the Gisou Honey Infused Leave-In Conditioner ($34). I also applied the Gisou Honey Infused Hair Oil ($25). After combing everything through with a wide-tooth comb and dividing my hair into my normal middle part, it was time to test out Cohen's hack. I started by dividing my hair into two sections, the top half being one section and the bottom half being the other. From there, I took the top half and began twisting small sections on either side back into tiny rope-like hair twists. I then clipped them together. The final step was to take the bottom half of my hair and divide it into two sections, and then twist them in a backward motion the same way I did with the top. I ended by clipping the bottom sections together just as I did with the top half. While it might sound confusing, trust me: it's easy to master. It wasn't until I tested it out for myself after watching Cohen do it in her TikTok videos that I realized just how simple it was. After letting my hair sit for about 30 minutes, I took out the clips and released my hair. The twist-and-clip method left me with soft waves that gave me tons of bounce - my curtain bangs even had a perfect swoop to them. I've tested this hack quite a few times since my initial run, and I've found there are a few key things that help my hair look its best. To start, I add in a wave spray or a beach spray after my leave-in conditioner. I've found that it gives my hair more texture and helps the style stay in place for a longer period of time. I like to finish things off with the Crown Affair Finishing Hair Spray ($38), which won a PS Beauty Award this year. I have fine hair that falls between straight and wavy, so this hack would probably work best for people with similar textures that need a little help enhancing a curl. It definitely achieved that for me - it was easy to do and made my hair look cute with minimal effort. Ever since stumbling upon Cohen's video, I've been utilizing this method a lot, and I don't plan to stop anytime soon. Renee Rodriguez (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.",
    "author": "Renee Rodriguez",
    "published": "Wed, 15 Jan 2025 12:50:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/3id6JApCYdk3sQofDxFKwVCw4jk/0x723:2316x3039/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2022/08/04/952/n/1922153/13498e4562ec3f4c512541.81651033_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Hair Tutorials",
      "TikTok",
      "Hair",
      "Editor Experiments"
    ]
  }
]
