[
  {
    "id": "bc6fbcb6-60aa-4110-9fe8-ad1cb40209aa",
    "title": "Best Black Friday Sales 2024",
    "link": "https://thebeautylookbook.com/2024/11/best-black-friday-sales-2024.html",
    "description": "Best Black Friday Sales 2024. Rounding up the best sales for beauty, fashion and big retailers.",
    "author": "Sabrina",
    "published": "Fri, 29 Nov 2024 11:08:45 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/11/Best-Black-Friday-Sales.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/sales' target='_blank' style='color:currentColor;text-decoration:none;'\u003eSales\u003c/a\u003e",
      "Sales"
    ]
  },
  {
    "id": "b9abbaec-0ece-4e7d-9422-7eb819cb4351",
    "title": "Holiday Gift Guide Edit 2024",
    "link": "https://thebeautylookbook.com/2024/11/holiday-gift-guide-edit-2024.html",
    "description": "Holiday Gift Ideas 2024. Gift ideas for the fragrance lover, luxury beauty edit, travel gift picks and options for the home and hostess!",
    "author": "Sabrina",
    "published": "Wed, 27 Nov 2024 17:53:27 +0000",
    "image": "https://thebeautylookbook.com/wp-content/uploads/2024/11/Holiday-Gifts-For-Her-2024-Beautylookbook.jpg",
    "source": "https://thebeautylookbook.com/feed",
    "categories": [
      "\u003ca href='https://thebeautylookbook.com/category/gift-guide' target='_blank' style='color:currentColor;text-decoration:none;'\u003eGift Guide\u003c/a\u003e"
    ]
  },
  {
    "id": "99ef01ac-c8e6-476b-93e8-af4f049ec220",
    "title": "The 7 Best Perfume Subscription Boxes to Help You Find Your Signature Scent",
    "link": "https://www.elle.com/beauty/g45101266/best-perfume-subscription-boxes/",
    "description": "Meet your match at a fraction of the cost.",
    "author": "",
    "published": "Wed, 04 Dec 2024 23:00:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "2f8a4551-5052-4dfd-82c1-85855567ac3e",
    "title": "The 5 Best Candle Advent Calendars We’re Running Out to Buy Right Now",
    "link": "https://www.elle.com/beauty/g62654421/best-candle-advent-calendars/",
    "description": "Diptyque, Glasshouse Fragrances, Voluspa, and more brought their A-game this holiday season.",
    "author": "",
    "published": "Wed, 04 Dec 2024 22:47:00 +0000",
    "image": "",
    "source": "https://www.elle.com/rss/beauty.xml/",
    "categories": null
  },
  {
    "id": "659b30a1-0ce1-4cb1-a0b6-7f8eee090b87",
    "title": "Beauty Brands Are Betting on Indie Fashion Collaborations to Capture New Audiences",
    "link": "https://fashionista.com/2024/12/beauty-independent-fashion-brand-collaborations-trend",
    "description": "On the heels of its fashion-forward partnerships with Proenza Schouler, Grace Coddington and Tove, Merit Beauty is further establishing its cross-category collaboration strategy, now venturing into jewelry. The beauty brand teamed up with London-based jewelry label Completedworks to create two ...Continue reading",
    "author": "Catie Pusateri",
    "published": "Wed, 04 Dec 2024 14:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMTQwMTMwMDI1NTE0NDg0/rms-beauty-doen-soiree-set-4.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Network",
      "Collaborations",
      "makeup",
      "jewelry",
      "fashion",
      "Completedworks",
      "Skin Care",
      "Merit Beauty",
      "Beauty",
      "Beauty Brands",
      "Indie Beauty",
      "earrings",
      "Indie Fashion",
      "Business",
      "RMS",
      "Fragrance",
      "marketing",
      "Dôen"
    ]
  },
  {
    "id": "5e2f5fa6-392d-40ba-b23e-fe6b5aebb26d",
    "title": "Beia: A Vegan Body-Care Brand Focused on Intimate Wellness",
    "link": "https://fashionista.com/2024/12/beia-skin-body-care-brand",
    "description": "Brand Bio is Fashionista's guide to the best independent fashion and beauty brands — a resource for retailers, job seekers, B2B companies and consumers alike. If you'd like your brand to be featured, fill out this form. BeiaHeadquarters: New York, NYE-commerce: beiabeauty.com Social Media: ...Continue reading",
    "author": "Fashionista",
    "published": "Wed, 04 Dec 2024 13:00:00 GMT",
    "image": "https://fashionista.com/.image/c_fit%2Ch_800%2Cw_1200/MjExMDAwODI3MDU2MjM2MDc5/beia-brittany-lo-2.jpg",
    "source": "https://fashionista.com/.rss/excerpt/beauty",
    "categories": [
      "Beauty",
      "Brand Bio",
      "Brand Bio Wellness",
      "Brand Bio Skin Care",
      "Beauty Brands",
      "Skin Care",
      "Brand Bio Beauty",
      "Network",
      "Shopping",
      "Beauty"
    ]
  },
  {
    "id": "249de36d-823f-4de1-bcfa-5b43781474a4",
    "title": "Kahyun Kim, Actor",
    "link": "https://intothegloss.com/2024/12/kahyun-kim-st-denis-medical-beauty-routine/",
    "description": "It's a K beauty extravaganza",
    "author": "",
    "published": "Wed, 04 Dec 2024 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "ae2ba170-c394-4ffc-8914-3563982cd76b",
    "title": "Chantal Fernandez, Features Writer, The Cut",
    "link": "https://intothegloss.com/2024/11/chantal-fernandez-the-cut-writer-beauty-routine/",
    "description": "With a new reason to Botox: \"Resting reading face\"",
    "author": "",
    "published": "Wed, 27 Nov 2024 10:30:00 -0500",
    "image": "",
    "source": "https://feeds.feedburner.com/intothegloss/oqoU",
    "categories": null
  },
  {
    "id": "aa8ebd36-9eab-45c2-97f3-b6196b7b8ea2",
    "title": "Nordstrom Anniversary Sale Haul Try-On",
    "link": "http://www.frmheadtotoe.com/2020/08/nordstrom-anniversary-sale-try-on.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-17T12:17:00.016-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "03b65247-4190-4025-b898-a985b34b57b8",
    "title": "Best In-Stock Items! Nordstrom Anniversary Sale Picks 2020",
    "link": "http://www.frmheadtotoe.com/2020/08/best-in-stock-items-nordstrom.html",
    "description": "",
    "author": "Jen",
    "published": "2020-08-13T11:38:00.002-07:00",
    "image": "",
    "source": "http://feeds.feedburner.com/frmheadtotoe",
    "categories": [
      "Nordstrom Anniversary Sale"
    ]
  },
  {
    "id": "701a2b07-1d8d-40de-8e9b-0261fb5e05d2",
    "title": "The Top 5 Bob Haircut Trends For 2025",
    "link": "https://www.refinery29.com/en-us/2024/12/11823303/bob-haircut-trends-2025?utm_source=feed\u0026utm_medium=rss",
    "description": "Here’s the thing about a good haircut: It only takes one photo to spark inspiration. If you’re feeling a little lost this winter, we’re here to help. Bob haircuts are particularly fun because if you’ve been a Refinery29 reader for a while you know, we appreciate the often imperceptible but critical details that make an Italian bob different from a French bob (the former is more cropped to the ears, and the latter is often structural and includes a bang). Here, we’re breaking down the top bob trends of the moment — for winter 2025 — in hopes that they might inspire your next appointment. Find our predictions with imagery for you to save and expert styling advice, ahead. Carved bob View this post on Instagram A post shared by Spoke \u0026 Weal (@spokeandweal) The technique used to create a carved bob gives the hair a very lived-in look, “similar to when you cut hair using a razor,” explains hairstylist Amanda Lee. The cut, which is purposefully grown-out with tapered ends, was popular in 2018 and 2019 and is seeing a resurgence. “It’s a creative cut based on removing weight and creating layers that provide lift and movement into the hair,” explains hairstylist Cassadi Currier. Flipped bob View this post on Instagram A post shared by Lindsey Neavitt (@lindseyneavitt901) Many stylists track the origins of the flipped bob back to the ’60s. “It had a very retro feel,” explains Lee. “Jackie Kennedy is the first name to come to mind when I think of the flipped bob.” There’s an innate elegance to this style but it’s pretty versatile. The current variation is cut short, maybe slightly asymmetrical, and has some polish. For styling, Lee recommends using a hot brush (like the Mane Medium Hot Brush) to give your hair a good flip on the ends and a smoothing balm (she prefers the Emi Jay Angelstick) to polish any flyaways. Fluffy bob View this post on Instagram A post shared by DECEMBER FULLY BOOKED (@hairbyanaiss) A fluffy or “soft-sweeping layered bob” is a modern favorite among stylists. “It’s one of my favorite types of bob haircuts,” says Currier, “and I love that most of them have a deep-set side part.” Lee considers the fluffy bob a modern version of a classic cut. “The fluffy bob is really just a modern take on the classic bob shape, giving it more volume and movement,” she says. To style, she recommends a big round brush, a round brush blow dryer, or a round brush attachment (if you’re using a Dyson). Japanese bob View this post on Instagram A post shared by 菊池 洵 / 美容師 (@jun__kikuchi) “The Japanese bob is also a chin-length bob that really hugs the curvature of the face,” says Currier. “This bob is usually parted in the middle and has gorgeous sweeping layers that go away from the face with blunt ends.” The name comes from the country of origin and inspiration. In Japanese hair salons, this is just a short bob. For styling a Japanese bob, Currier recommends using a flat iron and “beveling” sections, curving the hair under. But for the pieces around the face, “you’re going to want to direct the flat iron forward in the opposite direction and sweep backward towards the ear to give a bit of a curved, sweeping look to the fringe,” she explains. Bitchy bob View this post on Instagram A post shared by Jenna Perry Hair Studio (@jennaperryhairstudio) This bob is fun. It’s polished, one-length, and hits right at the corners of the mouth. It has some high-fashion edge and attitude, which is likely why hairstylist Jordan Luger at Jenna Perry Salon in NYC calls it the “bitchy bob.” If you’re thinking of inching up in 2025, this is a charming way to go about it. Like what you see? How about some more R29 goodness, right here?This Editor-Approved Hair Brand Is 30% Off NowDoes Air-Drying Hair Cause Mold? It's ComplicatedBlack Hair Experts On The Dyson Airstrait Backlash",
    "author": "Megan Decker",
    "published": "Wed, 04 Dec 2024 22:11:55 +0000",
    "image": "https://www.refinery29.com/images/11823677.png?width=827\u0026height=1024\u0026fit=bounds\u0026crop=827%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "0dfe47a2-8f37-4825-923d-3da9cedba403",
    "title": "Ole Henriksen Just Launched Three New Shades Of Its Bestselling Lip Treatment",
    "link": "https://www.refinery29.com/en-us/ole-henriksen-pout-preserve-shimmer-review?utm_source=feed\u0026utm_medium=rss",
    "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. In a very crowded sea of lip oils and buttery balm-gloss hybrids (à la Rhode’s Peptide Lip Treatment and Summer Fridays’ Lip Butter Balm), it’s genuinely impressive when a newcomer manages to cut through the noise. But that’s exactly what happened with Ole Henriksen’s Pout Preserve Peptide Lip Treatment. When it launched nearly two years ago in January 2023, Pout Preserve was somewhat of an underrated fave among editors and influencers. However, that all changed earlier this summer when Olympic gymnast (and 2024 R29 Powerhouse) Suni Lee revealed that Pout Preserve was her go-to for the glossy lips that had fans begging her to drop the lip combo stat. And now, after a cycle of selling out, restocking, and repeat, Ole Henriksen is making our holiday wishes come true with three new shades of the highly coveted lippie. The hydrating, peptides (a game-changing ingredient that helps rebuild and heal dry lips and skin) and kokum butter-infused formula has gotten a holiday makeover with added shimmer — a first for the brand. I was lucky enough to get a sneak peek of the new launches, which retail for $22 apiece, or $60 for a trio set.  Pout Preserve Peptide Lip Treatment, $22 First up is Lingonberry Jam, a berry hue that nods to Ole Henriksen’s Scandi roots. Then, there’s Citrus Sunshine, which takes the OG sheer Pout Preserve to glimmery heights. And lastly, we have Crème Brûlée, a glittery rosy brown that smells like your favorite caramel dessert. There’s truly something for everyone: A true berry pink that’s perfect for holiday glam, a barely-there tint with a hint of glitter, and an everyday nude hue that you can swipe on for a “my lips but better” effect. And best of all, the plush, non-sticky formula actually does what it claims to: Naturally plumps and hydrates lips for that pillowy-soft effect that doesn’t feel too heavy or makeup-y. (My biggest beauty pet peeve is when glossy balms “sit” on top of my lips, rather than absorb and moisturize.) They can be worn alone for a shimmery kiss of color, or layered underneath a pencil and worn as a sparkly topper. Compared to its rivals, I was impressed with the color payoff and hydrating properties; it really does feel like a treatment for the lips that just happens to also be pretty. My lips are on the thinner side, and I really did love the non-tingly, plumping benefits that filled in all the lines and dry spots in my lips, rather than enhance them. The new shades just launched last week, but are already gaining popularity online. (And to give you a peek behind the curtain: Pout Preserve was Refinery29 readers’ most-shopped product from the recent Holiday Savings Event.) Our predictions: These shades will be perfect stocking stuffers for the beauty lovers on your list, so make sure you add yours to cart while your favorite shade(s) are still in stock. Like what you see? How about some more R29 goodness, right here?",
    "author": "Karina Hoshikawa",
    "published": "Tue, 03 Dec 2024 19:39:52 +0000",
    "image": "https://www.refinery29.com/images/11819545.jpg?width=853\u0026height=1024\u0026fit=bounds\u0026crop=853%3A1024",
    "source": "https://www.refinery29.com/beauty/rss.xml",
    "categories": null
  },
  {
    "id": "98b086f1-1856-482c-a025-c507f6fa7b20",
    "title": "What we have written",
    "link": "https://thebeautybrains.com/2024/03/this-is-a-test/",
    "description": "Here is the beauty brains test blog page",
    "author": "Perry Romanowski",
    "published": "Mon, 04 Mar 2024 22:05:47 +0000",
    "image": "",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "1b7e7489-13c3-40ba-8c30-d399ab7fe68c",
    "title": "Is scalp exfoliation helpful for hair? episode 226",
    "link": "https://thebeautybrains.com/2020/07/6890/",
    "description": "Welcome to the Beauty Brains, a show where real cosmetic chemists answer your beauty product questions and give you an insider’s look at the cosmetic industry. This is Episode 226. Hosts Perry Romanowski, and Valerie George Is glycerin bad for curly hair? Are encapsulated ingredients better? Do scalp exfoliators help? Can beauty companies hide allergens […]",
    "author": "Perry Romanowski",
    "published": "Thu, 02 Jul 2020 17:22:57 +0000",
    "image": "http://thebeautybrains.com/wp-content/uploads/podcast/Episode226.mp3",
    "source": "https://thebeautybrains.com/blog/feed/",
    "categories": [
      "Podcast"
    ]
  },
  {
    "id": "c50437a5-f8a7-4ac0-bc96-1125ff2f03c6",
    "title": "I Got a \"Vajacial,\" and It Was Nothing Like I Expected",
    "link": "https://www.popsugar.com/beauty/vajacial-editor-experiment-49261677",
    "description": "Over the last few weeks, I've come to the conclusion that I am PS's resident vagina girl. Wait, stay with me. I have written about my (now ex) boyfriend giving me a Brazilian wax at home, experimented with \"vabbing\" (if you don't know what that is, consider yourself lucky), tried the \"vagina\" nails trend, and just last week got my first ever vagina facial, otherwise known as a \"vajacial.\" Are we sensing a pattern? For the unfamiliar - and I trust that there are a lot of you - a vajacial isn't actually a facial for your vagina. It's a facial for your vulva, the area that encompasses the external female genitalia. (The vagina is all internal.) The buzzy treatment has been all over my TikTok FYP, which left me intrigued enough that I decided to visit Sugaring NYC in Beverly Hills to test out its \"v-facial.\" What you can expect during said appointment varies depending on where you go. According to the brand's website, the process at this salon included hair removal, ingrown-hair extractions if needed, a chemical peel, a skin-care mask, and a treatment with a high-frequency machine. When I arrived at my appointment, an aesthetician led me into a room, where I popped off my pants and hopped onto the treatment table, butterfly style. As someone who writes about weird beauty sh*t all the time, I wasn't concerned whatsoever about what was in store for me. I was feeling good. Even when the aesthetician explained that she would first be removing my hair via the sugaring method versus waxing, I still wasn't worried. I've been getting Brazilian waxes for years (I've even waxed myself), so I didn't think I needed to be concerned about the pain. I heard her say, \"Alexa, play SZA,\" from behind, and I settled in for what I thought would be a quick and relaxing treatment. I was wrong. People, I cannot express to you how much sugaring hurts. I realize the hair-removal process is just a small piece of the vajacial, but since Sugaring NYC only performs its v-facial on hairless hoo-has, I feel it's worth mentioning. The process felt like it was moving at a snail's pace, and holy Jesus, it was no walk in the park. When she started on the \"lips\" is when I truly began questioning my sanity, as well as furiously texting my friends asking them if they thought I would exit the treatment room alive or on a stretcher. (I really need to invest in one of those \"A little bit dramatic\" T-shirts.) The entire hair-removal process should have taken 30 minutes, but I tacked on an extra 10 minutes of yelling expletives and trying to calm myself with deep breaths, which did not work whatsoever. Image Source: PS Photography | Renee Rodriguez My aesthetician was nothing if not supportive - she told me when to breathe in and when to breathe out and even said, \"Girl, you've got this!\" multiple times, and yet the pain was all-encompassing. Think Steve Carell in \"The 40-Year-Old Virgin,\" except I was screaming way worse things than \"Kelly Clarkson.\" Once the sugaring was (finally) over, it was time to move on to the real reason we've all gathered here today: the vajacial. The first step was to steam the area, which she explained would soften the skin and allow the products she'd be applying later to more easily penetrate. To be honest, while I probably would have normally felt like hot air hitting my Pikachu sounded terrible, anything was better than having my pubic hair ripped out slowly and methodically. After letting the steam do its thing for a few minutes, we moved on to the second step - a glycolic-acid chemical peel. I know what you're thinking - a chemical peel? Down there? After sugaring?! Trust me, I thought the same. The purpose is to exfoliate the skin and treat discoloration, but still, I was freaked the f*ck out. She applied it to my bikini line as well as the top area of my vulva, and although I thought it would sting or burn, we only left it on for a few minutes before wiping it off, so I barely noticed it. Next, it was time for a mask. When the aesthetician asked me what kind of mask I wanted to do, I was stumped. \"We have hydrating options, pore-refining options, and brightening options,\" she said. \"What do you feel like the area needs?\" As I gazed down at my naked lower half, the only descriptive word that came to mind was \"perfect.\" I honestly didn't feel like the area needed much help, so I went with their most basic option: a lavender calming mask. Once applied, we let it sit for 10 minutes until it hardened, which was probably the most relaxing portion of the treatment. Image Source: PS Photography | Renee Rodriguez The last step was a high-frequency machine, which the aesthetician said would help eliminate bacteria by pushing oxygen into my pores. She laid down some gauze before going over the area with a wand-like tool, which didn't feel like much of anything, but it looked like a torture device all the same. It also made scary zapping noises every so often, but ultimately, it wasn't bad. By the end of the treatment, my slicked-back bun had fallen into disarray and the pillow I was initially resting my head on was on the floor, but my lower half looked damn good. Would I ever get another vajacial? If I could skip the sugaring process, abso-freaking-lutely. If not? Sorry, dear vulva, but you will just have to live without. Renee Rodriguez (she/her) is a staff writer and social producer for PS. She writes across all verticals, but her main areas of expertise focus on fashion and beauty content with an emphasis on reviews and editor experiments. She also produces social content for the PS TikTok and Instagram accounts.",
    "author": "Renee Rodriguez",
    "published": "Wed, 04 Dec 2024 14:10:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/LF1_-yuxC2dBnqYSkWDCoNoobp4/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/12/04/915/n/1922153/7ba7beff6750c284167822.67725009_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Beauty Trends",
      "Body Care",
      "Hype Check",
      "Facials",
      "Editor Experiments"
    ]
  },
  {
    "id": "02fb0f2b-47c8-4f6f-9c17-9399ac9f73f6",
    "title": "18 Slicked-Back Hairstyles to Mix Up Your Everyday Look",
    "link": "https://www.popsugar.com/beauty/slicked-back-hairstyles-49417503",
    "description": "If you don't know where to begin, achieving the perfect slicked-back hairstyle can be tricky. Good thing we know celebrity hairstylist Andrew Fitzsimons, who has created the viral slicked-back hair looks seen on Kim and Khloé Kardashian, Madonna, Jennifer Lopez, Megan Fox, and more. Fitzsimons, who boasts an eponymous hair-care collection and a new collaboration with Bellami, shared with us his favorite tips and tricks for styling the perfect slicked-back look. Whether you're looking for a quick and easy workout hairstyle or a greasy hairstyle you can pull off with three-day-old hair, we have just the thing. Experts Featured in This Article Andrew Fitzsimons is a celebrity hairstylist for stars like Jennifer Lopez, Megan Fox, and Khloé Kardashian, and is the founder of hair-care brand Andrew Fitzsimons Hair. First, begin with slightly damp hair, then apply two to three pumps of leave-in conditioner or hair gel to your hands. \"Lather the product between your hands and apply it section by section, starting from the roots,\" Fitzsimons says. \"Work it through with a fine-tooth comb to distribute it evenly and get that smooth, polished look. Lock it in with hair spray once you achieve your desired look.\" You may want to invest in a fine-tooth comb, which will work wonders in crafting the sleekest of hairdos. \"It's helpful to use in the beginning stages of pulling your hair back,\" says Fitzsimons. \"A hair dryer isn't a must, but using a nozzle is a great way to direct the hair while setting the shape. Once you've done this, use a boar-bristle brush to lay down the extra bumps and flyaways to create the perfect slick.\" Now that you know how to create a super-sleek updo with Fitzsimons's helpful tips, allow us to highlight 18 of the trendiest slicked-back hairstyles ahead.",
    "author": "Nikita Charuza",
    "published": "Wed, 04 Dec 2024 13:45:02 -0800",
    "image": "https://media1.popsugar-assets.com/files/thumbor/zQGzFaQjRzRKeRUWlB1Ja9gzaVs/0x2119:3847x4856/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2024/12/04/912/n/1922153/8f5992f26750c18e133da9.96452280_.jpg",
    "source": "https://www.popsugar.com/beauty/feed",
    "categories": [
      "Long Hairstyles",
      "Hair",
      "Hair Trends"
    ]
  }
]
