{
  "id": "0564d059-93a0-4645-b7a0-8f2249ba1aec",
  "title": "'I'm a different person when I play': The unexpected impact of pickleball on prison life",
  "link": "https://www.espn.com/tennis/story/_/id/43027601/pickleball-league-prison-macdougall-walker-joey-losgar-picl",
  "description": "Last year, a pickleball league was launched at New England's largest prison. Now, more than 40 facilities have adopted the sport -- and inmates say it has changed their lives.",
  "author": "D'Arcy Maine",
  "published": "Fri, 20 Dec 2024 10:32:21 EST",
  "source": "https://www.espn.com/espn/rss/tennis/news",
  "categories": null,
  "byline": "D'Arcy Maine",
  "length": 22313,
  "excerpt": "Last year, a pickleball league was launched at New England's largest prison. Now, more than 40 facilities have adopted the sport -- and inmates say it has changed their lives.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "D'Arcy Maine, ESPN Senior WriterDec 20, 2024, 09:27 AM ETIT'S AN EARLY Friday morning in late November, and Joseph \"Joey\" Losgar and seven other men, all dressed in gray sweatpants or shorts and white T-shirts, are setting up pickleball nets in a brightly lit gym. Their sneakers squeak on the wood surface as they roll the wheeled nets to create two makeshift courts.A hand-painted mural is on the wall, depicting a pickleball doubles match on a colorful, fenceless court as a vibrant sun sets in the distance. Above it is painted \"EAGLES\" in large, teal capital letters with two birds on a tree branch next to the \"S.\" Each letter stands for something: Effort, Attitude, Gratitude, Learning, Enjoyment, Sportsmanship.It looks in many ways like a typical high school gym in America.But there are immediate clues that Losgar, 34, isn't in a school gym, a senior center or anywhere in which the sport has become overwhelmingly popular in recent years. There are frequent alerts over the loudspeaker with various codes, and uniformed officers are stationed around the space. The gym, split into two sections by a padded divider, is part of MacDougall-Walker Correctional Institution, a high- and maximum-security facility with over 2,000 inmates about 15 miles to the north of Hartford, Connecticut.The eight men setting up the equipment are wearing prison-issued clothes, and the equipment must never leave the gym -- a misplaced paddle during this Friday session caused a brief panic. The scenic pickleball mural was painted by someone who was then involuntarily transferred to another facility.But pickleball has provided an escape from daily life for dozens of inmates at MacDougall-Walker, some of whom are serving decades-long sentences, and the sport has become a perhaps unlikely source of unbridled joy in a place in which there is often little.Spearheaded by the Pickleball for Incarcerated Communities League (PICL), which formally launched at MacDougall-Walker in 2023, a tournament is held every Thursday night in the gym, in addition to daily play during open-gym recreation hours and a PICL clinic every Friday with volunteers from the outside. The sport has become so popular, and the program so successful within the facility, that less than two years after its inception, PICL is now in every Connecticut correctional institution and in over 40 facilities across the country, spanning 12 different states.And for many of the participants, including Losgar, who is serving an eight-year sentence for selling narcotics, it has changed everything.\"Adjusting [to life] here is tough and at first I never thought I would be able to even smile or to laugh again in a place like this,\" Losgar told ESPN, while sitting in an office next to the gym. \"But getting to play pickleball here, I look forward to playing all the time, everybody does. Playing just takes you out of this place and it brings this joy. Even if it's just for an hour, it takes you away from all the stresses that you have and that you carry on a daily basis here. It brings the better out of people.\"IN 2022, SARAH GERSTEN stumbled upon an article about a man who was teaching pickleball to inmates at Cook County Jail in Chicago. She quickly understood why the sport would work well in such a setting.Gersten is a lawyer and founder of the Last Prisoner Project, a nonprofit organization focused on criminal justice reform and helping those who have been incarcerated for drug-related offenses that are no longer illegal. As an avid pickleball player as well, it didn't take long for the wheels to start turning in Gersten's head.Even without experience in racket sports, she had quickly picked up pickleball -- and she knew others could do it, too. The rules are simple to learn, courts can easily and cheaply be created in a variety of settings, and just about everyone is a beginner, which makes it less intimidating than other sports.And, of course, pickleball is inherently social in nature.\"There's an element that's built into the game that creates more camaraderie than other sports,\" Gersten said from the weight room next to the gym at MacDougall-Walker. \"Something we always teach them is in the game, you paddle-tap your opponents, you paddle-tap your team member. That's just a part of it; that's part of the culture. I think because pickleball came up as not so much as a sport but more of a community activity, it builds more of the social aspect and sportsmanship is a core part of the game.\"Gersten reached out to Roger Belair, the pickleball coach featured in the article, and asked how she could start something similar. The two began exchanging ideas, and Belair offered his advice from what he had learned in Chicago and at other facilities. It wasn't long before the idea for PICL was born.The administration at MacDougall-Walker was enthusiastic from the start. As the largest correctional facility in New England, the prison already hosted a variety of programming initiatives, including college degree programs with Yale University and the University of New Haven. It was uniquely positioned for PICL's implementation. Lynnia Johnson, the facility's then-deputy warden, didn't know much about pickleball other than it was similar to tennis and suddenly everywhere, but she could see how valuable it could be.\"We don't get to be around our families here so we've kind of created that family dynamic, and having that second family say, 'We got you,' means everything.\" Mario Rivera, inmate at MacDougall-Walker As it turns out, the inmates had been playing the game for years. Rodolfo Alvarez, the recreation supervisor, had introduced it in 2017 at the urging of the warden at the time. But Alvarez didn't know much about pickleball other than what he could find online, so the way they played was light on rules and formalities. It wasn't until Gersten, Belair and PICL arrived for the first session in November of last year that all those at MacDougall-Walker had an almost comical realization.\"We were playing all wrong,\" Losgar, a former high school football quarterback, said. \"Like all the rules wrong. We was in the kitchen [the non-volley section of the court by the net], we weren't letting it bounce twice before hitting it in the air, really everything was wrong.\"Soon after that first day, Gersten recruited Angelo Rossetti to help. A longtime pro and pickleball coach (and a Guinness world-record holder for longest rally with his twin brother, Ettore), he had expertise with the sport and as a mental skills coach. Rosetti was sold on the idea quickly but had second thoughts after a mandatory volunteer orientation session.\"They showed these very graphic, very disturbing videos, and we had to sign a million signatures about everything and what we couldn't do,\" Rossetti said. \"They shared these apparently true and not hypothetical stories. One was about a volunteer who defied the dress code and ended up wearing the same colors as the inmates, and then there was a lockdown and he tried to leave and unfortunately got shot on sight. I called Sarah right after and said, 'I normally don't get rattled but I am rattled.'\"He told Gersten he would attend one session at MacDougall-Walker because he had already committed to it but didn't see himself continuing beyond that. At that first session, though, Rossetti's fears were quickly replaced with fulfillment.\"It was the most awesome, rewarding experience I've ever had,\" said Rossetti, who has coached at MacDougall-Walker or another Connecticut facility every Friday since. \"I knew right away I was making a difference in the life of an individual who has lost hope.\"He now believes that the orientation was trying to \"separate the curious from the serious\" and said he has yet to experience anything remotely like the scenarios he was warned about.Gersten and Rossetti work primarily with eight men, including Losgar, who are MacDougall-Walker's gym workers. It's one of the most coveted jobs at the facility, and the group works directly with Alvarez to assist with the gym's recreation hours, open-gym night leagues and games, training sessions and custodial maintenance. (A 2018 report from the Connecticut Office of Legislative Research said inmates are typically paid a rate of $0.75 to $1.75 per day for their labor.)As part of that role, the gym workers became PICL's de facto coaches for the rest of the inmates. They learn from Gersten and Rossetti and then teach the game throughout the week to anyone else who wants to play. Every Thursday night at 5 p.m., the group hosts a tournament for 32 players. One week it's geared to more novice players, and the following week it's for those who are more advanced. The gym workers recruit new players during the week and have taken it on themselves to grow the game. Losgar guesses he spends at least 24 hours playing, practicing and teaching pickleball every week.Jason Faison, a fellow gym worker, has served nearly 20 years at MacDougall-Walker as part of a 40-year sentence. He was apprehensive about the sport at first. When he entered prison, pickleball was all but nonexistent in the sports nomenclature, and he was happy to continue playing basketball and other sports with which he was familiar. But then four years ago, he lost multiple teeth when he was elbowed in the head during a pickup game. The teeth have yet to be replaced. And with a lingering knee injury as well, Faison has warmed up to the idea of a game that requires less physicality.\"It just feels more relaxed than basketball, and you're able to actually let your guard down,\" Faison said. \"We ain't got to worry about if somebody has a hidden agenda like playing basketball, or whether they might intentionally hit you playing a little rough. You don't have to have a chip on your shoulder; everyone is just having fun. With pickleball, you can be competitive, you can talk smack, but it doesn't get physical. You can just play.\"Faison knows he's not alone in that thinking. He speculates that pickleball is now the second-most popular sport at the facility, behind only basketball, and several others around MacDougall-Walker echoed that.\"If someone had told me that two years ago, I wouldn't have believed it,\" Faison said. \"It's hard to believe something when you're not around it. But when you see it, and watching it gradually grow and [understanding] why, it makes a lot of sense.\"Gersten had always hoped PICL could be scaled and expanded to other facilities but didn't know how long it would take. But thanks to Johnson and Alvarez, whom Gersten credits as the \"champions\" of the program, it happened quickly within the state. PICL now exists in some form in every state-run facility in Connecticut. And Gersten has found it increasingly easy to connect with corrections departments in other states.\"Being able to say, 'Do you want to speak to the rec supervisor or the director of Connecticut's DOC [Department of Correction]?' to someone [in another state] makes a big difference,\" Gersten said. \"Now we're able to supply letters from wardens and sheriffs in Connecticut, and all over the country, and have a packet that says, 'Here is what we've done' using this model at MacDougall-Walker as our example and proof that it works and can be done. We're not hoping it will work. It does.\"Gersten said PICL -- which currently has its biggest presence in the Northeast but can be found as far away as Alaska and on the West Coast -- would be launching in its first facility in Rhode Island in the coming weeks. Rossetti hopes there will someday be an inter-prison tournament featuring the best players from a number of institutions playing against one another.DAYS IN PRISON can be crushingly repetitive, and the years even more so. How does an inmate fill the time when it is both completely free and entirely not?That's a question everyone within the facility walls grapples with. An initiative like pickleball can be the difference for some, and it's not just the inmates who have seen a positive change around MacDougall-Walker because of the sport.Johnson, the deputy warden who approved PICL's inclusion in 2023, said it creates a valuable connection to the outside community through the volunteers, and she sees it as beneficial for the facility as a whole and for \"the bigger picture.\"\"Our job is not to continue to punish people. They're already here, they've already been sentenced,\" Johnson said. \"Our job here is to maintain safety and security and offer them the things that they're supposed to have. And by offering something like pickleball, we're helping create a form of teamwork and camaraderie and morale among the offender population. Not to mention, to have a place where they can release some energy, release some steam, release some aggression and have some healthy competition.\"Johnson told ESPN she has heard stories of inmates who didn't get along in the housing units coming together as teammates in the gym and has personally witnessed the transformation of some because of extracurricular activities.\"I've seen some people do a complete 180 in how they view their incarceration as a result of programming, because it makes them hold themselves accountable,\" she said.In order to participate in any of MacDougall-Walker's programs, an inmate has to abide by the facility's rules and have a clean disciplinary record. Any infractions recorded jeopardize their ability to play pickleball, attend classes or even continue working at their job. It's so much of an incentive, it's mentioned in just the third paragraph of the 65-page inmate handbook.John DeMartino, a seven-year veteran of the facility as a corrections officer, can attest to how desirable these programs are. He previously worked at a medium-security facility and was always confused to hear inmates there say they wanted to come to the higher-security MacDougall-Walker because they hoped for the opportunity to participate in extracurricular activities. But when he began working at the facility, he understood why.\"They get to have things that let them feel some normalcy,\" DeMartino said. \"They're getting to have a job or learn a skill or be in the gym all day. They're able to stay busy. When you're just sitting in a cell all day and not really doing anything, that could drive anyone crazy, and you're far more likely to get into trouble. Studies have shown incidents are down in facilities that offer a lot of programs, and I think it's because they can keep their minds occupied and there is just too much to lose if they act up. And so it makes it a lot safer for us, too.\"He added that incidents happen \"very seldom\" on the housing units where most of the inmates with jobs live.For some inmates, especially those serving lengthy sentences, these opportunities are a lifeline. Those inmates are often pushed to the bottom of the list for required classes and therapy programs due to space constraints and to prioritize those being released earlier. Jobs and programs are their only outlets.Mario Rivera has served eight years at MacDougall-Walker, with 22 years remaining in his sentence. The programming has given him purpose, he said, and he was eager to point out that he has no infractions on his record. He had dropped out of high school during his senior year, but since being imprisoned, he completed his GED and is now working on his associate degree in business administration, which he said has made his mom proud. Throughout his time, he has worked in religious services and in the medical department and is now back for his second stint as a gym worker.He had based most of his preconceived notions about prison from TV and has been surprised to experience the camaraderie he feels with his fellow gym workers. He credits them for getting him through some of the toughest moments, including the deaths of loved ones on the outside.\"We're around each other every single day and we really talk about everything,\" Rivera said. \"You get personal. We lean on each other. There might be a day where I might not be feeling up to doing anything, and just hearing one of these guys say, 'Yo, come on, let's do it,' it's a good feeling to have them. We don't get to be around our families here, so we've kind of created that family dynamic, and having that second family say, 'We got you,' means everything.\"And watching other inmates get so much out of pickleball has been an added bonus for Rivera.\"We don't really keep track of the tournament winners, but everyone playing does and there are bragging rights,\" he said. \"It's fun to hear these guys walking around on Monday and still talking about what they did on Thursday or telling someone else, 'I got you next week.'\"Johnson is no longer at MacDougall-Walker and is now deputy warden at Manson Youth Institution, which houses minors and men under 21. She places the same emphasis on programming with that community as she did at MacDougall-Walker, and PICL recently held its first clinic at the facility.Rossetti said it was one of the most impactful moments he has experienced yet.\"The first 15 minutes of that were the most difficult 15 minutes of any correctional institution I've gone to,\" Rossetti said. \"They were rambunctious, they were disrespectful, acting their age but to the next level. Then I called everyone's attention and said, 'Look, I coach professional athletes, I coach professional pickleball players. I am here giving my time and I am coaching you just like I would coach them.' The place went silent.\"Then a 20-year-old young man said, 'You mean, you don't see me as a criminal?'\"Rossetti paused before he continued, and he began to cry as he remembered the interaction. His voice broke as he resumed speaking.\"I said, 'No, I see you as a person.' And it was this moment for them, and for me, I really found myself too in that moment. I realized I'm right where I need to be, and it's a far cry from that first orientation.\"From that moment forward, Rossetti said the entire mood in the gym shifted and it became one of the most focused and enthusiastic groups he ever has worked with. He can't wait to go back.IT'S LESS THAN a week before Thanksgiving on that Friday morning in the MacDougall-Walker gym, and various staff members are exchanging pleasantries about the holiday.Little will change for those housed at the facility. But that doesn't dampen the mood in the gym as the gym workers volley back and forth, with the loud sounds of the ball making contact with the paddle echoing throughout. The players listen intently to Rossetti, who is joined for the day by his twin, Ettore. Both are wearing matching American-flag-detailed \"Rossetti Brothers\" baseball-style jerseys.Ava Ignatowich, a 23-year-old pro on the Professional Pickleball Association (PPA) Tour, is in attendance for the clinic on this day as well. A Connecticut native, she's home visiting family for Thanksgiving and had heard about PICL. She reached out to Gersten to ask how she could get involved. Until today, she had never been to a prison before.\"I'm amazed by how engaged, and how invested, everyone is,\" Ignatowich said. \"Normally when I teach clinics, for people who are paying, I'll say some advice and get some eye rolls or pushback, but everyone here listens with their eyes the size of quarters. They really want to learn and get better.\"Despite her résumé, Losgar is undaunted when facing Ignatowich across the net. The two hit balls back and forth, and several of the other gym workers teasingly rib him for each point lost. Losgar seems to relish the chance to test his skills against someone of Ignatowich's caliber and experience. He long has been considered the best player at MacDougall-Walker -- he was featured in so many local news broadcasts that his family jokingly but proudly calls him \"The face of MacDougall pickleball\" -- and he rarely gets to play someone at a higher level than him.Losgar admits the attention makes him slightly uncomfortable, but he feels pride that people are able to see him in a positive light and not simply for his criminal past. It also gives him something to talk to his 11-year-old son, Jaylyn, about. Jaylyn has only been able to watch his dad play from clips -- and Losgar's family tells him they all love getting a chance to see him smile so genuinely on their screens. But Losgar hopes he can find a way to get Jaylyn to start playing too and share the joy the sport has brought him.While pickleball has changed Losgar's perspective, those around him believe it truly could change his life outside the prison walls as well. He has a maximum release date of 2029 but said he is eligible for parole as early as next year. Rossetti and Alvarez both believe Losgar has the potential to go pro.Rossetti praised him for being coachable and said his potential was limitless. Alvarez, who said Losgar was also his unofficial \"clerk\" in his office and one of his go-to guys, cited his agility, finesse and ability to control the ball due to his hand-eye coordination.\"He has all the tools in his bag,\" Alvarez said. \"He's a really good athlete, and he has that winner's mindset. When he puts his mind to something, he can do it. I was a gym teacher and coach for many years, and when you have someone that has it, they have it. When he leaves here, he really has the opportunity to play professional pickleball and make some money doing that.\"Losgar is flattered by the praise and their faith in his abilities. But he's not so sure about a future in professional pickleball. He has been in and out of prison since 2017, and his primary focus upon release will be on being a good father and husband. But, he said, if he felt like \"things are straight at home and the timing is right,\" he would think about it. He wants to be successful no matter what he chooses to do, and he hopes to be a role model for Jaylyn and other children in how he turned his own story around.But pickleball, a sport he had never heard of before prison and has never seen played anywhere except the MacDougall-Walker gym, will always be a part of his life.\"I'm a different person when I play,\" he said. \"I'm always competitive, but Angelo has helped me just enjoy it and to have fun, and just be in the moment. It's changed my attitude because it's so joyous.\"I really want to bring that to the outside world.\"",
  "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1218%2Fr1429547_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eD\u0026#39;Arcy Maine, ESPN Senior Writer\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eDec 20, 2024, 09:27 AM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cb\u003eIT\u0026#39;S AN EARLY\u003c/b\u003e Friday morning in late November, and Joseph \u0026#34;Joey\u0026#34; Losgar and seven other men, all dressed in gray sweatpants or shorts and white T-shirts, are setting up pickleball nets in a brightly lit gym. Their sneakers squeak on the wood surface as they roll the wheeled nets to create two makeshift courts.\u003c/p\u003e\u003cp\u003eA hand-painted mural is on the wall, depicting a pickleball doubles match on a colorful, fenceless court as a vibrant sun sets in the distance. Above it is painted \u0026#34;EAGLES\u0026#34; in large, teal capital letters with two birds on a tree branch next to the \u0026#34;S.\u0026#34; Each letter stands for something: Effort, Attitude, Gratitude, Learning, Enjoyment, Sportsmanship.\u003c/p\u003e\u003cp\u003eIt looks in many ways like a typical high school gym in America.\u003c/p\u003e\u003cp\u003eBut there are immediate clues that Losgar, 34, isn\u0026#39;t in a school gym, a senior center or anywhere in which the sport has become overwhelmingly popular in recent years. There are frequent alerts over the loudspeaker with various codes, and uniformed officers are stationed around the space. The gym, split into two sections by a padded divider, is part of MacDougall-Walker Correctional Institution, a high- and maximum-security facility with over 2,000 inmates about 15 miles to the north of Hartford, Connecticut.\u003c/p\u003e\u003cp\u003eThe eight men setting up the equipment are wearing prison-issued clothes, and the equipment must never leave the gym -- a misplaced paddle during this Friday session caused a brief panic. The scenic pickleball mural was painted by someone who was then involuntarily transferred to another facility.\u003c/p\u003e\u003cp\u003eBut pickleball has provided an escape from daily life for dozens of inmates at MacDougall-Walker, some of whom are serving decades-long sentences, and the sport has become a perhaps unlikely source of unbridled joy in a place in which there is often little.\u003c/p\u003e\u003cp\u003eSpearheaded by the \u003ca href=\"https://www.picleague.org/\"\u003ePickleball for Incarcerated Communities League\u003c/a\u003e (PICL), which formally launched at MacDougall-Walker in 2023, a tournament is held every Thursday night in the gym, in addition to daily play during open-gym recreation hours and a PICL clinic every Friday with volunteers from the outside. The sport has become so popular, and the program so successful within the facility, that less than two years after its inception, PICL is now in every Connecticut correctional institution and in over 40 facilities across the country, spanning 12 different states.\u003c/p\u003e\u003cp\u003eAnd for many of the participants, including Losgar, who is serving an eight-year sentence for selling narcotics, it has changed everything.\u003c/p\u003e\u003cp\u003e\u0026#34;Adjusting [to life] here is tough and at first I never thought I would be able to even smile or to laugh again in a place like this,\u0026#34; Losgar told ESPN, while sitting in an office next to the gym. \u0026#34;But getting to play pickleball here, I look forward to playing all the time, everybody does. Playing just takes you out of this place and it brings this joy. Even if it\u0026#39;s just for an hour, it takes you away from all the stresses that you have and that you carry on a daily basis here. It brings the better out of people.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cb\u003eIN 2022, SARAH GERSTEN\u003c/b\u003e \u003ca href=\"https://www.usatoday.com/story/sports/2018/06/27/pickleball-countrys-fastest-growing-sport-also-popular-cook-county-jail/718232002/\"\u003estumbled upon an article\u003c/a\u003e about a man who was teaching pickleball to inmates at Cook County Jail in Chicago. She quickly understood why the sport would work well in such a setting.\u003c/p\u003e\u003cp\u003eGersten is a lawyer and founder of the \u003ca href=\"https://www.lastprisonerproject.org/\"\u003eLast Prisoner Project\u003c/a\u003e, a nonprofit organization focused on criminal justice reform and helping those who have been incarcerated for drug-related offenses that are no longer illegal. As an avid pickleball player as well, it didn\u0026#39;t take long for the wheels to start turning in Gersten\u0026#39;s head.\u003c/p\u003e\u003cp\u003eEven without experience in racket sports, she had quickly picked up pickleball -- and she knew others could do it, too. The rules are simple to learn, courts can easily and cheaply be created in a variety of settings, and just about everyone is a beginner, which makes it less intimidating than other sports.\u003c/p\u003e\u003cp\u003eAnd, of course, pickleball is inherently social in nature.\u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s an element that\u0026#39;s built into the game that creates more camaraderie than other sports,\u0026#34; Gersten said from the weight room next to the gym at MacDougall-Walker. \u0026#34;Something we always teach them is in the game, you paddle-tap your opponents, you paddle-tap your team member. That\u0026#39;s just a part of it; that\u0026#39;s part of the culture. I think because pickleball came up as not so much as a sport but more of a community activity, it builds more of the social aspect and sportsmanship is a core part of the game.\u0026#34;\u003c/p\u003e\u003cp\u003eGersten reached out to Roger Belair, the pickleball coach featured in the article, and asked how she could start something similar. The two began exchanging ideas, and Belair offered his advice from what he had learned in Chicago and at other facilities. It wasn\u0026#39;t long before the idea for PICL was born.\u003c/p\u003e\u003cp\u003eThe administration at MacDougall-Walker was enthusiastic from the start. As the largest correctional facility in New England, the prison already hosted a variety of programming initiatives, including college degree programs with Yale University and the University of New Haven. It was uniquely positioned for PICL\u0026#39;s implementation. Lynnia Johnson, the facility\u0026#39;s then-deputy warden, didn\u0026#39;t know much about pickleball other than it was similar to tennis and suddenly everywhere, but she could see how valuable it could be.\u003c/p\u003e\u003cblockquote\u003e\u0026#34;We don\u0026#39;t get to be around our families here so we\u0026#39;ve kind of created that family dynamic, and having that second family say, \u0026#39;We got you,\u0026#39; means everything.\u0026#34;\n\n\u003ccite\u003eMario Rivera, inmate at MacDougall-Walker\u003c/cite\u003e\n\n\u003c/blockquote\u003e\u003cp\u003eAs it turns out, the inmates had been playing the game for years. Rodolfo Alvarez, the recreation supervisor, had introduced it in 2017 at the urging of the warden at the time. But Alvarez didn\u0026#39;t know much about pickleball other than what he could find online, so the way they played was light on rules and formalities. It wasn\u0026#39;t until Gersten, Belair and PICL arrived for the first session in November of last year that all those at MacDougall-Walker had an almost comical realization.\u003c/p\u003e\u003cp\u003e\u0026#34;We were playing all wrong,\u0026#34; Losgar, a former high school football quarterback, said. \u0026#34;Like all the rules wrong. We was in the kitchen [the non-volley section of the court by the net], we weren\u0026#39;t letting it bounce twice before hitting it in the air, really everything was wrong.\u0026#34;\u003c/p\u003e\u003cp\u003eSoon after that first day, Gersten recruited Angelo Rossetti to help. A longtime pro and pickleball coach (\u003ca href=\"https://www.guinnessworldrecords.com/world-records/669898-longest-pickleball-rally\"\u003eand a Guinness world-record holder for longest rally with his twin brother, Ettore\u003c/a\u003e), he had expertise with the sport and as a mental skills coach. Rosetti was sold on the idea quickly but had second thoughts after a mandatory volunteer orientation session.\u003c/p\u003e\u003cp\u003e\u0026#34;They showed these very graphic, very disturbing videos, and we had to sign a million signatures about everything and what we couldn\u0026#39;t do,\u0026#34; Rossetti said. \u0026#34;They shared these apparently true and not hypothetical stories. One was about a volunteer who defied the dress code and ended up wearing the same colors as the inmates, and then there was a lockdown and he tried to leave and unfortunately got shot on sight. I called Sarah right after and said, \u0026#39;I normally don\u0026#39;t get rattled but I am \u003ci\u003erattled\u003c/i\u003e.\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003eHe told Gersten he would attend one session at MacDougall-Walker because he had already committed to it but didn\u0026#39;t see himself continuing beyond that. At that first session, though, Rossetti\u0026#39;s fears were quickly replaced with fulfillment.\u003c/p\u003e\u003cp\u003e\u0026#34;It was the most awesome, rewarding experience I\u0026#39;ve ever had,\u0026#34; said Rossetti, who has coached at MacDougall-Walker or another Connecticut facility every Friday since. \u0026#34;I knew right away I was making a difference in the life of an individual who has lost hope.\u0026#34;\u003c/p\u003e\u003cp\u003eHe now believes that the orientation was trying to \u0026#34;separate the curious from the serious\u0026#34; and said he has yet to experience anything remotely like the scenarios he was warned about.\u003c/p\u003e\u003cp\u003eGersten and Rossetti work primarily with eight men, including Losgar, who are MacDougall-Walker\u0026#39;s gym workers. It\u0026#39;s one of the most coveted jobs at the facility, and the group works directly with Alvarez to assist with the gym\u0026#39;s recreation hours, open-gym night leagues and games, training sessions and custodial maintenance. (\u003ca href=\"https://www.cga.ct.gov/2018/rpt/pdf/2018-R-0179.pdf\"\u003eA 2018 report from the Connecticut Office of Legislative Research\u003c/a\u003e said inmates are typically paid a rate of $0.75 to $1.75 per day for their labor.)\u003c/p\u003e\u003cp\u003eAs part of that role, the gym workers became PICL\u0026#39;s de facto coaches for the rest of the inmates. They learn from Gersten and Rossetti and then teach the game throughout the week to anyone else who wants to play. Every Thursday night at 5 p.m., the group hosts a tournament for 32 players. One week it\u0026#39;s geared to more novice players, and the following week it\u0026#39;s for those who are more advanced. The gym workers recruit new players during the week and have taken it on themselves to grow the game. Losgar guesses he spends at least 24 hours playing, practicing and teaching pickleball every week.\u003c/p\u003e\u003cp\u003eJason Faison, a fellow gym worker, has served nearly 20 years at MacDougall-Walker as part of a 40-year sentence. He was apprehensive about the sport at first. When he entered prison, pickleball was all but nonexistent in the sports nomenclature, and he was happy to continue playing basketball and other sports with which he was familiar. But then four years ago, he lost multiple teeth when he was elbowed in the head during a pickup game. The teeth have yet to be replaced. And with a lingering knee injury as well, Faison has warmed up to the idea of a game that requires less physicality.\u003c/p\u003e\u003cp\u003e\u0026#34;It just feels more relaxed than basketball, and you\u0026#39;re able to actually let your guard down,\u0026#34; Faison said. \u0026#34;We ain\u0026#39;t got to worry about if somebody has a hidden agenda like playing basketball, or whether they might intentionally hit you playing a little rough. You don\u0026#39;t have to have a chip on your shoulder; everyone is just having fun. With pickleball, you can be competitive, you can talk smack, but it doesn\u0026#39;t get physical. You can just play.\u0026#34;\u003c/p\u003e\u003cp\u003eFaison knows he\u0026#39;s not alone in that thinking. He speculates that pickleball is now the second-most popular sport at the facility, behind only basketball, and several others around MacDougall-Walker echoed that.\u003c/p\u003e\u003cp\u003e\u0026#34;If someone had told me that two years ago, I wouldn\u0026#39;t have believed it,\u0026#34; Faison said. \u0026#34;It\u0026#39;s hard to believe something when you\u0026#39;re not around it. But when you see it, and watching it gradually grow and [understanding] why, it makes a lot of sense.\u0026#34;\u003c/p\u003e\u003cp\u003eGersten had always hoped PICL could be scaled and expanded to other facilities but didn\u0026#39;t know how long it would take. But thanks to Johnson and Alvarez, whom Gersten credits as the \u0026#34;champions\u0026#34; of the program, it happened quickly within the state. PICL now exists in some form in every state-run facility in Connecticut. And Gersten has found it increasingly easy to connect with corrections departments in other states.\u003c/p\u003e\u003cp\u003e\u0026#34;Being able to say, \u0026#39;Do you want to speak to the rec supervisor or the director of Connecticut\u0026#39;s DOC [Department of Correction]?\u0026#39; to someone [in another state] makes a big difference,\u0026#34; Gersten said. \u0026#34;Now we\u0026#39;re able to supply letters from wardens and sheriffs in Connecticut, and all over the country, and have a packet that says, \u0026#39;Here is what we\u0026#39;ve done\u0026#39; using this model at MacDougall-Walker as our example and proof that it works and can be done. We\u0026#39;re not hoping it will work. It does.\u0026#34;\u003c/p\u003e\u003cp\u003eGersten said PICL -- which currently has its biggest presence in the Northeast but can be found as far away as Alaska and on the West Coast -- would be launching in its first facility in Rhode Island in the coming weeks. Rossetti hopes there will someday be an inter-prison tournament featuring the best players from a number of institutions playing against one another.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eDAYS IN PRISON\u003c/strong\u003e can be crushingly repetitive, and the years even more so. How does an inmate fill the time when it is both completely free and entirely not?\u003c/p\u003e\u003cp\u003eThat\u0026#39;s a question everyone within the facility walls grapples with. An initiative like pickleball can be the difference for some, and it\u0026#39;s not just the inmates who have seen a positive change around MacDougall-Walker because of the sport.\u003c/p\u003e\u003cp\u003eJohnson, the deputy warden who approved PICL\u0026#39;s inclusion in 2023, said it creates a valuable connection to the outside community through the volunteers, and she sees it as beneficial for the facility as a whole and for \u0026#34;the bigger picture.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Our job is not to continue to punish people. They\u0026#39;re already here, they\u0026#39;ve already been sentenced,\u0026#34; Johnson said. \u0026#34;Our job here is to maintain safety and security and offer them the things that they\u0026#39;re supposed to have. And by offering something like pickleball, we\u0026#39;re helping create a form of teamwork and camaraderie and morale among the offender population. Not to mention, to have a place where they can release some energy, release some steam, release some aggression and have some healthy competition.\u0026#34;\u003c/p\u003e\u003cp\u003eJohnson told ESPN she has heard stories of inmates who didn\u0026#39;t get along in the housing units coming together as teammates in the gym and has personally witnessed the transformation of some because of extracurricular activities.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve seen some people do a complete 180 in how they view their incarceration as a result of programming, because it makes them hold themselves accountable,\u0026#34; she said.\u003c/p\u003e\u003cp\u003eIn order to participate in any of MacDougall-Walker\u0026#39;s programs, an inmate has to abide by the facility\u0026#39;s rules and have a clean disciplinary record. Any infractions recorded jeopardize their ability to play pickleball, attend classes or even continue working at their job. It\u0026#39;s so much of an incentive, \u003ca href=\"https://www.law.umich.edu/special/policyclearinghouse/Documents/CT%20-%20MacDougall%20Handbook.pdf\"\u003eit\u0026#39;s mentioned in just the third paragraph\u003c/a\u003e of the 65-page inmate handbook.\u003c/p\u003e\u003cp\u003eJohn DeMartino, a seven-year veteran of the facility as a corrections officer, can attest to how desirable these programs are. He previously worked at a medium-security facility and was always confused to hear inmates there say they wanted to come to the higher-security MacDougall-Walker because they hoped for the opportunity to participate in extracurricular activities. But when he began working at the facility, he understood why.\u003c/p\u003e\u003cp\u003e\u0026#34;They get to have things that let them feel some normalcy,\u0026#34; DeMartino said. \u0026#34;They\u0026#39;re getting to have a job or learn a skill or be in the gym all day. They\u0026#39;re able to stay busy. When you\u0026#39;re just sitting in a cell all day and not really doing anything, that could drive anyone crazy, and you\u0026#39;re far more likely to get into trouble. Studies have shown incidents are down in facilities that offer a lot of programs, and I think it\u0026#39;s because they can keep their minds occupied and there is just too much to lose if they act up. And so it makes it a lot safer for us, too.\u0026#34;\u003c/p\u003e\u003cp\u003eHe added that incidents happen \u0026#34;very seldom\u0026#34; on the housing units where most of the inmates with jobs live.\u003c/p\u003e\u003cp\u003eFor some inmates, especially those serving lengthy sentences, these opportunities are a lifeline. Those inmates are often pushed to the bottom of the list for required classes and therapy programs due to space constraints and to prioritize those being released earlier. Jobs and programs are their only outlets.\u003c/p\u003e\u003cp\u003eMario Rivera has served eight years at MacDougall-Walker, with 22 years remaining in his sentence. The programming has given him purpose, he said, and he was eager to point out that he has no infractions on his record. He had dropped out of high school during his senior year, but since being imprisoned, he completed his GED and is now working on his associate degree in business administration, which he said has made his mom proud. Throughout his time, he has worked in religious services and in the medical department and is now back for his second stint as a gym worker.\u003c/p\u003e\u003cp\u003eHe had based most of his preconceived notions about prison from TV and has been surprised to experience the camaraderie he feels with his fellow gym workers. He credits them for getting him through some of the toughest moments, including the deaths of loved ones on the outside.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re around each other every single day and we really talk about everything,\u0026#34; Rivera said. \u0026#34;You get personal. We lean on each other. There might be a day where I might not be feeling up to doing anything, and just hearing one of these guys say, \u0026#39;Yo, come on, let\u0026#39;s do it,\u0026#39; it\u0026#39;s a good feeling to have them. We don\u0026#39;t get to be around our families here, so we\u0026#39;ve kind of created that family dynamic, and having that second family say, \u0026#39;We got you,\u0026#39; means everything.\u0026#34;\u003c/p\u003e\u003cp\u003eAnd watching other inmates get so much out of pickleball has been an added bonus for Rivera.\u003c/p\u003e\u003cp\u003e\u0026#34;We don\u0026#39;t really keep track of the tournament winners, but everyone playing does and there are bragging rights,\u0026#34; he said. \u0026#34;It\u0026#39;s fun to hear these guys walking around on Monday and still talking about what they did on Thursday or telling someone else, \u0026#39;I got you next week.\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003eJohnson is no longer at MacDougall-Walker and is now deputy warden at Manson Youth Institution, which houses minors and men under 21. She places the same emphasis on programming with that community as she did at MacDougall-Walker, and PICL recently held its first clinic at the facility.\u003c/p\u003e\u003cp\u003eRossetti said it was one of the most impactful moments he has experienced yet.\u003c/p\u003e\u003cp\u003e\u0026#34;The first 15 minutes of that were the most difficult 15 minutes of any correctional institution I\u0026#39;ve gone to,\u0026#34; Rossetti said. \u0026#34;They were rambunctious, they were disrespectful, acting their age but to the next level. Then I called everyone\u0026#39;s attention and said, \u0026#39;Look, I coach professional athletes, I coach professional pickleball players. I am here giving my time and I am coaching you just like I would coach them.\u0026#39; The place went silent.\u003c/p\u003e\u003cp\u003e\u0026#34;Then a 20-year-old young man said, \u0026#39;You mean, you don\u0026#39;t see me as a criminal?\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003eRossetti paused before he continued, and he began to cry as he remembered the interaction. His voice broke as he resumed speaking.\u003c/p\u003e\u003cp\u003e\u0026#34;I said, \u0026#39;No, I see you as a person.\u0026#39; And it was this moment for them, and for me, I really found myself too in that moment. I realized I\u0026#39;m right where I need to be, and it\u0026#39;s a far cry from that first orientation.\u0026#34;\u003c/p\u003e\u003cp\u003eFrom that moment forward, Rossetti said the entire mood in the gym shifted and it became one of the most focused and enthusiastic groups he ever has worked with. He can\u0026#39;t wait to go back.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cb\u003eIT\u0026#39;S LESS THAN\u003c/b\u003e a week before Thanksgiving on that Friday morning in the MacDougall-Walker gym, and various staff members are exchanging pleasantries about the holiday.\u003c/p\u003e\u003cp\u003eLittle will change for those housed at the facility. But that doesn\u0026#39;t dampen the mood in the gym as the gym workers volley back and forth, with the loud sounds of the ball making contact with the paddle echoing throughout. The players listen intently to Rossetti, who is joined for the day by his twin, Ettore. Both are wearing matching American-flag-detailed \u0026#34;Rossetti Brothers\u0026#34; baseball-style jerseys.\u003c/p\u003e\u003cp\u003eAva Ignatowich, a 23-year-old pro on the Professional Pickleball Association (PPA) Tour, is in attendance for the clinic on this day as well. A Connecticut native, she\u0026#39;s home visiting family for Thanksgiving and had heard about PICL. She reached out to Gersten to ask how she could get involved. Until today, she had never been to a prison before.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m amazed by how engaged, and how invested, everyone is,\u0026#34; Ignatowich said. \u0026#34;Normally when I teach clinics, for people who are paying, I\u0026#39;ll say some advice and get some eye rolls or pushback, but everyone here listens with their eyes the size of quarters. They really want to learn and get better.\u0026#34;\u003c/p\u003e\u003cp\u003eDespite her résumé, Losgar is undaunted when facing Ignatowich across the net. The two hit balls back and forth, and several of the other gym workers teasingly rib him for each point lost. Losgar seems to relish the chance to test his skills against someone of Ignatowich\u0026#39;s caliber and experience. He long has been considered the best player at MacDougall-Walker -- he was featured in so many local news broadcasts that his family jokingly but proudly calls him \u0026#34;The face of MacDougall pickleball\u0026#34; -- and he rarely gets to play someone at a higher level than him.\u003c/p\u003e\u003cp\u003eLosgar admits the attention makes him slightly uncomfortable, but he feels pride that people are able to see him in a positive light and not simply for his criminal past. It also gives him something to talk to his 11-year-old son, Jaylyn, about. Jaylyn has only been able to watch his dad play from clips -- and Losgar\u0026#39;s family tells him they all love getting a chance to see him smile so genuinely on their screens. But Losgar hopes he can find a way to get Jaylyn to start playing too and share the joy the sport has brought him.\u003c/p\u003e\u003cp\u003eWhile pickleball has changed Losgar\u0026#39;s perspective, those around him believe it truly could change his life outside the prison walls as well. He has a maximum release date of 2029 but said he is eligible for parole as early as next year. Rossetti and Alvarez both believe Losgar has the potential to go pro.\u003c/p\u003e\u003cp\u003eRossetti praised him for being coachable and said his potential was limitless. Alvarez, who said Losgar was also his unofficial \u0026#34;clerk\u0026#34; in his office and one of his go-to guys, cited his agility, finesse and ability to control the ball due to his hand-eye coordination.\u003c/p\u003e\u003cp\u003e\u0026#34;He has all the tools in his bag,\u0026#34; Alvarez said. \u0026#34;He\u0026#39;s a really good athlete, and he has that winner\u0026#39;s mindset. When he puts his mind to something, he can do it. I was a gym teacher and coach for many years, and when you have someone that has it, they have it. When he leaves here, he really has the opportunity to play professional pickleball and make some money doing that.\u0026#34;\u003c/p\u003e\u003cp\u003eLosgar is flattered by the praise and their faith in his abilities. But he\u0026#39;s not so sure about a future in professional pickleball. He has been in and out of prison since 2017, and his primary focus upon release will be on being a good father and husband. But, he said, if he felt like \u0026#34;things are straight at home and the timing is right,\u0026#34; he would think about it. He wants to be successful no matter what he chooses to do, and he hopes to be a role model for Jaylyn and other children in how he turned his own story around.\u003c/p\u003e\u003cp\u003eBut pickleball, a sport he had never heard of before prison and has never seen played anywhere except the MacDougall-Walker gym, will always be a part of his life.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m a different person when I play,\u0026#34; he said. \u0026#34;I\u0026#39;m always competitive, but Angelo has helped me just enjoy it and to have fun, and just be in the moment. It\u0026#39;s changed my attitude because it\u0026#39;s so joyous.\u003c/p\u003e\u003cp\u003e\u0026#34;I really want to bring that to the outside world.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "24 min read",
  "publishedTime": "2024-12-20T14:27:00Z",
  "modifiedTime": null
}
