{
  "id": "71642f3b-b1d2-4809-bb28-6723c050eaa5",
  "title": "Djokovic makes more history with 100th singles title",
  "link": "https://www.bbc.com/sport/tennis/articles/cpvk0d30938o",
  "description": "Novak Djokovic makes another bit of tennis history as he clinches his 100th ATP singles title with a battling victory over Hubert Hurkacz in Geneva.",
  "author": "",
  "published": "Sat, 24 May 2025 16:28:13 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Amy Lofthouse",
  "length": 3493,
  "excerpt": "Novak Djokovic makes another bit of tennis history as he clinches his 100th ATP singles title with a battling victory over Hubert Hurkacz in Geneva.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "A battling Novak Djokovic made another bit of tennis history as he clinched his 100th ATP singles title with a comeback victory over Hubert Hurkacz in Geneva.Serbia's Djokovic, who has won almost all there is in tennis, is just the third man in the Open era to achieve the feat after Jimmy Connors and Roger Federer.The 38-year-old had won all seven of his previous matches against Poland's Hurkacz but had to grind out victory this time around, coming from a break down in the third set to win 5-7 7-6 (7-2) 7-6 (7-2).Djokovic's children ran onto court afterwards to congratulate their father, with wife Jelena watching in the stands.\"I had to work for it, that's for sure,\" he admitted. \"Hubi was probably closer to the victory the entire match than I was.\"An incredible match with a full stadium, a beautiful atmosphere. I'm just grateful to clinch the 100th here.\"Victory also gave Djokovic some welcome time on the clay, with the French Open beginning on Sunday.He arrived in Geneva without a win on the surface, having lost his first match in four of his past five tournaments.A relieved Djokovic now travels to Paris - where he will face American Mackenzie McDonald in the first round - with his bid for a standalone record 25th Grand Slam title firmly on track.However, it remains to be seen how quickly he will recover from a final lasting three hours and eight minutes.This is Djokovic's first title since Olympic gold in Paris last year - and marks a high point in a difficult year for the tennis great.His run to the Australian Open semi-finals was ended by injury before his first attempt to claim his 100th title was ended by Czech teenager Jakub Mensik in the Miami Open showpiece.The clay season has been particularly tricky as Djokovic lost his opening matches in Monte Carlo and Madrid in straight sets before opting out of the Italian Open.A split with coach Andy Murray followed, but deciding to take a wildcard to Geneva has paid off as Djokovic has improved in each match, with his serving and returning in particular going up a notch. Much of the packed crowd in Geneva were on his side and it was the Serb who had the first break opportunities at 2-2.But Hurkacz, a big server making his way back to form after a serious knee injury at Wimbledon last year, produced aces and service winners at the crucial times to keep him at bay.In truth, it was Djokovic's errors, rather than excellent play from his opponent, that decided the first set. Serving to force a tie-break, an unfortunate net cord gave Hurkacz his first break point of the set - and a dreadful double fault from Djokovic handed it over.Every Hurkacz service game of the second set seemed to go to deuce, with Djokovic constantly pushing for an opening, but his uncharacteristic errors allowed his 28-year-old opponent to wriggle free - much to Djokovic's wry amusement.The Serb upped his level in the tie-break, smashing a winner to force a deciding set, but it was Hurkacz who broke at the start of the third.Service games rattled by from both players before the Pole played a dreadful game at 4-3 up. With Hurkacz's body tight and arm full of tension, an error handed Djokovic the break back, with the world number six shaking his racquet in celebration.A tie-break felt almost inevitable and once again, Djokovic ran away with it, before sealing the success with an ace.The two shared a warm hug at the net before a visibly upset Hurkacz covered his head with his towel as the victor thanked the crowd.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c711/live/210aa4a0-38bf-11f0-8947-7d6241f9fce9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eA battling Novak Djokovic made another bit of tennis history as he clinched his 100th ATP singles title with a comeback victory over Hubert Hurkacz in Geneva.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eSerbia\u0026#39;s Djokovic, who has won almost all there is in tennis, is just the third man in the Open era to achieve the feat after Jimmy Connors and Roger Federer.\u003c/p\u003e\u003cp\u003eThe 38-year-old had won all seven of his previous matches against Poland\u0026#39;s Hurkacz but had to grind out victory this time around, coming from a break down in the third set to win 5-7 7-6 (7-2) 7-6 (7-2).\u003c/p\u003e\u003cp\u003eDjokovic\u0026#39;s children ran onto court afterwards to congratulate their father, with wife Jelena watching in the stands.\u003c/p\u003e\u003cp\u003e\u0026#34;I had to work for it, that\u0026#39;s for sure,\u0026#34; he admitted. \u0026#34;Hubi was probably closer to the victory the entire match than I was.\u003c/p\u003e\u003cp\u003e\u0026#34;An incredible match with a full stadium, a beautiful atmosphere. I\u0026#39;m just grateful to clinch the 100th here.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVictory also gave Djokovic some welcome time on the clay, with the French Open beginning on Sunday.\u003c/p\u003e\u003cp\u003eHe arrived in Geneva without a win on the surface, having lost his first match in four of his past five tournaments.\u003c/p\u003e\u003cp\u003eA relieved Djokovic now travels to Paris - where he will face American Mackenzie McDonald in the first round - with his bid for a standalone record 25th Grand Slam title firmly on track.\u003c/p\u003e\u003cp\u003eHowever, it remains to be seen how quickly he will recover from a final lasting three hours and eight minutes.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThis is Djokovic\u0026#39;s first title since Olympic gold in Paris last year - and marks a high point in a difficult year for the tennis great.\u003c/p\u003e\u003cp\u003eHis run to the Australian Open semi-finals was ended by injury before his first attempt to claim his 100th title was ended by Czech teenager Jakub Mensik in the Miami Open showpiece.\u003c/p\u003e\u003cp\u003eThe clay season has been particularly tricky as Djokovic lost his opening matches in Monte Carlo and Madrid in straight sets before opting out of the Italian Open.\u003c/p\u003e\u003cp\u003eA split with coach Andy Murray followed, but deciding to take a wildcard to Geneva has paid off as Djokovic has improved in each match, with his serving and returning in particular going up a notch. \u003c/p\u003e\u003cp\u003eMuch of the packed crowd in Geneva were on his side and it was the Serb who had the first break opportunities at 2-2.\u003c/p\u003e\u003cp\u003eBut Hurkacz, a big server making his way back to form after a serious knee injury at Wimbledon last year, produced aces and service winners at the crucial times to keep him at bay.\u003c/p\u003e\u003cp\u003eIn truth, it was Djokovic\u0026#39;s errors, rather than excellent play from his opponent, that decided the first set. Serving to force a tie-break, an unfortunate net cord gave Hurkacz his first break point of the set - and a dreadful double fault from Djokovic handed it over.\u003c/p\u003e\u003cp\u003eEvery Hurkacz service game of the second set seemed to go to deuce, with Djokovic constantly pushing for an opening, but his uncharacteristic errors allowed his 28-year-old opponent to wriggle free - much to Djokovic\u0026#39;s wry amusement.\u003c/p\u003e\u003cp\u003eThe Serb upped his level in the tie-break, smashing a winner to force a deciding set, but it was Hurkacz who broke at the start of the third.\u003c/p\u003e\u003cp\u003eService games rattled by from both players before the Pole played a dreadful game at 4-3 up. With Hurkacz\u0026#39;s body tight and arm full of tension, an error handed Djokovic the break back, with the world number six shaking his racquet in celebration.\u003c/p\u003e\u003cp\u003eA tie-break felt almost inevitable and once again, Djokovic ran away with it, before sealing the success with an ace.\u003c/p\u003e\u003cp\u003eThe two shared a warm hug at the net before a visibly upset Hurkacz covered his head with his towel as the victor thanked the crowd.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-24T16:28:13.515Z",
  "modifiedTime": null
}
