{
  "id": "90a2e812-f601-40d7-aa21-cf90e6e0e2e4",
  "title": "Tie-break tussle: Fearless Fonseca tops Blue Group with win over Mensik",
  "link": "https://www.atptour.com/en/news/mensik-fonseca-next-gen-2024-friday",
  "description": "Joao Fonseca maintained his flawless run at the Next Gen ATP Finals presented by PIF by edging Jakub Mensik across five tie-break sets on a dramatic Friday night in Jeddah. The Brazilian 18-year-old registered a hard-fought 3-4(4), 4-3(8), 4-3(5), 3-4(4), 4-3(5) victory over the third-seeded Czech in a match of fine margins. Fonseca held his nerve in five tight sets to clinch the pair's first Lexus ATP Head2Head clash and advance to the last four with a perfect 3-0 Blue Group record on his tournament debut. “Before the match, I had already qualified for the semi-finals. I will play tomorrow,” Fonseca said in his on-court interview. “I had already qualified, so, I think in tennis or any sport you need to think of today, not tomorrow.” Mensik showed glimpses of the solid play that defined his 2024 season. But it was a stronger showing from Fonseca, who withstood the challenge posed by the Czech’s booming deliveries with big serves and aggressive returns of his own. He won 73 per cent of his first-serve points, according to ATP Infosys Stats. Despite squandering two match points in the fifth set right before heading into the tie-break, he remained calm under pressure to seal the win in two hours and 11 minutes. [ATP APP] Fonseca, currently No. 145 in the PIF ATP Rankings, will play Luca Van Assche on Saturday for a place in the final. Van Assche finished runner-up in the Red Group after defeating Nishesh Basavareddy in a winner-take-all contest earlier on Friday. “I know Luca. He is a very solid guy. We are going to face each other for the first time. I am going to do my best and hope I can go for the win,” Fonseca said. Earlier this week, Fonseca dispatched top seed Arthur Fils and Learner Tien. The 18-year-old reached the quarter-finals in Rio de Janeiro in February and the last eight at the ATP 250 in Bucharest. He is the first Brazilian to compete at the 20-and-under event. Did you know? This is only the second time a Next Gen ATP Finals presented by PIF match has gone to five tie-breaks in event history after Dominic Stricker defeated Lorenzo Musetti in a group match in 2022. [NEWSLETTER FORM]",
  "author": "",
  "published": "Fri, 20 Dec 2024 22:04:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Match Report",
    "Next Gen ATP Finals",
    "Next Gen",
    "2024",
    "Jakub Mensik",
    "Joao Fonseca"
  ],
  "byline": "",
  "length": 2383,
  "excerpt": "Joao Fonseca outlasted Jakub Mensik in a close encounter at the Next Gen ATP Finals presented by PIF in Jeddah on Friday.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Match Report Brazilian teenager marches into Jeddah SFs with 3-0 record December 20, 2024 Peter Staples/ATP Tour Joao Fonseca defeats Jakub Mensik in five sets on Friday night in Jeddah. By Vishakha Khandelwal Joao Fonseca maintained his flawless run at the Next Gen ATP Finals presented by PIF by edging Jakub Mensik across five tie-break sets on a dramatic Friday night in Jeddah. The Brazilian 18-year-old registered a hard-fought 3-4(4), 4-3(8), 4-3(5), 3-4(4), 4-3(5) victory over the third-seeded Czech in a match of fine margins. Fonseca held his nerve in five tight sets to clinch the pair's first Lexus ATP Head2Head clash and advance to the last four with a perfect 3-0 Blue Group record on his tournament debut. “Before the match, I had already qualified for the semi-finals. I will play tomorrow,” Fonseca said in his on-court interview. “I had already qualified, so, I think in tennis or any sport you need to think of today, not tomorrow.” Mensik showed glimpses of the solid play that defined his 2024 season. But it was a stronger showing from Fonseca, who withstood the challenge posed by the Czech’s booming deliveries with big serves and aggressive returns of his own. He won 73 per cent of his first-serve points, according to ATP Infosys Stats. Despite squandering two match points in the fifth set right before heading into the tie-break, he remained calm under pressure to seal the win in two hours and 11 minutes. Fonseca, currently No. 145 in the PIF ATP Rankings, will play Luca Van Assche on Saturday for a place in the final. Van Assche finished runner-up in the Red Group after defeating Nishesh Basavareddy in a winner-take-all contest earlier on Friday. “I know Luca. He is a very solid guy. We are going to face each other for the first time. I am going to do my best and hope I can go for the win,” Fonseca said. Earlier this week, Fonseca dispatched top seed Arthur Fils and Learner Tien. The 18-year-old reached the quarter-finals in Rio de Janeiro in February and the last eight at the ATP 250 in Bucharest. He is the first Brazilian to compete at the 20-and-under event. Did you know? This is only the second time a Next Gen ATP Finals presented by PIF match has gone to five tie-breaks in event history after Dominic Stricker defeated Lorenzo Musetti in a group match in 2022.",
  "image": "https://www.atptour.com/-/media/images/news/2024/12/20/20/36/fonseca-next-gen-2024-friday-match-point.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eMatch Report\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eBrazilian teenager marches into Jeddah SFs with 3-0 record\u003c/p\u003e\n    \u003cp\u003eDecember 20, 2024\u003c/p\u003e\n\n        \n        \n\n    \u003cdiv\u003e\n        \u003cp\u003ePeter Staples/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJoao Fonseca defeats Jakub Mensik in five sets on Friday night in Jeddah.\u003c/span\u003e\n        \u003cspan\u003eBy Vishakha Khandelwal\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/joao-fonseca/f0fv/overview\"\u003eJoao Fonseca\u003c/a\u003e maintained his flawless run at the \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e by edging \u003ca href=\"https://www.atptour.com/en/players/jakub-mensik/m0ni/overview\"\u003eJakub Mensik\u003c/a\u003e across five tie-break sets on a dramatic Friday night in Jeddah.\u003c/p\u003e\n\u003cp\u003eThe Brazilian 18-year-old registered a hard-fought 3-4(4), 4-3(8), 4-3(5), 3-4(4), 4-3(5) victory over the third-seeded Czech in a match of fine margins. Fonseca held his nerve in five tight sets to clinch the pair\u0026#39;s first Lexus ATP Head2Head clash and advance to the last four with a perfect 3-0 Blue Group record on his tournament debut.\u003c/p\u003e\n\u003cp\u003e“Before the match, I had already qualified for the semi-finals. I will play tomorrow,” Fonseca said in his on-court interview. “I had already qualified, so, I think in tennis or any sport you need to think of today, not tomorrow.”\u003c/p\u003e\n\n\u003cp\u003eMensik showed glimpses of the solid play that defined his 2024 season. But it was a stronger showing from Fonseca, who withstood the challenge posed by the Czech’s booming deliveries with big serves and aggressive returns of his own. He won 73 per cent of his first-serve points, according to ATP Infosys Stats. Despite squandering two match points in the fifth set right before heading into the tie-break, he remained calm under pressure to seal the win in two hours and 11 minutes. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFonseca, currently No. 145 in the PIF ATP Rankings, will play \u003ca href=\"https://www.atptour.com/en/players/luca-van-assche/v0dz/overview\"\u003eLuca Van Assche\u003c/a\u003e on Saturday for a place in the final. Van Assche finished runner-up in the Red Group after defeating \u003ca href=\"https://www.atptour.com/en/players/nishesh-basavareddy/b0nn/overview\"\u003eNishesh Basavareddy\u003c/a\u003e in a winner-take-all contest earlier on Friday.\u003c/p\u003e\n\u003cp\u003e“I know Luca. He is a very solid guy. We are going to face each other for the first time. I am going to do my best and hope I can go for the win,” Fonseca said. \u003c/p\u003e\n\u003cp\u003eEarlier this week, Fonseca dispatched top seed \u003ca href=\"https://www.atptour.com/en/players/arthur-fils/f0f1/overview\"\u003eArthur Fils\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/learner-tien/t0ha/overview\"\u003eLearner Tien\u003c/a\u003e. The 18-year-old reached the quarter-finals in Rio de Janeiro in February and the last eight at the ATP 250 in Bucharest. He is the first Brazilian to compete at the 20-and-under event.\u003c/p\u003e\n\u003cp\u003eDid you know?\u003cbr/\u003e\nThis is only the second time a \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e match has gone to five tie-breaks in event history after \u003ca href=\"https://www.atptour.com/en/players/dominic-stricker/s0la/overview\"\u003eDominic Stricker\u003c/a\u003e defeated \u003ca href=\"https://www.atptour.com/en/players/lorenzo-musetti/m0ej/overview\"\u003eLorenzo Musetti\u003c/a\u003e in a group match in 2022.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
