{
  "id": "c2df44c3-810c-4e89-848c-4eaaa6a7bdfe",
  "title": "Shanghai Masters 2024 Round 3 Recap",
  "link": "https://www.perfect-tennis.com/shanghai-masters-2024-round-3-recap/",
  "description": "The disjointed draw in Shanghai has finally sorted itself out, and with the weather much improved, the round of 32 in Shanghai is complete. With matches played over three days, some players booked their spots on Sunday, with Sinner, Alcaraz, and Medvedev as benefactors. This means they have two full days off before playing in …",
  "author": "Jonathan",
  "published": "Tue, 08 Oct 2024 14:59:42 +0000",
  "source": "https://www.perfect-tennis.com/feed/",
  "categories": [
    "ATP Masters 1000",
    "Shanghai Masters",
    "Tennis News"
  ],
  "byline": "Jonathan",
  "length": 9056,
  "excerpt": "The disjointed draw in Shanghai has finally sorted itself out, and with the weather much improved, the round of 32 in Shanghai is complete. With matches played over three days, some players booked the",
  "siteName": "Perfect Tennis",
  "favicon": "https://www.perfect-tennis.com/wp-content/uploads/2019/04/cropped-ptennis-icon-192x192.png",
  "text": "The disjointed draw in Shanghai has finally sorted itself out, and with the weather much improved, the round of 32 in Shanghai is complete. With matches played over three days, some players booked their spots on Sunday, with Sinner, Alcaraz, and Medvedev as benefactors. This means they have two full days off before playing in the fourth round on Wednesday. Those lucky enough to play their 2nd round matches on the stadium courts on Saturday, like Djokovic, had to wait two full days for their round of 32 matches, the Serb taking out Cobolli, who only played his 2nd round yesterday evening, battling for 2 hours and 30 minutes against Stan Wawrinka. You can see the full list of round 3 results below with all the top 5 seeds making the last sixteen. Shanghai Masters 2024 Round of 32 Results Winner Loser Scoreline Jannik Sinner (1) Tomas Martin Etcheverry (31) 6-7(3_ 6-4 6-2 Ben Shelton (14) Roberto Carballes Baena 6-3 6-4 Stefanos Tstisipas (10) Alexandre Muller 6-3 7-5 Daniil Medvedev (5) Matteo Arnaldi (29) 5-7 6-4 6-4 Carlos Alcaraz (3) Yibing Wu (WC) 7-6(5) 6-3 Gael Monfils Ugo Humbert (16) 7-6(7) 2-6 6-1 Tommy Paul (11) Alejandro Tabilo (19) 6-7(2) 7-6(6) 6-2 Tomas Machac (30) Alexsandar Vukic (Q 6-4 6-2 Jakub Mensik Alexander Shevchenko 6-1 6-7(5) 6-2 Grigor Dimitrov (9) Alexei Popyrin 7-6(5) 6-2 Roman Safiullin  Frances Tiafoe (13) 5-7 7-5 7-6(5) Novak Djokovic (4) Flavio Cobolli (28) 6-1 6-2 Taylor Fritz (7) Yosuke Watanuki (Q) 6-3 6-4 Holger Rune (12) Jiri Lehecka (33) 6-4 7-5 David Goffin Marcos Giron 1-6 6-3 7-5 Alexander Zverev (2) Tallon Griekspoor 7-6(6) 2-6 7-6(5) Sinner Edges Past Etcheverry Jannik Sinner faced his toughest test of the tournament so far, pulling off a comeback victory on Sunday. He defeated Tomas Martin Etcheverry 6-7(3), 6-4, 6-2 in a match that lasted two hours and 39 minutes.  Sinner’s next opponent will be Ben Shelton. This will be a rematch of their fourth-round clash from the previous year, which Shelton won in a deciding-set tie-break. The first set featured plenty of opportunities for both players, but Etcheverry maintained his composure under pressure. He faced two set points but shut the door with some solid place before winning the set in a tie-break by converting his first set point after winning six of seven net points. Sinner elevated his game at the start of the second set. Although he and Etcheverry exchanged breaks in the fifth and sixth games, Sinner remained focused and managed to level the match at one set apiece. In the deciding set, despite Etcheverry’s strong start and ability to save three break points in the first game, Sinner’s baseline solidity proved decisive. He broke Etcheverry’s serve in the third game and survived three break points in a lengthy sixth game before closing the match. It was a very tough match, physically [and] mentally, so I am very happy to get through this one. I felt like it was a tough set that I lost. I had my chances [to win the set], but these things can happen. Sometimes you have to wait for your chances, which I have done, trying to stay calm mentally, and today that was the key. Sinner on his win. Should Sinner still be playing? I must say that the story around his doping case doesn’t look great. The same people in the media who were coercing players and fans to take irreversible medical procedures for two years and were then relentlessly pushing the narrative that Zverev was guilty of domestic abuse are now declaring Sinner as an innocent victim. Make of that what you will. Alcaraz Wipes Out Wu Carlos Alcaraz had a challenging task on Sunday, facing Chinee wildcard Wu Yibing, prevailing 7-6(5), 6-3, marking his 50th tour-level win of the year.  Chinese players always raise their level when playing on home soil, and Alcaraz found himself in a precarious situation, trailing 3/1 in the tie-break. However, he held his composure to hit back, winning 6 of the following 8 points to take the opener. Wu, who’s had a few injuries lately, continued to push Alcaraz in the second, but a drop in level in the sixth game led to a critical break for Alcaraz. From then on, Alcaraz began to canter and secured the win with conviction, finishing the match with 23 winners. He is recovering his level. He’s returning from injury, but his level deserves to be at the top. If he keeps playing at this level, I’m sure I will see him around more often. I’m just really happy to get through. I don’t want to say I was surprised, but it was my first time playing against him. He just beat [Nicolas] Jarry easily, 6-2, 6-2, so that’s impressive. I had to be focused on playing my best. I’m not used to feeling the feelings I had on the court. He is a really powerful player and plays strong, so I felt like I was not dominating the game. Alcaraz facing Wu. Moaning Medvedev Defeats Arnaldi Daniil Medvedev isn’t a fan of the tennis balls used in Shanghai, and he’s not one to be shy about voicing his displeasure. However, they haven’t derailed him yet as he battled past Matteo Arnaldi 5-7, 6-4, 6-4. He’ll take on 10th seed Stefanos Tstisipas after the Greek confidently came through against Alexandre Muller. With the weather wreaking havoc with the schedule, the pair played under the roof, and Medvedev broke Arnaldi’s serve in the match’s opening game, but the Italian hit back, snatching the first set 7-5. However, Medvedev is perhaps the best player at grinding out wins on tour, and he dug in to find a way through, improving his serve throughout the match to move into the fourth round as he bids to win a title in the same city twice for the first time in his career. It was a very tough match, a very close one. I actually felt like that’s where tennis is funny. I felt like in the first set, I was probably the better player, had more opportunities. I didn’t manage to [win] it, played a bad game at the end of the set. In the other sets, I thought it was closer. Maybe even he had the edge on some of the moments, but that’s why tennis is crazy. You can win when you don’t expect it, and lose when you expect to win, so I’m happy to be here again in two days. Medvedev on his win over Arnaldi. Regarding his complaints, has Meddy become a parody of himself? While I like his candid nature, it’s gone up a level recently, and his game has been retrograde. Djokovic Crushes Cobolli Novak Djokovic proved far too good for Flavio Cobolli on Tuesday, winning 6-1, 6-2, in a much cleaner performance than his match against Michelsen on Saturday. Cobolli was somewhat lucky to defeat Wawrinka after being misattributed a point in the game he broke during the third set (a mistake by Bernardes, which nobody picked up on). He looked sluggish early doors, and he was dominated throughout, with Djokovic striking 11 winners in a rapid 29-minute first set. Although Cobolli initially held his ground at the start of the second set, Djokovic broke his serve in the fifth game and then cruised to victory. Djokovic will next face Roman Safiullin, who staged a comeback to defeat a furious Frances Tiafoe 5-7, 7-5, 7-6(5), with the American screaming “F**k You” several times at the Umpire after the match due to his belief a time violation had cost him the match. The Serb, despite starting he’s not particularly interested in doing so, has a chance of making the ATP Finals in Turin. He sits eighth in the ATP Live Race, trailing Andrey Rublev by 220 points. From the beginning I had a clear game plan of what I needed to do, staying aggressive and trying to use every short ball to take the initiative in the point. Cobolli was evidently exhausted after last night’s match. I think that has taken a toll, physically, on him today. I haven’t played too many matches, I think the positive in that is that I’m fresh, so I am happy to play every day [or] as long as it takes. Djokovic on his win. Other Matches of Note Tommy Paul produced a high-quality comeback in his round-of-32 match. After trailing 7-6(2), 5-1 and facing five match points at 5-2, Paul took full advantage of the Chilean’s missed opportunities, ultimately winning 6-7(2), 7-6(6), 6-2 in a match that lasted two hours and 43 minutes. Stefanos Tsitsipas performed strongly against Alexandre Muller, overcoming a slight blip when serving for the match only to break to love in the final game to come through 6-3 7-5. Meddy is next for Tstisi, whom he trails 4-9 in the H2H. Grigor Dimitrov looks to have shaken off his physical problems during the North American hardcourt swing as he took out Alexei Popyrin 7-6(5), 6-2. Dimitrov held steady during a tight first set before dominating the second, winning 97% (33/34) of points on his first serve. 2024 Shanghai Masters Round of 16 Matches Jannik Sinner (1) vs Ben Shelton (14) Stefanos Ttitsipas (10) vs Daniil Medvedev (5) Carlos Alcaraz (3) vs Gael Monfils Tommy Paul (11) vs Tomas Machac (30) Jakub Mensik vs Grigor Dimitrov (9) Roman Safiullin vs Novak Djkoovic (4) Taylor Fritz (7) vs Holger Rune (12) David Goffin vs Alexander Zverev (2)",
  "image": "https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-info.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThe disjointed draw in Shanghai has finally sorted itself out, and with the weather much improved, the round of 32 in Shanghai is complete.\u003c/p\u003e\n\u003cp\u003eWith matches played over three days, some players booked their spots on Sunday, with Sinner, Alcaraz, and Medvedev as benefactors. This means they have two full days off before playing in the fourth round on Wednesday.\u003c/p\u003e\n\u003cp\u003eThose lucky enough to play their 2nd round matches on the stadium courts on Saturday, like Djokovic, had to wait two full days for their round of 32 matches, the Serb taking out Cobolli, who only played his 2nd round yesterday evening, battling for 2 hours and 30 minutes against Stan Wawrinka.\u003c/p\u003e\n\u003cp\u003eYou can see the full list of round 3 results below with all the top 5 seeds making the last sixteen.\u003c/p\u003e\n\u003ch2\u003eShanghai Masters 2024 Round of 32 Results\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap.jpg\" alt=\"shanghai masters recap\" width=\"1200\" height=\"800\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap.jpg 1200w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-300x200.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-1024x683.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-768x512.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-150x100.jpg 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201200%20800\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap.jpg 1200w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-300x200.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-1024x683.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-768x512.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap-150x100.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/shanghai-masters-recap.jpg\"/\u003e\n\u003c/p\u003e\n\u003ctable\u003e\n\u003cthead\u003e\n\u003ctr\u003e\n\u003cth\u003eWinner\u003c/th\u003e\n\u003cth\u003eLoser\u003c/th\u003e\n\u003cth\u003eScoreline\u003c/th\u003e\n\u003c/tr\u003e\n\u003c/thead\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003eJannik Sinner (1)\u003c/td\u003e\n\u003ctd\u003eTomas Martin Etcheverry (31)\u003c/td\u003e\n\u003ctd\u003e6-7(3_ 6-4 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eBen Shelton (14)\u003c/td\u003e\n\u003ctd\u003eRoberto Carballes Baena\u003c/td\u003e\n\u003ctd\u003e6-3 6-4\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eStefanos Tstisipas (10)\u003c/td\u003e\n\u003ctd\u003eAlexandre Muller\u003c/td\u003e\n\u003ctd\u003e6-3 7-5\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eDaniil Medvedev (5)\u003c/td\u003e\n\u003ctd\u003eMatteo Arnaldi (29)\u003c/td\u003e\n\u003ctd\u003e5-7 6-4 6-4\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eCarlos Alcaraz (3)\u003c/td\u003e\n\u003ctd\u003eYibing Wu (WC)\u003c/td\u003e\n\u003ctd\u003e7-6(5) 6-3\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eGael Monfils\u003c/td\u003e\n\u003ctd\u003eUgo Humbert (16)\u003c/td\u003e\n\u003ctd\u003e7-6(7) 2-6 6-1\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eTommy Paul (11)\u003c/td\u003e\n\u003ctd\u003eAlejandro Tabilo (19)\u003c/td\u003e\n\u003ctd\u003e6-7(2) 7-6(6) 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eTomas Machac (30)\u003c/td\u003e\n\u003ctd\u003eAlexsandar Vukic (Q\u003c/td\u003e\n\u003ctd\u003e6-4 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eJakub Mensik\u003c/td\u003e\n\u003ctd\u003eAlexander Shevchenko\u003c/td\u003e\n\u003ctd\u003e6-1 6-7(5) 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eGrigor Dimitrov (9)\u003c/td\u003e\n\u003ctd\u003eAlexei Popyrin\u003c/td\u003e\n\u003ctd\u003e7-6(5) 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eRoman Safiullin \u003c/td\u003e\n\u003ctd\u003eFrances Tiafoe (13)\u003c/td\u003e\n\u003ctd\u003e5-7 7-5 7-6(5)\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eNovak Djokovic (4)\u003c/td\u003e\n\u003ctd\u003eFlavio Cobolli (28)\u003c/td\u003e\n\u003ctd\u003e6-1 6-2\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eTaylor Fritz (7)\u003c/td\u003e\n\u003ctd\u003eYosuke Watanuki (Q)\u003c/td\u003e\n\u003ctd\u003e6-3 6-4\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eHolger Rune (12)\u003c/td\u003e\n\u003ctd\u003eJiri Lehecka (33)\u003c/td\u003e\n\u003ctd\u003e6-4 7-5\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eDavid Goffin\u003c/td\u003e\n\u003ctd\u003eMarcos Giron\u003c/td\u003e\n\u003ctd\u003e1-6 6-3 7-5\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003eAlexander Zverev (2)\u003c/td\u003e\n\u003ctd\u003eTallon Griekspoor\u003c/td\u003e\n\u003ctd\u003e7-6(6) 2-6 7-6(5)\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003ch2\u003eSinner Edges Past Etcheverry\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai.jpg\" alt=\"sinnner shanghai\" width=\"1024\" height=\"683\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-300x200.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-768x512.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-150x100.jpg 150w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201024%20683\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-300x200.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-768x512.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai-150x100.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/sinner-shanghai.jpg\"/\u003e\n\u003c/p\u003e\n\u003cp\u003eJannik Sinner faced his toughest test of the tournament so far, pulling off a comeback victory on Sunday. He defeated Tomas Martin Etcheverry 6-7(3), 6-4, 6-2 in a match that lasted two hours and 39 minutes. \u003c/p\u003e\n\u003cp\u003eSinner’s next opponent will be Ben Shelton. This will be a rematch of their fourth-round clash from the previous year, which Shelton won in a deciding-set tie-break.\u003c/p\u003e\n\u003cp\u003eThe first set featured plenty of opportunities for both players, but Etcheverry maintained his composure under pressure. He faced two set points but shut the door with some solid place before winning the set in a tie-break by converting his first set point after winning six of seven net points.\u003c/p\u003e\n\u003cp\u003eSinner elevated his game at the start of the second set. Although he and Etcheverry exchanged breaks in the fifth and sixth games, Sinner remained focused and managed to level the match at one set apiece.\u003c/p\u003e\n\u003cp\u003eIn the deciding set, despite Etcheverry’s strong start and ability to save three break points in the first game, Sinner’s baseline solidity proved decisive. He broke Etcheverry’s serve in the third game and survived three break points in a lengthy sixth game before closing the match.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eIt was a very tough match, physically [and] mentally, so I am very happy to get through this one. I felt like it was a tough set that I lost. I had my chances [to win the set], but these things can happen. Sometimes you have to wait for your chances, which I have done, trying to stay calm mentally, and today that was the key. \u003ccite\u003eSinner on his win.\u003c/cite\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eShould Sinner still be playing? I must say that the story around his doping case doesn’t look great. The same people in the media who were coercing players and fans to take irreversible medical procedures for two years and were then relentlessly pushing the narrative that Zverev was guilty of domestic abuse are now declaring Sinner as an innocent victim. Make of that what you will.\u003c/p\u003e\n\n\u003ch2\u003eAlcaraz Wipes Out Wu\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai.jpg\" alt=\"alcaraz shanghai\" width=\"1296\" height=\"675\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai.jpg 1296w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-300x156.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-1024x533.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-768x400.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-150x78.jpg 150w\" sizes=\"(max-width: 1296px) 100vw, 1296px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201296%20675\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai.jpg 1296w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-300x156.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-1024x533.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-768x400.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai-150x78.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/alcaraz-shanghai.jpg\"/\u003e\n\u003c/p\u003e\n\u003cp\u003eCarlos Alcaraz had a challenging task on Sunday, facing Chinee wildcard Wu Yibing, prevailing 7-6(5), 6-3, marking his 50th tour-level win of the year. \u003c/p\u003e \n\u003cp\u003eChinese players always raise their level when playing on home soil, and Alcaraz found himself in a precarious situation, trailing 3/1 in the tie-break. However, he held his composure to hit back, winning 6 of the following 8 points to take the opener.\u003c/p\u003e\n\u003cp\u003eWu, who’s had a few injuries lately, continued to push Alcaraz in the second, but a drop in level in the sixth game led to a critical break for Alcaraz. From then on, Alcaraz began to canter and secured the win with conviction, finishing the match with 23 winners.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eHe is recovering his level. He’s returning from injury, but his level deserves to be at the top. If he keeps playing at this level, I’m sure I will see him around more often. I’m just really happy to get through. I don’t want to say I was surprised, but it was my first time playing against him. He just beat [Nicolas] Jarry easily, 6-2, 6-2, so that’s impressive. I had to be focused on playing my best. I’m not used to feeling the feelings I had on the court. He is a really powerful player and plays strong, so I felt like I was not dominating the game. \u003ccite\u003eAlcaraz facing Wu.\u003c/cite\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\n\u003ch2\u003eMoaning Medvedev Defeats Arnaldi\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai.jpg\" alt=\"medvedev shanghai\" width=\"1200\" height=\"675\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai.jpg 1200w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-300x169.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-1024x576.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-768x432.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-390x220.jpg 390w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-150x84.jpg 150w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%201200%20675\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai.jpg 1200w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-300x169.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-1024x576.jpg 1024w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-768x432.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-390x220.jpg 390w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai-150x84.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/medvedev-shanghai.jpg\"/\u003e\n\u003c/p\u003e\n\u003cp\u003eDaniil Medvedev isn’t a fan of the tennis balls used in Shanghai, and he’s not one to be shy about voicing his displeasure.\u003c/p\u003e\n\u003cp\u003eHowever, they haven’t derailed him yet as he battled past Matteo Arnaldi 5-7, 6-4, 6-4. He’ll take on 10th seed Stefanos Tstisipas after the Greek confidently came through against Alexandre Muller.\u003c/p\u003e\n\u003cp\u003eWith the weather wreaking havoc with the schedule, the pair played under the roof, and Medvedev broke Arnaldi’s serve in the match’s opening game, but the Italian hit back, snatching the first set 7-5.\u003c/p\u003e\n\u003cp\u003eHowever, Medvedev is perhaps the best player at grinding out wins on tour, and he dug in to find a way through, improving his serve throughout the match to move into the fourth round as he bids to win a title in the same city twice for the first time in his career.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eIt was a very tough match, a very close one. I actually felt like that’s where tennis is funny. I felt like in the first set, I was probably the better player, had more opportunities. I didn’t manage to [win] it, played a bad game at the end of the set. In the other sets, I thought it was closer. Maybe even he had the edge on some of the moments, but that’s why tennis is crazy. You can win when you don’t expect it, and lose when you expect to win, so I’m happy to be here again in two days. \u003ccite\u003eMedvedev on his win over Arnaldi.\u003c/cite\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eRegarding his complaints, has Meddy become a parody of himself? While I like his candid nature, it’s gone up a level recently, and his game has been retrograde.\u003c/p\u003e\n\n\u003ch2\u003eDjokovic Crushes Cobolli\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1.jpg\" alt=\"djokovic shanghai\" width=\"768\" height=\"432\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-300x169.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-390x220.jpg 390w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-150x84.jpg 150w\" sizes=\"(max-width: 768px) 100vw, 768px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20768%20432\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-300x169.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-390x220.jpg 390w, https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1-150x84.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2024/10/djokovic-shanghai-1.jpg\"/\u003e\n\u003c/p\u003e\n\u003cp\u003eNovak Djokovic proved far too good for Flavio Cobolli on Tuesday, winning 6-1, 6-2, in a much cleaner performance than his match against Michelsen on Saturday.\u003c/p\u003e\n\u003cp\u003eCobolli was somewhat lucky to defeat Wawrinka after being misattributed a point in the game he broke during the third set (a mistake by Bernardes, which nobody picked up on). He looked sluggish early doors, and he was dominated throughout, with Djokovic striking 11 winners in a rapid 29-minute first set.\u003c/p\u003e\n\u003cp\u003eAlthough Cobolli initially held his ground at the start of the second set, Djokovic broke his serve in the fifth game and then cruised to victory.\u003c/p\u003e\n\u003cp\u003eDjokovic will next face Roman Safiullin, who staged a comeback to defeat a furious Frances Tiafoe 5-7, 7-5, 7-6(5), with the American screaming “F**k You” several times at the Umpire after the match due to his belief a time violation had cost him the match.\u003c/p\u003e\n\u003cp\u003eThe Serb, despite starting he’s not particularly interested in doing so, has a chance of making the ATP Finals in Turin. He sits eighth in the ATP Live Race, trailing Andrey Rublev by 220 points.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eFrom the beginning I had a clear game plan of what I needed to do, staying aggressive and trying to use every short ball to take the initiative in the point. Cobolli was evidently exhausted after last night’s match. I think that has taken a toll, physically, on him today. I haven’t played too many matches, I think the positive in that is that I’m fresh, so I am happy to play every day [or] as long as it takes. \u003ccite\u003eDjokovic on his win.\u003c/cite\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch2\u003eOther Matches of Note\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw.jpg\" alt=\"shanghai rolex masters matches draw\" width=\"820\" height=\"452\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw.jpg 820w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-300x165.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-768x423.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-150x83.jpg 150w\" sizes=\"(max-width: 820px) 100vw, 820px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20820%20452\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw.jpg 820w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-300x165.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-768x423.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw-150x83.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-matches-draw.jpg\"/\u003e\n\u003c/p\u003e\n\u003cp\u003eTommy Paul produced a high-quality comeback in his round-of-32 match. After trailing 7-6(2), 5-1 and facing five match points at 5-2, Paul took full advantage of the Chilean’s missed opportunities, ultimately winning 6-7(2), 7-6(6), 6-2 in a match that lasted two hours and 43 minutes.\u003c/p\u003e\n\u003cp\u003eStefanos Tsitsipas performed strongly against Alexandre Muller, overcoming a slight blip when serving for the match only to break to love in the final game to come through 6-3 7-5. Meddy is next for Tstisi, whom he trails 4-9 in the H2H.\u003c/p\u003e\n\u003cp\u003eGrigor Dimitrov looks to have shaken off his physical problems during the North American hardcourt swing as he took out Alexei Popyrin 7-6(5), 6-2. Dimitrov held steady during a tight first set before dominating the second, winning 97% (33/34) of points on his first serve.\u003c/p\u003e\n\u003ch2\u003e2024 Shanghai Masters Round of 16 Matches\u003c/h2\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters.jpg\" alt=\"shanghai rolex masters\" width=\"800\" height=\"445\" srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters.jpg 800w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-300x167.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-768x427.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-150x83.jpg 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20800%20445\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters.jpg 800w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-300x167.jpg 300w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-768x427.jpg 768w, https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters-150x83.jpg 150w\" data-lazy-src=\"https://www.perfect-tennis.com/wp-content/uploads/2023/10/shanghai-rolex-masters.jpg\"/\u003e\n\u003c/p\u003e\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eJannik Sinner (1) vs Ben Shelton (14)\u003c/li\u003e\n\u003cli\u003eStefanos Ttitsipas (10) vs Daniil Medvedev (5)\u003c/li\u003e\n\u003cli\u003eCarlos Alcaraz (3) vs Gael Monfils\u003c/li\u003e\n\u003cli\u003eTommy Paul (11) vs Tomas Machac (30)\u003c/li\u003e\n\u003cli\u003eJakub Mensik vs Grigor Dimitrov (9)\u003c/li\u003e\n\u003cli\u003eRoman Safiullin vs Novak Djkoovic (4)\u003c/li\u003e\n\u003cli\u003eTaylor Fritz (7) vs Holger Rune (12)\u003c/li\u003e\n\u003cli\u003eDavid Goffin vs Alexander Zverev (2)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-08T15:59:42+01:00",
  "modifiedTime": null
}
