{
  "id": "e8372046-1f51-4c42-888b-092ab117eb1f",
  "title": "Why was 'the greatest match' so great?",
  "link": "https://www.bbc.co.uk/sport/tennis/44517976",
  "description": "The 2008 Wimbledon final between Rafael Nadal and Roger Federer is often described as the greatest match of all time - but what made it so special?",
  "author": "",
  "published": "Thu, 10 Oct 2024 10:49:16 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Alan Jewell",
  "length": 14328,
  "excerpt": "The 2008 Wimbledon final between Rafael Nadal and Roger Federer is often described as the greatest match of all time - but what made it so special?",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Image source, AFPImage caption, The 2008 Wimbledon men's singles final was the third in succession between Roger Federer and Rafael NadalThis feature was first published in 2018.John McEnroe describes it as \"the greatest match ever played\", and the 2008 Wimbledon final between Rafael Nadal and Roger Federer remains the high point of a rivalry that dominated tennis. The final - played out over nearly seven hours because of rain delays - ended with a 22-year-old Nadal finally dethroning Federer, holding off a thrilling fightback from the five-time champion to win 6-4 6-4 6-7 (5-7) 6-7 (8-10) 9-7 as darkness descended on an enraptured Centre Court.It was the last of three successive Wimbledon finals between two players who have won a combined 42 Grand Slam titles.Here, BBC Sport speaks to four people who witnessed an extraordinary occasion - seven-time Grand Slam champion McEnroe, who commentated on the match for NBC, umpire Pascal Maria, long-time Wimbledon locker-room attendant Doug Dickson, and Jonathan Overend - the BBC's tennis correspondent from 2003 to 2013. This is how they saw \"the greatest match\".'Nadal was edging closer but still Federer was the king'On 6 July 2008 - the day of the match - Federer was a month short of his 27th birthday and had spent 231 consecutive weeks as world number one. But Nadal was close to toppling him. Four weeks earlier, he destroyed Federer at Roland Garros - winning 6-1 6-3 6-0 for his fourth consecutive French Open title. Could the Swiss recover to take revenge on his favoured surface?Federer had beaten Nadal in four sets in the 2006 Wimbledon final, and five sets 12 months later. Both men were playing for a slice of history - Nadal trying to become the first man to win the French Open and Wimbledon back to back since Bjorn Borg in 1980, Federer attempting to go ahead of Borg by winning a sixth consecutive Wimbledon.It was also the last match played on Centre Court before a roof was installed, so the circumstances - with repeated rain interruptions, and a final finishing at twilight - are unlikely to be repeated. Jonathan Overend: \"Everybody was wondering whether this was going to be the day Federer's great Wimbledon reign came to an end. Nadal was edging closer but still Federer was the king. It was beautifully set up.\" Doug Dickson: \"Roger was his usual calm, collected self. If he was nervous, he did not show it. Rafa was also his usual self, a tiny bit on edge, which was due, I think, to the weather.\"Rain delayed the scheduled 14:00 start by 35 minutes, and the first point set the tone - a superb 14-stroke rally with both players moving each other round the court until Nadal whipped a forehand down the line. The Spaniard broke serve first - in the third game. As he served for the set at 5-4, Federer created two break-back opportunities but they were fought off, the younger man getting the job done on his third set point.Media caption, Nadal wins first set against Federer in 2008 Wimbledon final'There was always that sense Federer would come back'Federer came back firing in the second set, breaking Nadal's serve at the first opportunity by whipping a vicious cross-court forehand winner and establishing a 4-1 lead. But he could not capitalise and Nadal won five games in a row to go two sets to love up.JO: \"I remember how well Nadal was moving, how cleanly he was striking the ball, how well he was serving. In those first two sets Federer knew this was going to be his toughest Wimbledon final yet. But there was always that sense that Federer would come back. Even at two sets to love, I don't think anybody saw it as being over, simply because of Federer's experience on that court.\"Media caption, Nadal wins second set against Federer in 2008 Wimbledon finalFederer had never faced a challenge on this scale in his previous Wimbledon finals. Dark clouds were gathering overhead as he failed to convert four further break points in the sixth game of the third set. At 3-3, Federer was down 0-40 but won five straight points. At 16:51, with Federer leading 5-4, the rain started falling and the players left the court.DD: \"During the first rain break, Roger went into the physio room and lay down on one of the beds. Rafa re-taped his fingers and had a mobile CD player plugged in.\"Pascal Maria: \"I went in an office and sat down and did not turn my phone on at all. I talked to different guys in there very quietly, not talking about the tennis, not talking about what could happen next or what did happen.\"It was more than an hour before the rain relented and the covers came off. At 18:11, play resumed with the third set, and potentially the match, about to be decided. Three service holds took it into a tie-break. Federer seized the initiative with a couple of trademark fizzing forehands to go 5-2 up and closed out the set with an ace that was greeted with a huge roar from the crowd.'The rain delay probably woke me up'Federer, speaking in the Strokes of Genius documentary,, external said: \"My problem was I had lost in the French Open final a month earlier against Rafa in a terrible way. He crushed me. So when I went into the Wimbledon final, I felt like, 'Oh my God, this is going to be really difficult.' I think it took me two sets to shake it off and I believe that rain delay probably woke me up. I said: 'If you're going to go out of this match, at least you're going to go down swinging.'\"Media caption, Roger Federer seals third set with aceThe fourth set went with serve, with excitement levels rising the longer it went. Federer served to stay in the match at 4-5. At 0-30, he was again on the precipice but four straight points allowed him to escape and prompted chants of \"Roger, Roger\". It had been gripping enough but, with the time approaching 19:30, the match was about to go to another level in a tie-break of astonishing drama.JO: That was just an unbelievable tie-break. The nature of the way we do the radio commentary is one of us does sets one, three and five. My colleague Alastair Eykyn did sets two and four. We have a little bench at the back of our commentary box which I was sitting on. I was absolutely transfixed. Of course, part of you is hoping you get a fifth set because you'll be the commentator for it but on the other hand you know you're watching a great final and potentially a new champion. Nadal was so close to finishing it there and all those emotions were going on. As well as being there working, you're there as a fan as well, thinking, 'this is too good'.Nadal went 5-2 ahead with two serves to come. A first Wimbledon title was on his racquet but suddenly the Spaniard's left arm was gripped with tension, a double fault and netted backhand bringing the tie-break back on serve at 5-4. Federer had a set point at 6-5 but missed a forehand. Nadal had a championship point at 7-6 but couldn't do anything with a powerful Federer serve. At 7-7, somehow, from way behind the baseline, Nadal whipped a forehand down the line that left the champion grasping at thin air. It was a staggering shot. He had a second championship point, this time on his serve, but it was Federer's turn to come up with breathtaking inspiration, a nerveless backhand down the line. In his BBC commentary, Andrew Castle said: \"The two best passing shots of the tournament, without doubt, have just taken place on the last two points.\" The next two points saw a Federer forehand winner and missed Nadal return The roars grew louder. It was two sets all.Media caption, Federer levels match after thrilling fourth-set tie-breakJohn McEnroe: \"What made the final so great was a combination of things. It was obviously the players, the magnitude of the situation, playing the Wimbledon final, and certainly the way it panned out. The battle that Roger was having with Rafa but also with himself, squandering the lead in the second set and getting way down and then having to pull out two sets in the tie-break.\"JO: \"If ever there was a tie-break to prove Federer's champion quality, it was that one. The greatest pull out their greatest shots when it really matters and that's what Federer did. That felt absolutely massive, him winning that tie-break.\" PM: \"Two incredible players playing an incredible match. You cannot be screaming or clapping but you can deeply enjoy it. I can remember a few points in that match and inside I was saying, 'wow, what a great shot' or 'what a great point'.\"The match went into a final set but, as is Wimbledon tradition, this one would not be decided by a tie-break. Federer would have the advantage of serving first. Nadal had to clear his mind after failing to convert two championship points.Nadal, speaking in Strokes of Genius, external said: \"I could lose the final. But I wasn't going to fail. I'd be ready to compete till the end. Federer could win, but I wasn't going to lose.\"'Nadal wasn't going anywhere'JO: \"All bets were off by that point. The momentum was with Federer because he'd won the fourth set. History was with Federer because he was the five-time champion, but there was still this unknown of what Nadal was going to offer in the decider. He had played so well to that point. Only a fool would have written him off. It was clear in the early games, even though Federer was serving first, that Nadal wasn't going anywhere.\"At 19:53, with the decider poised at 2-2, deuce, the rain came again. The players went off and the covers came across. It looked like they would be coming back on Monday to finish it but it would prove a short interruption. Half an hour later, they resumed with, realistically, a maximum of an hour's playable light left. The quality and intensity would never drop, the two men throwing all they had at each other. It was heart-stopping stuff.JM: \"I was fortunate enough that people talked about my match with Bjorn in 1980 as one of the great matches. But I was watching the 2008 final and sitting back and saying to myself: 'This is the best match I've ever seen at Wimbledon.'\"Towards the end, I was virtually not saying anything in the commentary box. I thought what I was witnessing was so great and the players were rising to the occasion - anyone watching could tell it was going to be a match that people would talk about for generations to come. To me that's an easy gig when you're watching a match like that. When it is that good you sort of kick back and put your arms back.\"The match moved into its fifth hour. At 4-4, Federer earned a break point but Nadal saved it with a big forehand and follow-up smash. \"Roger, Roger\" and \"Rafa, Rafa\" were ringing out simultaneously. At 5-5, Nadal got to 15-40 on the Federer serve but the Swiss repelled him. The light was fading fast. With the clock having ticked past 21:00, Nadal won a thrilling point to hold for 7-7 - Federer somehow flicked a ferocious Nadal smash onto the baseline but the Spaniard put away a forehand and, with adrenaline coursing through his body, celebrated with a huge fist-pump. Would they have to stop there?DD: I was sent out about 21:10 for the Charlie Pasarell-Pancho Gonzales match in 1969 (the second-longest singles match in Wimbledon history) and you could hardly see the white balls. The supervisor could not believe they were still playing. It was the same that day. I went down about 21:00 and thought 'they have to call this soon'. JO: \"I always think television gives a false impression because of the filters. You had to be there to appreciate how dark it was in those final games. When it got to 7-7 it was absolutely obvious there were two more games left. They wanted to bring them off at a level score. It would have been unfair to call them back with one person serving for the match or serving to stay in the match.\"PM: \"Obviously it was getting dark and the Hawk-Eye went off because of the darkness. Neither of the players mentioned it before the match ended. I think the players were so much into it that they did not even realise. We agreed with the referee, Andrew Jarrett, that we would have to stop the match at 8-8.\"Federer finally faltered when serving at 7-7. Although he saved three break points in that game, he couldn't stave off a fourth as a forehand floated long and Nadal had the decisive break. After the change of ends, Nadal came out to serve for the championship in what was going to be the final game of the day whatever happened. He brought up a third championship point but Federer raged against the dying of the light, firing a backhand return that Nadal could barely get a racquet on. It was to prove his last salvo - two points later he sent a forehand into the net and Nadal collapsed onto the grass in celebration. Finally, after four hours and 48 minutes of compelling theatre, Wimbledon had a new champion.Media caption, Nadal wins 2008 Wimbledon title in final setJM: \"To me, it was the greatest match I'd ever watched, the greatest match ever played anywhere.\"JO: \"It was like nothing we've seen before. There have been some great Wimbledon finals, but it was the intensity I remember from that final that really stays with me. The ability of these two men to bring out the big shots when it really mattered.\" DD: \"Most winners have beer and Champagne. Rafa, his uncle Toni and physio Rafael Maymo had ice cream - that's how they celebrated.\" JO: \"It was 10pm by the time we went behind the scenes for the press conferences and the interviews. I remember getting changed into my dinner jacket in a toilet at Wimbledon so by the time I interviewed Nadal, I could be hot-footing it to central London to get to the champions' dinner. In true old-school, pre-war BBC tradition I interviewed the champion, Nadal, in a bow tie.\"PM: \"I was super concentrated over hours so I couldn't get some sleep before 4-5am. Then I had to wake up really early to catch a plane. It was a tough Monday. But how lucky I am to be the official of that match? It's great that nobody remembers me in a way, but being part of this match, and having the best seat in the stadium, is just something unforgettable.\"Image source, Getty ImagesImage caption, The 2008 final remains the longest in Wimbledon historyAdditional reporting from Russell Fuller and Jonathan JurejkoSorry, we can't display this part of the article any more.Related internet linksThe BBC is not responsible for the content of external sites.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/7289/production/_102212392_federer_nadal_trophy_getty.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"legacy-header-block\"\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg.webp 624w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Roger Federer and Rafael Nadal embrace after the 2008 Wimbledon men\u0026#39;s singles final\" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/0C31/production/_102212130_embrace_getty2.jpg 624w\" width=\"624\" height=\"351\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eAFP\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eThe 2008 Wimbledon men\u0026#39;s singles final was the third in succession between Roger Federer and Rafael Nadal\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eThis feature was first published in 2018.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eJohn McEnroe describes it as \u0026#34;the greatest match ever played\u0026#34;, and the 2008 Wimbledon final between Rafael Nadal and Roger Federer remains the high point of a rivalry that dominated tennis.  \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe final - played out over nearly seven hours because of rain delays - ended with a 22-year-old Nadal finally dethroning Federer, holding off a thrilling fightback from the five-time champion to win 6-4 6-4 6-7 (5-7) 6-7 (8-10) 9-7 as darkness descended on an enraptured Centre Court.\u003c/p\u003e\u003cp\u003eIt was the last of three successive Wimbledon finals between two players who have won a combined 42 Grand Slam titles.\u003c/p\u003e\u003cp\u003eHere, BBC Sport speaks to four people who witnessed an extraordinary occasion - seven-time Grand Slam champion\u003cb\u003e McEnroe, \u003c/b\u003ewho commentated on the match for NBC, umpire \u003cb\u003ePascal Maria,\u003c/b\u003e long-time Wimbledon locker-room attendant \u003cb\u003eDoug Dickson,\u003c/b\u003e and \u003cb\u003eJonathan Overend\u003c/b\u003e - the BBC\u0026#39;s tennis correspondent from 2003 to 2013. \u003c/p\u003e\u003cp\u003eThis is how they saw \u0026#34;the greatest match\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Nadal-was-edging-closer-but-still-Federer-was-the-king\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Nadal was edging closer but still Federer was the king\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOn 6 July 2008 - the day of the match - Federer was a month short of his 27th birthday and had spent 231 consecutive weeks as world number one. \u003c/p\u003e\u003cp\u003eBut Nadal was close to toppling him. Four weeks earlier, he destroyed Federer at Roland Garros - winning 6-1 6-3 6-0 for his fourth consecutive French Open title. Could the Swiss recover to take revenge on his favoured surface?\u003c/p\u003e\u003cp\u003eFederer had beaten Nadal in four sets in the 2006 Wimbledon final, and five sets 12 months later. Both men were playing for a slice of history - Nadal trying to become the first man to win the French Open and Wimbledon back to back since Bjorn Borg in 1980, Federer attempting to go ahead of Borg by winning a sixth consecutive Wimbledon.\u003c/p\u003e\u003cp\u003eIt was also the last match played on Centre Court before a roof was installed, so the circumstances - with repeated rain interruptions, and a final finishing at twilight - are unlikely to be repeated. \u003c/p\u003e\u003cp\u003e\u003cb\u003eJonathan Overend:\u003c/b\u003e \u0026#34;Everybody was wondering whether this was going to be the day Federer\u0026#39;s great Wimbledon reign came to an end. Nadal was edging closer but still Federer was the king. It was beautifully set up.\u0026#34; \u003c/p\u003e\u003cp\u003e\u003cb\u003eDoug Dickson:\u003c/b\u003e \u0026#34;Roger was his usual calm, collected self. If he was nervous, he did not show it. Rafa was also his usual self, a tiny bit on edge, which was due, I think, to the weather.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eRain delayed the scheduled 14:00 start by 35 minutes, and the first point set the tone - a superb 14-stroke rally with both players moving each other round the court until Nadal whipped a forehand down the line. The Spaniard broke serve first - in the third game. As he served for the set at 5-4, Federer created two break-back opportunities but they were fought off, the younger man getting the job done on his third set point.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eNadal wins first set against Federer in 2008 Wimbledon final\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"There-was-always-that-sense-Federer-would-come-back\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;There was always that sense Federer would come back\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eFederer came back firing in the second set, breaking Nadal\u0026#39;s serve at the first opportunity by whipping a vicious cross-court forehand winner and establishing a 4-1 lead. But he could not capitalise and Nadal won five games in a row to go two sets to love up.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eJO:\u003c/b\u003e \u0026#34;I remember how well Nadal was moving, how cleanly he was striking the ball, how well he was serving. In those first two sets Federer knew this was going to be his toughest Wimbledon final yet. But there was always that sense that Federer would come back. Even at two sets to love, I don\u0026#39;t think anybody saw it as being over, simply because of Federer\u0026#39;s experience on that court.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eNadal wins second set against Federer in 2008 Wimbledon final\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eFederer had never faced a challenge on this scale in his previous Wimbledon finals. Dark clouds were gathering overhead as he failed to convert four further break points in the sixth game of the third set. At 3-3, Federer was down 0-40 but won five straight points. At 16:51, with Federer leading 5-4, the rain started falling and the players left the court.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDD: \u003c/b\u003e\u0026#34;During the first rain break, Roger went into the physio room and lay down on one of the beds. Rafa re-taped his fingers and had a mobile CD player plugged in.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003ePascal Maria: \u003c/b\u003e\u0026#34;I went in an office and sat down and did not turn my phone on at all. I talked to different guys in there very quietly, not talking about the tennis, not talking about what could happen next or what did happen.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eIt was more than an hour before the rain relented and the covers came off. At 18:11, play resumed with the third set, and potentially the match, about to be decided. Three service holds took it into a tie-break. Federer seized the initiative with a couple of trademark fizzing forehands to go 5-2 up and closed out the set with an ace that was greeted with a huge roar from the crowd.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"The-rain-delay-probably-woke-me-up\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;The rain delay probably woke me up\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFederer, speaking in \u003ca href=\"https://www.si.com/tennis/2018/06/26/strokes-genius-documentary-federer-nadal-tennis-channel-wimbledon-final?utm_medium=social\u0026amp;utm_source=twitter.com\u0026amp;utm_campaign=si-tennis\u0026amp;xid=socialflow_twitter_si\"\u003ethe Strokes of Genius documentary,\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e said: \u0026#34;My problem was I had lost in the French Open final a month earlier against Rafa in a terrible way. He crushed me. So when I went into the Wimbledon final, I felt like, \u0026#39;Oh my God, this is going to be really difficult.\u0026#39; I think it took me two sets to shake it off and I believe that rain delay probably woke me up. I said: \u0026#39;If you\u0026#39;re going to go out of this match, at least you\u0026#39;re going to go down swinging.\u0026#39;\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eRoger Federer seals third set with ace\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eThe fourth set went with serve, with excitement levels rising the longer it went. Federer served to stay in the match at 4-5. At 0-30, he was again on the precipice but four straight points allowed him to escape and prompted chants of \u0026#34;Roger, Roger\u0026#34;. It had been gripping enough but, with the time approaching 19:30, the match was about to go to another level in a tie-break of astonishing drama.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eJO:\u003c/b\u003e That was just an unbelievable tie-break. The nature of the way we do the radio commentary is one of us does sets one, three and five. My colleague Alastair Eykyn did sets two and four. We have a little bench at the back of our commentary box which I was sitting on. I was absolutely transfixed. Of course, part of you is hoping you get a fifth set because you\u0026#39;ll be the commentator for it but on the other hand you know you\u0026#39;re watching a great final and potentially a new champion. Nadal was so close to finishing it there and all those emotions were going on. As well as being there working, you\u0026#39;re there as a fan as well, thinking, \u0026#39;this is too good\u0026#39;.\u003c/p\u003e\u003cp\u003e\u003ci\u003eNadal went 5-2 ahead with two serves to come. A first Wimbledon title was on his racquet but suddenly the Spaniard\u0026#39;s left arm was gripped with tension, a double fault and netted backhand bringing the tie-break back on serve at 5-4. Federer had a set point at 6-5 but missed a forehand. Nadal had a championship point at 7-6 but couldn\u0026#39;t do anything with a powerful Federer serve. \u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ci\u003eAt 7-7, somehow, from way behind the baseline, Nadal whipped a forehand down the line that left the champion grasping at thin air. It was a staggering shot. He had a second championship point, this time on his serve, but it was Federer\u0026#39;s turn to come up with breathtaking inspiration, a nerveless backhand down the line. In his BBC commentary, Andrew Castle said: \u0026#34;The two best passing shots of the tournament, without doubt, have just taken place on the last two points.\u0026#34; \u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ci\u003eThe next two points saw a Federer forehand winner and missed Nadal return The roars grew louder. It was two sets all.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eFederer levels match after thrilling fourth-set tie-break\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJohn McEnroe:\u003c/b\u003e \u0026#34;What made the final so great was a combination of things. It was obviously the players, the magnitude of the situation, playing the Wimbledon final, and certainly the way it panned out. The battle that Roger was having with Rafa but also with himself, squandering the lead in the second set and getting way down and then having to pull out two sets in the tie-break.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eJO: \u003c/b\u003e\u0026#34;If ever there was a tie-break to prove Federer\u0026#39;s champion quality, it was that one. The greatest pull out their greatest shots when it really matters and that\u0026#39;s what Federer did. That felt absolutely massive, him winning that tie-break.\u0026#34; \u003c/p\u003e\u003cp\u003e\u003cb\u003ePM: \u003c/b\u003e\u0026#34;Two incredible players playing an incredible match. You cannot be screaming or clapping but you can deeply enjoy it. I can remember a few points in that match and inside I was saying, \u0026#39;wow, what a great shot\u0026#39; or \u0026#39;what a great point\u0026#39;.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eThe match went into a final set but, as is Wimbledon tradition, this one would not be decided by a tie-break. Federer would have the advantage of serving first. Nadal had to clear his mind after failing to convert two championship points.\u003c/i\u003e\u003c/p\u003e\u003cp\u003eNadal, speaking in \u003ca href=\"https://www.si.com/tennis/2018/06/26/strokes-genius-documentary-federer-nadal-tennis-channel-wimbledon-final?utm_medium=social\u0026amp;utm_source=twitter.com\u0026amp;utm_campaign=si-tennis\u0026amp;xid=socialflow_twitter_si\"\u003eStrokes of Genius\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e said: \u0026#34;I could lose the final. But I wasn\u0026#39;t going to fail. I\u0026#39;d be ready to compete till the end. Federer could win, but I wasn\u0026#39;t going to lose.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Nadal-wasnt-going-anywhere\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Nadal wasn\u0026#39;t going anywhere\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJO:\u003c/b\u003e \u0026#34;All bets were off by that point. The momentum was with Federer because he\u0026#39;d won the fourth set. History was with Federer because he was the five-time champion, but there was still this unknown of what Nadal was going to offer in the decider. He had played so well to that point. Only a fool would have written him off. It was clear in the early games, even though Federer was serving first, that Nadal wasn\u0026#39;t going anywhere.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eAt 19:53, with the decider poised at 2-2, deuce, the rain came again. The players went off and the covers came across. It looked like they would be coming back on Monday to finish it but it would prove a short interruption. Half an hour later, they resumed with, realistically, a maximum of an hour\u0026#39;s playable light left. The quality and intensity would never drop, the two men throwing all they had at each other. It was heart-stopping stuff.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eJM: \u003c/b\u003e\u0026#34;I was fortunate enough that people talked about my match with Bjorn in 1980 as one of the great matches. But I was watching the 2008 final and sitting back and saying to myself: \u0026#39;This is the best match I\u0026#39;ve ever seen at Wimbledon.\u0026#39;\u003c/p\u003e\u003cp\u003e\u0026#34;Towards the end, I was virtually not saying anything in the commentary box. I thought what I was witnessing was so great and the players were rising to the occasion - anyone watching could tell it was going to be a match that people would talk about for generations to come. To me that\u0026#39;s an easy gig when you\u0026#39;re watching a match like that. When it is that good you sort of kick back and put your arms back.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eThe match moved into its fifth hour. At 4-4, Federer earned a break point but Nadal saved it with a big forehand and follow-up smash. \u0026#34;Roger, Roger\u0026#34; and \u0026#34;Rafa, Rafa\u0026#34; were ringing out simultaneously. At 5-5, Nadal got to 15-40 on the Federer serve but the Swiss repelled him. The light was fading fast. With the clock having ticked past 21:00, Nadal won a thrilling point to hold for 7-7 - Federer somehow flicked a ferocious Nadal smash onto the baseline but the Spaniard put away a forehand and, with adrenaline coursing through his body, celebrated with a huge fist-pump. Would they have to stop there?\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDD: \u003c/b\u003eI was sent out about 21:10 for the Charlie Pasarell-Pancho Gonzales match in 1969 (the second-longest singles match in Wimbledon history) and you could hardly see the white balls. The supervisor could not believe they were still playing. It was the same that day. I went down about 21:00 and thought \u0026#39;they have to call this soon\u0026#39;. \u003c/p\u003e\u003cp\u003e\u003cb\u003eJO: \u003c/b\u003e\u0026#34;I always think television gives a false impression because of the filters. You had to be there to appreciate how dark it was in those final games. When it got to 7-7 it was absolutely obvious there were two more games left. They wanted to bring them off at a level score. It would have been unfair to call them back with one person serving for the match or serving to stay in the match.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003ePM: \u003c/b\u003e\u0026#34;Obviously it was getting dark and the Hawk-Eye went off because of the darkness. Neither of the players mentioned it before the match ended. I think the players were so much into it that they did not even realise. We agreed with the referee, Andrew Jarrett, that we would have to stop the match at 8-8.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eFederer finally faltered when serving at 7-7. Although he saved three break points in that game, he couldn\u0026#39;t stave off a fourth as a forehand floated long and Nadal had the decisive break. After the change of ends, Nadal came out to serve for the championship in what was going to be the final game of the day whatever happened. He brought up a third championship point but Federer raged against the dying of the light, firing a backhand return that Nadal could barely get a racquet on. It was to prove his last salvo - two points later he sent a forehand into the net and Nadal collapsed onto the grass in celebration. Finally, after four hours and 48 minutes of compelling theatre, Wimbledon had a new champion.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eNadal wins 2008 Wimbledon title in final set\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJM: \u003c/b\u003e\u0026#34;To me, it was the greatest match I\u0026#39;d ever watched, the greatest match ever played anywhere.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eJO:\u003c/b\u003e \u0026#34;It was like nothing we\u0026#39;ve seen before. There have been some great Wimbledon finals, but it was the intensity I remember from that final that really stays with me. The ability of these two men to bring out the big shots when it really mattered.\u0026#34; \u003c/p\u003e\u003cp\u003e\u003cb\u003eDD:\u003c/b\u003e \u0026#34;Most winners have beer and Champagne. Rafa, his uncle Toni and physio Rafael Maymo had ice cream - that\u0026#39;s how they celebrated.\u0026#34; \u003c/p\u003e\u003cp\u003e\u003cb\u003eJO: \u003c/b\u003e\u0026#34;It was 10pm by the time we went behind the scenes for the press conferences and the interviews. I remember getting changed into my dinner jacket in a toilet at Wimbledon so by the time I interviewed Nadal, I could be hot-footing it to central London to get to the champions\u0026#39; dinner. In true old-school, pre-war BBC tradition I interviewed the champion, Nadal, in a bow tie.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003ePM: \u003c/b\u003e\u0026#34;I was super concentrated over hours so I couldn\u0026#39;t get some sleep before 4-5am. Then I had to wake up really early to catch a plane. It was a tough Monday. But how lucky I am to be the official of that match? It\u0026#39;s great that nobody remembers me in a way, but being part of this match, and having the best seat in the stadium, is just something unforgettable.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eThe 2008 final remains the longest in Wimbledon history\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003ci\u003eAdditional reporting from Russell Fuller and Jonathan Jurejko\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eSorry, we can\u0026#39;t display this part of the article any more.\u003c/p\u003e\u003csection data-component=\"related-internet-links\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eRelated internet links\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\" spacing=\"responsive\"\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe BBC is not responsible for the content of external sites.\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2018-06-28T22:55:12Z",
  "modifiedTime": null
}
