{
  "id": "fd83b679-23e2-4a88-a6f3-78a331cf6529",
  "title": "Sinner caps superb year as Italy retain Davis Cup title",
  "link": "https://www.bbc.com/sport/tennis/articles/cew29l415kjo",
  "description": "Jannik Sinner caps an extraordinary 2024 season by battling past the Netherlands' Tallon Griekspoor to help Italy defend their Davis Cup title.",
  "author": "",
  "published": "Sun, 24 Nov 2024 21:02:11 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Emily Salley",
  "length": 3332,
  "excerpt": "Jannik Sinner caps an extraordinary 2024 season by battling past the Netherlands' Tallon Griekspoor to help Italy defend their Davis Cup title.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Sinner caps superb year as Italy retain Davis Cup titleMedia caption, 'Brilliant' Sinner seals Davis Cup title for ItalyJannik Sinner ended an extraordinary 2024 season on a high by helping Italy retain their Davis Cup title.The world number one continued his dominant year with a hard-fought 7-6 (7-2) 6-2 win over Tallon Griekspoor to secure a 2-0 victory against the Netherlands.That came after Matteo Berrettini defeated Botic van de Zandschulp 6-4 6-2 to hand Italy an early advantage in Malaga.It caps a triumphant week for emerging tennis powerhouse Italy after the women's team secured the Billie Jean King Cup title on Wednesday.\"We are very happy to be back here holding this trophy. It feels like we are in Italy,\" Sinner said.\"You have a different pressure and a different weight of having Italy on your shoulders - I think we handled it really well.\"If it was not important I would not be here. For me, it means so much to me.\"For Sinner, it concludes a successful season that saw him claim his first two Grand Slam titles at January's Australian Open and September's US Open.The 23-year-old, who also won the season-ending ATP Finals earlier this month, has lost just six of his 76 ATP Tour matches in the last 12 months.Speaking in a news conference after their Davis Cup triumph, Berrettini described Sinner as \"the most humble guy on the planet\".However, Sinner's year has been disrupted by an ongoing doping controversy which has left his immediate future in the sport uncertain.\"Of course it's in the head a little bit,\" Sinner said about the doping case.\"The most important part is all the people who know me as a human being trust me -- that's why I kept playing the level I have.\"I was emotionally a bit down, a bit heartbroken. Sometimes life gives you difficulties and you just have to [deal with] it.\"Sinner looked fatigued as he was forced to a tie-break in the opening set against Griekspoor, but surged late on in the second to seal Italy's third Davis Cup triumph on his fourth match point.Italy become the sixth team to win back-to-back Davis Cup titles since the final stage was introduced 52 years ago, and first since the Czech Republic in 2013.'I missed these moments' - Berrettini back to his bestImage source, Getty ImagesImage caption, Former world number six Berrettini was a runner-up at Wimbledon in 2022Berrettini watched Italy's 2023 victory from the sidelines as he recovered from an ankle injury that he sustained a few months earlier.The former world number world number six spent six months on the sidelines and subsequently dropped out of the world's top 150.However, he returned to action in March and quickly claimed three titles - the most he has ever won in a calendar year.Now ranked 35th, Berrettini has been crucial to Italy's title defence this week, pairing up with Sinner to win the doubles decider against Argentina before triumphing in his semi-final singles match against Australia's Thanasi Kokkinakis.He replicated his fine form against Van de Zandschulp, hitting 10 forehand winners and 16 aces on his way to victory.\"It feels unbelievable, it feels really great to be on court - being able to be health and enjoying this kind of atmosphere is the most important thing for me,\" Berrettini said.\"I missed these moments and that's why I'm really happy.\"More on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/cb56/live/7d8ee650-aa99-11ef-bdf5-b7cb2fa86e10.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eSinner caps superb year as Italy retain Davis Cup title\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;Brilliant\u0026#39; Sinner seals Davis Cup title for Italy\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJannik Sinner ended an extraordinary 2024 season on a high by helping Italy retain their Davis Cup title.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe world number one continued his dominant year with a hard-fought 7-6 (7-2) 6-2 win over Tallon Griekspoor to secure a 2-0 victory against the Netherlands.\u003c/p\u003e\u003cp\u003eThat came after Matteo Berrettini defeated Botic van de Zandschulp 6-4 6-2 to hand Italy an early advantage in Malaga.\u003c/p\u003e\u003cp\u003eIt caps a triumphant week for emerging tennis powerhouse Italy after the women\u0026#39;s team secured the Billie Jean King Cup title on Wednesday.\u003c/p\u003e\u003cp\u003e\u0026#34;We are very happy to be back here holding this trophy. It feels like we are in Italy,\u0026#34; Sinner said.\u003c/p\u003e\u003cp\u003e\u0026#34;You have a different pressure and a different weight of having Italy on your shoulders - I think we handled it really well.\u003c/p\u003e\u003cp\u003e\u0026#34;If it was not important I would not be here. For me, it means so much to me.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFor Sinner, it concludes a successful season that saw him claim his first two Grand Slam titles at January\u0026#39;s Australian Open and September\u0026#39;s US Open.\u003c/p\u003e\u003cp\u003eThe 23-year-old, who also won the season-ending ATP Finals earlier this month, has lost just six of his 76 ATP Tour matches in the last 12 months.\u003c/p\u003e\u003cp\u003eSpeaking in a news conference after their Davis Cup triumph, Berrettini described Sinner as \u0026#34;the most humble guy on the planet\u0026#34;.\u003c/p\u003e\u003cp\u003eHowever, Sinner\u0026#39;s year has been disrupted by an ongoing doping controversy which has left his \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cly3zw1gqwjo\"\u003eimmediate future in the sport uncertain\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;Of course it\u0026#39;s in the head a little bit,\u0026#34; Sinner said about the doping case.\u003c/p\u003e\u003cp\u003e\u0026#34;The most important part is all the people who know me as a human being trust me -- that\u0026#39;s why I kept playing the level I have.\u003c/p\u003e\u003cp\u003e\u0026#34;I was emotionally a bit down, a bit heartbroken. Sometimes life gives you difficulties and you just have to [deal with] it.\u0026#34;\u003c/p\u003e\u003cp\u003eSinner looked fatigued as he was forced to a tie-break in the opening set against Griekspoor, but surged late on in the second to seal Italy\u0026#39;s third Davis Cup triumph on his fourth match point.\u003c/p\u003e\u003cp\u003eItaly become the sixth team to win back-to-back Davis Cup titles since the final stage was introduced 52 years ago, and first since the Czech Republic in 2013.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"I-missed-these-moments-Berrettini-back-to-his-best\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;I missed these moments\u0026#39; - Berrettini back to his best\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eFormer world number six Berrettini was a runner-up at Wimbledon in 2022\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBerrettini watched Italy\u0026#39;s 2023 victory from the sidelines as he recovered from an ankle injury that he sustained a few months earlier.\u003c/p\u003e\u003cp\u003eThe former world number world number six spent six months on the sidelines and subsequently dropped out of the world\u0026#39;s top 150.\u003c/p\u003e\u003cp\u003eHowever, he returned to action in March and quickly claimed three titles - the most he has ever won in a calendar year.\u003c/p\u003e\u003cp\u003eNow ranked 35th, Berrettini has been crucial to Italy\u0026#39;s title defence this week, pairing up with Sinner to win the doubles decider against Argentina before triumphing in his semi-final singles match against Australia\u0026#39;s Thanasi Kokkinakis.\u003c/p\u003e\u003cp\u003eHe replicated his fine form against Van de Zandschulp, hitting 10 forehand winners and 16 aces on his way to victory.\u003c/p\u003e\u003cp\u003e\u0026#34;It feels unbelievable, it feels really great to be on court - being able to be health and enjoying this kind of atmosphere is the most important thing for me,\u0026#34; Berrettini said.\u003c/p\u003e\u003cp\u003e\u0026#34;I missed these moments and that\u0026#39;s why I\u0026#39;m really happy.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-24T18:38:19.574Z",
  "modifiedTime": null
}
