{
  "id": "12e28656-984a-4662-90a2-5281fd012f64",
  "title": "RuneScape Shows How It’s Done with its 2025-26 Roadmaps",
  "link": "https://tagn.wordpress.com/2025/03/06/runescape-shows-how-its-done-with-its-2025-26-roadmaps/",
  "description": "I realize I am difficult to please, that I often find fault, that I can be more picky than Goldlilocks at the local Mattress Firm storefront, where nothing seems to land in the “just right” zone… and all the more so with something I look forward to dissecting on a regular basis, like a game’s […]",
  "author": "Wilhelm Arcturus",
  "published": "Thu, 06 Mar 2025 16:15:28 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "Misc MMOs",
    "2025",
    "Jagex",
    "Old School RuneScape",
    "Roadmap",
    "RuneScape",
    "Sailing"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 4003,
  "excerpt": "I realize I am difficult to please, that I often find fault, that I can be more picky than Goldlilocks at the local Mattress Firm storefront, where nothing seems to land in the “just right\u0026#8…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "I realize I am difficult to please, that I often find fault, that I can be more picky than Goldlilocks at the local Mattress Firm storefront, where nothing seems to land in the “just right” zone… and all the more so with something I look forward to dissecting on a regular basis, like a game’s annual roadmap. So far in 2025 I’ve complained about the LOTRO roadmap being sparse and incomplete… how do you not put the whole 64-bit server thing on it… and low effort, looking like something cranked out at the last minute, the EVE Online roadmap being boringly predictable to the point of generating zero excitement, and the EverQuest and EverQuest II roadmaps answering the question “can we keep up the momentum after a huge anniversary year?” with a fairly tepid “probably not.” Only Blizzard seems to have their roadmap game up to snuff with World of Warcraft, knowing how to make it look like there is more going on that there probably is, being able to add a mystery here and a some anticipation there, and generally making the coming year feel a bit exciting. But Blizz probably has more people working on WoW than all those other games have combined and WoW is really something like four or five different games at this point… or maybe a dozen different games, depending on how you slice and dice it.  I mean, is it just retail… excuse me, modern WoW or is it solo PvE WoW, group line-dance raiding WoW, PvP battleground and arena WoW, cosmetic and collector and Trading Post FOMO WoW, and soon to be Azeroth home building WoW?  I could make the argument that those are all distinct games under the modern umbrella. So WoW Modern got one roadmap, while WoW Classic, which is forever vanilla classic, progression classic, anniversary classic classic, hardcore classic, and season of flavor of the month classic, got its own roadmap. But, given how much content I have just assigned to the two halves of the current WoW world, those roadmaps seem a bit sparse.  They’re better than most of what I have mentioned so far, but the presentation given the scope of what I just said was going on with both branches, seems just a bit anemic. See, I find fault with everything.  And that is likely due to my proximity to the titles being mapped, an assertion I will likely prove when I say that the roadmaps that Jagex put out at last week’s RuneFest look great.  They have a summary up for modern RuneScape that has a roadmap and a lot of detail that all looks great to me… the outsider who player about three minutes of RuneScape back in 2008 and never bothered to even mention it. RuneScape 2025-2026 Roadmap It is a linear road map that leads us through the year into 2026 and it feels like a lot is going on, that the year will lead from one thing to the next in a ride that doesn’t, say, have a 3-5 month gap filled in by the logo for Mists of Pandaria or lead to a dead end part way into the year like Season of Discovery. Aesthetically, that is a good, tight, intesting looking roadmap from Jagex, and they carry on with that with the Old School RuneScape roadmap, which has its own summary from RuneFest over on its site. Old School RuneScape 2025 – 2026 Roadmap Look at that, they are adding sailing!  SAILING!  We’re just trying to get housing in Azeroth and over in Old School RuneScape they going to be messing about in boats this year.  I’d trade every under water zone and mechanic for sailing. This all sounds great… to me, the complete outsider, with scant knowledge and zero context.  I don’t know, maybe the community is up in arms, rioting, and setting fire to things over some of this, but I am completely outside of that.  I just like me an exciting roadmap that draws attention. This is so much better than “dullest possible PowerPoint slide” that seems to figure into the a couple of the designs I mentioned above. Anyway, that was all I really want to say, that Jagex has its roadmap visual game going in a way some other studios should envy. Also, I am now convinced I want sailing.",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eI realize I am difficult to please, that I often find fault, that I can be more picky than Goldlilocks at the local Mattress Firm storefront, where nothing seems to land in the “just right” zone… and all the more so with something I look forward to dissecting on a regular basis, like a game’s annual roadmap.\u003c/p\u003e\n\u003cp\u003eSo far in 2025 I’ve complained about \u003ca href=\"https://tagn.wordpress.com/2025/01/07/lotro-2025-and-a-sparse-yet-chaotic-roadmap-ahead/\"\u003ethe \u003cem\u003eLOTRO\u003c/em\u003e roadmap being sparse and incomplete\u003c/a\u003e… how do you not put the whole 64-bit server thing on it… and low effort, looking like something cranked out at the last minute, \u003ca href=\"https://tagn.wordpress.com/2025/01/30/ccp-posts-an-unsurprising-2025-roadmap-for-eve-online/\"\u003ethe \u003cem\u003eEVE Online\u003c/em\u003e roadmap being boringly predictable\u003c/a\u003e to the point of generating zero excitement, and \u003ca href=\"https://tagn.wordpress.com/2025/01/10/a-look-at-the-everquest-and-everquest-ii-2025-roadmaps/\"\u003ethe \u003cem\u003eEverQuest\u003c/em\u003e and \u003cem\u003eEverQuest II\u003c/em\u003e roadmaps\u003c/a\u003e answering the question “can we keep up the momentum after a huge anniversary year?” with a fairly tepid “probably not.”\u003c/p\u003e\n\u003cp\u003eOnly Blizzard seems to have their roadmap game up to snuff with \u003cem\u003eWorld of Warcraft\u003c/em\u003e, knowing how to make it look like there is more going on that there probably is, being able to add a mystery here and a some anticipation there, and generally making the coming year feel a bit exciting.\u003c/p\u003e\n\u003cp\u003eBut Blizz probably has more people working on \u003cem\u003eWoW\u003c/em\u003e than all those other games have combined and \u003cem\u003eWoW\u003c/em\u003e is really something like four or five different games at this point… or maybe a dozen different games, depending on how you slice and dice it.  I mean, is it just retail… excuse me, modern \u003cem\u003eWoW\u003c/em\u003e or is it solo PvE \u003cem\u003eWoW\u003c/em\u003e, group line-dance raiding \u003cem\u003eWoW\u003c/em\u003e, PvP battleground and arena \u003cem\u003eWoW\u003c/em\u003e, cosmetic and collector and Trading Post FOMO \u003cem\u003eWoW\u003c/em\u003e, and soon to be Azeroth home building \u003cem\u003eWoW?\u003c/em\u003e  I could make the argument that those are all distinct games under the modern umbrella.\u003c/p\u003e\n\u003cp\u003eSo \u003ca href=\"https://tagn.wordpress.com/2024/11/19/after-20-years-blizzard-says-housing-is-coming-to-world-of-warcraft/\"\u003e\u003cem\u003eWoW Modern\u003c/em\u003e got one roadmap,\u003c/a\u003e while \u003cem\u003eWoW Classic\u003c/em\u003e, which is forever vanilla classic, progression classic, anniversary classic classic, hardcore classic, and season of flavor of the month classic, \u003ca href=\"https://tagn.wordpress.com/2024/11/14/the-blizzard-wow-classic-road-map-includes-pandaria-and-new-vanilla-progression-servers/\"\u003egot its own roadmap\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBut, given how much content I have just assigned to the two halves of the current \u003cem\u003eWoW\u003c/em\u003e world, those roadmaps seem a bit sparse.  They’re better than most of what I have mentioned so far, but the presentation given the scope of what I just said was going on with both branches, seems just a bit anemic.\u003c/p\u003e\n\u003cp\u003eSee, I find fault with everything.  And that is likely due to my proximity to the titles being mapped, an assertion I will likely prove when I say that the roadmaps that Jagex put out at last week’s RuneFest look great.  They have \u003ca href=\"https://secure.runescape.com/m=news/rs-ahead-at-runefest---havenhythe-leagues-and-more-revealed\"\u003ea summary up for modern \u003cem\u003eRuneScape\u003c/em\u003e\u003c/a\u003e that has a roadmap and a lot of detail that all looks great to me… the outsider who player about three minutes of \u003cem\u003eRuneScape\u003c/em\u003e back in 2008 and never bothered to even mention it.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132948\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-132948\" data-attachment-id=\"132948\" data-permalink=\"https://tagn.wordpress.com/2025/03/06/runescape-shows-how-its-done-with-its-2025-26-roadmaps/rs2025roadmap/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg\" data-orig-size=\"1920,1080\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"RS2025roadmap\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;RuneScape 2025-2026 Roadmap\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=600\" alt=\"\" width=\"600\" height=\"338\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/rs2025roadmap.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132948\"\u003eRuneScape 2025-2026 Roadmap\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIt is a linear road map that leads us through the year into 2026 and it feels like a lot is going on, that the year will lead from one thing to the next in a ride that doesn’t, say, have a 3-5 month gap filled in by the logo for Mists of Pandaria or lead to a dead end part way into the year like Season of Discovery.\u003c/p\u003e\n\u003cp\u003eAesthetically, that is a good, tight, intesting looking roadmap from Jagex, and they carry on with that with the \u003cem\u003eOld School RuneScape\u003c/em\u003e roadmap, which has its \u003ca href=\"https://secure.runescape.com/m=news/runefest-2025-summit-summary?oldschool=1\"\u003eown summary from RuneFest over on its site\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_132947\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-132947\" data-attachment-id=\"132947\" data-permalink=\"https://tagn.wordpress.com/2025/03/06/runescape-shows-how-its-done-with-its-2025-26-roadmaps/osrs2025roadmap/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg\" data-orig-size=\"1920,1080\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"OSRS2025roadmap\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Old School RuneScape 2025 – 2026 Roadmap\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=600\" alt=\"\" width=\"600\" height=\"338\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/osrs2025roadmap.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-132947\"\u003eOld School RuneScape 2025 – 2026 Roadmap\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eLook at that, they are adding sailing!  SAILING!  We’re just trying to get housing in Azeroth and over in \u003cem\u003eOld School RuneScape\u003c/em\u003e they going to be messing about in boats this year.  I’d trade every under water zone and mechanic for sailing.\u003c/p\u003e\n\u003cp\u003eThis all sounds great… to me, the complete outsider, with scant knowledge and zero context.  I don’t know, maybe the community is up in arms, rioting, and setting fire to things over some of this, but I am completely outside of that.  I just like me an exciting roadmap that draws attention.\u003c/p\u003e\n\u003cp\u003eThis is so much better than “dullest possible PowerPoint slide” that seems to figure into the a couple of the designs I mentioned above.\u003c/p\u003e\n\u003cp\u003eAnyway, that was all I really want to say, that Jagex has its roadmap visual game going in a way some other studios should envy.\u003c/p\u003e\n\u003cp\u003eAlso, I am now convinced I want sailing.\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-06T16:15:28Z",
  "modifiedTime": "2025-03-06T14:55:06Z"
}
