{
  "id": "17d5e714-3776-418d-9d2c-a3a15e453393",
  "title": "I Love The Switch 2, But I Hate Its Controller",
  "link": "https://www.escapistmagazine.com/i-love-the-switch-2-but-i-hate-its-controller/",
  "description": "",
  "author": "Jesse Lab",
  "published": "Wed, 18 Jun 2025 12:39:05 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Features",
    "Video Games",
    "Nintendo Switch 2"
  ],
  "byline": "Jesse Lab",
  "length": 4881,
  "excerpt": "The Nintendo Switch 2 is here and while I've been loving my time with the system, I can't deny that I HATE its controller.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "After playing with the Nintendo Switch 2 for well over a week, I can say with certainty that it’s exactly what I wanted from a successor to the Switch. Bigger screen size, a better kickstand, better performance. It has it all… except for a comfortable controller. Let me make one thing perfectly clear – I didn’t love the Joy-Cons on the original Switch. I’m a tall guy, and because of that, I have fairly large hands, and the Joy-Cons on the original Switch were somewhat small for me. I made it work, mostly thanks to the plastic grip that slotted them into a traditional controller shape, but it wasn’t ideal. The grip forced the Joy-Cons into a square-shaped piece of plastic that never felt natural, no matter how much I tried to delude myself into thinking otherwise. When you compare the original Joy-Cons and their grip to the DualSense, and even the Wii U GamePad, it just wasn’t for me. I didn’t think I would have an issue with the new Jon-Cons given the system’s larger size. I thought that it would be an improvement, and they would probably fit more comfortably in my hands without my fingers feeling bunched together. So, once I got my Switch 2 plugged in and got over the joy of disconnecting the new Joy-Con’s magnets, I sat down to play Mario Kart World and quickly realized that these new Joy-Cons wouldn’t be much of an improvement. Sure, I could go into a lot of the technical reasons for why I was disappointed in the controller, like how apparently Nintendo didn’t resolve any of the Joy-Con drifting issues that plagued virtually all revisions of the controller, but that’s going to be a problem for me a few years down the road. No, my disappointment right out of the box was that, despite them being a larger size, they still didn’t feel all too comfortable. Better in some ways than the original Switch’s Joy-Cons, but not by much. Again, I have large hands, so when I held the new Joy-Cons, I noticed how my pinkies began to feel somewhat irritated the longer I played. I eventually figured out it was because the magnetic base that juts out of the Joy-Cons was digging into the joints of my fingers. At first, I barely paid any mind to this, but after a few white-knuckle Knockout Tours in Mario Kart World, I could start to feel the edges of the magnets dig into my fingers. I never got any scratches or pain from it, but I did feel some discomfort during more tense sections. I admit that this is definitely a ME problem. Plenty of people will find the new Joy-Cons fit their hands and grips perfectly, but I can’t imagine anyone, and I mean anyone, who would find the plastic grip they’ve thrown in with the Switch 2 pleasant. I said before that I was never a fan of the original Switch’s plastic slot for the Joy-Cons thanks to its funky shape, but at the very least, when the controllers were slotted into it, they were flush against the grip. My hands could wrap around the grip without any real issue, and I could just get on with gaming like normal. But I connected the new Joy-Con’s into the Switch 2’s unique grip, and I knew before I even picked it up that I was going to hate it. Why? Because the damn things weren’t flush anymore. Because the magnets of the new Joy-Cons are along the middle of the controller, players can’t slide them into the new grip. They have to be inserted horizontally, much like with the console itself. However, this creates a problem where there is a lot of dead space between where the controllers are to be inserted and the part where your fingers wrap around. Basically, if you’re playing with the Switch 2’s Joy-Cons in the grip, your palms, or at least the part that connects to your thumbs, will be pressed between the Joy-Cons and the grip. This feels horrible. I actively hate using the grip because I can literally feel my palm being forced into a weird space that’s tight and odd. Sure, the part of the controller that my palm would be resting on is flat, but that doesn’t change the fact that the side of it isn’t, so the grip is constantly scraping my palm. I can’t be the only person who finds it awkward to hold. Maybe not as awkward as an N64 controller, but that’s a pretty low bar, and even then, at least that was slightly more form-fitting than this. It made me go out and buy a Pro Controller, which is great by the way, but the fact that the controllers and grip in the box are so unpleasant to me made me sour on the Switch 2 ever so slightly; this isn’t a cheap console, and the games aren’t either. It’s just a terrible shape, and I can’t be the only person who thinks that the Switch 2’s new plastic grip for the Joy-Cons is worse than the original system’s grip. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2025/06/switch2.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"275\" data-injectable=\"true\" data-video=\"true\"\u003eAfter playing with the Nintendo Switch 2 for well over a week, I can say with certainty that it’s exactly what I wanted from a successor to the Switch. Bigger screen size, a better kickstand, better performance. It has it all… except for a comfortable controller.\u003c/p\u003e\n\n\n    \u003cp data-characters=\"663\" data-current-count=\"663\" data-injectable=\"true\"\u003eLet me make one thing perfectly clear – I didn’t love the Joy-Cons on the original Switch. I’m a tall guy, and because of that, I have fairly large hands, and the Joy-Cons on the original Switch were somewhat small for me. I made it work, mostly thanks to the plastic grip that slotted them into a traditional controller shape, but it wasn’t ideal. The grip forced the Joy-Cons into a square-shaped piece of plastic that never felt natural, no matter how much I tried to delude myself into thinking otherwise. When you compare the original Joy-Cons and their grip to the DualSense, and even the Wii U GamePad, it just wasn’t for me. \u003c/p\u003e    \u003cp data-characters=\"479\" data-current-count=\"479\" data-injectable=\"true\"\u003eI didn’t think I would have an issue with the new Jon-Cons given the system’s larger size. I thought that it would be an improvement, and they would probably fit more comfortably in my hands without my fingers feeling bunched together. So, once I got my Switch 2 plugged in and got over the joy of disconnecting the new Joy-Con’s magnets, I sat down to play \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/tag/mario-kart-world/\"\u003eMario Kart World\u003c/a\u003e\u003c/em\u003e and quickly realized that these new Joy-Cons wouldn’t be much of an improvement.\u003c/p\u003e    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" height=\"576\" width=\"1024\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2025/06/switch2joycon.jpg?w=1024\u0026amp;resize=1024%2C576\" alt=\"A close-up of the Nintendo Switch 2\u0026#39;s Joy-Cons\"/\u003e\u003c/figure\u003e    \u003cp data-characters=\"529\" data-current-count=\"829\" data-injectable=\"true\"\u003eSure, I could go into a lot of the technical reasons for why I was disappointed in the controller, like how apparently Nintendo \u003ca href=\"https://www.youtube.com/watch?v=RvD1OCHhhS0\" target=\"_blank\"\u003edidn’t resolve any of the Joy-Con drifting issues\u003c/a\u003e that plagued virtually all revisions of the controller, but that’s going to be a problem for me a few years down the road. No, my disappointment right out of the box was that, despite them being a larger size, they still didn’t feel all too comfortable. Better in some ways than the original Switch’s Joy-Cons, but not by much.\u003c/p\u003e    \u003cp data-characters=\"547\" data-current-count=\"547\" data-injectable=\"true\"\u003eAgain, I have large hands, so when I held the new Joy-Cons, I noticed how my pinkies began to feel somewhat irritated the longer I played. I eventually figured out it was because the magnetic base that juts out of the Joy-Cons was digging into the joints of my fingers. At first, I barely paid any mind to this, but after a few white-knuckle Knockout Tours in \u003cem\u003eMario Kart World\u003c/em\u003e, I could start to feel the edges of the magnets dig into my fingers. I never got any scratches or pain from it, but I did feel some discomfort during more tense sections.\u003c/p\u003e    \u003cp data-characters=\"263\" data-current-count=\"263\" data-injectable=\"false\"\u003eI admit that this is definitely a \u003cem\u003eME\u003c/em\u003e problem. Plenty of people will find the new Joy-Cons fit their hands and grips perfectly, but I can’t imagine anyone, and I mean anyone, who would find the plastic grip they’ve thrown in with the Switch 2 pleasant.\u003c/p\u003e    \u003cfigure data-current-count=\"563\" data-injectable=\"true\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" height=\"576\" width=\"1024\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2025/06/switch2grip.jpg?w=1024\u0026amp;resize=1024%2C576\" alt=\"A close up of the Nintendo Switch 2\u0026#39;s Joy-Con grip\"/\u003e\u003c/figure\u003e    \u003cp data-characters=\"537\" data-current-count=\"537\" data-injectable=\"true\"\u003eI said before that I was never a fan of the original Switch’s plastic slot for the Joy-Cons thanks to its funky shape, but at the very least, when the controllers were slotted into it, they were flush against the grip. My hands could wrap around the grip without any real issue, and I could just get on with gaming like normal. But I connected the new Joy-Con’s into the Switch 2’s unique grip, and I knew before I even picked it up that I was going to hate it. Why? Because the damn things weren’t flush anymore.\u003c/p\u003e    \u003cp data-characters=\"562\" data-current-count=\"562\" data-injectable=\"true\"\u003eBecause the magnets of the new Joy-Cons are along the middle of the controller, players can’t slide them into the new grip. They have to be inserted horizontally, much like with the console itself. However, this creates a problem where there is a lot of dead space between where the controllers are to be inserted and the part where your fingers wrap around. Basically, if you’re playing with the Switch 2’s Joy-Cons in the grip, your palms, or at least the part that connects to your thumbs, will be pressed between the Joy-Cons and the grip. \u003c/p\u003e    \u003cp data-characters=\"1006\" data-current-count=\"1006\" data-injectable=\"false\"\u003eThis feels horrible. I actively hate using the grip because I can literally feel my palm being forced into a weird space that’s tight and odd. Sure, the part of the controller that my palm would be resting on is flat, but that doesn’t change the fact that the side of it isn’t, so the grip is constantly scraping my palm. I can’t be the only person who finds it awkward to hold. Maybe not as awkward as an N64 controller, but that’s a pretty low bar, and even then, at least that was slightly more form-fitting than this. It made me go out and buy a Pro Controller, which is great by the way, but the fact that the controllers and grip in the box are so unpleasant to me made me sour on the Switch 2 ever so slightly; this isn’t a cheap console, and the games aren’t either. It’s just a terrible shape, and I can’t be the only person who thinks that the Switch 2’s new plastic grip for the Joy-Cons is worse than the original system’s grip.\u003c/p\u003e\n\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-18T12:39:05Z",
  "modifiedTime": "2025-06-18T12:39:08Z"
}
