{
  "id": "18ef8841-d919-480b-93fc-a51f3e488b3e",
  "title": "Helldivers 2: Heart of Democracy update live, brings the fight to the streets of Super Earth",
  "link": "https://blog.playstation.com/2025/05/20/helldivers-2-heart-of-democracy-update-live-brings-the-fight-to-the-streets-of-super-earth/",
  "description": "The worst nightmare of all those who fight for Managed Democracy has been made a grim reality. Despite the valiant efforts of our Helldivers to push back the fleet, the Illuminate have reached Super Earth. Now they are swarming our cities, terrorizing citizens, and destroying our infrastructure. It’s time to rise up and take arms […]",
  "author": "Katherine Baskin",
  "published": "Tue, 20 May 2025 09:01:38 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS5",
    "Arrowhead Studios",
    "helldivers 2"
  ],
  "byline": "Hermen Hulst CEO, Studio Business Group, Sony Interactive Entertainment",
  "length": 2954,
  "excerpt": "Fight back against the Illuminate on home turf.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjEPr%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FwEaCXVzLWVhc3QtMSJIMEYCIQDkWlCdgJZKrI0R1oPHXXB7FiZp38ZFYOZvzo6eG8757gIhAJ51tPL0zve4Zm2LMBD8x2P7xpQdq8NVcx%252BqNle86Ws5KoYECLL%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FwEQABoMNTc3NDE4ODE4NDEzIgzWmngL404zknaJIn4q2gOvwMEfS32zpnKFBq%252FB3yOnhPzK4k1sxWvUwflqnTmdaTlc769UX8Q0hCqG%252FVaFxeHz%252FaIeYoSz82%252FqNJCsbvgLV5Tq5ne37LbIGBcR8qabbNhO5YLDEmJhnNry1B%252FVwRKRjcC0TAaafoOWGN4jhlxna67%252F%252BuFOsuFn04zWEBLIARbb%252FJAHHAeDvwfSWupJFvUUuboHvmfNJQwTPSmeOKdzKzglsZVUHP8iIXrsXZGuhp%252BBb7jiSIhkQqQalA4q2bpKfgz0vbUyr9zL%252FX9qsoF1PtnFcrsuVu%252BJq9ENiu994oUZ64ah06613cEH7romxpmF0on8QIJaLniEaB68EjIDjQCtnLhNigtWcdHR3dBhXz0CdNLdc6%252FNRTZwKN%252FQ%252BqtibFeC2guJykeLqd2SixTw%252Bc3LuLtPIX%252FZNuqKXcE%252Bqr9UGFH7DKrA2WqPiOqXHWAHh30g0TrqWdLnWR7JQ5WU8hqJJ0aH6BFNhcgjv2b%252BaKif6QbCRYgq2jXxGLMarDq9XM3uOyxIe2U%252FRsHp2W0tF6zN%252By6M5HPVeOLSZhtoeNe5TV%252BnozQV50HPY6jGJyZWn33caj1Z0SMltTYnghh6DxwB1d0%252B%252BF0U3DcokqeDYYIF9%252B7ppmAs2ekwws20wQY6pAHbN2X69fiBCuV93fb3OnQuq9tsBfaFOHHeyuo62Q4qriIXoHgFoIocgt37ePrakenlaK6LoJu1X1FkeAoy5hml4y557gvTrtxzIlBMM2yRNv8QOZn8iJNE6noekt0AyxTMg1hVPoJkI3NiFmw1%252B4pPfMbOlxm907LXiMUWvxCPzRuB6VkarFiAdJhV2rq3vliNXmKX52rPzbulDx4YmxXpxgvBoA%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NWYT75VDZU%252F20250521%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20250521T011545Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D2fd8bfdfc1a84f0b580db4db73ff333ca582e645c6e7ca767f29c3457eb35971\u0026fit=192%2C192",
  "text": "The worst nightmare of all those who fight for Managed Democracy has been made a grim reality. Despite the valiant efforts of our Helldivers to push back the fleet, the Illuminate have reached Super Earth. Now they are swarming our cities, terrorizing citizens, and destroying our infrastructure. It’s time to rise up and take arms and fight for the precious foundations and soil of Democracy manifest. Helldivers, return to our planet and defend what is rightfully ours. Super Earth… our home The urban sprawl of Super Earth is the site of the conflict. Fight among the towering skyscrapers and crowded streets of our home turf as the Illuminate rain down destruction all around you. Inside the city biomes, you will tackle operations and work to liberate cities together, having a significant impact on planetary campaigns. Repel the invasion The Helldivers are tasked with a new objective: to repel the Illuminate invasion by gaining ground over the squids as they fight to control areas where the fleet is landing. It won’t be a walk in the park, divers. Like a game of intergalactic tug-of-war, you will struggle against the incoming forces, gaining and losing control quickly. Arm the cannons Even in the face of such danger, we are not helpless, and all is not lost. The might of Super Earth’s arsenal lies hidden beneath our peaceful, democratic streets. With your help, we must activate our Planetary Defense Cannons and take down the Illuminate fleet in a grand show of power. Call for backup It’s all hands on deck as you encounter SEAF troops who will help join the fight to defend our Freedom. These small squads will fight enemies on their own, or they can be ordered to follow Helldivers and provide temporary backup as you navigate toward objectives. Salute and lead them on the path to victory, divers! Protect citizens However, you must also be aware of the many civilians still roaming the streets, fearing for their lives. They may be panicked, Helldivers, but it is your sworn duty to keep them safe and they look to you as the ultimate protectors of liberty. Remember: any civilian lives lost from friendly fire will be punished. Prepare for the fight Last week, we released a powerful primary weapon customization system and expanded surplus options to fight against the Illuminate as they emerged from the singularity. Now that you have learned the tactics of these new squid troops–like the Crescent Overseer and the hulking Fleshmob–you must master these tools to continue the fight on Super Earth. Use every available resource, divers, and decimate their forces! Our major update, Heart of Democracy, is now live. Helldivers, to your hellpods immediately! Citizens, enlistment centers will remain open for recruitment. The battle for Super Earth has begun. Internet Connection and Helldivers 2 game required for update. Trending Stories",
  "image": "https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-404945\"\u003e\n\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\n\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"1088\" height=\"612\" src=\"https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\" alt=\"Helldivers 2: Heart of Democracy update live, brings the fight to the streets of Super Earth\" sizes=\"(min-width: 1170px) 936px, (min-width: 960px) 80vw, 100vw\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1 1088w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.93 1012w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.71 772w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.58 631w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.46 500w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.39 424w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.3 326w, https://blog.playstation.com/tachyon/2025/05/7bb2cbfef7ae86aec04cca017f997b76689ff4ab.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.24 261w\"/\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eThe worst nightmare of all those who fight for Managed Democracy has been made a grim reality.\u003c/p\u003e\n\n\n\t\n\t\n\n\n\n\u003cp\u003eDespite the valiant efforts of our Helldivers to push back the fleet, the Illuminate have reached Super Earth. Now they are swarming our cities, terrorizing citizens, and destroying our infrastructure. It’s time to rise up and take arms and fight for the precious foundations and soil of Democracy manifest. Helldivers, return to our planet and defend what is rightfully ours.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54529901223_31242fe419_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54529901223_31242fe419_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eSuper Earth… our home\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe urban sprawl of Super Earth is the site of the conflict. Fight among the towering skyscrapers and crowded streets of our home turf as the Illuminate rain down destruction all around you.\u003c/p\u003e\n\n\n\n\u003cp\u003eInside the city biomes, you will tackle operations and work to liberate cities together, having a significant impact on planetary campaigns.\u003c/p\u003e\n\n\n\n\u003ch2\u003eRepel the invasion\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe Helldivers are tasked with a new objective: to repel the Illuminate invasion by gaining ground over the squids as they fight to control areas where the fleet is landing. It won’t be a walk in the park, divers. Like a game of intergalactic tug-of-war, you will struggle against the incoming forces, gaining and losing control quickly.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54529665666_4dc1b3272c_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54529665666_4dc1b3272c_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eArm the cannons\u003c/h2\u003e\n\n\n\n\u003cp\u003eEven in the face of such danger, we are not helpless, and all is not lost. The might of Super Earth’s arsenal lies hidden beneath our peaceful, democratic streets. With your help, we must activate our Planetary Defense Cannons and take down the Illuminate fleet in a grand show of power.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54529665636_0667084ed4_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54529665636_0667084ed4_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eCall for backup\u003c/h2\u003e\n\n\n\n\u003cp\u003eIt’s all hands on deck as you encounter SEAF troops who will help join the fight to defend our Freedom. These small squads will fight enemies on their own, or they can be ordered to follow Helldivers and provide temporary backup as you navigate toward objectives. Salute and lead them on the path to victory, divers!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54529901213_a56680a06c_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54529901213_a56680a06c_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eProtect citizens\u003c/h2\u003e\n\n\n\n\u003cp\u003eHowever, you must also be aware of the many civilians still roaming the streets, fearing for their lives. They may be panicked, Helldivers, but it is your sworn duty to keep them safe and they look to you as the ultimate protectors of liberty. Remember: any civilian lives lost from friendly fire will be punished.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54528784657_07464afb3d_o.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54528784657_07464afb3d_o.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003ePrepare for the fight\u003c/h2\u003e\n\n\n\n\u003cp\u003eLast week, we released a powerful primary weapon customization system and expanded surplus options to fight against the Illuminate as they emerged from the singularity. Now that you have learned the tactics of these new squid troops–like the Crescent Overseer and the hulking Fleshmob–you must master these tools to continue the fight on Super Earth. Use every available resource, divers, and decimate their forces!\u003c/p\u003e\n\n\n\n\u003cp\u003eOur major update, Heart of Democracy, is now live. Helldivers, to your hellpods immediately! Citizens, enlistment centers will remain open for recruitment.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe battle for Super Earth has begun.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eInternet Connection and Helldivers 2 game required for update.\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/article\u003e\u003csection\u003e\n\t\u003ch2\u003eTrending Stories\u003c/h2\u003e\n\n\t\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-20T02:01:38-07:00",
  "modifiedTime": "2025-05-20T02:01:41-07:00"
}
