{
  "id": "1bc1a4f3-b484-46be-866b-6cdeed2a8dba",
  "title": "Wheel World is a Radical Take on Bike Racing",
  "link": "https://news.xbox.com/en-us/2025/03/21/wheel-world-is-a-radical-take-on-bike-racing/",
  "description": "The post Wheel World is a Radical Take on Bike Racing appeared first on Xbox Wire.",
  "author": "Mike Nelson, Xbox Wire Editor",
  "published": "Fri, 21 Mar 2025 21:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "ID@Xbox",
    "PC Gaming",
    "Annapurna Interactive",
    "Messhof",
    "Wheel World"
  ],
  "byline": "Mike Nelson, Xbox Wire Editor",
  "length": 4454,
  "excerpt": "I didn’t have riding a fixed-gear bike possessed by an entity named Skully on my list of games to play this year, but that’s part of the fun of attending events like the ID@Xbox Showcase at GDC – you never know what new game is going to catch your eye. Wheel World, with its mix of open-world exploration, loot scouring, and surprisingly fun and competitive racing has put this radical take on bike racing on my radar as it speeds its way to Xbox Series X|S and Windows PC with Xbox Play Anywhere support for release later this year.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "I didn’t have riding a fixed-gear bike possessed by an entity named Skully on my list of games to play this year, but that’s part of the fun of attending events like the ID@Xbox Showcase at GDC – you never know what new game is going to catch your eye. Wheel World, with its mix of open-world exploration, loot scouring, and surprisingly fun and competitive racing has put this radical take on bike racing on my radar as it speeds its way to Xbox Series X|S and Windows PC with Xbox Play Anywhere support for release later this year. In Wheel World you play Kat, a bike rider fated to save this unique realm that’s full of rival riders, spare parts, and portal potties — outhouses that work as a fast-travel option. That hits on another aspect I enjoyed about my time with the game: its humor. It never seems to take itself too seriously, as one should expect when it features a bike possessed by an entity in charge of marshaling spirits to and from the Moon. Helping Skully gather these spirits is your central goal during your time in Wheel World, but to do that you need to assemble the best ride possible. Traversing the realm of Wheel World and looking for loot (spare parts) is a big part of the fun, as you can uncover these items that contain a variety of pieces to customize your bike – everything from its frame, to wheels, to handlebars, and more are all swappable which affect stats like speed and handling. These parts can also come in ‘Legendary’ status and can give unique powers like increasing your boost meter to help during races. Another rule of this world is Reputation, needed to unlock higher-leveled zones, which you can gain by facing down other riders you encounter on the road, or when you take down a rival bike gang by – you guessed it – racing. Which is great, because it feels so fun to ride throughout Wheel World. All the competitions I tried out, whether they were up against a single rider or a pack, were very fun and lightly challenging with a nice pumping soundtrack running in the background (courtesy of Italians Do It Better). As I would glide through a pack of rivals, I found that both drafting (that’s moving behind the rider to reduce wind resistance), and utilizing boost at the opportune times, were keys to success. Winning races can also net you coupons that you can use at bike shops found within the world, giving you access to even more spare parts for your bike. The physics for the handling of the bike also felt very natural, as you would have to factor in things like speed around turns, heavy peddling up hills, or just gliding downhill, it all felt very refined – which is great because the game relies so much on this aspect. In addition, its cell-shaded world itself is beautiful to ride through, reminiscent of games like Sable or Dungeons of Hinterberg. Independent developer Messhof describes Wheel World as about the joy and freedom of living around bikes – and that feels like the case here. From racing, to tinkering, to exploring or even just going out for a cruise through the hills, it captures that spirit of riding a bike and the freedom of exploration that comes with it. Look for Wheel World to come to Xbox Series X|S and Windows PC, with support for Xbox Play Anywhere, later this year. Welcome to Wheel World, where the fate of the universe rests on your handlebars. You are Kat, a young cyclist with one mission: save Wheel World from total collapse. Explore a stunning open world filled with impressive vistas, hidden secrets, and races that will test your skills. Customize your bike with an endless array of parts, from sleek speedsters to off-road beasts—there's no limit to how you can ride. Wheel World is packed with things to do: Race and Dominate: Take on elite cycling teams and quirky rivals in high-stakes races where every second counts. Upgrade Your Ride: Scour the world for rare parts to build the ultimate bike, perfectly tailored to your style. Carry Out Your Destiny: Recover your stolen Legendary parts to ultimately perform The Great Shift ritual and save the world. No big deal. All of this is backed by an original soundtrack from Italians Do It Better, pumping energy into every race and moments of breathtaking semi-open world exploration. It's time to pedal your way to glory, save the spirits of Wheel World, and keep the universe on track. Hop on, ride fast, and don't look back.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/KeyArt-1f5380f28fb66a020fe3.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eI didn’t have riding a fixed-gear bike possessed by an entity named Skully on my list of games to play this year, but that’s part of the fun of attending events like the ID@Xbox Showcase at GDC – you never know what new game is going to catch your eye. \u003cstrong\u003e\u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/wheel-world/9NGCFDHR2MV3/0010\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWheel World\u003c/a\u003e\u003c/em\u003e\u003c/strong\u003e, with its mix of open-world exploration, loot scouring, and surprisingly fun and competitive racing has put this radical take on bike racing on my radar as it speeds its way to Xbox Series X|S and Windows PC with Xbox Play Anywhere support for release later this year.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn \u003cem\u003eWheel World \u003c/em\u003eyou play Kat, a bike rider fated to save this unique realm that’s full of rival riders, spare parts, and portal potties — outhouses that work as a fast-travel option. That hits on another aspect I enjoyed about my time with the game: its humor. It never seems to take itself too seriously, as one should expect when it features a bike possessed by an entity in charge of marshaling spirits to and from the Moon. Helping Skully gather these spirits is your central goal during your time in \u003cem\u003eWheel World\u003c/em\u003e, but to do that you need to assemble the best ride possible.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot1-41c9f4e0689c64ed5f57.jpg\" alt=\"\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot1-41c9f4e0689c64ed5f57.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot1-41c9f4e0689c64ed5f57-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot1-41c9f4e0689c64ed5f57-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot1-41c9f4e0689c64ed5f57-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTraversing the realm of \u003cem\u003eWheel World \u003c/em\u003eand looking for loot (spare parts) is a big part of the fun, as you can uncover these items that contain a variety of pieces to customize your bike – everything from its frame, to wheels, to handlebars, and more are all swappable which affect stats like speed and handling. These parts can also come in ‘Legendary’ status and can give unique powers like increasing your boost meter to help during races.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnother rule of this world is Reputation, needed to unlock higher-leveled zones, which you can gain by facing down other riders you encounter on the road, or when you take down a rival bike gang by – you guessed it – racing. Which is great, because it feels \u003cem\u003eso fun\u003c/em\u003e to ride throughout \u003cem\u003eWheel World\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot3-e507746a179a93b248c2.jpg\" alt=\"\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot3-e507746a179a93b248c2.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot3-e507746a179a93b248c2-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot3-e507746a179a93b248c2-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot3-e507746a179a93b248c2-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAll the competitions I tried out, whether they were up against a single rider or a pack, were very fun and lightly challenging with a nice pumping soundtrack running in the background (courtesy of Italians Do It Better). As I would glide through a pack of rivals, I found that both drafting (that’s moving behind the rider to reduce wind resistance), and utilizing boost at the opportune times, were keys to success. Winning races can also net you coupons that you can use at bike shops found within the world, giving you access to even more spare parts for your bike.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe physics for the handling of the bike also felt very natural, as you would have to factor in things like speed around turns, heavy peddling up hills, or just gliding downhill, it all felt very refined – which is great because the game relies so much on this aspect. In addition, its cell-shaded world itself is beautiful to ride through, reminiscent of games like \u003cem\u003eSable \u003c/em\u003eor \u003cem\u003eDungeons of Hinterberg\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot2-f05040413c0508dcc658.jpg\" alt=\"\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot2-f05040413c0508dcc658.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot2-f05040413c0508dcc658-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot2-f05040413c0508dcc658-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/ScreenShot2-f05040413c0508dcc658-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIndependent developer Messhof describes \u003cem\u003eWheel World \u003c/em\u003eas about the joy and freedom of living around bikes – and that feels like the case here. From racing, to tinkering, to exploring or even just going out for a cruise through the hills, it captures that spirit of riding a bike and the freedom of exploration that comes with it. Look for \u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/wheel-world/9NGCFDHR2MV3/0010\"\u003eWheel World\u003c/a\u003e\u003c/strong\u003e \u003c/em\u003eto come to Xbox Series X|S and Windows PC, with support for Xbox Play Anywhere, later this year.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cdiv data-product-id=\"9NGCFDHR2MV3\" id=\"msp1742590437307\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9NGCFDHR2MV3\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.15368.13648167123945660.0abed91b-bdc3-4159-bfec-9e1ba1ec545f.1c4cf44d-3271-4033-8cdb-a4265b3bacdb?w=400\u0026amp;h=600\" alt=\"Wheel World\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tWelcome to Wheel World, where the fate of the universe rests on your handlebars.\n\nYou are Kat, a young cyclist with one mission: save Wheel World from total collapse. Explore a stunning open world filled with impressive vistas, hidden secrets, and races that will test your skills. Customize your bike with an endless array of parts, from sleek speedsters to off-road beasts—there\u0026#39;s no limit to how you can ride.\n\nWheel World is packed with things to do:\n\nRace and Dominate: Take on elite cycling teams and quirky rivals in high-stakes races where every second counts.\nUpgrade Your Ride: Scour the world for rare parts to build the ultimate bike, perfectly tailored to your style.\nCarry Out Your Destiny: Recover your stolen Legendary parts to ultimately perform The Great Shift ritual and save the world. No big deal.\n\nAll of this is backed by an original soundtrack from Italians Do It Better, pumping energy into every race and moments of breathtaking semi-open world exploration.\n\nIt\u0026#39;s time to pedal your way to glory, save the spirits of Wheel World, and keep the universe on track. Hop on, ride fast, and don\u0026#39;t look back.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003chr/\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-21T21:00:00Z",
  "modifiedTime": "2025-03-21T21:03:06Z"
}
