{
  "id": "1c17d8f3-1e1e-40e9-b8ca-2a4544c8a0f1",
  "title": "The Legacy of Kain series: retrospective with original developers",
  "link": "https://blog.playstation.com/2024/11/19/the-legacy-of-kain-series-retrospective-with-original-developers/",
  "description": "Becoming the stuff of legend is no easy feat. But it’s entirely appropriate that a compelling and complex tale about vengeful vampires has not only lasted as long as it has, but triumphantly arisen from its resting place. From its popular 1996 debut, The Legacy of Kain series has a long-standing history across PlayStation, from […]",
  "author": "Corey Brotherson",
  "published": "Tue, 19 Nov 2024 15:04:58 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PS4",
    "PS5",
    "/Legacy of Kain: Soul Reaver 1 \u0026 2 Remastered",
    "aspyr"
  ],
  "byline": "Adam Michel Director, Game Services – Content, Sony Interactive Entertainment",
  "length": 6788,
  "excerpt": "Vampires, wraiths, and philosophical debates - discover why this spectral series has left such a legacy with its fans.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjEOn%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FwEaCXVzLWVhc3QtMSJGMEQCIBBh%252BzDLnSlqHeRPqtE2QUIhQ3TX96j3ANL8kuVljUKlAiBL7ev3A4jPmlVa%252Bc5Ypf2Rsrh53UssJaD3xtG43BFukyqGBAiC%252F%252F%252F%252F%252F%252F%252F%252F%252F%252F8BEAAaDDU3NzQxODgxODQxMyIMOjkSfZBI36%252Bh04nfKtoDpwzTFH6PJYHzx8znYwWknE2s4whrlMB1g%252FjNeMWISINlQ15RdQAFBCzRRFIRP9uXCaUQYDv16yBi1aNvxI9wXDIERWa6mb%252FoivN7UxmkVj4rrKdObqyF%252F7n%252FJMlLn%252BM9aY6VJDKk1YWZwpIe9DOaheXps5DIFyp08VSQG%252BxBS3Ok28x8gbYEuEEpVW%252Fbxnm1e34dYjpi66LHLQotmams43US2xXrnJVPrnhMOm7dZQZK5rGDKnd1Fyi3rpMBc0iI3nvC32b2Y8v4WXbJScqaAHhQJLT%252BxDZqB%252FkQus83UMZeBJ5ZKy%252B6vkBI1Wqpat9vphReW4NHQL3pn6gCVhFoVhEC6egO8KLp7ftS2hqdfWbEI82EN3T1%252FkvsYiAO2%252BdEW0uPOfWb%252BqwXCY3aTui2TtLVrDYAXPcCxBtkYex4euzxKlWsoGBYA60s%252FCQKE2d2AZ8FYTGyWWZrPOru0B6yo%252BzkWbhfNzGdTlcqLcCWHZGL5e7SUBeegOFb%252BvOT4l5qxsQEUyTVZ1GMZBaJX1OMZLczppkGyisPj4EfojpZEQoHqZokmIZ%252FhrskSHNVEYg9rZHq8FHfydWy3wm%252ByC%252F7nFr6AN3SQkbJcCYV%252BxddjC9%252FM4pkQ4BM9ClJMOPk9LkGOqYBJ8kB3Xx5R1T04qoHpq8W8SZwDr2Lb9SQT1bgW0DaAPigNqdMd8CldVm4o11QXRbhoQ3OJFexUXbLdlKWAyeRzNLsSJRA9UFvXKXBJrsIjDku1YaEsK5rWeeJh6Amq7rrJLNfdAwPlnttab7CLt0cjeaVIQpVt3e7pRkabEvF9AhEwab6CjxAmAMxPs1Hqs79KSPh6VvQa%252FWsZilhIbO0%252B2GcGzzQqQ%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NW6FFSVMYY%252F20241120%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20241120T010726Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D77c64365f25a5a8d9b868450567235b685def01e6bdc08ddd607439cd8293bd3\u0026fit=192%2C192",
  "text": "Becoming the stuff of legend is no easy feat. But it’s entirely appropriate that a compelling and complex tale about vengeful vampires has not only lasted as long as it has, but triumphantly arisen from its resting place. From its popular 1996 debut, The Legacy of Kain series has a long-standing history across PlayStation, from introducing memorable characters to pioneering in 3D game design. So, with Legacy of Kain: Soul Reaver 1 \u0026 2 Remastered on its way to PlayStation 4 and PlayStation 5, and Blood Omen: Legacy of Kain and Blood Omen 2 coming to PlayStation Plus Classics, it’s the perfect time to dig up the details on why The Legacy of Kain series has endured. As a bonus, the original developers join us to recall some relevant anecdotes on the way… A new gameplay video showcases Raziel’s otherwordly abilities in The Legacy of Kain: Soul Reaver 1 \u0026 2 Remastered. “I’m super proud of the way we wove our time travel plot throughout the games – writing time travel stories is hard!” – Amy Hennig, Design Manager (Blood Omen: Legacy of Kain), Director and Lead Writer (Soul Reaver, Soul Reaver 2, Legacy of Kain: Defiance) 1996 – Blood Omen: Legacy of Kain – PlayStation – Silicon Knights/Crystal Dynamics Action-adventures took a turn for the macabre as The Legacy of Kain series introduced us to the shadowy world of Nosgoth. Blood Omen set the tone with Kain seeking a cure for his vampiric curse, only to slip deeper into a moral abyss. Engaging hack-and-slash gameplay mixed with magic, shapeshifting, and puzzle-layered exploration cast an intoxicating spell encased by a smart and gripping story that laid the groundwork for all that followed. So it was no surprise that the triumphant debut of the titular vampire lord was met with a craving for more. Only three years later, that craving was satisfied… “It was one of the best-looking games for PlayStation.” – Daniel Cabuco, lead enemy artist (Legacy of Kain: Soul Reaver); lead artist (Legacy of Kain: Soul Reaver 2) and art director (Legacy of Kain: Defiance) 1999 – Legacy of Kain: Soul Reaver – PlayStation – Crystal Dynamics/Eidos Interactive If Blood Omen began the crimson-stained lineage for the series in 2D, Soul Reaver took up the trail and innovated it into fully formed 3D. This time the consequences of Kain’s actions are directly in your hands, assuming control of the iconic Raziel, a former vampire lieutenant slain by Kain. Resurrected into a wraith, Raziel is given his mission by The Elder God – to destroy Kain and restore the now-broken wasteland of Nosgoth to its former glory. The evolution into 3D allowed the series to push the boundaries of its presentation even more, especially when teamed with the already captivating narrative, which allowed players to travel between the material and spectral realms. “The writing, dialogue, and incredible voice acting all took things to the next level,” says Cabuco. “At every point the artists, designers, musicians, and engineers asked themselves how they could make the experience better. It was an incredible moment in time where every aspect was firing on all cylinders.” It’s a sentiment shared by the game’s chief of engineering, Scott Krotz: “The streaming technology we developed was great, and I think we only had one loading screen in the entire game once getting into it. The combination of solid gameplay and technology, a dark world full of interesting lore, a great story and characters, and amazing voice actors all came together to make it a pretty special game.” “The amazingly well directed cinematics with lip sync were simply mind blowing.” – Monika Erosova, head of development (Legacy of Kain: Soul Reaver 1 \u0026 2 Remastered) 2001 – Soul Reaver 2 – PlayStation 2 – Crystal Dynamics/Eidos Interactive After Soul Reaver introduced the iconic Raziel, its sequel vastly expanded on his human past, traveling through time to reveal Nosgoth’s secrets which have immense repercussions on not only Raziel and his home, but Kain as well. Between its combat, puzzles, and exploration, Soul Reaver 2 successfully elevated much of what made its predecessor so well received, but a particular spotlight fell on its story and characters. “Amy Hennig masterfully interconnected Raziel’s journey back to Blood Omen,” says Erosova. “I enjoyed exploring the world in different eras.” “Soul Reaver 2 was originally supposed to be on the original PlayStation, but our team was determined to use the power of PS2 to elevate the game’s graphics and animation,” reveals Amy Hennig, who worked as design manager on Blood Omen: Legacy of Kain, and director and lead writer on Soul Reaver, Soul Reaver 2 and Legacy of Kain: Defiance. “We ported the game onto the new hardware in a matter of weeks.” 2002 – Blood Omen 2 – PlayStation 2 – Crystal Dynamics/Eidos Interactive In a smart connection to the time travel chaos of Soul Reaver 2, the series went back to its roots in Blood Omen 2 by exploring an alternate timeline set after the events of the very first Blood Omen. This gave players a chance to enjoy Kain’s undead life again, aside from his antagonistic turn in the Soul Reaver games, layering a now rich and involving lore. While paying homage to its vampiric roots where Kain is able to feed off enemies or civilians to replenish his health, novel gameplay elements like weapon durability kept the combat and challenge fresh. 2003 – Legacy of Kain: Defiance – PlayStation 2 – Crystal Dynamics/Eidos Interactive After two games each where we played as Kain or Raziel, it was perhaps inevitable that we’d get a chance to control both characters in the same game – which is where Legacy of Kain: Defiance swooped in. “Given we were revealing crucial things about our characters’ motivations and the world that shaped them, it was critical for us to make Kain and Raziel dual protagonists, and to cut back and forth between their playable chapters,” explains Hennig. Using different abilities helped differentiate between the bitter enemies in terms of gameplay, while the story offered the now expected – and satisfying – philosophical pondering on determinism and morality to resolve Kain and Raziel’s blood-stained conflict. “We wanted to tell a great, complex story with flawed but compelling characters in a captivating and original world,” says Hennig. “It’s incredibly gratifying to see how formative and indelible these games and stories have been for our audience.” You’ll be able to get a taste of the series’ lasting legacy when  Blood Omen: Legacy of Kain and Blood Omen 2 arrive on PlayStation Plus Premium November 19, and when Legacy of Kain: Soul Reaver 1 \u0026 2 Remastered hits PlayStation 4 and PlayStation 5 on December 10.",
  "image": "https://blog.playstation.com/tachyon/2024/11/44616c894430f6dc51e74b1bad0f0cd89e3c8b11.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eBecoming the stuff of legend is no easy feat. But it’s entirely appropriate that a compelling and complex tale about vengeful vampires has not only lasted as long as it has, but triumphantly arisen from its resting place.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom its popular 1996 debut, The Legacy of Kain series has a long-standing history across PlayStation, from introducing memorable characters to pioneering in 3D game design. So, with \u003ca href=\"https://store.playstation.com/en-us/product/UP1032-PPSA18153_00-SOULREAVER120824\"\u003eLegacy of Kain: Soul Reaver 1 \u0026amp; 2 Remastered \u003c/a\u003eon its way to PlayStation 4 and PlayStation 5, and \u003ca href=\"https://blog.playstation.com/2024/11/13/playstation-plus-game-catalog-for-november-grand-theft-auto-v-dying-light-2-stay-human-like-a-dragon-ishin-and-more/\"\u003eBlood Omen: Legacy of Kain and Blood Omen 2 coming to PlayStation Plus Classics\u003c/a\u003e, it’s the perfect time to dig up the details on why The Legacy of Kain series has endured. As a bonus, the original developers join us to recall some relevant anecdotes on the way…\u003c/p\u003e\n\n\n\n\t\n\t\n\n\n\n\u003cp\u003e\u003cem\u003eA new gameplay video showcases Raziel’s otherwordly abilities in The Legacy of Kain: Soul Reaver 1 \u0026amp; 2 Remastered.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I’m super proud of the way we wove our time travel plot throughout the games – writing time travel stories is hard!”\u003c/p\u003e\n\u003ccite\u003e– Amy Hennig, Design Manager (Blood Omen: Legacy of Kain), Director and Lead Writer (Soul Reaver, Soul Reaver 2, Legacy of Kain: Defiance)\u003c/cite\u003e\u003c/blockquote\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54119625089_3b9cb2d3ca_h.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54119625089_3b9cb2d3ca_h.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e1996 – Blood Omen: Legacy of Kain – PlayStation – Silicon Knights/Crystal Dynamics\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eAction-adventures took a turn for the macabre as The Legacy of Kain series introduced us to the shadowy world of Nosgoth. Blood Omen set the tone with Kain seeking a cure for his vampiric curse, only to slip deeper into a moral abyss.\u003c/p\u003e\n\n\n\n\u003cp\u003eEngaging hack-and-slash gameplay mixed with magic, shapeshifting, and puzzle-layered exploration cast an intoxicating spell encased by a smart and gripping story that laid the groundwork for all that followed. So it was no surprise that the triumphant debut of the titular vampire lord was met with a craving for more. Only three years later, that craving was satisfied…\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“It was one of the best-looking games for PlayStation.”\u003c/p\u003e\n\u003ccite\u003e– Daniel Cabuco, lead enemy artist (Legacy of Kain: Soul Reaver); lead artist (Legacy of Kain: Soul Reaver 2) and art director (Legacy of Kain: Defiance)\u003c/cite\u003e\u003c/blockquote\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54118435387_c4932d7a2c_h.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54118435387_c4932d7a2c_h.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e1999 – Legacy of Kain: Soul Reaver – PlayStation – Crystal Dynamics/Eidos Interactive\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eIf Blood Omen began the crimson-stained lineage for the series in 2D, Soul Reaver took up the trail and innovated it into fully formed 3D. This time the consequences of Kain’s actions are directly in your hands, assuming control of the iconic Raziel, a former vampire lieutenant slain by Kain. Resurrected into a wraith, Raziel is given his mission by The Elder God – to destroy Kain and restore the now-broken wasteland of Nosgoth to its former glory.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe evolution into 3D allowed the series to push the boundaries of its presentation even more, especially when teamed with the already captivating narrative, which allowed players to travel between the material and spectral realms.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The writing, dialogue, and incredible voice acting all took things to the next level,” says Cabuco. “At every point the artists, designers, musicians, and engineers asked themselves how they could make the experience better. It was an incredible moment in time where every aspect was firing on all cylinders.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s a sentiment shared by the game’s chief of engineering, Scott Krotz: “The streaming technology we developed was great, and I think we only had one loading screen in the entire game once getting into it. The combination of solid gameplay and technology, a dark world full of interesting lore, a great story and characters, and amazing voice actors all came together to make it a pretty special game.”\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“The amazingly well directed cinematics with lip sync were simply mind blowing.”\u003c/p\u003e\n\u003ccite\u003e– Monika Erosova, head of development (Legacy of Kain: Soul Reaver 1 \u0026amp; 2 Remastered)\u003c/cite\u003e\u003c/blockquote\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54118435417_a856f78484_h.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54118435417_a856f78484_h.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e2001 – Soul Reaver 2 – PlayStation 2 – Crystal Dynamics/Eidos Interactive\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eAfter Soul Reaver introduced the iconic Raziel, its sequel vastly expanded on his human past, traveling through time to reveal Nosgoth’s secrets which have immense repercussions on not only Raziel and his home, but Kain as well.\u003c/p\u003e\n\n\n\n\u003cp\u003eBetween its combat, puzzles, and exploration, Soul Reaver 2 successfully elevated much of what made its predecessor so well received, but a particular spotlight fell on its story and characters. “Amy Hennig masterfully interconnected Raziel’s journey back to Blood Omen,” says Erosova. “I enjoyed exploring the world in different eras.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“Soul Reaver 2 was originally supposed to be on the original PlayStation, but our team was determined to use the power of PS2 to elevate the game’s graphics and animation,” reveals Amy Hennig, who worked as design manager on Blood Omen: Legacy of Kain, and director and lead writer on Soul Reaver, Soul Reaver 2 and Legacy of Kain: Defiance. “We ported the game onto the new hardware in a matter of weeks.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54119288436_587f53a3d8_h.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54119288436_587f53a3d8_h.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e2002 – Blood Omen 2 – PlayStation 2 – Crystal Dynamics/Eidos Interactive\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eIn a smart connection to the time travel chaos of Soul Reaver 2, the series went back to its roots in Blood Omen 2 by exploring an alternate timeline set after the events of the very first Blood Omen. This gave players a chance to enjoy Kain’s undead life again, aside from his antagonistic turn in the Soul Reaver games, layering a now rich and involving lore.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile paying homage to its vampiric roots where Kain is able to feed off enemies or civilians to replenish his health, novel gameplay elements like weapon durability kept the combat and challenge fresh.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54119561228_ae6aaaf120_h.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54119561228_ae6aaaf120_h.jpg\" alt=\"\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e2003 – Legacy of Kain: Defiance – PlayStation 2 – Crystal Dynamics/Eidos Interactive\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eAfter two games each where we played as Kain or Raziel, it was perhaps inevitable that we’d get a chance to control both characters in the same game – which is where Legacy of Kain: Defiance swooped in. “Given we were revealing crucial things about our characters’ motivations and the world that shaped them, it was critical for us to make Kain and Raziel dual protagonists, and to cut back and forth between their playable chapters,” explains Hennig.\u003c/p\u003e\n\n\n\n\u003cp\u003eUsing different abilities helped differentiate between the bitter enemies in terms of gameplay, while the story offered the now expected – and satisfying – philosophical pondering on determinism and morality to resolve Kain and Raziel’s blood-stained conflict.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We wanted to tell a great, complex story with flawed but compelling characters in a captivating and original world,” says Hennig. “It’s incredibly gratifying to see how formative and indelible these games and stories have been for our audience.”\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll be able to get a taste of the series’ lasting legacy when  Blood Omen: Legacy of Kain and Blood Omen 2 arrive on PlayStation Plus Premium November 19, and when Legacy of Kain: Soul Reaver 1 \u0026amp; 2 Remastered hits PlayStation 4 and PlayStation 5 on December 10.\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-19T07:04:58-08:00",
  "modifiedTime": "2024-11-19T08:26:27-08:00"
}
