{
  "id": "1e3a4deb-bd4d-473b-8c74-14e21245fd80",
  "title": "The AndaSeat New Year Sale Starts Now: Up to $220 Off Gaming Chairs and Task Chairs",
  "link": "https://www.ign.com/articles/andaseat-kaiser-new-year-gaming-chair-sale-2025",
  "description": "Combine with a 10% IGN coupon code for extra savings",
  "author": "Eric Song",
  "published": "Mon, 13 Jan 2025 22:05:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Eric Song",
  "length": 5445,
  "excerpt": "Combine with a 10% IGN coupon code for extra savings",
  "siteName": "IGN",
  "favicon": "",
  "text": "Combine with a 10% IGN coupon code for extra savingsAndaSeat isn't as big of a name in the congested gaming chair market as some other brands like Secretlab, DXRacer, or Razer, but rest assured it makes some high-quality gaming chairs. Right now, there's an AndaSeat New Year Sale with up to $220 off gaming chairs. These instant discounts stack with our 10% off IGN code \"AndaIGN\".Andaseat Kaiser 3 Gaming ChairUse 10% off code: AndaIGNAndaSeat Kaiser 3 Gaming ChairThe Kaiser 3 offers great value for a high-end gaming chair that competes with other chairs that cost $500 or more. The base model currently costs $386.10, which is about $60 cheaper than the Kaiser 4, and shares most of the same features. You lose out on the 5D armrests and the lumbar is less adjustable, but that's about it.In his Andaseat Kaiser 3 review, Mark Knapp wrote that \"The AndaSeat Kaiser 3 makes some meaningful improvements to the series’ design, including a wide seatbase that does away with metal bolsters for hours-long comfort and a flexible lumbar support built in. It uses magnets here and there in a gimmicky but not useless way, and it offers all the premiums that one should expect at this price in a well-polished package. It’s not quite perfect, still suffering some from the aggressive racing-style design, but it proves a great chair nonetheless.\"Andaseat Kaiser 4 Gaming ChairUse 10% off code: AndaIGNAndaSeat Kaiser 4 Gaming ChairThe Kaiser 4 is AndaSeat's flagship chair. The price normally starts from $569 but this sale drops it to $476.10 after the IGN code. It's only available in Extra Large with a weight capabity of 395lbs so this is a very spacious chair. You can choose among eight different color options in PVC leather or two different color options in fabric. It has all of the creature comforts you'd expect in a quality gaming chair, like a unibody 2mm tubular steel frame, one-piece high density foam with a plush seat bottom (softer, in my experience, than the very firm Secretlab seat), four-way lumbar adjustment system, 5D armrests, up to 135 degrees of recline and a rocking toggle, included magnetic armrests, and more. This chair sounds a lot like the Titan Evo, and you'd be right; the design, features, and build quality are very similar, minus the price tag.Overall, Mark Knapp didn't like it as much as the Kaiser 3, however. In his Andaseat Kaiser 4 review, he wrote that \"The AndaSeat Kaiser 4 has great lumbar support and one of the best headrest pillows you'll find on the market, but its janky armrests are a major blemish on the overall design, and its firm seat won't be for everyone. If you have the AndaSeat Kaiser 3, everything but the lumbar support may feel like more of a downgrade than an upgrade – and if this is your first gaming chair, you can do much better within the premium market.\"Andaseat X-Air Mesh ChairsUse 10% off code: AndaIGNAndaSeat X-Air Mesh ChairAndaSeat X-Air Pro Mesh ChairIf you don't care for the distinct styling of gaming chairs, Andaseat also recently released a traditional-style task chair model called the X-Air. It's also less expensive, with the standard model starting at only $341.10 after the coupon is applied. This chair features a softer suede-like material that feels more comfortable than traditional mesh chairs. It comes standard with plenty of adjustability, but you can upgrade to the Pro model to get the dynamic lumbar adjustment, 5D armrests, and a 3D headrest. The Pro model also comes in a couple of very unique colors.Another Alternative: SecretlabBoth the Andaseat Kaiser 4 and 3 are excellent gaming chairs that are on par with the quality you'll find from more expensive chair manufacturers. That said, if you're willing to spend substantially more, Secretlab is still our favorite gaming chair brand. Secretlab recently released its flagship Titan Evo chair in a \"Nanogen\" edition and it is, in our opinion, the new best gaming chair. In our Titan Evo Nanogen Edition review, Chris Coke wrote that \"the Secretlab Titan Evo Nanogen Edition deserves every bit of the overwhelming praise I’ve given. Granted, at $799 it’s significantly more expensive than the original and not far off from an entry-level Herman-Miller. But the return it offers in comfortable, supportive gaming is well worth the extra cost thanks to dramatically improved materials in both the fabric and multi-layered padding. The Titan Evo Nanogen Edition is class-leading, and is hands-down the most comfortable gaming chair I’ve ever used.\"Secretlab also released a new recliner add-on to anyone who already owns the Titan Evo chair, and it has turned out to be a very practical addition that's worthy of its lofty $200 price point. In our recliner add-on review, Chris Coke wrote that \"while both comfort and value are subjective things, the recliner is able to take the Titan Evo and transform it from one of the best racing style gaming chairs to standing head and shoulders above the competition at its price point. It’s novel enough that I wouldn’t be surprised to see other brands following suit in the near future. If you don’t mind paying for it, it’s an absolutely killer upgrade for your gaming chair.\"Eric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn't hunting for deals for other people at work, he's hunting for deals for himself during his free time.Originally posted: Jan 13, 2025 10:05 pmIn This Article",
  "image": "https://assets-prd.ignimgs.com/2025/01/13/andaseat-1736805936266.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp data-cy=\"page-header\"\u003e\u003ch2 data-cy=\"article-sub-headline\"\u003eCombine with a 10% IGN coupon code for extra savings\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003e\u003ca href=\"https://zdcs.link/avx1D7?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eAndaSeat\u003c/a\u003e isn\u0026#39;t as big of a name in the congested gaming chair market as some other brands like Secretlab, DXRacer, or Razer, but rest assured it makes some \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/the-best-gaming-chairs\"\u003ehigh-quality gaming chairs\u003c/a\u003e. Right now, there\u0026#39;s an \u003ca href=\"https://zdcs.link/avx1D7?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eAndaSeat New Year Sale\u003c/a\u003e with up to $220 off gaming chairs. These instant discounts stack with our 10% off IGN code \u0026#34;\u003cstrong\u003eAndaIGN\u003c/strong\u003e\u0026#34;.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eAndaseat Kaiser 3 Gaming Chair\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003e\u003cstrong\u003eUse 10% off code: AndaIGN\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003cdiv catalogid=\"9478319e-92a7-4d1a-8423-7139fedb4c4c\" id=\"214095\"\u003e\u003cdiv id=\"214095\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/weKMA?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" title=\"AndaSeat Kaiser 3 Gaming Chair\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"AndaSeat Kaiser 3 Gaming Chair\" src=\"https://assets-prd.ignimgs.com/2025/01/13/andaseatkaiser3-1736805331064.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eAndaSeat Kaiser 3 Gaming Chair\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThe Kaiser 3 offers great value for a high-end gaming chair that competes with other chairs that cost $500 or more. The base model currently costs $386.10, which is about $60 cheaper than the Kaiser 4, and shares most of the same features. You lose out on the 5D armrests and the lumbar is less adjustable, but that\u0026#39;s about it.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eIn his \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/andaseat-kaiser-3-review\"\u003eAndaseat Kaiser 3 review\u003c/a\u003e, Mark Knapp wrote that \u0026#34;The AndaSeat Kaiser 3 makes some meaningful improvements to the series’ design, including a wide seatbase that does away with metal bolsters for hours-long comfort and a flexible lumbar support built in. It uses magnets here and there in a gimmicky but not useless way, and it offers all the premiums that one should expect at this price in a well-polished package. It’s not quite perfect, still suffering some from the aggressive racing-style design, but it proves a great chair nonetheless.\u0026#34;\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eAndaseat Kaiser 4 Gaming Chair\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003e\u003cstrong\u003eUse 10% off code: AndaIGN\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv catalogid=\"9478319e-92a7-4d1a-8423-7139fedb4c4c\" id=\"201695\"\u003e\u003cdiv id=\"201695\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/3dvMP?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" title=\"AndaSeat Kaiser 4 Gaming Chair\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"AndaSeat Kaiser 4 Gaming Chair\" src=\"https://assets-prd.ignimgs.com/2024/06/05/andaseatkaiser4-1717610863528.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eAndaSeat Kaiser 4 Gaming Chair\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThe Kaiser 4 is AndaSeat\u0026#39;s flagship chair. The price normally starts from $569 but this sale drops it to $476.10 after the IGN code. It\u0026#39;s only available in Extra Large with a weight capabity of 395lbs so this is a very spacious chair. You can choose among eight different color options in PVC leather or two different color options in fabric. It has all of the creature comforts you\u0026#39;d expect in a quality gaming chair, like a unibody 2mm tubular steel frame, one-piece high density foam with a plush seat bottom (softer, in my experience, than the very firm Secretlab seat), four-way lumbar adjustment system, 5D armrests, up to 135 degrees of recline and a rocking toggle, included magnetic armrests, and more. This chair sounds a lot like the Titan Evo, and you\u0026#39;d be right; the design, features, and build quality are very similar, minus the price tag.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOverall, Mark Knapp didn\u0026#39;t like it as much as the Kaiser 3, however. In his \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/andaseat-kaiser-4-gaming-chair-review\"\u003eAndaseat Kaiser 4 review\u003c/a\u003e, he wrote that \u0026#34;The AndaSeat Kaiser 4 has great lumbar support and one of the best headrest pillows you\u0026#39;ll find on the market, but its janky armrests are a major blemish on the overall design, and its firm seat won\u0026#39;t be for everyone. If you have the AndaSeat Kaiser 3, everything but the lumbar support may feel like more of a downgrade than an upgrade – and if this is your first gaming chair, you can do much better within the premium market.\u0026#34;\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eAndaseat X-Air Mesh Chairs\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003e\u003cstrong\u003eUse 10% off code: AndaIGN\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"214097\" data-cy=\"productcard-view-trigger\" catalogid=\"9478319e-92a7-4d1a-8423-7139fedb4c4c\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/z7E3JD?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" title=\"AndaSeat X-Air Mesh Chair\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"AndaSeat X-Air Mesh Chair\" src=\"https://assets-prd.ignimgs.com/2025/01/13/andaseatxair-1736805660423.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eAndaSeat X-Air Mesh Chair\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv catalogid=\"9478319e-92a7-4d1a-8423-7139fedb4c4c\" id=\"214096\"\u003e\u003cdiv id=\"214096\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/QKOX1E?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" title=\"AndaSeat X-Air Pro Mesh Chair\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"AndaSeat X-Air Pro Mesh Chair\" src=\"https://assets-prd.ignimgs.com/2025/01/13/andaseatxairpro-1736805547718.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eAndaSeat X-Air Pro Mesh Chair\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eIf you don\u0026#39;t care for the distinct styling of gaming chairs, Andaseat also recently released a traditional-style task chair model called the X-Air. It\u0026#39;s also less expensive, with the standard model starting at only $341.10 after the coupon is applied. This chair features a softer suede-like material that feels more comfortable than traditional mesh chairs. It comes standard with plenty of adjustability, but you can upgrade to the Pro model to get the dynamic lumbar adjustment, 5D armrests, and a 3D headrest. The Pro model also comes in a couple of very unique colors.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eAnother Alternative: Secretlab\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eBoth the Andaseat Kaiser 4 and 3 are excellent gaming chairs that are on par with the quality you\u0026#39;ll find from more expensive chair manufacturers. That said, if you\u0026#39;re willing to spend substantially more, \u003ca href=\"https://zdcs.link/91beVR?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eSecretlab\u003c/a\u003e is still our \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/the-best-gaming-chairs\"\u003efavorite gaming chair brand\u003c/a\u003e. Secretlab recently released its flagship Titan Evo chair in a \u0026#34;\u003ca href=\"https://zdcs.link/aXdnLm?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eNanogen\u003c/a\u003e\u0026#34; edition and it is, in our opinion, the new best gaming chair. In our \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/secretlab-titan-evo-nanogen-edition-review\"\u003eTitan Evo Nanogen Edition review\u003c/a\u003e, Chris Coke wrote that \u0026#34;the Secretlab Titan Evo Nanogen Edition deserves every bit of the overwhelming praise I’ve given. Granted, at $799 it’s significantly more expensive than the original and not far off from an entry-level Herman-Miller. But the return it offers in comfortable, supportive gaming is well worth the extra cost thanks to dramatically improved materials in both the fabric and multi-layered padding. The Titan Evo Nanogen Edition is class-leading, and is hands-down the most comfortable gaming chair I’ve ever used.\u0026#34;\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSecretlab also released a \u003ca href=\"https://zdcs.link/QLnrLm?object_uuid=7660b142-0404-4ebb-a2c5-f92b1337fcd1\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003enew recliner add-on\u003c/a\u003e to anyone who already owns the Titan Evo chair, and it has turned out to be a very practical addition that\u0026#39;s worthy of its lofty $200 price point. In our \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/secretlab-ergonomic-recliner-add-on-review\"\u003erecliner add-on review\u003c/a\u003e, Chris Coke wrote that \u0026#34;while both comfort and value are subjective things, the recliner is able to take the Titan Evo and transform it from one of the best racing style gaming chairs to standing head and shoulders above the competition at its price point. It’s novel enough that I wouldn’t be surprised to see other brands following suit in the near future. If you don’t mind paying for it, it’s an absolutely killer upgrade for your gaming chair.\u0026#34;\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003eEric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn\u0026#39;t hunting for deals for other people at work, he\u0026#39;s hunting for deals for himself during his free time.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv data-cy=\"caption\"\u003e\u003cp\u003eOriginally posted: Jan 13, 2025 10:05 pm\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch3 data-cy=\"object-summary-embed-title\"\u003eIn This Article\u003c/h3\u003e\u003cdiv data-cy=\"objectcard-view-trigger\"\u003e\u003ca href=\"https://www.ign.com/tech/andaseat-gaming-chair\"\u003e\u003cdiv data-cy=\"object-thumbnail\"\u003e\u003cfigure\u003e\u003cimg decoding=\"async\" alt=\"AndaSeat Gaming Chair\" src=\"https://assets-prd.ignimgs.com/2021/05/26/andaseat-gaming-chair-1622014996182.jpg?width=114\u0026amp;auto=webp\" srcset=\"https://assets-prd.ignimgs.com/2021/05/26/andaseat-gaming-chair-1622014996182.jpg?width=114\u0026amp;auto=webp 1x, https://assets-prd.ignimgs.com/2021/05/26/andaseat-gaming-chair-1622014996182.jpg?width=114\u0026amp;auto=webp\u0026amp;dpr=2 2x\" data-cy=\"progressive-image\"/\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-13T22:05:00Z",
  "modifiedTime": "2025-01-13T22:42:07.139Z"
}
