{
  "id": "2037ef6a-8323-437b-8aaf-742697f1eacc",
  "title": "Life Lately: Candy Yum Yum | Breakfast Cheese and Fruit | Lipstick Challenge for Next Week?",
  "link": "https://makeupandbeautyblog.com/just-for-fun/life-lately-candy-yum-yum-breakfast-cheese-and-fruit-lipstick-challenge-for-next-week/",
  "description": "Hey, hey Saturday! I’m still around, and I’m still alive, and I’m still wearing Candy Yum Yum lipstick by MAC! I found it last week while I was rooting around inside a makeup drawer and decided that even though it’s fall, hot pink is still wildly appropriate for the season, ha ha ha! I’m just realizing right now that I’ve yet to wear any dark, rich and cozy wine, burgundy, brown, garnet or red fall lip colors, hmm. In fact, my lipstick game has been pretty MIA for a while now. Still, I gotta give props to myself and to all the makeup lovers out there who are doing a decent job filling in brows, curling lashes and basically doing the bare minimum to look somewhat undead. LOL! It’s funny to me that I haven’t really been wearing anything on my lips because lipstick and gloss are usually my favorite part of the makeup process. Lately, I’ll paint on some base and blush and whatever else I have time for in the mornings, and by[Continue reading...] The post Life Lately: Candy Yum Yum | Breakfast Cheese and Fruit | Lipstick Challenge for Next Week? appeared first on Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup.",
  "author": "Karen",
  "published": "Sat, 12 Oct 2024 17:49:22 +0000",
  "source": "https://www.makeupandbeautyblog.com/feed/",
  "categories": [
    "Just For Fun"
  ],
  "byline": "Karen",
  "length": 3069,
  "excerpt": "Hey, hey Saturday! I'm still around, and I'm still alive, and I'm still wearing Candy Yum Yum lipstick by MAC! I found it last week while I was rooting",
  "siteName": "Makeup and Beauty Blog | Makeup Reviews, Swatches and How-To Makeup",
  "favicon": "https://www.makeupandbeautyblog.com/wp-content/uploads/2013/08/favicon.png",
  "text": "Hey, hey Saturday! I’m still around, and I’m still alive, and I’m still wearing Candy Yum Yum lipstick by MAC! I found it last week while I was rooting around inside a makeup drawer and decided that even though it’s fall, hot pink is still wildly appropriate for the season, ha ha ha! I’m just realizing right now that I’ve yet to wear any dark, rich and cozy wine, burgundy, brown, garnet or red fall lip colors, hmm. In fact, my lipstick game has been pretty MIA for a while now. Still, I gotta give props to myself and to all the makeup lovers out there who are doing a decent job filling in brows, curling lashes and basically doing the bare minimum to look somewhat undead. LOL! It’s funny to me that I haven’t really been wearing anything on my lips because lipstick and gloss are usually my favorite part of the makeup process. Lately, I’ll paint on some base and blush and whatever else I have time for in the mornings, and by that time I realize I need to leave or I’ll be late, so, I just assume that I’ll put on my lip color at work after I have some tea. But is that happening? NOPE! Maybe I should do a short week-long challenge to wear a lip color every day next Monday through Friday to work. Who’s with me? Speaking of work, here is my forever challenge: I get back home after picking Connor up from school, and then I start doing chores and prep for the next day, and then the last thing I want to do is make dinner because I’m starving. I ran into an acquaintance recently who’s also a working mom; she works in the food industry and knows lots of good tips and tricks for making meals and whatnot. Anywho, she told me she experiences this same sort of hanger (aka hungry anger), too, and the way she gets through it is to snack on a little fruit and cheese while she prepares dinner. I started doing this, and WOW! Amazing how a little snack can be so life changing. Last week I snacked on a bit of Breakfast Cheese by Marin French Cheese (I get it at Trader Joe’s) with apple slices or grapes while I made dinner. I felt like a human being again. This is a little random, but while we’re on the subject of fruit, I’ve found the best way to get my people to eat ALL the fruit in the house. When I get home from the grocery store, before I put the fruit away, I wash, dry and prep all the fruit, stash it all into clear containers, and then chuck them into the fridge so it’s available to eat right away. I’ve noticed that when I do this, every single last bit of fruit gets eaten and none of it is ever wasted. Try it sometime! Last but certainly not least, how is life on your end of the keyboard? I hope that you’re happy and healthy and that work has been treating you kindly. I’m off to take Connor to a dance performance, the first one of the year. Her dance team is dancing to “Grease Lightning” at a local street fair celebrating classic cars and nostalgia for ye olde days of yore, which I’m realizing now, are like, the ’90s and early 2000s. Ha! How are you spending your Saturday? Your friendly neighborhood beauty addict, Karen",
  "image": "https://makeupandbeautyblog.com/wp-content/uploads/2024/10/mac-candy-yum-yum-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle aria-label=\"Life Lately: Candy Yum Yum | Breakfast Cheese and Fruit | Lipstick Challenge for Next Week?\"\u003e\n  \u003cdiv\u003e\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/mac-candy-yum-yum-2024.jpg\" alt=\"\" width=\"1000\" height=\"1333\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/mac-candy-yum-yum-2024.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/mac-candy-yum-yum-2024-610x813.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/mac-candy-yum-yum-2024-768x1024.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/p\u003e\n\u003cp\u003eHey, hey Saturday! I’m still around, and I’m still alive, and I’m still wearing Candy Yum Yum lipstick by MAC! I found it last week while I was rooting around inside a makeup drawer and decided that even though it’s fall, hot pink is still wildly appropriate for the season, ha ha ha!\u003c/p\u003e\n\u003cp\u003eI’m just realizing right now that I’ve yet to wear any dark, rich and cozy wine, burgundy, brown, garnet or red fall lip colors, hmm. In fact, my lipstick game has been pretty MIA for a while now. \u003c/p\u003e\n\u003cp\u003eStill, I  gotta give props to myself and to all the makeup lovers out there who are doing a decent job filling in brows, curling lashes and basically doing the bare minimum to look somewhat undead. LOL!\u003c/p\u003e\n\u003cp\u003eIt’s funny to me that I haven’t really been wearing anything on my lips because lipstick and gloss are usually my favorite part of the makeup process. \u003c/p\u003e\n\u003cp\u003eLately, I’ll paint on some base and blush and whatever else I have time for in the mornings, and by that time I realize I need to leave or I’ll be late, so, I just assume that I’ll put on my lip color at work after I have some tea. \u003c/p\u003e\n\u003cp\u003eBut is that happening? NOPE! Maybe I should do a short week-long challenge to wear a lip color every day next Monday through Friday to work. Who’s with me? \u003c/p\u003e\n\u003cp\u003eSpeaking of work, here is my forever challenge: I get back home after picking Connor up from school, and then I start doing chores and prep for the next day, and then the last thing I want to do is make dinner because I’m starving. \u003c/p\u003e\n\u003cp\u003eI ran into an acquaintance recently who’s also a working mom; she works in the food industry and knows lots of good tips and tricks for making meals and whatnot. Anywho, she told me she experiences this same sort of hanger (aka hungry anger), too, and the way she gets through it is to snack on a little fruit and cheese while she prepares dinner. \u003c/p\u003e\n\u003cp\u003eI started doing this, and WOW! Amazing how a little snack can be so life changing. \u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-and-cheese-yum.jpg\" alt=\"\" width=\"1000\" height=\"1333\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-and-cheese-yum.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-and-cheese-yum-610x813.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-and-cheese-yum-768x1024.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/p\u003e\n\u003cp\u003eLast week I snacked on a bit of Breakfast Cheese by Marin French Cheese (I get it at Trader Joe’s) with apple slices or grapes while I made dinner. I felt like a human being again.\u003c/p\u003e\n\u003cp\u003eThis is a little random, but while we’re on the subject of fruit, I’ve found the best way to get my people to eat ALL the fruit in the house. \u003c/p\u003e\n\u003cp\u003eWhen I get home from the grocery store, before I put the fruit away, I wash, dry and prep all the fruit, stash it all into clear containers, and then chuck them into the fridge so it’s available to eat right away.\u003cbr/\u003e\nI’ve noticed that when I do this, every single last bit of fruit gets eaten and none of it is ever wasted. Try it sometime! \u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-blueberries-yummy-fruit.jpg\" alt=\"\" width=\"1000\" height=\"1333\" srcset=\"https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-blueberries-yummy-fruit.jpg 1000w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-blueberries-yummy-fruit-610x813.jpg 610w, https://makeupandbeautyblog.com/wp-content/uploads/2024/10/grapes-blueberries-yummy-fruit-768x1024.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\"/\u003e\u003c/p\u003e\n\u003cp\u003eLast but certainly not least, how is life on your end of the keyboard? I hope that you’re happy and healthy and that work has been treating you kindly.\u003c/p\u003e\n\u003cp\u003eI’m off to take Connor to a dance performance, the first one of the year. Her dance team is dancing to “Grease Lightning” at a local street fair celebrating classic cars and nostalgia for ye olde days of yore, which I’m realizing now, are like, the ’90s and early 2000s. Ha!\u003c/p\u003e\n\u003cp\u003eHow are you spending your Saturday?\u003c/p\u003e\n\u003cp\u003eYour friendly neighborhood beauty addict,\u003c/p\u003e\n\u003cp\u003eKaren\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-12T17:49:22Z",
  "modifiedTime": "2024-10-12T17:52:24Z"
}
