{
  "id": "245f5ef9-3e99-4b76-b089-930bdb307850",
  "title": "Ra Ra Boom Celebrates Couch Co-Op with Some New Twists",
  "link": "https://news.xbox.com/en-us/2025/04/30/ra-ra-boom-couch-co-op-with-new-twists/",
  "description": "Ra Ra Boom is coming to Xbox Series X|S and Xbox One this summer, as part of what we consider the summer of beat ‘em ups. As beat ‘em up fans, we can’t wait to play some of the great titles that will make this probably the biggest year for beat ‘em ups since Castle […] The post Ra Ra Boom Celebrates Couch Co-Op with Some New Twists appeared first on Xbox Wire.",
  "author": "johns",
  "published": "Wed, 30 Apr 2025 17:30:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "ID@Xbox",
    "gylee",
    "ra ra boom"
  ],
  "byline": "johns",
  "length": 4762,
  "excerpt": "A look at the unique mechanics and voice acting of Ra Ra Boom ahead of the game launch targeting summer, 2025.",
  "siteName": "Xbox Wire",
  "favicon": "https://xboxwire.thesourcemediaassets.com/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "SummaryRa Ra Boom comes to Xbox Series X|S, Xbox One, and PC this summer.Stop the threat of the rogue AI as one of four ninja space cheerleaders in a fully voiced story.Fun new twist on classic couch co-op, including shoot ‘em up mechanics. Ra Ra Boom is coming to Xbox Series X|S and Xbox One this summer, as part of what we consider the summer of beat ‘em ups. As beat ‘em up fans, we can’t wait to play some of the great titles that will make this probably the biggest year for beat ‘em ups since Castle Crashers launched forever ago. If you’re a fan of beat ‘em ups, you’re in for a great summer. And we hope you consider adding Ra Ra Boom to your list of must plays. In Ra Ra Boom, you and up to three friends play as one of four ninja space cheerleaders. There’s Aris (the leader), Ren (the blade), Vee (the shield), and Saida (the cyborg). Zoi, an AI gone rogue, has overtaken earth and our four heroines are the only ones who can stop it. Beat ‘em Up/Shoot ‘em Up Mash Up As the saying goes, you don’t bring pom poms to a boss fight. So, we had to ensure our heroines were armed for the AI menace they were facing. Where most beat ‘em ups focus on melee with limited-use ranged options, we did things a little different. Ra Ra Boom can be played as a pure beat ‘em up. Each character has their own melee attack and you can be effective with them. Or you can play it as a pure shoot ‘em up, because you also have an effective ranged attack with unlimited ammo. But it’s best to mix the two, getting into your flow and finding the attack combos that suit the moment. We think that after you play Ra Ra Boom, with its speed and fluid mix of melee and ranged combat, it will be hard to go back to the standard we’ve all gotten used to. Play the Lanes Most beat ‘em ups you’ll play today are in 2.5D, meaning that you don’t just move your character left and right, but also can move up and down on a flat plane. This adds more freedom to dodge and position yourself. The challenge we’ve found from past games is that it’s often hard to tell if you’re lined up right with an enemy. If you’ve ever thought, “Why did that hit me?” you’re not alone. In Ra Ra Boom, we’ve color-coded the lanes and designed the levels to make use of these clear indicators. It was harder than you might imagine for us to implement, but it makes a big difference in your effectiveness while giving enemies a beat down. Fully Voiced Story Hearing characters helps make them come to life. Whether that’s in the 2D cinematics you watch between levels, or the many quips heard while playing, you’ll get to know the personalities and quirks of our heroines. We wanted to provide a meaningful story for players about four individuals thrust into an impossible situation. It’s a coming-of-age tale amidst an AI apocalypse and it was important that each hero had their own moments, so you could get to know and care about them. But When Can You Get It? Good question. Ra Ra Boom is coming this summer. We’re not ready to announce the official release date just yet, But you can wishlist Ra Ra Boom today to be the first to hear the latest updates. Gear up for 4-player co-op action with a modern twist! Ra Ra BOOM rockets you to a future Earth overrun by rogue AI. Battle waves of enemies and upgrade your ninja cheerleader’s skills as you beat ‘em up, shoot ‘em up, and smash through the chaos! Even ninja space cheerleaders know you don’t bring a pom-pom to a boss fight. Whether you’re cracking skulls with close combat or blasting bots from across the screen, Ra Ra BOOM has your back. Play it like a classic side-scroller, treat it like a shooter, or mix it up for combos so smooth, even evil AI can’t keep up. The only wrong way to fight is not bringing your A-game—because these overlords don’t mess around. HOMEWORK CAN WAIT Who needs perfect grades when rogue AI is trashing Earth? The planet’s in pieces, robots are running wild, and only four ninja space cheerleaders have the moves to save it. Silly when it can be, heartfelt when it needs to be, Ra Ra BOOM delivers a beat ‘em up with a story that hits harder than your math final. PLAY THE LANES Why settle for chaos when you can dominate with precision? Ra Ra BOOM’s combat lanes make every fight smarter and slicker. Dodge fire like a pro, pick your targets with ninja-like accuracy, and decide where to strike for maximum impact. BECOME THE ULTIMATE NINJA CHEERLEADER Aris, Saida, Ren, and Vee are more than just pompoms and sass—they’ve got branching skill trees that let you mold them into your perfect hero. Customize your squad to fit your playstyle, because the fate of the world—and your team’s vibe—is in your hands. NBD.",
  "image": "https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_wire_hero-f8dc55f2f80ae3db1e87.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \n\u003cdiv\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cul\u003e\u003cli\u003e\u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/ra-ra-boom/9PLJHRNXP2ZH\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRa Ra Boom\u003c/a\u003e\u003c/em\u003e comes to Xbox Series X|S, Xbox One, and PC this summer.\u003c/li\u003e\u003cli\u003eStop the threat of the rogue AI as one of four ninja space cheerleaders in a fully voiced story.\u003c/li\u003e\u003cli\u003eFun new twist on classic couch co-op, including shoot ‘em up mechanics.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eRa Ra Boom\u003c/em\u003e is coming to Xbox Series X|S and Xbox One this summer, as part of what we consider the summer of beat ‘em ups. As beat ‘em up fans, we can’t wait to play some of the great titles that will make this probably the biggest year for beat ‘em ups since Castle Crashers launched forever ago.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you’re a fan of beat ‘em ups, you’re in for a great summer. And we hope you consider adding \u003cem\u003eRa Ra Boom\u003c/em\u003e to your list of must plays.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_01-1fe3abe48b9d2524043e.jpg\" alt=\"Ra Ra Boom screenshot\" srcset=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_01-1fe3abe48b9d2524043e.jpg 1920w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_01-1fe3abe48b9d2524043e-768x432.jpg 768w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_01-1fe3abe48b9d2524043e-1024x576.jpg 1024w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_01-1fe3abe48b9d2524043e-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn \u003cem\u003eRa Ra Boom\u003c/em\u003e, you and up to three friends play as one of four ninja space cheerleaders. There’s Aris (the leader), Ren (the blade), Vee (the shield), and Saida (the cyborg). Zoi, an AI gone rogue, has overtaken earth and our four heroines are the only ones who can stop it.\u003c/p\u003e\n\n\n\n\u003ch2\u003eBeat ‘em Up/Shoot ‘em Up Mash Up\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs the saying goes, you don’t bring pom poms to a boss fight. So, we had to ensure our heroines were armed for the AI menace they were facing. Where most beat ‘em ups focus on melee with limited-use ranged options, we did things a little different.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_02-14d12299b37561d2261a.jpg\" alt=\"Ra Ra Boom screenshot\" srcset=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_02-14d12299b37561d2261a.jpg 1920w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_02-14d12299b37561d2261a-768x432.jpg 768w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_02-14d12299b37561d2261a-1024x576.jpg 1024w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_02-14d12299b37561d2261a-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eRa Ra Boom\u003c/em\u003e can be played as a pure beat ‘em up. Each character has their own melee attack and you can be effective with them. Or you can play it as a pure shoot ‘em up, because you also have an effective ranged attack with unlimited ammo. But it’s best to mix the two, getting into your flow and finding the attack combos that suit the moment.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe think that after you play \u003cem\u003eRa Ra Boom\u003c/em\u003e, with its speed and fluid mix of melee and ranged combat, it will be hard to go back to the standard we’ve all gotten used to.\u003c/p\u003e\n\n\n\n\u003ch2\u003ePlay the Lanes\u003c/h2\u003e\n\n\n\n\u003cp\u003eMost beat ‘em ups you’ll play today are in 2.5D, meaning that you don’t just move your character left and right, but also can move up and down on a flat plane. This adds more freedom to dodge and position yourself. The challenge we’ve found from past games is that it’s often hard to tell if you’re lined up right with an enemy. If you’ve ever thought, “Why did that hit me?” you’re not alone.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_03-ee6a0f1908b42bc367a4.jpg\" alt=\"Ra Ra Boom screenshot\" srcset=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_03-ee6a0f1908b42bc367a4.jpg 1920w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_03-ee6a0f1908b42bc367a4-768x432.jpg 768w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_03-ee6a0f1908b42bc367a4-1024x576.jpg 1024w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_03-ee6a0f1908b42bc367a4-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn \u003cem\u003eRa Ra Boom\u003c/em\u003e, we’ve color-coded the lanes and designed the levels to make use of these clear indicators. It was harder than you might imagine for us to implement, but it makes a big difference in your effectiveness while giving enemies a beat down.\u003c/p\u003e\n\n\n\n\u003ch2\u003eFully Voiced Story\u003c/h2\u003e\n\n\n\n\u003cp\u003eHearing characters helps make them come to life. Whether that’s in the 2D cinematics you watch between levels, or the many quips heard while playing, you’ll get to know the personalities and quirks of our heroines.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_04-e3a7676cc5ec882333b8.jpg\" alt=\"Ra Ra Boom screenshot\" srcset=\"https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_04-e3a7676cc5ec882333b8.jpg 1920w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_04-e3a7676cc5ec882333b8-768x432.jpg 768w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_04-e3a7676cc5ec882333b8-1024x576.jpg 1024w, https://xboxwire.thesourcemediaassets.com/sites/2/2025/04/raraBOOM_xboxwire_04-e3a7676cc5ec882333b8-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWe wanted to provide a meaningful story for players about four individuals thrust into an impossible situation. It’s a coming-of-age tale amidst an AI apocalypse and it was important that each hero had their own moments, so you could get to know and care about them.\u003c/p\u003e\n\n\n\n\u003ch2\u003eBut When Can You Get It?\u003c/h2\u003e\n\n\n\n\u003cp\u003eGood question. \u003cem\u003eRa Ra Boom\u003c/em\u003e is coming this summer. We’re not ready to announce the official release date just yet, But you can wishlist \u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/ra-ra-boom/9PLJHRNXP2ZH\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRa Ra Boom\u003c/a\u003e\u003c/em\u003e today to be the first to hear the latest updates.\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9PLJHRNXP2ZH\" id=\"msp1745983167159\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9PLJHRNXP2ZH\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.9727.14312584493173682.8b81a63b-d94d-4204-aa60-120cdd212233.60ec14aa-b184-42bd-a151-717856444fcc?w=400\u0026amp;h=600\" alt=\"Ra Ra BOOM\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tGear up for 4-player co-op action with a modern twist! Ra Ra BOOM rockets you to a future Earth overrun by rogue AI. Battle waves of enemies and upgrade your ninja cheerleader’s skills as you beat ‘em up, shoot ‘em up, and smash through the chaos!\n\nEven ninja space cheerleaders know you don’t bring a pom-pom to a boss fight. Whether you’re cracking skulls with close combat or blasting bots from across the screen, Ra Ra BOOM has your back. Play it like a classic side-scroller, treat it like a shooter, or mix it up for combos so smooth, even evil AI can’t keep up. The only wrong way to fight is not bringing your A-game—because these overlords don’t mess around.\n\nHOMEWORK CAN WAIT\nWho needs perfect grades when rogue AI is trashing Earth? The planet’s in pieces, robots are running wild, and only four ninja space cheerleaders have the moves to save it. Silly when it can be, heartfelt when it needs to be, Ra Ra BOOM delivers a beat ‘em up with a story that hits harder than your math final.\n\nPLAY THE LANES\nWhy settle for chaos when you can dominate with precision? Ra Ra BOOM’s combat lanes make every fight smarter and slicker. Dodge fire like a pro, pick your targets with ninja-like accuracy, and decide where to strike for maximum impact.\n\nBECOME THE ULTIMATE NINJA CHEERLEADER\nAris, Saida, Ren, and Vee are more than just pompoms and sass—they’ve got branching skill trees that let you mold them into your perfect hero. Customize your squad to fit your playstyle, because the fate of the world—and your team’s vibe—is in your hands. NBD.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n                \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-04-30T17:30:00Z",
  "modifiedTime": "2025-04-30T03:26:53Z"
}
