{
  "id": "2cb761c6-14c7-4915-bb65-12c1dbd99980",
  "title": "Ghost of Yōtei's gorgeous gameplay deep dive reveals refined combat, lo-fi beats mode, and more",
  "link": "https://www.eurogamer.net/ghost-of-yoteis-gorgeous-gameplay-deep-dive-reveals-refined-combat-lo-fi-beats-mode-and-more",
  "description": "Ghost of Tsushima's gorgeous PlayStation 5 sequel Ghost of Yōtei is inching ever-closer to release, and ahead of its October arrival, developer Sucker Punch has shared its best look yet at what the revenge-soaked open-world action-adventure will bring - including, it turns out, a lo-fi beats mode for a more soothing saunter through Ezo. Read more",
  "author": "Matt Wales",
  "published": "Thu, 10 Jul 2025 22:39:29 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Ghost of Yōtei",
    "PS5",
    "Sucker Punch Productions",
    "Action Adventure",
    "Third person"
  ],
  "byline": "Matt Wales",
  "length": 5221,
  "excerpt": "Ghost of Tsushima's gorgeous PlayStation 5 sequel Ghost of Yōtei is inching ever-closer to release, and ahead of its Oc…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/733340927610ebb59d6c25459de7f424/icon/apple-touch-icon-152x152.png",
  "text": "Ahead of October's release. Image credit: Sucker Punch/Sony Ghost of Tsushima's gorgeous PlayStation 5 sequel Ghost of Yōtei is inching ever-closer to release, and ahead of its October arrival, developer Sucker Punch has shared its best look yet at what the revenge-soaked open-world action-adventure will bring - including, it turns out, a lo-fi beats mode for a more soothing saunter through Ezo. Ghost of Yōtei, of course, features a brand-new protagonist in Atsu, a \"lone wolf mercenary\" so single-minded in her mission to punish the Yōtei Six - the ruthless gang who slaughtered her family - she's believed to an Onryō (a Japanese spirit of vengeance) by the local people. Atsu returns to Ezo after 16 years in the south as Sucker Punch's deep dive begins, travelling back to her childhood home in order to put the spirits of her family to rest. Here, she can revisit the \"cherished times\" of her youth, switching between the past and present at the push of a button, before venturing out across the stunning world in her relentless quest for blood. And with each victory Atsu secures against the Yōtei Six, the more her renown grows, increasing the bounty on her head and leading to encounters with deadlier foes. But Atsu can also take on bounties of her own in order to make money and fuel her quest. Which brings us nicely onto Ghost of Yōtei's expanded combat. Atsu can wield a katana, spear, kusarigama, odachi, or dual swords (and can switch between them on the fly) with each being uniquely effective against particular enemies. The odachi, for instance, is best used against massive enemies, and when opponents switch weapons, players will need to do the same in order to adapt - unleashing their dual swords, say, to better counter spears. All weapons feature their own upgrades to discover and master, and Atsu has access to ranged abilities too, including throwing weapons such as bombs and blinding powder. As to how players can find themselves in these sorts of sticky situations, Sucker Punch says Ghost of Yōtei is more focused on player freedom than any of its other games, and there's a clue system - based on interrogating enemies and collecting new mission cards - that can take players everywhere from snow-covered heights to a landscape scarred by fire. But there's seemingly ample space for players to simply grab their spyglass, pick a point of interest, and forge their own path across Ezo, taking in its golden fields, shimmering lakes, swaying trees, and endless valleys of fallings leaves and rising mist. Ghost of Yōtei - State of Play Gameplay Deep Dive | PS5 Games Ghost of Yōtei - gameplay deep dive. Watch on YouTube Players might, for instance, stumble across Altars of Reflection. These provide Atsu with fresh inspiration and unlock new abilities - such as Perfect Parry and Disarm Counter - that'll help her on the journey ahead. Alternatively, players can buy travellers maps from a cartographer if they'd prefer to focus on forward momentum rather than languid exploration. Either way, they've the option to set up camp under the stars throughout their adventure, resting up, play shamisen, cooking, and preparing for the fight ahead. Camping also brings important characters and upgrades straight to players, replacing Ghost of Tsushima's journal with a system said to provide a \"more character-driven way of managing allies and vendors\", so you \"don't have to leave where you're exploring, [because] the game comes to you\". Elsewhere in Sucker Punch's deep dive, there was talk about customisation and finding the right combination of armour, charms, and gear that works for different play-styles, be that the stealthy approach or a more melee-focused one. And of course armour and weapon appearances can be customised too, meaning you'll be able to look your best as you crank out Ghost of Yōtei's returning photo mode. That's not the only returning feature, however; it's once again possible to select a Japanese voice track with full lip sync and subtitles from the beginning, if you want a more authentic representation of the samurai movies Sucker Punch's series is inspired by. And you can go even further with the returning Kurasowa mode, which emulates the legendary film director's movies with a distinctive black and white palette, film grain, audio filters, and increased wind. Kurasowa isn't the only Japanese movie director being represented this time though. There's a new mode taking its cue from Ichi the Killer and Audition director Takashi Miike that puts the camera closer during combat for a \"more intense, raw experience\" that also features increased mud and blood splatter. Alternatively, you can opt for the mode created in conjunction with Cowboy Bebop director Shinichirō Watanabe. This is where the lo-fi beats come in, switching out Ghost of Tsushima's usual music in favour of more relaxed tunes created by Watanabe that play during exploration and combat. And that's pretty much all we're getting for now. Ghost of Yōtei launches for PS5 on 2nd October, and it'll arrive alongside a newly announced limited edition console and controller.",
  "image": "https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eAhead of October\u0026#39;s release.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Ghost of Yōtei trailer image showing protagonist Atsu unsheathing her sword as she stands amid a parched landscape.\" data-src-full=\"https://assetsio.gnwcdn.com/ghost-of-yotei-trailer-crop.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eSucker Punch/Sony\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\n\u003ca href=\"https://www.eurogamer.net/games/ghost-of-tsushima\"\u003eGhost of Tsushima\u003c/a\u003e\u0026#39;s gorgeous PlayStation 5 sequel \u003ca href=\"https://www.eurogamer.net/games/ghost-of-yotei\"\u003eGhost of Yōtei\u003c/a\u003e is inching ever-closer to release, and ahead of its October arrival, developer Sucker Punch has \u003ca href=\"https://www.youtube.com/watch?v=cgM6poO2JmY\"\u003eshared its best look yet\u003c/a\u003e at what the revenge-soaked open-world action-adventure will bring - including, it turns out, a lo-fi beats mode for a more soothing saunter through Ezo.\n\u003c/p\u003e\n\u003cp\u003e\nGhost of Yōtei, of course, features a brand-new protagonist in Atsu, a \u0026#34;lone wolf mercenary\u0026#34; so single-minded in her mission to punish the Yōtei Six - the ruthless gang who slaughtered her family - she\u0026#39;s believed to an Onryō (a Japanese spirit of vengeance) by the local people.\n\u003c/p\u003e\n\u003cp\u003e\nAtsu returns to Ezo after 16 years in the south as Sucker Punch\u0026#39;s deep dive begins, travelling back to her childhood home in order to put the spirits of her family to rest. Here, she can revisit the \u0026#34;cherished times\u0026#34; of her youth, switching between the past and present at the push of a button, before venturing out across the stunning world in her relentless quest for blood.\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\nAnd with each victory Atsu secures against the Yōtei Six, the more her renown grows, increasing the bounty on her head and leading to encounters with deadlier foes. But Atsu can also take on bounties of her own in order to make money and fuel her quest. Which brings us nicely onto Ghost of Yōtei\u0026#39;s expanded combat.\n\u003c/p\u003e\n\u003cp\u003e\nAtsu can wield a katana, spear, kusarigama, odachi, or dual swords (and can switch between them on the fly) with each being uniquely effective against particular enemies. The odachi, for instance, is best used against massive enemies, and when opponents switch weapons, players will need to do the same in order to adapt - unleashing their dual swords, say, to better counter spears. All weapons feature their own upgrades to discover and master, and Atsu has access to ranged abilities too, including throwing weapons such as bombs and blinding powder.\n\u003c/p\u003e\n\u003cp\u003e\nAs to how players can find themselves in these sorts of sticky situations, Sucker Punch says Ghost of Yōtei is more focused on player freedom than any of its other games, and there\u0026#39;s a clue system - based on interrogating enemies and collecting new mission cards - that can take players everywhere from snow-covered heights to a landscape scarred by fire. But there\u0026#39;s seemingly ample space for players to simply grab their spyglass, pick a point of interest, and forge their own path across Ezo, taking in its golden fields, shimmering lakes, swaying trees, and endless valleys of fallings leaves and rising mist.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Ghost of Yōtei - State of Play Gameplay Deep Dive | PS5 Games\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/cgM6poO2JmY?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/cgM6poO2JmY/hqdefault.jpg\"/\u003e\u003cspan\u003eGhost of Yōtei - State of Play Gameplay Deep Dive | PS5 Games\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/cgM6poO2JmY?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/cgM6poO2JmY?autoplay=1\" title=\"Ghost of Yōtei - State of Play Gameplay Deep Dive | PS5 Games\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eGhost of Yōtei - gameplay deep dive. \u003ca href=\"https://www.youtube.com/watch?v=cgM6poO2JmY\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\nPlayers might, for instance, stumble across Altars of Reflection. These provide Atsu with fresh inspiration and unlock new abilities - such as Perfect Parry and Disarm Counter - that\u0026#39;ll help her on the journey ahead. Alternatively, players can buy travellers maps from a cartographer if they\u0026#39;d prefer to focus on forward momentum rather than languid exploration. Either way, they\u0026#39;ve the option to set up camp under the stars throughout their adventure, resting up, play shamisen, cooking, and preparing for the fight ahead. Camping also brings important characters and upgrades straight to players, replacing Ghost of Tsushima\u0026#39;s journal with a system said to provide a \u0026#34;more character-driven way of managing allies and vendors\u0026#34;, so you \u0026#34;don\u0026#39;t have to leave where you\u0026#39;re exploring, [because] the game comes to you\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\nElsewhere in Sucker Punch\u0026#39;s deep dive, there was talk about customisation and finding the right combination of armour, charms, and gear that works for different play-styles, be that the stealthy approach or a more melee-focused one. And of course armour and weapon appearances can be customised too, meaning you\u0026#39;ll be able to look your best as you crank out Ghost of Yōtei\u0026#39;s returning photo mode.\n\u003c/p\u003e\n\u003cp\u003e\nThat\u0026#39;s not the only returning feature, however; it\u0026#39;s once again possible to select a Japanese voice track with full lip sync and subtitles from the beginning, if you want a more authentic representation of the samurai movies Sucker Punch\u0026#39;s series is inspired by. And you can go even further with the returning Kurasowa mode, which emulates the legendary film director\u0026#39;s movies with a distinctive black and white palette, film grain, audio filters, and increased wind.\n\u003c/p\u003e\n\u003cp\u003e\nKurasowa isn\u0026#39;t the only Japanese movie director being represented this time though. There\u0026#39;s a new mode taking its cue from Ichi the Killer and Audition director Takashi Miike that puts the camera closer during combat for a \u0026#34;more intense, raw experience\u0026#34; that also features increased mud and blood splatter. Alternatively, you can opt for the mode created in conjunction with Cowboy Bebop director Shinichirō Watanabe. This is where the lo-fi beats come in, switching out Ghost of Tsushima\u0026#39;s usual music in favour of more relaxed tunes created by Watanabe that play during exploration and combat.\n\u003c/p\u003e\n\u003cp\u003e\nAnd that\u0026#39;s pretty much all we\u0026#39;re getting for now. Ghost of Yōtei launches for PS5 on 2nd October, and it\u0026#39;ll arrive alongside a \u003ca href=\"https://www.eurogamer.net/two-limited-edition-ghost-of-yotei-ps5-bundles-with-designs-rooted-in-traditional-japanese-art-announced\"\u003enewly announced limited edition console and controller\u003c/a\u003e.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-10T22:39:29.456721Z",
  "modifiedTime": null
}
