{
  "id": "2da680a5-6804-4ee9-b62f-36d5aa48e0bb",
  "title": "Introducing Call of Duty: Mobile Season 2 — Digital Dawn",
  "link": "https://www.callofduty.com/blog/2025/02/call-of-duty-mobile-season-two-digital-dawn-maps-events-battle-pass-announcement#new_tab",
  "description": "The post Introducing Call of Duty: Mobile Season 2 — Digital Dawn appeared first on Xbox Wire.",
  "author": "Mike Nelson, Xbox Wire Editor",
  "published": "Thu, 13 Feb 2025 19:00:15 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "Call of Duty: Mobile"
  ],
  "byline": "February 12, 2025 by Call of Duty Staff",
  "length": 8548,
  "excerpt": "The future is now as Season 2 arrives, bringing a fully remastered version of the Raid Multiplayer map alongside the new VLK Rogue Shotgun, Flash Strike Tactical, an offroad reskin for the RC-XD, and plentiful rewards earned through the high-tech Battle Pass, Engagement Shop, and more.",
  "siteName": "",
  "favicon": "https://www.activision.com/content/dam/atvi/global/apple-touch-icon.png",
  "text": "The future is now as Season 2 arrives, bringing a fully remastered version of the Raid Multiplayer map alongside the new VLK Rogue Shotgun, Flash Strike Tactical, an offroad reskin for the RC-XD, and plentiful rewards earned through the high-tech Battle Pass, Engagement Shop, and more. The Digital Future Arrives in Season 2! Jack in and prepare for future warfare as Season 2 — Digital Dawn arrives for Call of Duty®: Mobile. Deploy to an upgraded and remastered version of the Raid Multiplayer map and participate in new themed events including a special Shiba Feichai crossover event featuring a dynamic Weapon Camo and other rewards. An epic Battle Pass brings new Loadout items like the VLK Rogue Shotgun and the Flash Strike Tactical. In the Challenge Pass, unlock an offroad-themed RC-XD that’ll chase down your foes over even the roughest terrain. Season 2 — Digital Dawn launches on February 19 at 4 PM PT. Multiplayer: Raid Remastered Following the remaster of Standoff completed last year, the team have now set their sights on Raid, one of the original launch maps available when Call of Duty: Mobile first released five years ago. The sprawling luxury complex will receive a full touch up inside and out including improved textures and foliage, new paint, new water effects, and many other graphical enhancements. New Themed Events Shiba Feichai Following the remaster of Standoff completed last year, the team have now set their sights on Raid, one of the original launch maps available when Call of Duty: Mobile first released five years ago. The sprawling luxury complex will receive a full touch up inside and out including improved textures and foliage, new paint, new water effects, and many other graphical enhancements. Ramadan Starting on February 28, several events will launch in-game to help celebrate Ramadan with login rewards, challenges, and an exchange shop. Throughout the celebration earn rewards like more chances at Secret Caches, the M4 — Rainbow Plume Weapon Blueprint, the Zero — Azurine Dagger, and the Charly — Feather and Plume Operator Skins. Also look out for the Golden Horizon Bundle coming to the Store. This bundle will offer Ramadan themed cosmetics, including the Otter — Refraction Operator Skin and the Muscle Car — Scared Vehicle Skin for use in Battle Royale. Holi Celebrate this vibrant holiday from March 6 to March 26 with an associated in-game event that has you earning color fragments through daily and weekly tasks that anyone can complete, like playing matches, damaging enemies, and eliminating enemies in Battle Royale or Multiplayer. By completing all these tasks, you can consume these color fragments for a chance to randomly unlock rewards including Secret Caches, numerous Battle Royale related camos, and the Pharo — Color Spray. Digital Dawn Battle Pass: New Weapon, Tactical Equipment The Digital Dawn Pass features free and premium items including new Operator Skins, Weapon Blueprints, Calling Cards, and additional Call of Duty® Points to spend on your next Premium Pass or Store purchase. Battle Pass Free Tiers The bolt-action VLK Rogue Shotgun blasts onto the scene in the Season 2 Battle Pass, a highly mobile weapon to help close the distance with a large magazine for unrelenting attacks on the enemy target. Also get the new Flash Strike Grenade, a special Tactical that drills through surfaces before emitting a strong flash effect on the other side, perfect for disorienting enemies behind cover. Other free tier highlights include a variety of Skins, Weapons Blueprints, Vault Coins, and more. Premium Pass Tiers Purchase the Premium Pass for the chance to earn all the content in the Digital Dawn stream, including Operator Skins Artery — Overwrite, Hudson — Shadow Agent, Blackjack — Black Hack, and a new Operator, Umar Obi. Win the digital revolution with high-tech Weapon Blueprints like the HVK-30 — Malware, SP-R 208 — Bot Sector, ICR-1 — Spyware, EM2 — Macro Virus, and the VLK Rogue — Ransomware, based on the new Season 2 weapon. Battle Pass Subscription: Enlist with the Ground Forces by purchasing a Battle Pass Subscription, granting additional monthly rewards along with a 10% boost to Player and Weapon XP, discount coupons, plus limited discounts on 10x crate pulls. Season 2’s Ground Forces rewards include the Francis — Getaway Operator Skin, the OTs 9 — Legions Weapon Blueprint, and the Backpack — Dual Plot. Season 2 Challenge Pass Complete Standard, Special, and Elite Missions to progress through the Season 2 Challenge Pass. Use your earned Challenge Tokens to purchase items in the Exchange including an offroad-themed reskin for the RC-XD plus, PP19 Bizon — Shiny Cat, and more opportunities to grab Secret Caches. Check the in-game Events tab throughout the season for new Missions and rewards. For a broader glimpse of ongoing seasonal activities, check the Mission Board located in the main menu. Store Update: New Legendary Draws, Shiba Feichai Strongbox New Legendary Draws: Deploy as teched out digital warriors wielding the latest in weapon design at their fingertips with new Legendary Draws providing the chance to unlock new Legendary Weapon Blueprints alongside themed Operator Skins and more. Delete the opposition with Legendary Weapon Blueprints like the menacing MG42 — Black Mirror, a weapon that processes eliminations as quickly as data, the elegant and meticulously detailed Man-O-War — Doomfire Pulse, the electrifying QQ9 — Quantum Flash, and the experimental VLK Rogue — Evolutionary, a Weapon Blueprint designed in a secret weapons project that’s based on the new Season 2 Shotgun. Shiba Feichai Strongbox: Roam the map and dominate your foes as a sassy Shiba, wielding themed weapons to achieve victory. For new players and seasoned pros, there’s something for everyone. Mythic Sophia: The Mythic Operator Skin for Sophia remains available for purchase in Season 2. Don’t miss out on the agent of revenge who moves toward redemption as she gains further upgrades. Secret Caches: The new Secret Caches reward system continues in Season 2! Log in daily to unlock rewards and play regularly to earn fragments towards free Mythic and Legendary weapons that take several seasons to unlock. Keep an eye out for several weekend events offering double Secret Cache drops! Battle Pass Vault: Get Operator Skins like Templar — Unredeemed and Yegor — Needleworked along with Weapon Blueprints like the SVD — Black Ironwood and LK24 — Vanquished as Battle Pass content from Season 10 — Shadows Return arrives in the Vault. Season 2 — Digital Dawn launches on Call of Duty: Mobile on February 19 at 4 PM PT. See you online. For the latest Call of Duty Mobile news, visit the Call of Duty: Mobile website, as well as Call of Duty: Mobile on YouTube. Also follow Call of Duty: Mobile on X, Instagram, and Facebook. For the latest Call of Duty intel, visit Call of Duty, as well as Call of Duty on YouTube. Also follow Call of Duty on X, Instagram and Facebook. © 2019-2025 Activision Publishing, Inc. ACTIVISION, and CALL OF DUTY are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the properties of their respective owners. For more information on Activision games, visit the Activision Games Blog. Also follow @Activision on X, Instagram, and Facebook.",
  "image": "https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/hero/codm/CODM-S2-DIGITAL-DAWN-TOUT-.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eThe future is now as Season 2 arrives, bringing a fully remastered version of the Raid Multiplayer map alongside the new VLK Rogue Shotgun, Flash Strike Tactical, an offroad reskin for the RC-XD, and plentiful rewards earned through the high-tech Battle Pass, Engagement Shop, and more.\u003c/p\u003e\u003cdiv\u003e\n    \n    \u003cdiv\u003e\n        \u003ch2\u003e\u003cspan\u003e\u003ca id=\"Future\"\u003e\u003c/a\u003eThe Digital Future Arrives in Season 2!\u003c/span\u003e\u003c/h2\u003e\n\n\u003cp\u003eJack in and prepare for future warfare as Season 2 — Digital Dawn arrives for \u003ci\u003eCall of Duty®: Mobile\u003c/i\u003e. Deploy to an upgraded and remastered version of the Raid Multiplayer map and participate in new themed events including a special Shiba Feichai crossover event featuring a dynamic Weapon Camo and other rewards.\u003c/p\u003e\n\n\u003cp\u003eAn epic Battle Pass brings new Loadout items like the VLK Rogue Shotgun and the Flash Strike Tactical. In the Challenge Pass, unlock an offroad-themed RC-XD that’ll chase down your foes over even the roughest terrain.\u003c/p\u003e\n\n\u003cp\u003eSeason 2 — Digital Dawn launches on February 19 at 4 PM PT.\u003c/p\u003e\n\n    \u003c/div\u003e\n\u003cdiv\u003e\n\n    \u003cp\u003e\n        \u003ch2\u003e\u003cspan\u003e\u003ca id=\"Remastered\"\u003e\u003c/a\u003eMultiplayer: Raid Remastered\u003c/span\u003e\u003c/h2\u003e\n\n    \u003c/p\u003e\n\t\n    \n\n\u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-001.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-001.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eFollowing the remaster of Standoff completed last year, the team have now set their sights on Raid, one of the original launch maps available when \u003ci\u003eCall of Duty: Mobile\u003c/i\u003e first released five years ago. The sprawling luxury complex will receive a full touch up inside and out including improved textures and foliage, new paint, new water effects, and many other graphical enhancements.\u003c/p\u003e\n\n\u003ch2\u003e\u003cspan\u003e\u003ca id=\"Shiba\"\u003e\u003c/a\u003eNew Themed Events\u003c/span\u003e\u003c/h2\u003e\n\n    \u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-002.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-002.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003ch3\u003e\u003cb\u003eShiba Feichai\u003c/b\u003e\u003c/h3\u003e\n\n\u003cp\u003eFollowing the remaster of Standoff completed last year, the team have now set their sights on Raid, one of the original launch maps available when \u003ci\u003eCall of Duty: Mobile\u003c/i\u003e first released five years ago. The sprawling luxury complex will receive a full touch up inside and out including improved textures and foliage, new paint, new water effects, and many other graphical enhancements.\u003c/p\u003e\n\n    \u003c/div\u003e\n\u003cdiv\u003e\n        \u003ch3\u003e\u003cb\u003eRamadan\u003c/b\u003e\u003c/h3\u003e\n\n\u003cp\u003eStarting on February 28, several events will launch in-game to help celebrate Ramadan with login rewards, challenges, and an exchange shop.\u003c/p\u003e\n\n\u003cp\u003eThroughout the celebration earn rewards like more chances at Secret Caches, the M4 — Rainbow Plume Weapon Blueprint, the Zero — Azurine Dagger, and the Charly — Feather and Plume Operator Skins.\u003c/p\u003e\n\n\u003cp\u003eAlso look out for the Golden Horizon Bundle coming to the Store. This bundle will offer Ramadan themed cosmetics, including the Otter — Refraction Operator Skin and the Muscle Car — Scared Vehicle Skin for use in Battle Royale.\u003c/p\u003e\n\n    \u003c/div\u003e\n\u003cdiv\u003e\n\n    \u003cp\u003e\n        \u003ch3\u003e\u003cb\u003e\u003ca id=\"Holi\"\u003e\u003c/a\u003eHoli\u003c/b\u003e\u003c/h3\u003e\n\n    \u003c/p\u003e\n\t\n    \n\n\u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-003.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-003.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eCelebrate this vibrant holiday from March 6 to March 26 with an associated in-game event that has you earning color fragments through daily and weekly tasks that anyone can complete, like playing matches, damaging enemies, and eliminating enemies in Battle Royale or Multiplayer.\u003c/p\u003e\n\n\u003cp\u003eBy completing all these tasks, you can consume these color fragments for a chance to randomly unlock rewards including Secret Caches, numerous Battle Royale related camos, and the Pharo — Color Spray.\u003cb\u003e\u003c/b\u003e\u003c/p\u003e\n\n\u003ch2\u003e\u003cspan\u003e\u003ca id=\"Battle\"\u003e\u003c/a\u003eDigital Dawn Battle Pass: New Weapon, Tactical Equipment\u003c/span\u003e\u003c/h2\u003e\n\n    \u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-004.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-004.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eThe Digital Dawn Pass features free and premium items including new Operator Skins, Weapon Blueprints, Calling Cards, and additional \u003ci\u003eCall of Duty®\u003c/i\u003e Points to spend on your next Premium Pass or Store purchase.\u003c/p\u003e\n\n\u003ch3\u003e\u003ca id=\"Pass\"\u003e\u003c/a\u003eBattle Pass Free Tiers\u003c/h3\u003e\n\n    \u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eThe bolt-action VLK Rogue Shotgun blasts onto the scene in the Season 2 Battle Pass, a highly mobile weapon to help close the distance with a large magazine for unrelenting attacks on the enemy target. Also get the new Flash Strike Grenade, a special Tactical that drills through surfaces before emitting a strong flash effect on the other side, perfect for disorienting enemies behind cover. Other free tier highlights include a variety of Skins, Weapons Blueprints, Vault Coins, and more.\u003c/p\u003e\n\n\u003ch3\u003e\u003ca id=\"Premium\"\u003e\u003c/a\u003ePremium Pass Tiers\u003c/h3\u003e\n\n    \u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003ePurchase the Premium Pass for the chance to earn all the content in the Digital Dawn stream, including Operator Skins Artery — Overwrite, Hudson — Shadow Agent, Blackjack — Black Hack, and a new Operator, Umar Obi. Win the digital revolution with high-tech Weapon Blueprints like the HVK-30 — Malware, SP-R 208 — Bot Sector, ICR-1 — Spyware, EM2 — Macro Virus, and the VLK Rogue — Ransomware, based on the new Season 2 weapon.\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eBattle Pass Subscription: \u003c/b\u003eEnlist with the Ground Forces by purchasing a Battle Pass Subscription, granting additional monthly rewards along with a 10% boost to Player and Weapon XP, discount coupons, plus limited discounts on 10x crate pulls.\u003c/p\u003e\n\n\u003cp\u003eSeason 2’s Ground Forces rewards include the Francis — Getaway Operator Skin, the OTs 9 — Legions Weapon Blueprint, and the Backpack — Dual Plot.\u003c/p\u003e\n\n\u003ch2\u003e\u003cspan\u003e\u003ca id=\"Challenge\"\u003e\u003c/a\u003eSeason 2 Challenge Pass\u003c/span\u003e\u003c/h2\u003e\n\n    \u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-005.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-005.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eComplete Standard, Special, and Elite Missions to progress through the Season 2 Challenge Pass. Use your earned Challenge Tokens to purchase items in the Exchange including an offroad-themed reskin for the RC-XD plus, PP19 Bizon — Shiny Cat, and more opportunities to grab Secret Caches.\u003c/p\u003e\n\n\u003cp\u003eCheck the in-game Events tab throughout the season for new Missions and rewards. For a broader glimpse of ongoing seasonal activities, check the Mission Board located in the main menu.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cspan\u003e\u003ca id=\"Legendary\"\u003e\u003c/a\u003eStore Update: New Legendary Draws, Shiba Feichai Strongbox\u003c/span\u003e\u003c/h2\u003e\n\n    \u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-006.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-006.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003e\u003cb\u003eNew Legendary Draws:\u003c/b\u003e Deploy as teched out digital warriors wielding the latest in weapon design at their fingertips with new Legendary Draws providing the chance to unlock new Legendary Weapon Blueprints alongside themed Operator Skins and more.\u003c/p\u003e\n\n\u003cp\u003eDelete the opposition with Legendary Weapon Blueprints like the menacing MG42 — Black Mirror, a weapon that processes eliminations as quickly as data, the elegant and meticulously detailed Man-O-War — Doomfire Pulse, the electrifying QQ9 — Quantum Flash, and the experimental VLK Rogue — Evolutionary, a Weapon Blueprint designed in a secret weapons project that’s based on the new Season 2 Shotgun.\u003c/p\u003e\n\n    \u003c/div\u003e\n\u003cdiv id=\"Strongbox\" data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-007.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-007.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n\n    \u003cp\u003e\u003cb\u003eShiba Feichai Strongbox: \u003c/b\u003eRoam the map and dominate your foes as a sassy Shiba, wielding themed weapons to achieve victory. For new players and seasoned pros, there’s something for everyone.\u003c/p\u003e\n\t\n    \n\n\u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-008.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-008.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n\n    \u003cp\u003e\u003cb\u003eMythic Sophia:\u003c/b\u003e The Mythic Operator Skin for Sophia remains available for purchase in Season 2. Don’t miss out on the agent of revenge who moves toward redemption as she gains further upgrades.\u003c/p\u003e\n\t\n    \n\n\u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-009.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-009.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003e\u003cb\u003eSecret Caches:\u003c/b\u003e The new Secret Caches reward system continues in Season 2! Log in daily to unlock rewards and play regularly to earn fragments towards free Mythic and Legendary weapons that take several seasons to unlock. Keep an eye out for several weekend events offering double Secret Cache drops!\u003c/p\u003e\n\n\u003cp\u003e\u003cb\u003eBattle Pass Vault: \u003c/b\u003eGet Operator Skins like Templar — Unredeemed and Yegor — Needleworked along with Weapon Blueprints like the SVD — Black Ironwood and LK24 — Vanquished as Battle Pass content from Season 10 — Shadows Return arrives in the Vault.\u003c/p\u003e\n\n    \u003c/div\u003e\n\u003cdiv data-emptytext=\"COD Article Image\"\u003e\n\n    \n    \n        \u003cp\u003e\u003cimg loading=\"lazy\" data-src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-010.jpg\" alt=\"\" src=\"https://imgs.callofduty.com/content/dam/atvi/callofduty/cod-touchui/blog/body/codm/2025/CODM-S2-DIGITAL-DAWN-010.jpg\"/\u003e\n\n\n\t\t\t\t\n            \n\n            \n            \n        \u003c/p\u003e\n        \n    \n\n\n\u003c/div\u003e\n\u003cdiv\u003e\n        \u003cp\u003eSeason 2 — Digital Dawn launches on \u003ci\u003eCall of Duty: Mobile\u003c/i\u003e on February 19 at 4 PM PT.\u003c/p\u003e\n\n\u003cp\u003eSee you online.\u003c/p\u003e\n\n\n\u003cp\u003e\u003ci\u003eFor the latest Call of Duty Mobile news, visit the \u003c/i\u003e\u003ca href=\"https://www.callofduty.com/mobile\"\u003e\u003ci\u003eCall of Duty: Mobile\u003c/i\u003e\u003c/a\u003e\u003ci\u003e website, as well as \u003c/i\u003e\u003ca href=\"https://www.youtube.com/c/callofdutymobile\"\u003e\u003ci\u003eCall of Duty: Mobile\u003c/i\u003e\u003c/a\u003e\u003ci\u003e on YouTube. Also follow Call of Duty: Mobile on \u003c/i\u003e\u003ca href=\"https://twitter.com/PlayCODMobile\"\u003e\u003ci\u003eX\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, \u003c/i\u003e\u003ca href=\"https://www.instagram.com/callofdutymobile/\"\u003e\u003ci\u003eInstagram\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, and \u003c/i\u003e\u003ca href=\"https://www.facebook.com/callofdutymobile/\"\u003e\u003ci\u003eFacebook\u003c/i\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ci\u003eFor the latest Call of Duty intel, visit \u003c/i\u003e\u003ca href=\"https://www.callofduty.com/\"\u003e\u003ci\u003eCall of Duty\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, as well as \u003c/i\u003e\u003ca href=\"https://www.youtube.com/callofduty\"\u003e\u003ci\u003eCall of Duty\u003c/i\u003e\u003c/a\u003e\u003ci\u003e on YouTube. Also follow Call of Duty on \u003c/i\u003e\u003ca href=\"https://twitter.com/callofduty\"\u003e\u003ci\u003eX\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, \u003c/i\u003e\u003ca href=\"https://www.instagram.com/callofduty/\"\u003e\u003ci\u003eInstagram\u003c/i\u003e\u003c/a\u003e\u003ci\u003e and \u003c/i\u003e\u003ca href=\"https://www.facebook.com/CallofDuty/\"\u003e\u003ci\u003eFacebook\u003c/i\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ci\u003e© 2019-2025 Activision Publishing, Inc. ACTIVISION, and CALL OF DUTY are trademarks of Activision Publishing, Inc. All other trademarks and trade names are the properties of their respective owners.\u003c/i\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ci\u003eFor more information on Activision games, visit the \u003c/i\u003e\u003ca href=\"https://blog.activision.com/\"\u003e\u003ci\u003eActivision Games Blog\u003c/i\u003e\u003c/a\u003e\u003ci\u003e. Also follow @Activision on \u003c/i\u003e\u003ca href=\"https://twitter.com/activision\"\u003e\u003ci\u003eX\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, \u003c/i\u003e\u003ca href=\"https://www.instagram.com/activision/\"\u003e\u003ci\u003eInstagram\u003c/i\u003e\u003c/a\u003e\u003ci\u003e, and \u003c/i\u003e\u003ca href=\"https://www.facebook.com/Activision/\"\u003e\u003ci\u003eFacebook\u003c/i\u003e\u003c/a\u003e\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\n\n    \u003c/div\u003e\n\n    \n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": null,
  "modifiedTime": null
}
