{
  "id": "2e434931-4fff-41d2-a2ce-095a145d4129",
  "title": "Evercade Alpha Bartop Arcade Review",
  "link": "https://www.ign.com/articles/evercade-alpha-bartop-arcade-review",
  "description": "With a great display and controls, the uniquely expandable Evercade Alpha is among the best values in bartop arcades.",
  "author": "Michael Higham",
  "published": "Sat, 21 Dec 2024 00:41:47 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Bill Loguidice",
  "length": 14691,
  "excerpt": "With a great display and controls, the uniquely expandable Evercade Alpha is among the best values in bartop arcades.",
  "siteName": "IGN",
  "favicon": "",
  "text": "Back in May 2020, Blaze Entertainment established a surprising new platform with the release of the Evercade handheld and 10 game cartridges, which featured a diverse selection of licensed retro games. Since then, the company has released two additional handhelds, two consoles, and even smaller Hyper Mega Tech-branded Super Pocket handhelds, as well over 50 additional multi-game cartridges. Now, Blaze Entertainment is back with a whole new form factor in the Evercade Alpha bartop arcade, which not only has a great selection of built-in games, but can also play the entire Evercade library. While the Alpha doesn't necessarily elevate the bartop arcade category, for retro gaming enthusiasts, it proves a fun new addition to the growing Evercade ecosystem.Evercade Alpha – Design and FeaturesThere are two basic versions of the Evercade Alpha – the first is themed around Street Fighter, while the second is Mega Man, and each has six built-in Capcom games more or less matching the respective theme. Style-wise, I found both versions aesthetically pleasing, with the Mega Man mirroring much of the arcade look from Mega Man: The Power Battle and the Street Fighter matching Street Fighter II: Champion Edition.On the front of the Alpha is a light-up faux coin slot power button between two cartridge slots. Below the left cartridge slot is a 3.5mm audio jack and USB-A port for a player 1 controller, and below the right cartridge slot is a USB-A port for a player 2 controller. And you’ll find the volume control just below the power button. The rear of the unit has a single USB-C port for power, and you’ll find the speakers are on the left and right of the cabinet.Looking for a retro controller?Blaze Evercade VS-R Wired ControllerCheck out our roundup of the best controllers, too!The control panel features a bat-top digital arcade joystick and six colored digital arcade buttons. Above the arcade buttons are small Start, Select / Coin Up, and Menu buttons. Above the control panel is an 8-inch 1024 x 768 resolution IPS display with a 4:3 aspect ratio. And to top it all off, a light-up marquee sits above the display.Besides the Alpha itself, there's an envelope with two additional marquees, USB-C to USB-A power cable, USB-A power adapter with plugs for three different regions, and a quick start guide in the box. Fortunately, there's not much to set up, as you can pretty much remove the Alpha from the box, peel off the plastic protectors, apply power, choose your language, set up Wi-Fi, update and restart, and then start playing.I was able to evaluate the standard Mega Man bartop arcade and the more expensive Deluxe Edition of the Street Fighter bartop arcade. The respective Deluxe Editions include six pieces of marquee art instead of the three that are in the standard edition packages, and are pre-fitted with the upgraded Sanwa stick and button arcade parts. Lastly, the Deluxe Editions come with an exclusive Evercade Alpha-branded USB controller, which is the same type that comes with the Evercade VS consoles.I first set up the Mega Man bartop and it was easy enough removing the plastic from the marquee protector after sliding it out, but the plastic protection on the screen bezel was more difficult. I had to loosen the bezel screws to get the last bits of plastic, as well as use tweezers, and even then there was a tiny bit left in the corner that I couldn't quite get. On the plus side, there was only a little dust from the factory behind the bezel, nowhere near as bad as you often get with similar Arcade1Up products. There was also a slight ding on the upper left of the cabinet, which, unfortunately, is not unusual for these types of pre-assembled arcade products.The Street Fighter Deluxe Edition model was packaged similarly. With lessons learned from the previous unboxing, I loosened the bezel screws, then removed the two plastic cap screw covers to the left and right of the control panel. From there, I removed the screws and panel so I could more easily peel off the rest of the plastic. There were no dings on this one other than a chip above the right control panel screw cover, as well as some misaligned screw covers.The USB AC adapter included with the Mega Man was defective. Fortunately, any good USB power source can power the Alpha via its USB-C port. The same type of USB AC adapter, which had no issues, was included with the Deluxe Edition Street Fighter.Evercade Alpha – Built-in Games and Menu SystemThe main menu has five options on the left-hand side of the screen, and the first at the top lists the built-in games. Below are the rosters built-in for the built-in games on both the Mega Man and Street Fighter editions of the Evercade Alpha.Evercade Alpha Mega Man Edition games:Carrier Air WingFinal FightKnights of the RoundMega Man: The Power BattleMega Man: The Power FightersStriderEvercade Alpha Street Fighter Edition games:Street Fighter II: Champion EditionSuper Street Fighter II TurboSuper Puzzle Fighter II TurboStreet Fighter Alpha: Warriors' DreamsStreet Fighter Alpha 2Street Fighter Alpha 3The second menu option showing a cartridge lists the games on any cartridge inserted into the slots. The third menu option shows the game of the month, which is free every month between April and December, and it’s automatically downloaded when you connect to Wi-Fi. For example, the game of the month for November 2024 was Batty Zabella, a point-and-click adventure game for the Game Boy from 2022, and the game of the month for December 2024 was Murtop, a modern retro-style arcade game native to the platform. This area also shows any hidden games you've unlocked.It looks great, plays great, and makes for a great entry into the growing Evercade ecosystem of retro gaming goodness.The fourth menu option, showing three cartridge boxes, lists the entire Evercade library. It's automatically updated with both announced and recently released content, and also tracks the cartridges you've inserted into the Alpha. The final menu option, a gear, is for settings. From here, you can adjust the display, theme, sound, network, accessibility options, and more. Besides the standard Evercade themes, both the Mega Man and Street Fighter editions each have their own exclusive themes, which are selected by default.One of the negatives with the menu system is that it doesn't always show what button to press to perform a function. For instance, on the main menu, you can use either the joystick or B button to go back to the left-hand side, but there’s no on-screen indication that you can do so. It's by no means a dealbreaker and something you’ll eventually figure out, but for such a relatively well-thought-out menu system, it would have been nice to have just a bit more consistency with the on-screen control labels.Games in the menus get showcased with its artwork and a screenshot with it denoting the original release year. You can choose to have it run gameplay by selecting Demo with Y, or go to the game's main page with Select. When you're at the game's main page, you can read details, see how the controls are mapped, select a previous save state, or review play stats, which include the amount of time played, how many times played, save state count, and load count.Once you start a game, it works like it did on the original platform, which, for the built-in games, were all arcade releases. You can coin-up with the dedicated button, then press Start to begin. Pressing Menu lets you save, load, review and modify the control mapping, change the display settings, reset, or quit. For display settings, you can change the aspect ratio (which is set to the original ratio by default), enable scanlines, or add a decorative bezel. Since the Alpha's built-in screen is already in 4:3, you can only see a selected bezel if the aspect ratio is set to pixel perfect.The display is relatively small at just 8.0 inches, but it's not a bad size since you're up close. Fortunately, the games the Alpha plays are retro affairs, so they benefit from the more compact display and look great. Viewing angles are also top-notch with very little dimming even at more extreme angles.The sound is surprisingly good as well, especially for the form factor. It's not going to fill a room, of course, but it gets quite loud, and there’s minimal distortion even at maximum volume. And while there's not much bass, what's there still has enough presence not to sound too hollow. Plugging in good speakers or headphones via the 3.5mm audio jack will sound better, of course. However, it’s unfortunate that, like all Evercade hardware, the Alpha lacks any type of Bluetooth support.In terms of the built-in games themselves, they look, sound, and control great with no noticeable emulation issues. The arcade-quality Sanwa joystick and buttons on the Deluxe are worth the upgrade if you can find that pricier model, but the choice of joystick on the standard model is surprisingly nearly as good, just with a slightly looser feel. I did like the Sanwa buttons on the Deluxe better than the generic buttons of the standard, however, as they were less noisy overall and just felt a bit more responsive. Of course, even if you don't get a Deluxe, Blaze Entertainment made it easy to upgrade the controls yourself with a choice of standard arcade parts.Evercade Alpha – Game Library and Control OptionsThe ace-in-the-hole for any Evercade hardware is not necessarily what's built-in, but rather its growing cartridge library. Through the end of 2024, there have been 63 cartridge releases totaling more than 520 games from the arcade, Atari 2600, Atari 7800, NES, Sega Genesis, Super NES, Atari Lynx, PlayStation 1, Game Boy, Game Boy Color, GBA, Intellivision, N64, Commodore 64, Commodore Amiga, and MSX, as well as newer titles native to the platform.Every cartridge comes in a small plastic case, along with a color manual, though, as with the Alpha's built-in games, basic instructions are also always provided on a particular game's main page. While it can be jarring to have the Alpha switch controls to what's native for a particular platform, where, for instance, B is sometimes an action button rather than back, that's unavoidable given the diversity of platforms emulated.Cartridge cases are loosely categorized by color, with console (red), arcade (purple), and home computer (blue), as well as number. Some cartridges enter what's called Legacy status, where no more are produced, but if a cartridge is generally available it typically retails for between $20 and $30.Like the Evercade VS consoles, and unlike the Evercade handhelds, the Alpha has two hot swappable cartridge slots. Besides the convenience of having two sets of additional games immediately available, inserting certain cartridge combinations unlocks additional games. For instance, inserting both the legacy Atari Collection 1 (01) and Atari Collection 2 (05) cartridges unlocks the Atari 7800 version of Dark Chambers.I found the Alpha an ideal way to play many of the games in the library.One area where the Alpha lags behind the Evercade VS consoles is with multiplayer support. Unlike the consoles, which support up to four controllers, the Alpha only supports two at this time, with just a few exceptions. Typically, iIf you plug in an Evercade-compatible gamepad into the first USB port, it will mirror the main control panel as player 1. However, in the built-in Knights of the Round game on the Mega Man Alpha, there’s a “Play in 3 player mode” option after you plug in two USB controllers. Same thing with The Combatribes on the Technos Arcade 1 (A01) cartridge. It’s unclear if or when Evercade will enable this extended multiplayer feature for other games.One quirk of the library is that the legacy Namco Museum Collection 1 (02) and Namco Museum Collection 2 (06) cartridges are not licensed for Evercade VS series console output to a TV, although those games do work when output to a TV from the original handhelds. Fortunately, since the Alpha is self-contained and has no HDMI output, those games work just fine, although it’s a shame they’re not the arcade versions, but rather home ports.Since the Evercade platform only supports digital controls, the small number of games that could benefit from analog control, like the Nintendo 64's Glover, found on Piko Interactive Collection 4 (39), are optimized to make the best use of what's available. As such, every game, from Pong to Tomb Raider, works just fine with the Alpha's digital arcade control panel. For instance, in Tomb Raider (from Tomb Raider Collection 1 (40)), as with the original Evercade handheld and the Super Pockets, there are no L2 or R2 buttons on the Alpha. You'll need to hold down L1 and R1 at the same time and move the joystick left or right to side step left or right, respectively, rather than just pressing L2 to side step left, or R2 to side step right. Again, most games don't make use of eight buttons, let alone the six found on the Alpha, but it's something to take note of if you don't have an alternative controller handy.Besides Blaze Entertainment's own Evercade gamepads, the platform is generally compatible with the same controllers and adapters that the Polymega works with. This includes Polymega's own controller, the 8BitDo Arcade Stick, and modern Xbox, PlayStation, Switch or Wii controllers via the 8BitDo USB Wireless Adapter 2.While I'm an Evercade platform fan and have every one of their handhelds and consoles, overall, I found the Alpha an ideal way to play many of the games in the library. While it's nice to enjoy classic games on a handheld or big-screen TV, there's something extra special about sitting in front of a mini arcade-style setup with a proper 4:3 aspect ratio display. It's a great middle-ground and is a form factor that's absolutely justified being added to the growing Evercade ecosystem.Originally posted: Dec 21, 2024 12:41 amVerdictGiven the Evercade Alpha's price point, I would have hoped for just a little nicer build quality, but it's still a better overall value than other arcade bartops. Per usual with Blaze Entertainment and their hardware releases, for all that the Evercade Alpha gets right, like its audio-visuals and controls, there are still a few areas where the product oddly stumbles, like with its general two-player limit or lack of L2 and R2 buttons. With that said, the Alpha does a great job of impersonating a real arcade machine in a compact package, with a nice selection of built-in games and virtually limitless expansion through its two cartridge slots. It looks great, plays great, and makes for a great entry into the growing Evercade ecosystem of retro gaming goodness.",
  "image": "https://assets-prd.ignimgs.com/2024/12/19/01-2024-12-02-16-09-56-1734648670059.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003eBack in May 2020, Blaze Entertainment established a surprising new platform with the release of the \u003ca href=\"https://evercade.co.uk/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003eEvercade\u003c/u\u003e\u003c/a\u003e handheld and 10 \u003ca href=\"https://evercade.co.uk/cartridges/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003egame cartridges\u003c/u\u003e\u003c/a\u003e, which featured a diverse selection of licensed retro games. Since then, the company has released two additional handhelds, two consoles, and even smaller Hyper Mega Tech-branded \u003ca href=\"https://www.hypermegatech.com/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003eSuper Pocket\u003c/u\u003e\u003c/a\u003e handhelds, as well over 50 additional multi-game cartridges. Now, Blaze Entertainment is back with a whole new form factor in the \u003ca href=\"https://evercade.co.uk/alpha/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003eEvercade Alpha\u003c/u\u003e\u003c/a\u003e bartop arcade, which not only has a great selection of built-in games, but can also play the entire Evercade library. While the Alpha doesn\u0026#39;t necessarily elevate the bartop arcade category, for retro gaming enthusiasts, it proves a fun new addition to the growing Evercade ecosystem.\u003c/p\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/20/01-2024-12-02-16-09-56-1734729412243.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/20/01-2024-12-02-16-09-56-1734729412243.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eEvercade Alpha – Design and Features\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eThere are two basic versions of the Evercade Alpha – the first is themed around Street Fighter, while the second is Mega Man, and each has six built-in Capcom games more or less matching the respective theme. Style-wise, I found both versions aesthetically pleasing, with the Mega Man mirroring much of the arcade look from Mega Man: The Power Battle and the Street Fighter matching Street Fighter II: Champion Edition.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOn the front of the Alpha is a light-up faux coin slot power button between two cartridge slots. Below the left cartridge slot is a 3.5mm audio jack and USB-A port for a player 1 controller, and below the right cartridge slot is a USB-A port for a player 2 controller. And you’ll find the volume control just below the power button. The rear of the unit has a single USB-C port for power, and you’ll find the speakers are on the left and right of the cabinet.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cem\u003eLooking for a retro controller?\u003c/em\u003e\u003c/h2\u003e\u003cdiv catalogid=\"feb3f98d-d6c8-4b9e-bbb9-07eef88d7ebb\" id=\"200140\"\u003e\u003cdiv id=\"200140\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/oebmb?object_uuid=f030a0a4-d47c-4650-8884-41b0b92bcf11\u0026amp;t=article\" title=\"Blaze Evercade VS-R Wired Controller\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"Blaze Evercade VS-R Wired Controller\" src=\"https://assets-prd.ignimgs.com/2024/05/02/evercade-vs-r-controller-1714656866072.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eBlaze Evercade VS-R Wired Controller\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eCheck out our roundup of the best controllers, too!\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe control panel features a bat-top digital arcade joystick and six colored digital arcade buttons. Above the arcade buttons are small Start, Select / Coin Up, and Menu buttons. Above the control panel is an 8-inch 1024 x 768 resolution IPS display with a 4:3 aspect ratio. And to top it all off, a light-up marquee sits above the display.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eBesides the Alpha itself, there\u0026#39;s an envelope with two additional marquees, USB-C to USB-A power cable, USB-A power adapter with plugs for three different regions, and a quick start guide in the box. Fortunately, there\u0026#39;s not much to set up, as you can pretty much remove the Alpha from the box, peel off the plastic protectors, apply power, choose your language, set up Wi-Fi, update and restart, and then start playing.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/03-2024-11-15-12-00-36-1734740769520.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/03-2024-11-15-12-00-36-1734740769520.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eI was able to evaluate the standard Mega Man bartop arcade and the more expensive\u003ca href=\"https://funstock.co.uk/collections/evercade-hardware/products/evercade-alpha-street-fighter-deluxe-edition-bartop-arcade?variant=41491290030169\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e \u003cu\u003eDeluxe Edition\u003c/u\u003e\u003c/a\u003e of the Street Fighter bartop arcade. The respective Deluxe Editions include six pieces of marquee art instead of the three that are in the standard edition packages, and are pre-fitted with the upgraded Sanwa stick and button arcade parts. Lastly, the Deluxe Editions come with an exclusive Evercade Alpha-branded USB controller, which is the same type that comes with the\u003ca href=\"https://evercade.co.uk/vs-r/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e \u003cu\u003eEvercade VS\u003c/u\u003e\u003c/a\u003e consoles.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eI first set up the Mega Man bartop and it was easy enough removing the plastic from the marquee protector after sliding it out, but the plastic protection on the screen bezel was more difficult. I had to loosen the bezel screws to get the last bits of plastic, as well as use tweezers, and even then there was a tiny bit left in the corner that I couldn\u0026#39;t quite get. On the plus side, there was only a little dust from the factory behind the bezel, nowhere near as bad as you often get with similar Arcade1Up products. There was also a slight ding on the upper left of the cabinet, which, unfortunately, is not unusual for these types of pre-assembled arcade products.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/04-2024-11-27-15-15-35-1734740788930.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/04-2024-11-27-15-15-35-1734740788930.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe Street Fighter Deluxe Edition model was packaged similarly. With lessons learned from the previous unboxing, I loosened the bezel screws, then removed the two plastic cap screw covers to the left and right of the control panel. From there, I removed the screws and panel so I could more easily peel off the rest of the plastic. There were no dings on this one other than a chip above the right control panel screw cover, as well as some misaligned screw covers.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe USB AC adapter included with the Mega Man was defective. Fortunately, any good USB power source can power the Alpha via its USB-C port. The same type of USB AC adapter, which had no issues, was included with the Deluxe Edition Street Fighter.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/05-2024-11-27-15-08-45-1734740812258.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/05-2024-11-27-15-08-45-1734740812258.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eEvercade Alpha – Built-in Games and Menu System\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eThe main menu has five options on the left-hand side of the screen, and the first at the top lists the built-in games. Below are the rosters built-in for the built-in games on both the Mega Man and Street Fighter editions of the Evercade Alpha.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eEvercade Alpha Mega Man Edition games:\u003c/p\u003e\u003cul data-cy=\"list\"\u003e\u003cli\u003eCarrier Air Wing\u003c/li\u003e\u003cli\u003eFinal Fight\u003c/li\u003e\u003cli\u003eKnights of the Round\u003c/li\u003e\u003cli\u003eMega Man: The Power Battle\u003c/li\u003e\u003cli\u003eMega Man: The Power Fighters\u003c/li\u003e\u003cli\u003eStrider\u003c/li\u003e\u003c/ul\u003e\u003cp data-cy=\"paragraph\"\u003eEvercade Alpha Street Fighter Edition games:\u003c/p\u003e\u003cul data-cy=\"list\"\u003e\u003cli\u003eStreet Fighter II: Champion Edition\u003c/li\u003e\u003cli\u003eSuper Street Fighter II Turbo\u003c/li\u003e\u003cli\u003eSuper Puzzle Fighter II Turbo\u003c/li\u003e\u003cli\u003eStreet Fighter Alpha: Warriors\u0026#39; Dreams\u003c/li\u003e\u003cli\u003eStreet Fighter Alpha 2\u003c/li\u003e\u003cli\u003eStreet Fighter Alpha 3\u003c/li\u003e\u003c/ul\u003e\u003cp data-cy=\"paragraph\"\u003eThe second menu option showing a cartridge lists the games on any cartridge inserted into the slots. The third menu option shows the game of the month, which is free every month between April and December, and it’s automatically downloaded when you connect to Wi-Fi. For example, the game of the month for November 2024 was Batty Zabella, a point-and-click adventure game for the Game Boy from 2022, and the game of the month for December 2024 was Murtop, a modern retro-style arcade game native to the platform. This area also shows any \u003ca href=\"https://evercade.info/vs-secrets-and-easter-eggs/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003ehidden games\u003c/u\u003e\u003c/a\u003e you\u0026#39;ve unlocked.\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eIt looks great, plays great, and makes for a great entry into the growing Evercade ecosystem of retro gaming goodness.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThe fourth menu option, showing three cartridge boxes, lists the entire Evercade library. It\u0026#39;s automatically updated with both announced and recently released content, and also tracks the cartridges you\u0026#39;ve inserted into the Alpha. The final menu option, a gear, is for settings. From here, you can adjust the display, theme, sound, network, accessibility options, and more. Besides the standard Evercade themes, both the Mega Man and Street Fighter editions each have their own exclusive themes, which are selected by default.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOne of the negatives with the menu system is that it doesn\u0026#39;t always show what button to press to perform a function. For instance, on the main menu, you can use either the joystick or B button to go back to the left-hand side, but there’s no on-screen indication that you can do so. It\u0026#39;s by no means a dealbreaker and something you’ll eventually figure out, but for such a relatively well-thought-out menu system, it would have been nice to have just a bit more consistency with the on-screen control labels.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/06-2024-12-02-16-13-21-1734740844340.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/06-2024-12-02-16-13-21-1734740844340.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eGames in the menus get showcased with its artwork and a screenshot with it denoting the original release year. You can choose to have it run gameplay by selecting Demo with Y, or go to the game\u0026#39;s main page with Select. When you\u0026#39;re at the game\u0026#39;s main page, you can read details, see how the controls are mapped, select a previous save state, or review play stats, which include the amount of time played, how many times played, save state count, and load count.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOnce you start a game, it works like it did on the original platform, which, for the built-in games, were all arcade releases. You can coin-up with the dedicated button, then press Start to begin. Pressing Menu lets you save, load, review and modify the control mapping, change the display settings, reset, or quit. For display settings, you can change the aspect ratio (which is set to the original ratio by default), enable scanlines, or add a decorative bezel. Since the Alpha\u0026#39;s built-in screen is already in 4:3, you can only see a selected bezel if the aspect ratio is set to pixel perfect.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe display is relatively small at just 8.0 inches, but it\u0026#39;s not a bad size since you\u0026#39;re up close. Fortunately, the games the Alpha plays are retro affairs, so they benefit from the more compact display and look great. Viewing angles are also top-notch with very little dimming even at more extreme angles.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe sound is surprisingly good as well, especially for the form factor. It\u0026#39;s not going to fill a room, of course, but it gets quite loud, and there’s minimal distortion even at maximum volume. And while there\u0026#39;s not much bass, what\u0026#39;s there still has enough presence not to sound too hollow. Plugging in good speakers or headphones via the 3.5mm audio jack will sound better, of course. However, it’s unfortunate that, like all Evercade hardware, the Alpha lacks any type of Bluetooth support.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/07-2024-12-02-16-15-34-1734740879708.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/07-2024-12-02-16-15-34-1734740879708.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eIn terms of the built-in games themselves, they look, sound, and control great with no noticeable emulation issues. The arcade-quality Sanwa joystick and buttons on the Deluxe are worth the upgrade if you can find that pricier model, but the choice of joystick on the standard model is surprisingly nearly as good, just with a slightly looser feel. I did like the Sanwa buttons on the Deluxe better than the generic buttons of the standard, however, as they were less noisy overall and just felt a bit more responsive. Of course, even if you don\u0026#39;t get a Deluxe, Blaze Entertainment made it easy to upgrade the controls yourself with a choice of standard arcade parts.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003e\u003cstrong\u003eEvercade Alpha – Game Library and Control Options\u003c/strong\u003e\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eThe ace-in-the-hole for any Evercade hardware is not necessarily what\u0026#39;s built-in, but rather its \u003ca href=\"https://en.wikipedia.org/wiki/List_of_Evercade_cartridges\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003egrowing cartridge library\u003c/u\u003e\u003c/a\u003e. Through the end of 2024, there have been 63 cartridge releases totaling more than 520 games from the arcade, Atari 2600, Atari 7800, NES, Sega Genesis, Super NES, Atari Lynx, PlayStation 1, Game Boy, Game Boy Color, GBA, Intellivision, N64, Commodore 64, Commodore Amiga, and MSX, as well as newer titles native to the platform.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/08-2024-12-02-16-26-53-1734740892992.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/08-2024-12-02-16-26-53-1734740892992.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eEvery cartridge comes in a small plastic case, along with a color manual, though, as with the Alpha\u0026#39;s built-in games, basic instructions are also always provided on a particular game\u0026#39;s main page. While it can be jarring to have the Alpha switch controls to what\u0026#39;s native for a particular platform, where, for instance, B is sometimes an action button rather than back, that\u0026#39;s unavoidable given the diversity of platforms emulated.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eCartridge cases are loosely categorized by color, with console (red), arcade (purple), and home computer (blue), as well as number. Some cartridges enter what\u0026#39;s called Legacy status, where no more are produced, but if a cartridge is generally available it typically retails for between $20 and $30.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eLike the Evercade VS consoles, and unlike the Evercade handhelds, the Alpha has two hot swappable cartridge slots. Besides the convenience of having two sets of additional games immediately available, inserting certain cartridge combinations unlocks additional games. For instance, inserting both the legacy Atari Collection 1 (01) and Atari Collection 2 (05) cartridges unlocks the Atari 7800 version of Dark Chambers.\u003c/p\u003e\u003cdiv data-cy=\"quoteBox\"\u003e\u003cp\u003eI found the Alpha an ideal way to play many of the games in the library.\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eOne area where the Alpha lags behind the Evercade VS consoles is with multiplayer support. Unlike the consoles, which support up to four controllers, the Alpha only supports two at this time, with just a few exceptions. Typically, iIf you plug in an Evercade-compatible gamepad into the first USB port, it will mirror the main control panel as player 1. However, in the built-in Knights of the Round\u003cem\u003e \u003c/em\u003egame on the Mega Man Alpha, there’s a “Play in 3 player mode” option after you plug in two USB controllers. Same thing with The Combatribes on the Technos Arcade 1 (A01) cartridge. It’s unclear if or when Evercade will enable this extended multiplayer feature for other games.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eOne quirk of the library is that the legacy Namco Museum Collection 1 (02) and Namco Museum Collection 2 (06) cartridges are not licensed for Evercade VS series console output to a TV, although those games do work when output to a TV from the original handhelds. Fortunately, since the Alpha is self-contained and has no HDMI output, those games work just fine, although it’s a shame they’re not the arcade versions, but rather home ports.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://assets-prd.ignimgs.com/2024/12/21/09-2024-12-02-16-31-45-1734740922495.jpg\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003coutput\u003e\u003cfigure\u003e\u003cspan\u003e\u003cimg decoding=\"async\" alt=\"undefined\" src=\"https://assets-prd.ignimgs.com/2024/12/21/09-2024-12-02-16-31-45-1734740922495.jpg?width=1280\u0026amp;fit=bounds\u0026amp;height=720\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/figure\u003e\u003c/output\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSince the Evercade platform only supports digital controls, the small number of games that could benefit from analog control, like the Nintendo 64\u0026#39;s Glover, found on Piko Interactive Collection 4 (39), are optimized to make the best use of what\u0026#39;s available. As such, every game, from Pong to Tomb Raider, works just fine with the Alpha\u0026#39;s digital arcade control panel. For instance, in Tomb Raider (from Tomb Raider Collection 1 (40)), as with the original Evercade handheld and the Super Pockets, there are no L2 or R2 buttons on the Alpha. You\u0026#39;ll need to hold down L1 and R1 at the same time and move the joystick left or right to side step left or right, respectively, rather than just pressing L2 to side step left, or R2 to side step right. Again, most games don\u0026#39;t make use of eight buttons, let alone the six found on the Alpha, but it\u0026#39;s something to take note of if you don\u0026#39;t have an alternative controller handy.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eBesides Blaze Entertainment\u0026#39;s own Evercade gamepads, the platform is generally compatible with the same controllers and adapters that the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/polymega-review\"\u003e\u003cu\u003ePolymega\u003c/u\u003e\u003c/a\u003e works with. This includes Polymega\u0026#39;s own controller, the \u003ca href=\"https://www.amazon.com/gp/product/B08GJC5WSS/\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003e8BitDo Arcade Stick\u003c/u\u003e\u003c/a\u003e, and modern Xbox, PlayStation, Switch or Wii controllers via the \u003ca href=\"https://www.amazon.com/8Bitdo-Wireless-Compatible-Controller-Bluetooth/dp/B09M8CVMYF\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cu\u003e8BitDo USB Wireless Adapter 2\u003c/u\u003e\u003c/a\u003e.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWhile I\u0026#39;m an Evercade platform fan and have every one of their handhelds and consoles, overall, I found the Alpha an ideal way to play many of the games in the library. While it\u0026#39;s nice to enjoy classic games on a handheld or big-screen TV, there\u0026#39;s something extra special about sitting in front of a mini arcade-style setup with a proper 4:3 aspect ratio display. It\u0026#39;s a great middle-ground and is a form factor that\u0026#39;s absolutely justified being added to the growing Evercade ecosystem.\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv data-cy=\"caption\"\u003e\u003cp\u003eOriginally posted: Dec 21, 2024 12:41 am\u003c/p\u003e\u003c/div\u003e\u003cdiv data-cy=\"verdict\"\u003e\u003ch3 data-cy=\"title3\"\u003eVerdict\u003c/h3\u003e\u003cp data-cy=\"article-verdict-paragraph\"\u003eGiven the Evercade Alpha\u0026#39;s price point, I would have hoped for just a little nicer build quality, but it\u0026#39;s still a better overall value than other arcade bartops. Per usual with Blaze Entertainment and their hardware releases, for all that the Evercade Alpha gets right, like its audio-visuals and controls, there are still a few areas where the product oddly stumbles, like with its general two-player limit or lack of L2 and R2 buttons. With that said, the Alpha does a great job of impersonating a real arcade machine in a compact package, with a nice selection of built-in games and virtually limitless expansion through its two cartridge slots. It looks great, plays great, and makes for a great entry into the growing Evercade ecosystem of retro gaming goodness.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-12-21T00:41:47.334Z",
  "modifiedTime": "2024-12-21T00:41:58.426Z"
}
