{
  "id": "34ef272e-a299-4c60-8e85-277cf38e23fc",
  "title": "Mass Effect director Casey Hudson's \"AAA\" sci-fi game cancelled, studio closing",
  "link": "https://www.eurogamer.net/mass-effect-director-casey-hudsons-aaa-sci-fi-game-cancelled-studio-closing",
  "description": "Humanoid Origin, the studio founded by former Mass Effect director Casey Hudson in 2021, is ending development of its untitled sci-fi game and shutting its doors, after an \"an unexpected shortfall of funding left [it] unable to sustain operations.\" Read more",
  "author": "Matt Wales",
  "published": "Mon, 25 Nov 2024 21:37:33 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Microsoft Studios",
    "Mass Effect",
    "PS5",
    "PS3",
    "Xbox 360",
    "PC",
    "Single Player",
    "Shooter",
    "Simulation",
    "Bioware",
    "RPG",
    "Xbox Series X/S",
    "Microsoft",
    "Multiplayer Competitive",
    "Nintendo Wii U",
    "Mass Effect 3",
    "Electronic Arts",
    "Action Adventure",
    "Third person",
    "Mass Effect 2"
  ],
  "byline": "Matt Wales",
  "length": 2222,
  "excerpt": "Humanoid Origin, the studio founded by former Mass Effect director Casey Hudson in 2021, is ending development of its u…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/fff03defc09c21fed21275a4395f646e/icon/apple-touch-icon-152x152.png",
  "text": "Due to \"unexpected shortfall of funding\". Image credit: Humanoid Origin Humanoid Origin, the studio founded by former Mass Effect director Casey Hudson in 2021, is ending development of its untitled sci-fi game and shutting its doors, after an \"an unexpected shortfall of funding left [it] unable to sustain operations.\" Hudson, who also served as BioWare general manager before departing the studio in 2020, announced the establishment of Humanoid Origin (initially Humanoid Studios) in June 2021, teasing it was working on an \"all-new IP\". A year later, Hudson shared a little more information on the \"multi-platform AAA game\", as well as early concept art, calling it a \"character-driven narrative in an all-new science-fiction universe\". Today, however, Hudson released a statement announcing the project's termination and the closure of the studio. \"Earlier today, we informed our staff that Humanoid Origin will be shutting down,\" he wrote. \"Despite efforts to shield the studio from broader challenges in the industry, an unexpected shortfall of funding left us unable to sustain operations.\" \"We're heartbroken that we will not be able to bring our new science-fiction universe to completion,\" Hudson continued. \"Our main concern at this time however is for our team, and we are committed to supporting them in their transition to new employment. \"In our time together, the team achieved incredible progress, and demonstrated that it's possible to do amazing work while fostering a culture of fun and creativity. We thank them for their talent, courage, and friendship. \"Thank you to everyone who supported us throughout our journey.\" Humanoid Origin is the latest studio to be impacted in what continues to be a devastating year for games industry employees, with over 14,000 people estimated to have lost their jobs so far. That's compared to the 10,500 games industry workers who were laid off across the entirety of 2023. Back in March, GamesIndustry.biz's Chris Tring, writing for Eurogamer, took a closer look at the circumstances leading to such massive numbers of job cuts over the last few years.",
  "image": "https://assetsio.gnwcdn.com/humanoid-origin.jpeg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003eDue to \u0026#34;unexpected shortfall of funding\u0026#34;.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/humanoid-origin.jpeg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/humanoid-origin.jpeg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/humanoid-origin.jpeg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/humanoid-origin.jpeg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Concept art for Humanoid Origin\u0026#39;s untitled sci-fi game showing a solo traveller roaming a desolate alien landscape, jagged mountains in the distance and a vast spherical structure looming to their right.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eHumanoid Origin\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003e\nHumanoid Origin, the studio founded by former \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/mass-effect\"\u003eMass Effect\u003c/a\u003e director Casey Hudson in 2021, is ending development of its untitled sci-fi game and shutting its doors, after an \u0026#34;an unexpected shortfall of funding left [it] unable to sustain operations.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nHudson, who also served as BioWare general manager before \u003ca href=\"https://www.eurogamer.net/casey-hudson-and-mark-darrah-announce-departure-from-bioware\"\u003edeparting the studio\u003c/a\u003e in 2020, \u003ca href=\"https://www.eurogamer.net/ex-bioware-boss-announces-new-studio-working-on-fresh-ip\"\u003eannounced\u003c/a\u003e the establishment of \u003ca href=\"https://humanoidorigin.com\"\u003eHumanoid Origin\u003c/a\u003e (initially Humanoid Studios) in June 2021, teasing it was working on an \u0026#34;all-new IP\u0026#34;. A year later, Hudson \u003ca href=\"https://www.eurogamer.net/mass-effect-director-casey-hudson-working-on-all-new-science-fiction-universe\"\u003eshared a little more information\u003c/a\u003e on the \u0026#34;multi-platform AAA game\u0026#34;, as well as early concept art, calling it a \u0026#34;character-driven narrative in an all-new science-fiction universe\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\nToday, however, Hudson \u003ca href=\"https://www.linkedin.com/posts/humanoid-origin_earlier-today-we-informed-our-staff-that-activity-7266889657370447874-9uwE/\"\u003ereleased a statement\u003c/a\u003e announcing the project\u0026#39;s termination and the closure of the studio. \u0026#34;Earlier today, we informed our staff that Humanoid Origin will be shutting down,\u0026#34; he wrote. \u0026#34;Despite efforts to shield the studio from broader challenges in the industry, an unexpected shortfall of funding left us unable to sustain operations.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;We\u0026#39;re heartbroken that we will not be able to bring our new science-fiction universe to completion,\u0026#34; Hudson continued. \u0026#34;Our main concern at this time however is for our team, and we are committed to supporting them in their transition to new employment. \n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;In our time together, the team achieved incredible progress, and demonstrated that it\u0026#39;s possible to do amazing work while fostering a culture of fun and creativity. We thank them for their talent, courage, and friendship. \n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;Thank you to everyone who supported us throughout our journey.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nHumanoid Origin is the latest studio to be impacted in what continues to be a devastating year for games industry employees, with \u003ca href=\"https://publish.obsidian.md/vg-layoffs/Archive/2024\"\u003eover 14,000 people estimated to have lost their jobs\u003c/a\u003e so far. That\u0026#39;s compared to the 10,500 games industry workers who were laid off across the entirety of 2023. Back in March, GamesIndustry.biz\u0026#39;s Chris Tring, writing for Eurogamer, took a \u003ca href=\"https://www.eurogamer.net/what-is-going-on-with-the-video-games-industry\"\u003ecloser look\u003c/a\u003e at the circumstances leading to such massive numbers of job cuts over the last few years.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-25T21:37:33.677048Z",
  "modifiedTime": null
}
