{
  "id": "350c050f-7791-4933-b452-5b0149b3b8c8",
  "title": "Save 40% Off the Sonos Era 100 Smart Speaker with Full Warranty Ahead of Amazon Prime Day",
  "link": "https://www.ign.com/articles/sonos-era-100-speaker-deal-early-amazon-prime-day-deal-2025",
  "description": "This is a like-new, pristine condition certified refurbished model from Sonos direct.",
  "author": "Eric Song",
  "published": "Thu, 3 Jul 2025 00:25:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Eric Song",
  "length": 3294,
  "excerpt": "This is a like-new, pristine condition certified refurbished model from Sonos direct.",
  "siteName": "IGN",
  "favicon": "",
  "text": "This is a like-new, pristine condition certified refurbished model from Sonos direct.Sonos is offering a fantastic deal on one of its most popular speakers. I think it's going to beat any Sonos deal we'll see during Amazon Prime Day. The Sonos Era 100 retails for $200. Normally, you could purchase a certified refurbished model for $159, but Sonos has jut discounted it even further to $119, or 40% off compared to the price of buying new. This is the lowest price I've seen for an Era 100 speaker. Sonos refurbished products are like new, include pristine packaging and all original accessories, and come with the same one year warranty as a brand new product.Sonos Era 100 Smart Speaker for $119Certified refurbished with 1 year Sonos warrantySonos Era 100 Smart SpeakerThe Sonos Era 100 is a direct improvement over the now discontinued Sonos One. This is a small standalone powered speaker that pumps out great sound for its small footprint. Unlike the Sonos Move or Roam, this is not a portable speaker with a built-in battery, so you'll need to leave it plugged in. Sound quality is equivalent to a Sonos Move, which isn't surprising considering they have similar internal components: two tweeters, a mid-woofer, and three class-D digital amps. The Era 100 also supports Dolby Atmos when it is paired with an Arc or Beam soundbar. It has a built-in microphone and can be voice controlled; it can also be used as a smart speaker for both Amazon Alexa and Google Assistant.More Sonos Certified Refurbished Deals for 4th of JulyWhy is Sonos so popular?Sonos is always on our list of best bookshelf speakers and best soundbars because they offer good sound, pleasing aesthetics, and easy setup in a reasonably priced package.Sound quality vs sizeDespite the fact that Sonos products are compact and don't take up much space in your house, they offer surprisingly loud and distortion-free audio. They're definitely pricier than budget options, but the sound quality is more akin to audio products that cost hundreds more or take up much more space.Easy setupSonos devices are usually simple plug and play. All you have to do is plug in a power cable (if even that's necessary) and one connection to your TV (if even that's necessary), download the Sonos app, and you're done. Generally a receiver isn't required; the soundbars are designed to plug right into your TV and the speakers are designed to work wirelessly. For something like a 5.1ch home theater setup, you don't have to deal with a mess of cables. Individual Sonos speakers can pair with your soundbar and be used as rear satellites, and the subwoofer is also wireless so it can be positioned virtually anywhere in your room.Communication between devicesPractically all Sonos speakers can communicate with each other. That means you can pair different Sonos speakers in different rooms for multi-room capability. Or you can pair two speakers for stereo output. Or you can pair speakers to your soundbar to be used as a 5.1ch setup. It's all seamlessly done through the app.Eric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn't hunting for deals for other people at work, he's hunting for deals for himself during his free time.Originally posted: Jul 3, 2025 12:25 am",
  "image": "https://assets-prd.ignimgs.com/2025/07/01/sonosera100-1751394677266.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp data-cy=\"page-header\"\u003e\u003ch2 data-cy=\"article-sub-headline\"\u003eThis is a like-new, pristine condition certified refurbished model from Sonos direct.\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003eSonos is offering a fantastic deal on one of its most popular speakers. I think it\u0026#39;s going to beat any Sonos deal we\u0026#39;ll see during \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/amazon-prime-day-2025-everything-we-know-so-far\"\u003eAmazon Prime Day\u003c/a\u003e. The Sonos Era 100 retails for $200. Normally, you could purchase a certified refurbished model for $159, but Sonos has jut discounted it even further to $119, or 40% off compared to the price of buying new. This is the lowest price I\u0026#39;ve seen for an Era 100 speaker. Sonos refurbished products are like new, include pristine packaging and all original accessories, and come with the same one year warranty as a brand new product.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eSonos Era 100 Smart Speaker for $119\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003e\u003cstrong\u003eCertified refurbished with 1 year Sonos warranty\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\u003cdiv catalogid=\"0341ca51-d525-4368-8c63-c9c9924200e5\" id=\"206684\"\u003e\u003cdiv id=\"206684\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003ca href=\"https://zdcs.link/9YW2P4?object_uuid=c0a70d05-db37-4402-9802-62e8732dac24\u0026amp;t=article\" title=\"Sonos Era 100 Smart Speaker\" target=\"_blank\" rel=\"nofollow\"\u003e\u003cimg decoding=\"async\" alt=\"Sonos Era 100 Smart Speaker\" src=\"https://assets-prd.ignimgs.com/2024/08/29/sonosera100-1724948385189.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eSonos Era 100 Smart Speaker\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThe Sonos Era 100 is a direct improvement over the now discontinued Sonos One. This is a small standalone powered speaker that pumps out great sound for its small footprint. Unlike the Sonos Move or Roam, this is \u003cu\u003enot\u003c/u\u003e a portable speaker with a built-in battery, so you\u0026#39;ll need to leave it plugged in. Sound quality is equivalent to a Sonos Move, which isn\u0026#39;t surprising considering they have similar internal components: two tweeters, a mid-woofer, and three class-D digital amps. The Era 100 also supports Dolby Atmos when it is paired with an Arc or Beam soundbar. It has a built-in microphone and can be voice controlled; it can also be used as a smart speaker for both Amazon Alexa and Google Assistant.\u003c/p\u003e\u003ch2 data-cy=\"title2\"\u003eMore Sonos Certified Refurbished Deals for 4th of July\u003c/h2\u003e\u003ch2 data-cy=\"title2\"\u003eWhy is Sonos so popular?\u003c/h2\u003e\u003cp data-cy=\"paragraph\"\u003eSonos is always on our list of \u003ca href=\"https://zdcs.link/4E6wL?object_uuid=c0a70d05-db37-4402-9802-62e8732dac24\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003ebest bookshelf speakers\u003c/a\u003e and \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-soundbar\"\u003ebest soundbars\u003c/a\u003e because they offer good sound, pleasing aesthetics, and easy setup in a reasonably priced package.\u003c/p\u003e\u003ch3 data-cy=\"title3\"\u003eSound quality vs size\u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003eDespite the fact that Sonos products are compact and don\u0026#39;t take up much space in your house, they offer surprisingly loud and distortion-free audio. They\u0026#39;re definitely pricier than budget options, but the sound quality is more akin to audio products that cost hundreds more or take up much more space.\u003c/p\u003e\u003ch3 data-cy=\"title3\"\u003eEasy setup\u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003eSonos devices are usually simple plug and play. All you have to do is plug in a power cable (if even that\u0026#39;s necessary) and one connection to your TV (if even that\u0026#39;s necessary), download the Sonos app, and you\u0026#39;re done. Generally a receiver isn\u0026#39;t required; the soundbars are designed to plug right into your TV and the speakers are designed to work wirelessly. For something like a 5.1ch home theater setup, you don\u0026#39;t have to deal with a mess of cables. Individual Sonos speakers can pair with your soundbar and be used as rear satellites, and the subwoofer is also wireless so it can be positioned virtually anywhere in your room.\u003c/p\u003e\u003ch3 data-cy=\"title3\"\u003eCommunication between devices\u003c/h3\u003e\u003cp data-cy=\"paragraph\"\u003ePractically all Sonos speakers can communicate  with each other. That means you can pair different Sonos speakers in different rooms for multi-room capability. Or you can pair two speakers for stereo output. Or you can pair speakers to your soundbar to be used as a 5.1ch setup. It\u0026#39;s all seamlessly done through the app.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003eEric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn\u0026#39;t hunting for deals for other people at work, he\u0026#39;s hunting for deals for himself during his free time.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv data-cy=\"caption\"\u003e\u003cp\u003eOriginally posted: Jul 3, 2025 12:25 am\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-03T00:25:00Z",
  "modifiedTime": "2025-07-03T00:25:49.058Z"
}
