{
  "id": "37d0a674-3d3c-404d-ae57-343f0d66f534",
  "title": "Side Adventure During the Great Tenerifis Migration",
  "link": "https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/",
  "description": "The big move ops, like the one this past weekend, are the main focus of the GSF lurch eastward, with thousands of ships being moved carefully between specific way points on the route to Tenerifis.  There have been a bunch of them, though not all of them get 4,000 capsuleers in a single system. But […]",
  "author": "Wilhelm Arcturus",
  "published": "Wed, 23 Oct 2024 13:15:58 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "EVE Online",
    "Null Sec",
    "18-GZM",
    "Delve",
    "Efa",
    "Q-S7ZD",
    "QBL-BV",
    "Saminer",
    "Tenerifis",
    "U-QVWD",
    "UALX-3"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 12594,
  "excerpt": "The big move ops, like the one this past weekend, are the main focus of the GSF lurch eastward, with thousands of ships being moved carefully between specific way points on the route to Tenerifis. …",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "The big move ops, like the one this past weekend, are the main focus of the GSF lurch eastward, with thousands of ships being moved carefully between specific way points on the route to Tenerifis.  There have been a bunch of them, though not all of them get 4,000 capsuleers in a single system. From Delve to the east But there are also a lot of little stories with this move as everybody has to get their stuff together and not everybody has the time or patience to follow the instructions for safe travel… or maybe didn’t even get those instructions.  With any operation at least 10% don’t get informed and a good percentage get a garbled version of the message. And every time you undock in EVE Online the potential for adventure is unlocked.  Hell, there is a bug currently that can throw you many AU from your station when you undock.  Instant adventure when you’re in a capital or a laden hauler!  (This is a common enough occurrence that we have a guide to reporting it as a bug.  It has happened to me twice during the move.) I have done my own share of moving stuff around, and most of it has been uneventful.  I try to keep that sort of thing to off hours on week days.  Solo moves are best done at low ebb. As I noted previously, one of the happy side effects of World War Bee is that everything I had in Fountain, Querious, or Delve got consolidated back into the 1DQ1-A Keepstar during the great siege of 1DQ. O-EIMK Constellation during the siege So aside from a ratting Ishtar off in another constellation and my PI farms, on which I did a last collection run before shutting them all off, there wasn’t much to do in Delve. I did still have some stuff in Aridia, the remains of me moving a bunch of stuff to NPC stations there with taking a long term break from EVE in mind.  That break never happened because that last Reavers deployment I went on turned into a year long campaign that end in the big faction Fortizar payoff.  That rejuvenated me and I hauled most, but not all, of that stuff back to Delve. I also found some time to zip over into Curse to pick up some ships I had left there back during World War Bee… and before… as part of Reavers deployments.  I slipped an Ishtar and a Scimitar and a Purifier back to U-QVWD, which is on the route to UALX-3.  I will pick them up on the way when the next round of move ops start. But one evening in that first week when I was feeling anxious about getting stuff moving, my angst was dialed up a bit when a move op aimed at getting expensive pods safely to UALX-3 changed from being run with black ops ships to using a Rorqual.  That swap happened when I already had my pod seated in a blockade runner… a blockade runner filled with 12 billion ISK of stuff like implants, SKINs, and boosters that I wanted to slip through because it was an FC I absolutely trusted to keep us safe. When the swap happened it was suggested that blockade runners would still work, so I got out on the Rorqual and watched the bridge go up. The Rorqual bridge is up However, as I feared, Rorquals can only bridge mining ships.  I got the message that indicated I would not be going in the blockade runner. No bridge for you Now, most people going on that op had just grabbed a Venture, the base mining frigate, to go along for the ride.  And I even had a Prospect, the gas mining version I setup when I thought I might go gas mining, so could have just swapped to that.  But I also had 4 hours of blue timer jump fatigue, and mining ships don’t get the jump fatigue discount that industrials like my blockade runner do.  So I would have had annoyingly long jump timers that would have either slowed everybody down, which I did not want to do, or end up with me being left behind. So I stood down, left fleet, and brooded a bit on what to do next. Later that evening, after my blue timer had wound down, I was looking at DOTLAN and the jump planner to try and guess how the proposed black ops version of that move would have gone and, decided that I could manage that on my own.  It was after dinner, after television, and into that gap of time before bed when one should absolutely NOT start on some new project… and also in the time frame when my brain thinks it is the optimum time to do some complex operation of unknown duration like migrating my wife’s computer to Windows 11 or updating the bios on my motherboard. So I decided I could get my expensive pod and my blockade runner full of expensive stuff to UALX-3 all on my own.  Or at least I could get the operation started.  Even my brain knew that this could take some time, the waking hours were fading, and I had to get up for work in the morning. It would be easy. I had two black ops battleships in 1DQ.  One was a Redeemer, which is the current homeland defense doctrine, and one was a Sin, the fat Gallente black ops battleship based on the Dominix.  That was a now out of date doctrine.  But it was a tough ship and could bridge, and more importantly, conduit jump to a covert cyno. I traded the blockade runner full of booty to my main combat alt, who had all the skills to do either that or the black ops side of things.  That would be the traveling pair.  The Crane, the blockade runner, would just get on the Sin, and the Sin would conduit jump, which would take them both across space together to dock up or safe up before the next jump. The detail was that I needed somebody to light the covert cyno.  As it turned out, one of my accounts then unsubscribed, has a character who could do that.  So I resubbed that account.  He was in Amarr, so I had him fit out a black ops hunting Buzzard covert ops frigate, which has the benefit of being configured to get through trouble and warp at 16 AU a second.  He bought that then zipped on down to the first location that DOTLAN gave me for the navigation route. The path to low sec The first stop was in NPC Delve and my alt was in KarmaFleet (he had been acting as my alpha homeland defense fleet character) so he wasn’t in much danger.  He got on the Fortizar in the system, lit the cyno, and my blops did a conduit jump and we were all there together.  First transport away! The second stop was in Brave space and, again, there was a citadel to sit on.  I let the jump timer run down then it was off to the second landing. Efa, the third stop, was easy as well.  A low sec system with no station, the coalition has a Fortizar there as well as it connects Querious to high sec.  It is just a gate from Badivefi, one of the Reaver home stations in the early days. All three stops had only friends and allies in system.  Piece of cake. The my alt, Claude Ring, headed around Saminer, which took a bit even with fast warps.  But that was fine.  With three quick jumps I was already up at the 5 hour blue timer which gave me a nearly 30 minute red timer before I could jump again. Saminer is another low sec system, but it has a station.  I made a safe spot out in the system, put up the cyno, and conduit jumped for the fourth time.  Then the Sin and the Crane docked up and I was considering calling it a night there.  The game log showed the time taken for each jump. 04:53:48 – A Conduit Field activated by Wilhelm Arcturus jumps you to Z3V-1W. 05:00:08 – A Conduit Field activated by Wilhelm Arcturus jumps you to 1M4-FK. 05:12:41 – A Conduit Field activated by Wilhelm Arcturus jumps you to Efa. 05:28:18 – A Conduit Field activated by Wilhelm Arcturus jumps you to Saminer. That could have been enough for one night.  I could have left the back half of the journey for another time.  But then I looked at the route. The second half of the route I mean, it wasn’t too late yet, so I decided to get Claude down to the next way point, all the better to be ready to go when I picked things back up. That took a bit and sent me into null sec in Providence.  Provi alliances have traditionally had an NRDS policy, which is “not red, don’t shoot” which means they don’t shoot random neutrals in their space.  This is in opposition to the stance of most null sec groups, which is NBSI or “not blue, shoot it” so anybody not part of the group is a target.  We don’t trust neutrals to be neutral. (You can read more about standings here.) Anyway, DOTLAN sent me down to the off the main route system of 18-GZM, which is held by an alliance called LinkNet, which has over 1,500 members according to the site.  There didn’t seem to be many on, and the system I ended up in was empty.  So I made a safe spot. Then I figured that the jump timer had probably run down on Wilhelm and I was there already, I should probably just make that next jump.  Why not be one more jump along?  So I logged everybody back in, formed another fleet, put up the cyno again, and jumped them. 05:48:23 – A Conduit Field activated by Wilhelm Arcturus jumps you to 18-GZM. I moved them off a bit, cloaked them up, then safe logged them both out of the game.  Easy. Might as well move Claude to the next system, right? Then my wife asked if I wasn’t coming to bed could I turn the light out on my side of the bed, as she wanted to go to sleep.  I did that, got a glass of water, and a few other things that moved the clock forward, so that when I got back to the game and have moved Claude to the next system, QBL-BV… well, the jump timer was about ready to go, right?  Might as well. This was another group’s space, Reeloaded, and they had a citadel there and there were a couple of them online… but nobody bothered me. I did the conduit jump. 06:14:15 – A Conduit Field activated by Wilhelm Arcturus jumps you to QBL-BV. Still, I felt a bit seen so logged the jumping pair out and moved forward to the next stop, which was JWZ2-V in Catch. That was more than a few gates and through the incursion that had set up shop in Catch and which, at that point, was blocking progress for normal capitals and supers in the move towards UALX-3.  One aspect of an incursion is that it cyno jams the system.  No jumps.  I might be done moving forward for a while. But then I ended up on the far side of the incursion and there was nobody on and by this point I was feeling like the quietness of the night was an opportunity not to be wasted, so I made it to the way point and docked up in the Fortizar there, which was anchored at the sun. Placed for optimum solar panel efficiency Again, this had take a bit, so I logged on the two travelers, got them in fleet again and made the next jump. 06:42:58 – A Conduit Field activated by Wilhelm Arcturus jumps you to Q-S7ZD. That put me at close to midnight local time with another nearly 30 minute jump timer.  But I was safe in an alliance Fortizar and just one jump away from the destination.  After that jump I logged the two travelers off one last time for the night, drove Claude to UALX-3 to be ready for the next day. Somewhere along the way on that last leg I went through a system with an orange sun that painted a gas giant against the sky in what I felt was quite the dramatic fashion. A burnt orange sky and sun and the speck of a jump gate It might have been the one with the Fortizar, I do not remember.  It was time stamed 10 minutes after the one above… so maybe, if above was my arrival shot.  That was it for the night, everybody was docked up and I finally went to bed, close to two hours later than my usual time. Proof that I am old and never pay the price for staying up late (because I don’t sleep well in any case so how could I possibly tell), I got up at the usual “before my alarm clock goes off” time and, as I had something for breakfast, logged the whole group back in, and lit the covert cyno again, this time between the uprights of the Keepstar. The cyno is lit One last jump and I had arrived. 14:03:51- A Conduit Field activated by Wilhelm Arcturus jumps you to UALX-3. All of which is kind of a dull story in retrospect.  I didn’t get into any trouble or do anything spectacularly wrong, like jumping to a hostile cyno beacon.  On the other hand, I did undock a lot more than I could afford to replace. And I know the whole trip made me tense because I took three screen shots along the way, the three I posted above.  I am usually a complete tourist, taking screen shots of the sky, stations, my ships, and what not.  When I don’t do that it is usually because I am focused on the mission at hand. Anyway, it was probably a wasted effort.  By the time the weekend came around we had the big move through the regional gate and most everything I had ended up in Catch and ready to move safely.  Even the incursion is gone.  But sometimes I seem to need to undock and do something like this.",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eThe big move ops, \u003ca href=\"https://tagn.wordpress.com/2024/10/20/two-weeks-into-the-great-tenerifis-migration-taking-the-regional-gate/\"\u003elike the one this past weekend\u003c/a\u003e, are the main focus of the GSF lurch eastward, with thousands of ships being moved carefully between specific way points on the route to Tenerifis.  There have been a bunch of them, though not all of them get 4,000 capsuleers in a single system.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_123572\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/delvetotenerifis.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-123572\" data-attachment-id=\"123572\" data-permalink=\"https://tagn.wordpress.com/2024/10/06/goonswarm-federation-is-leaving-delve-for-tenerifis/delvetotenerifis/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/delvetotenerifis.png\" data-orig-size=\"1745,864\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"DelveToTenerifis\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;From Delve to the east\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/delvetotenerifis.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/delvetotenerifis.png?w=600\" tabindex=\"0\" role=\"button\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/delvetotenerifis.png?w=600\" alt=\"\" width=\"600\" height=\"297\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-123572\"\u003eFrom Delve to the east\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eBut there are also a lot of little stories with this move as everybody has to get their stuff together and not everybody has the time or patience to follow the instructions for safe travel… or maybe didn’t even get those instructions.  With any operation at least 10% don’t get informed and a good percentage get a garbled version of the message.\u003c/p\u003e\n\u003cp\u003eAnd every time you undock in \u003cem\u003eEVE Online\u003c/em\u003e the potential for adventure is unlocked.  Hell, there is a bug currently that can throw you many AU from your station when you undock.  Instant adventure when you’re in a capital or a laden hauler!  (This is a common enough occurrence that we have a \u003ca href=\"https://imgur.com/tmKrMLo\"\u003eguide to reporting it as a bug\u003c/a\u003e.  It has happened to me twice during the move.)\u003c/p\u003e\n\u003cp\u003eI have done my own share of moving stuff around, and most of it has been uneventful.  I try to keep that sort of thing to off hours on week days.  Solo moves are best done at low ebb.\u003c/p\u003e\n\u003cp\u003eAs I noted previously, one of the happy side effects of World War Bee is that everything I had in Fountain, Querious, or Delve got consolidated back into the 1DQ1-A Keepstar during the great siege of 1DQ.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_90008\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2021/05/wwb79_imperiumcapitolconstellation.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-90008\" data-attachment-id=\"90008\" data-permalink=\"https://tagn.wordpress.com/2021/05/03/43-weeks-of-world-war-bee/wwb79_imperiumcapitolconstellation/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2021/05/wwb79_imperiumcapitolconstellation.png\" data-orig-size=\"332,398\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"WWB79_ImperiumCapitolConstellation\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;O-EIMK Constellation – May 30, 2021\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2021/05/wwb79_imperiumcapitolconstellation.png?w=332\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2021/05/wwb79_imperiumcapitolconstellation.png?w=332\" tabindex=\"0\" role=\"button\" src=\"https://tagn.wordpress.com/wp-content/uploads/2021/05/wwb79_imperiumcapitolconstellation.png\" alt=\"\" width=\"332\" height=\"398\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-90008\"\u003eO-EIMK Constellation during the siege\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eSo aside from a ratting Ishtar off in another constellation and my PI farms, on which I did a last collection run before shutting them all off, there wasn’t much to do in Delve.\u003c/p\u003e\n\u003cp\u003eI did still have some stuff in Aridia, the remains of me moving a bunch of stuff to NPC stations there with taking a long term break from \u003cem\u003eEVE\u003c/em\u003e in mind.  That break never happened because that last Reavers deployment I went on turned into a year long campaign that end in \u003ca href=\"https://tagn.wordpress.com/2018/09/20/the-war-in-the-north-ends-with-a-payoff/\"\u003ethe big faction Fortizar payoff\u003c/a\u003e.  That rejuvenated me and I hauled most, but not all, of that stuff back to Delve.\u003c/p\u003e\n\u003cp\u003eI also found some time to zip over into Curse to pick up some ships I had left there back during World War Bee… and before… as part of Reavers deployments.  I slipped an Ishtar and a Scimitar and a Purifier back to U-QVWD, which is on the route to UALX-3.  I will pick them up on the way when the next round of move ops start.\u003c/p\u003e\n\u003cp\u003eBut one evening in that first week when I was feeling anxious about getting stuff moving, my angst was dialed up a bit when a move op aimed at getting expensive pods safely to UALX-3 changed from being run with black ops ships to using a Rorqual.  That swap happened when I already had my pod seated in a blockade runner… a blockade runner filled with 12 billion ISK of stuff like implants, SKINs, and boosters that I wanted to slip through because it was an FC I absolutely trusted to keep us safe.\u003c/p\u003e\n\u003cp\u003eWhen the swap happened it was suggested that blockade runners would still work, so I got out on the Rorqual and watched the bridge go up.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124041\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_rorqualjump.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-124041\" data-attachment-id=\"124041\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_rorqualjump/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_rorqualjump.jpg\" data-orig-size=\"1277,739\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_RorqualJump\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The Rorqual bridge is up\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_rorqualjump.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_rorqualjump.jpg?w=600\" tabindex=\"0\" role=\"button\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_rorqualjump.jpg?w=600\" alt=\"\" width=\"600\" height=\"347\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124041\"\u003eThe Rorqual bridge is up\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eHowever, as I feared, Rorquals can only bridge mining ships.  I got the message that indicated I would not be going in the blockade runner.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124040\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_portaltechnology.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-124040\" data-attachment-id=\"124040\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_portaltechnology/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_portaltechnology.png\" data-orig-size=\"298,57\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_PortalTechnology\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;No bridge for you\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_portaltechnology.png?w=298\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_portaltechnology.png?w=298\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_portaltechnology.png\" alt=\"\" width=\"298\" height=\"57\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124040\"\u003eNo bridge for you\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eNow, most people going on that op had just grabbed a Venture, the base mining frigate, to go along for the ride.  And I even had a \u003ca href=\"https://wiki.eveuniversity.org/Prospect\"\u003eProspect\u003c/a\u003e, the gas mining version I setup when I thought I might go gas mining, so could have just swapped to that.  But I also had 4 hours of blue timer jump fatigue, and mining ships don’t get the jump fatigue discount that industrials like my blockade runner do.  So I would have had annoyingly long jump timers that would have either slowed everybody down, which I did not want to do, or end up with me being left behind.\u003c/p\u003e\n\u003cp\u003eSo I stood down, left fleet, and brooded a bit on what to do next.\u003c/p\u003e\n\u003cp\u003eLater that evening, after my blue timer had wound down, I was looking at DOTLAN and the jump planner to try and guess how the proposed black ops version of that move would have gone and, decided that I could manage that on my own.  It was after dinner, after television, and into that gap of time before bed when one should absolutely NOT start on some new project… and also in the time frame when my brain thinks it is the optimum time to do some complex operation of unknown duration like migrating my wife’s computer to Windows 11 or updating the bios on my motherboard.\u003c/p\u003e\n\u003cp\u003eSo I decided I could get my expensive pod and my blockade runner full of expensive stuff to UALX-3 all on my own.  Or at least I could get the operation started.  Even my brain knew that this could take some time, the waking hours were fading, and I had to get up for work in the morning.\u003c/p\u003e\n\u003cp\u003eIt would be easy.\u003c/p\u003e\n\u003cp\u003eI had two black ops battleships in 1DQ.  One was a Redeemer, which is the current homeland defense doctrine, and one was a Sin, the fat Gallente black ops battleship based on the Dominix.  That was a now out of date doctrine.  But it was a tough ship and could bridge, and more importantly, conduit jump to a covert cyno.\u003c/p\u003e\n\u003cp\u003eI traded the blockade runner full of booty to my main combat alt, who had all the skills to do either that or the black ops side of things.  That would be the traveling pair.  The Crane, the blockade runner, would just get on the Sin, and the Sin would conduit jump, which would take them both across space together to dock up or safe up before the next jump.\u003c/p\u003e\n\u003cp\u003eThe detail was that I needed somebody to light the covert cyno.  As it turned out, one of my accounts then unsubscribed, has a character who could do that.  So I resubbed that account.  He was in Amarr, so I had him fit out a black ops hunting Buzzard covert ops frigate, which has the benefit of being configured to get through trouble and warp at 16 AU a second.  He bought that then zipped on down to the first location that DOTLAN gave me for the navigation route.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124048\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_firsthalfofroute.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-124048\" data-attachment-id=\"124048\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_firsthalfofroute/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_firsthalfofroute.png\" data-orig-size=\"939,556\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_FirstHalfOfRoute\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The path to low sec\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_firsthalfofroute.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_firsthalfofroute.png?w=600\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_firsthalfofroute.png?w=600\" alt=\"\" width=\"600\" height=\"355\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124048\"\u003eThe path to low sec\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThe first stop was in NPC Delve and my alt was in KarmaFleet (he had been acting as my alpha homeland defense fleet character) so he wasn’t in much danger.  He got on the Fortizar in the system, lit the cyno, and my blops did a conduit jump and we were all there together.  First transport away!\u003c/p\u003e\n\u003cp\u003eThe second stop was in Brave space and, again, there was a citadel to sit on.  I let the jump timer run down then it was off to the second landing.\u003c/p\u003e\n\u003cp\u003eEfa, the third stop, was easy as well.  A low sec system with no station, the coalition has a Fortizar there as well as it connects Querious to high sec.  It is just a gate from Badivefi, one of the Reaver home stations in the early days.\u003c/p\u003e\n\u003cp\u003eAll three stops had only friends and allies in system.  Piece of cake.\u003c/p\u003e\n\u003cp\u003eThe my alt, Claude Ring, headed around Saminer, which took a bit even with fast warps.  But that was fine.  With three quick jumps I was already up at the 5 hour blue timer which gave me a nearly 30 minute red timer before I could jump again.\u003c/p\u003e\n\u003cp\u003eSaminer is another low sec system, but it has a station.  I made a safe spot out in the system, put up the cyno, and conduit jumped for the fourth time.  Then the Sin and the Crane docked up and I was considering calling it a night there.  The game log showed the time taken for each jump.\u003c/p\u003e\n\u003cp\u003e04:53:48 – A Conduit Field activated by Wilhelm Arcturus jumps you to Z3V-1W.\u003cbr/\u003e\n05:00:08 – A Conduit Field activated by Wilhelm Arcturus jumps you to 1M4-FK.\u003cbr/\u003e\n05:12:41 – A Conduit Field activated by Wilhelm Arcturus jumps you to Efa.\u003cbr/\u003e\n05:28:18 – A Conduit Field activated by Wilhelm Arcturus jumps you to Saminer.\u003c/p\u003e\n\u003cp\u003eThat could have been enough for one night.  I could have left the back half of the journey for another time.  But then I looked at the route.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124050\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_secondhalfofroute.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-124050\" data-attachment-id=\"124050\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_secondhalfofroute/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_secondhalfofroute.png\" data-orig-size=\"907,467\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_SecondHalfOfRoute\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The second half of the route\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_secondhalfofroute.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_secondhalfofroute.png?w=600\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_secondhalfofroute.png?w=600\" alt=\"\" width=\"600\" height=\"309\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124050\"\u003eThe second half of the route\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI mean, it wasn’t too late yet, so I decided to get Claude down to the next way point, all the better to be ready to go when I picked things back up.\u003c/p\u003e\n\u003cp\u003eThat took a bit and sent me into null sec in Providence.  Provi alliances have traditionally had an NRDS policy, which is “not red, don’t shoot” which means they don’t shoot random neutrals in their space.  This is in opposition to the stance of most null sec groups, which is NBSI or “not blue, shoot it” so anybody not part of the group is a target.  We don’t trust neutrals to be neutral. (You can read \u003ca href=\"https://wiki.eveuniversity.org/Corporation_diplomacy\"\u003emore about standings here\u003c/a\u003e.)\u003c/p\u003e\n\u003cp\u003eAnyway, DOTLAN sent me down to the off the main route system of \u003ca href=\"https://evemaps.dotlan.net/map/Providence/18-GZM#ihub\"\u003e18-GZM\u003c/a\u003e, which is held by an alliance called \u003ca href=\"https://evemaps.dotlan.net/alliance/LinkNet\"\u003eLinkNet\u003c/a\u003e, which has over 1,500 members according to the site.  There didn’t seem to be many on, and the system I ended up in was empty.  So I made a safe spot.\u003c/p\u003e\n\u003cp\u003eThen I figured that the jump timer had probably run down on Wilhelm and I was there already, I should probably just make that next jump.  Why not be one more jump along?  So I logged everybody back in, formed another fleet, put up the cyno again, and jumped them.\u003c/p\u003e\n\u003cp\u003e05:48:23 – A Conduit Field activated by Wilhelm Arcturus jumps you to 18-GZM.\u003c/p\u003e\n\u003cp\u003eI moved them off a bit, cloaked them up, then safe logged them both out of the game.  Easy.\u003c/p\u003e\n\u003cp\u003eMight as well move Claude to the next system, right?\u003c/p\u003e\n\u003cp\u003eThen my wife asked if I wasn’t coming to bed could I turn the light out on my side of the bed, as she wanted to go to sleep.  I did that, got a glass of water, and a few other things that moved the clock forward, so that when I got back to the game and have moved Claude to the next system, \u003ca href=\"https://evemaps.dotlan.net/map/Providence/QBL-BV#ihub\"\u003eQBL-BV\u003c/a\u003e… well, the jump timer was about ready to go, right?  Might as well.\u003c/p\u003e\n\u003cp\u003eThis was another group’s space, \u003ca href=\"https://evemaps.dotlan.net/alliance/Reeloaded.\"\u003eReeloaded\u003c/a\u003e, and they had a citadel there and there were a couple of them online… but nobody bothered me. I did the conduit jump.\u003c/p\u003e\n\u003cp\u003e06:14:15 – A Conduit Field activated by Wilhelm Arcturus jumps you to QBL-BV.\u003c/p\u003e\n\u003cp\u003eStill, I felt a bit seen so logged the jumping pair out and moved forward to the next stop, which was \u003ca href=\"https://evemaps.dotlan.net/map/Catch/JWZ2-V#ihub\"\u003eJWZ2-V\u003c/a\u003e in Catch.\u003c/p\u003e\n\u003cp\u003eThat was more than a few gates and through the incursion that had set up shop in Catch and which, at that point, was blocking progress for normal capitals and supers in the move towards UALX-3.  One aspect of an incursion is that it cyno jams the system.  No jumps.  I might be done moving forward for a while.\u003c/p\u003e\n\u003cp\u003eBut then I ended up on the far side of the incursion and there was nobody on and by this point I was feeling like the quietness of the night was an opportunity not to be wasted, so I made it to the way point and docked up in the Fortizar there, which was anchored at the sun.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124060\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_sunfort.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-124060\" data-attachment-id=\"124060\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_sunfort/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_sunfort.jpg\" data-orig-size=\"2860,1340\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_SunFort\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Placed for optimum solar panel efficiency \u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_sunfort.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_sunfort.jpg?w=600\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_sunfort.jpg?w=600\" alt=\"\" width=\"600\" height=\"281\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124060\"\u003ePlaced for optimum solar panel efficiency\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eAgain, this had take a bit, so I logged on the two travelers, got them in fleet again and made the next jump.\u003c/p\u003e\n\u003cp\u003e06:42:58 – A Conduit Field activated by Wilhelm Arcturus jumps you to Q-S7ZD.\u003c/p\u003e\n\u003cp\u003eThat put me at close to midnight local time with another nearly 30 minute jump timer.  But I was safe in an alliance Fortizar and just one jump away from the destination.  After that jump I logged the two travelers off one last time for the night, drove Claude to UALX-3 to be ready for the next day.\u003c/p\u003e\n\u003cp\u003eSomewhere along the way on that last leg I went through a system with an orange sun that painted a gas giant against the sky in what I felt was quite the dramatic fashion.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124062\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-124062\" data-attachment-id=\"124062\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/ep_orangegasplanetgate/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg\" data-orig-size=\"2860,1340\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"EP_OrangeGasPlanetGate\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Orange sky and sun and the speck of a jump gate\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg?w=600\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/ep_orangegasplanetgate.jpg?w=600\" alt=\"\" width=\"600\" height=\"281\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124062\"\u003eA burnt orange sky and sun and the speck of a jump gate\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIt might have been the one with the Fortizar, I do not remember.  It was time stamed 10 minutes after the one above… so maybe, if above was my arrival shot.  That was it for the night, everybody was docked up and I finally went to bed, close to two hours later than my usual time.\u003c/p\u003e\n\u003cp\u003eProof that I am old and never pay the price for staying up late (because I don’t sleep well in any case so how could I possibly tell), I got up at the usual “before my alarm clock goes off” time and, as I had something for breakfast, logged the whole group back in, and lit the covert cyno again, this time between the uprights of the Keepstar.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_124061\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_covertcynolit.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-124061\" data-attachment-id=\"124061\" data-permalink=\"https://tagn.wordpress.com/2024/10/23/side-adventure-during-the-great-tenerifis-migration/tf02_covertcynolit/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_covertcynolit.jpg\" data-orig-size=\"2285,1110\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"TF02_CovertCynoLit\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The cyno is lit\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_covertcynolit.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_covertcynolit.jpg?w=600\" tabindex=\"0\" role=\"button\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2024/10/tf02_covertcynolit.jpg?w=600\" alt=\"\" width=\"600\" height=\"291\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-124061\"\u003eThe cyno is lit\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eOne last jump and I had arrived.\u003c/p\u003e\n\u003cp\u003e14:03:51- A Conduit Field activated by Wilhelm Arcturus jumps you to UALX-3.\u003c/p\u003e\n\u003cp\u003eAll of which is kind of a dull story in retrospect.  I didn’t get into any trouble or do anything spectacularly wrong, like \u003ca href=\"https://tagn.wordpress.com/2024/07/13/averting-a-black-ops-disaster/\"\u003ejumping to a hostile cyno beacon\u003c/a\u003e.  On the other hand, I did undock a lot more than I could afford to replace.\u003c/p\u003e\n\u003cp\u003eAnd I know the whole trip made me tense because I took three screen shots along the way, the three I posted above.  I am usually a complete tourist, taking screen shots of the sky, stations, my ships, and what not.  When I don’t do that it is usually because I am focused on the mission at hand.\u003c/p\u003e\n\u003cp\u003eAnyway, it was probably a wasted effort.  By the time the weekend came around we had the big move through the regional gate and most everything I had ended up in Catch and ready to move safely.  Even the incursion is gone.  But sometimes I seem to need to undock and do something like this.\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2024-10-23T13:15:58Z",
  "modifiedTime": "2024-10-24T14:12:44Z"
}
