{
  "id": "39670a8d-fdd1-4895-9d58-ba73146c148e",
  "title": "How To Get Into Path Of Exile 2 Early Access",
  "link": "https://www.gamespot.com/articles/how-to-get-into-path-of-exile-2-early-access/1100-6527842/?ftag=CAD-01-10abi2f",
  "description": "Path of Exile 2 is out now in early access ahead of its 1.0 launch in the future. Naturally, that means the game will change a lot over the months ahead. While the ARPG will feature three acts of the campaign, a portion of the 12 classes, and additional content, there's still more to come as time goes on. Though the early access version of Path of Exile 2 went live on December 6, there is a key stipulation to gaining access; the game will eventually be free-to-play, but to play during the early access period, you'll need to pay up.You can find out how much you need to pay and other details about Path of Exile 2's launch in the guide below.How much is Path of Exile 2 Early Access?Early access to Path of Exile 2 costs some money.The early access version of Path of Exile 2 costs $30. That $30 is spent on an Early Access Supporter Pack, which gives you a Path of Exile 2 early access key as well as 300 Points and the extended digital soundtrack. The Points can be used to purchase items in the Path of Exile 2 shop and are technically a $30 value on their own.Continue Reading at GameSpot",
  "author": "",
  "published": "Wed, 08 Jan 2025 14:25:00 -0800",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "Joey Carr",
  "length": 8916,
  "excerpt": "Path of Exile 2 will allow players to access the game early, but only if specific steps are followed.",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. Path of Exile 2 is out now in early access ahead of its 1.0 launch in the future. Naturally, that means the game will change a lot over the months ahead. While the ARPG will feature three acts of the campaign, a portion of the 12 classes, and additional content, there's still more to come as time goes on. Though the early access version of Path of Exile 2 went live on December 6, there is a key stipulation to gaining access; the game will eventually be free-to-play, but to play during the early access period, you'll need to pay up.You can find out how much you need to pay and other details about Path of Exile 2's launch in the guide below.How much is Path of Exile 2 Early Access?Early access to Path of Exile 2 costs some money.The early access version of Path of Exile 2 costs $30. That $30 is spent on an Early Access Supporter Pack, which gives you a Path of Exile 2 early access key as well as 300 Points and the extended digital soundtrack. The Points can be used to purchase items in the Path of Exile 2 shop and are technically a $30 value on their own.Of course, the $30 Supporter Pack is the cheapest of the available packs. It's all you need to gain entry to the early access build, but there are more glamorous options you can purchase as well. These more expensive packs still come with an early access key but also include a number of exclusive microtransactions, cosmetics, and even some physical items. You can see what each Supporter Pack offers below:Lord of Ogham Supporter ($60)600 PointsLord of Ogham Supporter Forum TitleLord of Ogham Portrait FrameExtended Digital Soundtrack DownloadPath of Exile 2 Early Access or Path of Exile 2 KeyLord of Ogham Armour PackLord of Ogham Back AttachmentBaby Crowbell PetThe Rust King Portal EffectIron Count's ZweihanderLord of Ogham Kiwi PetCommemorative Hillock Statue Hideout DecorationKing of the Faridun Supporter ($100)1,000 PointsKing of the Faridun Supporter Forum TitleKing of the Faridun Portrait FrameLord of Ogham Portrait FrameExtended Digital Soundtrack DownloadPath of Exile 2 Early Access or Path of Exile 2 KeyKing of the Faridun Armour PackLord of Ogham Armour PackKing of the Faridun Back AttachmentLord of Ogham Back AttachmentBaby Crowbell PetThe Rust King Portal EffectIron Count's ZweihanderKing of the Faridun Kiwi PetLord of Ogham Kiwi PetCommemorative Vaal Oversoul Statue Hideout DecorationCommemorative Hillock Statue Hideout DecorationThe Dreadnought HideoutTyranny's End Spear SkinFaridun's Glory Bow SkinDeshret's Blessing Level-up Extra EffectAn example of some of the contents in the King of Faridun Supporter Pack.Thaumaturge of the Vaal Supporter ($160 + Shipping)1,600 PointsThaumaturge of the Vaal Supporter Forum TitleThaumaturge of the Vaal Portrait FrameKing of the Faridun Portrait FrameLord of Ogham Portrait FrameExtended Digital Soundtrack Download+1 Path of Exile 2 Early Access KeyPath of Exile 2 Early Access or Path of Exile 2 KeyThaumaturge of the Vaal Armour PackKing of the Faridun Armour PackLord of Ogham Armour PackThaumaturge of the Vaal Back AttachmentKing of the Faridun Back AttachmentLord of Ogham Back AttachmentBaby Crowbell PetThe Rust King Portal EffectIron Count's ZweihanderThaumaturge of the Vaal Kiwi PetKing of the Faridun Kiwi PetLord of Ogham Kiwi PetCommemorative Dominus Statue Hideout DecorationCommemorative Vaal Oversoul Statue Hideout DecorationCommemorative Hillock Statue Hideout DecorationThe Dreadnought HideoutTyranny's End Spear SkinFaridun's Glory Bow SkinDeshret's Blessing Level-up Extra EffectSoulcore Weapon EffectDoryani's Idol Focus or Shield SkinWand of the Thaumaturge SkinRoyal Sacrifical Dagger SkinPath of Exile 2 Logo T-Shirt(Optional) 160 Points instead of physical itemsWarlord of the Karui Supporter ($260 + Shipping)2,400 PointsWarlord of the Karui Supporter Forum TitleWarlord of the Karui Portrait FrameThaumaturge of the Vaal Portrait FrameKing of the Faridun Portrait FrameLord of Ogham Portrait FrameExtended Digital Soundtrack Download+1 Path of Exile 2 Early Access Key+1 Path of Exile 2 Early Access KeyPath of Exile 2 Early Access or Path of Exile 2 KeyWarlord of the Karui Armour PackThaumaturge of the Vaal Armour PackKing of the Faridun Armour PackLord of Ogham Armour PackWarlord of the Karui Alternate HelmetWarlord of the Karui Back AttachmentThaumaturge of the Vaal Back AttachmentKing of the Faridun Back AttachmentLord of Ogham Back AttachmentBaby Crowbell PetThe Rust King Portal EffectIron Count's ZweihanderWarlord of the Karui Kiwi PetThaumaturge of the Vaal Kiwi PetKing of the Faridun Kiwi PetLord of Ogham Kiwi PetCommemorative Malachai Statue Hideout DecorationCommemorative Dominus Statue Hideout DecorationCommemorative Vaal Oversoul Statue Hideout DecorationCommemorative Hillock Statue Hideout DecorationThe Dreadnought HideoutTyranny's End Spear SkinFaridun's Glory Bow SkinDeshret's Blessing Level-up Extra EffectSoulcore Weapon EffectDoryani's Idol Focus or Shield SkinWand of the Thaumaturge SkinRoyal Sacrifical Dagger SkinKarui Totemcaller Rare Finisher EffectAncestral Canoe Crafting Bench DecorationAkoya's Felling Axe SkinTukohama's Crusher Mace SkinPath of Exile 2 Logo HoodiePath of Exile 2 Logo T-Shirt(Optional) 660 Points instead of physical itemsLiberator of Wraeclast Supporter ($480 + Shipping)4,800 PointsLiberator of Wraeclast Supporter Forum TitleLiberator of Wraeclast Portrait FrameWarlord of the Karui Portrait FrameThaumaturge of the Vaal Portrait FrameKing of the Faridun Portrait FrameLord of Ogham Portrait FrameExtended Digital Soundtrack Download+2 Path of Exile 2 Early Access Keys+1 Path of Exile 2 Early Access Key+1 Path of Exile 2 Early Access KeyPath of Exile 2 Early Access or Path of Exile 2 KeyLiberator of Wraeclast Armour PackWarlord of the Karui Armour PackThaumaturge of the Vaal Armour PackKing of the Faridun Armour PackLord of Ogham Armour PackLiberator of Wraeclast Helmet AttachmentWarlord of the Karui Alternate HelmetLiberator of Wraeclast Back AttachmentWarlord of the Karui Back AttachmentThaumaturge of the Vaal Back AttachmentKing of the Faridun Back AttachmentLord of Ogham Back AttachmentBaby Crowbell PetWindow to Twilight Portal EffectThe Rust King Portal EffectIron Count's ZweihanderLiberator of Wraeclast Kiwi PetWarlord of the Karui Kiwi PetThaumaturge of the Vaal Kiwi PetKing of the Faridun Kiwi PetLord of Ogham Kiwi PetCommemorative Kitava Statue Hideout DecorationCommemorative Malachai Statue Hideout DecorationCommemorative Dominus Statue Hideout DecorationCommemorative Vaal Oversoul Statue Hideout DecorationCommemorative Hillock Statue Hideout DecorationBeacon of Salvation HideoutThe Dreadnought HideoutTyranny's End Spear SkinFaridun's Glory Bow SkinDeshret's Blessing Level-up Extra EffectSoulcore Weapon EffectDoryani's Idol Focus or Shield SkinWand of the Thaumaturge SkinRoyal Sacrifical Dagger SkinKarui Totemcaller Rare Finisher EffectAncestral Canoe Crafting Bench DecorationAkoya's Felling Axe SkinTukohama's Crusher Mace SkinDeliverance Crossbow SkinJustice Flail SkinRedemption Shield SkinLight of Divinity Sceptre SkinThrone of the Ruler Map DevicePath of Exile 2 Art BookPath of Exile 2 Logo HoodiePath of Exile 2 Logo T-ShirtTwilight Order Reliquary Submission(Optional) 960 Points instead of physical itemsAs you can see, the value of each Supporter Pack is equal to the number of Points you receive in the packs. However, you can earn even more Points in the higher-tier packs if you choose to trade in the physical items, such as the hoodie, t-shirt, art book, etc. The more expensive packs also reward you with more than one early access key, giving you the ability to allow a friend to play for free.If you buy the $30 Supporter Pack initially, you can always upgrade down the line and receive all the rewards for doing so. This might be a good option for anyone on the fence about Path of Exile 2 at the start.As a note, there are additional Supporter Packs available to purchase on Path of Exile 2's website. However, there other packs only offer additional rewards and do not give you an early access key to Path of Exile 2. You should only purchase these other Supporter Packs if you want more in-game items.If you're already knee-deep in the game's dungeons and monsters, or you soon will be, we should also point out we have a long and diverse list of Path of Exile 2 guides ready to aid you on your journey. Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1745/17457013/4401873-poe2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6527842\"\u003e\n\n            \n            \n  \n\n\n        \n\n  \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\"\u003e\n                \u003cp\u003e\u003ca href=\"https://www.gamespot.com/games/path-of-exile-2/\" data-ref-id=\"5000-504817\"\u003ePath of Exile 2\u003c/a\u003e is out now in early access ahead of its 1.0 launch in the future. Naturally, that means the game will change a lot over the months ahead. While the ARPG will feature three acts of the campaign, a portion of the 12 classes, and additional content, there\u0026#39;s still more to come as time goes on. Though the early access version of Path of Exile 2 \u003ca href=\"https://www.gamespot.com/articles/path-of-exile-2-early-access-delayed-still-releasing-in-2024/1100-6527447/\" data-ref-id=\"1100-6527447\"\u003ewent live on December 6\u003c/a\u003e, there is a key stipulation to gaining access; the game will eventually be free-to-play, but to play during the early access period, you\u0026#39;ll need to pay up.\u003c/p\u003e\u003cp\u003eYou can find out how much you need to pay and other details about Path of Exile 2\u0026#39;s launch in the guide below.\u003c/p\u003e\u003ch2\u003eHow much is Path of Exile 2 Early Access?\u003c/h2\u003e\u003cfigure data-align=\"center\" data-size=\"large\" data-img-src=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403739-ea.png\" data-ref-id=\"1300-4403739\" data-ratio=\"0.5625\" data-width=\"1920\" data-embed-type=\"image\"\u003e\u003ca href=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403739-ea.png\" data-ref-id=\"1300-4403739\"\u003e\u003cimg alt=\"Early access to Path of Exile 2 costs some money.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1745/17457013/4403739-ea.png\" srcset=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403739-ea.png 1920w, https://www.gamespot.com/a/uploads/scale_super/1745/17457013/4403739-ea.png 1280w, https://www.gamespot.com/a/uploads/scale_medium/1745/17457013/4403739-ea.png 480w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" data-width=\"1280\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eEarly access to Path of Exile 2 costs some money.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe early access version of Path of Exile 2 costs $30. That $30 is spent on an \u003ca href=\"https://www.pathofexile.com/purchase\" data-target=\"true\" target=\"_blank\" rel=\"noopener nofollow\"\u003eEarly Access\u003c/a\u003e \u003ca href=\"https://www.pathofexile.com/purchase\" data-target=\"true\" target=\"_blank\" rel=\"noopener nofollow\"\u003eSupporter Pack\u003c/a\u003e, which gives you a Path of Exile 2 early access key as well as 300 Points and the extended digital soundtrack. The Points can be used to purchase items in the Path of Exile 2 shop and are technically a $30 value on their own.\u003c/p\u003e\u003cp\u003eOf course, the $30 Supporter Pack is the cheapest of the available packs. It\u0026#39;s all you need to gain entry to the early access build, but there are more glamorous options you can purchase as well. These more expensive packs still come with an early access key but also include a number of exclusive microtransactions, cosmetics, and even some physical items. You can see what each Supporter Pack offers below:\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLord of Ogham Supporter ($60)\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e600 Points\u003c/li\u003e\u003cli\u003eLord of Ogham Supporter Forum Title\u003c/li\u003e\u003cli\u003eLord of Ogham Portrait Frame\u003c/li\u003e\u003cli\u003eExtended Digital Soundtrack Download\u003c/li\u003e\u003cli\u003ePath of Exile 2 Early Access or Path of Exile 2 Key\u003c/li\u003e\u003cli\u003eLord of Ogham Armour Pack\u003c/li\u003e\u003cli\u003eLord of Ogham Back Attachment\u003c/li\u003e\u003cli\u003eBaby Crowbell Pet\u003c/li\u003e\u003cli\u003eThe Rust King Portal Effect\u003c/li\u003e\u003cli\u003eIron Count\u0026#39;s Zweihander\u003c/li\u003e\u003cli\u003eLord of Ogham Kiwi Pet\u003c/li\u003e\u003cli\u003eCommemorative Hillock Statue Hideout Decoration\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eKing of the Faridun Supporter ($100)\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e1,000 Points\u003c/li\u003e\u003cli\u003eKing of the Faridun Supporter Forum Title\u003c/li\u003e\u003cli\u003eKing of the Faridun Portrait Frame\u003c/li\u003e\u003cli\u003eLord of Ogham Portrait Frame\u003c/li\u003e\u003cli\u003eExtended Digital Soundtrack Download\u003c/li\u003e\u003cli\u003ePath of Exile 2 Early Access or Path of Exile 2 Key\u003c/li\u003e\u003cli\u003eKing of the Faridun Armour Pack\u003c/li\u003e\u003cli\u003eLord of Ogham Armour Pack\u003c/li\u003e\u003cli\u003eKing of the Faridun Back Attachment\u003c/li\u003e\u003cli\u003eLord of Ogham Back Attachment\u003c/li\u003e\u003cli\u003eBaby Crowbell Pet\u003c/li\u003e\u003cli\u003eThe Rust King Portal Effect\u003c/li\u003e\u003cli\u003eIron Count\u0026#39;s Zweihander\u003c/li\u003e\u003cli\u003eKing of the Faridun Kiwi Pet\u003c/li\u003e\u003cli\u003eLord of Ogham Kiwi Pet\u003c/li\u003e\u003cli\u003eCommemorative Vaal Oversoul Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Hillock Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eThe Dreadnought Hideout\u003c/li\u003e\u003cli\u003eTyranny\u0026#39;s End Spear Skin\u003c/li\u003e\u003cli\u003eFaridun\u0026#39;s Glory Bow Skin\u003c/li\u003e\u003cli\u003eDeshret\u0026#39;s Blessing Level-up Extra Effect\u003c/li\u003e\u003c/ul\u003e\u003cfigure data-align=\"center\" data-size=\"large\" data-img-src=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403738-king.png\" data-ref-id=\"1300-4403738\" data-ratio=\"0.5625\" data-width=\"1920\" data-embed-type=\"image\"\u003e\u003ca href=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403738-king.png\" data-ref-id=\"1300-4403738\"\u003e\u003cimg alt=\"An example of some of the contents in the King of Faridun Supporter Pack.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1745/17457013/4403738-king.png\" srcset=\"https://www.gamespot.com/a/uploads/original/1745/17457013/4403738-king.png 1920w, https://www.gamespot.com/a/uploads/scale_super/1745/17457013/4403738-king.png 1280w, https://www.gamespot.com/a/uploads/scale_medium/1745/17457013/4403738-king.png 480w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" data-width=\"1280\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eAn example of some of the contents in the King of Faridun Supporter Pack.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eThaumaturge of the Vaal Supporter ($160 + Shipping)\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e1,600 Points\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Supporter Forum Title\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Portrait Frame\u003c/li\u003e\u003cli\u003eKing of the Faridun Portrait Frame\u003c/li\u003e\u003cli\u003eLord of Ogham Portrait Frame\u003c/li\u003e\u003cli\u003eExtended Digital Soundtrack Download\u003c/li\u003e\u003cli\u003e+1 Path of Exile 2 Early Access Key\u003c/li\u003e\u003cli\u003ePath of Exile 2 Early Access or Path of Exile 2 Key\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Armour Pack\u003c/li\u003e\u003cli\u003eKing of the Faridun Armour Pack\u003c/li\u003e\u003cli\u003eLord of Ogham Armour Pack\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Back Attachment\u003c/li\u003e\u003cli\u003eKing of the Faridun Back Attachment\u003c/li\u003e\u003cli\u003eLord of Ogham Back Attachment\u003c/li\u003e\u003cli\u003eBaby Crowbell Pet\u003c/li\u003e\u003cli\u003eThe Rust King Portal Effect\u003c/li\u003e\u003cli\u003eIron Count\u0026#39;s Zweihander\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Kiwi Pet\u003c/li\u003e\u003cli\u003eKing of the Faridun Kiwi Pet\u003c/li\u003e\u003cli\u003eLord of Ogham Kiwi Pet\u003c/li\u003e\u003cli\u003eCommemorative Dominus Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Vaal Oversoul Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Hillock Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eThe Dreadnought Hideout\u003c/li\u003e\u003cli\u003eTyranny\u0026#39;s End Spear Skin\u003c/li\u003e\u003cli\u003eFaridun\u0026#39;s Glory Bow Skin\u003c/li\u003e\u003cli\u003eDeshret\u0026#39;s Blessing Level-up Extra Effect\u003c/li\u003e\u003cli\u003eSoulcore Weapon Effect\u003c/li\u003e\u003cli\u003eDoryani\u0026#39;s Idol Focus or Shield Skin\u003c/li\u003e\u003cli\u003eWand of the Thaumaturge Skin\u003c/li\u003e\u003cli\u003eRoyal Sacrifical Dagger Skin\u003c/li\u003e\u003cli\u003ePath of Exile 2 Logo T-Shirt\u003c/li\u003e\u003cli\u003e(Optional) 160 Points instead of physical items\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eWarlord of the Karui Supporter ($260 + Shipping)\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e2,400 Points\u003c/li\u003e\u003cli\u003eWarlord of the Karui Supporter Forum Title\u003c/li\u003e\u003cli\u003eWarlord of the Karui Portrait Frame\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Portrait Frame\u003c/li\u003e\u003cli\u003eKing of the Faridun Portrait Frame\u003c/li\u003e\u003cli\u003eLord of Ogham Portrait Frame\u003c/li\u003e\u003cli\u003eExtended Digital Soundtrack Download\u003c/li\u003e\u003cli\u003e+1 Path of Exile 2 Early Access Key\u003c/li\u003e\u003cli\u003e+1 Path of Exile 2 Early Access Key\u003c/li\u003e\u003cli\u003ePath of Exile 2 Early Access or Path of Exile 2 Key\u003c/li\u003e\u003cli\u003eWarlord of the Karui Armour Pack\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Armour Pack\u003c/li\u003e\u003cli\u003eKing of the Faridun Armour Pack\u003c/li\u003e\u003cli\u003eLord of Ogham Armour Pack\u003c/li\u003e\u003cli\u003eWarlord of the Karui Alternate Helmet\u003c/li\u003e\u003cli\u003eWarlord of the Karui Back Attachment\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Back Attachment\u003c/li\u003e\u003cli\u003eKing of the Faridun Back Attachment\u003c/li\u003e\u003cli\u003eLord of Ogham Back Attachment\u003c/li\u003e\u003cli\u003eBaby Crowbell Pet\u003c/li\u003e\u003cli\u003eThe Rust King Portal Effect\u003c/li\u003e\u003cli\u003eIron Count\u0026#39;s Zweihander\u003c/li\u003e\u003cli\u003eWarlord of the Karui Kiwi Pet\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Kiwi Pet\u003c/li\u003e\u003cli\u003eKing of the Faridun Kiwi Pet\u003c/li\u003e\u003cli\u003eLord of Ogham Kiwi Pet\u003c/li\u003e\u003cli\u003eCommemorative Malachai Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Dominus Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Vaal Oversoul Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Hillock Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eThe Dreadnought Hideout\u003c/li\u003e\u003cli\u003eTyranny\u0026#39;s End Spear Skin\u003c/li\u003e\u003cli\u003eFaridun\u0026#39;s Glory Bow Skin\u003c/li\u003e\u003cli\u003eDeshret\u0026#39;s Blessing Level-up Extra Effect\u003c/li\u003e\u003cli\u003eSoulcore Weapon Effect\u003c/li\u003e\u003cli\u003eDoryani\u0026#39;s Idol Focus or Shield Skin\u003c/li\u003e\u003cli\u003eWand of the Thaumaturge Skin\u003c/li\u003e\u003cli\u003eRoyal Sacrifical Dagger Skin\u003c/li\u003e\u003cli\u003eKarui Totemcaller Rare Finisher Effect\u003c/li\u003e\u003cli\u003eAncestral Canoe Crafting Bench Decoration\u003c/li\u003e\u003cli\u003eAkoya\u0026#39;s Felling Axe Skin\u003c/li\u003e\u003cli\u003eTukohama\u0026#39;s Crusher Mace Skin\u003c/li\u003e\u003cli\u003ePath of Exile 2 Logo Hoodie\u003c/li\u003e\u003cli\u003ePath of Exile 2 Logo T-Shirt\u003c/li\u003e\u003cli\u003e(Optional) 660 Points instead of physical items\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eLiberator of Wraeclast Supporter ($480 + Shipping)\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e4,800 Points\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Supporter Forum Title\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Portrait Frame\u003c/li\u003e\u003cli\u003eWarlord of the Karui Portrait Frame\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Portrait Frame\u003c/li\u003e\u003cli\u003eKing of the Faridun Portrait Frame\u003c/li\u003e\u003cli\u003eLord of Ogham Portrait Frame\u003c/li\u003e\u003cli\u003eExtended Digital Soundtrack Download\u003c/li\u003e\u003cli\u003e+2 Path of Exile 2 Early Access Keys\u003c/li\u003e\u003cli\u003e+1 Path of Exile 2 Early Access Key\u003c/li\u003e\u003cli\u003e+1 Path of Exile 2 Early Access Key\u003c/li\u003e\u003cli\u003ePath of Exile 2 Early Access or Path of Exile 2 Key\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Armour Pack\u003c/li\u003e\u003cli\u003eWarlord of the Karui Armour Pack\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Armour Pack\u003c/li\u003e\u003cli\u003eKing of the Faridun Armour Pack\u003c/li\u003e\u003cli\u003eLord of Ogham Armour Pack\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Helmet Attachment\u003c/li\u003e\u003cli\u003eWarlord of the Karui Alternate Helmet\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Back Attachment\u003c/li\u003e\u003cli\u003eWarlord of the Karui Back Attachment\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Back Attachment\u003c/li\u003e\u003cli\u003eKing of the Faridun Back Attachment\u003c/li\u003e\u003cli\u003eLord of Ogham Back Attachment\u003c/li\u003e\u003cli\u003eBaby Crowbell Pet\u003c/li\u003e\u003cli\u003eWindow to Twilight Portal Effect\u003c/li\u003e\u003cli\u003eThe Rust King Portal Effect\u003c/li\u003e\u003cli\u003eIron Count\u0026#39;s Zweihander\u003c/li\u003e\u003cli\u003eLiberator of Wraeclast Kiwi Pet\u003c/li\u003e\u003cli\u003eWarlord of the Karui Kiwi Pet\u003c/li\u003e\u003cli\u003eThaumaturge of the Vaal Kiwi Pet\u003c/li\u003e\u003cli\u003eKing of the Faridun Kiwi Pet\u003c/li\u003e\u003cli\u003eLord of Ogham Kiwi Pet\u003c/li\u003e\u003cli\u003eCommemorative Kitava Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Malachai Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Dominus Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Vaal Oversoul Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eCommemorative Hillock Statue Hideout Decoration\u003c/li\u003e\u003cli\u003eBeacon of Salvation Hideout\u003c/li\u003e\u003cli\u003eThe Dreadnought Hideout\u003c/li\u003e\u003cli\u003eTyranny\u0026#39;s End Spear Skin\u003c/li\u003e\u003cli\u003eFaridun\u0026#39;s Glory Bow Skin\u003c/li\u003e\u003cli\u003eDeshret\u0026#39;s Blessing Level-up Extra Effect\u003c/li\u003e\u003cli\u003eSoulcore Weapon Effect\u003c/li\u003e\u003cli\u003eDoryani\u0026#39;s Idol Focus or Shield Skin\u003c/li\u003e\u003cli\u003eWand of the Thaumaturge Skin\u003c/li\u003e\u003cli\u003eRoyal Sacrifical Dagger Skin\u003c/li\u003e\u003cli\u003eKarui Totemcaller Rare Finisher Effect\u003c/li\u003e\u003cli\u003eAncestral Canoe Crafting Bench Decoration\u003c/li\u003e\u003cli\u003eAkoya\u0026#39;s Felling Axe Skin\u003c/li\u003e\u003cli\u003eTukohama\u0026#39;s Crusher Mace Skin\u003c/li\u003e\u003cli\u003eDeliverance Crossbow Skin\u003c/li\u003e\u003cli\u003eJustice Flail Skin\u003c/li\u003e\u003cli\u003eRedemption Shield Skin\u003c/li\u003e\u003cli\u003eLight of Divinity Sceptre Skin\u003c/li\u003e\u003cli\u003eThrone of the Ruler Map Device\u003c/li\u003e\u003cli\u003ePath of Exile 2 Art Book\u003c/li\u003e\u003cli\u003ePath of Exile 2 Logo Hoodie\u003c/li\u003e\u003cli\u003ePath of Exile 2 Logo T-Shirt\u003c/li\u003e\u003cli\u003eTwilight Order Reliquary Submission\u003c/li\u003e\u003cli\u003e(Optional) 960 Points instead of physical items\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAs you can see, the value of each Supporter Pack is equal to the number of Points you receive in the packs. However, you can earn even more Points in the higher-tier packs if you choose to trade in the physical items, such as the hoodie, t-shirt, art book, etc. The more expensive packs also reward you with more than one early access key, giving you the ability to allow a friend to play for free.\u003c/p\u003e\u003cp\u003eIf you buy the $30 Supporter Pack initially, you can always upgrade down the line and receive all the rewards for doing so. This might be a good option for anyone on the fence about Path of Exile 2 at the start.\u003c/p\u003e\u003cp\u003eAs a note, there are additional Supporter Packs available to purchase on \u003ca href=\"https://pathofexile2.com/purchase\" data-target=\"true\" target=\"_blank\" rel=\"noopener nofollow\"\u003ePath of Exile 2\u0026#39;s website\u003c/a\u003e. However, there other packs only offer additional rewards and do not give you an early access key to Path of Exile 2. You should only purchase these other Supporter Packs if you want more in-game items.\u003c/p\u003e\u003cp\u003eIf you\u0026#39;re already knee-deep in the game\u0026#39;s dungeons and monsters, or you soon will be, we should also point out we have a long and diverse list of \u003ca href=\"https://www.gamespot.com/articles/path-of-exile-2-guides-hub/1100-6528305/\" data-ref-id=\"1100-6528305\"\u003ePath of Exile 2 guides\u003c/a\u003e ready to aid you on your journey.\u003c/p\u003e\n  \n                        \n    \n        \n        \n  \n                                  \u003c/div\u003e\n\n          \n        \n        \n  \n                    \n  \n    \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-08T14:26:14Z",
  "modifiedTime": null
}
