{
  "id": "3f99c918-f983-46ec-a22d-8bc54c208042",
  "title": "BBC SPOTY Host Gabby Logan Replaces ‘Merry Christmas,’ and Apparently That’s A Real Scandal",
  "link": "https://www.escapistmagazine.com/bbc-spoty-host-gabby-logan-replaces-merry-christmas-and-apparently-thats-a-real-scandal/",
  "description": "",
  "author": "Sarah Barrett",
  "published": "Wed, 18 Dec 2024 18:20:42 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "News",
    "BBC",
    "Featured"
  ],
  "byline": "Sarah Barrett",
  "length": 3857,
  "excerpt": "The BBC's Sports Personality of the Year awards have become the latest target for British anti-wokes, or \"gammon,\" as we like to call them.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "The BBC’s Sports Personality of the Year awards have become the latest target for British anti-wokes, or “gammon,” as we like to call them. These awards recognize the most accomplished performers in the world of sports, including people who have overcome adversity, and one person each year walks away with the overall award. This year, it was Keely Hodgkinson, who triumphed at the Paris Olympics. There is nothing whatsoever objectionable about Sports Personality of the Year, but the gammon have descended on the show because of one ridiculous thing: presenter Gabby Logan signed off with “Happy festive season,” instead of “Merry Christmas.” This has made certain people vein-poppingly angry. “ITS MERRY CHRISTMAS ffs,” wrote one person with a Union Jack emoji. “Gabby Logan what’s wrong with saying Christmas or is that word banned incase someone is offended?” wrote a person who is allergic to punctuation. Yet another X user raged, “The good Sports personality of 2024 this evening marred somewhat by Gabby Logan wishing us all a very happy festive season, have we become afraid of saying ‘Christ’mas?” Logan herself was actually raised Catholic, but it’s safe to say these guys wouldn’t think to look that up. Perhaps it’s me but BBC SPOTY ending the programme with “Happy Festive Season” confirms that the event has now completely gone to rat sh#t.— Norm (@normAL219) December 18, 2024 Related: Chance the Rapper’s Wife Kirsten Corley Files for Divorce, Despite the Album He Made About Her There are lots of reasons why someone might choose to say an alternative to “Merry Christmas,” inclusion being chief among them. Lots of people don’t celebrate Christmas, and plenty of them would have been watching the BBC that night. Logan has never expressed any ill toward Christmas, and indeed if you search her X account, it’s full of her wishing people Merry Christmas in years past. This is not at all something to get upset about, but the anti-woke mob is seemingly triggered by the slightest little thing. The Daily Mail and GB News have, of course, joined in with the voices crying “woke.” The Daily Mail declared that Logan’s simple sign-off “has stoked yet more accusations that the Corporation has gone woke and that Christmas is ‘banned’ on the BBC.” If they had done even the slightest bit of research (or turned on the TV), they would see that Christmas is clearly not banned on the BBC: the schedules are packed with Christmas specials and shows in which people say the word “Christmas.” It’s a ridiculous assertion, but people will still fall for it. And the festive greeting is not even the even thing that’s gotten people outraged about SPOTY. People are also furious about the fact that three women presented the show this year. Yes, really. Presenting duties were taken by Logan, Clare Balding, and Alex Scott, all very accomplished women in the world of sports. But the anti-woke crowd – note: the same people who exclude and mock trans women on the grounds of “protecting women’s sports” – think there should have been a man in the line-up. To do otherwise is, guess what, woke. One user of Elon Musk’s X wrote, “SPOTY no male presenters? What happened to the politically correct inclusively? Guess it only works one way.” Another bemoaned that the show had “woke women presenters only.” Again, this is a complete non-issue. No normal person counts the ratio of male to female BBC presenters with such intensity, or starts frothing at the mouth about someone saying “festive season.” Most people do not care, and it’s high time we went back to that behavior. But how can we when there’s rage bait to sell? The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/12/Gabby-Logan.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"158\" data-injectable=\"true\" data-video=\"true\"\u003eThe BBC’s Sports Personality of the Year awards have become the latest target for British anti-wokes, or “gammon,” as we like to call them. \u003c/p\u003e\n\n    \u003cp data-characters=\"258\" data-current-count=\"258\" data-injectable=\"false\"\u003eThese awards recognize the most accomplished performers in the world of sports, including people who have overcome adversity, and one person each year walks away with the overall award. This year, it was Keely Hodgkinson, who triumphed at the Paris Olympics.\u003c/p\u003e    \u003cp data-characters=\"403\" data-current-count=\"661\" data-injectable=\"true\"\u003eThere is nothing whatsoever objectionable about Sports Personality of the Year, but the gammon have descended on the show because of one ridiculous thing: presenter Gabby Logan signed off with “Happy festive season,” instead of “Merry Christmas.” This has made certain people vein-poppingly angry. “ITS MERRY CHRISTMAS ffs,” \u003ca href=\"https://x.com/Mitzy79084028/status/1869133295151444227\" target=\"_blank\"\u003ewrote one person with a Union Jack emoji\u003c/a\u003e. \u003c/p\u003e\n\n    \u003cp data-characters=\"493\" data-current-count=\"493\" data-injectable=\"false\"\u003e“Gabby Logan what’s wrong with saying Christmas or is that word banned incase someone is offended?” \u003ca href=\"https://x.com/dolly_suke/status/1869136030009577636\" target=\"_blank\"\u003ewrote a person who is allergic to punctuation. \u003c/a\u003eYet \u003ca href=\"https://x.com/Dungarvo/status/1869128001834918009\" target=\"_blank\"\u003eanother X user raged\u003c/a\u003e, “The good Sports personality of 2024 this evening marred somewhat by Gabby Logan wishing us all a very happy festive season, have we become afraid of saying ‘Christ’mas?” Logan herself was actually raised Catholic, but it’s safe to say these guys wouldn’t think to look that up.\u003c/p\u003e    \u003cfigure data-current-count=\"793\" data-injectable=\"true\"\u003e\u003cdiv\u003e \u003cblockquote data-width=\"550\" data-dnt=\"true\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003ePerhaps it’s me but BBC SPOTY ending the programme with “Happy Festive Season” confirms that the event has now completely gone to rat sh#t.\u003c/p\u003e— Norm (@normAL219) \u003ca href=\"https://twitter.com/normAL219/status/1869286447582450073?ref_src=twsrc%5Etfw\" target=\"_blank\"\u003eDecember 18, 2024\u003c/a\u003e\u003c/blockquote\u003e \u003c/div\u003e\u003c/figure\u003e\n\n    \u003cp data-characters=\"105\" data-current-count=\"105\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/chance-the-rappers-wife-kirsten-corley-files-for-divorce-despite-the-album-he-made-about-her/\"\u003eChance the Rapper’s Wife Kirsten Corley Files for Divorce, Despite the Album He Made About Her\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e    \u003cp data-characters=\"538\" data-current-count=\"643\" data-injectable=\"true\"\u003eThere are lots of reasons why someone might choose to say an alternative to “Merry Christmas,” inclusion being chief among them. Lots of people don’t celebrate Christmas, and plenty of them would have been watching the BBC that night. Logan has never expressed any ill toward Christmas, and indeed if you search her X account, it’s full of her wishing people Merry Christmas in years past. This is not at all something to get upset about, but the anti-woke mob is seemingly triggered by the slightest little thing.\u003c/p\u003e\n\n    \u003cp data-characters=\"613\" data-current-count=\"613\" data-injectable=\"true\"\u003eThe Daily Mail and GB News have, of course, joined in with the voices crying “woke.” The Daily Mail declared that Logan’s simple sign-off “has stoked yet more accusations that the Corporation has gone woke and that Christmas is ‘banned’ on the BBC.” If they had done even the slightest bit of research (or turned on the TV), they would see that Christmas is clearly not banned on the BBC: the schedules are packed with Christmas specials and shows in which people say the word “Christmas.” It’s a ridiculous assertion, but people will still fall for it.\u003c/p\u003e\n\n    \u003cp data-characters=\"569\" data-current-count=\"569\" data-injectable=\"false\"\u003eAnd the festive greeting is not even the even thing that’s gotten people outraged about SPOTY. People are also furious about the fact that three women presented the show this year. Yes, \u003cem\u003ereally\u003c/em\u003e. Presenting duties were taken by Logan, Clare Balding, and Alex Scott, all very accomplished women in the world of sports. But the anti-woke crowd – note: the same people who exclude and mock trans women on the grounds of “protecting women’s sports” – think there should have been a man in the line-up. To do otherwise is, guess what, woke.\u003c/p\u003e    \u003cp data-characters=\"580\" data-current-count=\"1149\" data-injectable=\"false\"\u003e\u003ca href=\"https://x.com/lizfield16/status/1869096895299367050\" target=\"_blank\"\u003eOne user of Elon Musk’s X wrote\u003c/a\u003e, “SPOTY no male presenters? What happened to the politically correct inclusively? Guess it only works one way.” Another bemoaned that the show had “woke women presenters only.” Again, this is a complete non-issue. No normal person counts the ratio of male to female BBC presenters with such intensity, or starts frothing at the mouth about someone saying “festive season.” Most people do not care, and it’s high time we went back to that behavior. But how can we when there’s rage bait to sell?\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-18T18:20:42Z",
  "modifiedTime": "2024-12-18T18:20:59Z"
}
