{
  "id": "4588ed9a-add7-45a7-bd92-a1e927d98397",
  "title": "Everything We Saw At 2025's Summer Game Fest",
  "link": "https://kotaku.com/summer-game-fest-2025-resident-evil-sonic-street-fight-1851783913",
  "description": "You should know the deal by now: In our post-E3 world, we turn our attention to Geoff Keighley’s Summer Game Fest.Read more...",
  "author": "Claire Jackson",
  "published": "Fri, 06 Jun 2025 23:40:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "hitman",
    "behemoth",
    "single player video games",
    "game of thrones season 8",
    "geoff keighley",
    "on the beach",
    "joker",
    "james bond",
    "it",
    "the lego movie",
    "scott pilgrim",
    "mina",
    "pt",
    "films",
    "wu tang rise",
    "shell",
    "hideo kojima",
    "mario kart",
    "windows games",
    "sonic",
    "neil patrick harris",
    "rpg",
    "action adventure games",
    "capcom",
    "hatsune miku",
    "deadpool"
  ],
  "byline": "Claire Jackson",
  "length": 8824,
  "excerpt": "So, so many Soulslikes, a VR Deadpool game, one very huge surprise at the end, and many other games were shown off during today's event",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Screenshot: Cpacom / Summer Game FestYou should know the deal by now: In our post-E3 world, we turn our attention to Geoff Keighley’s Summer Game Fest.This year’s show didn’t have as many explosive new announcements, but it did manage to save one of the most exciting ones for last. Before that though, there were a ton of games. Let’s get to them!Mortal Shell 2 kicked off this year’s Not-E3 festival. With a spooky, gothic, violent, and bloody style, and, yes, oh god yes, a song from non-other than black metal band Behemoth, this one looks like it’ll be for us savages for sure.This Fortnite event kicks off tomorrow if you just can’t get enough of Epic’s battle royale collab with Star Wars.Death Stranding 2 On The Beach arrives at the end of this month. Legendary director Hideo Kojima took to the stage to discuss what he hopes players take away form his new game, which launched just after the pandemic. DS2 was made with this in mind, and it aspires to remind us to reflect on our connections to one another.Conquest, destruction, medieval society, and plenty of armor and weapons are front and center in Chronicles: Medieval, expected to release in early access in 2026.Sonic may not technically need wheels to go fast, but he sure does love him. If the new Mario Kart doesn’t do it for you, Sonic’s latest racing game might be worth checking out. It even has Hatsune Miku, Ichiban Kasuga from Yakuza, Joker from Persona, and an upcoming Minecraft collab. Making sure weren’t without trailers of cool dudes slashing and stabbing cool-looking monsters, Code Vein II showed off a cinematic trailer of its upcoming RPG. There were also some snippets of gameplay showing off some slick-looking combat and more.Featuring some unnerving abandoned environments infested with monsters, End of Abyss showed off some of its intriguing top-shooter gameplay that seems to be full of mystery.Classic cartoon vibes with first-person shooter gameplay is something I didn’t know I needed? This looks like an undeniably-fun time.Game of Thrones: War For Westeros showed off a fancy cinematic trailer for this RTS take on the Game of Thrones franchise.WIth some gorgeous sci-fi visuals, Atomic Heart II showed of its strange, but-oh-so-violent world. The sequel promises more player freedom and more focused RPG mechanics.From the developers of Atomic Heart, we were treated to another massive sci-fi world with some outrageous-looking characters and a giant cube that’s got at least one character really obsessed.Following its recent reveal, Summer Game Fest 2025 showed off some gameplay and which characters fans of the comic franchise can expect to enjoy this 2D beat ‘em up.Today’s event was also another opportunity to take a look at the dark fantasy world of Onimusha. I’m not sure how you block a club attack from a creature several times your size with just a katana, but it sure looks fun to play! It’s due out on new consoles next year, 2026.If you’ve always been disappointing that gaming didn’t have enough puppets, I think you’ll be pleased to check Felt That Boxing out. Billing itself as a murder mystery action game, Killer Inn will see players take on the roles of lambs and wolves in their efforts to stay alive while alos solving some murder mysteries.We finally have a release date for Arc Raiders. Expected out October 30, 2025, today’s trailer showed off more of the game’s enormous world, and while it was short on showing any of what looked like real gameplay, it does look worth checking out when it arrives later this year.Out this month, today’s event showed off another look at the wild world of Dune brought to life as an MMO.Legions of terrifying monsters might have met their match with the these protagonist. It’ll have to do a lot of work to distinguish itself from other soulslikes (as this has some very heavy Souls energy).Featuring some gorgeous art styles, Mio: Memories in Orbit looks as pretty as it does fast.If you’ve been enjoying the recent trend of handmade art and stop-motion animation, Out of Words looks right up your alley. Taking us back to the very origins of the Sicilian mafia, Mafia: The Old Country showed off even more of its gritty, crime story set in the 1900s.If previous Lego games had you a bit burnt out on the usual rotation of whatever popular franchise they’ve collaborated with this time, you might want to check out this strictly-Lego experience with Voyagers. It’s not only adorable, but it’s surprisingly fresh.A top down beat ‘em up seems like the perfect genre for taking Spongebob out for a violent spin, don’t ya think?There sure are a lot of soulslikes out there. Today, we got a look at Lies of P’s upcoming DLC. Is it enough to stand tall in a very crowded genre though? There was something just delightfully macabre about today’s trailer for Fractured Blooms. Yes, it looks like it features some garden and cooking simulation, but also what if like P.T. just showed up in one of those games?If you’ve enjoyed building dino parks only for them to disolve into absolute carnage, then Frontier Developments has yet another game for you with Jurassic World Evolution 3 and it looks pretty awesome.With an adorable mousey protagonist and gorgeous retro-themed vibes, Mina the Hollower looks like it begs to be played in the dark, on a glowy CRT (if you can find one, that is).Wanted to ever play as Deadpool? In VR? Well, if the second part doesn’t excite you, I dunno what to say. There’s a VR Deadpool game on the way, featuring Neil Patrick Harris as the titular character! Dying Light is a good time. And while this new game looks a little grittier, the same epic parkour moves I’ve loved from the first ones look better than ever before. Dying Light: The Beast arrives on August 22, 2025.I’m kinda totally good not reliving my teenage memories, but hey, maybe your younger years are happier. And if they’re like mine and they’re not, maybe some fiction ought to do the trick. Mixtape is all about the thrill of teenage hooliganism. Lots of punching, shooting, and just all out action seems to be the appeal of Acts of Blood, and it sure does look fancy.If you enjoyed TMNT Shredder’s Revenge and have been sorerly missing a Scott Pilgrim game, this is well worth keeping an eye on. In this trailer we were exposed to yet another cover of “Mad World,” which we may or may not have needed. But we also saw some neat espionage-laced, explosive action...with apparently a Hitman crossover? Pretty neat!While we didn’t get any footage of Io Interactive’s upcoming James Bond game, we did get a peak at the inclusion of LeChiffre, the antagonist from Casino Royale. This new assassination target is expected to hit Hitman later this day, with special rewards in 007 First Light for those who finish it within the next 30 days.If you’re in the mood for even more non-franchise-themed Lego, especially the co-op variety with tons of mini-games, then Lego Party! might be worth checking out.A 20-player team-shooter set in space, Wildgate looks set to offer a colorful and expansive universe to blast your way through.Mix up some lush art direction with vicisious-looking brawls with monsters nad you have Blighted.With some of the most impressive and gorey visuals shown off tonight, ILL demands you be ready to shoot at a lot of grotesque and miserable creatures.This game is finally coming out on July 1, 2025. Mech fans rejoice.Imagine, if you will, that insects had their own industrial revolution that exceed the prowess of us silly humans? That seems to be the premise of this upcoming action game, and it looks pretty unique and slick, too. Capcom showed off a new trailer for the latest season of Street Fighter 6. With the new season, we can finally expect C. Viper and Ingrid to join the roster. I get Team Fortress meets Deathloop vibes from this character shooter, expected to arrive on Steam in 2026.What?? Another soulslike. Say it ain’t so. We saw at least six of them showed off during tonight’s event, though this one’s environment design is notably very pretty. We only saw a glimpse of the gameplay for this one, but man do I want to see more of Wu-Tang: Rise of the Deciever in action. I’m pretty sure I’ve lived this protagonist’s life of struggle and inner turmoil. What a treat!This Halo-inspired free-to-play shooter is out now.Like a Dragon developer Ryu Go Gotoku Studio showed off its upcoming brawler, set in 1943. Come for the Yakuza vibes, stay for some new characters.Capcom toyed around with us throughout the show, leaving us to worry we’d see nothing new form the legendary Resident Evil series. Thank goodness that wasn’t true, because RE9 looks set to take the series in some bold, unexpected places. It arrives on February 27, 2026.And that wraps up our rundown of everything interesting we saw at today’s Summer Game Fest.",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/92aa1cf0ec42cc6c2efeda84b851d9ad.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure id=\"\" data-id=\"92aa1cf0ec42cc6c2efeda84b851d9ad\" data-recommend-id=\"image://92aa1cf0ec42cc6c2efeda84b851d9ad\" data-format=\"png\" data-width=\"2400\" data-height=\"1350\" data-lightbox=\"false\" data-alt=\"A police officer is infected. \" data-recommended=\"false\" data-hide=\"false\" contenteditable=\"false\" draggable=\"false\"\u003e\u003cdiv contenteditable=\"false\" data-alt=\"A police officer is infected. \" data-link-reference=\"\" data-link-target=\"\" data-syndicationrights=\"true\" data-imagerights=\"fair-use\" data-hide=\"false\" data-hidecredit=\"false\"\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource media=\"(max-width: 49.94em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_965/92aa1cf0ec42cc6c2efeda84b851d9ad.jpg\"/\u003e\u003csource media=\"(min-width: 50em) and (max-width: 63.69em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1315/92aa1cf0ec42cc6c2efeda84b851d9ad.jpg\"/\u003e\u003csource media=\"(min-width: 63.75em)\" type=\"image/jpeg\" srcset=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_1600/92aa1cf0ec42cc6c2efeda84b851d9ad.jpg\"/\u003e\u003cimg alt=\"A police officer is infected. \" data-chomp-id=\"92aa1cf0ec42cc6c2efeda84b851d9ad\" data-format=\"png\" data-height=\"1350\" data-alt=\"A police officer is infected. \" data-anim-src=\"\" src=\"https://i.kinja-img.com/image/upload/c_fit,q_60,w_645/92aa1cf0ec42cc6c2efeda84b851d9ad.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cp\u003e\u003cfigcaption\u003eScreenshot: Cpacom / Summer Game Fest\u003c/figcaption\u003e\u003c/p\u003e\u003c/div\u003e\u003cspan data-id=\"92aa1cf0ec42cc6c2efeda84b851d9ad\" data-recommend-id=\"image://92aa1cf0ec42cc6c2efeda84b851d9ad\" data-format=\"png\" data-width=\"2400\" data-height=\"1350\" data-lightbox=\"false\" data-alt=\"A police officer is infected. \" data-recommended=\"false\" data-hide=\"false\"\u003e\u003c/span\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eYou should know the deal by now: In our post-E3 world, we turn our attention to Geoff Keighley’s Summer Game Fest.\u003c/p\u003e\u003cp\u003eThis year’s show didn’t have as many explosive new announcements, but it did manage to save one of the most exciting ones for last. Before that though, there were a ton of games. Let’s get to them!\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eMortal Shell 2\u003c/em\u003e kicked off this year’s Not-E3 festival. With a spooky, gothic, violent, and bloody style, and, yes, oh god yes, a song from non-other than \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/doom-the-dark-ages-argent-metal-behemoth-dimmu-borgir-1851783167?rev=1748628095845\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/doom-the-dark-ages-argent-metal-behemoth-dimmu-borgir-1851783167?rev=1748628095845\"\u003eblack metal band Behemoth\u003c/a\u003e\u003c/span\u003e, this one looks like it’ll be for us savages for sure.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis \u003cem\u003eFortnite\u003c/em\u003e event kicks off tomorrow if you just can’t get enough of Epic’s battle royale collab with \u003cem\u003eStar Wars\u003c/em\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eDeath Stranding 2\u003c/em\u003e \u003cem\u003eOn The Beach\u003c/em\u003e arrives at the end of this month. Legendary director Hideo Kojima took to the stage to discuss what he hopes players take away form his new game, which launched just after the pandemic. \u003cem\u003eDS2 \u003c/em\u003ewas made with this in mind, and it aspires to remind us to reflect on our connections to one another.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eConquest, destruction, medieval society, and plenty of armor and weapons are front and center in \u003cem\u003eChronicles: Medieval\u003c/em\u003e, expected to release in early access in 2026.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSonic may not technically need wheels to go fast, but he sure does love him. If the new \u003cem\u003eMario Kart\u003c/em\u003e doesn’t do it for you, Sonic’s latest racing game might be worth checking out. It even has Hatsune Miku, Ichiban Kasuga from \u003cem\u003eYakuza\u003c/em\u003e, Joker from \u003cem\u003ePersona\u003c/em\u003e, and an upcoming \u003cem\u003eMinecraft\u003c/em\u003e collab. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMaking sure weren’t without trailers of cool dudes slashing and stabbing cool-looking monsters, \u003cem\u003eCode Vein II \u003c/em\u003eshowed off a cinematic trailer of its upcoming RPG. There were also some snippets of gameplay showing off some slick-looking combat and more.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFeaturing some unnerving abandoned environments infested with monsters, \u003cem\u003eEnd of Abyss\u003c/em\u003e showed off some of its intriguing top-shooter gameplay that seems to be full of mystery.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eClassic cartoon vibes with first-person shooter gameplay is something I didn’t know I needed? This looks like an undeniably-fun time.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eGame of Thrones: War For Westeros \u003c/em\u003eshowed off a fancy cinematic trailer for this RTS take on the \u003cem\u003eGame of Thrones\u003c/em\u003e franchise.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWIth some gorgeous sci-fi visuals, \u003cem\u003eAtomic Heart II \u003c/em\u003eshowed of its strange, but-oh-so-violent world. The sequel promises more player freedom and more focused RPG mechanics.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFrom the developers of \u003cem\u003eAtomic Heart\u003c/em\u003e, we were treated to another massive sci-fi world with some outrageous-looking characters and a giant cube that’s got at least one character really obsessed.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFollowing its recent reveal, Summer Game Fest 2025 showed off some gameplay and which characters fans of the comic franchise can expect to enjoy this 2D beat ‘em up.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eToday’s event was also another opportunity to take a look at the dark fantasy world of \u003cem\u003eOnimusha\u003c/em\u003e. I’m not sure how you block a club attack from a creature several times your size with just a katana, but it sure looks fun to play! It’s due out on new consoles next year, 2026.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’ve always been disappointing that gaming didn’t have enough puppets, I think you’ll be pleased to check \u003cem\u003eFelt That Boxing \u003c/em\u003eout. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eBilling itself as a murder mystery action game, \u003cem\u003eKiller Inn\u003c/em\u003e will see players take on the roles of lambs and wolves in their efforts to stay alive while alos solving some murder mysteries.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWe finally have a release date for \u003cem\u003eArc Raiders\u003c/em\u003e. Expected out October 30, 2025, today’s trailer showed off more of the game’s enormous world, and while it was short on showing any of what looked like real gameplay, it does look worth checking out when it arrives later this year.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eOut this month, today’s event showed off another look at the wild world of \u003cem\u003eDune\u003c/em\u003e brought to life as an MMO.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLegions of terrifying monsters might have met their match with the these protagonist. It’ll have to do a lot of work to distinguish itself from other soulslikes (as this has some very heavy \u003cem\u003eSouls\u003c/em\u003e energy).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFeaturing some gorgeous art styles, \u003cem\u003eMio: Memories in Orbit \u003c/em\u003elooks as pretty as it does fast.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’ve been enjoying the recent trend of handmade art and stop-motion animation, \u003cem\u003eOut of Words\u003c/em\u003e looks right up your alley. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTaking us back to the very origins of the Sicilian mafia, \u003cem\u003eMafia: The Old Country \u003c/em\u003eshowed off even more of its gritty, crime story set in the 1900s.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf previous \u003cem\u003eLego \u003c/em\u003egames had you a bit burnt out on the usual rotation of whatever popular franchise they’ve collaborated with this time, you might want to check out this strictly-\u003cem\u003eLego\u003c/em\u003e experience with \u003cem\u003eVoyagers\u003c/em\u003e. It’s not only adorable, but it’s surprisingly fresh.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eA top down beat ‘em up seems like the perfect genre for taking Spongebob out for a violent spin, don’t ya think?\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere sure are a lot of soulslikes out there. Today, we got a look at \u003cem\u003eLies of P\u003c/em\u003e’s upcoming DLC. Is it enough to stand tall in a very crowded genre though? \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThere was something just delightfully macabre about today’s trailer for \u003cem\u003eFractured Blooms\u003c/em\u003e. Yes, it looks like it features some garden and cooking simulation, but also what if like \u003cem\u003eP.T.\u003c/em\u003e just showed up in one of those games?\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’ve enjoyed building dino parks only for them to disolve into absolute carnage, then Frontier Developments has yet another game for you with \u003cem\u003eJurassic World Evolution 3\u003c/em\u003e and it looks pretty awesome.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWith an adorable mousey protagonist and gorgeous retro-themed vibes, \u003cem\u003eMina the Hollower\u003c/em\u003e looks like it begs to be played in the dark, on a glowy CRT (if you can find one, that is).\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWanted to ever play as Deadpool? In VR? Well, if the second part doesn’t excite you, I dunno what to say. There’s a VR Deadpool game on the way, featuring Neil Patrick Harris as the titular character! \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eDying Light \u003c/em\u003eis a good time. And while this new game looks a little grittier, the same epic parkour moves I’ve loved from the first ones look better than ever before. \u003cem\u003eDying Light: The Beast\u003c/em\u003e arrives on August 22, 2025.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI’m kinda totally good not reliving my teenage memories, but hey, maybe your younger years are happier. And if they’re like mine and they’re not, maybe some fiction ought to do the trick. \u003cem\u003eMixtape\u003c/em\u003e is all about the thrill of teenage hooliganism. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLots of punching, shooting, and just all out action seems to be the appeal of \u003cem\u003eActs of Blood\u003c/em\u003e, and it sure does look fancy.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you enjoyed \u003cem\u003eTMNT\u003c/em\u003e \u003cem\u003eShredder’s Revenge \u003c/em\u003eand have been sorerly missing a \u003cem\u003eScott Pilgrim\u003c/em\u003e game, this is well worth keeping an eye on. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIn this trailer we were exposed to yet another cover of “Mad World,” which we may or may not have needed. But we also saw some neat espionage-laced, explosive action...with apparently a \u003cem\u003eHitman\u003c/em\u003e crossover? Pretty neat!\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhile we didn’t get any footage of Io Interactive’s upcoming \u003cem\u003eJames Bond \u003c/em\u003egame, we did get a peak at the inclusion of LeChiffre, the antagonist from \u003cem\u003eCasino Royale. \u003c/em\u003eThis new assassination target is expected to hit \u003cem\u003eHitman\u003c/em\u003e later this day, with special rewards in \u003cem\u003e007 First Light\u003c/em\u003e for those who finish it within the next 30 days.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’re in the mood for even more non-franchise-themed \u003cem\u003eLego\u003c/em\u003e, especially the co-op variety with tons of mini-games, then \u003cem\u003eLego Party!\u003c/em\u003e might be worth checking out.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eA 20-player team-shooter set in space, \u003cem\u003eWildgate\u003c/em\u003e looks set to offer a colorful and expansive universe to blast your way through.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMix up some lush art direction with vicisious-looking brawls with monsters nad you have \u003cem\u003eBlighted\u003c/em\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWith some of the most impressive and gorey visuals shown off tonight, \u003cem\u003eILL \u003c/em\u003edemands you be ready to shoot at a lot of grotesque and miserable creatures.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis game is \u003cem\u003efinally\u003c/em\u003e coming out on July 1, 2025. Mech fans rejoice.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eImagine, if you will, that insects had their own industrial revolution that exceed the prowess of us silly humans? That seems to be the premise of this upcoming action game, and it looks pretty unique and slick, too. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eCapcom showed off a new trailer for the latest season of \u003cem\u003eStreet Fighter 6. \u003c/em\u003eWith the new season, we can finally expect C. Viper and Ingrid to join the roster. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI get \u003cem\u003eTeam Fortress\u003c/em\u003e meets \u003cem\u003eDeathloop\u003c/em\u003e vibes from this character shooter, expected to arrive on Steam in 2026.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhat?? Another soulslike. Say it ain’t so. We saw at least six of them showed off during tonight’s event, though this one’s environment design is notably very pretty. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWe only saw a glimpse of the gameplay for this one, but man do I want to see more of \u003cem\u003eWu-Tang: Rise of the Deciever \u003c/em\u003ein action. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI’m pretty sure I’ve lived this protagonist’s life of struggle and inner turmoil. What a treat!\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThis \u003cem\u003eHalo\u003c/em\u003e-inspired free-to-play shooter is out now.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eLike a Dragon\u003c/em\u003e developer Ryu Go Gotoku Studio showed off its upcoming brawler, set in 1943. Come for the \u003cem\u003eYakuza\u003c/em\u003e vibes, stay for some new characters.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eCapcom \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/re9-resident-evil-9-trailer-teaser-sgf-summer-game-fest-1851783941\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/re9-resident-evil-9-trailer-teaser-sgf-summer-game-fest-1851783941\"\u003etoyed around with us throughout the show\u003c/a\u003e\u003c/span\u003e, leaving us to worry we’d see nothing new form the legendary \u003cem\u003eResident Evil\u003c/em\u003e series. Thank goodness that wasn’t true, because \u003cem\u003eRE9\u003c/em\u003e looks set to take the series in some bold, unexpected places. It arrives on February 27, 2026.\u003c/p\u003e\u003chr/\u003e\u003cp\u003eAnd that wraps up our rundown of everything interesting we saw at today’s Summer Game Fest.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-06-06T19:40:00-04:00",
  "modifiedTime": null
}
