{
  "id": "46ad6d9b-cff6-42fa-a395-97b83dfcf594",
  "title": "Stop Killing Games says 'industry has filed false claims' against EU campaign as it surpasses 1.4m signatures",
  "link": "https://www.eurogamer.net/stop-killing-games-says-industry-has-filed-false-claims-against-eu-campaign-as-it-surpasses-14m-signatures",
  "description": "Stop Killing Games figurehead Ross Scott says \"serious accusations\" and \"false claims\" have been filed against the game preservation movement's European initiative, accusing the campaign of violating EU rules. All this comes as support continues to gain momentum, with the official EU petition having now surpassed 1.4m signatures. Read more",
  "author": "Matt Wales",
  "published": "Mon, 21 Jul 2025 20:24:46 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": null,
  "byline": "Matt Wales",
  "length": 6354,
  "excerpt": "Stop Killing Games figurehead Ross Scott says \"serious accusations\" and \"false claims\" have been filed against the game…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/e29c013272f95d659a3050376a31d34c/icon/apple-touch-icon-152x152.png",
  "text": "\"This is the industry playing dirty now.\" Image credit: Eurogamer/Stop Killing Games Stop Killing Games figurehead Ross Scott says \"serious accusations\" and \"false claims\" have been filed against the game preservation movement's European initiative, accusing the campaign of violating EU rules. All this comes as support continues to gain momentum, with the official EU petition having now surpassed 1.4m signatures. Scott discussed the latest developments in a video update on YouTube, revealing the Stop Destroying Videogames EU initiative - which he reiterated is distinct from the Stop Killing Games campaign and has its own organisers, despite often being discussed under the same banner - had \"received a serious accusation from an anonymous source\". Specifically, Stop Destroying Videogames has been notified of a Transparency Complaint, claiming its campaign violates EU rules by failing to \"provide clear, accurate and comprehensive information on the sources of funding for the initiative exceeding EUR 500 per sponsor\". Stop Destroying Videogames is accused of including a \"false 'no funding' declaration\" on its petition and of \"systemic concealment of major contribution\". Stop Destroying Videogames, for context, makes use of the European Citizens Initiative, an official EU mechanism designed to provide a way for citizens to propose a legal act to the European Commission. In Stop Destroying Videogames' case, the aim is to convince the EU to pass regulations preventing \"the remote disabling of video games by the publishers, before providing reasonable means to continue functioning of said video games without the involvement from the side of the publisher.\" Stop Destroying Videogames' petition has now surpassed 1.4m signatures. That's well above the 1m needed for it to be submitted to the EU for verification and then, potentially, either progress to a public hearing or full debate session at the European Parliament - and, it's hoped, well above the threshold needed to ensure it stays above 1m after mistakes or deliberate spoofing are filtered out. However, a complaint potentially marks a bump in the road. The gist of the complaint is that Scott's work as a volunteer on the EU initiative \"far exceeds any reasonable volunteer threshold\" and that \"professional time investment constitutes quantifiable in-kind contribution under transparency regulations\". The complaint also provides \"evidence\" - based on several seemingly off-the-cuff statements made by Scott and some imaginative maths - that his involvement equates to €63,000-147,000 in professional contributions, and, as such, a failure to declare this supposedly significant source of funding violates EU rules. The trouble is, the figure mentioned in the complaint is entirely speculative, based on an assumed hourly rate of €50-75, generated from an imagined 12-14 hours work a day across \"many\" weeks - an assumed workload Scott scoffed at, saying \"that would have killed me\", despite admitting to focussing on Stop Killing Games 12-14 hours a day on at least a \"some\" occasions. \"Maybe that would mean something if I was a professional and had a rate for anything,\" he added, noting \"nobody was hiring me for this, it's all volunteer time\". Scott also stressed he's just a \"promoter\" of the EU initiative, and has \"no actual authority\" over the decisions its organisers make. \"It's only my perception that this is my one chance to fix the problem of destroying games that's pushed me so hard,\" he said. Ultimately, Scott rejects the claims made in the anonymous complaint, noting he's spent zero Euros on financial support. Moreover, he claims Stop Destroying Videogames' organisers \"literally asked EU representatives if it was okay for me to assist them in the capacity I have been back in spring 2024... [and] they said what I've been doing is fine\". The big question, though, is what impact, if any, the complaint could have on the EU initiative. Despite Scott's suggestion of potentially \"serious\" ramifications, the Citizens Initiatives website only says the Commission will \"contact the organisers of the initiative to establish the facts and ask them to correct any inaccuracies on funding/support\", with no talk of specific penalties for violations. The rest of the video sees a clearly frustrated Scott discussing what the complaint means for the future of the campaign, his own involvement, and how supporters can respond. Much of it, however, is based on Scott's apparently unsubstantiated assumption the complaint was filed by a games industry representative, despite him earlier admitting, \"We'll never know [where the complaint came from], it's anonymous\". \"I'll just say the timing of this is awfully hot on the heels of an industry lobby group giving some very bad statements about the movement,\" he continued, \"in some cases I think outright lying about it. But I don't know it was them; maybe it was a different lobbying group or maybe it was just some political hatchet man hired by the industry. But someone was trying to kill the initiative, filing paperwork to the European Union accusing the initiative and myself of violating the rules, maybe even committing a crime, I'm not sure. That's not small thing. This is the industry playing dirty now.\" The sense, perhaps, is the campaign's escalating visibility is starting to make Scott uneasy - \"I am so out of my league on this...,\" he says at one point, \"I have never been a political target before, so this is all uncharted territory for me\" - but he ends on an upbeat note to supporters, highlighting that a number of European parliament members are now among them. \"I have no idea what's coming down the pipeline now,\" he concluded, \"but all this resistance means we're throwing around some real power to fix things so let's keep at it.\" Ubisoft, which inadvertently kickstarted the Stop Killing Games campaign when it took The Crew offline last year, was recently asked about the initiative during a shareholder meeting. \"We are doing our best to make sure that things go well for all players and buyers, because obviously, support for all games cannot last forever,\" Ubisoft CEO Yves Guillemot ventured in response. \"But clearly this is a far-reaching issue, and we're working on it.\"",
  "image": "https://assetsio.gnwcdn.com/stop-killing-games-eu-v2.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003e\u0026#34;This is the industry playing dirty now.\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/stop-killing-games-eu-v2.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/stop-killing-games-eu-v2.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/stop-killing-games-eu-v2.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Stop Killing Games logo featuring a shattered game controller in front of the EU flag.\" data-src-full=\"https://assetsio.gnwcdn.com/stop-killing-games-eu-v2.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eEurogamer/Stop Killing Games\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nStop Killing Games figurehead Ross Scott says \u0026#34;serious accusations\u0026#34; and \u0026#34;false claims\u0026#34; have been filed against the game preservation movement\u0026#39;s European initiative, accusing the campaign of violating EU rules. All this comes as support continues to gain momentum, with the official EU petition having now surpassed 1.4m signatures.\n\u003c/p\u003e\n\u003cp\u003e\nScott \u003ca href=\"https://www.youtube.com/watch?v=fQN_ZA5WRpo\"\u003ediscussed the latest developments\u003c/a\u003e in a video update on YouTube, revealing the \u003ca href=\"https://citizens-initiative.europa.eu/initiatives/details/2024/000007_en\"\u003eStop Destroying Videogames EU initiative\u003c/a\u003e - which he reiterated is distinct from the Stop Killing Games campaign and has its own organisers, despite often being discussed under the same banner - had \u0026#34;received a serious accusation from an anonymous source\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\nSpecifically, Stop Destroying Videogames has been notified of a Transparency Complaint, claiming its campaign violates EU rules by failing to \u0026#34;provide clear, accurate and comprehensive information on the sources of funding for the initiative exceeding EUR 500 per sponsor\u0026#34;. Stop Destroying Videogames is accused of including a \u0026#34;false \u0026#39;no funding\u0026#39; declaration\u0026#34; on its petition and of \u0026#34;systemic concealment of major contribution\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\nStop Destroying Videogames, for context, makes use of the European Citizens Initiative, an official EU mechanism designed to provide a way for citizens to propose a legal act to the European Commission. In Stop Destroying Videogames\u0026#39; case, the aim is to convince the EU to pass regulations preventing \u0026#34;the remote disabling of video games by the publishers, before providing reasonable means to continue functioning of said video games without the involvement from the side of the publisher.\u0026#34; \n\u003c/p\u003e\n\u003cp\u003e\nStop Destroying Videogames\u0026#39; petition has \u003ca href=\"https://x.com/accursedfarms/status/1947025316452454853\"\u003enow surpassed 1.4m signatures\u003c/a\u003e. That\u0026#39;s well above the 1m needed for it to be submitted to the EU for verification and then, potentially, either progress to a public hearing or full debate session at the European Parliament - and, it\u0026#39;s hoped, well above the threshold needed to ensure it stays above 1m after mistakes or deliberate spoofing are filtered out. However, a complaint potentially marks a bump in the road.\n\u003c/p\u003e\n\u003cp\u003e\nThe gist of the complaint is that Scott\u0026#39;s work as a volunteer on the EU initiative \u0026#34;far exceeds any reasonable volunteer threshold\u0026#34; and that \u0026#34;professional time investment constitutes quantifiable in-kind contribution under transparency regulations\u0026#34;. The complaint also provides \u0026#34;evidence\u0026#34; - based on several seemingly off-the-cuff statements made by Scott and some imaginative maths - that his involvement equates to €63,000-147,000 in professional contributions, and, as such, a failure to declare this supposedly significant source of funding violates EU rules. \n\u003c/p\u003e\n\u003cp\u003e\nThe trouble is, the figure mentioned in the complaint is entirely speculative, based on an assumed hourly rate of €50-75, generated from an imagined 12-14 hours work a day across \u0026#34;many\u0026#34; weeks - an assumed workload Scott scoffed at, saying \u0026#34;that would have killed me\u0026#34;, despite admitting to focussing on Stop Killing Games 12-14 hours a day on at least a \u0026#34;some\u0026#34; occasions. \u0026#34;Maybe that would mean something if I was a professional and had a rate for anything,\u0026#34; he added, noting \u0026#34;nobody was hiring me for this, it\u0026#39;s all volunteer time\u0026#34;. Scott also stressed he\u0026#39;s just a \u0026#34;promoter\u0026#34; of the EU initiative, and has \u0026#34;no actual authority\u0026#34; over the decisions its organisers make. \u0026#34;It\u0026#39;s only my perception that this is my one chance to fix the problem of destroying games that\u0026#39;s pushed me so hard,\u0026#34; he said.\n\u003c/p\u003e\n\u003cp\u003e\nUltimately, Scott rejects the claims made in the anonymous complaint, noting he\u0026#39;s spent zero Euros on financial support. Moreover, he claims Stop Destroying Videogames\u0026#39; organisers \u0026#34;literally asked EU representatives if it was okay for me to assist them in the capacity I have been back in spring 2024... [and] they said what I\u0026#39;ve been doing is fine\u0026#34;. The big question, though, is what impact, if any, the complaint could have on the EU initiative. Despite Scott\u0026#39;s suggestion of potentially \u0026#34;serious\u0026#34; ramifications, the \u003ca href=\"https://citizens-initiative.europa.eu/how-it-works/faq_en\"\u003eCitizens Initiatives website\u003c/a\u003e only says the Commission will \u0026#34;contact the organisers of the initiative to establish the facts and ask them to correct any inaccuracies on funding/support\u0026#34;, with no talk of specific penalties for violations.\n\u003c/p\u003e\n\u003cp\u003e\nThe rest of the video sees a clearly frustrated Scott discussing what the complaint means for the future of the campaign, his own involvement, and how supporters can respond. Much of it, however, is based on Scott\u0026#39;s apparently unsubstantiated assumption the complaint was filed by a games industry representative, despite him earlier admitting, \u0026#34;We\u0026#39;ll never know [where the complaint came from], it\u0026#39;s anonymous\u0026#34;.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;I\u0026#39;ll just say the timing of this is awfully hot on the heels of an \u003ca href=\"https://www.eurogamer.net/stop-killing-games-proposals-for-game-preservation-prohibitively-expensive-major-publishers-insist\"\u003eindustry lobby group giving some very bad statements about the movement\u003c/a\u003e,\u0026#34; he continued, \u0026#34;in some cases I think outright lying about it. But I don\u0026#39;t know it was them; maybe it was a different lobbying group or maybe it was just some political hatchet man hired by the industry. But someone was trying to kill the initiative, filing paperwork to the European Union accusing the initiative and myself of violating the rules, maybe even committing a crime, I\u0026#39;m not sure. That\u0026#39;s not small thing. This is the industry playing dirty now.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nThe sense, perhaps, is the campaign\u0026#39;s escalating visibility is starting to make Scott uneasy - \u0026#34;I am so out of my league on this...,\u0026#34; he says at one point, \u0026#34;I have never been a political target before, so this is all uncharted territory for me\u0026#34; - but he ends on an upbeat note to supporters, highlighting that \u003ca href=\"https://www.eurogamer.net/as-stop-killing-games-momentum-continues-top-eu-politician-offers-support-a-game-once-sold-belongs-to-the-customer\"\u003ea number of European parliament members are now among them\u003c/a\u003e. \u0026#34;I have no idea what\u0026#39;s coming down the pipeline now,\u0026#34; he concluded, \u0026#34;but all this resistance means we\u0026#39;re throwing around some real power to fix things so let\u0026#39;s keep at it.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nUbisoft, which \u003ca href=\"https://www.eurogamer.net/stop-killing-games-aims-to-mount-political-and-legal-challenges-to-games-going-offline\"\u003einadvertently kickstarted the Stop Killing Games campaign\u003c/a\u003e when it \u003ca href=\"https://www.eurogamer.net/ubisoft-delists-the-crew-with-servers-shutting-next-year\"\u003etook The Crew offline\u003c/a\u003e last year, was \u003ca href=\"https://www.eurogamer.net/ubisofts-own-shareholders-demand-response-to-the-stop-killing-games-consumer-movement\"\u003erecently asked about the initiative\u003c/a\u003e during a shareholder meeting. \u0026#34;We are doing our best to make sure that things go well for all players and buyers, because obviously, support for all games cannot last forever,\u0026#34; Ubisoft CEO Yves Guillemot ventured in response. \u0026#34;But clearly this is a far-reaching issue, and we\u0026#39;re working on it.\u0026#34;\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-07-21T20:24:46.824879Z",
  "modifiedTime": null
}
