{
  "id": "4ee0f5fd-4c79-4c23-ab3d-1d226bdf7260",
  "title": "With Borderlands 4 nearly here, a community of archivists are racing to revive a dead Borderlands MMO",
  "link": "https://www.eurogamer.net/with-borderlands-4-nearly-here-a-community-of-archivists-are-racing-to-revive-a-dead-borderlands-mmo",
  "description": "Video game archival is a noble act, especially in this day and age where always-online games vanish when their servers are turned off, or when niche but beloved games disappear alongside the services they're locked to. There are libraries of indies locked to Apple Arcade, the PS Vita, and elsewhere, never to be played again; and then there's Borderlands Online. Read more",
  "author": "Connor Makar",
  "published": "Fri, 13 Jun 2025 17:00:28 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PC",
    "Borderlands Online"
  ],
  "byline": "Connor Makar",
  "length": 6746,
  "excerpt": "With Borderlands 4 nearly here, a community of archivists are racing to revive a dead Borderlands MMO.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/2dbe1ab52cd6d2f4b1aeec31386709a7/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: 2K China / 2K Video game archival is a noble act, especially in this day and age where always-online games vanish when their servers are turned off, or when niche but beloved games disappear alongside the services they're locked to. There are libraries of indies locked to Apple Arcade, the PS Vita, and elsewhere, never to be played again; and then there's Borderlands Online. Borderlands Online, a Chinese free-to-play MMO developed by Shanda Games, was canceled in 2015 when the studio was shut down. It's somewhat of a white whale for archivists, one of those projects so far out of reach as to create a sort of mythology around it. That is until recently, when a collective effort to revive a playable build has picked up steam. To find out more I spoke to content creator, game developer, and data miner EpicNNG, the face of this archival effort to find out how exactly the project came about, the hurdles in doing so, and their hopes for the future of Borderlands Online. Borderlands 4: Why You Should Be Worried Check out our recent Borderlands 4 video here!Watch on YouTube \"It really 'started' in late April. I just randomly said to my friend Let's just do it. What if it's out there?\" EpicNNG tells me through Twitter DMs. \"It was actually funny because we thought it'd be impossible - but they found a public build of it in less than 20 minutes. It didn't feel real. From here we knew what had to be done.\" Epic's friend and fellow Borderlands Online enthusiast found this public build on a long abandoned Chinese website, filled with dead links and viruses. From there the process of digging through the files began in earnest. Major milestones were posted online, including first breaching onto the login screen, running into an infinite login screen following character creation, and the discovery of Counter Strike map Dust 2 in the files, of all things. Over the course of months, progress was being made, but it was slow. So why dedicate so much time to such a project? Why this game, of all things? \"I've always wanted to do this.\" EpicNNG states. \"I am a superfan of this franchise. I'll do anything I can to get my hands on this kind of thing. I won't stop at Borderlands Online. Borderlands started my addiction to video games, and wanting to be a developer myself.\" Borderlands Online kept that same series style, but with a twist! | Image credit: 2K China Even with this fanhood setting the wind to their sails, that didn't stop the project from running into roadblocks. Borderlands Online, obviously, hasn't got dedicated servers online. There was that virus-laden website mentioned earlier, bizarre error messages popping up that had to be bypassed through trial and error too. EpicNNG sums up the experience as such: \"It has been incredibly challenging. If you don't know what you're doing it can feel like trying to escape a maze blindfolded. I eventually reached my skill ceiling, and that realization was tough to accept.\" \"My focus is on Borderlands 4, but opportunities like this don't come up very often. To a Borderlands fan, this previously truly felt like the definition of \"lost\" media. Now I have the opportunity to let them play it for the first time, no matter how good/bad it is. How can I pass this up?\" At which point, a lengthy call-to-action was uploaded to YouTube. This roughly 30-minute video contains a detailed summary of how much work the small team had done, multiple extensive explanations that the project was not breaching 2K or Gearbox's copyright, and how there was no intention to profit from releasing a build. This video concludes on a request for help, with the initial team running into a wall of work they doubted could be cracked open before Borderlands 4 neared release and lawyers would be more aggressive with takedowns on such projects. \"I'm incredibly worried about this. The last thing I want is for this to turn into a legal battle.\" EpicNNG explains. \"I am ready to cease development the moment they tell me to. I'm a fan of the franchise, it is not my intent to cause harm. I just want people to see Borderlands through my lens. I truly love the franchise in the most unapologetic way.\" This interview was only conducted with express permission of EpicNNG, before which the risk of further publicity on the project was laid out plainly. But with the release of his video, EpicNNG believes the build may not end up playable without additional attention, and the extra hands it could provide. This decision has borne fruit, according to EpicNNG. Following the release of their video, players flocked in to help out where they could. \"Since I came out with this news, I have had nearly 100 people reach out through various methods to let me know they'll be working on this project. It's a feeling I can't even describe. I even had people who have never played a Borderlands game before become interested in this project. In a way, it's growing the franchise to an extent.\" The race is on, as this collective rush to get the build playable before Borderlands 4 shows up. | Image credit: Gearbox There's still no word on the exact progress of this large-scale community effort, but the hope according to EpicNNG is that a build will be playable before July. \"My hope is that a playable build will exist before July. I cannot speak for the progress of other teams however, since I have no idea where they're at with their efforts. Maybe they'll beat me to it? I look forward to seeing it.\" The reason this effort by a dedicated collection of Borderlands fans and preservationists is worth highlighting is clear, at least to me. Borderlands Online may have very well been a game you've never heard of until today, and if we're being honest, there's a good chance it wouldn't have rocked the world if it ever came out. But it is history. It's a small blurred segment of the Borderlands timeline, a series that has persisted for over 15 years. It's a reminder of an earlier desire by 2K to push into the Chinese market, long before we saw the development and purchasing power of that region made manifest with games like Black Myth Wukong. It's a reminder of an age where making an MMO was the trend, even if the vast majority of them never met the aspirations of the companies building them. And for those putting in the work like EpicNNG, it's a way of experiencing a series that's close to their heart. \"I just want to play it, and say I have played it. I don't particularly think the game will be very good, but it will be a fun and exciting experience not only to preserve a project like this, but to then experience it with friends whilst we wait for Borderlands 4. I hope this project brings people together.\"",
  "image": "https://assetsio.gnwcdn.com/borderlands-online-header.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/borderlands-online-header.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/borderlands-online-header.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/borderlands-online-header.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Borderlands Online header\" data-src-full=\"https://assetsio.gnwcdn.com/borderlands-online-header.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"389\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003e2K China / 2K\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n  \n\n\n            \u003cp\u003eVideo game archival is a noble act, especially in this day and age where always-online games vanish when their servers are turned off, or when niche but beloved games disappear alongside the services they\u0026#39;re locked to. There are libraries of indies locked to \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/topics/apple-arcade\"\u003eApple Arcade\u003c/a\u003e, the PS Vita, and elsewhere, never to be played again; and then there\u0026#39;s Borderlands Online.\u003c/p\u003e\n\u003cp\u003eBorderlands Online, a Chinese free-to-play MMO developed by Shanda Games, was canceled in 2015 when the studio was shut down. It\u0026#39;s somewhat of a white whale for archivists, one of those projects so far out of reach as to create a sort of mythology around it. That is until recently, when a collective effort to revive a playable build has picked up steam.\u003c/p\u003e\n\u003cp\u003eTo find out more I spoke to content creator, game developer, and data miner EpicNNG, the face of this archival effort to find out how exactly the project came about, the hurdles in doing so, and their hopes for the future of Borderlands Online.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Borderlands 4: Why You Should Be Worried\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/ThMlRUo5IlA?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/ThMlRUo5IlA/hqdefault.jpg\"/\u003e\u003cspan\u003eBorderlands 4: Why You Should Be Worried\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/ThMlRUo5IlA?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/ThMlRUo5IlA?autoplay=1\" title=\"Borderlands 4: Why You Should Be Worried\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eCheck out our recent Borderlands 4 video here!\u003ca href=\"https://www.youtube.com/watch?v=ThMlRUo5IlA\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u0026#34;It really \u0026#39;started\u0026#39; in late April. I just randomly said to my friend Let\u0026#39;s just do it. What if it\u0026#39;s out there?\u0026#34; EpicNNG tells me through Twitter DMs. \u0026#34;It was actually funny because we thought it\u0026#39;d be impossible - but they found a public build of it in less than 20 minutes. It didn\u0026#39;t feel real. From here we knew what had to be done.\u0026#34;\u003c/p\u003e\n\u003cp\u003eEpic\u0026#39;s friend and fellow Borderlands Online enthusiast found this public build on a long abandoned Chinese website, filled with dead links and viruses. From there the process of digging through the files began in earnest. Major milestones were posted online, including \u003ca href=\"https://x.com/EpicNNG/status/1916985183921967472\"\u003efirst breaching onto the login screen\u003c/a\u003e,  \u003ca href=\"https://x.com/EpicNNG/status/1917188312093147218\"\u003erunning into an infinite login screen following character creation\u003c/a\u003e, and \u003ca href=\"https://x.com/EpicNNG/status/1918474827024781399\"\u003ethe discovery of Counter Strike map Dust 2 in the files, of all things\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOver the course of months, progress was being made, but it was slow. So why dedicate so much time to such a project? Why this game, of all things?\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;ve always wanted to do this.\u0026#34; EpicNNG states. \u0026#34;I am a superfan of this franchise. I\u0026#39;ll do anything I can to get my hands on this kind of thing. I won\u0026#39;t stop at Borderlands Online. Borderlands started my addiction to video games, and wanting to be a developer myself.\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"Borderlands Online siren\" data-src-full=\"https://assetsio.gnwcdn.com/Borderlands-Online-image-4.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Borderlands-Online-image-4.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Borderlands-Online-image-4.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Borderlands-Online-image-4.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003eBorderlands Online kept that same series style, but with a twist! | \u003cspan\u003eImage credit: \u003ccite\u003e2K China\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eEven with this fanhood setting the wind to their sails, that didn\u0026#39;t stop the project from running into roadblocks. Borderlands Online, obviously, hasn\u0026#39;t got dedicated servers online. There was that virus-laden website mentioned earlier, bizarre error messages popping up that had to be bypassed through trial and error too.\u003c/p\u003e\n\u003cp\u003eEpicNNG sums up the experience as such: \u0026#34;It has been incredibly challenging. If you don\u0026#39;t know what you\u0026#39;re doing it can feel like trying to escape a maze blindfolded. I eventually reached my skill ceiling, and that realization was tough to accept.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;My focus is on Borderlands 4, but opportunities like this don\u0026#39;t come up very often. To a Borderlands fan, this previously truly felt like the definition of \u0026#34;lost\u0026#34; media. Now I have the opportunity to let them play it for the first time, no matter how good/bad it is. How can I pass this up?\u0026#34;\u003c/p\u003e\n\u003cp\u003eAt which point, \u003ca href=\"https://www.youtube.com/watch?v=C53fhYu0Kms\u0026amp;t=1s\u0026amp;ab\"\u003ea lengthy call-to-action was uploaded to YouTube\u003c/a\u003e. This roughly 30-minute video contains a detailed summary of how much work the small team had done, multiple extensive explanations that the project was not breaching 2K or Gearbox\u0026#39;s copyright, and how there was no intention to profit from releasing a build.\u003c/p\u003e \n\u003cp\u003eThis video concludes on a request for help, with the initial team running into a wall of work they doubted could be cracked open before Borderlands 4 neared release and lawyers would be more aggressive with takedowns on such projects.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;m incredibly worried about this. The last thing I want is for this to turn into a legal battle.\u0026#34; EpicNNG explains. \u0026#34;I am ready to cease development the moment they tell me to. I\u0026#39;m a fan of the franchise, it is not my intent to cause harm. I just want people to see Borderlands through my lens. I truly love the franchise in the most unapologetic way.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis interview was only conducted with express permission of EpicNNG, before which the risk of further publicity on the project was laid out plainly. But with the release of his video, EpicNNG believes the build may not end up playable without additional attention, and the extra hands it could provide.\u003c/p\u003e\n\u003cp\u003eThis decision has borne fruit, according to EpicNNG. Following the release of their video, players flocked in to help out where they could. \u0026#34;Since I came out with this news, I have had nearly 100 people reach out through various methods to let me know they\u0026#39;ll be working on this project. It\u0026#39;s a feeling I can\u0026#39;t even describe. I even had people who have never played a Borderlands game before become interested in this project. In a way, it\u0026#39;s growing the franchise to an extent.\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\n\u003cimg alt=\"A Borderlands 4 trailer shot showing Vault Hunter Vex the Siren as she glowers at the camera.\" data-src-full=\"https://assetsio.gnwcdn.com/borderlands-4-vex.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/borderlands-4-vex.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/borderlands-4-vex.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/borderlands-4-vex.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e\n\u003cfigcaption\u003eThe race is on, as this collective rush to get the build playable before Borderlands 4 shows up. | \u003cspan\u003eImage credit: \u003ccite\u003eGearbox\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThere\u0026#39;s still no word on the exact progress of this large-scale community effort, but the hope according to EpicNNG is that a build will be playable before July. \u0026#34;My hope is that a playable build will exist before July. I cannot speak for the progress of other teams however, since I have no idea where they\u0026#39;re at with their efforts. Maybe they\u0026#39;ll beat me to it? I look forward to seeing it.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe reason this effort by a dedicated collection of Borderlands fans and preservationists is worth highlighting is clear, at least to me. Borderlands Online may have very well been a game you\u0026#39;ve never heard of until today, and if we\u0026#39;re being honest, there\u0026#39;s a good chance it wouldn\u0026#39;t have rocked the world if it ever came out.\u003c/p\u003e\n\u003cp\u003eBut it \u003cem\u003eis\u003c/em\u003e history. It\u0026#39;s a small blurred segment of the Borderlands timeline, a series that has persisted for over 15 years. It\u0026#39;s a reminder of an earlier desire by 2K to push into the Chinese market, long before we saw the development and purchasing power of that region made manifest with games like \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/black-myth-wukong-review\"\u003eBlack Myth Wukong\u003c/a\u003e. It\u0026#39;s a reminder of an age where making an MMO was the trend, even if the vast majority of them never met the aspirations of the companies building them.\u003c/p\u003e\n\u003cp\u003eAnd for those putting in the work like EpicNNG, it\u0026#39;s a way of experiencing a series that\u0026#39;s close to their heart. \u0026#34;I just want to play it, and say I have played it. I don\u0026#39;t particularly think the game will be very good, but it will be a fun and exciting experience not only to preserve a project like this, but to then experience it with friends whilst we wait for Borderlands 4. I hope this project brings people together.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-13T17:00:28.037645Z",
  "modifiedTime": null
}
