{
  "id": "60e274ba-3eae-4fa5-8fac-9c13c36671df",
  "title": "FBC: Firebreak Isn’t Just Reimagining Control – It’s Reimagining Modern Co-Op Shooters",
  "link": "https://news.xbox.com/en-us/2025/03/20/fbc-firebreak-preview/",
  "description": "The post FBC: Firebreak Isn’t Just Reimagining Control – It’s Reimagining Modern Co-Op Shooters appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Thu, 20 Mar 2025 21:45:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "PC Gaming",
    "Xbox Game Pass",
    "Control",
    "FBC: Firebreak",
    "Game Pass",
    "PC",
    "Remedy",
    "remedy entertainment",
    "Xbox Series X|S"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 6051,
  "excerpt": "FBC: Firebreak is a huge shift for Remedy, expanding not only the world of Control, but possibly how we think about modern online co-op.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "Remedy comes back to a key point about FBC: Firebreak repeatedly – “this game isn’t a second job.” You won’t need to check in every day. You won’t need to frettingly finish a battle pass before a deadline. None of your friends are going to be locked out if they don’t buy an expansion. There’s so much to be excited about here – Remedy’s first full online multiplayer game, its wild addition to the Control mythos, and its gratifyingly bizarre touches – but just the idea of being able to play an evolving, online game like this at my own pace is upping my anticipation all by itself. To bring you up to speed, FBC: Firebreak is a first-person, co-op PvE shooter that pulls us six years beyond the ending of Control. That game left us with The Oldest House – the shifting, eldritch home of the Federal Bureau of Control – under lockdown after a hostile force known as The Hiss attacked. This spin-off (very much a widening of that game’s story, rather than a sequel to it) sees the House still under lockdown, and those stuck inside stuck in increasingly desperate circumstances. You’ll play as members of the titular Firebreak, a ragtag group of first responders drafted in to clean up strange threats, using cobbled-together technology to do so. In theory, it’s a familiar set-up – three-player parties head out into missions that gradually escalate over time, throwing objectives and enemies at you with abandon. In practice, this is anything but familiar. For a start, those objectives are unusual. In the mission I’m shown during a hands-off presentation, the team are sent out to complete a mission called Paper Chase, in which they not only need to deal with Hiss-afflicted enemies (many of which you’ll remember if you played Control) but to clean up an infestation of… sticky notes. Yes, those little yellow squares of paper seem to have gained some measure of sentience, and are covering entire sections of The Oldest House. As you fight, you’ll need to clean them up – not just because they’re causing issues for the décor, but because they have a habit of spontaneously attacking you (literally covering your field of view with little bits of paper), and even coalescing to create elite enemies you’ll need to take down. At the end of this mission, we see a boss – affectionately known as Sticky Ricky – made up of literally millions of sticky notes (I know this, because an onscreen objective is counting down each note, one by one). It sounds like a comedy, but it’s presented with the deadpan sense of dread that defined Control – it’s weird, even unsettling, and a perfect match for this kind of game. Firebreak is doing a lot beyond getting weird with its missions, however. Team composition appears to be everything to your success – you’ll tool up your character not only with weapons and perks (of which there appear to be dozens), but a ‘Crisis Kit’, which provides some of the stranger tools you’ll have at your disposal. I see the Splash Kit (which fires pressurized water), the Jump Kit (offering electrical powers), and the Fix Kit (which, well, fixes things). Each of these provides both offensive and utilitarian abilities – a Fix Kit user can repair broken systems in the House, but also has access to enhanced melee using their wrench, for example. Your team’s mix of Crisis Kits will alter how you approach a level (and each other, given there are doubtless ways to combine these powers), with strategies sure to emerge from those who really dive deep into the systems. And your strategy around these levels will be paramount – your in-game currency needs to be collected during the missions themselves, and you’ll only earn it by safely extracting from a level. But the longer you stick around, the more Hiss arrive, adding a constant risk-reward tug-of-war. On top of this, your potential rewards are affected by two separate choices you’ll make before you begin your mission – the Threat Level (a basic choice of difficulty), and the Clearance Level. The latter is a truly interesting piece of design – each mission is split into distinct zones, escalating in complexity, and your chosen Clearance Level designates how many of those Zones you’ll need to get through. In effect, you’re gambling against your own team’s skill. This ability to tailor how hard or long a mission will be all feeds into that point I made at the beginning – Remedy isn’t just trying to make a compelling online shooter, but a welcoming one. Only got time for a quick burst? Jump into a low Threat, low Clearance mission for a bit of instant gratification. Settling down for the long haul? Grab your friends and start upping that Clearance level. This kind of thinking is all over the game. As I mentioned previously, Firebreak is being made purposely without daily or limited-time events, to ensure you never feel like you’re being forced to play. But alongside that, Remedy has worked to make it as fast as possible to boot the game and get into a mission; they’re thinking deeply about making co-operation truly meaningful, but without punishing your for being matched with a player of lower skill, or who might be trolling their team; and all post-launch content (and there’s a lot planned) will be free, meaning you’ll never have to split up a party. It’s a game aiming to balance uniqueness and replayability with a healthy dose of respect for its players, and their time. Honestly, that might be just as revolutionary as having a boss made of sticky notes. FBC: Firebreak will arrive this Summer for Xbox Series X|S and Windows PC – and you can play it day one with Game Pass. FBC: Firebreak is a cooperative first-person shooter set within a mysterious federal agency under assault by otherworldly forces. As a years-long siege on the agency’s headquarters reaches its boiling point, only Firebreak—the Bureau’s most versatile unit—has the gear and the guts to plunge into the building’s strangest crises, restore order, and blast their way back from the brink.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_Key_Art_Green_4K-92b72664d4e628acc0bb.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eRemedy comes back to a key point about \u003cstrong\u003e\u003cem\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/fbc-firebreak/9PDCN8Z4HKRN\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFBC: Firebreak\u003c/a\u003e\u003c/em\u003e \u003c/strong\u003erepeatedly – “this game isn’t a second job.” You won’t need to check in every day. You won’t need to frettingly finish a battle pass before a deadline. None of your friends are going to be locked out if they don’t buy an expansion. There’s so much to be excited about here – Remedy’s first full online multiplayer game, its wild addition to the \u003cem\u003eControl\u003c/em\u003e mythos, and its gratifyingly bizarre touches – but just the idea of being able to play an evolving, online game like this at my own pace is upping my anticipation all by itself.\u003c/p\u003e\n\n\n\n\u003cp\u003eTo bring you up to speed, \u003cem\u003eFBC: Firebreak\u003c/em\u003e is a first-person, co-op PvE shooter that pulls us six years beyond the ending of \u003cem\u003eControl.\u003c/em\u003e That game left us with The Oldest House – the shifting, eldritch home of the Federal Bureau of Control – under lockdown after a hostile force known as The Hiss attacked. This spin-off (very much a widening of that game’s story, rather than a sequel to it) sees the House \u003cem\u003estill \u003c/em\u003eunder lockdown, and those stuck inside stuck in increasingly desperate circumstances. You’ll play as members of the titular Firebreak, a ragtag group of first responders drafted in to clean up strange threats, using cobbled-together technology to do so.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_1SS_21-9eabf3ce7047507faa71.jpg\" alt=\"FBC: Firebreak Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_1SS_21-9eabf3ce7047507faa71.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_1SS_21-9eabf3ce7047507faa71-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_1SS_21-9eabf3ce7047507faa71-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_1SS_21-9eabf3ce7047507faa71-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn theory, it’s a familiar set-up – three-player parties head out into missions that gradually escalate over time, throwing objectives and enemies at you with abandon. In practice, this is anything but familiar. For a start, those objectives are \u003cem\u003eunusual\u003c/em\u003e. In the mission I’m shown during a hands-off presentation, the team are sent out to complete a mission called Paper Chase, in which they not only need to deal with Hiss-afflicted enemies (many of which you’ll remember if you played \u003cem\u003eControl\u003c/em\u003e) but to clean up an infestation of… sticky notes.\u003c/p\u003e\n\n\n\n\u003cp\u003eYes, those little yellow squares of paper seem to have gained some measure of sentience, and are covering entire sections of The Oldest House. As you fight, you’ll need to clean them up – not just because they’re causing issues for the décor, but because they have a habit of spontaneously attacking you (literally covering your field of view with little bits of paper), and even coalescing to create elite enemies you’ll need to take down. At the end of this mission, we see a boss – affectionately known as Sticky Ricky – made up of literally \u003cem\u003emillions\u003c/em\u003e of sticky notes (I know this, because an onscreen objective is counting down each note, one by one). \u003c/p\u003e\n\n\n\n\u003cp\u003eIt sounds like a comedy, but it’s presented with the deadpan sense of dread that defined \u003cem\u003eControl\u003c/em\u003e – it’s weird, even unsettling, and a perfect match for this kind of game.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_03-dc621533112b21ec6b71.jpg\" alt=\"FBC: Firebreak Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_03-dc621533112b21ec6b71.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_03-dc621533112b21ec6b71-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_03-dc621533112b21ec6b71-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_03-dc621533112b21ec6b71-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eFirebreak\u003c/em\u003e is doing a lot beyond getting weird with its missions, however. Team composition appears to be everything to your success – you’ll tool up your character not only with weapons and perks (of which there appear to be dozens), but a ‘Crisis Kit’, which provides some of the stranger tools you’ll have at your disposal. I see the Splash Kit (which fires pressurized water), the Jump Kit (offering electrical powers), and the Fix Kit (which, well, fixes things). Each of these provides both offensive and utilitarian abilities – a Fix Kit user can repair broken systems in the House, but also has access to enhanced melee using their wrench, for example. Your team’s mix of Crisis Kits will alter how you approach a level (and each other, given there are doubtless ways to combine these powers), with strategies sure to emerge from those who really dive deep into the systems.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd your strategy around these levels will be paramount – your in-game currency needs to be collected during the missions themselves, and you’ll only earn it by safely extracting from a level. But the longer you stick around, the more Hiss arrive, adding a constant risk-reward tug-of-war. On top of this, your potential rewards are affected by two separate choices you’ll make before you begin your mission – the Threat Level (a basic choice of difficulty), and the Clearance Level. The latter is a truly interesting piece of design – each mission is split into distinct zones, escalating in complexity, and your chosen Clearance Level designates how many of those Zones you’ll need to get through. In effect, you’re gambling against your own team’s skill.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_08-2e49e046b2644602a017.jpg\" alt=\"FBC: Firebreak Screenshot\" srcset=\"https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_08-2e49e046b2644602a017.jpg 1920w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_08-2e49e046b2644602a017-768x432.jpg 768w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_08-2e49e046b2644602a017-1024x576.jpg 1024w, https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/FBC_Firebreak_March_3SS_08-2e49e046b2644602a017-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThis ability to tailor how hard or long a mission will be all feeds into that point I made at the beginning – Remedy isn’t just trying to make a compelling online shooter, but a \u003cem\u003ewelcoming \u003c/em\u003eone. Only got time for a quick burst? Jump into a low Threat, low Clearance mission for a bit of instant gratification. Settling down for the long haul? Grab your friends and start upping that Clearance level.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis kind of thinking is all over the game. As I mentioned previously, \u003cem\u003eFirebreak \u003c/em\u003eis being made purposely without daily or limited-time events, to ensure you never feel like you’re being \u003cem\u003eforced \u003c/em\u003eto play. But alongside that, Remedy has worked to make it as fast as possible to boot the game and get into a mission; they’re thinking deeply about making co-operation truly meaningful, but without punishing your for being matched with a player of lower skill, or who might be trolling their team; and all post-launch content (and there’s a lot planned) will be free, meaning you’ll never have to split up a party.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s a game aiming to balance uniqueness and replayability with a healthy dose of respect for its players, and their time. Honestly, that might be just as revolutionary as having a boss made of sticky notes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/fbc-firebreak/9PDCN8Z4HKRN\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFBC: Firebreak \u003c/a\u003e\u003c/strong\u003ewill arrive this Summer for Xbox Series X|S and Windows PC – and you can play it day one with Game Pass.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9PDCN8Z4HKRN\" id=\"msp1742293907719\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9PDCN8Z4HKRN\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.24173.14156548122363733.d1181654-5ecb-4c4f-9068-e61e5dda3fe9.3b6022d3-9cb1-4c04-95f2-0d0142a2b59d?w=400\u0026amp;h=600\" alt=\"FBC: Firebreak\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tFBC: Firebreak is a cooperative first-person shooter set within a mysterious federal agency under assault by otherworldly forces. As a years-long siege on the agency’s headquarters reaches its boiling point, only Firebreak—the Bureau’s most versatile unit—has the gear and the guts to plunge into the building’s strangest crises, restore order, and blast their way back from the brink.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-20T21:45:00Z",
  "modifiedTime": "2025-03-18T10:40:53Z"
}
