{
  "id": "657da43c-4add-4047-8ba6-6f54305e52e8",
  "title": "Venom: The Last Dance’s Symbiote Identities Were Revealed",
  "link": "https://www.escapistmagazine.com/venom-the-last-dances-symbiote-identities-were-revealed/",
  "description": "",
  "author": "Jorge A. Aguilar",
  "published": "Wed, 27 Nov 2024 21:44:52 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "Movies and TV",
    "News",
    "mcu",
    "movie and tv",
    "Sony's Spider-Man Universe",
    "Spider-Man",
    "Venom: Let There Be Carnage"
  ],
  "byline": "Jorge A. Aguilar",
  "length": 2677,
  "excerpt": "Aharon Bourland, the VFX supervisor for Venom: Let There Be Carnage, recently shared details about some symbiotes that appear in the movie’s final battle. Many of these symbiotes don’t have names in the film but had an important role in the fight against Knull.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "Aharon Bourland, the VFX supervisor for Venom: Let There Be Carnage, recently shared details about some symbiotes that appear in the movie’s final battle. Many of these symbiotes don’t have names in the film but had an important role in the fight against Knull. According to a talk on AVFX, while many of them were killed during the battle, a few survived, including Agony, played by Juno Temple. The film also hinted that Toxin is still around, which could be represented by Patrick Mulligan as Lasher. Related: James Gunn Finally Opens Up About Waller Series Bourland explained how they designed the symbiotes and their powers. They started with the looks from the comics but changed them to match the movie’s story and style. The goal was to give each symbiote special abilities to improve the fight scenes and help tell the story better. Each ability was made to work well with the others, making the action flow smoothly. Bourland said, “Each symbiote started with research into their comic book versions, and from there, we evolved those into ‘hero’ versions that fit the story. It was really important that each symbiote had a unique set of abilities that complemented the others and helped move the story forward. For example, Lava’s red and yellow fire whip worked well with the tendril cage that Animal/Tendril used to restrain the Xenophage. Dr. Payne’s symbiote was also tied thematically to her character. Her life was changed by a lightning bolt, and when she bonded with the symbiote, it gave her lightning-like abilities, bringing her story full circle.” Related: Carrie-Anne Moss Confirms Her MCU Status Among the new symbiotes introduced are Lava, who has fiery whip-like powers, and Animal/Tendril, known for their restraining abilities. Dr. Payne’s symbiote has lightning powers, which connect to an important part of her backstory. Another symbiote called Jim is a strong fighter. Lasher, who was hinted at in the movie earlier, is shown as a fast attacker with slashing moves. Mulligan’s symbiote was designed to match the director’s vision, resembling a snake-like, semi-transparent creature with a look similar to a “water god.” This unique design, made by DNEG, stands out from other symbiotes. The filmmakers chose to create new symbiotes for the battle instead of using existing characters from the comics. This helped avoid the issue of not being able to fully develop established characters within the short time of the action scene. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/11/carnage-armed-and-ready.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"269\" data-injectable=\"true\" data-video=\"true\"\u003eAharon Bourland, the VFX supervisor for \u003cem\u003eVenom: Let There Be Carnage\u003c/em\u003e, recently shared details about some symbiotes that appear in the movie’s final battle. Many of these symbiotes don’t have names in the film but had an important role in the fight against Knull.\u003c/p\u003e\n\n    \u003cp data-characters=\"241\" data-current-count=\"241\" data-injectable=\"false\"\u003eAccording to a talk on \u003ca target=\"_blank\" href=\"https://www.artofvfx.com/venom-the-last-dance-john-moffatt-and-aharon-bourland-production-vfx-supervisors/\" rel=\"noreferrer noopener\"\u003eAVFX\u003c/a\u003e, while many of them were killed during the battle, a few survived, including Agony, played by Juno Temple. The film also hinted that Toxin is still around, which could be represented by Patrick Mulligan as Lasher.\u003c/p\u003e    \u003cp data-characters=\"56\" data-current-count=\"297\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca href=\"https://www.escapistmagazine.com/james-gunn-finally-opens-up-about-waller-series/\"\u003eJames Gunn Finally Opens Up About Waller Series\u003c/a\u003e\u003c/p\u003e    \u003cp data-characters=\"371\" data-current-count=\"668\" data-injectable=\"true\"\u003eBourland explained how they designed the symbiotes and their powers. They started with the looks from the comics but changed them to match the movie’s story and style. The goal was to give each symbiote special abilities to improve the fight scenes and help tell the story better. Each ability was made to work well with the others, making the action flow smoothly.\u003c/p\u003e\n\n    \u003cp data-characters=\"663\" data-current-count=\"663\" data-injectable=\"true\"\u003eBourland said, “Each symbiote started with research into their comic book versions, and from there, we evolved those into ‘hero’ versions that fit the story. It was really important that each symbiote had a unique set of abilities that complemented the others and helped move the story forward. For example, Lava’s red and yellow fire whip worked well with the tendril cage that Animal/Tendril used to restrain the Xenophage. Dr. Payne’s symbiote was also tied thematically to her character. Her life was changed by a lightning bolt, and when she bonded with the symbiote, it gave her lightning-like abilities, bringing her story full circle.”\u003c/p\u003e\n\n    \u003cp data-characters=\"49\" data-current-count=\"49\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca href=\"https://www.escapistmagazine.com/carrie-anne-moss-confirms-her-mcu-status/\"\u003eCarrie-Anne Moss Confirms Her MCU Status\u003c/a\u003e\u003c/p\u003e    \u003cp data-characters=\"379\" data-current-count=\"428\" data-injectable=\"false\"\u003eAmong the new symbiotes introduced are Lava, who has fiery whip-like powers, and Animal/Tendril, known for their restraining abilities. Dr. Payne’s symbiote has lightning powers, which connect to an important part of her backstory. Another symbiote called Jim is a strong fighter. Lasher, who was hinted at in the movie earlier, is shown as a fast attacker with slashing moves.\u003c/p\u003e    \u003cp data-characters=\"487\" data-current-count=\"915\" data-injectable=\"false\"\u003eMulligan’s symbiote was designed to match the director’s vision, resembling a snake-like, semi-transparent creature with a look similar to a “water god.” This unique design, made by DNEG, stands out from other symbiotes. The filmmakers chose to create new symbiotes for the battle instead of using existing characters from the comics. This helped avoid the issue of not being able to fully develop established characters within the short time of the action scene.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-27T21:44:52Z",
  "modifiedTime": "2024-11-27T21:44:55Z"
}
