{
  "id": "6ea69681-895b-4aad-aae0-0ea8b2a432c6",
  "title": "Nintendo Reveals Release Window for Live-Action The Legend of Zelda Movie",
  "link": "https://www.escapistmagazine.com/nintendo-reveals-release-window-for-live-action-the-legend-of-zelda-movie/",
  "description": "",
  "author": "Jackson Hayes",
  "published": "Wed, 06 Nov 2024 16:09:56 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "Featured",
    "The Legend of Zelda"
  ],
  "byline": "Jackson Hayes",
  "length": 1876,
  "excerpt": "Nintendo has finally revealed the release window for Wes Ball's live-action The Legend of Zelda movie adaptation.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "Video game adaptations have been on a roll. The Last of Us and Fallout dominated on the TV side of things, while The Super Mario Bros. Movie lit up the box office. And Nintendo is ready for more, revealing the release window for the live-action The Legend of Zelda movie. Following the success of The Super Mario Bros. Movie, Nintendo moved quickly to greenlight a sequel and an adaptation of the popular The Legend of Zelda series. It’s been quite a while since there was an update on either project, but a Nintendo financial report spotted by IGN provides a bit of information that should help hold everyone over. For starters, The Super Mario Bros. Movie sequel is confirmed to release in 2026. While details on the movie are few and far between, the majority of the cast is expected to return, as well as directors Aaron Horvath and Michael Jelenic. As for The Legend of Zelda movie, its release date is listed as “202X,” meaning that it will come out before the end of the decade. Related: Ranking Every 2D Zelda Game, From Worst To Best That’s obviously a massive release window, but Nintendo is keeping its cards close to the vest to ensure fans don’t get overly excited for a movie that’s still early in its development. At least the director of the film, Wes Ball, has been open to talking about his upcoming project. “It’s going to be awesome,” Ball said in late 2023. “My whole life has led up to this moment. I grew up on Zelda and it is the most important property, I think, that’s untapped IP, if you will. So we very much are working hard to do something. We’re not just trying to do it because we can. We want to make something really special.” The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2023/06/legend-of-zelda-movie-deal-closing-universal-illumination.jpg?fit=1024%2C605",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"271\" data-injectable=\"true\" data-video=\"true\"\u003eVideo game adaptations have been on a roll. \u003cem\u003eThe Last of Us\u003c/em\u003e and \u003cem\u003eFallout \u003c/em\u003edominated on the TV side of things, while\u003cem\u003e The Super Mario Bros. Movie\u003c/em\u003e lit up the box office. And Nintendo is ready for more, revealing the release window for the live-action \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/tag/the-legend-of-zelda/\"\u003eThe Legend of Zelda\u003c/a\u003e \u003c/em\u003emovie.\u003c/p\u003e\n\n    \u003cp data-characters=\"350\" data-current-count=\"350\" data-injectable=\"false\"\u003eFollowing the success of \u003cem\u003eThe Super Mario Bros. Movie\u003c/em\u003e, Nintendo moved quickly to greenlight a sequel and an adaptation of the popular \u003cem\u003eThe Legend of Zelda\u003c/em\u003e series. It’s been quite a while since there was an update on either project, but \u003ca href=\"https://www.ign.com/articles/well-at-least-we-know-the-live-action-the-legend-of-zelda-movie-will-be-released-before-the-end-of-the-decade\"\u003ea Nintendo financial report spotted by IGN\u003c/a\u003e provides a bit of information that should help hold everyone over. \u003c/p\u003e    \u003cp data-characters=\"382\" data-current-count=\"732\" data-injectable=\"true\"\u003eFor starters, \u003cem\u003eThe Super Mario Bros. Movie\u003c/em\u003e sequel is confirmed to release in 2026. While details on the movie are few and far between, the majority of the cast is expected to return, as well as directors Aaron Horvath and Michael Jelenic. As for \u003cem\u003eThe Legend of Zelda\u003c/em\u003e movie, its release date is listed as “202X,” meaning that it will come out before the end of the decade. \u003c/p\u003e\n\n    \u003cp data-characters=\"56\" data-current-count=\"56\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/ranking-every-2d-legend-of-zelda-game-from-worst-to-best/\"\u003eRanking Every 2D Zelda Game, From Worst To Best\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e    \u003cp data-characters=\"302\" data-current-count=\"358\" data-injectable=\"false\"\u003eThat’s obviously a massive release window, but Nintendo is keeping its cards close to the vest to ensure fans don’t get overly excited for a movie that’s still early in its development. At least the director of the film, Wes Ball, has been open to talking about his upcoming project. \u003c/p\u003e    \u003cp id=\"mntl-sc-block_1-0-7\" data-characters=\"369\" data-current-count=\"727\" data-injectable=\"true\"\u003e“It’s going to be awesome,” \u003ca href=\"https://www.escapistmagazine.com/wes-ball-wants-to-create-a-live-action-miyazaki-movie-with-the-legend-of-zelda/\"\u003eBall said in late 2023\u003c/a\u003e. “My whole life has led up to this moment. I grew up on \u003cem\u003eZelda\u003c/em\u003e and it is the most important property, I think, that’s untapped IP, if you will. So we very much are working hard to do something. We’re not just trying to do it because we can. We want to make something really special.”\u003c/p\u003e\n\n    \n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://escapistmagazine.com/affiliate-policy\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-06T16:09:56Z",
  "modifiedTime": "2024-11-06T16:10:00Z"
}
