{
  "id": "829b4f42-7de9-4f23-98a0-d98c5577aec7",
  "title": "Lag and Loathing in Lothlorien",
  "link": "https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/",
  "description": "Lt. Colonel Giles Vandeleur: Joe? Joe, how the hell do they expect us to keep schedule on a road like this? Lt. Colonel J.O.E. Vandeleur: You don’t know the worst. This bit we’re on now? Lt. Colonel Giles Vandeleur: Yes? Lt. Colonel J.O.E. Vandeleur: It’s the wide part. –A Bridge Too Far (film), 1977 I […]",
  "author": "Wilhelm Arcturus",
  "published": "Thu, 17 Apr 2025 15:15:36 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "Lord of the Rings Online",
    "64-Bit",
    "Endwaith",
    "Glamdring",
    "Lothlorien",
    "Mordor Project",
    "Moria"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 6041,
  "excerpt": "Lt. Colonel Giles Vandeleur: Joe? Joe, how the hell do they expect us to keep schedule on a road like this? Lt. Colonel J.O.E. Vandeleur: You don’t know the worst. This bit we’re on now…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "Lt. Colonel Giles Vandeleur: Joe? Joe, how the hell do they expect us to keep schedule on a road like this? Lt. Colonel J.O.E. Vandeleur: You don’t know the worst. This bit we’re on now? Lt. Colonel Giles Vandeleur: Yes? Lt. Colonel J.O.E. Vandeleur: It’s the wide part. –A Bridge Too Far (film), 1977 I don’t know if it is the zone, that more people have piled into the Glamdring server, if housing having been opened up to the masses caused a change, or if something else is going on, but I hit my first real bout of server lag in the Dimrill Dale; real, old school, 32-bit server, “this actually sucks a lot” levels of server lag. I have of course seen a bit of lag and hesitation so far, often on weekends during what I would imagine were peak user times.  For EVE Online at least the peak time for most weeks is Sunday around noon local time for me, so when I was finishing up Moria on a weekend afternoon and saw some slow responsiveness, I was willing to cut the game a bit of slack. But I was in Lothlorien on my lunch on a Tuesday and started running into a litany of issues.  In addition to the slow response time to clicks… you often need a good two Mississippi count before you get acknowledgement from the game… and the “not a valid target” response where the game needs to think about whether or you should be able to put an arrow into the mob you have selected, I was seeing a lot of stuttering while moving and rubber-banding, where I would would be running to a quest item to pick up and would bounce back about ten steps, run forward again, bounce back about five steps, run forward and make some progress, then bounce back a step or two. And mobs themselves were not exactly behaving in this environment.  As one might expect, hits and damage were taking a while to register.  I had one mob that I had almost down and then his hit points started going back up.  It was one of the mobs that has a minor self-heal, so no biggie… but his health went up and up until he was full up again, all the while I was going all out to do him in.  This was a mob that otherwise should have been a 3-4 attack job, but suddenly he was invincible.  So I turned and ran, ceasing my attacks, but left the mob targeted.  As I ran down the road he suddenly started taking damage and then keeled over and died. I looked around, but there was nobody else about.  My queued up damage appeared to have finally done him in.  It was a strange encounter. So, while I am not prepared to declare the 64-bit server transition a failure, on Glamdring we have gone from a state of performance being better than the old 32-bit servers to being as bad or worse than the way things were back on 32-bit. All of which made me somewhat grumpy with the game, it bordering on nearly unplayable at times that noon. This was not helped by the start of the zone involving some of the classic “why are you doing this to me” quest design.  I mean, even some of the local NPCs were getting the vibe. Sing it sister… also, maybe I shouldn’t have returned here… For example, and this is an actual series of quests, I was asked to go destroy some piles of wood in a nearby orc camp.   All of piles were guarded by siege masters who were standing around their siege engines.  I did that, which required me to kill all the siege masters so located.  I went back and turned that in for the next quest. The next quest asked me to go to the same nearby camp and kill siege masters, all of whom had respawned, and all of who were hanging around by their siege engines and their freshly destroyed piles of wood.  Fine, easy, I went and killed the siege masters.  I knew where they all were, having just visited and slain them while tending to their wood piles.  I turned that in. Then the quest giver asked me to take a third trip to the very same nearby orc camp to destroy the siege engines, by the piles of wood, guarded by the siege masters, which meant killing all the siege masters for a third time. Siege engines and catapults I went back to the guy and turned that in.  I had now burned the wood, killed the siege masters, and wrecked their equipment. Finally, he suggested that the leader of the siege troops was the real problem, and that I should go kill him.  At this point I am AYFKM, but he is serious. Aww Nust! Nust, the commander is, of course, at the back of that very same camp and getting to him requires me to kill at least half of the siege masters for the fourth time, plus all the other and sundry orcs in the area. Kicked him in the Nust! Then I had to kill most of them again on the way out because they are all on an ungodly short respawn timer… including some of the very same siege masters because they had already respawned… but I did it, because that is who I am out here, the orc clean up crew. In fact, between that quest chain and another one that kept sending me back and forth to another orc camp and the opening quest which sent me off into the middle or a third orc camp, I had racked up enough orc kills to get the 100 needed for the basic orc slayer deed. Well, that deed is done… On the one hand, yay, deed completed. On the other I was maybe six quests in and I had killed 100 orcs… often the same damn orcs in the same damn spot I had killed them two minutes before… and, to finally reference the quote at the top of the post, this was the wide part of the road, the easy, light, and modestly interesting bit.  I still hadn’t made it to Mirkwood.  I still had to work to get to the dark forest of dull repetition. So I took this all as a sign that I shouldn’t bother with this route.  I’d been here before and didn’t like it and now even the game itself seemed to be warning me off. Somebody mentioned another route forward in a comment a while back, so I went to the LOTRO Wiki and found the zones by level page and found another option. Endwaith. Screw Mirkwood.  The fellowship isn’t going into Mirkwood in any case.  And I am not committed to any particular path, just a single destination; Mordor. So I’m going there via Endwaith.",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cdiv role=\"presentation\"\u003e\n\u003cblockquote\u003e\u003cp\u003eLt. Colonel Giles Vandeleur: Joe? Joe, how the hell do they expect us to keep schedule on a road like this?\u003cbr/\u003e\nLt. Colonel J.O.E. Vandeleur: You don’t know the worst. This bit we’re on now?\u003cbr/\u003e\nLt. Colonel Giles Vandeleur: Yes?\u003cbr/\u003e\nLt. Colonel J.O.E. Vandeleur: It’s the wide part.\u003c/p\u003e\n\u003cp\u003e–\u003ca href=\"https://en.wikipedia.org/wiki/A_Bridge_Too_Far_(film)\"\u003eA Bridge Too Far (film)\u003c/a\u003e, 1977\u003c/p\u003e\u003c/blockquote\u003e\n\u003c/div\u003e\n\u003cp\u003eI don’t know if it is the zone, that more people have piled into the Glamdring server, if housing having been opened up to the masses caused a change, or if something else is going on, but I hit my first real bout of server lag in the Dimrill Dale; real, old school, 32-bit server, “this actually sucks a lot” levels of server lag.\u003c/p\u003e\n\u003cp\u003eI have of course seen a bit of lag and hesitation so far, often on weekends during what I would imagine were peak user times.  For \u003cem\u003eEVE Online\u003c/em\u003e at least the peak time for most weeks is Sunday around noon local time for me, so when I was finishing up Moria on a weekend afternoon and saw some slow responsiveness, I was willing to cut the game a bit of slack.\u003c/p\u003e\n\u003cp\u003eBut I was in Lothlorien on my lunch on a Tuesday and started running into a litany of issues.  In addition to the slow response time to clicks… you often need a good two Mississippi count before you get acknowledgement from the game… and the “not a valid target” response where the game needs to think about whether or you should be able to put an arrow into the mob you have selected, I was seeing a lot of stuttering while moving and rubber-banding, where I would would be running to a quest item to pick up and would bounce back about ten steps, run forward again, bounce back about five steps, run forward and make some progress, then bounce back a step or two.\u003c/p\u003e\n\u003cp\u003eAnd mobs themselves were not exactly behaving in this environment.  As one might expect, hits and damage were taking a while to register.  I had one mob that I had almost down and then his hit points started going back up.  It was one of the mobs that has a minor self-heal, so no biggie… but his health went up and up until he was full up again, all the while I was going all out to do him in.  This was a mob that otherwise should have been a 3-4 attack job, but suddenly he was invincible.  So I turned and ran, ceasing my attacks, but left the mob targeted.  As I ran down the road he suddenly started taking damage and then keeled over and died.\u003c/p\u003e\n\u003cp\u003eI looked around, but there was nobody else about.  My queued up damage appeared to have finally done him in.  It was a strange encounter.\u003c/p\u003e\n\u003cp\u003eSo, while I am not prepared to declare the 64-bit server transition a failure, on Glamdring we have gone from a state of performance being better than the old 32-bit servers to being as bad or worse than the way things were back on 32-bit.\u003c/p\u003e\n\u003cp\u003eAll of which made me somewhat grumpy with the game, it bordering on nearly unplayable at times that noon.\u003c/p\u003e\n\u003cp\u003eThis was not helped by the start of the zone involving some of the classic “why are you doing this to me” quest design.  I mean, even some of the local NPCs were getting the vibe.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_134038\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-134038\" data-attachment-id=\"134038\" data-permalink=\"https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/mp13_singitsister/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg\" data-orig-size=\"600,328\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP13_SingItsister\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Sing it sister\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg\" alt=\"\" width=\"600\" height=\"328\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg 600w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg?w=150\u0026amp;h=82 150w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_singitsister.jpg?w=500\u0026amp;h=273 500w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-134038\"\u003eSing it sister… also, maybe I shouldn’t have returned here…\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eFor example, and this is an actual series of quests, I was asked to go destroy some piles of wood in a nearby orc camp.   All of piles were guarded by siege masters who were standing around their siege engines.  I did that, which required me to kill all the siege masters so located.  I went back and turned that in for the next quest.\u003c/p\u003e\n\u003cp\u003eThe next quest asked me to go to the same nearby camp and kill siege masters, all of whom had respawned, and all of who were hanging around by their siege engines and their freshly destroyed piles of wood.  Fine, easy, I went and killed the siege masters.  I knew where they all were, having just visited and slain them while tending to their wood piles.  I turned that in.\u003c/p\u003e\n\u003cp\u003eThen the quest giver asked me to take a third trip to the very same nearby orc camp to destroy the siege engines, by the piles of wood, guarded by the siege masters, which meant killing all the siege masters for a third time.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_134035\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-134035\" data-attachment-id=\"134035\" data-permalink=\"https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/mp13_siegeandcatapult/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg\" data-orig-size=\"2053,1141\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP13_SiegeAndCatapult\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Siege engines and catapults\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=600\" alt=\"\" width=\"600\" height=\"333\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=1198 1198w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_siegeandcatapult.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-134035\"\u003eSiege engines and catapults\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI went back to the guy and turned that in.  I had now burned the wood, killed the siege masters, and wrecked their equipment.\u003c/p\u003e\n\u003cp\u003eFinally, he suggested that the leader of the siege troops was the real problem, and that I should go kill him.  At this point I am AYFKM, but he is serious.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_134034\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-134034\" data-attachment-id=\"134034\" data-permalink=\"https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/mp13_awwnust/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png\" data-orig-size=\"357,239\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP13_AwwNust\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Aww Nust!\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png?w=357\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png?w=357\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png\" alt=\"\" width=\"357\" height=\"239\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png 357w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_awwnust.png?w=150\u0026amp;h=100 150w\" sizes=\"(max-width: 357px) 100vw, 357px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-134034\"\u003eAww Nust!\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eNust, the commander is, of course, at the back of that very same camp and getting to him requires me to kill at least half of the siege masters for the fourth time, plus all the other and sundry orcs in the area.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_134039\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-134039\" data-attachment-id=\"134039\" data-permalink=\"https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/mp13_inthenust/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg\" data-orig-size=\"1265,697\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP13_InTheNust\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Kicked him in the Nust!\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=600\" alt=\"\" width=\"600\" height=\"331\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_inthenust.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-134039\"\u003eKicked him in the Nust!\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThen I had to kill most of them again on the way out because they are all on an ungodly short respawn timer… including some of the very same siege masters because they had already respawned… but I did it, because that is who I am out here, the orc clean up crew.\u003c/p\u003e\n\u003cp\u003eIn fact, between that quest chain and another one that kept sending me back and forth to another orc camp and the opening quest which sent me off into the middle or a third orc camp, I had racked up enough orc kills to get the 100 needed for the basic orc slayer deed.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_134036\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-134036\" data-attachment-id=\"134036\" data-permalink=\"https://tagn.wordpress.com/2025/04/17/lag-and-loathing-in-lothlorien/mp13_ldimrellorcslayer/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png\" data-orig-size=\"600,350\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP13_LDimrellOrcSlayer\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Well, that deed is done…\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png\" alt=\"\" width=\"600\" height=\"350\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png 600w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png?w=150\u0026amp;h=88 150w, https://tagn.wordpress.com/wp-content/uploads/2025/04/mp13_ldimrellorcslayer.png?w=500\u0026amp;h=292 500w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-134036\"\u003eWell, that deed is done…\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eOn the one hand, yay, deed completed.\u003c/p\u003e\n\u003cp\u003eOn the other I was maybe six quests in and I had killed 100 orcs… often the same damn orcs in the same damn spot I had killed them two minutes before… and, to finally reference the quote at the top of the post, this was the wide part of the road, the easy, light, and modestly interesting bit.  I still hadn’t made it to Mirkwood.  I still had to work to get to the dark forest of dull repetition.\u003c/p\u003e\n\u003cp\u003eSo I took this all as a sign that I shouldn’t bother with this route.  I’d been here before and didn’t like it and now even the game itself seemed to be warning me off.\u003c/p\u003e\n\u003cp\u003eSomebody mentioned another route forward in a comment a while back, so I went to the LOTRO Wiki and found the \u003ca href=\"https://lotro-wiki.com/wiki/Zones_by_level\"\u003ezones by level page\u003c/a\u003e and found another option.\u003c/p\u003e\n\u003cp\u003eEndwaith.\u003c/p\u003e\n\u003cp\u003eScrew Mirkwood.  The fellowship isn’t going into Mirkwood in any case.  And I am not committed to any particular path, just a single destination; Mordor.\u003c/p\u003e\n\u003cp\u003eSo I’m going there via Endwaith.\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-17T15:15:36Z",
  "modifiedTime": "2025-04-17T15:35:04Z"
}
