{
  "id": "85cd1156-fec0-4303-81c2-d8e2b181f458",
  "title": "Balatro gets a second set of free card cosmetics inspired by Cyberpunk 2077, Stardew Valley and others",
  "link": "https://www.rockpapershotgun.com/balatro-gets-a-second-set-of-free-card-cosmetics-inspired-by-cyberpunk-2077-stardew-valley-and-others",
  "description": "I played Balatro for an hour, had a pleasant time, then uninstalled it. I know a trap when I see one. Perhaps you are made of stronger stuff than I am, however. Perhaps you like that monkey on your back. For you, there's a new free update, which adds a second set of themed card art to the game inspired by the games Binding Of Isaac, Cyberpunk 2077, Stardew Valley and Slay The Spire. Read more",
  "author": "Graham Smith",
  "published": "Thu, 24 Oct 2024 20:41:13 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Bird view / Isometric",
    "Indie",
    "Strategy",
    "Card Games",
    "Balatro",
    "PC",
    "Playstack",
    "LocalThunk",
    "Single Player"
  ],
  "byline": "Graham Smith",
  "length": 2194,
  "excerpt": "Balatro's Friends Of Jimbo 2 is a free update which adds card art inspired by Slay The Spire, Binding Of Isaac, Stardew Valley and Cyberpunk 2077.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/90347b9b4695dd653aeafc639396a939/icon/apple-touch-icon.png",
  "text": "Image credit: LocalThunk I played Balatro for an hour, had a pleasant time, then uninstalled it. I know a trap when I see one. Perhaps you are made of stronger stuff than I am, however. Perhaps you like that monkey on your back. For you, there's a new free update, which adds a second set of themed card art to the game inspired by the games Binding Of Isaac, Cyberpunk 2077, Stardew Valley and Slay The Spire. Balatro - Friends of Jimbo (Pack 2) | Reveal Trailer Balatro's Friends Of Jimbo 2 update.Watch on YouTube These aren't new cards, they're just card skins and so only make a cosmetic difference to the game. You can switch to the new card art via a new Customise Deck settings menu in-game. Or presumably a \"Customize Deck\" menu, but I can't bring myself to spell it that way. The first Friends Of Jimbo free update dropped back in August and likewise added card art related to four other games: The Witcher 3, Dave The Diver, Vampire Survivors and Among Us. While my time with Balatro was short, other treehouse dwellers here at RPS dove deeper into the decks. Katharine gave it a Bestest Best in her Balatro review, and made a strong case for the worthiness of spending time with it: Ultimately, Balatro is a game that delights in the art of making numbers go up - big, fast and on fire - by whatever means necessary. It reels you back in not to exploit psychological weakness, but to celebrate the inherent joy of learning, mastering and beating a system gamed around impossible odds, all while being just a teeny bit naughty in the process. It not only invites you to sit at the table, but openly hands you all manner of scalpels to tear into it, make it bleed, and gut it for everything it's worth - and it will smile and applaud you for it every step of the way. Balatro is very generous, in that sense, even when victories are seemingly few and far between. Indeed, the only way I ever felt cheated by Balatro is when I had to stop playing and not spend more time playing Balatro. Sounds great! I'm still not falling for it, though. Sure, Katharine said all that back in February, but has anyone heard from her since?",
  "image": "https://assetsio.gnwcdn.com/balatro-friends-of-jimbo-2.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/balatro-friends-of-jimbo-2.png?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/balatro-friends-of-jimbo-2.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/balatro-friends-of-jimbo-2.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/balatro-friends-of-jimbo-2.png?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Friends Of Jimbo 2, a free update adding new card art to Balatro.\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eLocalThunk\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003eI played \u003ca href=\"https://www.rockpapershotgun.com/games/balatro\"\u003eBalatro\u003c/a\u003e for an hour, had a pleasant time, then uninstalled it. I know a trap when I see one. Perhaps you are made of stronger stuff than I am, however. Perhaps you like that monkey on your back. For you, there\u0026#39;s a new free update, which adds a second set of themed card art to the game inspired by the games Binding Of Isaac, Cyberpunk 2077, Stardew Valley and Slay The Spire.\n\u003c/p\u003e\n\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Balatro - Friends of Jimbo (Pack 2) | Reveal Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/tQAUHE5CNOw?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/tQAUHE5CNOw/hqdefault.jpg\"/\u003e\u003cspan\u003eBalatro - Friends of Jimbo (Pack 2) | Reveal Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/tQAUHE5CNOw?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/tQAUHE5CNOw?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eBalatro\u0026#39;s Friends Of Jimbo 2 update.\u003ca href=\"https://www.youtube.com/watch?v=tQAUHE5CNOw\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThese aren\u0026#39;t new cards, they\u0026#39;re just card skins and so only make a cosmetic difference to the game. You can switch to the new card art via a new Customise Deck settings menu in-game. Or presumably a \u0026#34;Customize Deck\u0026#34; menu, but I can\u0026#39;t bring myself to spell it that way.\n\u003c/p\u003e\n\u003cp\u003eThe first Friends Of Jimbo free update dropped back in August and likewise added card art related to four other games: The Witcher 3, Dave The Diver, Vampire Survivors and Among Us. \n\u003c/p\u003e\n\u003cp\u003eWhile my time with Balatro was short, other treehouse dwellers here at RPS dove deeper into the decks. Katharine gave it a Bestest Best in her \u003ca href=\"https://www.rockpapershotgun.com/balatro-review\"\u003eBalatro review\u003c/a\u003e, and made a strong case for the worthiness of spending time with it:\n\u003c/p\u003e\n\u003cblockquote\u003eUltimately, Balatro is a game that delights in the art of making numbers go up - big, fast and on fire - by whatever means necessary. It reels you back in not to exploit psychological weakness, but to celebrate the inherent joy of learning, mastering and beating a system gamed around impossible odds, all while being just a teeny bit naughty in the process. It not only invites you to sit at the table, but openly hands you all manner of scalpels to tear into it, make it bleed, and gut it for everything it\u0026#39;s worth - and it will smile and applaud you for it every step of the way. Balatro is very generous, in that sense, even when victories are seemingly few and far between. Indeed, the only way I ever felt cheated by Balatro is when I had to stop playing and not spend more time playing Balatro.\u003c/blockquote\u003e\n\u003cp\u003eSounds great! I\u0026#39;m still not falling for it, though. Sure, Katharine said all that back in February, but has anyone heard from her since? \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-24T20:41:13.299141Z",
  "modifiedTime": null
}
