{
  "id": "86b0992a-dbee-4740-a5cc-478d104c2be3",
  "title": "Minecraft Movie's Chicken Jockey Meme Causing Chaos At Theaters With At Least One Incident Involving Police",
  "link": "https://kotaku.com/minecraft-movie-chaos-cops-chicken-jockey-popcorn-meme-1851775174",
  "description": "Over the weekend, A Minecraft Movie hit theaters nationwide. The adaption of Mojang’s uberpopular crafting and survival game has already made over $300 million worldwide. And it’s kickstarted some chaotic scenes at theaters thanks to single line of dialogue. Read more...",
  "author": "Zack Zwiezen",
  "published": "Mon, 07 Apr 2025 21:10:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "minecraft",
    "jason momoa",
    "fads and trends",
    "jack black",
    "in jokes",
    "entertainment culture",
    "markus persson",
    "movie theater",
    "popcorn",
    "steve"
  ],
  "byline": "Zack Zwiezen",
  "length": 3344,
  "excerpt": "Irony-poisoned fans are screaming and tossing popcorn the moment Jack Black says the viral line",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Over the weekend, A Minecraft Movie hit theaters nationwide. The adaption of Mojang’s uberpopular crafting and survival game has already made over $300 million worldwide. And it’s kickstarted some chaotic scenes at theaters thanks to single line of dialogue. Suggested ReadingLive Forever in the Universe of 'New World: Aeternum'Suggested ReadingIn the recently released live-action Minecraft movie starring Jack Black and Jason Momoa, there is a scene in which the characters are forced to fight in a ring. At one point a chicken enters the arena and then a baby zombie is lowered onto the chicken’s back, creating a Chicken Jockey, a rare sighting in the actual Minecraft game. The line and moment, which first appeared in a trailer, has quickly become a viral meme online thanks to social media and TikTok. And while most of the time people just shout out the line and laugh, some showings have reportedly become more chaotic as younger fans and teens toss popcorn, scream, and record the action. At least one of these incidents reportedly led to police being called to remove some troublemakers. As explained in this new video from YouTuber Zyphon, the Chicken Jockey meme has exploded in the last few days as the movie hit theaters. In the video, one particular incident is highlighted involving a large number of younger audience members tossing popcorn in the air the moment the line was uttered. According to Zyphon and others reporting on the incident, the crowd was so rowdy and chaotic that eventually the police were called and some of the people who allegedly started the chaos were removed from the theater before the Minecraft Movie continued. Outside of this incident, you can find plenty of folks sharing clips online of people screaming and clapping and tossing popcorn around the moment Jack Black’s Steve says: “Chicken Jockey.” Other scenes in the movie, including Steve’s introduction earlier in the film, have also become popular moments at which to scream and clap. One theater seems to have even put up a sign asking people to not do it. As for why this is happening, well, it’s a combination of factors. For one, Minecraft is a very popular game and it’s especially popular among younger audience members who might not regularly go to the theater. Another part of this is that a lot of these young moviegoers are irony-poisoned and believe genuine emotions and reactions are “cringe.” So they overreact to things like Chicken Jockey to mask their actual feelings about something. And of course, there’s the fact that these videos are going viral online. Heck, I’m six paragraphs deep into writing about this shit. So if you are a young dude looking to get a hit video, why not go to the opening weekend of Minecraft and film your friends “freaking out” at the mention of chicken jockey? It’s easy clout. And that’s all that matters anymore. Clout and tariffs. Shit sucks. Anyway, while I don’t mind people getting excited about movies, I’m not a fan of throwing popcorn around. That shit is uncool and is super loser behavior. People have to clean that up and many theaters are understaffed, meaning a bunch of overworked and underpaid movie theater employees now have to clean up piles of spilled popcorn before the next showing can begin. Don’t be a dick to people working hard to make sure you can enjoy a movie. .",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6afd5cb530086380af10e56cb164e4fe.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eOver the weekend, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/minecraft-movie-technoblade-tribute-pig-crown-1851775077\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/minecraft-movie-technoblade-tribute-pig-crown-1851775077\"\u003eA \u003cem\u003eMinecraft Movie\u003c/em\u003e hit theaters nationwide\u003c/a\u003e\u003c/span\u003e. The adaption of Mojang’s uberpopular crafting and survival game has already \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/minecraft-movie-box-office-opening-weekend-300-million-1851775046\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/minecraft-movie-box-office-opening-weekend-300-million-1851775046\"\u003emade over $300 million worldwide\u003c/a\u003e\u003c/span\u003e. And it’s kickstarted some chaotic scenes at theaters thanks to single line of dialogue. \u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197298\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Live Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"108\" data-playlist=\"197298,197284,197260\" data-current=\"197298\"\u003e\u003cdiv\u003e\u003cp\u003eLive Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003c/video\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eIn the recently released \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/minecraft-movie-jason-momoa-jack-black-friendship-1851775031?_gl=1*vh6lnn*_ga*MTc0MjY2NTg1OS4xNzQwMzc1OTc4*_ga_V4QNJTT5L0*MTc0NDA0Njk2NC42NS4xLjE3NDQwNDg1MDkuNjAuMC4w\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/minecraft-movie-jason-momoa-jack-black-friendship-1851775031?_gl=1*vh6lnn*_ga*MTc0MjY2NTg1OS4xNzQwMzc1OTc4*_ga_V4QNJTT5L0*MTc0NDA0Njk2NC42NS4xLjE3NDQwNDg1MDkuNjAuMC4w\"\u003elive-action \u003cem\u003eMinecraft \u003c/em\u003emovie starring Jack Black and Jason Momoa\u003c/a\u003e\u003c/span\u003e, there is a scene in which the characters are forced to fight in a ring. At one point a chicken enters the arena and then a baby zombie is lowered onto the chicken’s back, creating a Chicken Jockey, a rare sighting in the actual \u003cem\u003eMinecraft \u003c/em\u003egame. The line and moment, which first appeared in a trailer, has quickly become a viral meme online thanks to social media and TikTok. And while most of the time people just shout out the line and laugh, some showings have reportedly become more chaotic as younger fans and teens toss popcorn, scream, and record the action. At least one of these incidents reportedly led to police being called to remove some troublemakers. \u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://youtu.be/xjjKFmT-kDs\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://youtu.be/xjjKFmT-kDs\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eAs explained in this new video from YouTuber Zyphon\u003c/a\u003e\u003c/span\u003e, the Chicken Jockey meme has exploded in the last few days as the movie hit theaters. In the video, one particular incident is highlighted involving a large number of younger audience members tossing popcorn in the air the moment the line was uttered. \u003c/p\u003e\u003cp\u003eAccording to Zyphon and others reporting on the incident, the crowd was so rowdy and chaotic that eventually the police were called and some of the people who allegedly started the chaos were removed from the theater before the \u003cem\u003eMinecraft Movie \u003c/em\u003econtinued. \u003c/p\u003e\u003cp\u003eOutside of this incident, you can find \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.tiktok.com/search?q=chicken%20jockey\u0026amp;t=1744062582121\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.tiktok.com/search?q=chicken%20jockey\u0026amp;t=1744062582121\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eplenty of folks sharing clips online\u003c/a\u003e\u003c/span\u003e of people \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.tiktok.com/@willyispr0/video/7489979161075846446?q=chicken%20jockey\u0026amp;t=1744062582121\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.tiktok.com/@willyispr0/video/7489979161075846446?q=chicken%20jockey\u0026amp;t=1744062582121\" target=\"_blank\" rel=\"noopener noreferrer\"\u003escreaming and clapping and tossing popcorn around the moment\u003c/a\u003e\u003c/span\u003e Jack Black’s Steve says: “\u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/cureflamingofan/status/1908629932005351527\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/cureflamingofan/status/1908629932005351527\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eChicken Jockey\u003c/a\u003e\u003c/span\u003e.” Other scenes in the movie, including Steve’s introduction earlier in the film, have also become popular moments at which to scream and clap. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://x.com/shitpost_2077/status/1908953937459237198\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://x.com/shitpost_2077/status/1908953937459237198\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eOne theater seems to have even put up a sign\u003c/a\u003e\u003c/span\u003e asking people to not do it. \u003c/p\u003e\u003cp\u003eAs for why this is happening, well, it’s a combination of factors. For one, \u003cem\u003eMinecraft \u003c/em\u003eis a very popular game and it’s especially popular among younger audience members who might not regularly go to the theater. Another part of this is that a lot of these young moviegoers are irony-poisoned and believe genuine emotions and reactions are “cringe.” So they overreact to things like Chicken Jockey to mask their actual feelings about something. And of course, there’s the fact that these videos are going viral online. \u003c/p\u003e\u003cp\u003eHeck, I’m six paragraphs deep into writing about this shit. So if you are a young dude looking to get a hit video, why not go to the opening weekend of \u003cem\u003eMinecraft \u003c/em\u003eand film your friends “freaking out” at the mention of chicken jockey? It’s easy clout. And that’s all that matters anymore. Clout and tariffs. Shit sucks. \u003c/p\u003e\u003cp\u003eAnyway, while I don’t mind people getting excited about movies, I’m not a fan of throwing popcorn around. That shit is uncool and is super loser behavior. People have to clean that up and many theaters are understaffed, meaning a bunch of overworked and underpaid movie theater employees now have to clean up piles of spilled popcorn before the next showing can begin. Don’t be a dick to people working hard to make sure you can enjoy a movie. \u003c/p\u003e\u003cp\u003e .\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-07T17:10:00-04:00",
  "modifiedTime": null
}
