{
  "id": "90eff696-2458-4e48-8e18-f644a8c33e9b",
  "title": "Those Nintendo Switch 2 Elden Ring extras are coming to PC as well, just don't get too excited about them",
  "link": "https://www.rockpapershotgun.com/those-nintendo-switch-2-elden-ring-extras-are-coming-to-pc-as-well-just-dont-get-too-excited-about-them",
  "description": "Last month, FromSoftware announced that Elden Ring would be coming to the Nintendo Switch 2, which is wonderful for that plumber guy, but mostly meant piss all for us PC people. The thing is, this version of the game actually comes with some new stuff, and I like new stuff, and publisher Bandai Namco only vaguely said all the new bits would be coming to \"other platforms\". But! I bring good news, as yes, the Switch 2 Tarnished Edition extras are coming to PC as part of a Tarnished Pack DLC. Read more",
  "author": "Oisin Kuhnke",
  "published": "Tue, 06 May 2025 21:54:13 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Third person",
    "Fantasy",
    "Bandai Namco Entertainment",
    "Action Adventure",
    "PS4",
    "Xbox One",
    "Elden Ring",
    "Single Player",
    "Multiplayer Cooperative",
    "Xbox Series X/S",
    "Multiplayer Competitive",
    "Open World",
    "PC",
    "RPG",
    "FromSoftware",
    "PS5"
  ],
  "byline": "Oisin Kuhnke",
  "length": 1671,
  "excerpt": "The non-Nintendo Switch 2 versions of Elden Ring will be getting a DLC pack that is being included in the Tarnished Edition version of the game.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/c1f4c5cf0cd5ffb54eec6347749b457f/icon/apple-touch-icon.png",
  "text": "Last month, FromSoftware announced that Elden Ring would be coming to the Nintendo Switch 2, which is wonderful for that plumber guy, but mostly meant piss all for us PC people. The thing is, this version of the game actually comes with some new stuff, and I like new stuff, and publisher Bandai Namco only vaguely said all the new bits would be coming to \"other platforms\". But! I bring good news, as yes, the Switch 2 Tarnished Edition extras are coming to PC as part of a Tarnished Pack DLC. This comes from the first FromSoftware Games Event Spring 2025, held earlier today, which Famitsu covered and RPG Site kindly extrapolated details from. Now, to be clear, there aren't many details, but something is better than nothing. For one, there'll be a total of four new armour sets to acquire. On top of that there's two new starting classes, Knight of Ides, and Heavy Armored Knight, both of which are, you guessed it, knights! Not particularly exciting given that there's already some knight options, but what can you do? These two knights make up two of the four new armour sets. You'll also have a total of three new looks for your trusty steed Torrent, which I suppose is more than the none you could choose from before. Apparently some more weapons and skills are being added into the Soulslike too. At the very least, FromSoftware did say that the DLC pack will be cheap for those not on Switch 2, though I am a bit surprised this isn't just coming in the form of a free update. Now all we need to do is cross our fingers that that Not Bloodborne 2 But It's Basically Bloodborne 2 Except It's An Online Game game The Duskbloods comes to PC eventually too.",
  "image": "https://assetsio.gnwcdn.com/sony-buying-kadokawa-parent-fromsoftware-elden-ring-1.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nLast month, \u003ca href=\"https://www.rockpapershotgun.com/companies/fromsoftware\"\u003eFromSoftware\u003c/a\u003e announced that \u003ca href=\"https://www.rockpapershotgun.com/games/elden-ring\"\u003eElden Ring\u003c/a\u003e would be coming to the Nintendo Switch 2, which is wonderful for that plumber guy, but mostly meant piss all for us PC people. The thing is, this version of the game actually comes with some new stuff, and I like new stuff, and publisher \u003ca href=\"https://www.rockpapershotgun.com/companies/bandai-namco-entertainment\"\u003eBandai Namco\u003c/a\u003e only vaguely said all the new bits would be coming to \u0026#34;other platforms\u0026#34;. But! I bring good news, as yes, the Switch 2 Tarnished Edition extras are coming to PC as part of a Tarnished Pack DLC.\n\u003c/p\u003e\n\n\u003cp\u003e\nThis comes from the first FromSoftware Games Event Spring 2025, held earlier today, which \u003ca href=\"https://www.famitsu.com/article/202505/41423\"\u003eFamitsu\u003c/a\u003e covered and \u003ca href=\"https://www.rpgsite.net/news/17375-elden-ring-tarnished-edition-will-add-2-new-classes-among-others\"\u003eRPG Site\u003c/a\u003e kindly extrapolated details from. Now, to be clear, there aren\u0026#39;t many details, but something is better than nothing. For one, there\u0026#39;ll be a total of four new armour sets to acquire. On top of that there\u0026#39;s two new starting classes, Knight of Ides, and Heavy Armored Knight, both of which are, you guessed it, knights! Not particularly exciting given that there\u0026#39;s already some knight options, but what can you do? These two knights make up two of the four new armour sets.\n\u003c/p\u003e\n\u003cp\u003e\nYou\u0026#39;ll also have a total of three new looks for your trusty steed Torrent, which I suppose is more than the none you could choose from before. Apparently some more weapons and skills are being added into the \u003ca href=\"https://www.rockpapershotgun.com/the-best-soulslike-games\"\u003eSoulslike\u003c/a\u003e too. At the very least, FromSoftware did say that the DLC pack will be cheap for those not on Switch 2, though I am a bit surprised this isn\u0026#39;t just coming in the form of a free update.\n\u003c/p\u003e\n\u003cp\u003e\nNow all we need to do is cross our fingers that that \u003ca href=\"https://www.rockpapershotgun.com/give-us-the-damn-moon-nintendo\"\u003eNot Bloodborne 2 But It\u0026#39;s Basically Bloodborne 2 Except It\u0026#39;s An Online Game game The Duskbloods\u003c/a\u003e comes to PC eventually too.\n\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-06T21:54:13.176229Z",
  "modifiedTime": null
}
