{
  "id": "98fc01f9-833e-4026-a298-37180c91c2c0",
  "title": "In strategy game Sintopia you harvest a whole civilisation's souls for your own custom-built hell",
  "link": "https://www.rockpapershotgun.com/in-strategy-game-sintopia-you-harvest-a-whole-civilisations-souls-for-your-own-custom-built-hell",
  "description": "One of my favourite satires is the Screwtape Letters, an epistolary novel by Narnia scribe C.S. Lewis. It consists of messages from an oily elder demon to his nephew about how to correctly groom the soul of an unsuspecting human being. It's a claustrophobic send-up of managerial politics and nepotism, with World War 1 unfolding in the background. A real pick-me-up. Sintopia is the Two Point incarnation of that premise - in other words, brighter and breezier and definitely more slapstick than Christian. It puts you in charge of a world divided between Earth and hell, and challenges you to ensure a steady movement of optimally sinful souls between one and the other. Say your prayers and watch the trailer. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Wed, 30 Oct 2024 17:49:53 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "PC",
    "Fantasy",
    "Sintopia",
    "Strategy",
    "Management"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 2499,
  "excerpt": "One of my favourite satires is the Screwtape Letters, an epistolary novel by Narnia scribe C.S. Lewis. It consists of m…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/011da58a208812cdf30e392ed60f1cb1/icon/apple-touch-icon.png",
  "text": "Image credit: Team 17 / Piraknights One of my favourite satires is the Screwtape Letters, an epistolary novel by Narnia scribe C.S. Lewis. It consists of messages from an oily elder demon to his nephew about how to correctly groom the soul of an unsuspecting human being. It's a claustrophobic send-up of managerial politics and nepotism, with World War 1 unfolding in the background. A real pick-me-up. Sintopia is the Two Point incarnation of that premise - in other words, brighter and breezier and definitely more slapstick than Christian. It puts you in charge of a world divided between Earth and hell, and challenges you to ensure a steady movement of optimally sinful souls between one and the other. Say your prayers and watch the trailer. Sintopia | Announcement Trailer Watch on YouTube French developers Piraknights describe themselves as \"part pirates, part knights\", but I think they're lying. In all my years of doing this, I've never heard of pirates and knights joining forces to make a video game. No, I refuse to accept that it's a joke. Similarly, I refuse to believe that there are only 17 people working for Team 17, who are publishing the game. This is all some kind of diabolical deception - a classic Screwtape ruse. The only thing we can trust here is the announcement press release, which contains some blurb: Sintopia is a mix of builder and God game, with an asymmetrical loop. On the OVERWORLD, influence a silly civilization of chickpea people make their mark on the world and unfortunately for them, damn themselves by committing a host of sins. Punish the dead souls, keep your receipts for accounts and generate profit to help you build and sustain your Hellish empire. It's hard to get a precise sense of the game flow but this seems like a jolly take on the management sim fundamentals. One additional wrinkle is that you don't want the aforesaid chickpea people to get too sinful, because this will give Hell explosive indigestion (I am partial to chickpeas and can attest that this is a risk). \"Make sure your souls go through an effective \"re-education\" to avoid a build-up of their Sins across many lives,\" the press release cautions. \"No one wants to face the demonic invasion that will inevitably result from having too much corruption in the world.\" There doesn't appear to be a store page for Sintopia yet, but you can read a bit more on the game's official site. It's coming to early access in 2025.",
  "image": "https://assetsio.gnwcdn.com/1_ZrvboCw.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/1_ZrvboCw.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/1_ZrvboCw.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/1_ZrvboCw.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/1_ZrvboCw.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A floating island world with a hellish cave beneath and a green and blue civilisation on top in Sintopia\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eTeam 17 / Piraknights\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003eOne of my favourite satires is the Screwtape Letters, an epistolary novel by Narnia scribe C.S. Lewis. It consists of messages from an oily elder demon to his nephew about how to correctly groom the soul of an unsuspecting human being. It\u0026#39;s a claustrophobic send-up of managerial politics and nepotism, with World War 1 unfolding in the background. A real pick-me-up. Sintopia is the \u003ca href=\"https://www.rockpapershotgun.com/games/two-point-campus\"\u003eTwo Point\u003c/a\u003e incarnation of that premise - in other words, brighter and breezier and definitely more slapstick than Christian. It puts you in charge of a world divided between Earth and hell, and challenges you to ensure a steady movement of optimally sinful souls between one and the other. Say your prayers and watch the trailer.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Sintopia | Announcement Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/YRmlUl1vXXc?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/YRmlUl1vXXc/hqdefault.jpg\"/\u003e\u003cspan\u003eSintopia | Announcement Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/YRmlUl1vXXc?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/YRmlUl1vXXc?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=YRmlUl1vXXc\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003eFrench developers Piraknights describe themselves as \u0026#34;part pirates, part knights\u0026#34;, but I think they\u0026#39;re lying. In all my years of doing this, I\u0026#39;ve never heard of pirates and knights joining forces to make a video game. No, I refuse to accept that it\u0026#39;s a joke. Similarly, I refuse to believe that there are only 17 people working for Team 17, who are publishing the game. This is all some kind of diabolical deception - a classic Screwtape ruse. The only thing we can trust here is the announcement press release, which contains some blurb:\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003eSintopia is a mix of builder and God game, with an asymmetrical loop. On the OVERWORLD, influence a silly civilization of chickpea people make their mark on the world and unfortunately for them, damn themselves by committing a host of sins. Punish the dead souls, keep your receipts for accounts and generate profit to help you build and sustain your Hellish empire.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eIt\u0026#39;s hard to get a precise sense of the game flow but this seems like a jolly take on the \u003ca href=\"https://www.rockpapershotgun.com/best-management-games\"\u003emanagement sim\u003c/a\u003e fundamentals. One additional wrinkle is that you don\u0026#39;t want the aforesaid chickpea people to get \u003cem\u003etoo\u003c/em\u003e sinful, because this will give Hell explosive indigestion (I am partial to chickpeas and can attest that this is a risk). \u0026#34;Make sure your souls go through an effective \u0026#34;re-education\u0026#34; to avoid a build-up of their Sins across many lives,\u0026#34; the press release cautions. \u0026#34;No one wants to face the demonic invasion that will inevitably result from having too much corruption in the world.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThere doesn\u0026#39;t appear to be a store page for Sintopia yet, but you can read a bit more on \u003ca href=\"https://www.piraknights.com/games\"\u003ethe game\u0026#39;s official site\u003c/a\u003e. It\u0026#39;s coming to early access in 2025.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-30T17:49:53.332217Z",
  "modifiedTime": null
}
