{
  "id": "991e9f5c-bf8c-4f84-94b7-9aa4e4e9439d",
  "title": "\"We have no official information on an Oblivion remake,\" say Bethesda, which isn't a denial, is it",
  "link": "https://www.rockpapershotgun.com/we-have-no-official-information-on-an-oblivion-remake-say-bethesda-which-isnt-a-denial-is-it",
  "description": "The Elder Scrolls IV: Oblivion's remake is near upon us, going by the Loud Noises online. Somebody's finally managed to get a response out of Bethesda regarding the much-tipped Oblivion comeback, and it is that special flavour of non-committal that attracts the true believers like wasps to a capsized icecream van. \"We have no official information on an Oblivion remake,\" observed the company's Support staff in a response to some nosy parker last week. \"Apologies for any confusion.\" Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Mon, 14 Apr 2025 16:06:27 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Vir2L Studios",
    "2K Games",
    "PC",
    "PS3",
    "Superscape",
    "Bethesda Softworks",
    "Third person",
    "Action Adventure",
    "First person",
    "The Elder Scrolls IV: Oblivion",
    "Single Player",
    "Ubisoft",
    "Xbox 360",
    "RPG",
    "4J Studios",
    "Bethesda Game Studios",
    "Ubisoft Entertainment"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 2511,
  "excerpt": "The rumoured Elder Scrolls 4 remake is tipped to release this very month.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/b6346e05d1633e5c39eb3dee99272ccc/icon/apple-touch-icon.png",
  "text": "Latest Elder Scrolls 4 gossip points to April release Image credit: Microsoft The Elder Scrolls IV: Oblivion's remake is near upon us, going by the Loud Noises online. Somebody's finally managed to get a response out of Bethesda regarding the much-tipped Oblivion comeback, and it is that special flavour of non-committal that attracts the true believers like wasps to a capsized icecream van. \"We have no official information on an Oblivion remake,\" observed the company's Support staff in a response to some nosy parker last week. \"Apologies for any confusion.\" Thanks to The Gamer for spotting the above. I've been avoiding a lot of the rumours because frankly, many of them read like people converting to Unitology after stumbling on an extra-twisty Nik Nak. But there are now enough of them that I can mash them all together like I'm turning junk bonds into triple-A securities, and pass the results off as reporting. Seriously, though, there's quite a lot of smoke in the air. It feels increasingly like there's an announcement in the offing. Here's a quick round-up of the most substantial and/or recent pieces of gossip. - Back in 2023, Microsoft accidentally shared a 2020 planning document with details of several possible projects, including a new version of Oblivion. - This January, MP1st dug up a former Virtuos employee's CV which makes mention of an Unreal Engine 5 Oblivion remake, detailing improvements to the RPG's stealth, stamina and blocking. - But a few days ago, The Elder Scrolls IV: Oblivion Game Of The Year Steam page was updated to remove some older trailers. Routine housekeeping? - Jeff Grubb, a dependable disseminator of insider gossip, has claimed on Giant Bomb's 7th April The Power Block video that the reveal is definitely coming this month. - NateTheHate claims the remake will be revealed and released this month, in comments green-ticked by Andy Robinson of Vero Gusto Computing. Andy Robinson once beat me at Mortal Kombat in front of Netherrealm and I despise him to this day, but I have never known him to tell a fib about a video game. If you're ambivalent about Oblivion, or disinclined to engage with anything Microsoft-backed in light of recent reporting, you might prefer to check out certain community initiatives that take inspiration from Oblivion, like this persuasion-themed game jam. There's also this fun demake co-starring Bethesda's indefatigable Adoring Fan.",
  "image": "https://assetsio.gnwcdn.com/oblivion-pizza-mod.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n  \n\n        \u003cp\u003eLatest Elder Scrolls 4 gossip points to April release\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/oblivion-pizza-mod.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/oblivion-pizza-mod.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/oblivion-pizza-mod.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/oblivion-pizza-mod.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"An NPC in a pizza outfit in Elder Scrolls IV: Oblivion says to the player, \u0026#34;Hello. I assume you are here to order some pizza?\u0026#34;\" width=\"690\" height=\"383\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eMicrosoft\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/the-elder-scrolls-iv-oblivion\"\u003eThe Elder Scrolls IV: Oblivion\u003c/a\u003e\u0026#39;s remake is near upon us, going by the Loud Noises online. Somebody\u0026#39;s finally managed to get a response out of Bethesda regarding the much-tipped Oblivion comeback, and it is that special flavour of non-committal that attracts the true believers like wasps to a capsized icecream van. \u0026#34;We have no official information on an Oblivion remake,\u0026#34; observed the company\u0026#39;s Support staff in a \u003ca href=\"https://x.com/BethesdaSupport/status/1909296361503174761?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1909296361503174761%7Ctwgr%5E874b2fca725c12b2e6308c72ab0ce2fe03d343f8%7Ctwcon%5Es1_\u0026amp;ref_url=https%3A%2F%2Fwww.thegamer.com%2Foblivion-remake-elder-scrolls-bethesda-support-denies-rumours-no-information%2F\"\u003eresponse\u003c/a\u003e to some nosy parker last week. \u0026#34;Apologies for any confusion.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThanks to \u003ca href=\"https://www.thegamer.com/oblivion-remake-elder-scrolls-bethesda-support-denies-rumours-no-information/\"\u003eThe Gamer\u003c/a\u003e for spotting the above. I\u0026#39;ve been avoiding a lot of the rumours because frankly, many of them read like people converting to \u003ca href=\"https://deadspace.fandom.com/wiki/Unitology\"\u003eUnitology\u003c/a\u003e after stumbling on an extra-twisty Nik Nak. But there are now enough of them that I can mash them all together like I\u0026#39;m turning junk bonds into triple-A securities, and pass the results off as reporting. Seriously, though, there\u0026#39;s quite a lot of smoke in the air. It feels increasingly like there\u0026#39;s an announcement in the offing. Here\u0026#39;s a quick round-up of the most substantial and/or recent pieces of gossip.\u003c/p\u003e\n\u003cp\u003e- Back in 2023, Microsoft \u003ca href=\"https://www.rockpapershotgun.com/dishonored-3-plus-fallout-3-and-elder-scrolls-4-oblivion-remasters-appear-on-leaked-microsoft-doc\"\u003eaccidentally shared\u003c/a\u003e a 2020 planning document with details of several possible projects, including a new version of Oblivion.\u003c/p\u003e\n\u003cp\u003e- This January, MP1st \u003ca href=\"https://mp1st.com/news/the-elder-scrolls-oblivion-remake-real-gameplay-improvement-details\"\u003edug up a former Virtuos employee\u0026#39;s CV\u003c/a\u003e which makes mention of an Unreal Engine 5 Oblivion remake, detailing improvements to the \u003ca href=\"https://www.rockpapershotgun.com/best-rpgs\"\u003eRPG\u003c/a\u003e\u0026#39;s stealth, stamina and blocking.\u003c/p\u003e\n\u003cp\u003e- But a few days ago, The Elder Scrolls IV: Oblivion Game Of The Year Steam page \u003ca href=\"https://steamdb.info/app/900883/history/\"\u003ewas updated\u003c/a\u003e to remove some older trailers. Routine housekeeping?\u003c/p\u003e\n\u003cp\u003e- Jeff Grubb, a dependable disseminator of insider gossip, has claimed on Giant Bomb\u0026#39;s 7th April \u003ca href=\"https://www.youtube.com/watch?v=Ifsfg5XFuRI\"\u003eThe Power Block\u003c/a\u003e video that the reveal is definitely coming this month.\u003c/p\u003e\n\u003cp\u003e- \u003ca href=\"https://x.com/NateTheHate2/status/1900277200592548120\"\u003eNateTheHate\u003c/a\u003e claims the remake will be revealed \u003cem\u003eand\u003c/em\u003e released this month, in comments green-ticked by \u003ca href=\"https://x.com/Andy_VGC/status/1900289910801916177\"\u003eAndy Robinson\u003c/a\u003e of Vero Gusto Computing. Andy Robinson once beat me at Mortal Kombat in front of Netherrealm and I despise him to this day, but I have never known him to tell a fib about a video game.\u003c/p\u003e\n\u003cp\u003eIf you\u0026#39;re ambivalent about Oblivion, or disinclined to engage with anything Microsoft-backed \u003ca href=\"https://www.rockpapershotgun.com/bds-calls-for-boycott-of-microsoft-and-xbox-gaming-products-over-alleged-israeli-military-connections\"\u003ein light of recent reporting\u003c/a\u003e, you might prefer to check out certain community initiatives that take inspiration from Oblivion, like \u003ca href=\"https://www.rockpapershotgun.com/elder-scrolls-4-oblivion-gets-a-whole-gamejam-dedicated-to-persuasion-pie-co-hosted-by-a-dont-nod-developer\"\u003ethis persuasion-themed game jam\u003c/a\u003e. There\u0026#39;s also \u003ca href=\"https://www.reddit.com/r/oblivion/comments/1jyh4fx/oblivion_remake_official_footage/?utm_name=web3xcss\"\u003ethis fun demake\u003c/a\u003e co-starring Bethesda\u0026#39;s indefatigable Adoring Fan.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-14T16:06:27.51941Z",
  "modifiedTime": null
}
