{
  "id": "9a6b0eaf-4415-471a-a4ca-53ec2651610b",
  "title": "DOOM: The Dark Ages – Going Hands-on with Story, Sandboxes, Mechs, and Dragons",
  "link": "https://news.xbox.com/en-us/2025/03/31/doom-the-dark-ages-preview-story-sandbox-mech-dragon/",
  "description": "The post DOOM: The Dark Ages – Going Hands-on with Story, Sandboxes, Mechs, and Dragons appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Mon, 31 Mar 2025 14:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Cloud Gaming",
    "Games",
    "PC Gaming",
    "Xbox Game Pass",
    "Bethesda",
    "Cloud",
    "Doom",
    "Doom: The Dark Ages",
    "Game Pass",
    "id Software",
    "PC",
    "Xbox",
    "Xbox Game Studios",
    "Xbox Series X|S"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 13792,
  "excerpt": "We played three hours of DOOM: The Dark Ages, and found a game that sits comfortably in the series, while violently breaking free of expectations.",
  "siteName": "Xbox Wire",
  "favicon": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "As the third part of what you might call a trilogy, I went into my first hands-on for DOOM: The Dark Ages with some expectations. While they have their differences, DOOM (2016) and DOOM: Eternal had lain the groundwork – I felt like I knew what id Software had in store for me, even if this prequel story and its new medieval sci-fi aesthetic might put it in a different context. Three hours later, my expectations had been blasted to pieces like so much Arachnotron meat. DOOM: The Dark Ages retains the core hallmarks of id’s recent games – pulse-pounding combat, gloriously Grand Guignol aesthetics, and music as ear-rattling as its guns – but it pushes the structure of DOOM far beyond what we’ve known before. I was able to play slices of four distinct sections of The Dark Ages, each designed to show me a different facet of the game, and each revealing quite how wild this will get. Let me walk you through each one. Story Mission “Before he became a hero, he was the super weapon of gods and kings.” So reads the text slate that opens DOOM: The Dark Ages. It’s an absurdly badass mission statement for the game that follows. But, playing just the opening stretch of the game, it pays off multiple times. This section showed off the most familiar form of DOOM. A cutscene (yes, there are cutscenes for the story now, not just codex entries) introduces the demon-beleaguered planet of Argent D’Nur, the questionably benevolent god-race known as the Makyrs, and our familiar lead character kept captive to be unleashed on hellish threats. And from there, I’m handed a shotgun and a shield, and told to do what a DOOM Slayer does best. You’ll feel right at home with this, until you don’t. Levels remain tightly knotted, oscillating from cramped corridors to wide-open arenas built for athletic combat. Your guns sre, of course, hideously powerful and there’s still a focus on attack being the best form of defence, with specific moves rewarding health and ammo, forcing you to fight to survive. But begin digging deeper, and you’ll see how things have changed. That shield is the most evident example – enemy projectiles are now plentiful, forcing you to block as much as dodge. But don’t think this is a more static game as a result – blocking also opens up the ability to shield charge enemies, closing gaps and dealing huge area-of-effect damage. Parrying is even better – certain enemy attacks are marked with green effects, and blocking within a parry window can stun enemies, shatter their defences, and earn more charges for your devastating melee attacks. Some fights effectively rely on a rhythm of parries and attacks, turning a fight with a Cyberdemon into a close-range slugfest – it feels magnificent. Soon, I’m given even more utility in the form of the Shield Saw – my shield can now be thrown like I’m some horrifically violent Captain America, bisecting weak enemies and stunning larger ones. It can also be used to solve puzzles, opening up DOOM’s classic secret areas. And if all of this didn’t feel fresh enough, I’m then introduced to a full upgrade system. This is less about old-school RPG stat-buffing, and more about giving you extra options to take on the forces of hell. For example, I add the ability for my Shredder (a fully automatic gun that fires rail spikes) to embed its ammo in enemies, and then detonate them when I throw my Shield Saw into the target, building new abilities not just into my gun, but across my moveset. Every single weapon, both ranged and melee, has an upgrade tree – I want to see how gross these can get. Taken all together, you can see how The Dark Ages lives up to the idea that you’re playing as a super weapon. This is pure power fantasy, placing you in the big, green boots of a one-man army who’s going to war with everything. And that’s before your super weapon gets into, well, an even bigger super weapon. Mech Mission If you’ve watched the trailers for The Dark Ages, then you know you’ll be getting a mech along the way. The Atlan, as it’s known, allows you to take an earthquaking step into the battlefield to take on Hell’s biggest threats – and in practice, it’s a way of transforming the on-foot experience into something new. As you might expect, this is a slower, but stronger approach to DOOM combat. Your Atlan trades mostly in melee – basic attacks involve throwing punches at titanic demons, building up a combo meter that can be traded in for one of two special moves, a stunning stomp, or a knockout blow. You’ll need to balance those combos with dodges – taking one hit from an enemy sets your combo meter back to zero so, with a rhythm familiar from the parry system, you’ll need to avoid what you can to keep the punishment coming. And, just as I was getting used to all this, an orbital drop delivered me a set of Empire State Building-sized miniguns, to add some truly berserk flair to the end of the level. It’s ludicrous, in the best possible way. Think of the mech as a side dish to The Dark Ages’ main meal – it’s a complement to the regular on-foot combat, mixing things up while feeling similar enough not to feel out of place. Dragon Mission Here’s where things took an even less expected turn. My next mission involved me summoning a cybernetic dragon, hopping into a saddle equipped with heavy ordnance, and taking to the skies. In this section of the game, I’m defending a flying city under attack from a demon fleet, with the goal of taking down four separate Hell Carrier ships. Your dragon is a free-flying beast, equipped with dodges and afterburners, able to maneuver through the skies however you see fit. Like, the mech, it’s strong enough to take on titans – but how you do it is quite different. After locking onto an enemy, you can strafe around them. Your basic attacks do a small amount of damage, but each successful dodge supercharges your guns, letting you stun your prey, before sending your dragon to perform a gruesome finisher. Initially, it feels like this is another Atlan-like diversion, a way of providing a different kind of combat – but when it comes to the flagships themselves, it goes further. Each ship needs to be taken down in a specific way – first you take out its various gun batteries, and subsequently its shield generator with your dragon’s moveset. This then opens up a landing spot. With a click of the right stick, your dragon lands, the Slayer hops off, and you realize that each ship is a miniature level to progress through on foot. You barrage through the innards of the ship, eliminating the demons inside, before reaching its engine. Shield charging the engine destroys the ship, and sees you skydiving through an explosion and back onto your dragon to repeat the feat. This mix of flying and on-foot gameplay feels incredible – and each new ship changes the make-up enough that it doesn’t fall into a predictable pattern. I’d call this the most revolutionary change to DOOM’s make-up, if it wasn’t for the next section. Sandbox Mission This is where The Dark Ages truly breaks free from expectation. In my final (and longest) section of the demo, I’m placed into id’s take on a sandbox open zone and told to approach it however I’d like. My solitary goal is to close five demon-spewing portals, but how I do it, and what diversions I take, are entirely up to me. Over the course of an hour, I’m repeatedly reminded that I’ve never played a DOOM game like this before. As you’d hope for, this sandbox sequence is stacked with optional goals – heavily protected artillery batteries to take out, caches of gold to spend on upgrades, and more. At one point, I’m simply running somewhere, when a cathedral-sized tentacle bursts out of the ground and begins to attack – this isn’t a scripted moment, or even an objective I’m given, it’s just another surprise hidden along the way. But the core objectives themselves hold surprises, too. In that first story mission, closing portals was simply a case of clearing an arena, but it’s never quite the same in this case. Some portals transport me to a dungeon, requiring me to solve puzzles in order to find my way to the energy source powering them. Others introduce Leader enemies – overpowered beasts who are invulnerable to my attacks until I kill enough of their followers, and come with permanent upgrades after your victory. Along the way, I find new guns, augmenting my armory with new options. It’s restlessly, relentlessly inventive, as if id has been waiting for an opportunity to transplant new ideas into the DOOM format. And that’s the key takeaway from my full session with DOOM: The Dark Ages – this feels like a developer brimming with enthusiasm, not just for DOOM itself, but for what DOOM could be. I was expecting a new story, new guns, and new demons – I wasn’t expecting new genres. I cannot wait to find out what else this team has in store. DOOM: The Dark Ages launches for Xbox Series X|S, PC (via the Xbox app for Windows PC, Steam, and Battle.net), PlayStation 5, and cloud on May 15, 2025. It will be available day one with Game Pass. DOOM: The Dark Ages Premium Edition Bethesda Softworks $99.99 Get a head start on slaying demons with the Premium Edition, including up to 2-Day Early Access* and the campaign DLC**. You’ll also receive the Digital Artbook and Soundtrack, and the Divinity Skin Pack, which includes matching skins for the DOOM Slayer, dragon and Atlan. INCLUDES: – Base Game (digital code) – Up to 2-Day Early Access – Campaign DLC – Digital Artbook and Soundtrack – Divinity Skin Pack *Actual play time depends on purchase date and applicable time zone differences, subject to possible outages. **DLC availability to be provided at a later date. BECOME THE SLAYER IN A MEDIEVAL WAR AGAINST HELL DOOM: The Dark Ages is the prequel to the critically acclaimed DOOM (2016) and DOOM Eternal that tells an epic cinematic story worthy of the DOOM Slayer’s legend. In this third installment of the modern DOOM series, players will step into the blood-stained boots of the DOOM Slayer, in this never-before-seen dark and sinister medieval war against Hell. DOOM: The Dark Ages is a dark fantasy/sci-fi single-player experience that delivers the searing combat and over-the-top visuals of the incomparable DOOM franchise, powered by the latest idTech engine. STAND AND FIGHT As the super weapon of gods and kings, shred enemies with devastating favorites like the Super Shotgun while also wielding a variety of new bone-chewing weapons, including the versatile Shield Saw. Players will stand and fight on the demon-infested battlefields in the vicious, grounded combat the original DOOM is famous for. Take flight atop the new fierce Mecha Dragon, stand tall in a massive Atlan mech, and beat demons to a pulp with the newly enhanced glory kill system. Only the Slayer has the power to wield these devastating tools of mayhem. REIGN IN HELL Bound to serve as the super weapon of gods and kings, the DOOM Slayer fends off demon hordes as their leader seeks to destroy the Slayer and become the only one that is feared. Witness the creation of a legend as the Slayer takes on all of Hell and turns the tide of the war. DISCOVER UNKNOWN REALMS In his quest to crush the legions of Hell, the Slayer must take the fight to never-before-seen realms. Mystery, challenges, and rewards lurk in every shadow of ruined castles, epic battlefields, dark forests, ancient hellscapes, and worlds beyond. Armed with the viciously powerful Shield Saw, cut through a dark world of menace and secrets in id's largest and most expansive levels to date. DOOM: The Dark Ages Standard Edition Bethesda Softworks $69.99 BECOME THE SLAYER IN A MEDIEVAL WAR AGAINST HELL DOOM: The Dark Ages is the prequel to the critically acclaimed DOOM (2016) and DOOM Eternal that tells an epic cinematic story worthy of the DOOM Slayer’s legend. In this third installment of the modern DOOM series, players will step into the blood-stained boots of the DOOM Slayer, in this never-before-seen dark and sinister medieval war against Hell. DOOM: The Dark Ages is a dark fantasy/sci-fi single-player experience that delivers the searing combat and over-the-top visuals of the incomparable DOOM franchise, powered by the latest idTech engine. STAND AND FIGHT As the super weapon of gods and kings, shred enemies with devastating favorites like the Super Shotgun while also wielding a variety of new bone-chewing weapons, including the versatile Shield Saw. Players will stand and fight on the demon-infested battlefields in the vicious, grounded combat the original DOOM is famous for. Take flight atop the new fierce Mecha Dragon, stand tall in a massive Atlan mech, and beat demons to a pulp with the newly enhanced glory kill system. Only the Slayer has the power to wield these devastating tools of mayhem. REIGN IN HELL Bound to serve as the super weapon of gods and kings, the DOOM Slayer fends off demon hordes as their leader seeks to destroy the Slayer and become the only one that is feared. Witness the creation of a legend as the Slayer takes on all of Hell and turns the tide of the war. DISCOVER UNKNOWN REALMS In his quest to crush the legions of Hell, the Slayer must take the fight to never-before-seen realms. Mystery, challenges, and rewards lurk in every shadow of ruined castles, epic battlefields, dark forests, ancient hellscapes, and worlds beyond. Armed with the viciously powerful Shield Saw, cut through a dark world of menace and secrets in id's largest and most expansive levels to date.",
  "image": "https://pub-f354ec240bea480db7320bd0e29d972e.r2.dev/sites/2/2025/03/DOOM-TheDarkAges_Standard_1920x1080-a2a0bdc5b6a0a045e7f4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\t\n\n\u003cdiv\u003e\n\n\u003cp\u003eAs the third part of what you might call a trilogy, I went into my first hands-on for \u003ca href=\"https://www.xbox.com/en-US/games/store/doom-the-dark-ages-premium-edition/9NK3S5DT79LT/0017\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eDOOM: The Dark Ages\u003c/em\u003e\u003c/a\u003e with some expectations. While they have their differences, \u003cem\u003eDOOM (2016) and DOOM: Eternal\u003c/em\u003e had lain the groundwork – I felt like I knew what id Software had in store for me, even if this prequel story and its new medieval sci-fi aesthetic might put it in a different context.\u003c/p\u003e\n\n\n\n\u003cp\u003eThree hours later, my expectations had been blasted to pieces like so much Arachnotron meat.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eDOOM: The Dark Ages \u003c/em\u003eretains the core hallmarks of id’s recent games – pulse-pounding combat, gloriously Grand Guignol aesthetics, and music as ear-rattling as its guns – but it pushes the \u003cem\u003estructure \u003c/em\u003eof DOOM far beyond what we’ve known before.\u003c/p\u003e\n\n\n\n\u003cp\u003eI was able to play slices of four distinct sections of \u003cem\u003eThe Dark Ages\u003c/em\u003e, each designed to show me a different facet of the game, and each revealing quite how wild\u003cem\u003e \u003c/em\u003ethis\u003cem\u003e \u003c/em\u003ewill get. Let me walk you through each one.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eStory Mission\u003c/strong\u003e\u003c/h2\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\n\n\u003cp\u003e“Before he became a hero, he was the super weapon of gods and kings.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSo reads the text slate that opens \u003cem\u003eDOOM: The Dark Ages\u003c/em\u003e. It’s an absurdly badass mission statement for the game that follows. But, playing just the opening stretch of the game, it pays off multiple times.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis section showed off the most familiar form of DOOM. A cutscene (yes, there are cutscenes for the story now, not just codex entries) introduces the demon-beleaguered planet of Argent D’Nur, the questionably benevolent god-race known as the Makyrs, and our familiar lead character kept captive to be unleashed on hellish threats. And from there, I’m handed a shotgun and a shield, and told to do what a DOOM Slayer does best.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll feel right at home with this, until you don’t. Levels remain tightly knotted, oscillating from cramped corridors to wide-open arenas built for athletic combat. Your guns sre, of course, hideously powerful and there’s still a focus on attack being the best form of defence, with specific moves rewarding health and ammo, forcing you to fight to survive.\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eBut begin digging deeper, and you’ll see how things have changed. That shield is the most evident example – enemy projectiles are now plentiful, forcing you to block as much as dodge. But don’t think this is a more static game as a result – blocking also opens up the ability to shield charge enemies, closing gaps and dealing huge area-of-effect damage. \u003c/p\u003e\n\n\n\n\u003cp\u003eParrying is even better – certain enemy attacks are marked with green effects, and blocking within a parry window can stun enemies, shatter their defences, and earn more charges for your devastating melee attacks. Some fights effectively rely on a rhythm of parries and attacks, turning a fight with a Cyberdemon into a close-range slugfest – it feels \u003cem\u003emagnificent\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eSoon, I’m given even more utility in the form of the Shield Saw – my shield can now be thrown like I’m some horrifically violent Captain America, bisecting weak enemies and stunning larger ones. It can also be used to solve puzzles, opening up DOOM’s classic secret areas.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if all of this didn’t feel fresh enough, I’m then introduced to a full upgrade system. This is less about old-school RPG stat-buffing, and more about giving you extra options to take on the forces of hell. For example, I add the ability for my Shredder (a fully automatic gun that fires rail spikes) to embed its ammo in enemies, and then detonate them when I throw my Shield Saw into the target, building new abilities not just into my gun, but across my moveset. Every single weapon, both ranged and melee, has an upgrade tree – I want to see how gross these can get.\u003c/p\u003e\n\n\n\n\u003cp\u003eTaken all together, you can see how \u003cem\u003eThe Dark Ages\u003c/em\u003e lives up to the idea that you’re playing as a super weapon. This is pure power fantasy, placing you in the big, green boots of a one-man army who’s going to war with \u003cem\u003eeverything\u003c/em\u003e. And that’s before your super weapon gets into, well, an even bigger super weapon.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eMech Mission\u003c/strong\u003e\u003c/h2\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eIf you’ve watched the trailers for \u003cem\u003eThe Dark Ages\u003c/em\u003e, then you know you’ll be getting a mech along the way. The Atlan, as it’s known, allows you to take an earthquaking step into the battlefield to take on Hell’s biggest threats – and in practice, it’s a way of transforming the on-foot experience into something new.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs you might expect, this is a slower, but stronger approach to DOOM combat. Your Atlan trades mostly in melee – basic attacks involve throwing punches at titanic demons, building up a combo meter that can be traded in for one of two special moves, a stunning stomp, or a knockout blow.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou’ll need to balance those combos with dodges – taking one hit from an enemy sets your combo meter back to zero so, with a rhythm familiar from the parry system, you’ll need to avoid what you can to keep the punishment coming.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd, just as I was getting used to all this, an orbital drop delivered me a set of Empire State Building-sized miniguns, to add some truly berserk flair to the end of the level. It’s ludicrous, in the best possible way. Think of the mech as a side dish to \u003cem\u003eThe Dark Ages\u003c/em\u003e’ main meal – it’s a complement to the regular on-foot combat, mixing things up while feeling similar enough not to feel out of place.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eDragon Mission\u003c/strong\u003e\u003c/h2\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eHere’s where things took an even less expected turn. My next mission involved me summoning a cybernetic dragon, hopping into a saddle equipped with heavy ordnance, and taking to the skies. In this section of the game, I’m defending a flying city under attack from a demon fleet, with the goal of taking down four separate Hell Carrier ships.\u003c/p\u003e\n\n\n\n\u003cp\u003eYour dragon is a free-flying beast, equipped with dodges and afterburners, able to maneuver through the skies however you see fit. Like, the mech, it’s strong enough to take on titans – but how you do it is quite different. After locking onto an enemy, you can strafe around them. Your basic attacks do a small amount of damage, but each successful dodge supercharges your guns, letting you stun your prey, before sending your dragon to perform a gruesome finisher.\u003c/p\u003e\n\n\n\n\u003cp\u003eInitially, it feels like this is another Atlan-like diversion, a way of providing a different \u003cem\u003ekind\u003c/em\u003e of combat – but when it comes to the flagships themselves, it goes further.\u003c/p\u003e\n\n\n\n\u003cp\u003eEach ship needs to be taken down in a specific way – first you take out its various gun batteries, and subsequently its shield generator with your dragon’s moveset. This then opens up a landing spot. With a click of the right stick, your dragon lands, the Slayer hops off, and you realize that each ship is a miniature level to progress through on foot. You barrage through the innards of the ship, eliminating the demons inside, before reaching its engine. Shield charging the engine destroys the ship, and sees you skydiving through an explosion and back onto your dragon to repeat the feat.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis mix of flying and on-foot gameplay feels incredible – and each new ship changes the make-up enough that it doesn’t fall into a predictable pattern. I’d call this the most revolutionary change to DOOM’s make-up, if it wasn’t for the next section.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eSandbox Mission\u003c/strong\u003e\u003c/h2\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cp\u003eThis is where \u003cem\u003eThe Dark Ages\u003c/em\u003e truly breaks free from expectation. In my final (and longest) section of the demo, I’m placed into id’s take on a sandbox open zone and told to approach it however I’d like. My solitary goal is to close five demon-spewing portals, but how I do it, and what diversions I take, are entirely up to me. Over the course of an hour, I’m repeatedly reminded that I’ve never played a DOOM game like this before.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs you’d hope for, this sandbox sequence is stacked with optional goals – heavily protected artillery batteries to take out, caches of gold to spend on upgrades, and more. At one point, I’m simply running somewhere, when a cathedral-sized tentacle bursts out of the ground and begins to attack – this isn’t a scripted moment, or even an objective I’m given, it’s just another surprise hidden along the way.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut the core objectives themselves hold surprises, too. In that first story mission, closing portals was simply a case of clearing an arena, but it’s never quite the same in this case. Some portals transport me to a dungeon, requiring me to solve puzzles in order to find my way to the energy source powering them. Others introduce Leader enemies – overpowered beasts who are invulnerable to my attacks until I kill enough of their followers, and come with permanent upgrades after your victory. Along the way, I find new guns, augmenting my armory with new options. It’s restlessly, relentlessly inventive, as if id has been waiting for an opportunity to transplant new ideas into the DOOM format.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd that’s the key takeaway from my full session with \u003cem\u003eDOOM:\u003c/em\u003e \u003cem\u003eThe Dark Ages\u003c/em\u003e – this feels like a developer brimming with enthusiasm, not just for DOOM itself, but for what DOOM could \u003cem\u003ebe\u003c/em\u003e. I was expecting a new story, new guns, and new demons – I wasn’t expecting new genres. I cannot wait to find out what else this team has in store.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003e\u003ca href=\"https://www.xbox.com/en-US/games/store/doom-the-dark-ages-premium-edition/9NK3S5DT79LT/0017\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDOOM: The Dark Ages\u003c/a\u003e\u003c/strong\u003e launches for Xbox Series X|S, PC (via the Xbox app for Windows PC, Steam, and Battle.net), PlayStation 5, and cloud on May 15, 2025. It will be available day one with Game Pass.\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003cdiv\u003e\n\n\u003cdiv data-product-id=\"9NK3S5DT79LT\" id=\"msp1743409299083\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9NK3S5DT79LT\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.3479.13668796464163606.3af4acc7-91ef-4e2c-a1c9-55057e878817.c209b5d8-3e19-4e5e-9ffb-f362ced452cb?w=400\u0026amp;h=600\" alt=\"DOOM: The Dark Ages Premium Edition\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\u003ch2\u003eDOOM: The Dark Ages Premium Edition\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eBethesda Softworks\u003c/p\u003e\n\t\t\n\t\u003cp\u003e\u003cspan\u003e$99.99\u003c/span\u003e\n\t\t\t\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tGet a head start on slaying demons with the Premium Edition, including up to 2-Day Early Access* and the campaign DLC**. You’ll also receive the Digital Artbook and Soundtrack, and the Divinity Skin Pack, which includes matching skins for the DOOM Slayer, dragon and Atlan. \n\nINCLUDES:  \n\n– Base Game (digital code) \n– Up to 2-Day Early Access \n– Campaign DLC \n– Digital Artbook and Soundtrack \n– Divinity Skin Pack\n\n*Actual play time depends on purchase date and applicable time zone differences, subject to possible outages. \n\n**DLC availability to be provided at a later date.\n\nBECOME THE SLAYER IN A MEDIEVAL WAR AGAINST HELL\nDOOM: The Dark Ages is the prequel to the critically acclaimed DOOM (2016) and DOOM Eternal that tells an epic cinematic story worthy of the DOOM Slayer’s legend. In this third installment of the modern DOOM series, players will step into the blood-stained boots of the DOOM Slayer, in this never-before-seen dark and sinister medieval war against Hell. \n\nDOOM: The Dark Ages is a dark fantasy/sci-fi single-player experience that delivers the searing combat and over-the-top visuals of the incomparable DOOM franchise, powered by the latest idTech engine. \n\nSTAND AND FIGHT \nAs the super weapon of gods and kings, shred enemies with devastating favorites like the Super Shotgun while also wielding a variety of new bone-chewing weapons, including the versatile Shield Saw. Players will stand and fight on the demon-infested battlefields in the vicious, grounded combat the original DOOM is famous for. Take flight atop the new fierce Mecha Dragon, stand tall in a massive Atlan mech, and beat demons to a pulp with the newly enhanced glory kill system. Only the Slayer has the power to wield these devastating tools of mayhem.\n\nREIGN IN HELL \nBound to serve as the super weapon of gods and kings, the DOOM Slayer fends off demon hordes as their leader seeks to destroy the Slayer and become the only one that is feared. Witness the creation of a legend as the Slayer takes on all of Hell and turns the tide of the war. \n\nDISCOVER UNKNOWN REALMS \nIn his quest to crush the legions of Hell, the Slayer must take the fight to never-before-seen realms. Mystery, challenges, and rewards lurk in every shadow of ruined castles, epic battlefields, dark forests, ancient hellscapes, and worlds beyond. Armed with the viciously powerful Shield Saw, cut through a dark world of menace and secrets in id\u0026#39;s largest and most expansive levels to date.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\n\n\u003cdiv data-product-id=\"9NN2BX6QXFZH\" id=\"msp1743409299083\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9NN2BX6QXFZH\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.47432.13751499299080078.e33ae2a0-24fc-4166-b258-20c32ba28e4b.38dbf144-e278-4776-b1bb-33477c8bb5f9?w=400\u0026amp;h=600\" alt=\"DOOM: The Dark Ages Standard Edition\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\u003ch2\u003eDOOM: The Dark Ages Standard Edition\u003c/h2\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eBethesda Softworks\u003c/p\u003e\n\t\t\n\t\u003cp\u003e\u003cspan\u003e$69.99\u003c/span\u003e\n\t\t\t\u003c/p\u003e\n\n\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tBECOME THE SLAYER IN A MEDIEVAL WAR AGAINST HELL\nDOOM: The Dark Ages is the prequel to the critically acclaimed DOOM (2016) and DOOM Eternal that tells an epic cinematic story worthy of the DOOM Slayer’s legend. In this third installment of the modern DOOM series, players will step into the blood-stained boots of the DOOM Slayer, in this never-before-seen dark and sinister medieval war against Hell. \n\nDOOM: The Dark Ages is a dark fantasy/sci-fi single-player experience that delivers the searing combat and over-the-top visuals of the incomparable DOOM franchise, powered by the latest idTech engine.\n\nSTAND AND FIGHT \nAs the super weapon of gods and kings, shred enemies with devastating favorites like the Super Shotgun while also wielding a variety of new bone-chewing weapons, including the versatile Shield Saw. Players will stand and fight on the demon-infested battlefields in the vicious, grounded combat the original DOOM is famous for. Take flight atop the new fierce Mecha Dragon, stand tall in a massive Atlan mech, and beat demons to a pulp with the newly enhanced glory kill system. Only the Slayer has the power to wield these devastating tools of mayhem.\n\nREIGN IN HELL \nBound to serve as the super weapon of gods and kings, the DOOM Slayer fends off demon hordes as their leader seeks to destroy the Slayer and become the only one that is feared. Witness the creation of a legend as the Slayer takes on all of Hell and turns the tide of the war. \n\nDISCOVER UNKNOWN REALMS \nIn his quest to crush the legions of Hell, the Slayer must take the fight to never-before-seen realms. Mystery, challenges, and rewards lurk in every shadow of ruined castles, epic battlefields, dark forests, ancient hellscapes, and worlds beyond. Armed with the viciously powerful Shield Saw, cut through a dark world of menace and secrets in id\u0026#39;s largest and most expansive levels to date.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-31T14:00:00Z",
  "modifiedTime": "2025-03-31T08:34:06Z"
}
