{
  "id": "9fa40359-3874-463d-8734-d1b115c4000e",
  "title": "Piece By Piece is about mending, painting and selling goods in a cute repair shop",
  "link": "https://www.rockpapershotgun.com/piece-by-piece-is-about-mending-painting-and-selling-goods-in-a-cute-repair-shop",
  "description": "It seems as if every \"wholesome\" game is either a Stardewlike or a Animal Crossingbut. Little Rocket Lab? Stardewlike. Piece By Piece? Animal Crossingbut. To be more specific, it's Animal Crossing but your chibi fox protagonist is specifically running a shop, mending and painting objects to sell while maintaining cleanliness and the plants outside. If you can't get enough of upcycling in Trash Goblin, here's one more for you. Read more",
  "author": "Graham Smith",
  "published": "Tue, 10 Dec 2024 20:40:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Management",
    "Piece By Piece",
    "Gamkat",
    "Life Simulation"
  ],
  "byline": "Graham Smith",
  "length": 2206,
  "excerpt": "Piece By Piece is a shop sim about mending, painting and selling items to a cast of cute animals.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/a94e5e55db998e5c037befad1cc9f6a5/icon/apple-touch-icon.png",
  "text": "Image credit: Gamkat It seems as if every \"wholesome\" game is either a Stardewlike or a Animal Crossingbut. Little Rocket Lab? Stardewlike. Piece By Piece? Animal Crossingbut. To be more specific, it's Animal Crossing but your chibi fox protagonist is specifically running a shop, mending and painting objects to sell while maintaining cleanliness and the plants outside. If you can't get enough of upcycling in Trash Goblin, here's one more for you. Piece By Piece - Announcement Trailer Piece By Piece announcement trailer.Watch on YouTube Counter to its cosy vibes, the press release threatens an iota of challenge to your management. \"If you think this'll be a walk in the park, Piece by Piece is going to outfox you,\" it says. \"Each day you'll need to tidy up your store, attend to anyone who needs help, then throw a bunch of stuff on sale and see if you can make a tasty profit. Being a good samaritan is great and all, but this fox needs to put food on the table!\" I am betting I can't end up losing my shop to debt collectors, but maybe I'm wrong. I've whizzed through the Wholesome Snack presentation tonight and written up this and three other stories, representing the most interesting news and games present at the show in my opinion. To cast some judgement across the field: these all seem like pleasant games which could be fun to play, but they're all so derivative, all of them riffing on the same two or three core concepts. It's faintly exhausting. Obviously other genres or tones of games do the same, but this is less \"wow, there are a lot of games about shooting\" and more \"wow, there are a lot of games about shooting realistic weapons specifically, in a modern military setting, with a sniper mission in the desert.\" Even the dialogue boxes seem familiar. In a way \"Animal Crossingbut\" is the generous way to describe these games, because at least it requires a \"but\", suggesting some innovation. I'm not sure that's the case if I compare Piece By Piece to Trash Goblin (on Steam in Early Access) or any of the other shop sims in recent years. I hope I'm wrong. Piece By Piece is aiming for release in early 2025 on Steam.",
  "image": "https://assetsio.gnwcdn.com/piece-by-piece.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/piece-by-piece.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/piece-by-piece.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/piece-by-piece.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/piece-by-piece.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A bunny called Mr. Cotton chats to the shopkeeping fox in Piece By Piece.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eGamkat\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eIt seems as if every \u0026#34;wholesome\u0026#34; game is either a Stardewlike or a Animal Crossingbut. \u003ca href=\"https://www.rockpapershotgun.com/little-rocket-lab-is-a-factorio-and-stardew-valley-mashup-about-building-a-rocketship-in-a-cute-town\"\u003eLittle Rocket Lab\u003c/a\u003e? Stardewlike. Piece By Piece? Animal Crossingbut. To be more specific, it\u0026#39;s \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/animal-crossing\"\u003eAnimal Crossing\u003c/a\u003e but your chibi fox protagonist is specifically running a shop, mending and painting objects to sell while maintaining cleanliness and the plants outside. If you can\u0026#39;t get enough of upcycling in Trash Goblin, here\u0026#39;s one more for you.\n\u003c/p\u003e\n\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Piece By Piece - Announcement Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/_hLv4Pbo6iM?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/_hLv4Pbo6iM/hqdefault.jpg\"/\u003e\u003cspan\u003ePiece By Piece - Announcement Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/_hLv4Pbo6iM?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/_hLv4Pbo6iM?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003ePiece By Piece announcement trailer.\u003ca href=\"https://www.youtube.com/watch?v=_hLv4Pbo6iM\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eCounter to its cosy vibes, the press release threatens an iota of challenge to your management. \u0026#34;If you think this\u0026#39;ll be a walk in the park, Piece by Piece is going to outfox you,\u0026#34; it says. \u0026#34;Each day you\u0026#39;ll need to tidy up your store, attend to anyone who needs help, then throw a bunch of stuff on sale and see if you can make a tasty profit. Being a good samaritan is great and all, but this fox needs to put food on the table!\u0026#34;\n\u003c/p\u003e\n\u003cp\u003eI am betting I can\u0026#39;t end up losing my shop to debt collectors, but maybe I\u0026#39;m wrong.\n\u003c/p\u003e\n\u003cp\u003eI\u0026#39;ve whizzed through the \u003ca href=\"https://www.rockpapershotgun.com/topics/wholesome-direct\"\u003eWholesome Snack\u003c/a\u003e presentation tonight and written up this and three other stories, representing the most interesting news and games present at the show in my opinion. To cast some judgement across the field: these all seem like pleasant games which could be fun to play, but they\u0026#39;re all so derivative, all of them riffing on the same two or three core concepts. It\u0026#39;s faintly exhausting. Obviously other genres or tones of games do the same, but this is less \u0026#34;wow, there are a lot of games about shooting\u0026#34; and more \u0026#34;wow, there are a lot of games about shooting realistic weapons specifically, in a modern military setting, with a sniper mission in the desert.\u0026#34; Even the dialogue boxes seem familiar.\n\u003c/p\u003e\u003cp\u003eIn a way \u0026#34;Animal Crossingbut\u0026#34; is the generous way to describe these games, because at least it requires a \u0026#34;but\u0026#34;, suggesting some innovation. I\u0026#39;m not sure that\u0026#39;s the case if I compare Piece By Piece to Trash Goblin (\u003ca href=\"https://store.steampowered.com/app/2407830/Trash_Goblin/\"\u003eon Steam\u003c/a\u003e in Early Access) or any of the other shop sims in recent years.\n\u003c/p\u003e\n\u003cp\u003eI hope I\u0026#39;m wrong. Piece By Piece is aiming for release in early 2025 \u003ca href=\"https://store.steampowered.com/app/3179050/Piece_by_Piece/\"\u003eon Steam\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-10T20:40:00Z",
  "modifiedTime": null
}
