{
  "id": "a0738a93-063e-4732-bb0f-b606b7f50b46",
  "title": "Urge is the most interesting open world shooter in a long while, and also, the most revolting",
  "link": "https://www.rockpapershotgun.com/urge-is-the-most-interesting-open-world-shooter-in-a-long-while-and-also-the-most-revolting",
  "description": "Every now and then, somebody has the marvellous idea of developing technology that makes video games smell. I have never been more grateful for this recurrent Quixotic daydream's mass market failure than when watching trailers for Urge, an open world survival shooter that is both fuelled and plagued by piss. \"But hold your horses, young Edwin,\" you sternly interject. \"I do not wish to hear about, let alone play an open world survival shooter that is both fuelled and plagued by piss, on a website that children might read. It sounds like a cheap, taboo-jabbing gimmick.\" Friend, I once thought as you. But then I did a little research, as is my journalistic responsibility, and it turns out Urge's notions about piss - bladdergold, as they call it in the West Country, or Crusoe Cola, as it's known in the States - are rather in-depth. I'm still very glad I can't smell the game, but I definitely have the urge to play it. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Mon, 02 Dec 2024 17:08:13 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Open World",
    "Urge",
    "Survival \u0026 Crafting",
    "Shooter: First Person",
    "PC",
    "Fantasy"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 3998,
  "excerpt": "Every now and then, somebody has the marvellous idea of developing technology that makes video games smell. I have neve…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/c6f79741d08213c2c9d01622350d24ee/icon/apple-touch-icon.png",
  "text": "Image credit: EnDrew Every now and then, somebody has the marvellous idea of developing technology that makes video games smell. I have never been more grateful for this recurrent Quixotic daydream's mass market failure than when watching trailers for Urge, an open world survival shooter that is both fuelled and plagued by piss. \"But hold your horses, young Edwin,\" you sternly interject. \"I do not wish to hear about, let alone play an open world survival shooter that is both fuelled and plagued by piss, on a website that children might read. It sounds like a cheap, taboo-jabbing gimmick.\" Friend, I once thought as you. But then I did a little research, as is my journalistic responsibility, and it turns out Urge's notions about piss - bladdergold, as they call it in the West Country, or Crusoe Cola, as it's known in the States - are rather in-depth. I'm still very glad I can't smell the game, but I definitely have the urge to play it. URGE Update Teaser 18 Watch on YouTube Urge is currently in early access, having launched in 2021 with that most respectable of final release dates - When It's Done, You Grasping Ingrates, And Not One Second Before. It starts with you pulling yourself out of a car crash and investigating a world suffused with a mysterious fog. Not the nice kind of mysterious fog, mind you. Not fog like in Silent Hill, where it symbolises repressed trauma while elegantly covering up the limitations of the game engine. Nothing so wholesome. This fog is, basically, wee smoke. And the world of Urge consists largely of wee. Some of it erupts from the ground in stinking geysers. Some of it fills the wobbly heads of the mutants who shamble up to murder you - victims of a strange addiction whose origins may lie in the map's larger industrial areas, or in the tunnels and sewers beneath. In a fanciful reinterpretation of piss thermodynamics that is seemingly justified by the lore, some of the wee exists as powder - dusting the tops of storage cases, released in gusts by latrine-shaped gourds, or forming horrible ammoniac stalactites indoors. And some of it is contained by your character, and must be regularly excreted in the course of attending to other survival game needs like hunger, thirst and shelter. Whether liquid or powder, piss must be disposed of correctly, because if it's disposed of incorrectly - for example, by widdling on the ground rather than into a proper toilet - it'll add to the world's fog. The more fog there is, the more enemies there are, and the worse those enemies become. Think giant yellow spiders, chainsaw dudes in soiled hazmats, and tall, hollow-eyed creatures who look to me like urine cakes pounded flat. Also, piss meteors. Piss lightning too. Mitigating the spread of wee-wee is difficult, and not just because you will occasionally need to spend a penny yourself (you can also drink the stuff if you don't have any other potable fluids to hand, like poison or blood). In the world of Urge, piss can be transformed into fuel for things like abandoned vehicles, which emit gauzy yellow clouds of piss vapour when in motion. As such, play appears to involve regular alternations in fog intensity, with you building and crafting to minimise the spillage of urine while periodically, as it were, pissing it all up because you need to drive to another town. I'm... compelled by all this partly for the extremely online leftwing reason that it feels like a metaphor for climate change. But looking at it from more of a design standpoint, I also like the sound of a survival game that encourages you to survive with delicacy and discretion, lest you bring about a golden apocalypse. Perhaps there's an RPS diary series in it? You can read more on Steam. As Ollie noted in the meeting earlier, the Steam page amuses partly for the great care taken not to use the word \"piss\" too often, presumably to avoid rousing the distaste of Steam's curation algorithms.",
  "image": "https://assetsio.gnwcdn.com/1_K5HqSBS.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/1_K5HqSBS.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/1_K5HqSBS.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/1_K5HqSBS.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/1_K5HqSBS.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A first-person view of a yellow orange wasteland with the player character holding a yellow water gun of some kind, in Urge\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eEnDrew\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n\n\n\n            \u003cp\u003e\nEvery now and then, somebody has the marvellous idea of developing technology that \u003ca href=\"https://www.inverse.com/tech/gamescent-ai-device-smell-video-games-price-release-date\"\u003emakes video games smell\u003c/a\u003e. I have never been more grateful for this recurrent Quixotic daydream\u0026#39;s mass market failure than when watching trailers for Urge, an \u003ca href=\"https://www.rockpapershotgun.com/the-best-open-world-games\"\u003eopen world\u003c/a\u003e survival shooter that is both fuelled and plagued by piss.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;But hold your horses, young Edwin,\u0026#34; you sternly interject. \u0026#34;I do not wish to hear about, let alone play an open world \u003ca href=\"https://www.rockpapershotgun.com/the-best-survival-games-on-pc\"\u003esurvival\u003c/a\u003e shooter that is both fuelled and plagued by piss, on a website that children might read. It sounds like a cheap, taboo-jabbing gimmick.\u0026#34; Friend, I once thought as you. But then I did a little research, as is my journalistic responsibility, and it turns out Urge\u0026#39;s notions about piss - bladdergold, as they call it in the West Country, or Crusoe Cola, as it\u0026#39;s known in the States - are rather in-depth. I\u0026#39;m still very glad I can\u0026#39;t smell the game, but I definitely have the urge to play it.\n\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"URGE Update Teaser 18\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/_gZbkeMEeVs?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/_gZbkeMEeVs/hqdefault.jpg\"/\u003e\u003cspan\u003eURGE Update Teaser 18\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/_gZbkeMEeVs?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/_gZbkeMEeVs?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=_gZbkeMEeVs\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\nUrge is currently in early access, having launched in 2021 with that most respectable of final release dates - When It\u0026#39;s Done, You Grasping Ingrates, And Not One Second Before. It starts with you pulling yourself out of a car crash and investigating a world suffused with a mysterious fog. Not the nice kind of mysterious fog, mind you. Not fog like in Silent Hill, where it symbolises repressed trauma while elegantly covering up the limitations of the game engine. Nothing so wholesome. This fog is, basically, wee smoke. And the world of Urge consists largely of wee. \n\u003c/p\u003e\u003cp\u003e\nSome of it erupts from the ground in stinking geysers. Some of it fills the wobbly heads of the mutants who shamble up to murder you - victims of a strange addiction whose origins may lie in the map\u0026#39;s larger industrial areas, or in the tunnels and sewers beneath.\u003c/p\u003e\n\u003cp\u003eIn a fanciful reinterpretation of piss thermodynamics that is seemingly justified by the lore, some of the wee exists as powder - dusting the tops of storage cases, released in gusts by latrine-shaped gourds, or forming horrible ammoniac stalactites indoors. And some of it is contained by your character, and must be regularly excreted in the course of attending to other survival game needs like hunger, thirst and shelter.\n\u003c/p\u003e\n\u003cp\u003e\nWhether liquid or powder, piss must be disposed of correctly, because if it\u0026#39;s disposed of incorrectly - for example, by widdling on the ground rather than into a proper toilet - it\u0026#39;ll add to the world\u0026#39;s fog. The more fog there is, the more enemies there are, and the worse those enemies become. Think giant yellow spiders, chainsaw dudes in soiled hazmats, and tall, hollow-eyed creatures who look to me like urine cakes pounded flat. Also, piss meteors. Piss lightning too. \n\u003c/p\u003e\n\u003cp\u003e\nMitigating the spread of wee-wee is difficult, and not just because you will occasionally need to spend a penny yourself (you can also drink the stuff if you don\u0026#39;t have any other potable fluids to hand, like poison or blood). In the world of Urge, piss can be transformed into fuel for things like abandoned vehicles, which emit gauzy yellow clouds of piss vapour when in motion. As such, play appears to involve regular alternations in fog intensity, with you building and crafting to minimise the spillage of urine while periodically, as it were, pissing it all up because you need to drive to another town.\n\u003c/p\u003e\u003cp\u003e\nI\u0026#39;m... compelled by all this partly for the extremely online leftwing reason that it feels like a metaphor for climate change. But looking at it from more of a design standpoint, I also like the sound of a survival game that encourages you to survive with delicacy and discretion, lest you bring about a golden apocalypse. Perhaps there\u0026#39;s an RPS diary series in it? \u003ca href=\"https://store.steampowered.com/app/1304350/Urge/\"\u003eYou can read more on Steam\u003c/a\u003e. As Ollie noted in the meeting earlier, the Steam page amuses partly for the great care taken not to use the word \u0026#34;piss\u0026#34; too often, presumably to avoid rousing the distaste of Steam\u0026#39;s curation algorithms.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-02T17:08:13.685641Z",
  "modifiedTime": null
}
