{
  "id": "a5340488-ceb8-41bd-98ee-f12a8d7c9559",
  "title": "Kylie Jenner’s Goyard Luxury Gift to Kris Jenner Features Hand-Painted Kardashian Baby Pics and an Unforgettable Price Tag",
  "link": "https://www.escapistmagazine.com/kylie-jenner-kris-jenner-goyard-bag-handpainted-faces/",
  "description": "",
  "author": "Jinal Bhatt",
  "published": "Sat, 28 Dec 2024 21:05:36 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "News",
    "Featured",
    "Kylie Jenner"
  ],
  "byline": "Jinal Bhatt",
  "length": 2625,
  "excerpt": "Kylie Jenner went all out this year for her gift for her mother Kris Jenner, giving her a customized Goyard bag.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "These days, the best gifts are always personalized. And how do you personalize a gift for a mother? Make it about her children, of course! Something Kylie Jenner masterfully pulled off when she gifted mom Kris Jenner a luxury Goyard bag with a little unique touch. ‘Tis the season of Christmas gifts and we know that the Kardashian-Jenner brood will always do gifting in style. Remember Kris Jenner’s 69th birthday in November, when all her kids and grandkids wore PJs with a collage of her pictures on them? So when Kylie Jenner decided to get her mom, Kris Jenner, a gift, it wasn’t just a regular luxury bag with a jaw-dropping price tag, no ma’am! It was yet another exquisite treat involving a lot of… faces. For starters, it was a Goyard bag, which is something you can’t just order online, and have to get in store. The Goyard Boston 50 retails for roughly $4000, but would definitely cost a bit more for any customizations. And what made it priceless was the personalisation that Kylie ordered. On the façade of the duffel bag were handpainted childhood pictures of all six of Kris’ kids – Kourtney, Khloé, Kim, Rob, Kendall, and Kylie. (Khloé Kardashian / Instagram) Khloé Kardashian, who was unable to attend her family’s Christmas Eve celebrations because her kids, Tru and Tatum were ill, shared a picture of the bag on her Instagram stories on December 26, writing, “Omg @kyliejenner this is incredible. Mom is lucky.” And no lie there, because while Goyard does offer customizations, it’s usually very minor ones. So getting something this extensive and out of the way must’ve cost Kylie Jenner quite a pretty penny. Related: ‘I Look Like a Crackhead’: Brandi Glanville Shares Bad News On ‘Gross’ Face Parasite Infection In case you haven’t been keeping up with the Kardashians’ Christmas, their celebrations were rather subdued than usual this year. As Kim Kardashian revealed earlier in the month, there was a lot of construction going on at their home, and so they were planning on doing an intimate family thing this year instead of their usual blowout. But it wasn’t without them dressing to the nines. (Kylie Jenner / Instagram) And it sure wasn’t without some fun – from playing the Kardashian-Jenner edition of the game Guess Who? and 818-card games and building the Home Alone house lego set together to gifts wrapped in personalized wrapping paper with the faces of the kids on it. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2024/12/Kylie-Jenner-Goyard-gift-to-Kris-Jenner.jpg?fit=1024%2C576",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"264\" data-injectable=\"true\" data-video=\"true\"\u003eThese days, the best gifts are always personalized. And how do you personalize a gift for a mother? Make it about her children, of course! Something Kylie Jenner masterfully pulled off when she gifted mom Kris Jenner a luxury Goyard bag with a little unique touch.\u003c/p\u003e\n\n    \u003cp data-characters=\"462\" data-current-count=\"462\" data-injectable=\"false\"\u003e‘Tis the season of Christmas gifts and we know that the Kardashian-Jenner brood will always do gifting in style. Remember Kris Jenner’s 69th birthday in November, when all her kids and grandkids wore PJs with a collage of her pictures on them? So when Kylie Jenner decided to get her mom, Kris Jenner, a gift, it wasn’t just a regular luxury bag with a jaw-dropping price tag, no ma’am! It was yet another exquisite treat involving a lot of… faces.\u003c/p\u003e    \u003cp data-characters=\"442\" data-current-count=\"904\" data-injectable=\"true\"\u003eFor starters, it was a Goyard bag, which is something you can’t just order online, and have to get in store. The Goyard Boston 50 retails for roughly $4000, but would definitely cost a bit more for any customizations. And what made it priceless was the personalisation that Kylie ordered. On the façade of the duffel bag were handpainted childhood pictures of all six of Kris’ kids – Kourtney, Khloé, Kim, Rob, Kendall, and Kylie.\u003c/p\u003e\n\n    \u003cfigure data-current-count=\"300\" data-injectable=\"false\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2024/12/Kylie-Jenner-Goyard-bag.jpg?w=1024\u0026amp;resize=1200%2C675\" alt=\"A Goyard bag with pictures of the Kardashian Jenner kids\"/\u003e\u003cfigcaption\u003e(Khloé Kardashian / Instagram)\u003c/figcaption\u003e\u003c/figure\u003e    \u003cp data-characters=\"469\" data-current-count=\"769\" data-injectable=\"true\"\u003eKhloé Kardashian, who was unable to attend her family’s Christmas Eve celebrations because her kids, Tru and Tatum were ill, shared a picture of the bag on \u003ca href=\"https://www.instagram.com/khloekardashian/?hl=en\" target=\"_blank\"\u003eher Instagram stories\u003c/a\u003e on December 26, writing, “Omg @kyliejenner this is incredible. Mom is lucky.” And no lie there, because while Goyard does offer customizations, it’s usually very minor ones. So getting something this extensive and out of the way must’ve cost Kylie Jenner quite a pretty penny.\u003c/p\u003e\n\n    \u003cp data-characters=\"116\" data-current-count=\"116\" data-injectable=\"false\"\u003e\u003cstrong\u003eRelated: \u003ca href=\"https://www.escapistmagazine.com/i-look-like-a-crackhead-brandi-glanville-shares-bad-news-on-gross-face-parasite-infection/\"\u003e‘I Look Like a Crackhead’: Brandi Glanville Shares Bad News On ‘Gross’ Face Parasite Infection\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e    \u003cp data-characters=\"392\" data-current-count=\"508\" data-injectable=\"false\"\u003eIn case you haven’t been keeping up with the Kardashians’ Christmas, their celebrations were rather subdued than usual this year. As \u003ca href=\"https://www.escapistmagazine.com/christmas-on-crack-kim-kardashian-blasted-for-nightmare-fuel-holiday-music-video-nobody-asked-for/\"\u003eKim Kardashian\u003c/a\u003e revealed earlier in the month, there was a lot of construction going on at their home, and so they were planning on doing an intimate family thing this year instead of their usual blowout. But it wasn’t without them dressing to the nines.\u003c/p\u003e    \u003cfigure data-current-count=\"808\" data-injectable=\"true\"\u003e\u003cimg data-recalc-dims=\"1\" decoding=\"async\" width=\"1200\" height=\"675\" src=\"https://www.escapistmagazine.com/wp-content/uploads/2024/12/Kylie-Jenner-Christmas.jpg?w=1024\u0026amp;resize=1200%2C675\" alt=\"Left: Kylie Jenner dressed in a white sequinned dress for Christmas. Right: Christmas gifts wrapped in paper with Stormi\u0026#39;s face on it.\"/\u003e\u003cfigcaption\u003e(Kylie Jenner / Instagram)\u003c/figcaption\u003e\u003c/figure\u003e\n\n    \u003cp data-characters=\"264\" data-current-count=\"264\" data-injectable=\"false\"\u003eAnd it sure wasn’t without some fun – from playing the Kardashian-Jenner edition of the game \u003cem\u003eGuess Who?\u003c/em\u003e and 818-card games and building the\u003cem\u003e Home Alone\u003c/em\u003e house lego set together to gifts wrapped in personalized wrapping paper with the faces of the kids on it.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-28T21:05:36Z",
  "modifiedTime": "2024-12-28T21:05:54Z"
}
