{
  "id": "a7463048-d34d-4c62-9e41-d443b0aa4f5b",
  "title": "Catan's New Edition Still Wants To Be Your Gateway To Tabletop Gaming",
  "link": "https://www.gamespot.com/articles/catans-new-edition-still-wants-to-be-your-gateway-to-tabletop-gaming/1100-6529025/?ftag=CAD-01-10abi2f",
  "description": "2025 marks the 30th anniversary of Catan, and the tabletop game is set to get its sixth edition this April. This is the first update to the settler-oriented multiplayer board game in about a decade, with the fifth edition--the version that transformed the name of the game from The Settlers of Catan to just Catan--releasing in June 2015. As the game celebrates its 30th birthday, the designers are hoping to maintain the game's place as a major go-to onramp for people discovering the joy of playing tabletop games.\"How do you keep an old game relevant even after 30 years, right? Especially when gaming has developed,\" managing director and game designer Benjamin Teuber told me. \"The hobby continues to develop and grow, and there are so many great games. Every year, I have three new favorite games, and next year there [will be] three more and that's awesome, that's beautiful. But there is apparently still something to Catan because we still have very good sales numbers. ...There are always new people joining this hobby, and Catan still seems to be the entry level product, [the game] for many to find.\"The artwork for Catan Sixth Edition is far more vibrant than previous editions.For Teuber, it doesn't matter that Catan is 30 years old. Even if many who tried the game and loved it may eventually move on to more complex or niche tabletop systems, Catan is going to keep being a new experience for someone. Teuber told me a story about how Village Romance developer Michael Palm recently messaged him about playing Catan with his kid, who screamed, \"Klaus Teuber is the coolest game developer!\" during the game (Klaus is Benjamin's father and the creator of Catan).Continue Reading at GameSpot",
  "author": "",
  "published": "Fri, 24 Jan 2025 14:25:00 -0800",
  "source": "https://www.gamespot.com/feeds/mashup/",
  "categories": [
    ""
  ],
  "byline": "Jordan Ramée",
  "length": 7305,
  "excerpt": "Catan is celebrating its 30th anniversary with the release of its first new edition in almost a decade.",
  "siteName": "GameSpot",
  "favicon": "https://www.gamespot.com/a/bundles/gamespotsite/images/touch-icon-ipad-retina-precomposed.png",
  "text": "GameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links. By on January 24, 2025 at 2:25PM PST 2025 marks the 30th anniversary of Catan, and the tabletop game is set to get its sixth edition this April. This is the first update to the settler-oriented multiplayer board game in about a decade, with the fifth edition--the version that transformed the name of the game from The Settlers of Catan to just Catan--releasing in June 2015. As the game celebrates its 30th birthday, the designers are hoping to maintain the game's place as a major go-to onramp for people discovering the joy of playing tabletop games.\"How do you keep an old game relevant even after 30 years, right? Especially when gaming has developed,\" managing director and game designer Benjamin Teuber told me. \"The hobby continues to develop and grow, and there are so many great games. Every year, I have three new favorite games, and next year there [will be] three more and that's awesome, that's beautiful. But there is apparently still something to Catan because we still have very good sales numbers. ...There are always new people joining this hobby, and Catan still seems to be the entry level product, [the game] for many to find.\"The artwork for Catan Sixth Edition is far more vibrant than previous editions.For Teuber, it doesn't matter that Catan is 30 years old. Even if many who tried the game and loved it may eventually move on to more complex or niche tabletop systems, Catan is going to keep being a new experience for someone. Teuber told me a story about how Village Romance developer Michael Palm recently messaged him about playing Catan with his kid, who screamed, \"Klaus Teuber is the coolest game developer!\" during the game (Klaus is Benjamin's father and the creator of Catan).\"The son is 10, so for him, Catan is a new experience,\" Teuber said. \"Why should it be worse [for him] than [it was] 30 years ago for people to play? It's still speaking to everything that [many people] love [in RPGs], like harvesting, trading, social interaction, [and] building. [This game] is still relevant. And, of course, maybe other games are [being] developed, but there's still Catan being a gateway game for many who just learned about [tabletop] gaming.\"For those that haven't yet tried Catan, the game sees three to four players (or up to six with the right expansion) roleplay as settlers attempting to establish a new home on the titular fictional island. Players roll dice on their turn to determine the yield of resources adjacent to the land they own, and these resources in turn can be spent to build infrastructure and roads. You can trade resources with other players, steal resources, and build armies as well, creating opportunities to build alliances or betray friends. As each player's settlement grows, they gain points. Whichever player reaches 10 points first wins.Catan isn't going through any major rule adjustments for this edition, though rules are getting streamlined and reprinted in a new format so that it should be easier for players to parse how everything works and start playing. The visuals of the game are changing, too.\"Mechanically, nothing has changed from fifth edition to sixth edition,\" director of brand development Kevin Hovdestad told me. \"We really wanted to make sure that people could bring their existing knowledge of the game with them, that somebody who picks up the new one because they love the new art or they want the new boxes or just because they get it as a gift, that what they're accustomed to is still the same experience. ...The [only] change we made to the rules was to try to make them more beginner-friendly: rules that are more pictures, less words, [and] quicker to get through so that someone can glance at it and see a visual explanation rather than something that's really like that old-school two-column, everything is explained in painstaking detail.\"The rules for Catan aren't changing but they're being packaged in a way that should be easier to understand.Visually, the sixth edition of Catan's artwork is much brighter and pulls the game's setting both a few years forward and away from Europe--it's still pre-Industrial Revolution, but you're no longer playing in a strictly medieval time period with heavy Western European vibes.\"We've heard a lot of, [even from] my wife, 'Hey, this is nice, but [Catan] is a little bit too medieval-ish. It's not so sexy for me,'\" Teuber said. \"[Sixth edition] is still pre-industrial, but it's more vibrant and feels more like an imagined world that you put yourself into [on] this island. And that's what we heard a lot in the last decade: 'Hey, Catan, to me, it's actually not really connected to a particular story, but it's me projecting myself into this uninhabited island. There is no one and [no culture]. And you can build up whatever you want to build up.' And that's nice. So we took out even more [of] the European millage. I quite like that. I have to say my wife's always a good source of inspiration.\"\"The updated art helps to bring more people into the game,\" Hovdestad said. \"We've done a really good job of evolving past the original design. Now, there's a variety of different people, poses, [and] garbs. It really just showcases a little bit more range, and the game is a little bit brighter as a result.\"Most appealing for someone like me, who desires aesthetic excellence for my shelves so that my gaming corner looks pretty, is that the new edition should make it a tad easier to keep all of your expansions organized in one place. \"If you buy any of the new Catan base game [boxes] or its expansions--the Seafarers, Cities \u0026 Knights, whatever--they [will now] fit inside the base game box,\" Hovdestad said. \"You can condense them and they all collapse together. All of the boxes are the same size and shape. The card trays that are now in the base game [in sixth edition] are something people have been asking for forever, and you can see [in the new sixth edition box] just the enormous range of accessories [we now have] from years [of player requests]. We're doing that thing where everybody kept making [third-party accessories] for us and making it ourselves.\"Catan Sixth Edition is set to launch in Spring 2025, with preorders already live. \"The production teams on the game have worked some real magic,\" Hovdestad concluded. \"So while sometimes, yes, updates can feel like they are just cosmetic, we've made improvements to how the boxes are designed, [and] what's in the boxes have actually enabled us to lower the price of the game. Catan Sixth Edition is less expensive than Catan Fifth Edition was, even though it's a brand-new thing coming out in 2025. Those kinds of opportunities are hard not to take because we all live in the real world. Food got more expensive, my house got more expensive, my taxes went up, but Catan got cheaper.\" Got a news tip or want to contact us directly? Email news@gamespot.com",
  "image": "https://www.gamespot.com/a/uploads/screen_kubrick/1587/15875866/4433707-boardfull-woodbackground.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\n    \u003cspan data-nosnippet=\"\"\u003eGameSpot may receive revenue from affiliate and advertising partnerships for sharing this content and from purchases through links.\u003c/span\u003e\n  \u003c/p\u003e\u003carticle itemscope=\"\" data-type-id=\"1100\" data-guid=\"1100-6529025\"\u003e\n\n            \n            \n  \n\n\u003csection\u003e\u003cp\u003eBy  on \u003ctime datetime=\"2025-01-24T14:25:00-0800\"\u003eJanuary 24, 2025 at 2:25PM PST\u003c/time\u003e\u003c/p\u003e\u003c/section\u003e\n    \n\n\n        \n        \n              \u003csection\u003e\n\n                  \n          \u003cdiv data-content-element-selector=\"p, .js-buylink-item-container\" data-allowed-classes-selector=\"js-buylink-item-container\" data-in-content-placements=\"[{\u0026#34;adType\u0026#34;:\u0026#34;mobile-incontent-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:1,\u0026#34;minElements\u0026#34;:2},{\u0026#34;placeIndex\u0026#34;:4,\u0026#34;minElements\u0026#34;:5}]},{\u0026#34;adType\u0026#34;:\u0026#34;mobile-banner-plus\u0026#34;,\u0026#34;placements\u0026#34;:[{\u0026#34;placeIndex\u0026#34;:7,\u0026#34;minElements\u0026#34;:8},{\u0026#34;placeIndex\u0026#34;:10,\u0026#34;minElements\u0026#34;:11},{\u0026#34;placeIndex\u0026#34;:13,\u0026#34;minElements\u0026#34;:14}]}]\"\u003e\n                \u003cp\u003e2025 marks the 30th anniversary of Catan, and the tabletop game is set to get its sixth edition this April. This is the first update to the settler-oriented multiplayer board game in about a decade, with the fifth edition--the version that transformed the name of the game from The Settlers of Catan to just Catan--releasing in June 2015. As the game celebrates its 30th birthday, the designers are hoping to maintain the game\u0026#39;s place as a major go-to onramp for people discovering the joy of playing tabletop games.\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u0026#34;How do you keep an old game relevant even after 30 years, right? Especially when gaming has developed,\u0026#34; managing director and game designer Benjamin Teuber told me. \u0026#34;The hobby continues to develop and grow, and there are so many great games. Every year, I have three new favorite games, and next year there [will be] three more and that\u0026#39;s awesome, that\u0026#39;s beautiful. But there is apparently still something to Catan because we still have very good sales numbers. ...There are always new people joining this hobby, and Catan still seems to be the entry level product, [the game] for many to find.\u0026#34;\u003c/p\u003e\u003cfigure data-align=\"center\" data-size=\"large\" data-img-src=\"https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433707-boardfull-woodbackground.jpg\" data-ref-id=\"1300-4433707\" data-ratio=\"0.5626\" data-width=\"5000\" data-embed-type=\"image\"\u003e\u003ca href=\"https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433707-boardfull-woodbackground.jpg\" data-ref-id=\"1300-4433707\"\u003e\u003cimg alt=\"The artwork for Catan Sixth Edition is far more vibrant than previous editions.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433707-boardfull-woodbackground.jpg\" srcset=\"https://www.gamespot.com/a/uploads/original/1587/15875866/4433707-boardfull-woodbackground.jpg 5000w, https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433707-boardfull-woodbackground.jpg 1280w, https://www.gamespot.com/a/uploads/scale_medium/1587/15875866/4433707-boardfull-woodbackground.jpg 480w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" data-width=\"1280\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eThe artwork for Catan Sixth Edition is far more vibrant than previous editions.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp dir=\"ltr\"\u003eFor Teuber, it doesn\u0026#39;t matter that Catan is 30 years old. Even if many who tried the game and loved it may eventually move on to more complex or niche tabletop systems, Catan is going to keep being a new experience for someone. Teuber told me a story about how Village Romance developer Michael Palm recently messaged him about playing Catan with his kid, who screamed, \u0026#34;Klaus Teuber is the coolest game developer!\u0026#34; during the game (Klaus is Benjamin\u0026#39;s father and the creator of Catan).\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u0026#34;The son is 10, so for him, Catan is a new experience,\u0026#34; Teuber said. \u0026#34;Why should it be worse [for him] than [it was] 30 years ago for people to play? It\u0026#39;s still speaking to everything that [many people] love [in RPGs], like harvesting, trading, social interaction, [and] building. [This game] is still relevant. And, of course, maybe other games are [being] developed, but there\u0026#39;s still Catan being a gateway game for many who just learned about [tabletop] gaming.\u0026#34;\u003c/p\u003e\u003cp dir=\"ltr\"\u003eFor those that haven\u0026#39;t yet tried Catan, the game sees three to four players (or up to six with the right expansion) roleplay as settlers attempting to establish a new home on the titular fictional island. Players roll dice on their turn to determine the yield of resources adjacent to the land they own, and these resources in turn can be spent to build infrastructure and roads. You can trade resources with other players, steal resources, and build armies as well, creating opportunities to build alliances or betray friends. As each player\u0026#39;s settlement grows, they gain points. Whichever player reaches 10 points first wins.\u003c/p\u003e\u003cp dir=\"ltr\"\u003eCatan isn\u0026#39;t going through any major rule adjustments for this edition, though rules are getting streamlined and reprinted in a new format so that it should be easier for players to parse how everything works and start playing. The visuals of the game are changing, too.\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u0026#34;Mechanically, nothing has changed from fifth edition to sixth edition,\u0026#34; director of brand development Kevin Hovdestad told me. \u0026#34;We really wanted to make sure that people could bring their existing knowledge of the game with them, that somebody who picks up the new one because they love the new art or they want the new boxes or just because they get it as a gift, that what they\u0026#39;re accustomed to is still the same experience. ...The [only] change we made to the rules was to try to make them more beginner-friendly: rules that are more pictures, less words, [and] quicker to get through so that someone can glance at it and see a visual explanation rather than something that\u0026#39;s really like that old-school two-column, everything is explained in painstaking detail.\u0026#34;\u003c/p\u003e\u003cfigure data-align=\"center\" data-size=\"large\" data-img-src=\"https://www.gamespot.com/a/uploads/original/1587/15875866/4433709-resourcecards-all-fanned.png\" data-ref-id=\"1300-4433709\" data-ratio=\"0.59284116331096\" data-width=\"1788\" data-embed-type=\"image\"\u003e\u003ca href=\"https://www.gamespot.com/a/uploads/original/1587/15875866/4433709-resourcecards-all-fanned.png\" data-ref-id=\"1300-4433709\"\u003e\u003cimg alt=\"The rules for Catan aren\u0026#39;t changing but they\u0026#39;re being packaged in a way that should be easier to understand.\" src=\"https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433709-resourcecards-all-fanned.png\" srcset=\"https://www.gamespot.com/a/uploads/original/1587/15875866/4433709-resourcecards-all-fanned.png 1788w, https://www.gamespot.com/a/uploads/scale_super/1587/15875866/4433709-resourcecards-all-fanned.png 1280w, https://www.gamespot.com/a/uploads/scale_medium/1587/15875866/4433709-resourcecards-all-fanned.png 480w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" data-width=\"1280\"/\u003e\u003c/a\u003e\u003cfigcaption\u003eThe rules for Catan aren\u0026#39;t changing but they\u0026#39;re being packaged in a way that should be easier to understand.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp dir=\"ltr\"\u003eVisually, the sixth edition of Catan\u0026#39;s artwork is much brighter and pulls the game\u0026#39;s setting both a few years forward and away from Europe--it\u0026#39;s still pre-Industrial Revolution, but you\u0026#39;re no longer playing in a strictly medieval time period with heavy Western European vibes.\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u0026#34;We\u0026#39;ve heard a lot of, [even from] my wife, \u0026#39;Hey, this is nice, but [Catan] is a little bit too medieval-ish. It\u0026#39;s not so sexy for me,\u0026#39;\u0026#34; Teuber said. \u0026#34;[Sixth edition] is still pre-industrial, but it\u0026#39;s more vibrant and feels more like an imagined world that you put yourself into [on] this island. And that\u0026#39;s what we heard a lot in the last decade: \u0026#39;Hey, Catan, to me, it\u0026#39;s actually not really connected to a particular story, but it\u0026#39;s me projecting myself into this uninhabited island. There is no one and [no culture]. And you can build up whatever you want to build up.\u0026#39; And that\u0026#39;s nice. So we took out even more [of] the European millage. I quite like that. I have to say my wife\u0026#39;s always a good source of inspiration.\u0026#34;\u003c/p\u003e\u003cp dir=\"ltr\"\u003e\u0026#34;The updated art helps to bring more people into the game,\u0026#34; Hovdestad said. \u0026#34;We\u0026#39;ve done a really good job of evolving past the original design. Now, there\u0026#39;s a variety of different people, poses, [and] garbs. It really just showcases a little bit more range, and the game is a little bit brighter as a result.\u0026#34;\u003c/p\u003e\u003cp dir=\"ltr\"\u003eMost appealing for someone like me, who desires aesthetic excellence for my shelves so that my gaming corner looks pretty, is that the new edition should make it a tad easier to keep all of your expansions organized in one place. \u0026#34;If you buy any of the new Catan base game [boxes] or its expansions--the Seafarers, Cities \u0026amp; Knights, whatever--they [will now] fit inside the base game box,\u0026#34; Hovdestad said. \u0026#34;You can condense them and they all collapse together. All of the boxes are the same size and shape. The card trays that are now in the base game [in sixth edition] are something people have been asking for forever, and you can see [in the new sixth edition box] just the enormous range of accessories [we now have] from years [of player requests]. We\u0026#39;re doing that thing where everybody kept making [third-party accessories] for us and making it ourselves.\u0026#34;\u003c/p\u003e\u003cp dir=\"ltr\"\u003eCatan Sixth Edition is set to launch in Spring 2025, with \u003ca href=\"https://catanshop.com/6th-edition\" rel=\"nofollow \"\u003epreorders\u003c/a\u003e already live. \u0026#34;The production teams on the game have worked some real magic,\u0026#34; Hovdestad concluded. \u0026#34;So while sometimes, yes, updates can feel like they are just cosmetic, we\u0026#39;ve made improvements to how the boxes are designed, [and] what\u0026#39;s in the boxes have actually enabled us to lower the price of the game. Catan Sixth Edition is less expensive than Catan Fifth Edition was, even though it\u0026#39;s a brand-new thing coming out in 2025. Those kinds of opportunities are hard not to take because we all live in the real world. Food got more expensive, my house got more expensive, my taxes went up, but Catan got cheaper.\u0026#34;\u003c/p\u003e\n  \n                        \n        \n    \n    \n                                  \u003c/div\u003e\n\n          \n        \n        \n  \n                    \n  \n    \n          \n            \n  \u003cdiv\u003e\n    \u003cp\u003e\u003ci\u003eGot a news tip or want to contact us directly? Email \u003ca href=\"mailto:news@gamespot.com?subject=Hi GameSpot! I have a news tip for you!\"\u003enews@gamespot.com\u003c/a\u003e\u003c/i\u003e\u003c/p\u003e\n\n    \n      \u003c/div\u003e\n        \n      \u003c/section\u003e\n    \n            \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-24T14:25:00Z",
  "modifiedTime": null
}
