{
  "id": "b393a644-0675-48d9-bd6d-b401628db057",
  "title": "Splitgate 2 director apologises for causing \"division\" following controversial Summer Game Fest appearance",
  "link": "https://www.eurogamer.net/splitgate-2-director-apologises-for-causing-division-following-controversial-summer-game-fest-appearance",
  "description": "Splitgate 2 game director Ian Proulx has apologised for causing \"division in the community\" following his controversial Summer Game Fest appearance, in which he wore a MAGA-style \"Make FPS Great Again\" hat while onstage. Read more",
  "author": "Matt Wales",
  "published": "Tue, 10 Jun 2025 23:51:41 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "PC",
    "Xbox One",
    "FPS",
    "PS5",
    "Shooter",
    "Multiplayer Competitive",
    "First person",
    "PS4",
    "1047 Games",
    "Science Fiction",
    "Single Player",
    "Xbox Series X/S",
    "Splitgate 2"
  ],
  "byline": "Matt Wales",
  "length": 2804,
  "excerpt": "Splitgate 2 game director Ian Proulx has apologised for causing \"division in the community\" following his controversial…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/10d755d6883c36c8018859c27159cee5/icon/apple-touch-icon-152x152.png",
  "text": "\"I am sorry... because of what this has done to the community.\" Image credit: 1047 Games Splitgate 2 game director Ian Proulx has apologised for causing \"division in the community\" following his controversial Summer Game Fest appearance, in which he wore a MAGA-style \"Make FPS Great Again\" hat while onstage. Proulx's Summer Game Fest segment last Friday almost immediately drew criticism from viewers; some felt using the high-profile platform to attack another developer's game - he announced he was \"tired of playing the same Call of Duty every year\" - was tasteless, but it was his hat that seemed to cause most controversy. Its \"Make FPS Great Again\" logo clearly invoked divisive US president Donald Trump's notorious \"Make America Great Again\" slogan, and now - after initially refusing to apologise for wearing it - Proulx has acknowledged the choice, while 'not political', was ill-advised. \"It is really freaking hard as an independent studio to break through the noise,\" he explained in a video posted on social media. \"We saw it at the TGAs; we had this great trailer and there's 50 other great trailers, and it didn't really have an impact. And so at our biggest stage, coming out of beta, we needed something to grab attention and... this is what we came up with.\" \"We did not intend for this to be taken in any political way whatsoever,\" he continued. \"Obviously I knew there would be some level of controversy, but we really saw this as a meme that was stating our truth. Which is we do want to improve this genre, we are disappointed with the state of the genre. And so we took [the slogan] as a meme that we thought would not be nearly as negatively received as the way it was. And so I want to apologise.\" \"And the reason I am sorry is because of what this has done to the community. The most important thing to me right now is I want to have an amazing community... I hate seeing division. And that's what I’m seeing now, on both sides. There's division in the community, and for that I am truly sorry... I do stand by the [face value] intent of this, which is... we do want to improve this genre... But I also understand that it's not just about intent, it's about impact, and the platform that we have had has had a negative impact, and for that I'm truly sorry.\" Proulx's Summer Game Fest appearance isn't the only controversy Splitgate 2 has faced in recent days, however. Fans lambasted the free-to-play shooter over the weekend after developer 1047 Games released a cosmetic bundle priced $80 USD, supposedly discounted from $145. In response, the studio slashed that to $40 and reduced prices across the store, pledging to \"double down on being community first and listening to you guys.\"",
  "image": "https://assetsio.gnwcdn.com/splitgate2_wdv5eIY.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003e\u0026#34;I am sorry... because of what this has done to the community.\u0026#34;\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/splitgate2_wdv5eIY.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/splitgate2_wdv5eIY.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/splitgate2_wdv5eIY.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Splitgate 2 artwork showing a player in sleek, curved pink, blue, and white armour running with their gun.\" data-src-full=\"https://assetsio.gnwcdn.com/splitgate2_wdv5eIY.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003e1047 Games\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nSplitgate 2 game director Ian Proulx has apologised for causing \u0026#34;division in the community\u0026#34; following his controversial Summer Game Fest appearance, in which he wore a MAGA-style \u0026#34;Make FPS Great Again\u0026#34; hat while onstage.\n\u003c/p\u003e\n\u003cp\u003e\nProulx\u0026#39;s Summer Game Fest segment last Friday almost immediately drew criticism from viewers; some felt using the high-profile platform to attack another developer\u0026#39;s game - he announced he was \u0026#34;tired of playing the same Call of Duty every year\u0026#34; - was tasteless, but it was his hat that seemed to cause most controversy.\n\u003c/p\u003e\n\u003cp\u003e\nIts \u0026#34;Make FPS Great Again\u0026#34; logo clearly invoked divisive US president Donald Trump\u0026#39;s notorious \u0026#34;Make America Great Again\u0026#34; slogan, and now - after initially \u003ca href=\"https://x.com/Splitgate/status/1931162849977442371\"\u003erefusing to apologise\u003c/a\u003e for wearing it - Proulx has acknowledged the choice, while \u0026#39;not political\u0026#39;, was ill-advised.\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;It is really freaking hard as an independent studio to break through the noise,\u0026#34; he explained in a \u003ca href=\"https://x.com/Splitgate/status/1932502832281694366\"\u003evideo posted on social media\u003c/a\u003e. \u0026#34;We saw it at the TGAs; we had this great trailer and there\u0026#39;s 50 other great trailers, and it didn\u0026#39;t really have an impact. And so at our biggest stage, coming out of beta, we needed something to grab attention and... this is what we came up with.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;We did not intend for this to be taken in any political way whatsoever,\u0026#34; he continued. \u0026#34;Obviously I knew there would be some level of controversy, but we really saw this as a meme that was stating our truth. Which is we do want to improve this genre, we are disappointed with the state of the genre. And so we took [the slogan] as a meme that we thought would not be nearly as negatively received as the way it was. And so I want to apologise.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\n\u0026#34;And the reason I am sorry is because of what this has done to the community. The most important thing to me right now is I want to have an amazing community... I hate seeing division. And that\u0026#39;s what I’m seeing now, on both sides. There\u0026#39;s division in the community, and for that I am truly sorry... I do stand by the [face value] intent of this, which is... we do want to improve this genre... But I also understand that it\u0026#39;s not just about intent, it\u0026#39;s about impact, and the platform that we have had has had a negative impact, and for that I\u0026#39;m truly sorry.\u0026#34;\n\u003c/p\u003e\n\u003cp\u003e\nProulx\u0026#39;s Summer Game Fest appearance isn\u0026#39;t the only controversy Splitgate 2 has faced in recent days, however. Fans lambasted the free-to-play shooter over the weekend after developer 1047 Games \u003ca href=\"https://www.eurogamer.net/splitgate-2-slashes-145-cosmetic-bundle-price-following-fan-backlash\"\u003ereleased a cosmetic bundle priced $80 USD, supposedly discounted from $145\u003c/a\u003e. In response, the studio slashed that to $40 and reduced prices across the store, pledging to \u0026#34;double down on being community first and listening to you guys.\u0026#34;\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-10T23:51:41.263486Z",
  "modifiedTime": null
}
