{
  "id": "b3feaa4a-e44c-40bd-a5c5-5de3e36274b8",
  "title": "Bungie and PlayStation are working on a MOBA inspired by Nintendo's Smash Bros, claims report",
  "link": "https://www.rockpapershotgun.com/bungie-and-playstation-are-working-on-a-moba-inspired-by-nintendos-smash-bros-claims-report",
  "description": "Destiny creators Bungie are reportedly making a team-based MOBA that takes hefty inspiration from Nintendo's Smash Bros series. Or rather, they were. Codenamed Gummy Bears, the project is now apparently in the hands of another, newly founded PlayStation studio, with 40 Bungie developers sticking around to work on it. Read more",
  "author": "Edwin Evans-Thirlwell",
  "published": "Mon, 13 Jan 2025 17:31:51 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Bungie"
  ],
  "byline": "Edwin Evans-Thirlwell",
  "length": 2134,
  "excerpt": "Destiny creators Bungie are reportedly making a team-based MOBA that takes hefty inspiration from Nintendo's Smash Bros…",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/78813ef66c4d48aed643ad8c3a57062a/icon/apple-touch-icon.png",
  "text": "Does a Gummy Bear leak in the woods Image credit: Nintendo Destiny creators Bungie are reportedly making a team-based MOBA that takes hefty inspiration from Nintendo's Smash Bros series. Or rather, they were. Codenamed Gummy Bears, the project is now apparently in the hands of another, newly founded PlayStation studio, with 40 Bungie developers sticking around to work on it. According to The Game Post, who cite anonymous sources, the new Sony studio in question is the one founded last year when Bungie (who are owned by Sony) announced major restructuring. Consisting of 155 people, the new studio were said back then to be working on an untitled \"action game set in a brand-new science-fantasy universe\". The Gummy Bear project is described as \"vibrant\", \"colourful\", \"lo-fi\", and \"cosy\". Perhaps needless to say, it's designed for a younger audience. The Game Post's sources claim it's been in development for three years, and uses a percentage-based damage system, where blows knock back characters further and further, rather than traditional health bars. Which is very Smash Bros. It's also said to have three class types - support, attack and defence - and a bunch of modes, with the ability to hang out with people between matches. Which I guess implies that there's a hub environment of some kind. Less excited about that stuff. I hate hanging out. Leave me alone.Bungie's known projects include the Destiny series and a reboot of Marathon - aged cousin of DOOM turned PvP extraction shooter. Bitter old farts like myself and Brendy do not think much of nu-Marathon, whose workings remain a mystery almost two years on from announcement. But galloping guides editor Ollie is rather more optimistic. In our round-up of 2025's most anticipated games, he comments that \"I adore extraction shooters, and despite the continued dominance of Tarkov and Hunt, Bungie has the potential to create the genre's new frontrunner\". Me, I'd rather play a Bungie Smash Bros homage. I mean, Bungie are the people who invented the Gravity Hammer.",
  "image": "https://assetsio.gnwcdn.com/DarkSamus1.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n  \n\n        \u003cp\u003eDoes a Gummy Bear leak in the woods\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/DarkSamus1.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/DarkSamus1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/DarkSamus1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/DarkSamus1.jpg?width=382\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Dark Samus striking a pose in Smash Bros\" width=\"382\" height=\"215\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eNintendo\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eDestiny creators Bungie are reportedly making a team-based MOBA that takes hefty inspiration from Nintendo\u0026#39;s Smash Bros series. Or rather, they were. Codenamed Gummy Bears, the project is now apparently in the hands of another, newly founded PlayStation studio, with 40 Bungie developers sticking around to work on it.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://thegamepost.com/exclusive-details-bungie-moba-smash-bros-gummybears/\"\u003eThe Game Post\u003c/a\u003e, who cite anonymous sources, the new Sony studio in question is the one founded last year when Bungie (who are owned by Sony) \u003ca href=\"https://www.rockpapershotgun.com/destiny-creators-bungie-lay-off-220-people-and-form-new-studio-within-sony-to-stave-off-financial-ruin\"\u003eannounced major restructuring\u003c/a\u003e. Consisting of 155 people, the new studio were said back then to be working on an untitled \u0026#34;action game set in a brand-new science-fantasy universe\u0026#34;.\u003c/p\u003e\n\u003cp\u003eThe Gummy Bear project is described as \u0026#34;vibrant\u0026#34;, \u0026#34;colourful\u0026#34;, \u0026#34;lo-fi\u0026#34;, and \u0026#34;cosy\u0026#34;. Perhaps needless to say, it\u0026#39;s designed for a younger audience. The Game Post\u0026#39;s sources claim it\u0026#39;s been in development for three years, and uses a percentage-based damage system, where blows knock back characters further and further, rather than traditional health bars. Which is very Smash Bros.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s also said to have three class types - support, attack and defence - and a bunch of modes, with the ability to hang out with people between matches. Which I guess implies that there\u0026#39;s a hub environment of some kind. Less excited about that stuff. I hate hanging out. Leave me alone.\u003c/p\u003e\u003cp\u003eBungie\u0026#39;s known projects include the Destiny series and a reboot of \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/marathon\"\u003eMarathon\u003c/a\u003e - aged cousin of DOOM turned PvP extraction shooter. Bitter old farts like myself and \u003ca href=\"https://www.rockpapershotgun.com/bungie-seek-to-reassure-everyone-that-marathon-is-still-alive-by-saying-almost-nothing-about-it\"\u003eBrendy\u003c/a\u003e do not think much of nu-Marathon, whose workings remain a mystery almost two years on from announcement. But galloping guides editor Ollie is rather more optimistic. In our round-up of \u003ca href=\"https://www.rockpapershotgun.com/our-50-most-anticipated-pc-games-of-2025\"\u003e2025\u0026#39;s most anticipated games\u003c/a\u003e, he comments that \u0026#34;I adore extraction shooters, and despite the continued dominance of Tarkov and Hunt, Bungie has the potential to create the genre\u0026#39;s new frontrunner\u0026#34;.\u003c/p\u003e\n\u003cp\u003eMe, I\u0026#39;d rather play a Bungie Smash Bros homage. I mean, Bungie are the people who invented \u003ca href=\"https://www.youtube.com/watch?v=zejmZGaonLY\"\u003ethe Gravity Hammer\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-13T17:31:51.275049Z",
  "modifiedTime": null
}
