{
  "id": "b9ed67e6-7ccb-43ea-9a29-ccfd3a14b6df",
  "title": "Daily Deals: Wingspan Board Game, Xbox Controllers, PS5 SSD, Samsung Gaming Monitors, and More",
  "link": "https://www.ign.com/articles/daily-deals-board-games-xbox-controllers-ps5-ssd-samsung-gaming-monitors",
  "description": "We've rounded up the most interesting deals for today.",
  "author": "Eric Song",
  "published": "Thu, 31 Oct 2024 00:05:00 +0000",
  "source": "http://feeds.ign.com/ign/all",
  "categories": null,
  "byline": "Eric Song",
  "length": 8985,
  "excerpt": "We've rounded up the most interesting deals for today.",
  "siteName": "IGN",
  "favicon": "",
  "text": "Today's daily deals include the highly rated Wingspan board game, Xbox controllers, Samsung gaming monitors, a PS5-compatible solid state drive (SSD), 50% off an annual Walmart+ subscription, an OLED gaming TV, dumbbells, and more.Featured in this articleYou can quickly browse through all of the listed products on sale above. For more information on each product and why they are worth your consideration, read through below.Walmart+ Membership Includes a Paramount+ SubscriptionIf you're a regular Walmart shopper, you might want to consider signing up for a Walmart+ annual membership. Walmart+ gives you a whole host of benefits that extends beyond free expedited shipping, including a Paramount+ Essential subscription*, which normally costs $7.99/month for the essential plan itself, as well as limited time offers (scroll down to see what's currently available) and more.*Paramount+ Essential Plan only. By selecting \"Get Paramount+\", you agree that we'll share your Walmart+ membership status with Paramount+ to validate benefit access. You'll be redirected to paramountplus.com to create a new Paramount+ account. Restrictions apply.See Walmart+ Terms \u0026 ConditionsWingspan Board GameApply 25% off Target Circle CouponWingspan Board GameWe haven't seen a deal on Wingspan at all in 2024 until now. Target has it for $39.74 when you apply the 25% off Target Circle coupon. This Stonemeier game released in 2019, but we still consider it one of the best board games to play in 2024. Wingspan is a deceptively simple and yet endlessly replayable game, and you'll find yourself developing and honing new strategies with every subsequent playthough. In our IGN 8/10 rated Wingspan review, Matt Thrower writes, \"As you might have gathered, Wingspan is a moderately complex game, certainly moreso than most of its peers who’ve made the jump into wider popularity. But it’s clear from the success of the game that its delightful components and appealing theme are more than enough to get many players to take the plunge. And, once there, they’re won over by the absorbing and addictive strategies on offer.\"Xbox Wireless ControllerXbox and PC gamers don't need to wait until Black Friday to score a great deal on a quality controller. Right now, Lenovo is offering the official Xbox wireless controller for the Xbox Series S|X and PC in your choice of three color options for only $39.99 shipped after you apply coupon code \"FALLXBOX\". Those color options are Carbon Black, Pulse Red, and Shock Blue. Although at this point we'd generally recommend waiting for Black Friday to buy something, this one is a safe bet.Free 2TB 990 Pro SSD with Select Samsung Gaming MonitorsSamsung has kicked off its Early Black Friday Sale with some interesting deals on a few of its highest-end gaming monitors. Not only are these gaming monitors discounted by up to $600 off – thus matching the prices at retailers like Amazon or Best Buy – they're bundled with a free 2TB Samsung 990 Pro SSD. The SSD promotion is only available through Samsung direct, and since it currently sells for $169.99 everywhere, you don't want to miss out on this potential freebie.10% off Select Pedialyte Products at Target with Target Circle (App Only)SK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSDSK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSDThere will undoubtedly be a decent selection of SSDs on sale during Black Friday, but if you need one right now, there's one great deal that is already available. Amazon is offering a 2TB SK Hynix P41 Platinum PCIe 4.0 M.2 NVME solid state drive (SSD) for only $134.99 shipped. The SK Hynix P41 Platinum is one of the fastest PCI-E 4.0 SSDs available and is considerably less expensive than other comparable SSDs, like the Samsung 990 Pro ($169.99) and the WD SN850X ($149.49). This also happens to be an excellent candidate for your PlayStation 5 console or gaming PC.65\" Samsung S90C 4K OLED Smart TV65\" Samsung S90C 4K OLED Smart TVBonus $50 Best Buy gift card if you choose in-store pickupHere's your chance to get one of the best OLED TVs on the market at an amazing price. Right now, Samsung is offering its 65\" Samsung S90C 4K OLED Smart TV for only $1,299.99 after a massive 50% price drop. Free shipping is offered for select zip codes, but you can also pick it up in-store at your local Best Buy. This is an excellent TV to pair up with your PlayStation 5 or Xbox Series X. In fact, this TV could even be a better gaming TV than the LG C4. Although we haven't personally tested it, RTINGS has and they mention that \"the LG (C4) is noticeably dimmer in Game Mode while the Samsung (S90C) isn't, making the Samsung the better choice for gamers.\"Update: Samsung is sweetening the deal by throwing in a $50 Best Buy gift card if you buy from Samsung.com but pick it up at your local Best Buy store. The gift card will be automatically added to your cart.32\" Alienware AW3225QF 4K OLED Gaming MonitorBonus $250 Dell Promotional Gift Card32\" Alienware AW3225QF Curved 4K 240Hz G-SYNC QD OLED Gaming MonitorDell's Holiday Savings Event, a precursor to Black Friday, kicks off today. Since it's still early, most of the deals right now are lukewarm at best, but there is one fantastic deal you shouldn't sleep on. Right now, the Alienware AW3225QF 32\" 4K QD OLED gaming monitor is down to $1,019.99 after a 15% off coupon code \"MONITORS15\". Although we've seen this monitor discounted as low as $999.99, Dell is also throwing in a bonus $250 promotional e-gift card this time. There are some T\u0026Cs to take note of: You'll receive the gift card within a few weeks after the monitor ships, and you'll have 90 days to use it. It's good on pretty much anything at Dell (excluding gift cards). If you're looking for the best 4K gaming monitor, this should definitely be on your short list. This is the monitor I personally use and I absolutely recommend it.Lenovo Yoga Pro 9i 16\" Intel Core Ultra 9 RTX 4060 Slim LaptopLenovo Yoga Pro 9i 16\" Intel Core Ultra 9 RTX 4060 Slim LaptopLooking for a stylish, sleek, and conveniently portable laptop that also happens to be a perfectly capable gaming rig ahead of Black Friday? It's going to be hard to beat this Lenovo Yoga Pro 9i laptop that's currently on sale at Best Buy for $1,599.99 shipped after a $300 instant discount. The exact same configuration would run you about $2,000 at Lenovo. The Yoga Pro is perhaps the best overall consumer laptop to come from Lenovo. Sure, it might not be as powerful as a Legion Pro, but it's more practical for daily use, has better build quality, a better display, more premium aesthetics, and can still reasonably play most games at 1080p resolution with its RTX 40 series GPU.Lenovo Legion Go 512GBLenovo Legion Go 512GBLenovo is teasing Black Friday with this excellent deal on one of the best gaming handhelds on the market. Both Amazon and Lenovo are currently offering the Lenovo Legion Go 512GB gaming handheld for only $499. That's an instant $200 off discount and the lowest price we've seen all year. In fact, it's $50 cheaper than the best deal we saw during Amazon's October Prime Day sale. It's currently less expensive than the 512GB models of its two closest competitors, the Steam Deck OLED and the Asus ROG Ally Z1 Extreme, even though it normally commands a higher retail price.PowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell SetPowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell SetBowflex isn't the only option when it comes to adjustable dumbbell sets. PowerBlock is another trusted brand at a much lower price point. Ahead of Black Friday, Woot! (owned by Amazon) is offering the PowerBlock EXP Stage 1 (5 to 50lb) adjustable dumbbell set for only $199.99, which is less than half the cost of a comparable set of Bowflex SelectTech dumbbells. For those who need more than 50 pounds of weight per dumbbell, PowerBlock also offers expansion kits that can increase the maximum weight to 70 pounds or 90 pounds. Both kits – Stage 2 (50 to 70lb) and Stage 3 (70 to 90lb) – are also on sale at Woot! for $89.99 each. Amazon Prime members get free shipping; everyone else will pay $6 for flat rate shipping. That's reasonable when you consider the fact that the package is going to weigh over 100 pounds.SteelSeries Arctis Nova 7 Wireless Gaming HeadsetSteelSeries Arctis Nova 7 Wireless Gaming HeadsetFor a limited time, Best Buy is heavily discounting the SteelSeries Arctis Nova 7 FaZe Clan Limited Edition wireless gaming headset for PlayStation 5 and PC. Normally it's priced at $189.99, but today it's down to $99.99 shipped. That's an outrageously good price for the best wireless PS5 gaming headset of 2024 and if you're in the market for a SteelSeries headset, you shouldn't miss out on this deal.Eric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn't hunting for deals for other people at work, he's hunting for deals for himself during his free time.Originally posted: Oct 31, 2024 12:05 am",
  "image": "https://assets-prd.ignimgs.com/2024/10/29/dd102924-1730224671965.jpg?width=1280",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003csection data-cy=\"article-subtitle\"\u003e\u003cp data-cy=\"paragraph\"\u003eToday\u0026#39;s daily deals include the highly rated Wingspan board game, Xbox controllers, Samsung gaming monitors, a PS5-compatible solid state drive (SSD), 50% off an annual Walmart+ subscription, an OLED gaming TV, dumbbells, and more.\u003c/p\u003e\u003cp id=\"featured-in-this-article\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Featured in this article\"\u003eFeatured in this article\u003c/h2\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eYou can quickly browse through all of the listed products on sale above. For more information on each product and why they are worth your consideration, read through below.\u003c/p\u003e\u003cp id=\"walmart-membership\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Walmart+ Membership\"\u003eWalmart+ Membership Includes a Paramount+ Subscription\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209813\"\u003e\u003cp data-cy=\"paragraph\"\u003eIf you\u0026#39;re a regular Walmart shopper, you might want to consider signing up for a \u003ca href=\"https://zdcs.link/QddPex?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eWalmart+ annual membership\u003c/a\u003e.  Walmart+ gives you a whole host of benefits that extends beyond free expedited shipping, including a Paramount+ Essential subscription*, which normally costs $7.99/month for the essential plan itself, as well as limited time offers (\u003ca href=\"https://zdcs.link/QddPex?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003escroll down\u003c/a\u003e to see what\u0026#39;s currently available) and more.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003e*Paramount+ Essential Plan only. By selecting \u0026#34;Get Paramount+\u0026#34;, you agree that we\u0026#39;ll share your Walmart+ membership status with Paramount+ to validate benefit access. You\u0026#39;ll be redirected to paramountplus.com to create a new Paramount+ account. Restrictions apply.\u003c/em\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003ca href=\"https://www.walmart.com/help/article/walmart-terms-of-use/de696dfa1dd4423bb1005668dd19b845\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSee Walmart+ Terms \u0026amp; Conditions\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cp id=\"wingspan-board-game\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Wingspan Board Game\"\u003eWingspan Board Game\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209817\"\u003e\u003cdiv id=\"209817\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"Wingspan Board Game\"\u003e\u003cimg decoding=\"async\" alt=\"Wingspan Board Game\" src=\"https://assets-prd.ignimgs.com/2024/10/29/wingspan-1730221506265.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eApply 25% off Target Circle Coupon\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eWingspan Board Game\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eWe haven\u0026#39;t seen a deal on \u003ca href=\"https://zdcs.link/z3beXR?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eWingspan\u003c/a\u003e at all in 2024 until now. Target has it for $39.74 when you apply the \u003ca href=\"https://zdcs.link/Qp6YRg?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003e25% off Target Circle coupon\u003c/a\u003e. This Stonemeier game released in 2019, but we still consider it one of the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/2019/10/01/best-boardgames-of-2019\"\u003ebest board games to play in 2024\u003c/a\u003e. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eWingspan is a deceptively simple and yet endlessly replayable game, and you\u0026#39;ll find yourself developing and honing new strategies with every subsequent playthough. In our IGN 8/10 rated \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/wingspan-board-game-review\"\u003eWingspan review\u003c/a\u003e, Matt Thrower writes, \u0026#34;As you might have gathered, Wingspan is a moderately complex game, certainly moreso than most of its peers who’ve made the jump into wider popularity. But it’s clear from the success of the game that its delightful components and appealing theme are more than enough to get many players to take the plunge. And, once there, they’re won over by the absorbing and addictive strategies on offer.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp id=\"xbox-controller\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Xbox Controller\"\u003eXbox Wireless Controller\u003c/h2\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eXbox and PC gamers don\u0026#39;t need to wait until \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e to score a great deal on a quality controller. Right now, Lenovo is offering the official \u003ca href=\"https://zdcs.link/Qrp4GP?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eXbox wireless controller\u003c/a\u003e for the Xbox Series S|X and PC in your choice of three color options for only $39.99 shipped after you apply coupon code \u0026#34;\u003cstrong\u003eFALLXBOX\u003c/strong\u003e\u0026#34;. Those color options are Carbon Black, Pulse Red, and Shock Blue. Although at this point we\u0026#39;d generally recommend waiting for Black Friday to buy something, this one is a safe bet.\u003c/p\u003e\u003cp id=\"buy-monitor-get-free-ssd\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Buy Monitor, Get Free SSD\"\u003eFree 2TB 990 Pro SSD with Select Samsung Gaming Monitors\u003c/h2\u003e\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eSamsung has kicked off its \u003ca href=\"https://zdcs.link/zjGxlP?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eEarly Black Friday Sale\u003c/a\u003e with some interesting deals on a few of its highest-end gaming monitors. Not only are these gaming monitors discounted by up to $600 off – thus matching the prices at retailers like \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/amazon-black-friday-2024-when-will-the-sale-start-this-year\"\u003eAmazon\u003c/a\u003e or Best Buy – they\u0026#39;re bundled with a free \u003ca href=\"https://zdcs.link/zJVbEe?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003e2TB Samsung 990 Pro SSD\u003c/a\u003e. The SSD promotion is only available through Samsung direct, and since it currently sells for $169.99 everywhere, you don\u0026#39;t want to miss out on this potential freebie.\u003c/p\u003e\u003cdiv id=\"209819\" data-cy=\"productcard-view-trigger\" catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\"\u003e\u003cp\u003e\u003cspan title=\"10% off Select Pedialyte Products at Target with Target Circle (App Only)\"\u003e\u003cimg decoding=\"async\" alt=\"10% off Select Pedialyte Products at Target with Target Circle (App Only)\" src=\"https://assets-prd.ignimgs.com/2024/10/29/pedialyte-1730221978912.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003e10% off Select Pedialyte Products at Target with Target Circle (App Only)\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp id=\"2tb-ps5-ssd\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"2TB PS5 SSD\"\u003eSK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSD\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209820\"\u003e\u003cdiv id=\"209820\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"SK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSD\"\u003e\u003cimg decoding=\"async\" alt=\"SK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSD\" src=\"https://assets-prd.ignimgs.com/2024/10/29/skhynixssd-1730222247871.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eSK Hynix Platinum P41 2TB PCIe Gen4 x4 M.2 SSD\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eThere will undoubtedly be a decent selection of SSDs on sale during \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e, but if you need one right now, there\u0026#39;s one great deal that is already available. Amazon is offering a \u003ca href=\"https://zdcs.link/bP0ve?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003e2TB SK Hynix P41 Platinum\u003c/a\u003e PCIe 4.0 M.2 NVME solid state drive (SSD) for only $134.99 shipped. The SK Hynix P41 Platinum is one of the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/the-best-m2-ssds\"\u003efastest PCI-E 4.0 SSDs available\u003c/a\u003e and is considerably less expensive than other comparable SSDs, like the \u003ca href=\"https://zdcs.link/Qm2wZK?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eSamsung 990 Pro\u003c/a\u003e ($169.99) and the \u003ca href=\"https://zdcs.link/9ZdOKY?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eWD SN850X\u003c/a\u003e ($149.49). This also happens to be an excellent candidate for your PlayStation 5 console or gaming PC.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"65-inch-4k-oled-tv\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"65-Inch 4K OLED TV\"\u003e65\u0026#34; Samsung S90C 4K OLED Smart TV\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"fbf0cb98-59c9-47d2-99dc-d304ac293783\" id=\"203712\"\u003e\u003cdiv id=\"203712\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"65\u0026#34; Samsung S90C 4K OLED Smart TV\"\u003e\u003cimg decoding=\"async\" alt=\"65\u0026#34; Samsung S90C 4K OLED Smart TV\" src=\"https://assets-prd.ignimgs.com/2024/06/25/samsungs90c-1719329504284.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003e65\u0026#34; Samsung S90C 4K OLED Smart TV\u003c/h3\u003e\u003c/p\u003e\u003cdiv data-cy=\"solo-product-description\"\u003e\u003cp\u003eBonus $50 Best Buy gift card if you choose in-store pickup\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eHere\u0026#39;s your chance to get one of the best OLED TVs on the market at an amazing price. Right now, Samsung is offering its 65\u0026#34; \u003ca href=\"https://zdcs.link/z7bGJL?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eSamsung S90C\u003c/a\u003e 4K OLED Smart TV for only $1,299.99 after a massive 50% price drop. Free shipping is offered for select zip codes, but you can also pick it up in-store at your local Best Buy. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThis is an \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-tvs-for-ps5\"\u003eexcellent TV to pair up with your PlayStation 5\u003c/a\u003e or Xbox Series X. In fact, this TV could even be a better \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-tvs-for-ps5\"\u003egaming TV\u003c/a\u003e than the LG C4. Although we haven\u0026#39;t personally tested it, \u003ca href=\"https://www.rtings.com/tv/reviews/samsung/s90c-oled\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eRTINGS has\u003c/a\u003e and they mention that \u0026#34;the LG (C4) is noticeably dimmer in Game Mode while the Samsung (S90C) isn\u0026#39;t, making the Samsung the better choice for gamers.\u0026#34;\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cstrong\u003eUpdate\u003c/strong\u003e: Samsung is sweetening the deal by throwing in a $50 Best Buy gift card if you buy from Samsung.com but pick it up at your local Best Buy store. The gift card will be automatically added to your cart.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"32-inch-4k-oled-monitor\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"32-Inch 4K OLED Monitor\"\u003e32\u0026#34; Alienware AW3225QF 4K OLED Gaming Monitor\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209815\"\u003e\u003cdiv id=\"209815\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"32\u0026#34; Alienware AW3225QF Curved 4K 240Hz G-SYNC QD OLED Gaming Monitor\"\u003e\u003cimg decoding=\"async\" alt=\"32\u0026#34; Alienware AW3225QF Curved 4K 240Hz G-SYNC QD OLED Gaming Monitor\" src=\"https://assets-prd.ignimgs.com/2024/09/02/alienwareaw3225qf-1725290477644.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBonus $250 Dell Promotional Gift Card\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003e32\u0026#34; Alienware AW3225QF Curved 4K 240Hz G-SYNC QD OLED Gaming Monitor\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eDell\u0026#39;s Holiday Savings Event, a precursor to \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e, kicks off today. Since it\u0026#39;s still early, most of the deals right now are lukewarm at best, but there is one fantastic deal you shouldn\u0026#39;t sleep on. Right now, the \u003ca href=\"https://zdcs.link/drw66?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eAlienware AW3225QF\u003c/a\u003e 32\u0026#34; 4K QD OLED gaming monitor is down to $1,019.99 after a 15% off coupon code \u0026#34;\u003cstrong\u003eMONITORS15\u003c/strong\u003e\u0026#34;. Although we\u0026#39;ve seen this monitor discounted as low as $999.99, Dell is also throwing in a \u003cstrong\u003ebonus $250 promotional e-gift card\u003c/strong\u003e this time. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThere are some T\u0026amp;Cs to take note of: You\u0026#39;ll receive the gift card within a few weeks after the monitor ships, and you\u0026#39;ll have 90 days to use it. It\u0026#39;s good on pretty much anything at Dell (excluding gift cards). If you\u0026#39;re looking for the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-4k-gaming-monitors\"\u003ebest 4K gaming monitor\u003c/a\u003e, this should definitely be on your short list. This is the monitor I personally use and I absolutely recommend it.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"lenovo-yoga-pro\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Lenovo Yoga Pro\"\u003eLenovo Yoga Pro 9i 16\u0026#34; Intel Core Ultra 9 RTX 4060 Slim Laptop\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209808\"\u003e\u003cdiv id=\"209808\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"Lenovo Yoga Pro 9i 16\u0026#34; Intel Core Ultra 9 RTX 4060 Slim Laptop\"\u003e\u003cimg decoding=\"async\" alt=\"Lenovo Yoga Pro 9i 16\u0026#34; Intel Core Ultra 9 RTX 4060 Slim Laptop\" src=\"https://assets-prd.ignimgs.com/2024/10/28/lenovoyogapro9i-1730155225159.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eLenovo Yoga Pro 9i 16\u0026#34; Intel Core Ultra 9 RTX 4060 Slim Laptop\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eLooking for a stylish, sleek, and conveniently portable laptop that also happens to be a perfectly capable gaming rig ahead of \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e? It\u0026#39;s going to be hard to beat this \u003ca href=\"https://zdcs.link/91b50k?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eLenovo Yoga Pro 9i\u003c/a\u003e laptop that\u0026#39;s currently on sale at Best Buy for $1,599.99 shipped after a $300 instant discount. The exact same configuration would run you about $2,000 at \u003ca href=\"https://zdcs.link/QWd7jn?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eLenovo\u003c/a\u003e. \u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003eThe Yoga Pro is perhaps the best overall consumer laptop to come from Lenovo. Sure, it might not be as powerful as a Legion Pro, but it\u0026#39;s more practical for daily use, has better build quality, a better display, more premium aesthetics, and can still reasonably play most games at 1080p resolution with its RTX 40 series GPU.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"lenovo-legion-go\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"Lenovo Legion Go\"\u003eLenovo Legion Go 512GB\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209814\"\u003e\u003cdiv id=\"209814\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"Lenovo Legion Go 512GB\"\u003e\u003cimg decoding=\"async\" alt=\"Lenovo Legion Go 512GB\" src=\"https://assets-prd.ignimgs.com/2024/10/29/lenovolegiongo-1730221116231.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eLenovo Legion Go 512GB\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eLenovo is teasing \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e with this excellent deal on one of the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-handheld-gaming-pc\"\u003ebest gaming handhelds\u003c/a\u003e on the market. Both Amazon and Lenovo are currently offering the \u003ca href=\"https://zdcs.link/z7boo4?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eLenovo Legion Go 512GB\u003c/a\u003e gaming handheld for only $499. That\u0026#39;s an instant $200 off discount and the lowest price we\u0026#39;ve seen all year. In fact, it\u0026#39;s $50 cheaper than the best deal we saw during Amazon\u0026#39;s October Prime Day sale. It\u0026#39;s currently less expensive than the 512GB models of its two closest competitors, the \u003ca href=\"https://store.steampowered.com/steamdeck\" data-cy=\"styled-link\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSteam Deck OLED\u003c/a\u003e and the \u003ca href=\"https://zdcs.link/z3b44K?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eAsus ROG Ally Z1 Extreme\u003c/a\u003e, even though it normally commands a higher retail price.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"powerblock-dumbbells\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"PowerBlock Dumbbells\"\u003ePowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell Set\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209816\"\u003e\u003cdiv id=\"209816\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"PowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell Set\"\u003e\u003cimg decoding=\"async\" alt=\"PowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell Set\" src=\"https://assets-prd.ignimgs.com/2024/10/29/powerblocksportexpstage1-1730221220583.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003ePowerBlock EXP Stage 1 (5 to 50lbs) Adjustable Dumbbell Set\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003e\u003ca href=\"https://zdcs.link/plr4l?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eBowflex\u003c/a\u003e isn\u0026#39;t the only option when it comes to adjustable dumbbell sets. PowerBlock is another trusted brand at a much lower price point. Ahead of \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/black-friday-2024\"\u003eBlack Friday\u003c/a\u003e, Woot! (owned by Amazon) is offering the \u003ca href=\"https://zdcs.link/znOY1l?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003ePowerBlock EXP Stage 1 (5 to 50lb)\u003c/a\u003e adjustable dumbbell set for only $199.99, which is less than half the cost of a comparable set of Bowflex SelectTech dumbbells. For those who need more than 50 pounds of weight per dumbbell, PowerBlock also offers expansion kits that can increase the maximum weight to 70 pounds or 90 pounds. Both kits – \u003ca href=\"https://zdcs.link/9ZdmWR?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eStage 2 (50 to 70lb)\u003c/a\u003e and \u003ca href=\"https://zdcs.link/9ZdmWR?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eStage 3 (70 to 90lb)\u003c/a\u003e – are also on sale at Woot! for $89.99 each. Amazon Prime members get free shipping; everyone else will pay $6 for flat rate shipping. That\u0026#39;s reasonable when you consider the fact that the package is going to weigh over 100 pounds.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"steelseries-gaming-headset\"\u003e\u003ch2 data-cy=\"title2\" data-toc-title=\"SteelSeries Gaming Headset\"\u003eSteelSeries Arctis Nova 7 Wireless Gaming Headset\u003c/h2\u003e\u003c/p\u003e\u003cdiv catalogid=\"a078a176-f35d-4a3e-8dd1-fb4ee74666c5\" id=\"209818\"\u003e\u003cdiv id=\"209818\" data-cy=\"productcard-view-trigger\"\u003e\u003cp\u003e\u003cspan title=\"SteelSeries Arctis Nova 7 Wireless Gaming Headset\"\u003e\u003cimg decoding=\"async\" alt=\"SteelSeries Arctis Nova 7 Wireless Gaming Headset\" src=\"https://assets-prd.ignimgs.com/2024/10/29/steelseriesarctisnova7faze-1730221622524.jpg?width=220\u0026amp;auto=webp\u0026amp;quality=20\u0026amp;dpr=0.05\" data-cy=\"progressive-image\"/\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-cy=\"solo-product-name\"\u003e\u003ch3\u003eSteelSeries Arctis Nova 7 Wireless Gaming Headset\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-cy=\"paragraph\"\u003eFor a limited time, Best Buy is heavily discounting the \u003ca href=\"https://zdcs.link/QGVNBx?object_uuid=5970728a-517e-4e0c-8943-b5b2466da12c\u0026amp;t=article\" data-cy=\"styled-link\" target=\"_blank\" rel=\"nofollow\"\u003eSteelSeries Arctis Nova 7\u003c/a\u003e FaZe Clan Limited Edition wireless gaming headset for PlayStation 5 and PC. Normally it\u0026#39;s priced at $189.99, but today it\u0026#39;s down to $99.99 shipped. That\u0026#39;s an outrageously good price for the \u003ca data-cy=\"styled-link\" href=\"https://www.ign.com/articles/best-ps5-headset\"\u003ebest wireless PS5 gaming headset of 2024\u003c/a\u003e and if you\u0026#39;re in the market for a SteelSeries headset, you shouldn\u0026#39;t miss out on this deal.\u003c/p\u003e\u003cp data-cy=\"paragraph\"\u003e\u003cem\u003eEric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn\u0026#39;t hunting for deals for other people at work, he\u0026#39;s hunting for deals for himself during his free time.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cdiv data-cy=\"caption\"\u003e\u003cp\u003eOriginally posted: Oct 31, 2024 12:05 am\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-31T00:05:00Z",
  "modifiedTime": "2024-10-31T00:11:09.477Z"
}
