{
  "id": "c49598b3-bebc-4938-8a37-796ba15e6d8a",
  "title": "As Deadly LA Fires Rage Nearby, Riot Games Promises To 'Give Back In Every Way We Can'",
  "link": "https://kotaku.com/la-fires-palisades-eaton-riot-games-studios-closed-1851736562",
  "description": "Riot Games is temporarily closing its headquarters in Los Angeles County as dangerous fires continue to burn in the Palisades and elsewhere. The League of Legends maker, which is situated just a few miles from the current edge of the Santa Monica evacuation warning zone, will only allow staff associated with “critical…Read more...",
  "author": "Ethan Gach",
  "published": "Thu, 09 Jan 2025 21:20:00 GMT",
  "source": "https://kotaku.com/rss",
  "categories": [
    "riot games",
    "santa monica studio",
    "santa monica california",
    "palisades",
    "insomniac games",
    "los angeles",
    "naughty dog",
    "palisades fire",
    "malibu california",
    "disaster accident",
    "league of legends",
    "westside",
    "a dylan jadeja",
    "infinity ward",
    "activision",
    "kotaku",
    "treyarch"
  ],
  "byline": "Ethan Gach",
  "length": 3021,
  "excerpt": "The League of Legends maker said it's ready to 'stand up for Los Angeles' amid the ongoing crisis",
  "siteName": "Kotaku",
  "favicon": "https://i.kinja-img.com/image/upload/c_fill,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png",
  "text": "Riot Games is temporarily closing its headquarters in Los Angeles County as dangerous fires continue to burn in the Palisades and elsewhere. The League of Legends maker, which is situated just a few miles from the current edge of the Santa Monica evacuation warning zone, will only allow staff associated with “critical functions” into the building, at least through the end of the week, Polygon reports. Suggested ReadingLive Forever in the Universe of 'New World: Aeternum'Suggested ReadingOf the multiple fires that broke out across LA this week, the Palisades fire is the biggest and has already burned through more than 15,000 acres. The blaze has been responsible for at least 5 deaths so far and the destruction of thousands of buildings, though the full damage won’t be known for some time. The Palisades fire is the closest to downtown Santa Monica, home to tens of thousands of residents as well as hundreds of businesses, including several major video game studios and companies. In addition to Riot Games, Call of Duty publisher Activision, God of War maker Santa Monica Studio, and Last of Us maker Naughty Dog are also within a few miles of the fire. Black Ops 6 studio Treyarch is also in the area, while fellow Call of Duty studio Infinity Ward is north of the Palisades in Woodland Hills. Spider-Man maker Insomniac Games, meanwhile, is in Burbank, closer to the Eaton fire where 10,600 acres have burned so far. “Employee safety and well-being is our top priority,” a spokesperson for Activisiom told Kotaku. “We’re actively monitoring the situation as it is quickly evolving. We’ve been in contact with the employees closest to the impacted areas to confirm their safety and provide resources.”“For Rioters reading this, please remember, the mission and the work will always be there,” CEO A. Dylan Jadeja wrote on LinkedIn on Thursday. “Right now, what matters most is taking care of yourselves and each other. It takes a village to do what we do and we are all in this moment together. For those in our offices around the world who have been reaching out, your support has been incredible — we’re reminded once again how strong a team Riot truly is.”He continued, It’s too early for anyone to know exactly what will be needed or what can be done in the aftermath of this. The reality is… we are still in the middle of it. But when the time is right, Riot will be ready to stand up for Los Angeles and give back in every way we can to all of these communities that mean so much to who we are. After all, while our reach is global, the heart of Riot Games has always been in Los Angeles. Los Angeles raised us and we are proud to call this great city our home.Los Angeles County remains on a red flag warning through Friday night. While the worst of the winds, which reached up to 100 miles an hour earlier this week and helped fuel the fires, have since died down significantly, several of the fires, including the Palisades and Eaton ones, still have 0 percent containment as of Thursday afternoon. .",
  "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f0bab690a9de3e8846e85802f4ca847d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eRiot Games is temporarily closing its headquarters in Los Angeles County as dangerous fires continue to burn in the Palisades and elsewhere. \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;Internal link\u0026#34;,\u0026#34;https://kotaku.com/arcane-final-season-first-of-many-league-of-legends-1851535061?_gl=1*1si7qnw*_ga*ODE3ODM5ODIyLjE3MjA0NjY0NTg.*_ga_V4QNJTT5L0*MTczNjQ1MzIxNi43Mi4xLjE3MzY0NTY3NDEuMTIuMC4w\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://kotaku.com/arcane-final-season-first-of-many-league-of-legends-1851535061?_gl=1*1si7qnw*_ga*ODE3ODM5ODIyLjE3MjA0NjY0NTg.*_ga_V4QNJTT5L0*MTczNjQ1MzIxNi43Mi4xLjE3MzY0NTY3NDEuMTIuMC4w\"\u003eThe\u003cem\u003e League of Legends\u003c/em\u003e maker\u003c/a\u003e\u003c/span\u003e, which is situated just a few miles from the current edge of the Santa Monica evacuation warning zone, will only allow staff associated with “critical functions” into the building, at least through the end of the week, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.polygon.com/news/506288/la-fires-league-riot-games-offices-closed\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.polygon.com/news/506288/la-fires-league-riot-games-offices-closed\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cem\u003ePolygon \u003c/em\u003ereports\u003c/a\u003e\u003c/span\u003e. \u003c/p\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cdiv data-video-id=\"197298\" data-monetizable=\"true\" data-position=\"sidebar\" data-video-title=\"Live Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\" data-video-blog-id=\"9\" data-video-network=\"kotaku\" data-video-duration=\"108\" data-playlist=\"197298,197284,197260\" data-current=\"197298\"\u003e\u003cdiv\u003e\u003cp\u003eLive Forever in the Universe of \u0026#39;New World: Aeternum\u0026#39;\u003c/p\u003e\u003c/div\u003e\u003cvideo disablepictureinpicture=\"\" muted=\"\" playsinline=\"\" width=\"100%\" height=\"100%\" crossorigin=\"anonymous\" preload=\"none\"\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_240p.mp4\" label=\"240p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_480p.mp4\" label=\"480p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_720p.mp4\" label=\"720p\" type=\"video/mp4\"/\u003e\u003csource data-src=\"https://vid.kinja.com/prod/197298/197298_1080p.mp4\" label=\"1080p\" type=\"video/mp4\"/\u003e\u003c/video\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch4\u003eSuggested Reading\u003c/h4\u003e\u003c/div\u003e\u003cp\u003eOf the multiple fires that broke out across LA this week, the Palisades fire is the biggest and has already burned through more than 15,000 acres. The blaze has been responsible for \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.latimes.com/california/story/2025-01-08/fire-weather-fierce-winds-los-angeles\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.latimes.com/california/story/2025-01-08/fire-weather-fierce-winds-los-angeles\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eat least 5 deaths so far and the destruction of thousands of buildings\u003c/a\u003e\u003c/span\u003e, though the full damage won’t be known for some time. \u003c/p\u003e\u003cp\u003eThe Palisades fire is the closest to downtown Santa Monica, home to tens of thousands of residents as well as hundreds of businesses, including several major video game studios and companies. In addition to Riot Games, \u003cem\u003eCall of Duty\u003c/em\u003e publisher Activision, \u003cem\u003eGod of War\u003c/em\u003e maker Santa Monica Studio, and \u003cem\u003eLast of Us\u003c/em\u003e maker Naughty Dog are also within a few miles of the fire. \u003c/p\u003e\u003cp\u003e\u003cem\u003eBlack Ops 6 \u003c/em\u003estudio Treyarch is also in the area, while fellow \u003cem\u003eCall of Duty\u003c/em\u003e studio Infinity Ward is north of the Palisades in Woodland Hills.\u003cem\u003e Spider-Man\u003c/em\u003e maker Insomniac Games, meanwhile, is in Burbank, closer to the Eaton fire where 10,600 acres have burned so far. \u003c/p\u003e\u003cp\u003e“Employee safety and well-being is our top priority,” a spokesperson for Activisiom told \u003cem\u003eKotaku\u003c/em\u003e. “We’re actively monitoring the situation as it is quickly evolving. We’ve been in contact with the employees closest to the impacted areas to confirm their safety and provide resources.”\u003c/p\u003e\u003cp\u003e“For Rioters reading this, please remember, the mission and the work will always be there,” CEO A. Dylan Jadeja \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.linkedin.com/posts/adjadeja_i-want-to-thank-everyone-who-has-reached-activity-7283170938265772034-AH0e/\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.linkedin.com/posts/adjadeja_i-want-to-thank-everyone-who-has-reached-activity-7283170938265772034-AH0e/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ewrote on LinkedIn\u003c/a\u003e\u003c/span\u003e on Thursday. “Right now, what matters most is taking care of yourselves and each other. It takes a village to do what we do and we are all in this moment together. For those in our offices around the world who have been reaching out, your support has been incredible — we’re reminded once again how strong a team Riot truly is.”\u003c/p\u003e\u003cp\u003eHe continued,\u003c/p\u003e\u003cblockquote data-type=\"BlockQuote\"\u003e\u003cp\u003e It’s too early for anyone to know exactly what will be needed or what can be done in the aftermath of this. The reality is… we are still in the middle of it. But when the time is right, Riot will be ready to stand up for Los Angeles and give back in every way we can to all of these communities that mean so much to who we are. After all, while our reach is global, the heart of Riot Games has always been in Los Angeles. Los Angeles raised us and we are proud to call this great city our home.\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003eLos Angeles County remains on a red flag warning through Friday night. While the worst of the winds, which reached up to 100 miles an hour earlier this week and helped fuel the fires, have since died down significantly, several of the fires, including the Palisades and Eaton ones, \u003cspan\u003e\u003ca data-ga=\"[[\u0026#34;Embedded Url\u0026#34;,\u0026#34;External link\u0026#34;,\u0026#34;https://www.latimes.com/california/story/2025-01-09/even-after-a-two-day-nightmare-l-a-girds-for-more-days-of-fire-weather\u0026#34;,{\u0026#34;metric25\u0026#34;:1}]]\" href=\"https://www.latimes.com/california/story/2025-01-09/even-after-a-two-day-nightmare-l-a-girds-for-more-days-of-fire-weather\" target=\"_blank\" rel=\"noopener noreferrer\"\u003estill have 0 percent containment as of Thursday afternoon\u003c/a\u003e\u003c/span\u003e. \u003c/p\u003e\u003cp\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-09T16:20:00-05:00",
  "modifiedTime": null
}
