{
  "id": "cbd0e6cd-3271-41cb-9a47-4eed27e9cc94",
  "title": "Creating Atomfall’s Haunting Casterfell Woods – Check Out Exclusive New Screenshots",
  "link": "https://news.xbox.com/en-us/2024/12/18/atomfall-casterfell-woods-exclusive-screenshots-trailer-breakdown/",
  "description": "The post Creating Atomfall’s Haunting Casterfell Woods – Check Out Exclusive New Screenshots appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Wed, 18 Dec 2024 17:00:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games",
    "PC Gaming",
    "Xbox Game Pass",
    "Atomfall",
    "Game Pass",
    "PC",
    "Rebellion",
    "Xbox Series X|S"
  ],
  "byline": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "length": 6434,
  "excerpt": "Atomfall is home to some weird and wonderful sights - and the haunting Casterfell Woods are no exception. Find out how the team designed the location, with some exclusive new screenshots.",
  "siteName": "Xbox Wire",
  "favicon": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2019/12/Nexus_GRN_on_WHT2.png",
  "text": "A few weeks ago, we released the latest trailer for Atomfall, our upcoming game where you will have to uncover the mystery behind what happened at the UK’s Windscale nuclear power station in the 1950s. This is a fictionalised telling of what happened following this real-life nuclear disaster in Northern England. The trailer showcases the game’s folk horror influences and give you the first glimpse of Casterfell Woods, an eerie location within Atomfall where you will encounter an unsettling wicker man and a ringing telephone box that needs to be answered. But what were our influences behind Casterfell Woods? We thought it would be interesting to let you know how we came up with this unique aesthetic. From the outset, we knew that we wanted some spookier areas of the game, where we could emphasise folk horror and provide some contrast with our more idyllic areas. Most of our outdoor environments are very green, vibrant, pretty, and very much British. But for Casterfell, we wanted the player to question what things might happen in the deep dark woods. Hidden things can happen there, secret and ancient things… We knew that this would be a ton of fun – so started doing our homework. Our initial goal was to establish the visual baseline for our sandbox spaces, with a focus on the content that we needed to build out our various natural biomes. Then, we could start adding our thematic twists. Early in the project, the team took quite a few trips up to the English Lake District for reference gathering and to capture photogrammetry content. For several of the non-Brits on the team (myself included, as an American) this was incredibly exotic. For anyone who hasn’t been there, it is an extremely diverse area of outstanding natural beauty and diversity. It is just so wet and green, with lakes and streams everywhere, and tremendous stone formations topping the high fells and hilltops. The entire area is just dripping with greenery, ferns, and moss. As I was new to driving in the UK, I found those tiny Cumbrian roads terrifying! There are slate stone walls on one edge, and steep drops into a lake on the other. But the trips were very educational, and the views were sensational. By the end of the trip, we had a ton of fantastic reference, fabulous photogrammetry content, and were confident that we could ground the game visually in the north of Britain. Next up, were the twists. How could we make our world different from a typical holiday trip to a beautiful natural destination? How could we layer in an older era, and warp things a bit more? We started looking at storytelling focused on folk horror, sci-fi, and old-school British imaginative fiction for inspiration. Films like The Wicker Man, The Blair Witch Project, Annihilation, and Midsommar were great to look at. Then of course we have BBC programming like Doctor Who, The Prisoner, and The Quatermass Xperiment, as well as books by John Wyndham, who has so many wonderfully weird stories. We wanted the player to feel that they are stepping into an older era. The real Windscale nuclear accident was in 1957, which is when the quarantine began in our game. As we were intending to be a period piece, how could we impress that into a natural area? This was a tough one, and we had a lot of conversations about it. I mean, especially in the woods, where trees pretty much would have looked the same in 1957, 2024, or 1066. We began asking ourselves who was living out there, beyond the comforts of village life? How would they survive with no manufactured resources? The answer was pretty simple in that these outcasts would survive just as they had in archaic times. We would regress them even further back and have them use what was at hand. Wattle (and daub) construction became our go-to architectural style. Thatched roofs, woven branches and vines, and dry-stone structures also seemed to fit. Even though many of these traditional methods of construction can still be seen in the modern day, they are really ancient and foreign to many of us who grew up elsewhere. Then, taking into account our inspirational media reference, and our desire for more Britishness, we began layering even more symbolic imagery. Ancient markings, effigies, and wickermen, all intermingled with more traditional maypoles and bunting to give strong pagan religious overtones. We think you are going to love exploring Casterfell Woods and discovering the secrets that it holds when Atomfall is released on March 27 for Xbox Series X|S and Windows PC, and day one with Game Pass. We can’t wait for you guys to get your hands on the game. A survival-action game inspired by real-life events, Atomfall is set five years after the Windscale nuclear disaster in Northern England. Explore the fictional quarantine zone, scavenge, craft, barter, fight and talk your way through a British countryside setting filled with bizarre characters, mysticism, cults, and rogue government agencies. From Rebellion, the studio behind Sniper Elite and Zombie Army, Atomfall will challenge you to solve the dark mystery of what really happened. Player Driven Mystery: Unravel a tapestry of interwoven narratives through exploration, conversation, investigation, and combat, where every choice you make has consequences. Explore this Green and Unpleasant Land: The picturesque British countryside, with rolling green hills, lush valleys, and rural villages belie the dangers that await you. Search, Scavage, Survive: You’ll need to scavenge for supplies, craft weapons and items, and fight desperately to make it out alive! Desperate Combat: With weapons and ammunition scarce, each frenetic engagement will see you blend marksmanship with vicious hand-to-hand combat. Manage your heart rate to hold a steady aim and ensure you have the energy you need to reach for your cricket bat and land the killer blow. Green and Unpleasant Land: The picturesque British countryside, with rolling green hills, lush valleys, and rural villages belie the dangers that await you. Navigate cult-controlled ruins, natural caves, nuclear bunkers and more as you explore this dense, foreboding world. Reimagining Windscale: A fictional reimagining of a real-world event, Atomfall draws from science fiction, folk horror, and Cold War influences to create a world that is eerily familiar yet completely alien.",
  "image": "https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_02_Patrol_alternate-83641759262ea3d714c6.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eA few weeks ago, we released the latest trailer for \u003cem\u003eAtomfall\u003c/em\u003e, our upcoming game where you will have to uncover the mystery behind what happened at the UK’s Windscale nuclear power station in the 1950s. This is a fictionalised telling of what happened following this real-life nuclear disaster in Northern England.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe trailer showcases the game’s folk horror influences and give you the first glimpse of Casterfell Woods, an eerie location within \u003cem\u003eAtomfall\u003c/em\u003e where you will encounter an unsettling wicker man and a ringing telephone box that needs to be answered.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Atomfall Release Date Trailer\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/fz-9EF0iZ8c?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBut what were our influences behind Casterfell Woods? We thought it would be interesting to let you know how we came up with this unique aesthetic.\u003c/p\u003e\n\n\n\n\u003cp\u003eFrom the outset, we knew that we wanted some spookier areas of the game, where we could emphasise folk horror and provide some contrast with our more idyllic areas. Most of our outdoor environments are very green, vibrant, pretty, and very much British. But for Casterfell, we wanted the player to question what things might happen in the deep dark woods. Hidden things can happen there, secret and ancient things… We knew that this would be a ton of fun – so started doing our homework.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_05_Ruins-5ddb8ff4e962c2045d51.jpg\" alt=\"Atomfall Screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_05_Ruins-5ddb8ff4e962c2045d51.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_05_Ruins-5ddb8ff4e962c2045d51-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_05_Ruins-5ddb8ff4e962c2045d51-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_05_Ruins-5ddb8ff4e962c2045d51-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOur initial goal was to establish the visual baseline for our sandbox spaces, with a focus on the content that we needed to build out our various natural biomes. Then, we could start adding our thematic twists.\u003c/p\u003e\n\n\n\n\u003cp\u003eEarly in the project, the team took quite a few trips up to the English Lake District for reference gathering and to capture photogrammetry content. For several of the non-Brits on the team (myself included, as an American) this was incredibly exotic. For anyone who hasn’t been there, it is an extremely diverse area of outstanding natural beauty and diversity. It is just so wet and green, with lakes and streams everywhere, and tremendous stone formations topping the high fells and hilltops. The entire area is just dripping with greenery, ferns, and moss.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_04_Dolmen-10954009b7d6bfbdbf31.jpg\" alt=\"Atomfall Screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_04_Dolmen-10954009b7d6bfbdbf31.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_04_Dolmen-10954009b7d6bfbdbf31-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_04_Dolmen-10954009b7d6bfbdbf31-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_04_Dolmen-10954009b7d6bfbdbf31-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAs I was new to driving in the UK, I found those tiny Cumbrian roads terrifying! There are slate stone walls on one edge, and steep drops into a lake on the other. But the trips were very educational, and the views were sensational. By the end of the trip, we had a ton of fantastic reference, fabulous photogrammetry content, and were confident that we could ground the game visually in the north of Britain.\u003c/p\u003e\n\n\n\n\u003cp\u003eNext up, were the twists. How could we make our world different from a typical holiday trip to a beautiful natural destination? How could we layer in an older era, and warp things a bit more?\u003c/p\u003e\n\n\n\n\u003cp\u003eWe started looking at storytelling focused on folk horror, sci-fi, and old-school British imaginative fiction for inspiration. Films like The Wicker Man, The Blair Witch Project, Annihilation, and Midsommar were great to look at. Then of course we have BBC programming like Doctor Who, The Prisoner, and The Quatermass Xperiment, as well as books by John Wyndham, who has so many wonderfully weird stories.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_03_River-1720971591b7c98cfce7.jpg\" alt=\"Atomfall Screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_03_River-1720971591b7c98cfce7.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_03_River-1720971591b7c98cfce7-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_03_River-1720971591b7c98cfce7-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_03_River-1720971591b7c98cfce7-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWe wanted the player to feel that they are stepping into an older era. The real Windscale nuclear accident was in 1957, which is when the quarantine began in our game. As we were intending to be a period piece, how could we impress that into a natural area? This was a tough one, and we had a lot of conversations about it. I mean, especially in the woods, where trees pretty much would have looked the same in 1957, 2024, or 1066.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe began asking ourselves who was living out there, beyond the comforts of village life? How would they survive with no manufactured resources?\u003c/p\u003e\n\n\n\n\u003cp\u003eThe answer was pretty simple in that these outcasts would survive just as they had in archaic times. We would regress them even further back and have them use what was at hand. Wattle (and daub) construction became our go-to architectural style. Thatched roofs, woven branches and vines, and dry-stone structures also seemed to fit. Even though many of these traditional methods of construction can still be seen in the modern day, they are really ancient and foreign to many of us who grew up elsewhere.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_016_Collapse-d99ba49bd2fef159cc57.jpg\" alt=\"Atomfall Screenshot\" srcset=\"https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_016_Collapse-d99ba49bd2fef159cc57.jpg 1920w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_016_Collapse-d99ba49bd2fef159cc57-768x432.jpg 768w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_016_Collapse-d99ba49bd2fef159cc57-1024x576.jpg 1024w, https://xxboxnews.blob.core.windows.net/prod/sites/2/2024/12/Atomfall_Screenshot_Woodlands_016_Collapse-d99ba49bd2fef159cc57-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThen, taking into account our inspirational media reference, and our desire for more Britishness, we began layering even more symbolic imagery. Ancient markings, effigies, and wickermen, all intermingled with more traditional maypoles and bunting to give strong pagan religious overtones.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe think you are going to love exploring Casterfell Woods and discovering the secrets that it holds when \u003cem\u003eAtomfall\u003c/em\u003e is released on March 27 for Xbox Series X|S and Windows PC, and day one with Game Pass. We can’t wait for you guys to get your hands on the game.\u003c/p\u003e\n\n\n\n\u003cdiv data-product-id=\"9nc4wdl5kzbl\" id=\"msp1734360120435\"\u003e\n\t\t\t\u003cp\u003e\u003ca href=\"https://www.microsoft.com/en-us/store/apps/9nc4wdl5kzbl\" target=\"_blank\"\u003e\n\t\t\t\u003cimg decoding=\"async\" src=\"https://store-images.s-microsoft.com/image/apps.62123.13575061151050973.54eb5f88-6270-4667-89ec-f365ee6244b6.d5b1eb10-2b52-4f37-b0f7-393d2457ab23?w=400\u0026amp;h=600\" alt=\"Atomfall\"/\u003e\n\t\t\u003c/a\u003e\n\t\u003c/p\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003e\n\t\tA survival-action game inspired by real-life events, Atomfall is set five years after the Windscale nuclear disaster in Northern England.\nExplore the fictional quarantine zone, scavenge, craft, barter, fight and talk your way through a British countryside setting filled with bizarre characters, mysticism, cults, and rogue government agencies.\nFrom Rebellion, the studio behind Sniper Elite and Zombie Army, Atomfall will challenge you to solve the dark mystery of what really happened.\nPlayer Driven Mystery: Unravel a tapestry of interwoven narratives through exploration, conversation, investigation, and combat, where every choice you make has consequences.\nExplore this Green and Unpleasant Land: The picturesque British countryside, with rolling green hills, lush valleys, and rural villages belie the dangers that await you.\nSearch, Scavage, Survive: You’ll need to scavenge for supplies, craft weapons and items, and fight desperately to make it out alive!\n\nDesperate Combat: With weapons and ammunition scarce, each frenetic engagement will see you blend marksmanship with vicious hand-to-hand combat. Manage your heart rate to hold a steady aim and ensure you have the energy you need to reach for your cricket bat and land the killer blow.\n\nGreen and Unpleasant Land: The picturesque British countryside, with rolling green hills, lush valleys, and rural villages belie the dangers that await you. Navigate cult-controlled ruins, natural caves, nuclear bunkers and more as you explore this dense, foreboding world.\n\nReimagining Windscale: A fictional reimagining of a real-world event, Atomfall draws from science fiction, folk horror, and Cold War influences to create a world that is eerily familiar yet completely alien.\t\u003c/p\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\u003c/div\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-18T17:00:00Z",
  "modifiedTime": "2024-12-16T14:44:14Z"
}
