{
  "id": "cc69b547-9a52-495a-9ba2-14d188af6b44",
  "title": "The First Stop on the Way to Mordor… The Bank",
  "link": "https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/",
  "description": "Didn’t I have a post last week that I opened up with something about not declaring goals for my play time?  And yet, here I am declaring an ambitious goal.  Swept up as I have been with the excitement of the new LOTRO 64-bit servers and their promise of better game performance, I am setting […]",
  "author": "Wilhelm Arcturus",
  "published": "Thu, 13 Mar 2025 15:15:24 +0000",
  "source": "http://feeds.feedburner.com/TheAncientGamingNoob",
  "categories": [
    "entertainment",
    "Lord of the Rings Online",
    "Glamdring",
    "Glass of Aglaral",
    "Mordor Project",
    "Sara Oakheart",
    "Server Transfers",
    "Standing Stone Games"
  ],
  "byline": "by Wilhelm Arcturus",
  "length": 7087,
  "excerpt": "Didn’t I have a post last week that I opened up with something about not declaring goals for my play time? And yet, here I am declaring an ambitious goal. Swept up as I have been with the e…",
  "siteName": "The Ancient Gaming Noob",
  "favicon": "",
  "text": "Didn’t I have a post last week that I opened up with something about not declaring goals for my play time?  And yet, here I am declaring an ambitious goal.  Swept up as I have been with the excitement of the new LOTRO 64-bit servers and their promise of better game performance, I am setting my sights on Mordor. Mordor, we have an eye on you! My sweeping goal is to get to Mordor by the most expeditious route… which doesn’t involve a level boost.  I am not concerned with getting to level cap or getting beyond Mordor or playing house or crafting or dungeons or raids or monster play any of the myriad things one can get hooked up in with an MMORPG. I just want to get to Mordor.  Not beyond Mordor.  Not to Umbar or any content past that.  Mordor will do for me.  I mean, I’ve never made it past Mirkwood, so I’m trying not to overreach… even though I probably doing so. So I am going to tag this series of posts the “Mordor Project” and we’ll see how far I get.  It is quite possible I will get to the Lone Lands, get bored, and go play retail WoW or Valheim or something else.   I have already established myself as an unreliable narrator when it comes to planning out my gaming… hence the usual rule about goals.  And a year from now my month in review may very well say something about how quickly I gave up on this idea.  But for the moment I am determined. I have rolled up a few test characters on the Glamding 64-bit server to run though the early content and get a feel for the classes. So far I am leaning towards the hunter, though I have gotten my champion out of the starter area as well.  I fiddled with the mariner a bit and decided I didn’t like the whole “don’t rock the boat” balance thing and let that go for now. I also ran into my first “completely new since I last played” feature, the landscape difficulty scaling.  When I found the NPC with my hunter, I decided to up the difficulty to two.  Hunters are a bit squishy and I had no feel at all for how difficult the scaling was. We’re going to set this to 2 So far that seems to be okay for him.  But when the champion got to the NPC I dialed things up to difficulty 4, thinking heavy armor and such would make him tougher, and he died three times on one quest.  Well, he didn’t “die.” Only NPCs die in LOTRO.  Player characters are immortal, like capsuleers… hey, I somehow equated LOTRO with EVE Online. Anyway, he was defeated and won’t get the titles for avoiding that past level 5.  I might need to dial that back as I read, later on, that anything with the “Eye of Sauron” effect is pretty much the suck. Also, look at that spiffy character portrait frame I have.  That is the 17 year “Why are you still here, don’t you have a home or something?” frame. My selection of frames And the mention of frames brings up the amount of baggage I come with when I roll up a new character.  And I am not even talking about emotional baggage around my past with the game.  I mean in-game baggage, as in my bags are full of stuff. Things I have after picking up the first weapons in the tutorial The is basically four of my six bags filled and I haven’t done anything yet.  There is everything in there from my 2007 Special Edition bonus Glass of Aglaral… Glass of Aglaral – 2007 Stats …all the way through to the 17th anniversary gift box, which has the green dragon firework launcher in it. I have learned the hard way not to start opening all that stuff right away as it will expand to fill all my bag slots and then some. We do get a break pretty early on with a little quest that unlocks riding… though it tells you that you need to go buy it from the LOTRO store, but then it doesn’t seem to actually require that.  Either way, I was able to clear some bag space by claiming the mount tokens in my bag once I had the riding skill. I was also able to equip a few items once I went through what I had, including this bad boy. Give me the stone Derudh’s Stone… that is what I has gots in my pocketses.  The stone goes back to the Rise of Isengard expansion in 2011.  Since my goal is to progress, I equipped that right away. But mostly I had to keep pressing on until I could get to a bank, which is a bit of a chore because I chose the race of men, or man, or whatever for my characters because my recollection is that it is the easiest early game to blast through and get to Bree from.  But you also don’t get a town with a bank until Bree… though, again, in balance Bree is right there once you get out of Archet. So I got there and was able to unload my bags and fill up my bank. Bank shortly after arrival At some point I will paw through all of those gift boxes… they go back to year one and have a number of side presents to boot. Once clear of all that, I was off in fixed determination to not get distracted.  I was going to level.  I was not going to anything… oh wait, I have a side quest to go to the Combe crafting hall. Me, crafting already Dammit.  I went mostly harvesting and it does gain my xp.  Leave me alone, I can’t help myself sometimes. Bags cleared, I was able to progress along the prologue epic story line, though I did forget about the one aspect of starting around Bree… the Sara Oakheart escort quest. Oh no, not this again… Once more I followed the slowest escort quest NPC in creation around the lair of the Blackwolds to fetch her precious stick… which is annoying the first time you do it, but all the more so when you know how she is going to show up later. Yeah, I know how this turns out lady… So far, so good. The new servers themselves seem to be doing okay.  A lot of players have jumped on board with the promise of better performance, which is no doubt making for new and interesting performance issues.  Aside from a couple of peak, weekend prime time moments where I had a quest that wouldn’t progress… that Galadriel dream quest in the Archet intro, which stalled comically multiple times, once just leaving Galadriel and I awkwardly facing each other, nobody saying anything… performance has been mostly okay.  I suspect that it will get better once transfers get somewhat settled. Though on the transfer front things are still slow.  I managed to get in late on Sunday night and had the process find my characters on Landroval, which I selected to move.  I got the message about it being in progress, saying I would get an email when completed and… it is now Thursday and I’ve heard nothing. There are supposed to be thousands of characters in the queue and, given how often they were turning off the transfer option last week, I have no idea when those four characters might show up or if they will show up.  Yesterday over at Massively OP they reported that SSG was still working on transfers from Saturday. Well, I’m only starting out on this project and I could be distracted by something shiny tomorrow or the next day.  It is, for the moment, nice to be back into the game world of LOTRO and its vision of Tolkien’s works. Out in the woods… wait, what? I think somebody was trying to sneak a Minecraft tree in on me there.  But the world mostly looks good still.",
  "image": "https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003cp\u003eDidn’t I have a post last week that I opened up with something about not declaring goals for my play time?  And yet, here I am declaring an ambitious goal.  Swept up as I have been with the excitement of the new \u003cem\u003eLOTRO\u003c/em\u003e 64-bit servers and their promise of better game performance, I am setting my sights on Mordor.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_59293\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-59293\" data-attachment-id=\"59293\" data-permalink=\"https://tagn.wordpress.com/2017/07/13/were-on-the-road-to-mordor/lotromordor/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg\" data-orig-size=\"600,226\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"LOTROMordor\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Mordor, we have an eye on you!\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg?w=600\" src=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg\" alt=\"\" width=\"600\" height=\"226\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg 600w, https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg?w=150\u0026amp;h=57 150w, https://tagn.wordpress.com/wp-content/uploads/2017/07/lotromordor.jpg?w=500\u0026amp;h=188 500w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-59293\"\u003eMordor, we have an eye on you!\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eMy sweeping goal is to get to Mordor by the most expeditious route… which doesn’t involve a level boost.  I am not concerned with getting to level cap or getting beyond Mordor or playing house or crafting or dungeons or raids or monster play any of the myriad things one can get hooked up in with an MMORPG.\u003c/p\u003e\n\u003cp\u003eI just want to get to Mordor.  Not beyond Mordor.  Not to Umbar or any content past that.  Mordor will do for me.  I mean, I’ve never made it past Mirkwood, so I’m trying not to overreach… even though I probably doing so.\u003c/p\u003e\n\u003cp\u003eSo I am going to tag this series of posts the “Mordor Project” and we’ll see how far I get.  It is quite possible I will get to the Lone Lands, get bored, and go play retail \u003cem\u003eWoW\u003c/em\u003e or \u003cem\u003eValheim\u003c/em\u003e or something else.   I have already established myself as an unreliable narrator when it comes to planning out my gaming… hence the usual rule about goals.  And a year from now my month in review may very well say something about how quickly I gave up on this idea.  But for the moment I am determined.\u003c/p\u003e\n\u003cp\u003eI have rolled up a few test characters on the Glamding 64-bit server to run though the early content and get a feel for the classes.\u003c/p\u003e\n\u003cp\u003eSo far I am leaning towards the hunter, though I have gotten my champion out of the starter area as well.  I fiddled with the mariner a bit and decided I didn’t like the whole “don’t rock the boat” balance thing and let that go for now.\u003c/p\u003e\n\u003cp\u003eI also ran into my first “completely new since I last played” feature, the \u003ca href=\"https://lotro-wiki.com/wiki/Landscape_Difficulty\"\u003elandscape difficulty scaling\u003c/a\u003e.  When I found the NPC with my hunter, I decided to up the difficulty to two.  Hunters are a bit squishy and I had no feel at all for how difficult the scaling was.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133174\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133174\" data-attachment-id=\"133174\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_daring2/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg\" data-orig-size=\"410,298\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_Daring2\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;We’re going to set this to 2\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg?w=410\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg?w=410\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg\" alt=\"\" width=\"410\" height=\"298\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg 410w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_daring2.jpg?w=150\u0026amp;h=109 150w\" sizes=\"(max-width: 410px) 100vw, 410px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133174\"\u003eWe’re going to set this to 2\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eSo far that seems to be okay for him.  But when the champion got to the NPC I dialed things up to difficulty 4, thinking heavy armor and such would make him tougher, and he died three times on one quest.  Well, he didn’t “die.” Only NPCs die in \u003cem\u003eLOTRO\u003c/em\u003e.  Player characters are immortal, like capsuleers… hey, I somehow equated \u003cem\u003eLOTRO\u003c/em\u003e with \u003cem\u003eEVE Online\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eAnyway, he was defeated and won’t get the titles for avoiding that past level 5.  I might need to dial that back as I read, later on, that anything with the “Eye of Sauron” effect is pretty much the suck.\u003c/p\u003e\n\u003cp\u003eAlso, look at that spiffy character portrait frame I have.  That is the 17 year “Why are you still here, don’t you have a home or something?” frame.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133171\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133171\" data-attachment-id=\"133171\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_portframes/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg\" data-orig-size=\"453,277\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_PortFrames\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;My selection of frames\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg?w=453\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg?w=453\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg\" alt=\"\" width=\"453\" height=\"277\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg 453w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_portframes.jpg?w=150\u0026amp;h=92 150w\" sizes=\"(max-width: 453px) 100vw, 453px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133171\"\u003eMy selection of frames\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eAnd the mention of frames brings up the amount of baggage I come with when I roll up a new character.  And I am not even talking about emotional baggage around my past with the game.  I mean in-game baggage, as in my bags are full of stuff.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133176\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133176\" data-attachment-id=\"133176\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_bagsfull/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg\" data-orig-size=\"455,528\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_BagsFull\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Things I have after picking up the first weapons in the tutorial\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg?w=345\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg?w=388\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg?w=388\" alt=\"\" width=\"388\" height=\"450\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg?w=388 388w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg?w=129 129w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bagsfull.jpg 455w\" sizes=\"(max-width: 388px) 100vw, 388px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133176\"\u003eThings I have after picking up the first weapons in the tutorial\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eThe is basically four of my six bags filled and I haven’t done anything yet.  There is everything in there from my \u003ca href=\"https://tagn.wordpress.com/2007/05/04/the-glass-of-aglaral/\"\u003e2007 Special Edition bonus Glass of Aglaral\u003c/a\u003e…\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_523\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png\"\u003e\u003cimg aria-describedby=\"caption-attachment-523\" data-attachment-id=\"523\" data-permalink=\"https://tagn.wordpress.com/2007/05/04/the-glass-of-aglaral/glassofaglaralpng/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png\" data-orig-size=\"228,179\" data-comments-opened=\"1\" data-image-meta=\"[]\" data-image-title=\"glassofaglaral.png\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;The much maligned Glass of Aglaral – Original Stats\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png?w=228\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png?w=228\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png\" alt=\"\" width=\"228\" height=\"179\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png 228w, https://tagn.wordpress.com/wp-content/uploads/2007/05/glassofaglaral.png?w=150\u0026amp;h=118 150w\" sizes=\"(max-width: 228px) 100vw, 228px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-523\"\u003eGlass of Aglaral – 2007 Stats\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e…all the way through to the 17th anniversary gift box, which has the green dragon firework launcher in it.\u003c/p\u003e\n\u003cp\u003eI have learned the hard way not to start opening all that stuff right away as it will expand to fill all my bag slots and then some.\u003c/p\u003e\n\u003cp\u003eWe do get a break pretty early on with a little quest that unlocks riding… though it tells you that you need to go buy it from the LOTRO store, but then it doesn’t seem to actually require that.  Either way, I was able to clear some bag space by claiming the mount tokens in my bag once I had the riding skill.\u003c/p\u003e\n\u003cp\u003eI was also able to equip a few items once I went through what I had, including this bad boy.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133173\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133173\" data-attachment-id=\"133173\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_xpstone/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg\" data-orig-size=\"207,252\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_XPStone\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Give me the stone\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg?w=207\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg?w=207\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg\" alt=\"\" width=\"207\" height=\"252\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg 207w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_xpstone.jpg?w=123\u0026amp;h=150 123w\" sizes=\"(max-width: 207px) 100vw, 207px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133173\"\u003eGive me the stone\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://lotro-wiki.com/wiki/Item:Derudh%27s_Stone\"\u003eDerudh’s Stone\u003c/a\u003e… that is what I has gots in my pocketses.  The stone goes back to the \u003cem\u003eRise of Isengard\u003c/em\u003e expansion in 2011.  Since my goal is to progress, I equipped that right away.\u003c/p\u003e\n\u003cp\u003eBut mostly I had to keep pressing on until I could get to a bank, which is a bit of a chore because I chose the race of men, or man, or whatever for my characters because my recollection is that it is the easiest early game to blast through and get to Bree from.  But you also don’t get a town with a bank until Bree… though, again, in balance Bree is right there once you get out of Archet.\u003c/p\u003e\n\u003cp\u003eSo I got there and was able to unload my bags and fill up my bank.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133178\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133178\" data-attachment-id=\"133178\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_bankfull/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg\" data-orig-size=\"404,451\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_BankFull\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Bank shortly after arrival\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg?w=358\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg?w=403\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg?w=403\" alt=\"\" width=\"403\" height=\"450\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg?w=403 403w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg?w=134 134w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_bankfull.jpg 404w\" sizes=\"(max-width: 403px) 100vw, 403px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133178\"\u003eBank shortly after arrival\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eAt some point I will paw through all of those gift boxes… they go back to year one and have a number of side presents to boot.\u003c/p\u003e\n\u003cp\u003eOnce clear of all that, I was off in fixed determination to not get distracted.  I was going to level.  I was not going to anything… oh wait, I have a side quest to go to the Combe crafting hall.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133179\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133179\" data-attachment-id=\"133179\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_workbench/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg\" data-orig-size=\"1246,702\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_Workbench\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Me, crafting already\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=600\" alt=\"\" width=\"600\" height=\"338\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_workbench.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133179\"\u003eMe, crafting already\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eDammit.  I went mostly harvesting and it does gain my xp.  Leave me alone, I can’t help myself sometimes.\u003c/p\u003e\n\u003cp\u003eBags cleared, I was able to progress along the prologue epic story line, though I did forget about the one aspect of starting around Bree… the Sara Oakheart escort quest.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133180\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133180\" data-attachment-id=\"133180\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_sara/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg\" data-orig-size=\"1092,591\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_Sara\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Oh no, not this again…\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=600\" alt=\"\" width=\"600\" height=\"325\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg?w=768 768w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_sara.jpg 1092w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133180\"\u003eOh no, not this again…\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eOnce more I followed the slowest escort quest NPC in creation around the lair of the Blackwolds to fetch her precious stick… which is annoying the first time you do it, but all the more so when you know how she is going to show up later.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133172\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133172\" data-attachment-id=\"133172\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_servicesara/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg\" data-orig-size=\"1647,831\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_ServiceSara\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Yeah, I know how this turns out lady…\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=600\" alt=\"\" width=\"600\" height=\"303\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_servicesara.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133172\"\u003eYeah, I know how this turns out lady…\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eSo far, so good.\u003c/p\u003e\n\u003cp\u003eThe new servers themselves seem to be doing okay.  A lot of players have jumped on board with the promise of better performance, which is no doubt making for new and interesting performance issues.  Aside from a couple of peak, weekend prime time moments where I had a quest that wouldn’t progress… that Galadriel dream quest in the Archet intro, which stalled comically multiple times, once just leaving Galadriel and I awkwardly facing each other, nobody saying anything… performance has been mostly okay.  I suspect that it will get better once transfers get somewhat settled.\u003c/p\u003e\n\u003cp\u003eThough on the transfer front things are still slow.  I managed to get in late on Sunday night and had the process find my characters on Landroval, which I selected to move.  I got the message about it being in progress, saying I would get an email when completed and… it is now Thursday and I’ve heard nothing.\u003c/p\u003e\n\u003cp\u003eThere are supposed to be thousands of characters in the queue and, given how often they were turning off the transfer option last week, I have no idea when those four characters might show up or if they will show up.  Yesterday \u003ca href=\"https://massivelyop.com/2025/03/12/lord-of-the-rings-online-speeds-up-64-bit-server-transfer-rate-but-sees-more-failures-in-the-process/\"\u003eover at Massively OP they reported\u003c/a\u003e that SSG was still working on transfers from Saturday.\u003c/p\u003e\n\u003cp\u003eWell, I’m only starting out on this project and I could be distracted by something shiny tomorrow or the next day.  It is, for the moment, nice to be back into the game world of LOTRO and its vision of Tolkien’s works.\u003c/p\u003e\n\u003cdiv data-shortcode=\"caption\" id=\"attachment_133175\"\u003e\u003cp\u003e\u003ca href=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg\"\u003e\u003cimg aria-describedby=\"caption-attachment-133175\" data-attachment-id=\"133175\" data-permalink=\"https://tagn.wordpress.com/2025/03/13/the-first-stop-on-the-way-to-mordor-the-bank/mp01_pixeltree/\" data-orig-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg\" data-orig-size=\"2020,1093\" data-comments-opened=\"1\" data-image-meta=\"{\u0026#34;aperture\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;credit\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;camera\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;caption\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;created_timestamp\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;copyright\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;focal_length\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;iso\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;shutter_speed\u0026#34;:\u0026#34;0\u0026#34;,\u0026#34;title\u0026#34;:\u0026#34;\u0026#34;,\u0026#34;orientation\u0026#34;:\u0026#34;0\u0026#34;}\" data-image-title=\"MP01_PixelTree\" data-image-description=\"\" data-image-caption=\"\u0026lt;p\u0026gt;Out in the woods… wait, what?\u0026lt;/p\u0026gt;\n\" data-medium-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=500\" data-large-file=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=600\" loading=\"lazy\" src=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=600\" alt=\"\" width=\"600\" height=\"325\" srcset=\"https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=600 600w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=1200 1200w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=150 150w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=500 500w, https://tagn.wordpress.com/wp-content/uploads/2025/03/mp01_pixeltree.jpg?w=768 768w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"caption-attachment-133175\"\u003eOut in the woods… wait, what?\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eI think somebody was trying to sneak a \u003cem\u003eMinecraft\u003c/em\u003e tree in on me there.  But the world mostly looks good still.\u003c/p\u003e\n\n\t\t\t\n\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-13T15:15:24Z",
  "modifiedTime": "2025-03-12T20:46:01Z"
}
