{
  "id": "d38e1ec9-35ff-4e49-afda-da88466d1071",
  "title": "As layoffs continue to scar the video game industry, Indiana Jones and the Great Circle proves the value of keeping dev teams together for decades",
  "link": "https://www.eurogamer.net/as-layoffs-continue-to-scar-the-video-game-industry-indiana-jones-and-the-great-circle-proves-the-value-of-keeping-dev-teams-together-for-decades",
  "description": "If MachineGames is to be believed, the basement level of the Vatican is exempt from the strict Catholic doctrine that dominates the jurisdiction of the Holy See above ground. It's down there that you'll find the temples dedicated to faiths that sort of resemble Christianity if you squint a bit and turn your head on your side. And the underground boxing ring set up by Mussolini's plundering soldiers, who'll only let you in if you're wearing one of their infamous black shirts. Read more",
  "author": "Jeremy Peel",
  "published": "Fri, 18 Apr 2025 12:00:00 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Xbox",
    "The Chronicles of Riddick: Escape from Butcher Bay",
    "Tigon Studios",
    "Puzzle",
    "Xbox Series X/S",
    "Exploration",
    "Narrative / Story Driven",
    "Third person",
    "First person",
    "Wolfenstein II: The New Colossus",
    "Vivendi Games",
    "Story Rich",
    "Action Adventure",
    "Starbreeze Studios",
    "Indiana Jones and the Great Circle",
    "Bethesda Softworks",
    "PC",
    "Stealth",
    "Single Player",
    "Shooter",
    "MachineGames"
  ],
  "byline": "Jeremy Peel",
  "length": 6783,
  "excerpt": "Games benefit greatly from a development team that has worked together for years, and Indiana Jones and the Great Circle shows that.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/0fae539e041370a0aa4a1d85aad12508/icon/apple-touch-icon-152x152.png",
  "text": "Ancient institutional knowledge is what enables the greatest games ever made. Image credit: Bethesda If MachineGames is to be believed, the basement level of the Vatican is exempt from the strict Catholic doctrine that dominates the jurisdiction of the Holy See above ground. It's down there that you'll find the temples dedicated to faiths that sort of resemble Christianity if you squint a bit and turn your head on your side. And the underground boxing ring set up by Mussolini's plundering soldiers, who'll only let you in if you're wearing one of their infamous black shirts. The latter is an early test of your ability to get to grips with Indiana Jones and the Great Circle's fistfighting system. It's faster than you expect it's going to be, is the thing: both Indy's blows and those in response flying like boulders at terminal velocity. Dodging will get you so far, but don't expect your opponent to keep their arms at their sides while you're pummelling them in the face. To find an advantage, you'll need to block and parry, using both hands rather than sticking to the right trigger, and grabbing hold of your target when they stumble - either to get more hits in, or shove them toward the baying crowd. Baying being the key term. The core Indiana Jones development team first made a name for themselves back in 2004 with The Chronicles of Riddick: Escape from Butcher Bay. That was a kind of first-person prison drama, about ingratiating yourself with fellow cons, instigating riots and stealing keycards, all in an effort to break yourself out of a triple-max security facility on a barren planet. Guns were a rarity - most of them registered to the DNA of the guard holding them, and so useless to you - and Butcher Bay was celebrated as perhaps the only successful example of hand-to-hand combat in an FPS at the time. In fact, FPS felt like a reductive term for this bold mixture of pugilism, stealth, adventure and conversation. The Chronicles of Riddick: Replayed on Retro 2005 PC - Athlon X2 3800+/GeForce 6800GT Watch on YouTube The Riddick team went on to make The Darkness, to similar acclaim, and most of its key names either founded MachineGames or joined it later. Their entries in the Wolfenstein canon are notable not only for dual-wielding shootouts, but for the deep characterisation of BJ Blazkowicz and his found family at the Kreisau Circle, as well as the memorable non-combat sequences that brought the player within intimate proximity of detestable villains like Deathshead and Frau Engel. MachineGames perfected a knack for blending b-movie absurdity with real storytelling chops, growing braver with each new project over a decade and a half. Which brings us to Indiana Jones, MachineGames' opus. A game every bit as varied as Butcher Bay, if not more so; which boasts gunplay and action as slick as Wolfenstein's, but doesn't rely on it; that couldn't possibly have been made without the shared trust and creative shorthand that exists between a team who know each other as well as they know themselves. The punch-ups under the Vatican are a microcosmic demonstration of that team's journey: their long commitment to immersive first-person adventure, and the extraordinary ways in which their creative talent has amplified over time. The ideas that once fuelled Butcher Bay are transformed by a level of fidelity and polish that produces thudding impacts, grimacing faces and flying helmets. The sounds of skirmish are cleverly sequenced, signalling subtly to the player whether or not their blows are connecting. This is a Michelin Star standard of pretend punching, enabled by a team which has stayed together and worked wonders as a result. Look at the top-rated games of the last few years, and you'll notice that many of them also benefitted from this kind of rolling snowball of experience. Baldur's Gate 3 couldn't have redefined the western RPG had Larian not been layering its systems over the triumphs of the Divinity: Original Sin games. And Original Sin would never have happened were it not for the stubbornness of Larian boss Swen Vincke and his Belgian veterans. They've been riding out the ups and downs of their genre since before the millennium, and are only now seeing the fruits of that devotion. Would Baldur's Gate 3 have even been possible from a new stuido? | Image credit: Larian But the act of keeping teams together, which has always been a challenge in the volatile tech space, has become almost impossible in today's games industry. Since the soaring player numbers that followed the pandemic, game makers have endured a painful contraction. A common developer mantra of \"survive til '25\" now looks grimly quaint and naive, as a dry period of investment in video games continues unabated. Thousands of accomplished projects fight for player attention every year, and it's exceedingly common for studios to close after, or even before, the release of their debut games. The margin for error has become invisible to the naked eye, leaving even seasoned teams with little chance to course correct. It's a landscape in which the likes of Arkane Austin can be shut down after a single disappointing game, Redfall, seemingly mangled by a publisher push for multiplayer. The hivemind that produced Prey and Dishonored has been disassembled forever. The impact of that instability hasn't necessarily hit us as players yet. We're currently in the enviable position of cherry-picking from an unprecedented stream of five-star releases. Over time though, if publishers don't start to value institutional knowledge over short-term boosts to their share price, I suspect that top tier of releases - the Indiana Joneses, the Baldur's Gate 3s - will cease to occur. More developers will waste their time establishing new studios, filling out forms, designing logos, and repeating the mistakes of the dead studios before them. Newcomers to the industry won't benefit from the teaching of practiced programming or art or level design teams - because those teams will have been scattered to the winds. Building the kind of momentum that MachineGames has? That will become an impossibility. When Obsidian recently said that it plans to reach its 100th birthday as a studio by staying lean and making sensible bets, the plan sounded strange and radical. But it shouldn't. This is the way we get the greatest games ever made: by supporting studios and publishers who reject zero-sum projects; who do everything in their power to keep their creative staff together and look after one another. The best possible outcome, for developers and players alike, would be a Great Circle of 100-year-old game studios that spans the globe.",
  "image": "https://assetsio.gnwcdn.com/Indy-pops-his-head-over-a-ledge-to-see-a-scorpian-in-Indiana-Jones-and-the-Great-Circle.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eAncient institutional knowledge is what enables the greatest games ever made.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Indy-pops-his-head-over-a-ledge-to-see-a-scorpian-in-Indiana-Jones-and-the-Great-Circle.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Indy-pops-his-head-over-a-ledge-to-see-a-scorpian-in-Indiana-Jones-and-the-Great-Circle.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Indy-pops-his-head-over-a-ledge-to-see-a-scorpian-in-Indiana-Jones-and-the-Great-Circle.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Indy-pops-his-head-over-a-ledge-to-see-a-scorpian-in-Indiana-Jones-and-the-Great-Circle.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Indy pops his head over a ledge to see a scorpion in Indiana Jones and the Great Circle\" width=\"414\" height=\"233\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eBethesda\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003eIf MachineGames is to be believed, the basement level of the Vatican is exempt from the strict Catholic doctrine that dominates the jurisdiction of the Holy See above ground. It\u0026#39;s down there that you\u0026#39;ll find the temples dedicated to faiths that sort of resemble Christianity if you squint a bit and turn your head on your side. And the underground boxing ring set up by Mussolini\u0026#39;s plundering soldiers, who\u0026#39;ll only let you in if you\u0026#39;re wearing one of their infamous black shirts.\u003c/p\u003e\n\u003cp\u003eThe latter is an early test of your ability to get to grips with \u003ca data-keyword=\"true\" href=\"https://eurogamer.net/indiana-jones-and-the-great-circle-review\"\u003eIndiana Jones and the Great Circle\u003c/a\u003e\u0026#39;s fistfighting system. It\u0026#39;s faster than you expect it\u0026#39;s going to be, is the thing: both Indy\u0026#39;s blows and those in response flying like boulders at terminal velocity. Dodging will get you so far, but don\u0026#39;t expect your opponent to keep their arms at their sides while you\u0026#39;re pummelling them in the face. To find an advantage, you\u0026#39;ll need to block and parry, using both hands rather than sticking to the right trigger, and grabbing hold of your target when they stumble - either to get more hits in, or shove them toward the baying crowd.\u003c/p\u003e\n\u003cp\u003eBaying being the key term. The core Indiana Jones development team first made a name for themselves back in 2004 with \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/chronicles-riddick-escape-from-butcher-bay\"\u003eThe Chronicles of Riddick: Escape from Butcher Bay\u003c/a\u003e. That was a kind of first-person prison drama, about ingratiating yourself with fellow cons, instigating riots and stealing keycards, all in an effort to break yourself out of a triple-max security facility on a barren planet. Guns were a rarity - most of them registered to the DNA of the guard holding them, and so useless to you - and Butcher Bay was celebrated as perhaps the only successful example of hand-to-hand combat in an FPS at the time. In fact, FPS felt like a reductive term for this bold mixture of pugilism, stealth, adventure and conversation.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"The Chronicles of Riddick: Replayed on Retro 2005 PC - Athlon X2 3800+/GeForce 6800GT\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/hfqkEH0weTw?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/hfqkEH0weTw/hqdefault.jpg\"/\u003e\u003cspan\u003eThe Chronicles of Riddick: Replayed on Retro 2005 PC - Athlon X2 3800+/GeForce 6800GT\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/hfqkEH0weTw?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/hfqkEH0weTw?autoplay=1\" title=\"The Chronicles of Riddick: Replayed on Retro 2005 PC - Athlon X2 3800+/GeForce 6800GT\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003ca href=\"https://www.youtube.com/watch?v=hfqkEH0weTw\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003eThe Riddick team went on to make The Darkness, to similar acclaim, and most of its key names either founded MachineGames or joined it later. Their entries in the Wolfenstein canon are notable not only for dual-wielding shootouts, but for the deep characterisation of BJ Blazkowicz and his found family at the Kreisau Circle, as well as the memorable non-combat sequences that brought the player within intimate proximity of detestable villains like Deathshead and Frau Engel. MachineGames perfected a knack for blending b-movie absurdity with real storytelling chops, growing braver with each new project over a decade and a half.\u003c/p\u003e\n\u003cp\u003eWhich brings us to Indiana Jones, MachineGames\u0026#39; opus. A game every bit as varied as Butcher Bay, if not more so; which boasts gunplay and action as slick as Wolfenstein\u0026#39;s, but doesn\u0026#39;t rely on it; that couldn\u0026#39;t possibly have been made without the shared trust and creative shorthand that exists between a team who know each other as well as they know themselves.\u003c/p\u003e\n\u003cp\u003eThe punch-ups under the Vatican are a microcosmic demonstration of that team\u0026#39;s journey: their long commitment to immersive first-person adventure, and the extraordinary ways in which their creative talent has amplified over time. The ideas that once fuelled Butcher Bay are transformed by a level of fidelity and polish that produces thudding impacts, grimacing faces and flying helmets. The sounds of skirmish are cleverly sequenced, signalling subtly to the player whether or not their blows are connecting. This is a Michelin Star standard of pretend punching, enabled by a team which has stayed together and worked wonders as a result.\u003c/p\u003e\n\u003cp\u003eLook at the top-rated games of the last few years, and you\u0026#39;ll notice that many of them also benefitted from this kind of rolling snowball of experience. \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/baldurs-gate-3-a-critical-success-with-critical-failures\"\u003eBaldur\u0026#39;s Gate 3\u003c/a\u003e couldn\u0026#39;t have redefined the western RPG had Larian not been layering its systems over the triumphs of the \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/divinity-original-sin\"\u003eDivinity: Original Sin\u003c/a\u003e games. And Original Sin would never have happened were it not for the stubbornness of Larian boss Swen Vincke and his Belgian veterans. They\u0026#39;ve been riding out the ups and downs of their genre since before the millennium, and are only now seeing the fruits of that devotion.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Withers-in-Baldur\u0026#39;s-Gate-3.jpg?width=1200\u0026amp;height=1200\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Withers in Baldur\u0026#39;s Gate 3\" height=\"233\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Withers-in-Baldur\u0026#39;s-Gate-3.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Withers-in-Baldur\u0026#39;s-Gate-3.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Withers-in-Baldur\u0026#39;s-Gate-3.jpg?width=414\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"414\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eWould Baldur\u0026#39;s Gate 3 have even been possible from a new stuido? | \u003cspan\u003eImage credit: \u003ccite\u003eLarian\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eBut the act of keeping teams together, which has always been a challenge in the volatile tech space, has become almost impossible in today\u0026#39;s games industry. Since the soaring player numbers that followed the pandemic, game makers have endured a painful contraction. A common developer mantra of \u0026#34;survive til \u0026#39;25\u0026#34; now looks grimly quaint and naive, as a dry period of investment in video games continues unabated. Thousands of accomplished projects fight for player attention every year, and it\u0026#39;s exceedingly common for studios to close after, or even before, the release of their debut games.\u003c/p\u003e\n\u003cp\u003eThe margin for error has become invisible to the naked eye, leaving even seasoned teams with little chance to course correct. It\u0026#39;s a landscape in which the likes of Arkane Austin can be shut down after a single disappointing game, \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/redfall\"\u003eRedfall\u003c/a\u003e, seemingly mangled by a publisher push for multiplayer. The hivemind that produced Prey and Dishonored has been disassembled forever.\u003c/p\u003e\n\u003cp\u003eThe impact of that instability hasn\u0026#39;t necessarily hit us as players yet. We\u0026#39;re currently in the enviable position of cherry-picking from an unprecedented stream of five-star releases. Over time though, if publishers don\u0026#39;t start to value institutional knowledge over short-term boosts to their share price, I suspect that top tier of releases - the Indiana Joneses, the Baldur\u0026#39;s Gate 3s - will cease to occur. More developers will waste their time establishing new studios, filling out forms, designing logos, and repeating the mistakes of the dead studios before them. Newcomers to the industry won\u0026#39;t benefit from the teaching of practiced programming or art or level design teams - because those teams will have been scattered to the winds. Building the kind of momentum that MachineGames has? That will become an impossibility.\u003c/p\u003e\n\u003cp\u003eWhen Obsidian recently said that it plans to reach its \u003ca href=\"https://www.eurogamer.net/avowed-studio-plans-to-make-its-100th-birthday-by-staying-lean-and-invested\"\u003e100th birthday as a studio\u003c/a\u003e by staying lean and making sensible bets, the plan sounded strange and radical. But it shouldn\u0026#39;t. This is the way we get the greatest games ever made: by supporting studios and publishers who reject zero-sum projects; who do everything in their power to keep their creative staff together and look after one another. The best possible outcome, for developers and players alike, would be a Great Circle of 100-year-old game studios that spans the globe.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-04-18T12:00:00Z",
  "modifiedTime": null
}
