{
  "id": "d472f236-2ec1-4419-9a8b-2128f3340e41",
  "title": "Sons Of The Forest now lets you build rafts - and don't worry, Kelvin is better at swimming now, too",
  "link": "https://www.rockpapershotgun.com/sons-of-the-forest-now-lets-you-build-rafts-and-dont-worry-kelvin-is-better-at-swimming-now-too",
  "description": "Sons Of The Forest is about being chased by fithy cannibals who cannot swim, so the latest update ought to be useful to players. Its major new feature is the addition of rafts, which players can construct and then float about on like a 2000s Tom Hanks. Read more",
  "author": "Graham Smith",
  "published": "Sat, 18 Jan 2025 23:06:52 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Sons of the Forest",
    "Simulation",
    "Indie",
    "Endnight Games",
    "Single Player",
    "First person",
    "PC",
    "Multiplayer Cooperative",
    "Action Adventure"
  ],
  "byline": "Graham Smith",
  "length": 1389,
  "excerpt": "Sons Of The Forest got a major post-release update this week that adds rafts, defensive walls, and a lot of fixes.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/78813ef66c4d48aed643ad8c3a57062a/icon/apple-touch-icon.png",
  "text": "Image credit: Rock Paper Shotgun/Endnight Games Sons Of The Forest is about being chased by fithy cannibals who cannot swim, so the latest update ought to be useful to players. Its major new feature is the addition of rafts, which players can construct and then float about on like a 2000s Tom Hanks. Rafts come in three flavours ranging from small, slightly less small, to a full on houseboat with walls and ceilings. All three can be tied to the shore with a new mooring structure, and otherwise paddled about the lakes and waterways of the island. There are some other neat new features, too. Players can now draw plans for defensive walls around their base and leave Kelvin to do the hardwork of constructing them. Kelvin also now has a faster swim animation and both he and Virginia are able to pull themselves out of water at its edge, both of which seem useful when they inevitably fall off your raft. If you make the mistake of ever coming back to land, there are apparently impprovements to aiming with the crossbow, compound bow, crafted bow, shotgun and slingshot, all of which you'll see while scrabbling to survive against the cannibals. The full patch notes are available over on Steam. We already liked the game plenty when it hit 1.0 early last year, as Matt Cox (RPS in peace) explained in his Sons Of The Forest review.",
  "image": "https://assetsio.gnwcdn.com/Sons-of-the-Forest-1.0-Kelvin.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Sons-of-the-Forest-1.0-Kelvin.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Sons-of-the-Forest-1.0-Kelvin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Sons-of-the-Forest-1.0-Kelvin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Sons-of-the-Forest-1.0-Kelvin.png?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Giving Kelvin instructions in Sons of the Forest 1.0.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRock Paper Shotgun/Endnight Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\u003ca href=\"https://www.rockpapershotgun.com/games/sons-of-the-forest\"\u003eSons Of The Forest\u003c/a\u003e is about being chased by fithy cannibals who cannot swim, so the latest update ought to be useful to players. Its major new feature is the addition of rafts, which players can construct and then float about on like a 2000s Tom Hanks. \n\u003c/p\u003e\n\n\u003cp\u003eRafts come in three flavours ranging from small, slightly less small, to a full on houseboat with walls and ceilings. All three can be tied to the shore with a new mooring structure, and otherwise paddled about the lakes and waterways of the island.\n\u003c/p\u003e\n\u003cp\u003eThere are some other neat new features, too. Players can now draw plans for defensive walls around their base and leave Kelvin to do the hardwork of constructing them. Kelvin also now has a faster swim animation and both he and Virginia are able to pull themselves out of water at its edge, both of which seem useful when they inevitably fall off your raft.\n\u003c/p\u003e\n\u003cp\u003eIf you make the mistake of ever coming back to land, there are apparently impprovements to aiming with the crossbow, compound bow, crafted bow, shotgun and slingshot, all of which you\u0026#39;ll see while scrabbling to survive against the cannibals.\n\u003c/p\u003e\n\u003cp\u003eThe full \u003ca href=\"https://store.steampowered.com/news/app/1326470/view/526458302147592280\"\u003epatch notes are available over on Steam\u003c/a\u003e. We already liked the game plenty when it hit 1.0 early last year, as Matt Cox (RPS in peace) explained in his \u003ca href=\"https://www.rockpapershotgun.com/sons-of-the-forest-review\"\u003eSons Of The Forest review\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-18T23:06:52.396937Z",
  "modifiedTime": null
}
