{
  "id": "da1a488e-f733-454f-aaf8-7cbfa4dd3554",
  "title": "The White Lotus Is Officially Getting a Season 4",
  "link": "https://www.escapistmagazine.com/the-white-lotus-is-officially-getting-a-season-4/",
  "description": "",
  "author": "Zhiqing Wan",
  "published": "Wed, 22 Jan 2025 23:23:49 +0000",
  "source": "https://www.escapistmagazine.com/v2/feed/",
  "categories": [
    "Movies \u0026 TV",
    "News",
    "Featured",
    "The White Lotus"
  ],
  "byline": "Zhiqing Wan",
  "length": 1383,
  "excerpt": "Mike White's The White Lotus has officially been greenlit for a Season 4 at HBO. Details are scarce, but here's what we know so far.",
  "siteName": "The Escapist",
  "favicon": "",
  "text": "We haven’t even seen Season 3 yet, and Mike White’s popular anthology series has already been greenlit for a fourth season! The White Lotus Season 4 has just been renewed for a Season 4 over at HBO, as reported by Variety. According to the report, filming should start in 2026, and we’ll likely see the season release sometime in early 2027. At this point, details are very scarce, which is to be expected. We don’t know where Season 4 will take us next, or if there will be any returning cast members. Though, between you and me, Jennifer Coolidge’s Tanya was really the only one I wanted to see return, and if that’s out of the question, then I don’t need anymore returnees. We know that series creator Mike White had already started pitching ideas for Season 4 back in November. Given the popularity of the series, it’s not surprising to see it get renewed. In the meantime, The White Lotus Season 3 is set to premiere on Max in February. This time around, the series takes us to Thailand and features quite a star-studded cast as well, including an acting debut from BLACKPINK’s Lisa, which should be interesting to see. The White Lotus is now streaming exclusively on Max. The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. Learn more about our Affiliate Policy",
  "image": "https://www.escapistmagazine.com/wp-content/uploads/2025/01/white-lotus-s2.jpg?fit=1024%2C683",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp data-characters=\"234\" data-injectable=\"true\" data-video=\"true\"\u003eWe haven’t even seen Season 3 yet, and Mike White’s popular anthology series has already been greenlit for a fourth season! \u003cem\u003e\u003ca href=\"https://www.escapistmagazine.com/tag/the-white-lotus/\"\u003eThe White Lotus\u003c/a\u003e\u003c/em\u003e Season 4 has just been renewed for a Season 4 over at HBO, as \u003ca href=\"https://variety.com/2025/tv/news/the-white-lotus-renewed-season-4-1236282444/#\" target=\"_blank\"\u003ereported by Variety\u003c/a\u003e.\u003c/p\u003e\n\n    \u003cp data-characters=\"483\" data-current-count=\"483\" data-injectable=\"true\"\u003eAccording to the report, filming should start in 2026, and we’ll likely see the season release sometime in early 2027. At this point, details are very scarce, which is to be expected. We don’t know where Season 4 will take us next, or if there will be any returning cast members. Though, between you and me, Jennifer Coolidge’s Tanya was really the only one I wanted to see return, and if that’s out of the question, then I don’t need anymore returnees.\u003c/p\u003e\n\n    \u003cp data-characters=\"189\" data-current-count=\"189\" data-injectable=\"false\"\u003eWe know that series creator Mike White had already started pitching ideas for Season 4 back in November. Given the popularity of the series, it’s not surprising to see it get renewed.\u003c/p\u003e    \u003cp data-characters=\"269\" data-current-count=\"458\" data-injectable=\"true\"\u003eIn the meantime, \u003cem\u003eThe White Lotus\u003c/em\u003e Season 3 is set to premiere on Max in February. This time around, the series takes us to Thailand and features quite a star-studded cast as well, including an acting debut from \u003ca href=\"https://www.escapistmagazine.com/the-white-lotus-season-3-trailer-deals-with-the-dangers-of-hedonism/\"\u003eBLACKPINK’s Lisa\u003c/a\u003e, which should be interesting to see.\u003c/p\u003e\n\n    \u003cp data-characters=\"52\" data-current-count=\"52\" data-injectable=\"false\"\u003e\u003cem\u003eThe White Lotus\u003c/em\u003e is now streaming exclusively on Max.\u003c/p\u003e\n\t\n\n\t\t\t\n\t\n\t\n\t\n\t\n\t\u003chr/\u003e\n\n\t\u003cp\u003e\u003ci data-stringify-type=\"italic\"\u003e The Escapist is supported by our audience. When you purchase through links on our site, we may earn a small affiliate commission. \u003c/i\u003e\u003ci data-stringify-type=\"italic\"\u003e\u003ca href=\"https://www.escapistmagazine.com/affiliate-policy/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://escapistmagazine.com/affiliate-policy\" data-sk=\"tooltip_parent\"\u003eLearn more about our Affiliate Policy\u003c/a\u003e\u003c/i\u003e\t\u003c/p\u003e\n\n\t\n\t\t\t\n\t\t\t\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-22T23:23:49Z",
  "modifiedTime": null
}
