{
  "id": "dde4b055-2a23-4348-912e-cde4df27a570",
  "title": "Ex-Firaxis developers' Star Wars strategy game unveiled",
  "link": "https://www.eurogamer.net/ex-firaxis-developers-star-wars-strategy-game-unveiled",
  "description": "EA's Star Wars strategy game, confirmed to be in the works back in 2022, has been given a title - Star Wars: Zero Company - and a first bit of artwork ahead of a full reveal this weekend. Read more",
  "author": "Matt Wales",
  "published": "Mon, 14 Apr 2025 17:04:10 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Bit Reactor",
    "Strategy",
    "Electronic Arts",
    "Star Wars: Zero Company",
    "Strategy: Turn-Based Strategy",
    "PC"
  ],
  "byline": "Matt Wales",
  "length": 1967,
  "excerpt": "EA's Star Wars strategy game, confirmed to be in the works back in 2022, has been given a title - Star Wars: Zero Compa…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/e827fa6424eb073f59f050fca0289eb6/icon/apple-touch-icon-152x152.png",
  "text": "Ahead of full reveal this weekend. Image credit: Bit Reactor/Respawn Entertainment/EA EA's Star Wars strategy game, confirmed to be in the works back in 2022, has been given a title - Star Wars: Zero Company - and a first bit of artwork ahead of a full reveal this weekend. Star Wars: Zero Company is a collaboration between EA's Respawn Entertainment and developer Bit Reactor, a studio founded in 2022 by veterans of XCOM and Civilization developer Firaxis Games. It was one of three new Star Wars titles announced by EA at the time, the others being a follow-up to Star Wars Jedi: Fallen Order - Star Wars Jedi: Survivor, which released in 2023 - and a Star Wars first-person shooter which has since been cancelled. Little has been heard about Bit Reactor's game in the years since its announcement - although the studio did break its silence to confirm the project had been unaffected by the EA layoffs that accompanied the end of Respawn's shooter - but all that's about to change. EA has taken to social media to share the first official details about the project, calling Star Wars: Zero Company a \"single-player turn-based tactics game\", and sharing a first bit of concept art. The image features a motley crew of unnamed characters (plus one luxuriant moustache) including a Jedi, Mandalorian, and Clone trooper - with the latter suggesting Zero Company is set in the prequel era. That's further supported by the appearance of a battle droid displayed on the holographic device held by our moustachioed friend. Beyond that, there's not much more to report - but that will change this weekend as part of 2025's Star Wars Celebration convention. EA says it'll be sharing a \"world-exclusive first look\" at Zero Company as part of a panel this Saturday, 19th April, at 8.30am. Expect those details to start working their way across the internet shortly after.",
  "image": "https://assetsio.gnwcdn.com/star-wars-zero-company.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv id=\"main-content\"\u003e\n        \n\n        \u003cp\u003eAhead of full reveal this weekend.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/star-wars-zero-company.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/star-wars-zero-company.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/star-wars-zero-company.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/star-wars-zero-company.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"Star Wars: Zero Company artwork showing five unnamed characters including a Jedi, Mandalorian, and Clone trooper.\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eBit Reactor/Respawn Entertainment/EA\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \u003cp\u003e\nEA\u0026#39;s Star Wars strategy game, confirmed to be in the works back in 2022, has been given a title - Star Wars: Zero Company - and a first bit of artwork ahead of a full reveal this weekend.\n\u003c/p\u003e\n\u003cp\u003e\nStar Wars: Zero Company is a collaboration between EA\u0026#39;s \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/companies/respawn-entertainment\"\u003eRespawn Entertainment\u003c/a\u003e and developer Bit Reactor, a studio \u003ca href=\"https://www.eurogamer.net/firaxis-veterans-form-new-studio-bit-reactor-to-focus-on-turn-based-strategy\"\u003efounded in 2022 by veterans of XCOM and Civilization developer Firaxis Games\u003c/a\u003e. It was \u003ca href=\"https://www.eurogamer.net/ea-confirms-three-new-star-wars-games-in-development-at-respawn\"\u003eone of three new Star Wars titles announced by EA at the time\u003c/a\u003e, the others being a follow-up to \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/star-wars-jedi-fallen-order\"\u003eStar Wars Jedi: Fallen Order\u003c/a\u003e - \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/star-wars-jedi-survivor\"\u003eStar Wars Jedi: Survivor\u003c/a\u003e, which released in 2023 - and a Star Wars first-person shooter which \u003ca href=\"https://www.eurogamer.net/ea-announces-further-lay-offs-this-time-likely-to-affect-around-670-employees\"\u003ehas since been cancelled\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003e\nLittle has been heard about Bit Reactor\u0026#39;s game in the years since its announcement - although the \u003ca href=\"https://www.eurogamer.net/eas-star-wars-strategy-game-still-in-development-following-layoffs\"\u003estudio did break its silence\u003c/a\u003e to confirm the project had been unaffected by the EA layoffs that accompanied the end of Respawn\u0026#39;s shooter - but all that\u0026#39;s about to change.\n\u003c/p\u003e\n\u003cp\u003e\nEA has \u003ca href=\"https://x.com/EAStarWars/status/1911811628124742117\"\u003etaken to social media\u003c/a\u003e to share the first official details about the project, calling Star Wars: Zero Company a \u0026#34;single-player turn-based tactics game\u0026#34;, and sharing a first bit of concept art. The image features a motley crew of unnamed characters (plus one luxuriant moustache) including a Jedi, Mandalorian, and Clone trooper - with the latter suggesting Zero Company is set in the prequel era. That\u0026#39;s further supported by the appearance of a battle droid displayed on the holographic device held by our moustachioed friend.\n\u003c/p\u003e\n\u003cp\u003e\nBeyond that, there\u0026#39;s not much more to report - but that will change this weekend as part of 2025\u0026#39;s Star Wars Celebration convention. EA says it\u0026#39;ll be sharing a \u0026#34;world-exclusive first look\u0026#34; at Zero Company as part of a panel this Saturday, 19th April, at 8.30am. Expect those details to start working their way across the internet shortly after.\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-14T17:04:10.332415Z",
  "modifiedTime": null
}
