{
  "id": "dec0421c-52a3-4f61-a75b-4f3c3f5f5976",
  "title": "The Sunday Papers",
  "link": "https://www.rockpapershotgun.com/the-sunday-papers-766",
  "description": "Last week I mentioned that I was reading Tokyo These Days, a manga about the production of a manga magazine. I have paired this, somewhat accidentally, with Shirobako, an anime about the anime production process. I'm four episodes in and there's almost no drama to it that isn't drawn directly from the difficulties of that production, to the point where the main tension of episode three hinges upon an FTP server being down. Wonderful. Sunday will be for watching a bit more of that, then, and avoiding the heat. Ever wonder if the oversaturated trailer showcases of not-E3 and demos of Steam Next Fest actually produce a return for developers? Simon Carless's always interesting newsletter GameDiscoverCo dug into the numbers to discover the top announcements of not-E3 and who won Next Fest. These events clearly work for some - in particular those with huge marketing budgets announcing the ninth mainline entry in a beloved 30-year-old series - but standing out has never been more difficult. Read more",
  "author": "Graham Smith",
  "published": "Sun, 22 Jun 2025 10:00:00 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Blockbuster",
    "The Sunday Papers"
  ],
  "byline": "Graham Smith",
  "length": 5818,
  "excerpt": "The Sunday Papers is our weekly roundup of great writing about (mostly) videogames from across the web.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/e38353f6a34f5b80cefc27cadb5d66bf/icon/apple-touch-icon.png",
  "text": "Image credit: RPS Last week I mentioned that I was reading Tokyo These Days, a manga about the production of a manga magazine. I have paired this, somewhat accidentally, with Shirobako, an anime about the anime production process. I'm four episodes in and there's almost no drama to it that isn't drawn directly from the difficulties of that production, to the point where the main tension of episode three hinges upon an FTP server being down. Wonderful. Sunday will be for watching a bit more of that, then, and avoiding the heat. Ever wonder if the oversaturated trailer showcases of not-E3 and demos of Steam Next Fest actually produce a return for developers? Simon Carless's always interesting newsletter GameDiscoverCo dug into the numbers to discover the top announcements of not-E3 and who won Next Fest. These events clearly work for some - in particular those with huge marketing budgets announcing the ninth mainline entry in a beloved 30-year-old series - but standing out has never been more difficult. Lush video game print magazine A Profound Waste Of Time is running a Kickstarter to reprint its first three issues. It has already tripled its target, but if you always regretted not grabbing issues 1-3 the first the time around, here's your chance. Jeremy Ettinghausen trawled through all the data Amazon Alexa had collected about his family, with a Richard Curtisesque sentimentality about family dynamics and how quickly children grow up, and barely a moments notice of the privacy breaches involved or his own complicity in them. Coco’s relationship with Alexa is, in our family at least, uniquely hers. For a start, she is of an age where she wants to know the answers to questions that may be too personal or embarrassing to ask a parent or sibling. And then she is the only one of us who has an Echo in their own private space. Coco tells me she speaks to Alexa less now than she did two or three years ago, partly because she knows that I’ve seen transcripts of everything she has asked, but mainly because she now has her own phone and WhatsApp and can chat with “like, actual friends”. I re-watched Spotlight a couple nights ago for the fifth time. It's an odd movie to return to so often, but as per all of the films I have on repeat, it's about hyper-competent people performing their jobs steadily in the face of systemic counter-pressure. It sits comfortably alongside other movies like Broadcast News, Moneyball or TV shows like The West Wing (on which co-writer Josh Singer previously worked). It turns out I'm not alone in this either, as my latest re-watch was inspired by Geoffrey Bunting in The Guardian explaining why he has seen Spotlight over 30 times. The serenity that belies the horror at Spotlight’s core, however, makes it a primo Sunday afternoon movie. Never bombastic, it’s an engaging yet relaxing antidote to the threat of the post-Sunday dinner carbohydrate pass-out. If I’m exhausted, miserable or stressed, Spotlight is always something I can watch – that I will watch – even if I can’t imagine being able to concentrate on anything else. After breakups, I watch Spotlight; when my grandmother died, Spotlight; after a horrible day at work, it’s Spotlight. Is Google about to destroy the web, asks the BBC in the face of Google's planned 'AI mode' search. (Meanwhile, the BBC are threatening AI firm Perplexity with legal action because their chatbot is reproducing BBC stories \"verbatim\".) \"If Google makes AI Mode the default in its current form, it's going to have a devastating impact on the internet,\" says Lily Ray, vice president of search engine optimisation (SEO) strategy and research at the marketing agency Amsive. \"It will severely cut into the main source of revenue for most publishers and it will disincentivise content creators who rely on organic search traffic, which is millions of websites, maybe more. Google holds all the power.\" If that sounds depressing, and it should, Sacha Judd has advice on how to \"escape the algorithmic doom loops and reclaim our digital lives\". Poptimism argued that music ought to be judged on its own merits rather than written-off as inauthentic based solely on the means of its production. W. David Marx overstates that argument, downplays the forces it was fighting against, ignores all adjacent cultural and technological movements, and places the blame for an undefined but clearly maligned present cultural moment at the feet of a handful of music critics and bloggers from 20 years ago. But I can't say I didn't enjoy reading and thinking about it. In the subsequent weeks, the loudest voice in support of Ashlee Simpson was not a teenage fan but one of the great American music critics, Kelefa Sanneh. He used the SNL incident as a hook for his mega-influential The New York Times essay “The Rap Against Rockism\" In the piece, he dismissed the anti-Simpson backlash as a symptom of an ideology he called “rockism,\" which was responsible for the elevation of \"authentic\" white, male, guitar-oriented singer-songwriters over “inauthentic” pop acts who often came from marginalized communities. The notorious trolls at The Telegraph had to apologise for their latest provocation. On May 25 we published an online article “We earn £345k, but soaring private school fees mean we can’t go on five holidays” which included stock photographs and not, as the article indicated, images of the family referred to in the article. In addition, we have not been able to verify the details published. Alice's next book is now available for pre-order. I listened to a lot of new music this past week and... didn't love any of it. So [rummages around in back of drawer] here's Beach Bummer by No Vacation, a perfect piece of dream pop from 2015 in two and a half minutes.",
  "image": "https://assetsio.gnwcdn.com/the-sunday-papers-big.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article\"\u003e\n        \u003carticle data-ads=\"true\" data-article-type=\"features\" data-article-group=\"feature\" data-paywalled=\"false\" data-premium=\"false\" data-sponsored=\"false\" data-type=\"article\"\u003e\n\n\n\u003cheader data-component=\"article-header\"\u003e\n  \n\n    \n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n\u003cspan\u003e\u003c/span\u003e    \u003cimg src=\"https://assetsio.gnwcdn.com/the-sunday-papers-big.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/the-sunday-papers-big.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/the-sunday-papers-big.jpg?width=690\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A plain white mug of black tea or coffee, next to a broadsheet paper on a table, in black and white. It\u0026#39;s the header for Sunday Papers!\" data-src-full=\"https://assetsio.gnwcdn.com/the-sunday-papers-big.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=70\u0026amp;format=jpg\u0026amp;auto=webp\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n\n        \u003cfigcaption\u003e\n          \u003cspan\u003eImage credit: \u003ccite\u003eRPS\u003c/cite\u003e\u003c/span\u003e\n        \u003c/figcaption\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/header\u003e\n  \u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \n\u003cp\u003eLast week I mentioned that I was reading Tokyo These Days, a manga about the production of a manga magazine. I have paired this, somewhat accidentally, with Shirobako, an anime about the anime production process. I\u0026#39;m four episodes in and there\u0026#39;s almost no drama to it that isn\u0026#39;t drawn directly from the difficulties of that production, to the point where the main tension of episode three hinges upon an FTP server being down. Wonderful. Sunday will be for watching a bit more of that, then, and avoiding the heat.\n\u003c/p\u003e\n\u003cp\u003eEver wonder if the oversaturated trailer showcases of not-E3 and demos of Steam Next Fest actually produce a return for developers? Simon Carless\u0026#39;s always interesting newsletter GameDiscoverCo dug into the numbers to discover \u003ca href=\"https://newsletter.gamediscover.co/p/revealed-the-top-announcements-of\"\u003ethe top announcements of not-E3\u003c/a\u003e and \u003ca href=\"https://newsletter.gamediscover.co/p/who-won-june-2025s-steam-next-fest\"\u003ewho won Next Fest\u003c/a\u003e. These events clearly work for some - in particular those with huge marketing budgets announcing the ninth mainline entry in a beloved 30-year-old series - but standing out has never been more difficult.\n\u003c/p\u003e\n\n\u003cp\u003eLush video game print magazine A Profound Waste Of Time is running a \u003ca href=\"https://www.kickstarter.com/projects/caz/the-apwot-trilogy-reprint\"\u003eKickstarter to reprint its first three issues\u003c/a\u003e. It has already tripled its target, but if you always regretted not grabbing issues 1-3 the first the time around, here\u0026#39;s your chance.\n\u003c/p\u003e\n\u003cp\u003eJeremy Ettinghausen trawled through all \u003ca href=\"https://www.theguardian.com/technology/2025/may/24/what-i-discovered-when-i-asked-amazon-to-tell-me-everything-alexa-had-heard\"\u003ethe data Amazon Alexa had collected about his family\u003c/a\u003e, with a Richard Curtisesque sentimentality about family dynamics and how quickly children grow up, and barely a moments notice of the privacy breaches involved or his own complicity in them.\n\u003c/p\u003e\n\u003cblockquote\u003eCoco’s relationship with Alexa is, in our family at least, uniquely hers. For a start, she is of an age where she wants to know the answers to questions that may be too personal or embarrassing to ask a parent or sibling. And then she is the only one of us who has an Echo in their own private space. Coco tells me she speaks to Alexa less now than she did two or three years ago, partly because she knows that I’ve seen transcripts of everything she has asked, but mainly because she now has her own phone and WhatsApp and can chat with “like, actual friends”.\u003c/blockquote\u003e\n\u003cp\u003eI re-watched Spotlight a couple nights ago for the fifth time. It\u0026#39;s an odd movie to return to so often, but as per all of the films I have on repeat, it\u0026#39;s about hyper-competent people performing their jobs steadily in the face of systemic counter-pressure. It sits comfortably alongside other movies like Broadcast News, Moneyball or TV shows like The West Wing (on which co-writer Josh Singer previously worked). It turns out I\u0026#39;m not alone in this either, as my latest re-watch was inspired by Geoffrey Bunting in The Guardian \u003ca href=\"https://www.theguardian.com/film/2025/jun/16/spotlight-feelgood-movie\"\u003eexplaining why he has seen Spotlight over 30 times\u003c/a\u003e.\n\u003c/p\u003e\n\u003cblockquote\u003eThe serenity that belies the horror at Spotlight’s core, however, makes it a primo Sunday afternoon movie. Never bombastic, it’s an engaging yet relaxing antidote to the threat of the post-Sunday dinner carbohydrate pass-out. If I’m exhausted, miserable or stressed, Spotlight is always something I can watch – that I will watch – even if I can’t imagine being able to concentrate on anything else. After breakups, I watch Spotlight; when my grandmother died, Spotlight; after a horrible day at work, it’s Spotlight.\u003c/blockquote\u003e\n\u003cp\u003e\u003ca href=\"https://www.bbc.co.uk/future/article/20250611-ai-mode-is-google-about-to-change-the-internet-forever\"\u003eIs Google about to destroy the web\u003c/a\u003e, asks the BBC in the face of Google\u0026#39;s planned \u0026#39;AI mode\u0026#39; search. (Meanwhile, the BBC are \u003ca href=\"https://www.bbc.co.uk/news/articles/cy7ndgylzzmo\"\u003ethreatening AI firm Perplexity with legal action\u003c/a\u003e because their chatbot is reproducing BBC stories \u0026#34;verbatim\u0026#34;.)\n\u003c/p\u003e\n\u003cblockquote\u003e\u0026#34;If Google makes AI Mode the default in its current form, it\u0026#39;s going to have a devastating impact on the internet,\u0026#34; says Lily Ray, vice president of search engine optimisation (SEO) strategy and research at the marketing agency Amsive. \u0026#34;It will severely cut into the main source of revenue for most publishers and it will disincentivise content creators who rely on organic search traffic, which is millions of websites, maybe more. Google holds all the power.\u0026#34;\u003c/blockquote\u003e\n\u003cp\u003eIf that sounds depressing, and it should, Sacha Judd has advice on how to \u003ca href=\"https://www.sachajudd.com/the-good-internet/\"\u003e\u0026#34;escape the algorithmic doom loops and reclaim our digital lives\u0026#34;\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003ePoptimism argued that music ought to be judged on its own merits rather than written-off as inauthentic based solely on the means of its production. W. David Marx overstates that argument, downplays the forces it was fighting against, ignores all adjacent cultural and technological movements, and places the blame for an undefined but clearly maligned present cultural moment at the feet of a handful of music critics and bloggers from 20 years ago. But I can\u0026#39;t say \u003ca href=\"https://culture.ghost.io/the-pro-pop-ideology-from-ashlee-to-addison/\"\u003eI didn\u0026#39;t enjoy reading and thinking about it\u003c/a\u003e.\u003c/p\u003e\n\u003cblockquote\u003eIn the subsequent weeks, the loudest voice in support of Ashlee Simpson was not a teenage fan but one of the great American music critics, Kelefa Sanneh. He used the SNL incident as a hook for his mega-influential The New York Times essay “The Rap Against Rockism\u0026#34; In the piece, he dismissed the anti-Simpson backlash as a symptom of an ideology he called “rockism,\u0026#34; which was responsible for the elevation of \u0026#34;authentic\u0026#34; white, male, guitar-oriented singer-songwriters over “inauthentic” pop acts who often came from marginalized communities.\u003c/blockquote\u003e\n\u003cp\u003eThe notorious trolls at The Telegraph had to \u003ca href=\"https://www.telegraph.co.uk/news/0/the-telegraph-an-apology/\"\u003eapologise\u003c/a\u003e for their latest provocation.\u003c/p\u003e\n\u003cblockquote\u003eOn May 25 we published an online article “We earn £345k, but soaring private school fees mean we can’t go on five holidays” which included stock photographs and not, as the article indicated, images of the family referred to in the article. In addition, we have not been able to verify the details published.\u003c/blockquote\u003e\n\u003cp\u003eAlice\u0026#39;s next book is \u003ca href=\"https://bsky.app/profile/abeewords.bsky.social/post/3lrsa4lpoes2n\"\u003enow available for pre-order\u003c/a\u003e.\n\u003c/p\u003e\n\u003cp\u003eI listened to a lot of new music this past week and... didn\u0026#39;t love any of it. So [rummages around in back of drawer] here\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=rxhd22IcqAY\u0026amp;ab_channel=NoVacation-Topic\"\u003eBeach Bummer by No Vacation\u003c/a\u003e, a perfect piece of dream pop from 2015 in two and a half minutes.\n\u003c/p\u003e\u003c/div\u003e\n\n        \u003c/article\u003e\n\n  \n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-22T10:00:00Z",
  "modifiedTime": null
}
