{
  "id": "ded7ff6a-ba10-46ac-a21d-a9846fa69a98",
  "title": "The PlayStation Portal remote player experience to evolve with new system update",
  "link": "https://blog.playstation.com/2024/11/19/the-playstation-portal-remote-player-experience-to-evolve-with-new-system-update/",
  "description": "Just over a year ago, we launched our first dedicated remote play device, PlayStation Portal remote player, with an aspiration to deliver a console-quality gaming experience on a handheld device. PS Portal was an ambitious product for us, and we have been delighted by the positive response from our fans and to see that our […]",
  "author": "Hiromi Wakai",
  "published": "Tue, 19 Nov 2024 22:00:03 +0000",
  "source": "http://feeds.feedburner.com/psblog",
  "categories": [
    "PlayStation Portal",
    "playstation portal"
  ],
  "byline": "Adam Michel Director, Game Services – Content, Sony Interactive Entertainment",
  "length": 5312,
  "excerpt": "PlayStation Plus Premium members will have access to test Cloud Streaming (Beta) for select PS5 games on Game Catalog.",
  "siteName": "PlayStation.Blog",
  "favicon": "https://blog.playstation.com/tachyon/2019/03/cropped-pslogo.png?presign=X-Amz-Content-Sha256%3DUNSIGNED-PAYLOAD%26X-Amz-Security-Token%3DIQoJb3JpZ2luX2VjEOn%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FwEaCXVzLWVhc3QtMSJHMEUCIAKXCZdMiwNxsUeSKVLCbGkLklHyypSS1iO3FKgTUJtmAiEA3yGfUHgLyzywJw8579tkir5xzwZiSec%252F8%252BijzDKyoSIqhgQIgv%252F%252F%252F%252F%252F%252F%252F%252F%252F%252FARAAGgw1Nzc0MTg4MTg0MTMiDAOC%252BFP99xdYE8jTvyraA%252F8jnnKKSlS4U%252BOdX%252BGVcnhclpKuXzX0oPuPGDRVyQktyjvtOY3fYZCOPQW0bJsxlkKFxfzKiTQIxFQqlscOu9MjvrizDgyeLyz789DzfGicxIQEwFNYwSxLsdeytJ8PDuMupdn58v6LB4JlLGuMd2fcEHC%252FaklmkF5doOfRrxeWvUJxLOTB2ML4cx%252FCAmnrCgw796rbcbpt%252B6zP47Bk7%252Fr9wh8wiR5jDDfmT4TUbrgm03u6pzpnwJ4W2PBDl8TZu8UABfbr1JSochLspS6AXqIcveWsTFONTtDfjTrHxUCm2WOVTmWO8CQmRqr%252BiUqaArmUkPhvNI1HYETYT%252F3KRfFBnhhIzpsicM06bHoFsDLl%252BUkWvmCwBkB%252FxRFiszt9EBkIq3ewgeNeT11Lz8%252Bo3GdS8n57gKewHjVe4hMJ%252BUkj4NPlx5VK%252BhTWjnkf4yaY7YuaunnCpI7jqFVYTqyHolNRBDDZq1RhR%252B%252FDZXtkR2G0aQyiW0Natw1rguj7X8kdrRwGIlelHs2%252Bm8sUhEwkBDE9QZivwtRR9P0svpkkA2lDJWKRx5rQza2cwzHgnLOxQGg%252BQUHsqhqGkK3%252BPKdL%252BiJf2G4HGtFGiYbWeHQqqSriHK5a1HTiy0s%252FJTDj6vS5BjqlAebr%252BwBZCxLSLGiTFZYVBe1uj8B3YajYNE%252B4EZQvl4tBkpr8GRgoQA2JJduz3C1BOtd0HmT71Lk%252FlhR6SA8NE6crXTcDexvnl01XMVdqYgOvknMuxOak%252FKr3PoBr5VYu8fTHa5H3hvigZZosrAbMkyG7bCJ%252BpbaUqTpwlxkNC5qy7VaN3gq%252B%252B1x1Nj1NPLH3%252FWyVF84TWsK5a9wKWa6jTRPI4uWufA%253D%253D%26X-Amz-Algorithm%3DAWS4-HMAC-SHA256%26X-Amz-Credential%3DASIAYM4GX6NW5TSX3NIS%252F20241120%252Fus-east-1%252Fs3%252Faws4_request%26X-Amz-Date%3D20241120T010542Z%26X-Amz-SignedHeaders%3Dhost%26X-Amz-Expires%3D900%26X-Amz-Signature%3D43dcd2af3a9d99c7223412433f0238acb16aaa23d80ddec02ec89bf97a023959\u0026fit=192%2C192",
  "text": "Just over a year ago, we launched our first dedicated remote play device, PlayStation Portal remote player, with an aspiration to deliver a console-quality gaming experience on a handheld device. PS Portal was an ambitious product for us, and we have been delighted by the positive response from our fans and to see that our vision has resonated with the community. Today we’re pleased to announce a new system software update for PS Portal that will begin releasing starting later today (Europe release begins Wednesday), which will introduce refinements in the audio experience, including: Speaker audio output adjustment to make the volume lower when the audio level is set to minimum You will now be able to adjust settings of your PlayStation Link device from the PS Portal Settings menu, allowing you to optimize the volume and sidetone volume. This update will also include a beta version of a new feature that many fans have been asking for – support for cloud streaming on PS Portal. When the update is live, PlayStation Plus Premium members will be able to participate in a beta for cloud streaming on PS Portal, allowing select PS5 games in the PlayStation Plus Game Catalog* to be streamed directly from our servers, even without a PS5 console. Since Cloud Streaming (Beta) on PS Portal is still an experimental offering, the features available during the beta period may change over time and may not reflect the final experience.  Let’s take a deeper look at what you can expect in this beta: Features available during the Beta Stream select PS5 games in the PlayStation Plus Game Catalog Over 120 PS5 games from the PS Plus Game Catalog, including Dave the Diver, Ghost of Tsushima, Marvel’s Spider-Man: Miles Morales, Monster Hunter Rise, and Ratchet \u0026 Clank: Rift Apart, will be accessible on PS Portal via cloud streaming* Streaming up to 1080p/60fps** DualSense wireless controller features, including haptic feedback, adaptive triggers, speakers, touchpad (emulated on the touch screen for PS Portal), and motion sensor*** PlayStation Plus Cloud storage Save data and game progress can be stored up to 100GB and will be automatically synced with your PS5 console, making it easy to switch seamlessly between local and streaming gameplay, and between multiple devices. Cloud Streaming (Beta) for PS Portal will be available through the PlayStation Plus Premium plan, which is offered in the following locations:  Austria, Belgium, Bulgaria, Canada, Croatia, Czech Republic, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Japan, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Republic of Cyprus, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom, and United States. How to access Cloud Streaming (Beta) To access the beta, you will need the following: PlayStation Portal remote player An account for PlayStation Network**** An active PlayStation Plus Premium membership Access to broadband internet Wi-Fi To establish a cloud streaming session: requires minimum 5Mbps of upload and download speeds To stream at 720p: requires minimum 7 Mbps To stream at 1080p: requires minimum 13 Mbps Once the beta is available, you can access the beta by updating your PS Portal to the latest system software and completing the following steps: Open “Quick Menu” and access “Settings” on your PS Portal. Select the “Cloud Streaming (Beta)” button Switch the Cloud Streaming (Beta) toggle on (this will be off by default). After you’ve enabled Cloud Streaming (Beta) in the settings menu, you should see a new option on the Home screen of your PS Portal that allows you to access games via cloud streaming. The beta option can be turned off any time, and your Home screen will revert back to the standard version once the option is turned off. Features not included in the Beta As we are in the beginning stages of publicly testing cloud streaming on PS Portal, some features will not be available, such as Game Trials, streaming games purchased on PS Store, system features such as Party voice chat and game invites for select games, Create button, 3D audio, and in-game commerce.  Additionally, the streaming games playable on PS Portal are limited to PS5 games, and PS4 games/PS3 games are not supported. We are always listening to your feedback, and we look forward to seeing many players participating in the beta!  *Titles available in the PlayStation Plus Game Catalog varies over time, region/country and plan. See https://www.playstation.com/Plus for details and updates on PlayStation Plus offerings. PlayStation Plus is an ongoing subscription subject to a recurring subscription fee taken automatically (at the then-current PS Store price) at the frequency you choose at purchase until cancellation. Terms apply: play.st/psplus-usageterms **Individual game performance will vary based on the specific game being played, and the quality of connectivity in your network environment. ***Haptic feedback and adaptive trigger features are only available when those features are supported by the game being played. ****Cloud Streaming (Beta) is not available for child accounts. Trending Stories",
  "image": "https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-398559\"\u003e\n\n\t\t\t\t\n\n\t\t\t\t\u003cdiv\u003e\n\n\t\t\t\t\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" width=\"1088\" height=\"612\" src=\"https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\" alt=\"The PlayStation Portal remote player experience to evolve with new system update\" sizes=\"(min-width: 1170px) 936px, (min-width: 960px) 80vw, 100vw\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=1 1088w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.99 1077w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.75 816w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.61 664w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.49 533w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.41 446w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.32 348w, https://blog.playstation.com/tachyon/2024/11/fc72c6669070d52eccbe23c4fe2dc75dad18ea09.jpg?resize=1088%2C612\u0026amp;crop_strategy=smart\u0026amp;zoom=0.25 272w\"/\u003e\u003c/p\u003e\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\n\n\n\u003cp\u003eJust over a year ago, we launched our first dedicated remote play device, \u003ca href=\"https://www.playstation.com/accessories/playstation-portal-remote-player/\"\u003ePlayStation Portal remote player\u003c/a\u003e, with an aspiration to deliver a console-quality gaming experience on a handheld device. PS Portal was an ambitious product for us, and we have been delighted by the positive response from our fans and to see that our vision has resonated with the community.\u003c/p\u003e\n\n\n\n\u003cp\u003eToday we’re pleased to announce a new system software update for PS Portal that will begin releasing starting later today (Europe release begins Wednesday), which will introduce refinements in the audio experience, including:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eSpeaker audio output adjustment to make the volume lower when the audio level is set to minimum\u003c/li\u003e\n\n\n\n\u003cli\u003eYou will now be able to adjust settings of your PlayStation Link device from the PS Portal Settings menu, allowing you to optimize the volume and sidetone volume.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis update will also include a beta version of a new feature that many fans have been asking for – support for cloud streaming on PS Portal. When the update is live, PlayStation Plus Premium members will be able to participate in a beta for cloud streaming on PS Portal, allowing select PS5 games in the PlayStation Plus Game Catalog* to be streamed directly from our servers, even without a PS5 console.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince Cloud Streaming (Beta) on PS Portal is still an experimental offering, the features available during the beta period may change over time and may not reflect the final experience. \u003c/p\u003e\n\n\n\n\u003cp\u003eLet’s take a deeper look at what you can expect in this beta:\u003c/p\u003e\n\n\n\n\u003ch2\u003eFeatures available during the Beta\u003c/h2\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eStream select PS5 games in the PlayStation Plus Game Catalog\n\u003cul\u003e\n\u003cli\u003eOver 120 PS5 games from the PS Plus Game Catalog, including Dave the Diver, Ghost of Tsushima, Marvel’s Spider-Man: Miles Morales, Monster Hunter Rise, and Ratchet \u0026amp; Clank: Rift Apart, will be accessible on PS Portal via cloud streaming*\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\n\n\n\u003cli\u003eStreaming up to 1080p/60fps**\u003c/li\u003e\n\n\n\n\u003cli\u003eDualSense wireless controller features, including haptic feedback, adaptive triggers, speakers, touchpad (emulated on the touch screen for PS Portal), and motion sensor***\u003c/li\u003e\n\n\n\n\u003cli\u003ePlayStation Plus Cloud storage\n\u003cul\u003e\n\u003cli\u003eSave data and game progress can be stored up to 100GB and will be automatically synced with your PS5 console, making it easy to switch seamlessly between local and streaming gameplay, and between multiple devices.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eCloud Streaming (Beta) for PS Portal will be available through the PlayStation Plus Premium plan, which is offered in the following locations: \u003c/p\u003e\n\n\n\n\u003cp\u003eAustria, Belgium, Bulgaria, Canada, Croatia, Czech Republic, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Japan, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Republic of Cyprus, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom, and United States.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://live.staticflickr.com/65535/54093178853_1d9b53f431_k.jpg\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg decoding=\"async\" src=\"https://live.staticflickr.com/65535/54093178853_1d9b53f431_k.jpg\" alt=\"PS Portal UI screenshot showing the opt-in menu for cloud streaming beta\" data-old-src=\"https://blog.playstation.com/content/themes/playstation-2018/images/placeholder.svg\" data-src=\"https://live.staticflickr.com/65535/54093178853_1d9b53f431_k.jpg\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eHow to access Cloud Streaming (Beta)\u003c/h2\u003e\n\n\n\n\u003cp\u003eTo access the beta, you will need the following:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003ePlayStation Portal remote player\u003c/li\u003e\n\n\n\n\u003cli\u003eAn account for PlayStation Network****\u003c/li\u003e\n\n\n\n\u003cli\u003eAn active PlayStation Plus Premium membership\u003c/li\u003e\n\n\n\n\u003cli\u003eAccess to broadband internet Wi-Fi\u003c/li\u003e\n\n\n\n\u003cli\u003eTo establish a cloud streaming session: requires minimum 5Mbps of upload and download speeds\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eTo stream at 720p: requires minimum 7 Mbps\u003c/li\u003e\n\n\n\n\u003cli\u003eTo stream at 1080p: requires minimum 13 Mbps\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eOnce the beta is available, you can access the beta by updating your PS Portal to the latest system software and completing the following steps:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eOpen “Quick Menu” and access “Settings” on your PS Portal.\u003c/li\u003e\n\n\n\n\u003cli\u003eSelect the “Cloud Streaming (Beta)” button\u003c/li\u003e\n\n\n\n\u003cli\u003eSwitch the Cloud Streaming (Beta) toggle on (this will be off by default).\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eAfter you’ve enabled Cloud Streaming (Beta) in the settings menu, you should see a new option on the Home screen of your PS Portal that allows you to access games via cloud streaming. The beta option can be turned off any time, and your Home screen will revert back to the standard version once the option is turned off.\u003c/p\u003e\n\n\n\n\u003ch2\u003eFeatures not included in the Beta\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs we are in the beginning stages of publicly testing cloud streaming on PS Portal, some features will not be available, such as Game Trials, streaming games purchased on PS Store, system features such as Party voice chat and game invites for select games, Create button, 3D audio, and in-game commerce. \u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, the streaming games playable on PS Portal are limited to PS5 games, and PS4 games/PS3 games are not supported.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe are always listening to your feedback, and we look forward to seeing many players participating in the beta! \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e*Titles available in the PlayStation Plus Game Catalog varies over time, region/country and plan. See \u003c/em\u003e\u003ca href=\"https://www.playstation.com/Plus\"\u003e\u003cem\u003ehttps://www.playstation.com/Plus\u003c/em\u003e\u003c/a\u003e\u003cem\u003e for details and updates on PlayStation Plus offerings. PlayStation Plus is an ongoing subscription subject to a recurring subscription fee taken automatically (at the then-current PS Store price) at the frequency you choose at purchase until cancellation. Terms apply: \u003c/em\u003e\u003ca href=\"http://play.st/psplus-usageterms\"\u003e\u003cem\u003eplay.st/psplus-usageterms\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e**Individual game performance will vary based on the specific game being played, and the quality of connectivity in your network environment.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e***Haptic feedback and adaptive trigger features are only available when those features are supported by the game being played.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e****Cloud Streaming (Beta) is not available for child accounts.\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/article\u003e\u003csection\u003e\n\t\u003ch2\u003eTrending Stories\u003c/h2\u003e\n\n\t\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-19T14:00:03-08:00",
  "modifiedTime": "2024-11-19T14:00:13-08:00"
}
