{
  "id": "dfc2d821-a5c0-43c2-b7a4-81f73225f005",
  "title": "Path of Exile 2 early access review-in-progress - coming for Diablo 4's lunch in style",
  "link": "https://www.eurogamer.net/path-of-exile-2-early-access-review-in-progress",
  "description": "As much as Path of Exile 1 was lauded for its seemingly bottomless character customisation and its ability to keep voracious action role-playing game players fed, mentally, for months on end, there was no denying it could be a pain to get into. Playing it could feel like giving someone made entirely of elbows a hug. You'd get used to it in time - you'd even come to find the feeling comforting - but there's no question the series could use an update. Path of Exile 1 is over a decade old; it's time for something new. Read more",
  "author": "Robert Purchese",
  "published": "Fri, 06 Dec 2024 19:00:00 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Hack \u0026 Slash",
    "Bird view / Isometric",
    "PS4",
    "Grinding Gear Games",
    "Xbox One",
    "Single Player",
    "Path of Exile 2",
    "PC",
    "Indie",
    "MMORPG",
    "Action Adventure",
    "RPG",
    "Multiplayer Competitive",
    "Multiplayer Cooperative"
  ],
  "byline": "Robert Purchese",
  "length": 8521,
  "excerpt": "As much as Path of Exile 1 was lauded for its seemingly bottomless character customisation and its ability to keep vora…",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/609ee396ed39924618f01d5c0c94ea2d/icon/apple-touch-icon-152x152.png",
  "text": "Image credit: Grinding Gear Games As much as Path of Exile 1 was lauded for its seemingly bottomless character customisation and its ability to keep voracious action role-playing game players fed, mentally, for months on end, there was no denying it could be a pain to get into. Playing it could feel like giving someone made entirely of elbows a hug. You'd get used to it in time - you'd even come to find the feeling comforting - but there's no question the series could use an update. Path of Exile 1 is over a decade old; it's time for something new. That something - Path of Exile 2 - is finally here, at least in early access, and understandably there's tremendous excitement for it. A decade of success has turned its predecessor from being a nobody to a title contender. But where there's increased excitement, there's also increased expectations, and the sequel will be measured by a different yardstick - a Diablo 4 yardstick, perhaps. Say what you will about Diablo's merits, but its production values and new player onboarding are second to none. Will Path of Exile 2 compete? Spoiler, yes, but a quick caveat: this is an early access release so Path of Exile 2 isn't finished, and Grinding Gear Games has said it will take at least six more months of development to finish it, if not more (these things usually end up taking longer than expected). Nevertheless, this is far from a sketchy early access release. The experience I've had, albeit on quiet, press-intended pre-release servers - which have now been wiped as Grinding Gear prepares for the public early access stampede - has been rock solid. There were a couple of inexplicable quits-to-desktop, but they were tiny hiccups in what has otherwise been a smooth and sturdy experience (though we'll have to wait and see how the public servers fare over the weekend to see if this sentiment holds true). Path of Exile 2: Early Access Gameplay Trailer The early access release trailer for Path of Exile 2. There's an understated beauty to it. Watch on YouTube Those elbows of Path of Exile 1 are broadly gone - or they're so soft now it's more like hugging a lumpy duvet than an elbowy... goblin. The game plays much more like you'd expect a modern game to: you move with WASD keys and mouse-around to aim, and there's full controller support, though it's still not seamless switching between the two - you still need to quit out to the main menu to alternate. Similarly, the game's more unusual systems remain, such as the way abilities belong to equipment rather than the character. But they're much better organised now so it's clearer how they work and what you've got to do. The onboarding is smoother, too, and while I'm sure there's another onboarding pass to do before the game's full release, it's already welcoming enough should you be intrigued to give it a go (we have some Path of Exile 2 tips to help you if you do).It helps that the game looks very smart now, of course - you can really feel the additional money and time and people Grinding Gear Games has had available while making the sequel. Environments and characters are rich with detail, and the animation is superb. It's in little touches that you feel it, like freezing someone and seeing spokes of ice form behind them - as if underlining the momentum of the blast, a bit like seeing a wave frozen in extreme weather. Or it's in moments of well-observed movement, such as when my monk dashes forwards, palm outstretched, to steal living essence from floundering foes - smack! There's heft behind each blow, crunch and connection, and I love that as a player - the moment to moment feel of Path of Exile 2 is great. Luxurious. Expensive. Look, it's hard to take screenshots and play the game, OK? | Image credit: Eurogamer / Grinding Gear Games It's this framework that provides the ideal platform for the game's best stuff - the series' best stuff - to come through. Path of Exile is known for challenging players - it's not unlike the Souls series in that regard - and the sequel revels in this. Even in the game's opening areas, packs of enemies are quick to surround you and take you down if you underestimate them - or if you overestimate yourself. Similarly, bosses are tough and uncompromising. Again, even as soon as the first boss you meet, you'll be given a tough lesson in dodge-rolling and attack-pattern recognition - a lesson in 'this is how the game does bosses'. But there's more to it than just unflinching difficulty: there's a sense of pleasure in the challenge, both on your side and the developer's. Enemy composition probes your composition, looking for weaknesses and gaps, and bosses are the game's centrepieces, chock full of imagination and personality.One boss ran away from me, which I didn't expect and it made me laugh. Then when I chased them down, they transformed, we fought, and they ran away again! This time though, they ripped a huge bell from some scenery to mash me with during the third and final phase of the battle - brilliant, unexpected stuff. Another boss housed in a mausoleum unexpectedly summoned the spirit of their lover from a different mausoleum to help them, then when I went to the other mausoleum, the boss there did the same thing in reverse. Connection, story - something to help the encounters stick in the memory rather than drift by in the endless flow of combat. Look at that skill tree! | Image credit: Eurogamer / Grinding Gear Games There's charm even in the rote enemies who shamble around the in-between parts of the game. I'm currently very fond of a gangly enemy in the graveyard area who lugs around a huge stone plinth, or tombstone, to whack me with. I can feel the effort involved as they drag it across the grassy lawn, churning up the earth. Elsewhere, there are cultists and hags and rabid dogs and spiny burrowing creatures - it's a varied menagerie you're confronted with and I like how they all fit with the dark tone of the game. And while I have absolutely no idea what's going on in the story - I'm not ashamed to admit it! - I've grown genuinely intrigued by the characters I've met in the game. They're unassuming and gently handled so as not to interrupt you or grandstand you with exposition. Instead, it's bit by bit - they inch into view, with an elegance and sorrow I really admire, which feels like a strange thing to say. It all speaks to an expertise and confidence I think you can feel pulsing through the experience, even early on. The depth is still dizzying - you need only tab through the active-ability lists to see how many are available to you. As a monk, I'm not bound only to quarterstaff abilities - I can venture into spells just as easily, or other kinds of weaponry, doubling or tripling (or more) my possibilities. And the passive skill list is as outrageously extravagant as it ever was in the first game; it will make your eyes pop the first time you see it. It's so large it doesn't fit onto one screen, even zoomed right out - there must be several hundred passive skills there. For a theorycrafter such as I like to think I am, it's heaven. Image credit: Eurogamer / Grinding Gear Games What impresses me more about the approach to abilities in the game is the way Path of Exile 2 wants me to use all of them in overlapping ways. There's no waste, so to speak, no superfluous thing. I was just adding abilities willy-nilly to begin with, only to realise later they all work, in some small way, together. A palm-strike attack will kill an enemy who is glowing blue, for instance, but it will also steal essence that will power up another ability elsewhere. They're little things to keep you active, keep you leant forwards, and stop you drifting away - to stop this becoming a kind of Cookie Clicker experience.This is a long way of saying that initially, I'm very impressed. Path of Exile 2 is flexing its blockbuster chops here, and showing it's worthy of all the expectation heaped upon it, and capable of confronting the biggest action RPG titans head-on. Of course, there's much more to unpack here, and much more to see - which I'll be digging into next week with a more fully-formed early access review. But I already feel confident in saying that if you've ever been on the fence about Path of Exile, umming and ahhing about whether to jump in, then your opportunity has come. A copy of Path of Exile 2 was provided for review by developer Grinding Gear Games.",
  "image": "https://assetsio.gnwcdn.com/pathofexile2_guide_classes_header.png?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/pathofexile2_guide_classes_header.png?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/pathofexile2_guide_classes_header.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile2_guide_classes_header.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile2_guide_classes_header.png?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"A screenshot showing the Path of Exile 2 Warbringer class\" width=\"690\" height=\"388\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eGrinding Gear Games\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n  \n\n  \n\n\n            \u003cp\u003eAs much as \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/path-of-exile\"\u003ePath of Exile\u003c/a\u003e 1 was lauded for its seemingly bottomless character customisation and its ability to keep voracious action role-playing game players fed, mentally, for months on end, there was no denying it could be a pain to get into. Playing it could feel like giving someone made entirely of elbows a hug. You\u0026#39;d get used to it in time - you\u0026#39;d even come to find the feeling comforting - but there\u0026#39;s no question the series could use an update. Path of Exile 1 is over a decade old; it\u0026#39;s time for something new.\u003c/p\u003e\n\n\u003cp\u003eThat something - \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/path-of-exile-2\"\u003ePath of Exile 2\u003c/a\u003e - is finally here, at least in early access, and understandably there\u0026#39;s tremendous excitement for it. A decade of success has turned its predecessor from being a nobody to a title contender. But where there\u0026#39;s increased excitement, there\u0026#39;s also increased expectations, and the sequel will be measured by a different yardstick - a \u003ca data-keyword=\"true\" href=\"https://www.eurogamer.net/games/diablo-iv\"\u003eDiablo 4\u003c/a\u003e yardstick, perhaps. Say what you will about Diablo\u0026#39;s merits, but its production values and new player onboarding are second to none. Will Path of Exile 2 compete?\u003c/p\u003e\n\u003cp\u003eSpoiler, yes, but a quick caveat: this \u003cem\u003eis\u003c/em\u003e an early access release so Path of Exile 2 isn\u0026#39;t finished, and Grinding Gear Games has said it will take at least six more months of development to finish it, if not more (these things usually end up taking longer than expected). Nevertheless, this is far from a sketchy early access release. The experience I\u0026#39;ve had, albeit on quiet, press-intended pre-release servers - which have now been wiped \u003ca href=\"https://www.eurogamer.net/path-of-exile-2-director-warns-of-queues-this-weekend-due-to-over-a-million-early-access-players\"\u003eas Grinding Gear prepares for the public early access stampede\u003c/a\u003e - has been rock solid. There were a couple of inexplicable quits-to-desktop, but they were tiny hiccups in what has otherwise been a smooth and sturdy experience (though we\u0026#39;ll have to wait and see how the public servers fare over the weekend to see if this sentiment holds true).\u003c/p\u003e\n\u003cfigure\u003e\n\u003cdiv\u003e\n\u003ca aria-label=\"Path of Exile 2: Early Access Gameplay Trailer\" data-lightbox=\"false\" data-platform=\"youtube\" href=\"https://www.youtube.com/embed/0VZsq_vJjGk?autoplay=1\" onclick=\"((e) =\u0026gt; { e.preventDefault(); e.currentTarget.closest(\u0026#39;.video_wrapper\u0026#39;).innerHTML = e.currentTarget.querySelector(\u0026#39;template\u0026#39;).innerHTML; enableElements(); })(event)\" title=\"Click to play video from YouTube\"\u003e\n\u003cimg alt=\"Cover image for YouTube video\" loading=\"lazy\" src=\"https://i.ytimg.com/vi/0VZsq_vJjGk/hqdefault.jpg\"/\u003e\u003cspan\u003ePath of Exile 2: Early Access Gameplay Trailer\u003c/span\u003e\n\u003ctemplate\u003e\n\u003ciframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" data-src=\"https://www.youtube.com/embed/0VZsq_vJjGk?autoplay=1\" frameborder=\"0\" loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/0VZsq_vJjGk?autoplay=1\"\u003e\n\u003c/iframe\u003e \u003c/template\u003e\n\u003c/a\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003eThe early access release trailer for Path of Exile 2. There\u0026#39;s an understated beauty to it. \u003ca href=\"https://www.youtube.com/watch?v=0VZsq_vJjGk\" rel=\"noopener\" target=\"_blank\"\u003eWatch on YouTube\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThose elbows of Path of Exile 1 are broadly gone - or they\u0026#39;re so soft now it\u0026#39;s more like hugging a lumpy duvet than an elbowy... goblin. The game plays much more like you\u0026#39;d expect a modern game to: you move with WASD keys and mouse-around to aim, and there\u0026#39;s full controller support, though it\u0026#39;s still not seamless switching between the two - you still need to quit out to the main menu to alternate. Similarly, the game\u0026#39;s more unusual systems remain, such as the way abilities belong to equipment rather than the character. But they\u0026#39;re much better organised now so it\u0026#39;s clearer how they work and what you\u0026#39;ve got to do. The onboarding is smoother, too, and while I\u0026#39;m sure there\u0026#39;s another onboarding pass to do before the game\u0026#39;s full release, it\u0026#39;s already welcoming enough should you be intrigued to give it a go (we have \u003ca href=\"https://www.eurogamer.net/path-of-exile-2-beginners-guide-tips-tricks\"\u003esome Path of Exile 2 tips\u003c/a\u003e to help you if you do).\u003c/p\u003e\u003cp\u003eIt helps that the game looks very smart now, of course - you can really feel the additional money and time and people Grinding Gear Games has had available while making the sequel. Environments and characters are rich with detail, and the animation is superb. It\u0026#39;s in little touches that you feel it, like freezing someone and seeing spokes of ice form behind them - as if underlining the momentum of the blast, a bit like seeing a wave frozen in extreme weather. Or it\u0026#39;s in moments of well-observed movement, such as when my monk dashes forwards, palm outstretched, to steal living essence from floundering foes - smack! There\u0026#39;s heft behind each blow, crunch and connection, and I love that as a player - the moment to moment feel of Path of Exile 2 is great. Luxurious. Expensive.\u003c/p\u003e\n\u003cfigure data-count=\"3\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_boss_1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_boss_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_boss_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_boss_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_camp_1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_camp_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_camp_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_camp_1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_dead.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_dead.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_dead.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_dead.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003eLook, it\u0026#39;s hard to take screenshots and play the game, OK? | \u003cspan\u003eImage credit: \u003ccite\u003eEurogamer / Grinding Gear Games\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eIt\u0026#39;s this framework that provides the ideal platform for the game\u0026#39;s best stuff - the series\u0026#39; best stuff - to come through. Path of Exile is known for challenging players - it\u0026#39;s not unlike the Souls series in that regard - and the sequel revels in this. Even in the game\u0026#39;s opening areas, packs of enemies are quick to surround you and take you down if you underestimate them - or if you overestimate yourself. Similarly, bosses are tough and uncompromising. Again, even as soon as the first boss you meet, you\u0026#39;ll be given a tough lesson in dodge-rolling and attack-pattern recognition - a lesson in \u0026#39;this is how the game does bosses\u0026#39;. But there\u0026#39;s more to it than just unflinching difficulty: there\u0026#39;s a sense of pleasure in the challenge, both on your side and the developer\u0026#39;s. Enemy composition probes \u003cem\u003eyour\u003c/em\u003e composition, looking for weaknesses and gaps, and bosses are the game\u0026#39;s centrepieces, chock full of imagination and personality.\u003c/p\u003e\u003cp\u003eOne boss ran away from me, which I didn\u0026#39;t expect and it made me laugh. Then when I chased them down, they transformed, we fought, and they ran away again! This time though, they ripped a huge bell from some scenery to mash me with during the third and final phase of the battle - brilliant, unexpected stuff. Another boss housed in a mausoleum unexpectedly summoned the spirit of their lover from a \u003cem\u003edifferent\u003c/em\u003e mausoleum to help them, then when I went to the \u003cem\u003eother \u003c/em\u003emausoleum, the boss there did the same thing in reverse. Connection, story - something to help the encounters stick in the memory rather than drift by in the endless flow of combat.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_passives.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_passives.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_passives.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_passives.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eLook at that skill tree! | \u003cspan\u003eImage credit: \u003ccite\u003eEurogamer / Grinding Gear Games\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThere\u0026#39;s charm even in the rote enemies who shamble around the in-between parts of the game. I\u0026#39;m currently very fond of a gangly enemy in the graveyard area who lugs around a huge stone plinth, or tombstone, to whack me with. I can feel the effort involved as they drag it across the grassy lawn, churning up the earth. Elsewhere, there are cultists and hags and rabid dogs and spiny burrowing creatures - it\u0026#39;s a varied menagerie you\u0026#39;re confronted with and I like how they all fit with the dark tone of the game. And while I have absolutely no idea what\u0026#39;s going on in the story - I\u0026#39;m not ashamed to admit it! - I\u0026#39;ve grown genuinely intrigued by the characters I\u0026#39;ve met in the game. They\u0026#39;re unassuming and gently handled so as not to interrupt you or grandstand you with exposition. Instead, it\u0026#39;s bit by bit - they inch into view, with an elegance and sorrow I really admire, which feels like a strange thing to say. It all speaks to an expertise and confidence I think you can feel pulsing through the experience, even early on.\u003c/p\u003e\n\u003cp\u003eThe depth is still dizzying - you need only tab through the active-ability lists to see how many are available to you. As a monk, I\u0026#39;m not bound only to quarterstaff abilities - I can venture into spells just as easily, or other kinds of weaponry, doubling or tripling (or more) my possibilities. And the passive skill list is as outrageously extravagant as it ever was in the first game; it will make your eyes pop the first time you see it. It\u0026#39;s so large it doesn\u0026#39;t fit onto one screen, even zoomed right out - there must be several hundred passive skills there. For a theorycrafter such as I like to think I am, it\u0026#39;s heaven.\u003c/p\u003e\n\u003cfigure data-count=\"3\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_map.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_map.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_map.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_map.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_orange.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_orange.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_orange.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_orange.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/pathofexile_ritual.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/pathofexile_ritual.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/pathofexile_ritual.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/pathofexile_ritual.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eEurogamer / Grinding Gear Games\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eWhat impresses me more about the approach to abilities in the game is the way Path of Exile 2 wants me to use all of them in overlapping ways. There\u0026#39;s no waste, so to speak, no superfluous thing. I was just adding abilities willy-nilly to begin with, only to realise later they all work, in some small way, together. A palm-strike attack will kill an enemy who is glowing blue, for instance, but it will also steal essence that will power up another ability elsewhere. They\u0026#39;re little things to keep you active, keep you leant forwards, and stop you drifting away - to stop this becoming a kind of Cookie Clicker experience.\u003c/p\u003e\u003cp\u003eThis is a long way of saying that initially, I\u0026#39;m very impressed. Path of Exile 2 is flexing its blockbuster chops here, and showing it\u0026#39;s worthy of all the expectation heaped upon it, and capable of confronting the biggest action RPG titans head-on. Of course, there\u0026#39;s much more to unpack here, and much more to see - which I\u0026#39;ll be digging into next week with a more fully-formed early access review. But I already feel confident in saying that if you\u0026#39;ve ever been on the fence about Path of Exile, umming and ahhing about whether to jump in, then your opportunity has come.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA copy of Path of Exile 2 was provided for review by developer Grinding Gear Games.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-12-06T19:00:00Z",
  "modifiedTime": null
}
