{
  "id": "e3a83303-9ed3-456d-a164-bdfe2f76d122",
  "title": "Space Engineers 2 early access review: a solid and solitary box of building blocks - yet not much else",
  "link": "https://www.rockpapershotgun.com/space-engineers-2-early-access-review-a-solid-and-solitary-box-of-building-blocks-yet-not-much-else",
  "description": "It's easy to feel pride when you're flying through space at 1000 metres per second. \"Look at my spaceship go,\" you say to yourself, \"look how fast it crashes into that other, smaller ship.\" Building your own galactic snowpiercer from scratch in Space Engineers 2 will bring a smile to anyone who once revelled in clicking together Lego podracers and bashing them into one another on the living room carpet with a violence eight-year-olds should not yet have mental access to. That said, this is the precise extent of the things you can do in the game so far. Build 'n' crash. Every feature fits in this opening paragraph. There's good reason to trust the developers' ability to deliver the rest of this crafting and survival game. But right now, it's all core, no loop. Read more",
  "author": "Brendan Caldwell",
  "published": "Wed, 29 Jan 2025 17:32:58 +0000",
  "source": "http://feeds.feedburner.com/RockPaperShotgun",
  "categories": [
    "Science Fiction",
    "Space Engineers 2",
    "early access",
    "Space Combat",
    "Sandbox",
    "Exploration",
    "Survival \u0026 Crafting",
    "Wot I Think",
    "Keen Software House",
    "Shooter: First Person",
    "PC"
  ],
  "byline": "Brendan Caldwell",
  "length": 7297,
  "excerpt": "Returning players will find a bare bones sci-fi builder with a strong foundation. But everything else that makes Space Engineers shine is still missing.",
  "siteName": "Rock Paper Shotgun",
  "favicon": "https://www.rockpapershotgun.com/static/2746dea261aa73fea7106ec055d8a106/icon/apple-touch-icon.png",
  "text": "Image credit: Rock Paper Shotgun / Keen Software House It's easy to feel pride when you're flying through space at 1000 metres per second. \"Look at my spaceship go,\" you say to yourself, \"look how fast it crashes into that other, smaller ship.\" Building your own galactic snowpiercer from scratch in Space Engineers 2 will bring a smile to anyone who once revelled in clicking together Lego podracers and bashing them into one another on the living room carpet with a violence eight-year-olds should not yet have mental access to. That said, this is the precise extent of the things you can do in the game so far. Build 'n' crash. Every feature fits in this opening paragraph. There's good reason to trust the developers' ability to deliver the rest of this crafting and survival game. But right now, it's all core, no loop. It's a very sturdy core, I should say. You are let loose in an asteroid-littered realm of space, where a neat selection of example ships are docked around space stations or floating freely between the big floating rock worlds. You'll jetpack around, explore the stations, and probably very quickly clamber through the corridors of the bigger vessels to find the cockpit. Once behind the joystick of a big cruiser, it's hard to resist the trademark act of the game's marketing - driving extremely fast into another ship and watching the metal crumple like an empty can of Fanta under a fat donkey's hoof. Image credit: Rock Paper Shotgun / Keen Software House Of course, destroying someone else's sandcastle is never really as much fun as bulldozing your own. Creating ships is a matter of flipping through the toolbar and plopping blocks of light or heavy armour into existence to create a frame. Then adding the necessary thrusters, cockpit, and gyroscope to make the ship functional. All of these items are sitting in your spacesuit's magic hands, an infinite supply of aluminium rectangles and jagged triangular edges. The game is exclusively in \"creative mode\" for now, so there's no ore mining or material refining to be done. Just building.There's also no tutorial for how to go about that. You'll have to regularly dip in and out of the help menus to figure out the many keyboard shortcuts that'll let you build with any sense of competence. It's a bit overwhelming at first. Especially if, like me, you're coming to this with no experience of Space Engineers. But it eventually clicks (literally) once you cycle through the library of pieces with the hungry concentration of a chimp looking for termites in his buddy's hair. Soon, you understand the importance of holding Ctrl to precisely align blocks along a handy grid. You discover the helpful \"symmetry\" plane that cuts your work in half. And being able to create pre-fabs is a straightforward (if sometimes fiddly) process of dragging boxes around anything you want to copy, then pasting it somewhere and saving it as a \"blueprint\". Within an hour or two, the building process itself felt surprisingly intuitive and snappy. Image credit: Rock Paper Shotgun / Keen Software House There is some friction. The \"undo\" and \"redo\" function that the developers cite as a revolutionary new feature has its limits, for example - you'll sometimes delete a block accidentally and try to undo it only to see an error message saying this time it's impossible, without really explaining why. Undoing errant paint gun sprays is also a no-go (although the devs say they already have this working internally, so it should be implemented soon). And it's hard to see how some pieces are meant to fit together. The window pane pieces, for example, don't allow as much modular freedom as I'd hoped. In short, it's a bare bones creative sandbox, but the bones are strong and healthy. It is equally a place of directionless wandering and playful experimentation. You have meters for health, power, oxygen, and fuel - but no need to keep them in check yet. You can build cool-looking refineries, med bays, and cargo containers - but there is no way to meaningfully use any of them. You can crash the ship and rush dramatically to shut down the reactor! But actually, it makes no difference. Ships don't need a power source yet. Image credit: Rock Paper Shotgun / Keen Software House That makes this currently feel like a £25 building block toy, rather than a goal-oriented game. It's a very cool toy, admittedly. I made two ships. The first was a mean-looking drag racer, with waspy colours and spikey fins (the unconscious influence of a childhood playing Wipeout). The second ship was more nautical - an interstellar catamaran complete with solar sail. The giant freighter-class thruster that I ill-advisedly strapped to the arse means this machine gets to 1000m/s in a fearfully short burst. I even added a little crow's nest up the mast, but installed the seat at a jaunty angle. This being space, there's no problem with the crew mate up there being sideways. Except you won't have a crew mate for a while. Multiplayer hasn't been added yet, and won't come along until after a sizeable number of updates, including the addition of planets, volumetric water, modding tools, and Steam workshop support. Judging by the developer's reliable history of updates and DLC for the first Space Engineers (a game RPS liked enough to play co-operatively for many months), there's good reason to look forward to all of that. Image credit: Rock Paper Shotgun / Keen Software House But it's not here yet, that's all. For those craving the direction and impetus of survival meter bars, the inspiration of co-op craftinating, or the sweet crunch of constructing factories of ever-more-efficient automation - this minimal alpha won't give you an ounce of what you're after. But if approached as if the only adult in the house has upturned a box of colourful bricks onto the floor and gone out to the pub for an hour, you can spend that time quite happily coming up with your own building projects. Design a torus-shaped holiday resort above the asteroid on the end of a big needle. Cobble together a spacefighter that looks like an annoyed squid. Paint absolutely everything an aggressive Martian red. As a newcomer to the series, it's hard to know if someone craving more Space Engineers will be excited by the birth of a new but familiar playground, or if they'll be disappointed by the relative lack of things to do. Keen Software House have a ton of catching up to do before the sequel can rival its own predecessor in sheer variety. This is a common problem for creative games with long lifespans (it took a while for Crusader Kings 3 to properly appeal to me, just because it seemed like CK 2 already did everything I wanted). Sequels that arrive fully formed don't have this problem. But this isn't that. Early access makes blank spaces obvious to long-serving fans, who will rightly look back at the first Space Engineers and observe that it still does ten times as much for roughly half the price. There's good reason to be hopeful that this sequel will become the definitive way to weld together planet-hopping death traps for your pals. But I wouldn't blame any astronauts out there for staying planetside until there's a little more to see.",
  "image": "https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-3.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-3.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-3.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-3.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-3.jpg?width=880\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"The player\u0026#39;s hand reaches out to a sleek yellow space fighter.\" width=\"880\" height=\"495\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n      \u003cfigcaption\u003e\n        \u003cspan\u003e\nImage credit:          \u003ccite\u003eRock Paper Shotgun / Keen Software House\u003c/cite\u003e\n        \u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n  \u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n\n\n            \n\u003cp\u003eIt\u0026#39;s easy to feel pride when you\u0026#39;re flying through space at 1000 metres per second. \u0026#34;Look at my spaceship go,\u0026#34; you say to yourself, \u0026#34;look how fast it crashes into that other, smaller ship.\u0026#34; Building your own galactic snowpiercer from scratch in \u003ca href=\"https://www.rockpapershotgun.com/games/space-engineers-2\"\u003eSpace Engineers 2\u003c/a\u003e will bring a smile to anyone who once revelled in clicking together Lego podracers and bashing them into one another on the living room carpet with a violence eight-year-olds should not yet have mental access to. That said, this is the precise extent of the things you can do in the game so far. Build \u0026#39;n\u0026#39; crash. Every feature fits in this opening paragraph. There\u0026#39;s good reason to trust the developers\u0026#39; ability to deliver the rest of this crafting and survival game. But right now, it\u0026#39;s all core, no loop. \u003c/p\u003e\n\n\u003cp\u003eIt\u0026#39;s a very sturdy core, I should say. You are let loose in an asteroid-littered realm of space, where a neat selection of example ships are docked around space stations or floating freely between the big floating rock worlds. You\u0026#39;ll jetpack around, explore the stations, and probably very quickly clamber through the corridors of the bigger vessels to find the cockpit. Once behind the joystick of a big cruiser, it\u0026#39;s hard to resist the trademark act of the game\u0026#39;s marketing - driving extremely fast into another ship and watching the metal crumple like an empty can of Fanta under a fat donkey\u0026#39;s hoof. \u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-2.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"An astronaut in a blue spacesuit floats and inspects a crashed ship in the distance.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-2.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun / Keen Software House\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eOf course, destroying someone else\u0026#39;s sandcastle is never really as much fun as bulldozing your own. Creating ships is a matter of flipping through the toolbar and plopping blocks of light or heavy armour into existence to create a frame. Then adding the necessary thrusters, cockpit, and gyroscope to make the ship functional. All of these items are sitting in your spacesuit\u0026#39;s magic hands, an infinite supply of aluminium rectangles and jagged triangular edges. The game is exclusively in \u0026#34;creative mode\u0026#34; for now, so there\u0026#39;s no ore mining or material refining to be done. Just building.\u003c/p\u003e\u003cp\u003eThere\u0026#39;s also no tutorial for how to go about that. You\u0026#39;ll have to regularly dip in and out of the help menus to figure out the many keyboard shortcuts that\u0026#39;ll let you build with any sense of competence. It\u0026#39;s a bit overwhelming at first. Especially if, like me, you\u0026#39;re coming to this with no experience of \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/space-engineers\"\u003eSpace Engineers\u003c/a\u003e. But it eventually clicks (literally) once you cycle through the library of pieces with the hungry concentration of a chimp looking for termites in his buddy\u0026#39;s hair. \u003c/p\u003e\n\u003cp\u003eSoon, you understand the importance of holding Ctrl to precisely align blocks along a handy grid. You discover the helpful \u0026#34;symmetry\u0026#34; plane that cuts your work in half. And being able to create pre-fabs is a straightforward (if sometimes fiddly) process of dragging boxes around anything you want to copy, then pasting it somewhere and saving it as a \u0026#34;blueprint\u0026#34;. Within an hour or two, the building process itself felt surprisingly intuitive and snappy. \u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-7.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A blue astronaut floats with dangling legs out toward a red ship.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-7.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun / Keen Software House\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThere is some friction. The \u0026#34;undo\u0026#34; and \u0026#34;redo\u0026#34; function that the developers cite as a revolutionary new feature has its limits, for example - you\u0026#39;ll sometimes delete a block accidentally and try to undo it only to see an error message saying this time it\u0026#39;s impossible, without really explaining why. Undoing errant paint gun sprays is also a no-go (although the devs say they already have this working internally, so it should be implemented soon). And it\u0026#39;s hard to see how some pieces are meant to fit together. The window pane pieces, for example, don\u0026#39;t allow as much modular freedom as I\u0026#39;d hoped. \u003c/p\u003e\u003cp\u003eIn short, it\u0026#39;s a bare bones creative sandbox, but the bones are strong and healthy. It is equally  a place of directionless wandering and playful experimentation. You have meters for health, power, oxygen, and fuel - but no need to keep them in check yet. You can build cool-looking refineries, med bays, and cargo containers - but there is no way to meaningfully use any of them. You can crash the ship and rush dramatically to shut down the reactor! But actually, it makes no difference. Ships don\u0026#39;t need a power source yet. \u003c/p\u003e\n\u003cfigure data-count=\"4\" role=\"group\"\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-6.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A green space station nestled into the rocks of an asteroid.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-6.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-5.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A red space vessel crashes heavily into a docking platform, striking another big blue ship in the impact.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-5.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-4.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A huge red freighter tumbles towards the player in space.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-4.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"A set of spacecraft float in front of an asteroid.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-1.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003c/figure\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun / Keen Software House\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThat makes this currently feel like a £25 building block toy, rather than a goal-oriented game. It\u0026#39;s a very cool toy, admittedly. I made two ships. The first was a mean-looking drag racer, with waspy colours and spikey fins (the unconscious influence of a childhood playing Wipeout). The second ship was more nautical - an interstellar catamaran complete with solar sail. The giant freighter-class thruster that I ill-advisedly strapped to the arse means this machine gets to 1000m/s in a fearfully short burst. I even added a little crow\u0026#39;s nest up the mast, but installed the seat at a jaunty angle. This being space, there\u0026#39;s no problem with the crew mate up there being sideways. \u003c/p\u003e\u003cp\u003eExcept you won\u0026#39;t have a crew mate for a while. Multiplayer hasn\u0026#39;t been added yet, and won\u0026#39;t come along until after a sizeable number of updates, including the addition of planets, volumetric water, modding tools, and Steam workshop support. Judging by the developer\u0026#39;s reliable history of updates and DLC for the first Space Engineers (a game RPS liked enough \u003ca href=\"https://www.rockpapershotgun.com/space-engineers-diary-part-one-wolves\"\u003eto play co-operatively for many months\u003c/a\u003e), there\u0026#39;s good reason to look forward to all of that. \u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-8.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"Two vessels made by the player float side by side in zero gravity.\" height=\"388\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-8.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-8.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/space-engineers-2-early-access-review-8.jpg?width=690\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003e\u003cspan\u003eImage credit: \u003ccite\u003eRock Paper Shotgun / Keen Software House\u003c/cite\u003e\u003c/span\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eBut it\u0026#39;s not here yet, that\u0026#39;s all. For those craving the direction and impetus of survival meter bars, the inspiration of co-op craftinating, or the sweet crunch of constructing factories of ever-more-efficient automation - this minimal alpha won\u0026#39;t give you an ounce of what you\u0026#39;re after. But if approached as if the only adult in the house has upturned a box of colourful bricks onto the floor and gone out to the pub for an hour, you can spend that time quite happily coming up with your own building projects. Design a torus-shaped holiday resort above the asteroid on the end of a big needle. Cobble together a spacefighter that looks like an annoyed squid. Paint absolutely everything an aggressive Martian red. \u003c/p\u003e\n\u003cp\u003eAs a newcomer to the series, it\u0026#39;s hard to know if someone craving more Space Engineers will be excited by the birth of a new but familiar playground, or if they\u0026#39;ll be disappointed by the relative lack of things to do. Keen Software House have a ton of catching up to do before the sequel can rival its own predecessor in sheer variety. This is a common problem for creative games with long lifespans (it took a while for \u003ca data-keyword=\"true\" href=\"https://www.rockpapershotgun.com/games/crusader-kings-iii\"\u003eCrusader Kings 3\u003c/a\u003e to properly appeal to me, just because it seemed like CK 2 already did everything I wanted). \u003c/p\u003e\u003cp\u003eSequels that arrive fully formed don\u0026#39;t have this problem. But this isn\u0026#39;t that. Early access makes blank spaces obvious to long-serving fans, who will rightly look back at the first Space Engineers and observe that it still does ten times as much for roughly half the price. There\u0026#39;s good reason to be hopeful that this sequel will become the definitive way to weld together planet-hopping death traps for your pals. But I wouldn\u0026#39;t blame any astronauts out there for staying planetside until there\u0026#39;s a little more to see.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-01-29T17:32:58.537944Z",
  "modifiedTime": null
}
