{
  "id": "f1832245-bed8-4313-a069-141bf736cd67",
  "title": "Cambridge Audio Melomania P100 review: A genuine disruptor",
  "link": "https://www.eurogamer.net/digitalfoundry-2024-cambridge-audio-melomania-p100-review-a-genuine-disruptor",
  "description": "I don't think there's much of a finer example of a 'heritage brand' than Cambridge Audio. Founded in 1968, they've been making fantastic audio kit including amps, record decks and headphones for such a long time, and as such, are a brand I've admired from afar. Their P100s are their first run at wireless, over-ear headphones with noise cancelling, which is as competitive of a market as it gets for audio. Read more",
  "author": "Reece Bithrey",
  "published": "Tue, 17 Dec 2024 19:00:00 +0000",
  "source": "https://www.eurogamer.net/?format=rss",
  "categories": [
    "Cambridge Audio",
    "Android",
    "Mac",
    "Digital Foundry",
    "PC",
    "Headphones",
    "iOS"
  ],
  "byline": "Reece Bithrey",
  "length": 7683,
  "excerpt": "The Cambridge Audio Melomania P100 are a genuine contender for some of the best noise cancelling headphones available at their respectable price tag.",
  "siteName": "Eurogamer.net",
  "favicon": "https://www.eurogamer.net/static/192b8e2df2fe17fa1c2509bcf666765a/icon/apple-touch-icon-152x152.png",
  "text": "Cambridge Audio's first wireless noise cancelling cans are a hit. I don't think there's much of a finer example of a 'heritage brand' than Cambridge Audio. Founded in 1968, they've been making fantastic audio kit including amps, record decks and headphones for such a long time, and as such, are a brand I've admired from afar. Their P100s are their first run at wireless, over-ear headphones with noise cancelling, which is as competitive of a market as it gets for audio. Allow me to explain a bit further - the state of play for wireless noise cancelling headphones in the £200 to £300 price range that Cambridge Audio has targeted has been taken up by the likes of Sony and Bose for several years, with other options from the likes of Sennheiser and Bowers and Wilkins sitting around, too. We have seen more specialist brands and models such as the Focal Bathys and the Mark Levinson No. 5909s enter the fray in recent years, although they've been priced way over what the status quo has been. What the P100s represent therefore is a bit of an anomaly - a specialist hifi brand making a set of more 'affordable' cans to truly take it to Bose and Sony alike. Things are certainly positive as soon as you take the P100s out of their black packaging with a lovely woven fabric hard case for transport that features a neat compartment for braided USB-C to USB-C and USB-C to 3.5mm cables. The case features a small indented Cambridge Audio logo, and little else stylistically. After all, it is just a case. Don't these look clean? Apart from the dust, obviously. With the cans themselves, they carry the same modern, clean lines as a lot of other Cambridge Audio kit does, which looks great. The main arms, yokes and outer portion of the earcups are all aluminium, while the plush earpads are memory foam and vegan leather. It's all very thoughtfully assembled, and helps to make the P100s wonderfully comfortable. A 330g weight isn't abnormal either, while their Goldilocks clamping force makes the P100s a pair of cans that you could wear all day without much trouble. I definitely had no issues in my weeks of use, for travel, or general listening.One small but lovely detail with these cans is the addition of proper, physical controls. For me, having tactile buttons I can click and use is miles better than the myriad of touch controls that the market has become awash with. The left hand earcup contains a power and Bluetooth pairing switch, as well as one for toggling between ANC being on, or off. The right earcup has volume controls, play/pause and skip forwards/backwards. There are voice prompts whenever the left hand buttons are pressed, and in the associated Melomania Connect app, you can change the language of said prompts, including to 'Southwark', which adds in the dulcet tones of Matt Berry. I didn't know I needed Douglas Reynholm telling me about ANC modes, but here we are, and the P100s are all the richer for it. In addition, there is also a proximity sensor inside the P100s that stops whatever you're listening to when you take them off - it's a small detail, but prevents the cans playing to themselves for too long. Connectivity is handled with bang-up-to-date Bluetooth 5.3 LE, and the P100s also support a lovely quantity of codecs. To be specific, it's the usual suspects of SBC, AAC and aptX Adaptive, although there's also aptX Lossless, too. Support for LDAC is absent, though. Pairing over Bluetooth to either my Samsung Galaxy S21 Ultra for some basic Spotify consumption or my FiiO M11S DAP for more critical listening was a doddle. They can also be used wired with the included USB-C to 3.5mm jack, although don't work passively, so you'll need to ensure there's enough juice before you enjoy some wired listening. I do love me some physical controls. Making sure there's enough go-juice inside the P100 is a doddle though, given their fantastic endurance. Without the fun of ANC, they're able to last for a remarkable 100 hours before conking out, while using noise cancellation means you'll be down to zero in 60 hours. With this in mind, that's still some of the best endurance I've seen on a set of wireless cans and takes it to options that cost a fair bit more.There is active noise cancellation, or ANC, on-board, and while it isn't class-leading in the way that Bose's is, it's more than serviceable for most people. The P100s are able to block out most of the noise from around you, while its transparency mode is pleasingly natural. It blocked out most of the horrible noise of the Northern line on a recent London trip, and their Bluetooth signal held up well as I made my way through St Pancras station. No matter how hard the P100s try though, they simply can't beat Bose, but then again, it seems like no one can. Sometimes it's quite hard to quantify how a pair of headphones sounds, as a lot of them have their own character and profile that can skew music one way or another. The first words that comes to mind with the P100s is 'inoffensive'. That's not say they aren't a fun, or engaging listen, because they absolutely are. It's rather to say that they work wonderfully with all sorts of music, and will certainly please generalist folks like myself. The earcups here are also plush, and deep. Everything from the gritty rock on Rush's Working Man to the deep groove on Earth, Wind \u0026 Fire's Let's Groove is presented cleanly. The bottom end on both tracks is prevalent, but not overpowering, and handled wonderfully. There is also a lot of breathing room lended to recordings, as I found when listening to the Bee Gees' Nights On Broadway. The track's clavichord and electric piano work was far off in the distance, but could still be heard with the utmost clarity alongside the excellent vocals and synth bass line.Nights On Broadway also demonstrated a top-end that lacked harshness, with its prominent cymbal work before Barry Gibb's mellow vocal on the bridge. The P100s handled it wonderfully, as they did the constant bell hits on Ralph MacDonald's Calypso Breakdown, which felt precise and crisp. The mid-range presentation that the P100 is slick, as demonstrated on tracks such as Never Known from Jack Johnson and Gordon Lightfoot's Rainy Day People. Vocals are handled with panache and come across with wonderful consistency. In addition, James Taylor's September Grass was presented with a wonderful warmth to his fingerstyle guitar and a smooth, clean vocal. It's just lovely. The headband distributes weight nicely. A great section of music I've often used for testing headphones is the 'Discovery' section of Rush's epic 20-minute 2112 suite, given its slow build from limited electric guitar parts with ambient water noise into intermittent vocals and even harder rock when moving into the 'Presentation' and 'Oracle: The Dream' sections. The P100s served up a result that was wide and well-balanced, with a robust low end, punchy drums and excellent vocals.This well-balanced audio also helps the P100s to be a decent set of headphones for gaming, especially with a soundstage of reasonable width helping for immersion in everything from Grand Theft Auto to CS2. There is also a low-latency gaming mode available, as selectable in the Melomania Connect app, although there is still some delay when compared against comparably priced top-class gaming headsets. The Cambridge Audio Melomania P100s make for quite an easy recommendation therefore if you're looking for a set of capable wireless noise cancelling cans with engaging audio, a comfortable fit, and versatile connectivity. They hit all the right notes in my eyes.",
  "image": "https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=1200\u0026height=630\u0026fit=crop\u0026enable=upscale\u0026auto=webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"article-header\"\u003e\n  \n\n    \u003cdiv\u003e\n        \n\n        \u003cp\u003eCambridge Audio\u0026#39;s first wireless noise cancelling cans are a hit.\u003c/p\u003e\n\n    \u003c/div\u003e\n\n\n  \u003cdiv\u003e\n  \u003cfigure\u003e\n  \u003ca href=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\" data-lightbox=\"true\"\u003e\n  \u003cimg src=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-1.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" loading=\"eager\" alt=\"\" width=\"690\" height=\"387\" fetchpriority=\"high\"/\u003e\n  \u003c/a\u003e\n\n  \u003c/figure\u003e\n  \u003c/div\u003e\n\n    \n\n\u003c/div\u003e\u003cdiv data-component=\"article-content\"\u003e\n\n  \n\n  \n\n\n            \u003cp\u003eI don\u0026#39;t think there\u0026#39;s much of a finer example of a \u0026#39;heritage brand\u0026#39; than Cambridge Audio. Founded in 1968, they\u0026#39;ve been making fantastic audio kit including amps, record decks and headphones for such a long time, and as such, are a brand I\u0026#39;ve admired from afar. Their P100s are their first run at wireless, over-ear headphones with noise cancelling, which is as competitive of a market as it gets for audio.\u003c/p\u003e\n\u003cp\u003eAllow me to explain a bit further - the state of play for wireless noise cancelling headphones in the £200 to £300 price range that Cambridge Audio has targeted has been taken up by the likes of Sony and Bose for several years, with other options from the likes of Sennheiser and Bowers and Wilkins sitting around, too. We have seen more specialist brands and models such as the \u003ca href=\"https://www.eurogamer.net/digitalfoundry-2023-focal-bathys-review-sublime-audio-and-a-whole-lotta-style\"\u003eFocal Bathys\u003c/a\u003e and the Mark Levinson No. 5909s enter the fray in recent years, although they\u0026#39;ve been priced way over what the status quo has been. What the P100s represent therefore is a bit of an anomaly - a specialist hifi brand making a set of more \u0026#39;affordable\u0026#39; cans to truly take it to Bose and Sony alike.\u003c/p\u003e\n\u003cp\u003eThings are certainly positive as soon as you take the P100s out of their black packaging with  a lovely woven fabric hard case for transport that features a neat compartment for braided USB-C to USB-C and USB-C to 3.5mm cables. The case features a small indented Cambridge Audio logo, and little else stylistically. After all, it is just a case.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-3.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"387\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-3.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-3.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-3.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eDon\u0026#39;t these look clean? Apart from the dust, obviously. \u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eWith the cans themselves, they carry the same modern, clean lines as a lot of other Cambridge Audio kit does, which looks great. The main arms, yokes and outer portion of the earcups are all aluminium, while the plush earpads are memory foam and vegan leather. It\u0026#39;s all very thoughtfully assembled, and helps to make the P100s wonderfully comfortable. A 330g weight isn\u0026#39;t abnormal either, while their Goldilocks clamping force makes the P100s a pair of cans that you could wear all day without much trouble. I definitely had no issues in my weeks of use, for travel, or general listening.\u003c/p\u003e\u003cp\u003eOne small but lovely detail with these cans is the addition of proper, physical controls. For me, having tactile buttons I can click and use is miles better than the myriad of touch controls that the market has become awash with. The left hand earcup contains a power and Bluetooth pairing switch, as well as one for toggling between ANC being on, or off. The right earcup has volume controls, play/pause and skip forwards/backwards. There are voice prompts whenever the left hand buttons are pressed, and in the associated Melomania Connect app, you can change the language of said prompts, including to \u0026#39;Southwark\u0026#39;, which adds in the dulcet tones of Matt Berry. I didn\u0026#39;t know I needed Douglas Reynholm telling me about ANC modes, but here we are, and the P100s are all the richer for it. In addition, there is also a proximity sensor inside the P100s that stops whatever you\u0026#39;re listening to when you take them off - it\u0026#39;s a small detail, but prevents the cans playing to themselves for too long.\u003c/p\u003e\n\u003cp\u003eConnectivity is handled with bang-up-to-date Bluetooth 5.3 LE, and the P100s also support a lovely quantity of codecs. To be specific, it\u0026#39;s the usual suspects of SBC, AAC and aptX Adaptive, although there\u0026#39;s also aptX Lossless, too. Support for LDAC is absent, though. Pairing over Bluetooth to either my Samsung Galaxy S21 Ultra for some basic Spotify consumption or my FiiO M11S DAP for more critical listening was a doddle. They can also be used wired with the included USB-C to 3.5mm jack, although don\u0026#39;t work passively, so you\u0026#39;ll need to ensure there\u0026#39;s enough juice before you enjoy some wired listening.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-10.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"387\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-10.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-10.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-10.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eI do love me some physical controls.\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eMaking sure there\u0026#39;s enough go-juice inside the P100 is a doddle though, given their fantastic endurance. Without the fun of ANC, they\u0026#39;re able to last for a remarkable 100 hours before conking out, while using noise cancellation means you\u0026#39;ll be down to zero in 60 hours. With this in mind, that\u0026#39;s still some of the best endurance I\u0026#39;ve seen on a set of wireless cans and takes it to options that cost a fair bit more.\u003c/p\u003e\u003cp\u003eThere is active noise cancellation, or ANC, on-board, and while it isn\u0026#39;t class-leading in the way that Bose\u0026#39;s is, it\u0026#39;s more than serviceable for most people. The P100s are able to block out most of the noise from around you, while its transparency mode is pleasingly natural. It blocked out most of the horrible noise of the Northern line on a recent London trip, and their Bluetooth signal held up well as I made my way through St Pancras station. No matter how hard the P100s try though, they simply can\u0026#39;t beat Bose, but then again, it seems like no one can.\u003c/p\u003e\n\u003cp\u003eSometimes it\u0026#39;s quite hard to quantify how a pair of headphones sounds, as a lot of them have their own character and profile that can skew music one way or another. The first words that comes to mind with the P100s is \u0026#39;inoffensive\u0026#39;. That\u0026#39;s not say they aren\u0026#39;t a fun, or engaging listen, because they absolutely are. It\u0026#39;s rather to say that they work wonderfully with all sorts of music, and will certainly please generalist folks like myself.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-8.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"387\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-8.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-8.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-8.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eThe earcups here are also plush, and deep.\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eEverything from the gritty rock on Rush\u0026#39;s Working Man to the deep groove on Earth, Wind \u0026amp; Fire\u0026#39;s Let\u0026#39;s Groove is presented cleanly. The bottom end on both tracks is prevalent, but not overpowering, and handled wonderfully. There is also a lot of breathing room lended to recordings, as I found when listening to the Bee Gees\u0026#39; Nights On Broadway. The track\u0026#39;s clavichord and electric piano work was far off in the distance, but could still be heard with the utmost clarity alongside the excellent vocals and synth bass line.\u003c/p\u003e\u003cp\u003eNights On Broadway also demonstrated a top-end that lacked harshness, with its prominent cymbal work before Barry Gibb\u0026#39;s mellow vocal on the bridge. The P100s handled it wonderfully, as they did the constant bell hits on Ralph MacDonald\u0026#39;s Calypso Breakdown, which felt precise and crisp.\u003c/p\u003e\n\u003cp\u003eThe mid-range presentation that the P100 is slick, as demonstrated on tracks such as Never Known from Jack Johnson and Gordon Lightfoot\u0026#39;s Rainy Day People. Vocals are handled with panache and come across with wonderful consistency. In addition,  James Taylor\u0026#39;s September Grass was presented with a wonderful warmth to his fingerstyle guitar and a smooth, clean vocal. It\u0026#39;s just lovely.\u003c/p\u003e\n\u003cfigure\u003e\n\u003ca data-lightbox=\"true\" href=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-4.jpg?width=1920\u0026amp;height=1920\u0026amp;fit=bounds\u0026amp;quality=80\u0026amp;format=jpg\u0026amp;auto=webp\" target=\"_blank\"\u003e\n\u003cimg alt=\"\" height=\"387\" loading=\"lazy\" src=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-4.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp\" srcset=\"https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-4.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;auto=webp 1x, https://assetsio.gnwcdn.com/Cambridge-Audio-Melomania-P100-4.jpg?width=690\u0026amp;quality=75\u0026amp;format=jpg\u0026amp;dpr=2\u0026amp;auto=webp 2x\" width=\"690\"/\u003e \u003c/a\u003e\n\u003cfigcaption\u003eThe headband distributes weight nicely.\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eA great section of music I\u0026#39;ve often used for testing headphones is the \u0026#39;Discovery\u0026#39; section of Rush\u0026#39;s epic 20-minute 2112 suite, given its slow build from limited electric guitar parts with ambient water noise into intermittent vocals and even harder rock when moving into the \u0026#39;Presentation\u0026#39; and \u0026#39;Oracle: The Dream\u0026#39; sections. The P100s served up a result that was wide and well-balanced, with a robust low end, punchy drums and excellent vocals.\u003c/p\u003e\u003cp\u003eThis well-balanced audio also helps the P100s to be a decent set of headphones for gaming, especially with a soundstage of reasonable width helping for immersion in everything from Grand Theft Auto to CS2. There is also a low-latency gaming mode available, as selectable in the Melomania Connect app, although there is still some delay when compared against comparably priced top-class gaming headsets.\u003c/p\u003e\n\u003cp\u003eThe Cambridge Audio Melomania P100s make for quite an easy recommendation therefore if you\u0026#39;re looking for a set of capable wireless noise cancelling cans with engaging audio, a comfortable fit, and versatile connectivity. They hit all the right notes in my eyes.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-17T19:00:00Z",
  "modifiedTime": null
}
