{
  "id": "ffc0cf23-8dea-4906-9105-26802e13f138",
  "title": "Age of Empires and The Louvre Bring the Mamlouks to Life in First-ever Collaboration",
  "link": "https://www.ageofempires.com/news/age-of-empires-becomes-the-louvres-first-gaming-partnership/#new_tab",
  "description": "The post Age of Empires and The Louvre Bring the Mamlouks to Life in First-ever Collaboration appeared first on Xbox Wire.",
  "author": "Joe Skrebels, Xbox Wire Editor-in-Chief",
  "published": "Tue, 10 Jun 2025 17:30:00 +0000",
  "source": "https://majornelson.com/feed/",
  "categories": [
    "Games"
  ],
  "byline": "Emma Bridle",
  "length": 5295,
  "excerpt": "With a shared passion for history at its heart, this collaboration between Age of Empires and the Louvre serves to share the story of the Mamluks to people",
  "siteName": "Age of Empires / World's Edge Studio",
  "favicon": "",
  "text": "June 10, 2025 Today we are thrilled to announce that Age of Empires is partnering with the world’s most-visited museum, the Louvre in Paris! On April 30th, the Louvre launched an exhibition on the Mamluk sultanate (1250-1517), a European first. The exhibition aims to share the story of this golden age of the Islamic Near East, showcasing its breadth and richness, all told from a transregional perspective. The Mamluks appear in three Age of Empires titles and players around the world have discovered their prowess and story through our games since 1999. With a shared passion for history at its heart, this collaboration between Age of Empires and the Louvre serves to share the story of the Mamluks to people around the world and encourage them to learn more about this golden age of medieval history, which isn’t often told. Throughout the month of June, we’ll be collaborating both at the museum in Paris and online. For an overview of our collaboration, check our dedicated webpage. You’ll be able to experience content from the partnership at the museum, on our websites, on social media and via the first ever livestream from the museum, on June 12th, starting at 11:00 AM PT (2:00 PM ET / 18:00 UTC). We are so honored to be working with the Louvre, we share a passion for sharing the stories of history with the world. “World’s Edge is honored to collaborate with Le Louvre. The Age of Empires franchise has been bringing history to life for more than 65 million players around the world for almost 30 years. We’ve always believed in the great potential for our games to spark an interest in history and culture. We often hear of teachers using Age of Empires to teach history to their students and stories from our players about how Age of Empires has driven them to learn more, or even to pursue history academically or as a career. This opportunity to bring the amazing stories of the Mamluks to new audiences through the Louvre’s exhibition is one we’re excited to be a part of. We hope that through the excellent work of the Louvre’s team, the legacy of the Mamluks can be shared around the world, and that people enjoy their stories as they come to life through Age of Empires.” — Michael Mann, Studio Head at World’s Edge The Mamluks in Age of Empires The Mamluks have been an iconic part of the Age of Empires franchise since Age of Empires II (1999). Players today can experience these mighty warriors in Age of Empires II: Definitive Edition, Age of Empires III: Definitive Edition, and in Age of Empires IV (via the best-selling Sultans Ascend DLC). There’s more information about how you can play as the Mamluks in Age games on our partnership webpage. Play as the Mamluks in an All-New Scenario To celebrate the partnership, we’re releasing a brand new custom scenario for Age of Empires II: Definitive Edition on PC, “Ayn Jalut”. Created by World’s Edge Senior Business Manager, and famed Age campaign designer, Ramsey Abdulrahim. In this scenario, you play as Baybars before the pivotal battle when the fate of the Muslim world held in the balance. Prepare your forces, set up your ambushes, and use your cunning and strategy to overcome the Mongol horde. Like the Mamluks, can you be the first to defeat the Mongols? When finished, try again and best your friends for the highest score! The entire world trembled before the Mongols. Rulers of China and Persia, the fearsome horsemen swept through the cities of the Islamic world, leaving ruins. Only Baybars and the Mamluks of Egypt stood in their way. Baybars had gathered an army at Ayn Jalut, the site where the Biblical David slew the giant Goliath. Baybars had been born a thousand miles away, but he knew the Mongols well: they had slaughtered his family and sold him–as a mere boy–into slavery. At Ayn Jalut, he was determined to have his revenge–and slay his own giant. The Mamluks and the Exhibition The Mamluks, freed slave-soldiers of primarily Turkish (and later Caucasian) origin, built their legend on their military prowess. They conquered the last bastions of the Crusaders, fought and repelled the Mongols, survived Timur’s invasions and kept threatening neighbors at bay, before succumbing to Ottoman expansion. The sultanate encompassed a vast territory, including Egypt, Bilad al-Sham (modern day Syria, Lebanon, Israel/Palestine and Jordan), parts of Eastern Anatolia and the Hejaz region of Arabia, which includes Mecca and Medina. The exhibition takes visitors beyond the military legend of the Mamluk sultanate and shows the complex and multi-faceted society they formed. They created a world in which sultans mingled with emirs and rich civil elites, all actively engaging in artistic patronage. Women had active roles in Mamluk society, as well as Christian and Jewish minorities. At the meeting point of Europe, Africa and Asia, people and ideas circulated, as well as arts and trade. The exhibition is an unprecedented opportunity to discover this glorious and yet little-known empire, through a collection of masterpieces from around the world. Visitors will be exposed to a new perspective on medieval Egypt and the Near East. To make sure you can enjoy all the partnership content, make sure you’re following Age of Empires and the Louvre on social media!",
  "image": "https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cimg alt=\"author avatar\" src=\"https://www.gravatar.com/avatar/61c9ea8f26e7767196a23d1310e7d5a5\" height=\"100\" width=\"100\"/\u003e\n\u003c/p\u003e\n\u003cp\u003e\n\u003ctime datetime=\"2025-06-10T16:13:45+00:00\"\u003eJune 10, 2025\u003c/time\u003e\n\u003c/p\u003e\t\n\u003c/div\u003e            \n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080.webp\" alt=\"\" srcset=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080.webp 1920w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-288x162.webp 288w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-1080x608.webp 1080w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-768x432.webp 768w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-1536x864.webp 1536w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-704x396.webp 704w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-854x480.webp 854w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-1813x1020.webp 1813w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-1552x873.webp 1552w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Louvre_Partnership_1920x1080-1600x900.webp 1600w\" sizes=\"auto, (max-width: 1920px) 100vw, 1920px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eToday we are thrilled to announce that \u003cem\u003eAge of Empires\u003c/em\u003e is partnering with the world’s most-visited museum, the Louvre in Paris!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOn April 30\u003csup\u003eth\u003c/sup\u003e\u003c/strong\u003e, the Louvre launched an exhibition on the Mamluk sultanate (1250-1517), a European first. The exhibition aims to share the story of this golden age of the Islamic Near East, showcasing its breadth and richness, all told from a transregional perspective. The Mamluks appear in three \u003cem\u003eAge of Empires\u003c/em\u003e titles and players around the world have discovered their prowess and story through our games since 1999.\u003c/p\u003e\n\u003cp\u003eWith a shared passion for history at its heart, this collaboration between \u003cem\u003eAge of Empires\u003c/em\u003e and the Louvre serves to share the story of the Mamluks to people around the world and encourage them to learn more about this golden age of medieval history, which isn’t often told.\u003c/p\u003e\n\u003cp\u003eThroughout the month of June, we’ll be collaborating both at the museum in Paris and online. For an overview of our collaboration, check our dedicated webpage.\u003c/p\u003e\n\n\n\u003cp\u003eYou’ll be able to experience content from the partnership at the museum, on our websites, on social media and via the \u003cstrong\u003e\u003ca href=\"https://www.twitch.tv/Samueletienne\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efirst ever livestream from the museum, on June 12\u003csup\u003eth\u003c/sup\u003e, starting at 11:00 AM PT (2:00 PM ET / 18:00 UTC).\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are so honored to be working with the Louvre, we share a passion for sharing the stories of history with the world. \u003c/p\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1080\" height=\"753\" src=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-1080x753.webp\" alt=\"\" srcset=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-1080x753.webp 1080w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-288x201.webp 288w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-768x535.webp 768w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-568x396.webp 568w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-689x480.webp 689w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre-1253x873.webp 1253w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamuks_armor_Louvre.webp 1435w\" sizes=\"auto, (max-width: 1080px) 100vw, 1080px\"/\u003e\u003c/figure\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003e“World’s Edge is honored to collaborate with Le Louvre. The Age of Empires franchise has been bringing history to life for more than 65 million players around the world for almost 30 years. We’ve always believed in the great potential for our games to spark an interest in history and culture. We often hear of teachers using Age of Empires to teach history to their students and stories from our players about how Age of Empires has driven them to learn more, or even to pursue history academically or as a career. This opportunity to bring the amazing stories of the Mamluks to new audiences through the Louvre’s exhibition is one we’re excited to be a part of. We hope that through the excellent work of the Louvre’s team, the legacy of the Mamluks can be shared around the world, and that people enjoy their stories as they come to life through Age of Empires\u003c/em\u003e.”\u003c/p\u003e\n\u003cp\u003e— Michael Mann, Studio Head at World’s Edge\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch3\u003eThe Mamluks in Age of Empires\u003c/h3\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1080\" height=\"608\" src=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1080x608.webp\" alt=\"\" srcset=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1080x608.webp 1080w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-288x162.webp 288w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-768x432.webp 768w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1536x864.webp 1536w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-2048x1152.webp 2048w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-704x396.webp 704w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-854x480.webp 854w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1813x1020.webp 1813w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1552x873.webp 1552w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_ageII-III-IV-1600x900.webp 1600w\" sizes=\"auto, (max-width: 1080px) 100vw, 1080px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eThe Mamluks have been an iconic part of the \u003cem\u003eAge of Empires\u003c/em\u003e franchise since \u003cem\u003eAge of Empires II\u003c/em\u003e (1999). Players today can experience these mighty warriors in \u003cem\u003eAge of Empires II: Definitive Edition\u003c/em\u003e, \u003cem\u003eAge of Empires III: Definitive Edition\u003c/em\u003e, and in \u003cem\u003eAge of Empires IV\u003c/em\u003e (via the best-selling \u003cem\u003eSultans Ascend\u003c/em\u003e DLC).\u003c/p\u003e\n\u003cp\u003eThere’s more information about how you can play as the Mamluks in \u003cem\u003eAge\u003c/em\u003e games on our \u003ca href=\"http://www.ageofempires.com/lelouvre\"\u003epartnership webpage\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003ePlay as the Mamluks in an All-New Scenario\u003c/h3\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1080\" height=\"607\" src=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario.webp\" alt=\"\" srcset=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario.webp 1080w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario-288x162.webp 288w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario-768x432.webp 768w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario-705x396.webp 705w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Ayn-Jalut-scenario-854x480.webp 854w\" sizes=\"auto, (max-width: 1080px) 100vw, 1080px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eTo celebrate the partnership, we’re releasing a brand new custom scenario for \u003cem\u003eAge of Empires II: Definitive Edition\u003c/em\u003e on PC, “Ayn Jalut”. Created by World’s Edge Senior Business Manager, and famed \u003cem\u003eAge\u003c/em\u003e campaign designer, Ramsey Abdulrahim. In this scenario, you play as Baybars before the pivotal battle when the fate of the Muslim world held in the balance. Prepare your forces, set up your ambushes, and use your cunning and strategy to overcome the Mongol horde. Like the Mamluks, can you be the first to defeat the Mongols?\u003c/p\u003e\n\u003cp\u003eWhen finished, try again and best your friends for the highest score!\u003c/p\u003e\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003eThe entire world trembled before the Mongols. Rulers of China and Persia, the fearsome horsemen swept through the cities of the Islamic world, leaving ruins. Only Baybars and the Mamluks of Egypt stood in their way. Baybars had gathered an army at Ayn Jalut, the site where the Biblical David slew the giant Goliath. Baybars had been born a thousand miles away, but he knew the Mongols well: they had slaughtered his family and sold him–as a mere boy–into slavery. At Ayn Jalut, he was determined to have his revenge–and slay his own giant.\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch3\u003eThe Mamluks and the Exhibition\u003c/h3\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1080\" height=\"613\" src=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-1080x613.webp\" alt=\"\" srcset=\"https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-1080x613.webp 1080w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-288x164.webp 288w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-768x436.webp 768w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-697x396.webp 697w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance-845x480.webp 845w, https://cdn.ageofempires.com/aoe/wp-content/uploads/2025/06/Mamluks_louvre_entrance.webp 1500w\" sizes=\"auto, (max-width: 1080px) 100vw, 1080px\"/\u003e\u003c/figure\u003e\n\u003cp\u003eThe Mamluks, freed slave-soldiers of primarily Turkish (and later Caucasian) origin, built their legend on their military prowess. They conquered the last bastions of the Crusaders, fought and repelled the Mongols, survived Timur’s invasions and kept threatening neighbors at bay, before succumbing to Ottoman expansion. The sultanate encompassed a vast territory, including Egypt, Bilad al-Sham (modern day Syria, Lebanon, Israel/Palestine and Jordan), parts of Eastern Anatolia and the Hejaz region of Arabia, which includes Mecca and Medina.\u003c/p\u003e\n\u003cp\u003eThe exhibition takes visitors beyond the military legend of the Mamluk sultanate and shows the complex and multi-faceted society they formed. They created a world in which sultans mingled with emirs and rich civil elites, all actively engaging in artistic patronage. Women had active roles in Mamluk society, as well as Christian and Jewish minorities. At the meeting point of Europe, Africa and Asia, people and ideas circulated, as well as arts and trade.\u003c/p\u003e\n\u003cp\u003eThe exhibition is an unprecedented opportunity to discover this glorious and yet little-known empire, through a collection of masterpieces from around the world. Visitors will be exposed to a new perspective on medieval Egypt and the Near East.\u003c/p\u003e\n\n\u003chr/\u003e\n\u003cp\u003eTo make sure you can enjoy all the partnership content, make sure you’re following \u003cem\u003eAge of Empires\u003c/em\u003e and the Louvre on social media!\u003c/p\u003e\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-10T09:13:45-07:00",
  "modifiedTime": "2025-06-10T14:23:14-07:00"
}
