{
  "id": "005cf2b5-fffc-4f7b-ba1b-98c3a826a320",
  "title": "Protests Against Turkey's Erdogan Intensify Over Istanbul Mayor's Arrest",
  "link": "https://www.ndtv.com/world-news/protests-against-turkeys-recep-tayyip-erdogan-intensify-over-istanbul-mayor-ekrem-imamoglu-arrest-7980804",
  "description": "Hundreds of thousands of people rallied in Istanbul late Friday to protest the arrest of the city's opposition mayor, Ekrem Imamoglu, defying a warning from President Recep Tayyip Erdogan that Turkey would not tolerate \"street terrorism\".",
  "author": "",
  "published": "Sat, 22 Mar 2025 05:35:02 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 4619,
  "excerpt": "Hundreds of thousands of people rallied in Istanbul late Friday to protest the arrest of the city's opposition mayor, Ekrem Imamoglu, defying a warning from President Recep Tayyip Erdogan that Turkey would not tolerate \"street terrorism\".",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Istanbul: Hundreds of thousands of people rallied in Istanbul late Friday to protest the arrest of the city's opposition mayor, Ekrem Imamoglu, defying a warning from President Recep Tayyip Erdogan that Turkey would not tolerate \"street terrorism\".It was the third straight night that demonstrators had rallied against the arrest of Imamoglu -- Erdogan's biggest political rival -- in Turkey's biggest street protests in more than a decade.Opposition leader Ozgur Ozel, head of the CHP which called the nationwide protests, told a vast crowd in front of Istanbul City Hall that \"300,000 people\" had joined the demonstration.\"This is not a CHP rally, the people here are from all parties and have come to show solidarity with Mayor Imamoglu and stand up for democracy,\" he told the vast crowd, which punctuated his speech with cheering and applause.Erdogan is \"trying to twist Imamoglu's arm by using the judiciary as a weapon and take over this building. But we won't hand it over to a government-appointed trustee!\" he yelled.As he spoke, clashes erupted on the sidelines of the protest, with riot police firing tear gas and rubber bullets, according to two AFP correspondents who were both hit in the leg.Clashes also broke out in Ankara and the western coastal city of Izmir where police fired water cannon and tear gas against protesters, an AFP correspondent and the opposition Halk TV said.\"Don't stay silent or it will be you next,\" chanted the demonstrators in Istanbul as the massive gathered at sunset with protesters waved placards reading: \"Don't be afraid, the people are here!\" and \"Law, rights, justice\".\"We did not take to streets by force. We are here because of Erdogan,\" 56-year-old Necla, who was wearing a headscarf, told AFP.\"I don't believe in the allegations about Imamoglu. There is no man as honest as him,\" she said.- Street protests a 'dead end' -In a post on X, Interior Minister Ali Yerlikaya said 97 protesters were arrested during Friday's demonstrations.The mayor's arrest came just days before Imamoglu was to have been formally named as the CHP's candidate in the 2028 presidential race.Protests spread quickly from Istanbul to at least 40 of Turkey's 81 provinces, according to an AFP count.As the CHP's Ozel urged people across the country to demonstrate, Erodogan said: \"Turkey will not surrender to street terror.\"\"Let me say it loud and clear: the street protests that the CHP leader has called for are a dead end,\" he added.He accused the opposition leader of \"grave irresponsibility\", raising the prospect that Ozel, too, could face legal sanction.On Friday, the authorities extended a protest ban to Ankara and Izmir. Ahead of the Istanbul rally, they blocked off the main access routes to City Hall, including Galata Bridge and Ataturk Bridge.On Thursday, police fired rubber bullets and teargas at protesters in Istanbul and Ankara, where at least 88 protesters were arrested, Turkish media said.Interior Minister Ali Yerlikaya said 16 police officers had been hurt. Police detained 54 people for online posts authorities deemed \"incitement to hatred\".Prosecutors say they are investigating Imamoglu for \"aiding a terrorist organisation\" -- the banned Kurdish PKK militant group. They say they are also investigating him and around 100 other suspects for corruption.- Currency, stock market, hit -The move against Imamoglu has dealt a heavy blow to the Turkish lira, and on Friday the BIST 100 stock exchange traded lower, shedding nearly eight percent at close.Despite Imamoglu's detention, the CHP has vowed it would press ahead with its primary on Sunday at which it would formally nominate him as its candidate for the 2028 race.The party said it would open voting to anyone, not just party members.Observers said the government could seek to block the primary to prevent a further show of support for Imamgolu.\"If a large number of people show up and vote for Imamoglu, it will further legitimise him domestically and really move things in a direction that Erdogan doesn't want,\" Gonul Tol at the Washington-based Middle East Institute, told AFP.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day Cash Found At Justice's House In Delhi: Who Will Judge The Judge?",
  "image": "https://c.ndtvimg.com/2025-03/av97v4gc_turkey-protest_625x300_22_March_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eIstanbul: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eHundreds of thousands of people rallied in Istanbul late Friday to protest the arrest of the city\u0026#39;s opposition mayor, Ekrem Imamoglu, defying a warning from President Recep Tayyip Erdogan that Turkey would not tolerate \u0026#34;street terrorism\u0026#34;.\u003c/p\u003e\u003cp\u003eIt was the third straight night that demonstrators had rallied against the arrest of Imamoglu -- Erdogan\u0026#39;s biggest political rival -- in Turkey\u0026#39;s biggest street protests in more than a decade.\u003c/p\u003e\u003cp\u003eOpposition leader Ozgur Ozel, head of the CHP which called the nationwide protests, told a vast crowd in front of Istanbul City Hall that \u0026#34;300,000 people\u0026#34; had joined the demonstration.\u003c/p\u003e\u003cp\u003e\u0026#34;This is not a CHP rally, the people here are from all parties and have come to show solidarity with Mayor Imamoglu and stand up for democracy,\u0026#34; he told the vast crowd, which punctuated his speech with cheering and applause.\u003c/p\u003e\u003cp\u003eErdogan is \u0026#34;trying to twist Imamoglu\u0026#39;s arm by using the judiciary as a weapon and take over this building. But we won\u0026#39;t hand it over to a government-appointed trustee!\u0026#34; he yelled.\u003c/p\u003e\u003cp\u003eAs he spoke, clashes erupted on the sidelines of the protest, with riot police firing tear gas and rubber bullets, according to two AFP correspondents who were both hit in the leg.\u003c/p\u003e\u003cp\u003eClashes also broke out in Ankara and the western coastal city of Izmir where police fired water cannon and tear gas against protesters, an AFP correspondent and the opposition Halk TV said.\u003c/p\u003e\u003cp\u003e\u0026#34;Don\u0026#39;t stay silent or it will be you next,\u0026#34; chanted the demonstrators in Istanbul as the massive gathered at sunset with protesters waved placards reading: \u0026#34;Don\u0026#39;t be afraid, the people are here!\u0026#34; and \u0026#34;Law, rights, justice\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;We did not take to streets by force. We are here because of Erdogan,\u0026#34; 56-year-old Necla, who was wearing a headscarf, told AFP.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t believe in the allegations about Imamoglu. There is no man as honest as him,\u0026#34; she said.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- Street protests a \u0026#39;dead end\u0026#39; -\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIn a post on X, Interior Minister Ali Yerlikaya said 97 protesters were arrested during Friday\u0026#39;s demonstrations.\u003c/p\u003e\u003cp\u003eThe mayor\u0026#39;s arrest came just days before Imamoglu was to have been formally named as the CHP\u0026#39;s candidate in the 2028 presidential race.\u003c/p\u003e\u003cp\u003eProtests spread quickly from Istanbul to at least 40 of Turkey\u0026#39;s 81 provinces, according to an AFP count.\u003c/p\u003e\u003cp\u003eAs the CHP\u0026#39;s Ozel urged people across the country to demonstrate, Erodogan said: \u0026#34;Turkey will not surrender to street terror.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Let me say it loud and clear: the street protests that the CHP leader has called for are a dead end,\u0026#34; he added.\u003c/p\u003e\u003cp\u003eHe accused the opposition leader of \u0026#34;grave irresponsibility\u0026#34;, raising the prospect that Ozel, too, could face legal sanction.\u003c/p\u003e\u003cp\u003eOn Friday, the authorities extended a protest ban to Ankara and Izmir. Ahead of the Istanbul rally, they blocked off the main access routes to City Hall, including Galata Bridge and Ataturk Bridge.\u003c/p\u003e\u003cp\u003eOn Thursday, police fired rubber bullets and teargas at protesters in Istanbul and Ankara, where at least 88 protesters were arrested, Turkish media said.\u003c/p\u003e\u003cp\u003eInterior Minister Ali Yerlikaya said 16 police officers had been hurt. Police detained 54 people for online posts authorities deemed \u0026#34;incitement to hatred\u0026#34;.\u003c/p\u003e\u003cp\u003eProsecutors say they are investigating Imamoglu for \u0026#34;aiding a terrorist organisation\u0026#34; -- the banned Kurdish PKK militant group. They say they are also investigating him and around 100 other suspects for corruption.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- Currency, stock market, hit -\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe move against Imamoglu has dealt a heavy blow to the Turkish lira, and on Friday the BIST 100 stock exchange traded lower, shedding nearly eight percent at close.\u003c/p\u003e\u003cp\u003eDespite Imamoglu\u0026#39;s detention, the CHP has vowed it would press ahead with its primary on Sunday at which it would formally nominate him as its candidate for the 2028 race.\u003c/p\u003e\u003cp\u003eThe party said it would open voting to anyone, not just party members.\u003c/p\u003e\u003cp\u003eObservers said the government could seek to block the primary to prevent a further show of support for Imamgolu.\u003c/p\u003e\u003cp\u003e\u0026#34;If a large number of people show up and vote for Imamoglu, it will further legitimise him domestically and really move things in a direction that Erdogan doesn\u0026#39;t want,\u0026#34; Gonul Tol at the Washington-based Middle East Institute, told AFP.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eCash Found At Justice\u0026#39;s House In Delhi: Who Will Judge The Judge?\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
