{
  "id": "03cc6afe-ca73-4b7e-a36b-f6915e64a918",
  "title": "Former SpaceX employee sues Elon Musk for being fired over using bathroom frequently",
  "link": "https://timesofindia.indiatimes.com/world/us/former-spacex-employee-with-crohns-disease-sues-elon-musk-for-being-fired-over-using-bathroom-frequently/articleshow/121066698.cms",
  "description": "A former SpaceX employee, Douglas Altshuler, is suing the company, alleging he was wrongfully terminated due to his Crohn's disease, which required frequent bathroom visits. Despite providing medical documentation, Altshuler claims supervisors tracked his toilet breaks and threatened termination. He also alleges denial of accommodations, underpayment, and exposure to unsafe workplace conditions, including drying machine parts in the kitchen.",
  "author": "TOI World Desk",
  "published": "2025-05-11T03:16:39+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 1809,
  "excerpt": "US News: A former SpaceX employee, Douglas Altshuler, is suing the company, alleging he was wrongfully terminated due to his Crohn's disease, which required fr",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "A former employee of Elon Musk’s SpaceX is suing the company for allegedly firing him over frequent bathroom use caused by a chronic medical condition. According to The Independednt, Douglas Altshuler, 58, claims he was mistreated and ultimately terminated because of Crohn’s disease — a gastrointestinal illness that often requires urgent and repeated visits to the toilet.Operation SindoorArmed forces maintaining strong vigil after Pak ceasefire breach: MEABehind the scenes of ceasefire: Calls from Pakistan, WashingtonPakistan violates ceasefire: Loud explosions, sirens haunt J\u0026amp;K- what we know so farAltshuler, who joined SpaceX in 2023, filed a federal lawsuit in California last week. In it, he says he needed to use the bathroom every 35 to 45 minutes during his eight-hour shifts, sometimes up to 14 times a day. According to the complaint, he provided medical documentation to explain his condition, but supervisors started tracking the duration of his toilet breaks and warned him not to exceed 10 minutes per visit. He alleges he was threatened with termination if his bathroom use continued. When he asked management for official accommodations under disability rights, he claims the request was rejected as “unsubstantiated.” He was eventually dismissed on grounds of “deficient performance,” which he believes was retaliation for both his condition and for reporting unsafe workplace practices. Altshuler’s lawsuit also accuses SpaceX of denying him meal breaks, underpaying him, and exposing employees to unsafe conditions. He described one incident where machine parts were dried in the same kitchen where staff cooked meals.The Mayo Clinic defines Crohn’s disease as a form of inflammatory bowel disease (IBD) that causes inflammation and swelling in the tissues of the digestive tract.",
  "image": "https://static.toiimg.com/thumb/msid-121066780,width-1070,height-580,imgsize-615326,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121066780,imgsize-615326,width-400,resizemode-4/Untitled-design-74.jpg\" alt=\"Former SpaceX employee with Crohn’s disease sues Elon Musk for being fired over using bathroom frequently\" title=\"Elon Musk (AFP photo)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA former employee of Elon Musk’s SpaceX is suing the company for allegedly firing him over frequent bathroom use caused by a chronic medical condition. According to The Independednt, Douglas Altshuler, 58, claims he was mistreated and ultimately terminated because of Crohn’s disease — a gastrointestinal illness that often requires urgent and repeated visits to the toilet.\u003cspan data-pos=\"1\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eOperation Sindoor\u003c/h2\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://timesofindia.indiatimes.com/india/india-pakistan-news-live-updates-jammu-kashmir-pahalgam-terror-attack-dgmo-pm-modi-us-donald-trump-tweet-ceasefire-violation/liveblog/121064521.cms\" index=\"0\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eArmed forces maintaining strong vigil after Pak ceasefire breach: MEA\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://timesofindia.indiatimes.com/india/behind-the-scenes-of-ceasefire-calls-from-pakistan-washington/articleshow/121068548.cms\" index=\"1\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eBehind the scenes of ceasefire: Calls from Pakistan, Washington\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://timesofindia.indiatimes.com/india/loud-explosions-red-streaks-and-sirens-haunt-jammu-and-kashmir-border-districts-again-as-pakistan-breaches-ceasefire-what-we-know-so-far/articleshow/121062301.cms\" index=\"2\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003ePakistan violates ceasefire: Loud explosions, sirens haunt J\u0026amp;amp;K- what we know so far\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eAltshuler, who joined SpaceX in 2023, filed a federal lawsuit in California last week. In it, he says he needed to use the bathroom every 35 to 45 minutes during his eight-hour shifts, sometimes up to 14 times a day. According to the complaint, he provided medical documentation to explain his condition, but supervisors started tracking the duration of his toilet breaks and warned him not to exceed 10 minutes per visit.\u003cspan data-pos=\"5\"\u003e\u003c/span\u003e He alleges he was threatened with termination if his bathroom use continued. When he asked management for official accommodations under disability rights, he claims the request was rejected as “unsubstantiated.” He was eventually dismissed on grounds of “deficient performance,” which he believes was retaliation for both his condition and for reporting unsafe workplace practices.\u003cspan data-pos=\"7\"\u003e\u003c/span\u003e Altshuler’s lawsuit also accuses SpaceX of denying him meal breaks, underpaying him, and exposing employees to unsafe conditions. He described one incident where machine parts were dried in the same kitchen where staff cooked meals.\u003cspan data-pos=\"9\"\u003e\u003c/span\u003eThe Mayo Clinic defines Crohn’s disease as a form of inflammatory bowel disease (IBD) that causes inflammation and swelling in the tissues of the digestive tract.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-11T03:16:00+05:30",
  "modifiedTime": null
}
