{
  "id": "15f3a6b3-d900-455d-b988-c1be6c181d4d",
  "title": "Ecuadorian voters search for relief from rising cocaine violence",
  "link": "https://www.washingtonpost.com/world/2025/04/13/ecuador-election-daniel-noboa/",
  "description": "The once-peaceful nation awaited results Sunday evening of an election in which security and the economy were key issues.",
  "author": "Arturo Torres, Samantha Schmidt",
  "published": "Sun, 13 Apr 2025 23:36:10 +0000",
  "source": "http://feeds.washingtonpost.com/rss/world",
  "categories": null,
  "byline": "Arturo Torres, Samantha Schmidt",
  "length": 9185,
  "excerpt": "The once-peaceful nation awaited results Sunday evening of an election in which security and the economy were key issues.",
  "siteName": "The Washington Post",
  "favicon": "https://www.washingtonpost.com/touch-icon-iphone-retina.png",
  "text": "QUITO, Ecuador — As narco violence consumes Ecuador, voters in this once-peaceful South American nation cast ballots Sunday in one of the country’s closest presidential elections in years.As the polls closed Sunday evening, Ecuadorians awaits results of a race the candidates ran nearly even.Voters could give four more years of power to Daniel Noboa, the millennial conservative who declared war on the country’s drug gangs in an ironfisted — and occasionally brazen — approach that has yielded limited results.Or they could welcome back the leftist party of the influential former president, Rafael Correa, who oversaw years of big spending and stability but grew increasingly authoritarian, eroding institutions, attacking critics and antagonizing the United States.Correa’s candidate, lawyer and former lawmaker Luisa González, has managed to harness frustration with Noboa’s leadership and nostalgia for the Correa years to expand her voter base. The first-round vote was a deadlock, with each candidate winning 44 percent of the vote, and polls show they remain neck and neck.Around Quito Sunday, older voters appeared to make a strong showing. One of them was Alba Rosero, 78, who said she voted for Noboa because she felt he would be the most likely to bring security to the country — and preserve democracy.“We need peace to work, to stand up, to get ahead,” she said. “What we need is democracy. What we need is freedom to be able to express our opinions.”The winner will be tasked with resolving a deepening security crisis in a country that has become both a booming cocaine transit point and a battleground for drug gangs: Violent deaths have shot up again this year, after a lull in 2024. February was the deadliest month in recent years, with 736 homicides, 90 percent more than in the same month last year.Both candidates could bring risks for democracy, said the Ecuadorian political scientist Andrés Mejía Acosta, associate dean for policy and practice at the Keough School of Global Affairs at the University of Notre Dame.“For both of them, democracy gets in the way, state-strengthening gets in the way,” Mejía said. “Both of them are not as committed to upholding democratic principles because they get in the way of their ambitions.”Noboa has sidestepped and in some cases ignored electoral laws and court rulings in his campaign for president. Both candidates have mentioned doubts about electoral fraud, raising concerns that whichever one loses will contest the results.A crisis of violence with no end in sightThis country of 18 million people was once considered an oasis of peace in a conflict-ridden region. But it has become a key transit point for the record amounts of cocaine flooding Europe. Its location between the world’s top cocaine producers, Colombia and Peru, and its robust network of local gangs have made it an attractive hub for traffickers from around the globe. Ecuadorian gangs, partnering with Mexican cartels and Albanian drug traffickers, have become multimillion-dollar criminal enterprises that have penetrated key institutions throughout Ecuador’s government.The unchecked rise of the gangs has brought record violence to Ecuador’s streets. Only 11 percent of residents in Guayas, the country’s most populous province, said they felt safe walking alone at night, Gallup reported in 2023. No region in the world, outside active war zones, reported a lower rate. The violence seeped into politics two years ago with the assassination of presidential candidate Fernando Villavicencio, who had pledged to crack down on the gangs.Noboa, seen as the heir to his billionaire father’s business empire, won that election, also against González, to serve the last 18 months of his predecessor’s term. Guillermo Lasso, a center-right reformer facing the possibility of impeachment, dissolved the National Assembly, resigned and declined to seek reelection.The new president had been in office for only weeks when a gang revolt threatened the nation’s stability. In January 2024, riots broke out in prisons, car bombs exploded in several cities and armed men stormed the studio of one of Ecuador’s most widely watched news programs to hold more than a dozen staff members hostage at gunpoint as the cameras broadcast live.Noboa responded with a declaration of “internal armed conflict,” a decree that named 22 criminal gangs as terrorist organizations and allowed authorities to mobilize the military against them.“This isn’t just gangs fighting for four blocks,” Noboa told The Washington Post last year. “This is a fight for ports, for borders, for entire towns. … The dispute is over our way of life.”An ironfisted leader with limited resultsAnalysts say Noboa’s militarization of the country has done little to dismantle criminal structures, and human rights defenders have accused the government of arresting thousands with little evidence or due process — an approach they compare with that of El Salvador’s president, Nayib Bukele. Intense fighting continued into this year: January was the country’s most violent start to a year on record.Noboa has created an image of himself as a tough-on-crime leader who will do whatever it takes to eliminate impunity. In April, he instructed police to break into the Mexican Embassy to pull out Correa’s former vice president, twice convicted of corruption, who had sought asylum. The move, an apparent violation of the Vienna Convention, led Mexico to sever diplomatic relations with Ecuador but was well received at home.Noboa’s popularity plummeted last year when an energy crisis led to daily 14-hour power cuts. And in March, a large oil spill in Esmeraldas state left 250,000 families without drinking water. Local authorities accused the Noboa government of negligence.He has also stirred controversy with his recent alliance with Erik Prince, founder of the private security company Blackwater, to provide training to Ecuadorian military and police. Mejía described the partnership as the latest attempt by Noboa to privatize security and “bypass the state altogether.”Santiago Basabe, a political scientist at San Francisco de Quito University, said Noboa hasn’t provided much of a plan or policies for the next four years. “The issue of security is not easy to resolve,” Basabe said. “It cannot be resolved in the short term.”Miguel Vallejo, 65, voted in Quito on Sunday. He said he has seen Noboa’s policies reduce organized crime in Santo Domingo de los Tsáchilas, the particularly dangerous province where he owns a business.Once, he said, criminal groups would arrive at his business almost every day. But “since February of last year, when he declared war on them, much of the extortion stopped.” Some of Noboa’s supporters say he needs more time to prove himself.After a turbulent few years, taxi driver Daniel Argoti said, what he wants is simple: Continuity.“I want things to be maintained but also improved,” said Argoti, 45, “because we’re not doing all that well.”A possible return to the leftA win for González could mean a return to the politics of Correa, who boosted spending on infrastructure, reduced inequality, and expanded access to education and health care. But he was also accused of abusing his power; ongoing criminal investigations have revealed ties between his government and organized crime. Convicted of corruption, he lives in exile in Belgium.González, while catering to loyal Correa supporters, has sought to distance herself from Correa’s controversies and instead attack Noboa. She has strategically catered to “those who voted for Noboa but are frustrated by a lack of results, that feel they have been deceived,” Ecuadorian political analyst Caroline Ávila said.Inti Samaniego, a 30-year-old psychologist from Quito, said he voted for González not because he supports Correa’s party, but because of Noboa’s performance: “the violence, the authoritarianism, the negligence.”Carla Argüello, a 26-year-old voter who works with a human rights organization, agreed.“Noboa has not been able to solve the serious problems of insecurity, and he has dedicated himself to persecuting his opponents,” she said. “He has violated the constitution and is very authoritarian.”González pledges a return to Correa-era public spending to reduce crime and inequality. She has proposed boosting technology to tackle insecurity, and has suggested funding “peace managers” to support citizen security in neighborhoods.If a González presidency were anything like Correa’s, it could create tensions with the Trump administration. Correa kicked the Americans out of a U.S. naval base in Manta in 2009, leaving Ecuador’s coastline largely undefended.Antagonizing the United States could help González domestically, as it has for other presidents worldwide. But it could damage bilateral relations at a time when it needs close U.S. collaboration to combat drug trafficking — and to gain access to better credit markets.As Ecuadorians head to the polls Sunday, undecided voters will be crucial.“People are tired,” Ávila said. “We have been through five electoral processes in the last two years. There is enormous political exhaustion.”Schmidt reported from Bogotá, Colombia.",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ERLD6N2VX6QQLJKXDQEBX5BSUY_size-normalized.JPG\u0026w=1440",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp data-apitype=\"text\" data-contentid=\"OZHJQL3QJFDDTJ4N3QSFGCJNLA\" data-el=\"text\" dir=\"null\"\u003eQUITO, Ecuador — As narco violence consumes Ecuador, voters in this once-peaceful South American nation cast ballots Sunday in one of the country’s closest presidential elections in years.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"BTKXYTCUS5GPNAMZ6FRZ47GNAI\" data-el=\"text\" dir=\"null\"\u003eAs the polls closed Sunday evening, Ecuadorians awaits results of a race the candidates ran nearly even.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"ECDJMC3DNJAJZNLHKUZI5UWI74\" data-el=\"text\" dir=\"null\"\u003eVoters could give four more years of power to Daniel Noboa, the millennial conservative who declared war on the country’s drug gangs in an ironfisted — and occasionally brazen — approach that has yielded limited results.\u003c/p\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"QCAGJSNLURB2ZPWZFB5AIBMLSI\" data-el=\"text\" dir=\"null\"\u003eOr they could welcome back the leftist party of the influential former president, Rafael Correa, who oversaw years of big spending and stability but grew increasingly authoritarian, eroding institutions, attacking critics and antagonizing the United States.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"EUDINA22L5BF3EB5A7MEJZ74QM\" data-el=\"text\" dir=\"null\"\u003eCorrea’s candidate, lawyer and former lawmaker Luisa González, has managed to harness frustration with Noboa’s leadership and nostalgia for the Correa years to expand her voter base. The first-round vote was a deadlock, with each candidate winning 44 percent of the vote, and polls show they remain neck and neck.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"CPA3BTR76NFIJHESQ4GKPVYU44\" data-el=\"text\" dir=\"null\"\u003eAround Quito Sunday, older voters appeared to make a strong showing. One of them was Alba Rosero, 78, who said she voted for Noboa because she felt he would be the most likely to bring security to the country — and preserve democracy.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"UGPDNJOW3RDLRNYTP5RJFF3CHI\" data-el=\"text\" dir=\"null\"\u003e“We need peace to work, to stand up, to get ahead,” she said. “What we need is democracy. What we need is freedom to be able to express our opinions.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"DCEYEBVCCFH5JHHDL2G3ZNQIDI\" data-el=\"text\" dir=\"null\"\u003eThe winner will be tasked with resolving a deepening security crisis in a country that has become both a booming cocaine transit point and a battleground for drug gangs: Violent deaths have shot up again this year, after a lull in 2024. February was the deadliest month in recent years, with 736 homicides, 90 percent more than in the same month last year.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"K4ILI5TKU5FSDG5YSJEXUSSJ6M\" data-el=\"text\" dir=\"null\"\u003eBoth candidates could bring risks for democracy, said the Ecuadorian political scientist Andrés Mejía Acosta, associate dean for policy and practice at the Keough School of Global Affairs at the University of Notre Dame.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"IYTLSUU4TJGGXHZMCM5D3MUZD4\" data-el=\"text\" dir=\"null\"\u003e“For both of them, democracy gets in the way, state-strengthening gets in the way,” Mejía said. “Both of them are not as committed to upholding democratic principles because they get in the way of their ambitions.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"GBUUZLMPMBCCXAZVLXCNVTHQMA\" data-el=\"text\" dir=\"null\"\u003eNoboa has sidestepped and in some cases \u003ca href=\"https://x.com/CorteConstEcu/status/1886492037224005906\" target=\"_blank\"\u003eignored electoral laws\u003c/a\u003e and court rulings in his campaign for president. Both candidates have mentioned doubts about electoral fraud, raising concerns that whichever one loses will contest the results.\u003c/p\u003e\u003cp data-qa=\"article-body\"\u003e\u003ch3 data-qa=\"article-header\" data-contentid=\"5IENW7WZHVHSZKN33EWVNBER74\" data-apitype=\"header\" level=\"3\" id=\"5IENW7WZHVHSZKN33EWVNBER74\"\u003eA crisis of violence with no end in sight\u003c/h3\u003e\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"6LGPMJD6DVHOZC7M76PNFLXOHA\" data-el=\"text\" dir=\"null\"\u003eThis country of 18 million people was once considered an oasis of peace in a conflict-ridden region. But it has become a key transit point for the\u003ca href=\"https://www.washingtonpost.com/world/2024/12/28/cocaine-consumption-soars-europe-asia/\" target=\"_blank\"\u003e record amounts of cocaine\u003c/a\u003e flooding Europe. Its location between the world’s top cocaine producers, Colombia and Peru, and its robust network of local gangs have made it an attractive hub for traffickers from around the globe. Ecuadorian gangs, partnering with Mexican cartels and Albanian drug traffickers, have become multimillion-dollar criminal enterprises that have penetrated key institutions throughout Ecuador’s government.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"BRRQZZZW4RDJZLGFWXSIQAYHFM\" data-el=\"text\" dir=\"null\"\u003eThe unchecked rise of the gangs has brought record violence to Ecuador’s streets. Only 11 percent of residents in Guayas, the country’s most populous province, said they felt safe walking alone at night, \u003ca href=\"https://news.gallup.com/poll/643817/guayas-ecuador-least-safe-place-planet.aspx\" target=\"_blank\"\u003eGallup reported in 2023\u003c/a\u003e. No region in the world, outside active war zones, reported a lower rate. The violence seeped into politics two years ago with the \u003ca href=\"https://www.washingtonpost.com/world/2023/08/10/fernando-villavicencio-ecuador-assassination/\" target=\"_blank\"\u003eassassination\u003c/a\u003e of presidential candidate Fernando Villavicencio, who had pledged to crack down on the gangs.\u003c/p\u003e\u003cdiv data-qa=\"article-body\"\u003e\u003cp data-apitype=\"text\" data-contentid=\"INQSS5EEXBDFVF6C5FQZZJKDEE\" data-el=\"text\" dir=\"null\"\u003eNoboa, seen as the heir to his billionaire father’s business empire, won \u003ca href=\"https://www.washingtonpost.com/world/2023/10/15/ecuador-election-gonzalez-noboa-correa/\" target=\"_blank\"\u003ethat election\u003c/a\u003e, also against González, to serve the last 18 months of his predecessor’s term. Guillermo Lasso, a center-right reformer facing the possibility of impeachment, \u003ca href=\"https://www.washingtonpost.com/world/2023/05/19/guillermo-lasso-interview-ecuador/\" target=\"_blank\"\u003edissolved the National Assembly, resigned and declined to seek reelection\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cp data-apitype=\"text\" data-contentid=\"E7KLZFOJ2FECBAA7HI6QL5QW3U\" data-el=\"text\" dir=\"null\"\u003eThe new president had been in office for only weeks when a \u003ca href=\"https://www.washingtonpost.com/world/interactive/2024/ecuador-gang-takeover-noboa-cocaine/?itid=ap_samanthaschmidt\" target=\"_blank\"\u003egang revolt \u003c/a\u003ethreatened the nation’s stability. In January 2024, riots broke out in prisons, car bombs exploded in several cities and armed men stormed the studio of one of Ecuador’s most widely watched news programs to hold more than a dozen staff members hostage at gunpoint as the cameras broadcast live.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"G24QJM7WF5CHVPBGJZLAWLRTPA\" data-el=\"text\" dir=\"null\"\u003eNoboa responded with a declaration of “internal armed conflict,” a decree that named 22 criminal gangs as terrorist organizations and allowed authorities to mobilize the military against them.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"MRGSXUOL6NG6BL5IYEJODYNNEM\" data-el=\"text\" dir=\"null\"\u003e“This isn’t just gangs fighting for four blocks,” \u003ca href=\"https://www.washingtonpost.com/world/interactive/2024/ecuador-gang-takeover-noboa-cocaine/\" target=\"_blank\"\u003eNoboa told The Washington Post\u003c/a\u003e last year. “This is a fight for ports, for borders, for entire towns. … The dispute is over our way of life.”\u003c/p\u003e\u003cp data-qa=\"article-body\"\u003e\u003ch3 data-qa=\"article-header\" data-contentid=\"U3WLU5OBAFEVDKIQBYG2GTFY6M\" data-apitype=\"header\" level=\"3\" id=\"U3WLU5OBAFEVDKIQBYG2GTFY6M\"\u003eAn ironfisted leader with limited results\u003c/h3\u003e\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"MEQXAW3M5FDMVEFEJI7OVDRLAE\" data-el=\"text\" dir=\"null\"\u003eAnalysts say Noboa’s militarization of the country has done little to dismantle criminal structures, and human rights defenders have \u003ca href=\"https://www.amnesty.org/en/latest/news/2024/10/ecuador-tras-ano-mandato-presidente-noboa-debe-impedir-abusos-opacidad-politicas-seguridad/\" target=\"_blank\"\u003eaccused\u003c/a\u003e the government of arresting thousands with little evidence or due process — an approach they compare with that of El Salvador’s president, Nayib Bukele. Intense fighting continued into this year: January was the country’s \u003ca href=\"https://www.primicias.ec/seguridad/ecuador-asesinatos-violencia-policia-guayaquil-duran-enero2025-88397/\" target=\"_blank\"\u003emost violent\u003c/a\u003e start to a year on record.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"SD4WP2QVFZC4FMCH5CGFYVVBGQ\" data-el=\"text\" dir=\"null\"\u003eNoboa has created an image of himself as a tough-on-crime leader who will do whatever it takes to eliminate impunity. In April, he instructed police to \u003ca href=\"https://www.washingtonpost.com/world/2024/04/06/mexico-ecuador-embassy-raid-glas/\" target=\"_blank\"\u003ebreak into the Mexican Embassy\u003c/a\u003e to pull out Correa’s former vice president, twice convicted of corruption, who had sought asylum. The move, an apparent violation of the Vienna Convention, led Mexico to sever diplomatic relations with Ecuador but was well received at home.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JDA5EQ7UXRDXDOO7MLV4BTN3RE\" data-el=\"text\" dir=\"null\"\u003eNoboa’s popularity plummeted last year when an energy crisis led to daily 14-hour power cuts. And in March, a large oil spill in Esmeraldas state left 250,000 families without drinking water. Local authorities accused the Noboa government of negligence.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"GCT4A6WQYVDLNNBKCYOHYV2YXE\" data-el=\"text\" dir=\"null\"\u003eHe has also stirred controversy with his recent alliance with Erik Prince, founder of the private security company Blackwater, to provide training to Ecuadorian military and police. Mejía described the partnership as the latest attempt by Noboa to privatize security and “bypass the state altogether.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"TLEIEX6UX5AURDWGAICKBKNNVA\" data-el=\"text\" dir=\"null\"\u003eSantiago Basabe, a political scientist at San Francisco de Quito University, said Noboa hasn’t provided much of a plan or policies for the next four years. “The issue of security is not easy to resolve,” Basabe said. “It cannot be resolved in the short term.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"YDBDJPVY5NGV7DFPAYKZP5RPCE\" data-el=\"text\" dir=\"null\"\u003eMiguel Vallejo, 65, voted in Quito on Sunday. He said he has seen Noboa’s policies reduce organized crime in Santo Domingo de los Tsáchilas, the particularly dangerous province where he owns a business.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"L7KPNJAVWBHKBHXSUXX2NDXGGE\" data-el=\"text\" dir=\"null\"\u003eOnce, he said, criminal groups would arrive at his business almost every day. But “since February of last year, when he declared war on them, much of the extortion stopped.” \u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FACU4Z5F2NDSNLVRKBMCCXQ6EE\" data-el=\"text\" dir=\"null\"\u003eSome of Noboa’s supporters say he needs more time to prove himself.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"NTBRKDUUH5BTTJALTBUYXZIW24\" data-el=\"text\" dir=\"null\"\u003eAfter a turbulent few years, taxi driver Daniel Argoti said, what he wants is simple: Continuity.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"4MXPIZ4JWNB2LEF2JANEUBG3O4\" data-el=\"text\" dir=\"null\"\u003e“I want things to be maintained but also improved,” said Argoti, 45, “because we’re not doing all that well.”\u003c/p\u003e\u003cp data-qa=\"article-body\"\u003e\u003ch3 data-qa=\"article-header\" data-contentid=\"3OUV4Y36IVBPXOXAPDGYPZ6PFY\" data-apitype=\"header\" level=\"3\" id=\"3OUV4Y36IVBPXOXAPDGYPZ6PFY\"\u003eA possible return to the left\u003c/h3\u003e\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"5ZB7HE34QBE6BLG442DERIFCGA\" data-el=\"text\" dir=\"null\"\u003eA win for González could mean a return to the politics of Correa, who boosted spending on infrastructure, reduced inequality, and expanded access to education and health care. But he was also accused of abusing his power; ongoing criminal investigations have revealed ties between his government and organized crime. Convicted of corruption, he lives in exile in Belgium.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JAC2B6EHVREEHCIPMQAY2UWK5Y\" data-el=\"text\" dir=\"null\"\u003eGonzález, while catering to loyal Correa supporters, has sought to distance herself from Correa’s controversies and instead attack Noboa. She has strategically catered to “those who voted for Noboa but are frustrated by a lack of results, that feel they have been deceived,” Ecuadorian political analyst Caroline Ávila said.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"U6UUITB56RCBVFJCOUNCWRAXOE\" data-el=\"text\" dir=\"null\"\u003eInti Samaniego, a 30-year-old psychologist from Quito, said he voted for González not because he supports Correa’s party, but because of Noboa’s performance: “the violence, the authoritarianism, the negligence.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"AZZB2UEZCRE45EHNTZT6WC4HFI\" data-el=\"text\" dir=\"null\"\u003eCarla Argüello, a 26-year-old voter who works with a human rights organization, agreed.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"ASGBULGJ2JBFRJGKYDCZSMKXSY\" data-el=\"text\" dir=\"null\"\u003e“Noboa has not been able to solve the serious problems of insecurity, and he has dedicated himself to persecuting his opponents,” she said. “He has violated the constitution and is very authoritarian.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"EGSJZEA5QBFZPPOPCSXEI6EL6I\" data-el=\"text\" dir=\"null\"\u003eGonzález pledges a return to Correa-era public spending to reduce crime and inequality. She has proposed boosting technology to tackle insecurity, and has suggested funding “peace managers” to support citizen security in neighborhoods.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"JJCX7I7YGNHRZD4PSPTLIMMKDU\" data-el=\"text\" dir=\"null\"\u003eIf a González presidency were anything like Correa’s, it could create tensions with the Trump administration. Correa kicked the Americans out of a U.S. naval base in Manta in 2009, leaving Ecuador’s coastline largely undefended.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"HTPFQTZITBBT3L64F5S5DESMRA\" data-el=\"text\" dir=\"null\"\u003eAntagonizing the United States could help González domestically, as it has for other presidents worldwide. But it could damage bilateral relations at a time when it needs close U.S. collaboration to combat drug trafficking — and to gain access to better credit markets.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"N3XRMVAUZ5A6LLAFUAWRVSCWLU\" data-el=\"text\" dir=\"null\"\u003eAs Ecuadorians head to the polls Sunday, undecided voters will be crucial.\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"644KIZAPAJDQHP2FIE3NRWLXVU\" data-el=\"text\" dir=\"null\"\u003e“People are tired,” Ávila said. “We have been through five electoral processes in the last two years. There is enormous political exhaustion.”\u003c/p\u003e\u003cp data-apitype=\"text\" data-contentid=\"FPHOZAK3CNDEHG4YZZZ5TXFIDY\" data-el=\"text\" dir=\"null\"\u003e\u003ci\u003eSchmidt reported from Bogotá, Colombia.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-04-13T10:00:40.756Z",
  "modifiedTime": "2025-04-13T23:36:13.795Z"
}
