{
  "id": "1fe8174e-9b5b-4e53-aa31-d063675b7ebc",
  "title": "Exclusive-Musk took leased cars back so Tesla could use them as \"robotaxis.\" Instead, Tesla sold them",
  "link": "https://finance.yahoo.com/news/exclusive-musk-took-leased-cars-110200609.html",
  "description": "",
  "author": "",
  "published": "2025-05-15T11:02:00Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Chris Kirkham and Abhirup Roy",
  "length": 2796,
  "excerpt": "(REUTERS) -Tesla last November ended an unusual policy that prohibited U.S. leasing customers from buying their cars at lease-end. The policy started in...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "In This Article: By Chris Kirkham and Abhirup Roy (REUTERS) -Tesla last November ended an unusual policy that prohibited U.S. leasing customers from buying their cars at lease-end. The policy started in 2019, when Tesla announced that customers could lease its mass-market Model 3 sedans but would have to return them, at the end of the lease, for use in Tesla's planned \"robotaxi\" network. \"You don't have the option of buying,\" Chief Executive Elon Musk said at an investor gathering in California in April 2019. \"We want them back.\" \"Next year, for sure,\" he added, \"we'll have over 1 million robotaxis on the road.\" None of that would prove true. Despite repeated promises, the robotaxis never came. Tesla instead found an unusually lucrative way to make money by flipping many of the off-lease cars to new buyers, according to four people familiar with Tesla's retail operations. Rather than storing the used cars – a fast-depreciating asset – Tesla started adding features to them through software upgrades. It then sold the vehicles to new customers who would pay thousands more than lease-end buyers would have, the people said. The practice was an easy way to \"jack up the price\" of the used vehicles, said one of the people, who asked not to be identified. Tesla and Musk didn't respond to requests for comment for this story. Although counter to what Musk said publicly – and descriptions Tesla gave on its website regarding lease terms – the tactic appears to have been legal. Still, the practice denied lessees the industry-standard option of buying their vehicles and misled them for years about why. It also perpetuated the myth among investors that Tesla was near fully autonomous driving technology. That belief has helped buoy Tesla stock, whose value has far outpaced current earnings and made it the world's most valuable automaker. Throughout the industry, lease contracts typically allow customers to pay monthly to drive a new car for a specified period of time, often between two and four years. The lessee doesn't own the vehicle and must return it to the dealer when the lease expires. In almost all cases, customers can choose to buy the vehicle at lease-end or earlier. Since 2019, Tesla financial statements show, the company has leased to customers worldwide more than 314,000 vehicles, or 4.4% of its total deliveries. It isn't clear whether the no-buy policy applied anywhere outside the United States. The policy was well suited for the years after the onset of the COVID-19 pandemic, when vehicle inventories tightened and car prices spiked. More recently, as demand has plummeted – in part because of some consumers' distaste for Musk's right-wing political activities – buyers aren't as enthusiastic for used Teslas.",
  "image": "https://media.zenfs.com/en/reuters.com/b48d409b020e053ce696f347b7d1bbb5",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e\u003ch2\u003eIn This Article: \u003c/h2\u003e   \u003cdiv\u003e   \u003cp\u003eBy Chris Kirkham and Abhirup Roy\u003c/p\u003e   \u003cp\u003e(REUTERS) -\u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e last November ended an unusual policy that prohibited U.S. leasing customers from buying their cars at lease-end.\u003c/p\u003e   \u003cp\u003eThe policy started in 2019, when \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e announced that customers could lease its mass-market Model 3 sedans but would have to return them, at the end of the lease, for use in \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e\u0026#39;s planned \u0026#34;robotaxi\u0026#34; network.\u003c/p\u003e      \u003cp\u003e\u0026#34;You don\u0026#39;t have the option of buying,\u0026#34; Chief Executive \u003ca href=\"https://www.yahoo.com/people/elon-musk/\" data-ylk=\"slk:Elon Musk;elm:context_link;itc:0;sec:content-canvas\"\u003eElon Musk\u003c/a\u003e said at an investor gathering in California in April 2019. \u0026#34;We want them back.\u0026#34;\u003c/p\u003e   \u003cp\u003e\u0026#34;Next year, for sure,\u0026#34; he added, \u0026#34;we\u0026#39;ll have over 1 million robotaxis on the road.\u0026#34;\u003c/p\u003e   \u003cp\u003eNone of that would prove true. Despite repeated promises, the robotaxis never came. \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e instead found an unusually lucrative way to make money by flipping many of the off-lease cars to new buyers, according to four people familiar with \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e\u0026#39;s retail operations.\u003c/p\u003e      \u003cp\u003eRather than storing the used cars – a fast-depreciating asset – \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e started adding features to them through software upgrades. It then sold the vehicles to new customers who would pay thousands more than lease-end buyers would have, the people said.\u003c/p\u003e   \u003cp\u003eThe practice was an easy way to \u0026#34;jack up the price\u0026#34; of the used vehicles, said one of the people, who asked not to be identified.\u003c/p\u003e   \u003cp\u003e\u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e and Musk didn\u0026#39;t respond to requests for comment for this story.\u003c/p\u003e   \u003cp\u003eAlthough counter to what Musk said publicly – and descriptions \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e gave on its website regarding lease terms – the tactic appears to have been legal. Still, the practice denied lessees the industry-standard option of buying their vehicles and misled them for years about why.\u003c/p\u003e      \u003cp\u003eIt also perpetuated the myth among investors that \u003ca href=\"https://www.yahoo.com/organizations/tesla/\" data-ylk=\"slk:Tesla;elm:context_link;itc:0;sec:content-canvas\"\u003eTesla\u003c/a\u003e was near fully autonomous driving technology. That belief has helped buoy Tesla stock, whose value has far outpaced current earnings and made it the world\u0026#39;s most valuable automaker.\u003c/p\u003e   \u003cp\u003eThroughout the industry, lease contracts typically allow customers to pay monthly to drive a new car for a specified period of time, often between two and four years. The lessee doesn\u0026#39;t own the vehicle and must return it to the dealer when the lease expires. In almost all cases, customers can choose to buy the vehicle at lease-end or earlier.\u003c/p\u003e      \u003cp\u003eSince 2019, Tesla financial statements show, the company has leased to customers worldwide more than 314,000 vehicles, or 4.4% of its total deliveries. It isn\u0026#39;t clear whether the no-buy policy applied anywhere outside the United States.\u003c/p\u003e   \u003cp\u003eThe policy was well suited for the years after the onset of the COVID-19 pandemic, when vehicle inventories tightened and car prices spiked. More recently, as demand has plummeted – in part because of some consumers\u0026#39; distaste for Musk\u0026#39;s right-wing political activities – buyers aren\u0026#39;t as enthusiastic for used Teslas.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e     \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-1c46ade2-8196-3a07-80f4-46309f469ff3\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-ba9be7d4-8364-3ef9-bd98-7f56c32a67df\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-662000c5-76f7-4891-a006-4b571efb21ff\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-5582e069-b8b6-34f9-a749-c91431f651eb\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-15T11:02:00Z",
  "modifiedTime": null
}
