{
  "id": "27b302ac-792e-46c0-a95d-5838ec66353e",
  "title": "Trump threatens new 50% tariffs on China",
  "link": "https://www.bbc.com/news/articles/c8rgkkl7v8lo",
  "description": "The US president says he will introduce the additional tax unless Beijing withdraws its own 34% counter-tariff on American goods.",
  "author": "",
  "published": "Mon, 07 Apr 2025 21:47:08 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Emma Haslett and Charlotte Edwards",
  "length": 4006,
  "excerpt": "The US president says he will introduce the additional tax unless Beijing withdraws its own 34% counter-tariff on American goods.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Emma Haslett and Charlotte EdwardsBusiness ReportersDonald Trump has threatened China with an additional tariff of 50% on goods imported into the US if it does not withdraw a countermeasure, as global markets tumbled for a third day.Speaking at the White House on Monday, the US president said that he was not considering a pause on new tariffs to allow for negotiations with other countries.\"We're not looking at that. We have many, many countries that are coming to negotiate deals with us, and there are going to be fair deals,\" he said.Trump reiterated his threat of 50% duties on Chinese goods if Beijing did not retract its counter-tariff plans by Tuesday. If imposed, US companies bringing in certain goods from China could face a 104% tax.In a post on his social media platform, Truth Social, Trump said he would introduce the extra tariff unless China withdrew its own 34% counter-tariff on American goods, which it announced on Friday.Trump said last Wednesday that he would impose a tax of 34% on Chinese imports as part of his \"Liberation Day\" that placed a minimum 10% levy on nearly all of America's trading partners.If he does impose that, US companies would then pay a total rate of 104% on Chinese imports- as it comes on top of 20% tariffs already put in place in March and the 34% announced last week.Trump said China had introduced its countermeasure \"despite my warning that any country that Retaliates against the U.S. by issuing additional Tariffs... will be immediately met with new and substantially higher Tariffs\". Beijing shot back, saying that \"pressuring or threatening China is not a right way to engage\".\"The U.S. hegemonic move in the name of 'reciprocity' serves its selfish interests at the expense of other countries' legitimate interests and puts 'America first' over international rules,\" Chinese Embassy spokesperson Liu Pengyu said in a statement. \"This is a typical move of unilateralism, protectionism and economic bullying.\" Speaking from the White House, the US president said there could be both permanent tariffs and negotiations.\"We have $36 trillion debt for a reason,\" he said, adding that the US would be talking to China among other countries to make a \"fair deal and a good deal\".\"It's now America first,\" the US president said.The escalating tension between the US and China has increased fears of a global trade war. The tariffs would come as a major blow to China's manufacturers, for whom the US is a key market for exports. Uncertainty around the tariffs led to a turbulent day on global stock markets.Markets worldwide have tumbled since Trump announced fresh tariffs on imports from nearly all economies. The value of US stock markets dropped sharply again on opening, while Europe's biggest markets, including London's FTSE 100, have all closed more than 4% down.Asian share indexes nosedived, with Hong Kong's Hang Seng index falling by more than 13%, its biggest one-day fall since 1997.The impact on the FTSE 100, America's S\u0026P 500, Germany's Dax and Japan's Nikkei has been wide-ranging.Trump's post also indicated that negotiations on countries' tariff rates would \"begin taking place immediately\".Trump met Benjamin Netanyahu, Israel's prime minister, on Monday in the White House. Netanyahu said that his country would eliminate the trade imbalance with the US, which he said was the \"right thing to do\".\"We intend to do it very quickly... and we're going to also eliminate trade barriers.\"Israel faces a 17% tariff from April 9 under Trump's \"Liberation Day\" policy.The US president also posted earlier that Japan was sending a negotiation team to discuss tariffs.And Ursula von der Leyen, the president of the European Commission, offered Trump a \"zero-for-zero tariff\" deal - although she previously said that she had not ruled out retaliation. \"We are also prepared to respond through countermeasures and defend our interests,\" she said.Trump said later that the EU had been formed \"to really do damage to the United States and trade\".",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/29c1/live/1dc16be0-1406-11f0-ac9f-c37d6fd89579.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eEmma Haslett and Charlotte Edwards\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBusiness Reporters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDonald Trump has threatened China with an additional tariff of 50% on goods imported into the US if it does not withdraw a countermeasure, as global markets tumbled for a third day.\u003c/p\u003e\u003cp\u003eSpeaking at the White House on Monday, the US president said that he was not considering a pause on new tariffs to allow for negotiations with other countries.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re not looking at that. We have many, many countries that are coming to negotiate deals with us, and there are going to be fair deals,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eTrump reiterated his threat of 50% duties on Chinese goods if Beijing did not retract its counter-tariff plans by Tuesday. If imposed, US companies bringing in certain goods from China could face a 104% tax.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn a post on his \u003ca target=\"_blank\" href=\"https://truthsocial.com/@realDonaldTrump/posts/114297331052690348\"\u003esocial media platform\u003c/a\u003e, Truth Social, Trump said he would introduce the extra tariff unless China withdrew its own 34% counter-tariff on American goods, which it announced on Friday.\u003c/p\u003e\u003cp\u003eTrump said last Wednesday that he would impose a tax of 34% on Chinese imports as part of his \u0026#34;Liberation Day\u0026#34; that placed a minimum 10% levy on nearly all of America\u0026#39;s trading partners.\u003c/p\u003e\u003cp\u003eIf he does impose that, US companies would then pay a total rate of 104% on Chinese imports- as it comes on top of 20% tariffs already put in place in March and the 34% announced last week.\u003c/p\u003e\u003cp\u003eTrump said China had introduced its countermeasure \u0026#34;despite my warning that any country that Retaliates against the U.S. by issuing additional Tariffs... will be immediately met with new and substantially higher Tariffs\u0026#34;. \u003c/p\u003e\u003cp\u003eBeijing shot back, saying that \u0026#34;pressuring or threatening China is not a right way to engage\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;The U.S. hegemonic move in the name of \u0026#39;reciprocity\u0026#39; serves its selfish interests at the expense of other countries\u0026#39; legitimate interests and puts \u0026#39;America first\u0026#39; over international rules,\u0026#34; Chinese Embassy spokesperson Liu Pengyu said in a statement. \u003c/p\u003e\u003cp\u003e\u0026#34;This is a typical move of unilateralism, protectionism and economic bullying.\u0026#34; \u003c/p\u003e\u003cp\u003eSpeaking from the White House, the US president said there could be both permanent tariffs and negotiations.\u003c/p\u003e\u003cp\u003e\u0026#34;We have $36 trillion debt for a reason,\u0026#34; he said, adding that the US would be talking to China among other countries to make a \u0026#34;fair deal and a good deal\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s now America first,\u0026#34; the US president said.\u003c/p\u003e\u003cp\u003eThe escalating tension between the US and China has increased fears of a global trade war. The tariffs would come as a major blow to China\u0026#39;s manufacturers, for whom the US is a key market for exports. \u003c/p\u003e\u003cp\u003eUncertainty around the tariffs led to a \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/czrvngj03jlo\"\u003eturbulent day on global stock markets\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMarkets worldwide have tumbled since Trump announced fresh tariffs on imports from nearly all economies. \u003c/p\u003e\u003cp\u003eThe value of US stock markets dropped sharply again on opening, while Europe\u0026#39;s biggest markets, including London\u0026#39;s FTSE 100, have all closed more than 4% down.\u003c/p\u003e\u003cp\u003eAsian share indexes nosedived, with Hong Kong\u0026#39;s Hang Seng index falling by more than 13%, its biggest one-day fall since 1997.\u003c/p\u003e\u003cp\u003eThe impact on the FTSE 100, America\u0026#39;s S\u0026amp;P 500, Germany\u0026#39;s Dax and Japan\u0026#39;s Nikkei has been wide-ranging.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eTrump\u0026#39;s post also indicated that negotiations on countries\u0026#39; tariff rates would \u0026#34;begin taking place immediately\u0026#34;.\u003c/p\u003e\u003cp\u003eTrump met Benjamin Netanyahu, Israel\u0026#39;s prime minister, on Monday in the White House. Netanyahu said that his country would eliminate the trade imbalance with the US, which he said was the \u0026#34;right thing to do\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;We intend to do it very quickly... and we\u0026#39;re going to also eliminate trade barriers.\u0026#34;\u003c/p\u003e\u003cp\u003eIsrael faces a 17% tariff from April 9 under Trump\u0026#39;s \u0026#34;Liberation Day\u0026#34; policy.\u003c/p\u003e\u003cp\u003eThe US president also \u003ca target=\"_blank\" href=\"https://truthsocial.com/@realDonaldTrump/posts/114296909356614075\"\u003eposted earlier\u003c/a\u003e that Japan was sending a negotiation team to discuss tariffs.\u003c/p\u003e\u003cp\u003eAnd Ursula von der Leyen, the president of the European Commission, offered Trump a \u0026#34;zero-for-zero tariff\u0026#34; deal - although she previously said that she had not ruled out retaliation. \u003c/p\u003e\u003cp\u003e\u0026#34;We are also prepared to respond through countermeasures and defend our interests,\u0026#34; she said.\u003c/p\u003e\u003cp\u003eTrump said later that the EU had been formed \u0026#34;to really do damage to the United States and trade\u0026#34;. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-07T17:51:00.476Z",
  "modifiedTime": "2025-04-07T21:47:08.314Z"
}
