{
  "id": "32f464ea-25fd-4cb1-b5e2-9101871a9fca",
  "title": "Trump to move fast on tariffs, says Wall Street firm, citing clients who met with ex-trade chief",
  "link": "https://www.cnbc.com/2024/10/12/trump-trade-tariffs-lighthizer-election-china.html",
  "description": "Lighthizer, the U.S. trade representative during Trump's first term, is a top prospect for a number of potential Cabinet posts if Trump wins the White House.",
  "author": "",
  "published": "Sat, 12 Oct 2024 13:57:11 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Kevin Breuninger",
  "length": 7666,
  "excerpt": "Lighthizer, the U.S. trade representative during Trump's first term, is a top prospect for a number of potential Cabinet posts if Trump wins the White House.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Robert Lighthizer, former US trade representative, speaks during an event with former US President Donald Trump, not pictured, at Precision Components Group in York, Pennsylvania, US, on Monday, Aug. 19, 2024. Graeme Sloan | Bloomberg | Getty ImagesDonald Trump's longtime trade adviser is apparently telling Wall Street money managers that if the Republican presidential nominee is reelected, he could start implementing his sweeping tariff proposals quickly after taking office, according to policy analysts at Piper Sandler.\"We've heard from a number of clients that Trump's former US Trade Representative, Robert Lighthizer, has been meeting with investor groups and telling them that Trump could announce 60% Chinese tariffs and 10% across-the-board tariffs shortly after taking office,\" wrote the trio of research analysts at the investment bank in a note Friday.Asked about the note, Trump campaign press secretary Karoline Leavitt did not deny that Lighthizer has been meeting with investors. But she cautioned, \"No policy should be deemed official unless it comes from President Trump directly.\"It was not immediately clear which groups have spoken with Lighthizer, and the Piper Sandler analysts did not reply to a request from CNBC for more details. But clients of the firm would likely be large asset management firms that pay for its stock and economic research.Lighthizer is advising Trump's presidential campaign on economic issues, according to Inside U.S. Trade.A key player in crafting and enacting Trump's first-term trade policies, Lighthizer is also seen as a top prospect for a number of senior posts in a potential Trump Cabinet, including commerce secretary and treasury secretary.He currently serves as chair of the Center for American Trade at the Trump-aligned Washington think tank, America First Policy Institute. A spokesperson for AFPI did not reply to a request for comment. Lighthizer is also a director of Trump Media, the publicly traded social media company that is majority owned by the former president.Lighthizer's reported conversations, and his apparent influence with Trump, both underscore how central tariffs are to carrying out Trump's overall economic vision.Numerous economists and tax experts have warned that Trump's expansive tariff plans will raise prices, lower U.S. gross domestic product and hurt employment in key industries.Democratic presidential nominee Kamala Harris has repeatedly cited a progressive group's analysis that Trump's tariffs could equate to a nearly $4,000 tax increase for the average U.S. family.The Trump campaign stressed to CNBC that Trump's tariff ideas should be viewed in concert with his broader plans, which include slashing regulations, ramping up U.S. oil drilling and deporting millions of undocumented immigrants.Republican National Committee spokeswoman Anna Kelly also noted that Harris and President Joe Biden have maintained, and in some cases boosted, many of the tariffs from Trump's first term in office.\"Harris has always opposed tariffs because she can't be trusted to put workers first, but President Trump will re-shore American jobs, keep inflation low, and raise real wages by lowering taxes, cutting regulations, and unshackling American energy,\" Kelly told CNBC in a statement.'Flood the zone'Republican presidential nominee, former U.S. President Donald Trump, speaks at the Detroit Economic Club on October 10, 2024 in Detroit, Michigan. Bill Pugliano | Getty ImagesThe Piper Sandler analysts in Friday's note relayed their information about Lighthizer as they warned investors to take seriously Trump's promises to hike tariffs to historic levels.\"We expect the tariffs to come quicker in a second Trump term than the first,\" they wrote.Trump \"has the will and the way to follow through on his commitment to impose 60% tariffs on Chinese imports.\"The analysts wrote that it would not be surprising if Trump were to try to enact a broad 10% tariff by force, even though such an effort would likely be tangled up in court battles over his authority to do so.If that happens, they wrote, Trump could \"flood the zone\" with even more targeted tariffs.Those narrower tariffs could be focused on countries with whom the U.S. has large trade deficits, or on selected industries like the auto industry, where Trump has vowed to protect U.S. companies.The analysts added, \"There is little doubt Trump would use the threat of higher tariffs as leverage to win concessions on unrelated issues.\"Deterrent or cash cow?Republican presidential nominee, former U.S. President Donald Trump speaks during a campaign rally at Riverfront Sports on October 09, 2024 in Scranton, Pennsylvania. Michael M. Santiago | Getty ImagesTrump's love of tariffs is well documented. He has presented them on the campaign trail as a panacea, both the key to prosperity and the master tool for reshaping the U.S. economy in a protectionist mold.\"Tariffs are the greatest thing ever invented,\" the former president said during a September town hall in Warren, Michigan.He argues that his tariff plans will rake in enough money to pay for an array of massive tax cuts, without requiring any compromises or cuts to costly government programs like Social Security and Medicare.At the same time, Trump has vowed to use tariffs as a tool to deter unwanted foreign competition, and to gain geopolitical leverage over other nations.Trump has repeatedly called for a 10% universal baseline tariff on foreign imports, and he has floated the possibility of expanding that tariff to 20%.He has also called for a 60% tariff on all Chinese imports, and has suggested he would push for even higher tariffs in specific circumstances.In a speech Thursday at the Detroit Economic Club, for instance, Trump complained that China is building factories in Mexico to produce cars that would be sold in the U.S.\"I will impose whatever tariffs are required\" to stop that effort, Trump said.\"100%, 200% ... 1,000%,\" he said. \"They're not going to sell any cars into the United States with those plants they're building.\"Read more CNBC politics coverageTrump's Mar-a-Lago, golf resorts are outside Milton's path. But Truth Social's offices are at riskTrump Media closes up over 11% in heavy trading after ex-president's rally with MuskSupreme Court rejects Martin Shkreli fine appeal'Easy money': Trump backer Elon Musk claims PAC will pay $47 for swing state voter information'Frankly ridiculous': FEMA administrator slams Trump for boosting false Helene recovery claimsHe has also proposed using tariffs as part of a carrot-and-stick approach to boosting domestic manufacturing.\"If you don't make your product here, then you will have to pay a tax, or tariff, when you send your product into the United States,\" he said in a campaign speech in Michigan in late September. \"And we will take in hundred of billions of dollars into our treasury and use that money to benefit the American citizens.\"In a June meeting with Republican lawmakers on Capitol Hill, Trump even floated the idea of scrapping the federal income tax altogether, and replacing it with revenues from tariffs.The Peterson Institute for International Economics torched that idea, saying it is \"literally impossible for tariffs to fully replace income taxes\" and warning that such a plan would wreak economic havoc.All the while, Trump asserts that his tariffs will not exacerbate already-high consumer prices, which he blames Biden and Harris for causing.\"They aren't gonna have higher prices,\" Trump said during the Sept. 10 presidential debate. \"Who's gonna have higher prices is China and all of the countries that have been ripping us off for years.\"",
  "image": "https://image.cnbcfm.com/api/v1/image/108046183-1728584984230-gettyimages-2177049750-_C3A0426CR2.jpeg?v=1728585032\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108046595\" data-test=\"InlineImage\"\u003e\u003cp\u003eRobert Lighthizer, former US trade representative, speaks during an event with former US President Donald Trump, not pictured, at Precision Components Group in York, Pennsylvania, US, on Monday, Aug. 19, 2024. \u003c/p\u003e\u003cp\u003eGraeme Sloan | Bloomberg | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e\u0026#39;s longtime trade adviser is apparently telling Wall Street money managers that if the Republican presidential nominee is reelected, he could start implementing his sweeping tariff proposals quickly after taking office, according to policy analysts at Piper Sandler.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ve heard from a number of clients that Trump\u0026#39;s former US Trade Representative, Robert Lighthizer, has been meeting with investor groups and telling them that Trump could announce 60% Chinese tariffs and 10% across-the-board tariffs shortly after taking office,\u0026#34; wrote the trio of research analysts at the investment bank in a note Friday.\u003c/p\u003e\u003cp\u003eAsked about the note, Trump campaign press secretary Karoline Leavitt did not deny that Lighthizer has been meeting with investors. But she cautioned, \u0026#34;No policy should be deemed official unless it comes from President Trump directly.\u0026#34;\u003c/p\u003e\u003cp\u003eIt was not immediately clear which groups have spoken with Lighthizer, and the Piper Sandler analysts did not reply to a request from CNBC for more details. But clients of the firm would likely be large asset management firms that pay for its stock and economic research.\u003c/p\u003e\u003cp\u003eLighthizer is \u003ca href=\"https://insidetrade.com/daily-news/trump-joined-lighthizer-says-his-tariff-plan-won-t-raise-prices\" target=\"_blank\"\u003eadvising Trump\u0026#39;s presidential campaign\u003c/a\u003e on economic issues, according to Inside U.S. Trade.\u003c/p\u003e\u003cp\u003eA key player in crafting and enacting Trump\u0026#39;s first-term trade policies, Lighthizer is also seen as a \u003ca href=\"https://www.politico.com/news/2024/08/04/robert-lighthizer-trump-adviser-trade-00172530\" target=\"_blank\"\u003etop prospect\u003c/a\u003e for a number of senior posts in a potential Trump Cabinet, including commerce secretary and treasury secretary.\u003c/p\u003e\u003cp\u003eHe currently serves as chair of the Center for American Trade at the Trump-aligned Washington think tank, America First Policy Institute. A spokesperson for AFPI did not reply to a request for comment. Lighthizer is also a director of Trump Media, the publicly traded social media company that is majority owned by the former president.\u003c/p\u003e\u003cp\u003eLighthizer\u0026#39;s reported conversations, and his apparent influence with Trump, both underscore how central tariffs are to carrying out Trump\u0026#39;s overall economic vision.\u003c/p\u003e\u003cp\u003eNumerous \u003ca href=\"https://www.piie.com/sites/default/files/2024-09/wp24-20.pdf\" target=\"_blank\"\u003eeconomists\u003c/a\u003e and \u003ca href=\"https://taxfoundation.org/research/all/federal/trump-tariffs-biden-tariffs/\" target=\"_blank\"\u003etax experts\u003c/a\u003e have \u003ca href=\"https://www.cnbc.com/2024/09/11/trump-trade-policies-will-fuel-freight-rates-consumers-pay-price.html\"\u003ewarned\u003c/a\u003e that Trump\u0026#39;s expansive tariff plans \u003ca href=\"https://www.wsj.com/economy/economists-say-inflation-would-be-worse-under-trump-than-biden-263bc900\" target=\"_blank\"\u003ewill raise prices\u003c/a\u003e, lower U.S. gross domestic product and hurt employment in key industries.\u003c/p\u003e\u003cp\u003eDemocratic presidential nominee \u003ca href=\"https://www.cnbc.com/kamala-harris/\"\u003eKamala Harris\u003c/a\u003e has repeatedly cited a progressive group\u0026#39;s analysis that Trump\u0026#39;s tariffs could equate to a nearly \u003ca href=\"https://www.americanprogressaction.org/article/former-president-trump-proposes-an-up-to-3900-tax-increase-for-a-typical-family/\" target=\"_blank\"\u003e$4,000 tax increase\u003c/a\u003e for the average U.S. family.\u003c/p\u003e\u003cp\u003eThe Trump campaign stressed to CNBC that Trump\u0026#39;s tariff ideas should be viewed in concert with his broader plans, which include slashing regulations, ramping up U.S. oil drilling and deporting millions of undocumented immigrants.\u003c/p\u003e\u003cp\u003eRepublican National Committee spokeswoman Anna Kelly also noted that Harris and President \u003ca href=\"https://www.cnbc.com/joe-biden/\"\u003eJoe Biden\u003c/a\u003e have maintained, and in some cases \u003ca href=\"https://www.reuters.com/business/us-locks-steep-china-tariff-hikes-many-start-sept-27-2024-09-13/\" target=\"_blank\"\u003eboosted\u003c/a\u003e, many of the tariffs from Trump\u0026#39;s first term in office.\u003c/p\u003e\u003cp\u003e\u0026#34;Harris has always opposed tariffs because she can\u0026#39;t be trusted to put workers first, but President Trump will re-shore American jobs, keep inflation low, and raise real wages by lowering taxes, cutting regulations, and unshackling American energy,\u0026#34; Kelly told CNBC in a statement.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003e\u0026#39;Flood the zone\u0026#39;\u003c/h2\u003e\u003cdiv id=\"ArticleBody-InlineImage-108046183\" data-test=\"InlineImage\"\u003e\u003cp\u003eRepublican presidential nominee, former U.S. President Donald Trump, speaks at the Detroit Economic Club on October 10, 2024 in Detroit, Michigan. \u003c/p\u003e\u003cp\u003eBill Pugliano | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe Piper Sandler analysts in Friday\u0026#39;s note relayed their information about Lighthizer as they warned investors to take seriously Trump\u0026#39;s promises to hike tariffs to historic levels.\u003c/p\u003e\u003cp\u003e\u0026#34;We expect the tariffs to come quicker in a second Trump term than the first,\u0026#34; they wrote.\u003c/p\u003e\u003cp\u003eTrump \u0026#34;has the will and the way to follow through on his commitment to impose 60% tariffs on Chinese imports.\u0026#34;\u003c/p\u003e\u003cp\u003eThe analysts wrote that it would not be surprising if Trump were to try to enact a broad 10% tariff by force, even though such an effort would likely be tangled up in court battles over his authority to do so.\u003c/p\u003e\u003cp\u003eIf that happens, they wrote, Trump could \u0026#34;flood the zone\u0026#34; with even more targeted tariffs.\u003c/p\u003e\u003cp\u003eThose narrower tariffs could be focused on countries with whom the U.S. has large trade deficits, or on selected industries like the auto industry, where Trump has vowed to protect U.S. companies.\u003c/p\u003e\u003cp\u003eThe analysts added, \u0026#34;There is little doubt Trump would use the threat of higher tariffs as leverage to win concessions on unrelated issues.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eDeterrent or cash cow?\u003c/h2\u003e\u003cdiv id=\"ArticleBody-InlineImage-108045653\" data-test=\"InlineImage\"\u003e\u003cp\u003eRepublican presidential nominee, former U.S. President Donald Trump speaks during a campaign rally at Riverfront Sports on October 09, 2024 in Scranton, Pennsylvania. \u003c/p\u003e\u003cp\u003eMichael M. Santiago | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTrump\u0026#39;s love of tariffs is well documented. He has presented them on the campaign trail as a panacea, both the key to prosperity and the master tool for reshaping the U.S. economy in a protectionist mold.\u003c/p\u003e\u003cp\u003e\u0026#34;Tariffs are the greatest thing ever invented,\u0026#34; the former president said during a September town hall in Warren, Michigan.\u003c/p\u003e\u003cp\u003eHe argues that his tariff plans will rake in enough money to pay for an array of massive tax cuts, without requiring any compromises or cuts to costly government programs like \u003ca href=\"https://www.cnbc.com/2024/07/08/rnc-panel-adopts-trump-platform-abortion-social-security-medicare.html\"\u003eSocial Security and Medicare\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eAt the same time, Trump has vowed to use tariffs as a tool to deter unwanted foreign competition, and to gain geopolitical leverage over other nations.\u003c/p\u003e\u003cp\u003eTrump has repeatedly called for a 10% universal baseline tariff on foreign imports, and he has floated the possibility of expanding that tariff to 20%.\u003c/p\u003e\u003cp\u003eHe has also called for a 60% tariff on all Chinese imports, and has suggested he would push for even higher tariffs in specific circumstances.\u003c/p\u003e\u003cp\u003eIn a speech Thursday at the Detroit Economic Club, for instance, Trump complained that China is building factories in Mexico to produce cars that would be sold in the U.S.\u003c/p\u003e\u003cp\u003e\u0026#34;I will impose whatever tariffs are required\u0026#34; to stop that effort, Trump said.\u003c/p\u003e\u003cp\u003e\u0026#34;100%, 200% ... 1,000%,\u0026#34; he said. \u0026#34;They\u0026#39;re not going to sell any cars into the United States with those plants they\u0026#39;re building.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"RegularArticle-RelatedContent-1\"\u003e\u003ch2\u003eRead more CNBC politics coverage\u003c/h2\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/10/07/milton-trump-media-truth-social-offices-election.html\"\u003eTrump\u0026#39;s Mar-a-Lago, golf resorts are outside Milton\u0026#39;s path. But Truth Social\u0026#39;s offices are at risk\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/10/07/djt-trump-media-elon-musk-butler-rally.html\"\u003eTrump Media closes up over 11% in heavy trading after ex-president\u0026#39;s rally with Musk\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/10/07/supreme-court-martin-shkreli-appeal-rejected-fine.html\"\u003eSupreme Court rejects Martin Shkreli fine appeal\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/10/07/elon-musk-pac-election-bonus-gun-rights-petition-referrals.html\"\u003e\u0026#39;Easy money\u0026#39;: Trump backer Elon Musk claims PAC will pay $47 for swing state voter information\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2024/10/06/fema-deanne-criswell-slams-trump-false-helene-claims.html\"\u003e\u0026#39;Frankly ridiculous\u0026#39;: FEMA administrator slams Trump for boosting false Helene recovery claims\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eHe has also proposed using tariffs as part of a carrot-and-stick approach to boosting domestic manufacturing.\u003c/p\u003e\u003cp\u003e\u0026#34;If you don\u0026#39;t make your product here, then you will have to pay a tax, or tariff, when you send your product into the United States,\u0026#34; he said in a campaign speech in Michigan in late September. \u0026#34;And we will take in hundred of billions of dollars into our treasury and use that money to benefit the American citizens.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a June \u003ca href=\"https://www.cnbc.com/2024/06/13/trump-all-tariff-policy-to-replace-income-tax.html\"\u003emeeting with Republican lawmakers\u003c/a\u003e on Capitol Hill, Trump even floated the idea of scrapping the federal income tax altogether, and replacing it with revenues from tariffs.\u003c/p\u003e\u003cp\u003eThe Peterson Institute for International Economics \u003ca href=\"https://www.piie.com/blogs/realtime-economics/2024/can-trump-replace-income-taxes-tariffs\" target=\"_blank\"\u003etorched that idea\u003c/a\u003e, saying it is \u0026#34;literally impossible for tariffs to fully replace income taxes\u0026#34; and warning that such a plan would wreak economic havoc.\u003c/p\u003e\u003cp\u003eAll the while, Trump asserts that his tariffs will not exacerbate already-high consumer prices, which he blames Biden and Harris for causing.\u003c/p\u003e\u003cp\u003e\u0026#34;They aren\u0026#39;t gonna have higher prices,\u0026#34; Trump said during the Sept. 10 presidential debate. \u0026#34;Who\u0026#39;s gonna have higher prices is China and all of the countries that have been ripping us off for years.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-10-12T12:29:24Z",
  "modifiedTime": "2024-10-12T13:57:11Z"
}
