{
  "id": "37924878-b8b5-46b5-b04b-ff963643bbaf",
  "title": "5.6-magnitude quake rattles southern Philippines",
  "link": "https://timesofindia.indiatimes.com/world/rest-of-world/5-6-magnitude-quake-rattles-southern-philippines/articleshow/120325305.cms",
  "description": "A magnitude 5.6 earthquake struck off the southern Philippines on Wednesday, the United States Geological Survey (USGS) said, with no immediate reports of damage or casualties. We have checked but it was negative (for damage or casualties),\" said Gilbert Rolifor, a fire department official in Maitum.",
  "author": "",
  "published": "2025-04-16T05:26:47+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "AFP",
  "length": 1109,
  "excerpt": "A magnitude 5.6 earthquake struck off the southern Philippines on Wednesday, the United States Geological Survey (USGS) said, with no immediate report",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "A magnitude 5.6 earthquake struck off the southern Philippines on Wednesday, the United States Geological Survey (USGS) said, with no immediate reports of damage or casualties.The quake off the coast of the island of Mindanao had a depth of 30 kilometres (18.6 miles), the USGS added. The Philippine Institute of Volcanology and Seismology placed the epicentre about 43 kilometres southwest of the town of Maitum, located in a mountainous and sparsely populated area.Local authorities told AFP early indications were that the quake had caused no significant damage.\"It was strong but didn't last long. We have checked but it was negative (for damage or casualties),\" said Gilbert Rolifor, a fire department official in Maitum.Quakes are a daily occurrence in the Philippines, which sits along the Pacific \"Ring of Fire\", an arc of intense seismic and volcanic activity that stretches from Japan through Southeast Asia and across the Pacific basin. Most are too weak to be felt by humans, but strong and destructive quakes come at random with no technology available to predict when and where they will happen.",
  "image": "https://static.toiimg.com/thumb/msid-120325417,width-1070,height-580,imgsize-674871,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cp\u003e\u003cspan data-pos=\"1\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eA magnitude 5.6 earthquake struck off the southern Philippines on Wednesday, the United States Geological Survey (USGS) said, with no immediate reports of damage or casualties.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"4\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe quake off the coast of the island of Mindanao had a depth of 30 kilometres (18.6 miles), the USGS added. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"7\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe Philippine Institute of Volcanology and Seismology placed the epicentre about 43 kilometres southwest of the town of Maitum, located in a mountainous and sparsely populated area.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"9\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eLocal authorities told AFP early indications were that the quake had caused no significant damage.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"11\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u0026#34;It was strong but didn\u0026#39;t last long. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"13\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eWe have checked but it was negative (for damage or casualties),\u0026#34; said Gilbert Rolifor, a fire department official in Maitum.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"15\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eQuakes are a daily occurrence in the Philippines, which sits along the Pacific \u0026#34;Ring of Fire\u0026#34;, an arc of intense seismic and volcanic activity that stretches from Japan through Southeast Asia and across the Pacific basin. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"17\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eMost are too weak to be felt by humans, but strong and destructive quakes come at random with no technology available to predict when and where they will happen.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-16T05:26:00+05:30",
  "modifiedTime": null
}
