{
  "id": "3c330677-63eb-4493-948d-1bb0acee5f0f",
  "title": "‘Will not walk free in our country again’: Feds plan to deport Kilmar Abrego Garcia for 'horrific crimes'; accused denies charges",
  "link": "https://timesofindia.indiatimes.com/world/us/will-not-walk-free-in-our-country-again-feds-plan-to-deport-kilmar-abrego-garcia-for-horrific-crimes-accused-denies-charges/articleshow/122099487.cms",
  "description": "Federal prosecutors have indicated that the Trump administration intends to deport Kilmar Abrego Garcia, charged with human smuggling and alleged MS-13 affiliation, to a country other than El Salvador if he's released from jail. His attorneys are fighting to have him returned to Maryland for his ongoing criminal case, fearing swift deportation by ICE.",
  "author": "TOI World Desk",
  "published": "2025-06-27T04:01:17+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 2464,
  "excerpt": "US News: Federal prosecutors have indicated that the Trump administration intends to deport Kilmar Abrego Garcia, charged with human smuggling and alleged MS-1",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Federal prosecutors informed a judge on Thursday that if Kilmar Abrego Garcia is released from a Tennessee jail, the Trump administration will initiate removal proceedings to deport him to a country other than his native El Salvador, according to Fox News.When US Magistrate Judge Paula Xinis questioned the timing of the removal, asking whether it would be “30 seconds, 30 days, or 30 months,” a federal prosecutor responded that he could only confirm the removal was not “imminent.”Judge Xinis has scheduled the next hearing on the matter for July 7. \"This defendant has been charged with horrific crimes, including trafficking children, and will not walk free in our country again,\" a Justice Department spokesperson told Fox News. \"This defendant has been charged with horrific crimes, including trafficking children, and will not walk free in our country again,\" a justice department spokesperson told Fox News. The central issue is whether Judge Paula Xinis has the authority to order Kilmar Abrego Garcia’s return to Maryland. His attorneys are urging the judge to require the government to bring him back to Maryland and to block US immigration and customs enforcement (ICE) from deporting him while his criminal case in Tennessee is ongoing.Garcia is currently being held in federal custody and faces charges of human smuggling, which he denies.On Thursday, Abrego Garcia’s lawyers filed an emergency motion requesting that a judge order his return to Maryland and prevent immigration officials from deporting him while his criminal case in Tennessee remains ongoing.They told Judge Xinis that they have concerns \"that the government may try to remove Garcia quickly over the weekend.\"Another federal judge in Nashville previously ruled that Abrego Garcia has the right to be released while awaiting trial. However, on Wednesday, she opted to keep him in custody for a few more days, citing concerns that US immigration officials might attempt to deport him again quickly.The Trump administration continues to allege that Abrego Garcia was affiliated with the MS-13 gang, a claim he firmly denies. Additionally, his wife, Jennifer Vasquez Sura, filed a protective order against him in August 2020. The protective order stated that Abrego Garcia posed a threat to their son and her stepchildren, accusing him of verbally and physically abusing her and mentally abusing the children.Earlier this month, Abrego Garcia pleaded not guilty to smuggling charges.",
  "image": "https://static.toiimg.com/thumb/msid-122099596,width-1070,height-580,imgsize-566041,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-122099596,imgsize-566041,width-400,resizemode-4/122099596.jpg\" alt=\"‘Will not walk free in our country again’: Feds plan to deport Kilmar Abrego Garcia for \u0026#39;horrific crimes\u0026#39;; accused denies charges\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eFederal prosecutors informed a judge on Thursday that if Kilmar Abrego Garcia is released from a Tennessee jail, the Trump administration will initiate removal proceedings to deport him to a country other than his native El Salvador, according to Fox News.\u003cspan data-pos=\"2\"\u003e\u003c/span\u003eWhen US Magistrate Judge Paula Xinis questioned the timing of the removal, asking whether it would be “30 seconds, 30 days, or 30 months,” a federal prosecutor responded that he could only confirm the removal was not “imminent.”\u003cspan data-pos=\"4\"\u003e\u003c/span\u003eJudge Xinis has scheduled the next hearing on the matter for July 7. \u003cspan data-pos=\"6\"\u003e\u003c/span\u003e\u0026#34;This defendant has been charged with horrific crimes, including trafficking children, and will not walk free in our country again,\u0026#34; a Justice Department spokesperson told Fox News. \u003cspan data-pos=\"9\"\u003e\u003c/span\u003e\u0026#34;This defendant has been charged with horrific crimes, including trafficking children, and will not walk free in our country again,\u0026#34; a justice department spokesperson told Fox News. \u003cspan data-pos=\"11\"\u003e\u003c/span\u003eThe central issue is whether Judge Paula Xinis has the authority to order Kilmar Abrego Garcia’s return to Maryland. His attorneys are urging the judge to require the government to bring him back to Maryland and to block US immigration and customs enforcement (ICE) from deporting him while his criminal case in Tennessee is ongoing.\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"14\"\u003e\u003c/span\u003eGarcia is currently being held in federal custody and faces charges of human smuggling, which he denies.\u003cspan data-pos=\"16\"\u003e\u003c/span\u003eOn Thursday, Abrego Garcia’s lawyers filed an emergency motion requesting that a judge order his return to Maryland and prevent immigration officials from deporting him while his criminal case in Tennessee remains ongoing.\u003cspan data-pos=\"18\"\u003e\u003c/span\u003eThey told Judge Xinis that they have concerns \u0026#34;that the government may try to remove Garcia quickly over the weekend.\u0026#34;\u003cspan data-pos=\"21\"\u003e\u003c/span\u003eAnother federal judge in Nashville previously ruled that Abrego Garcia has the right to be released while awaiting trial. However, on Wednesday, she opted to keep him in custody for a few more days, citing concerns that US immigration officials might attempt to deport him again quickly.\u003cspan data-pos=\"23\"\u003e\u003c/span\u003eThe Trump administration continues to allege that Abrego Garcia was affiliated with the MS-13 gang, a claim he firmly denies. Additionally, his wife, Jennifer Vasquez Sura, filed a protective order against him in August 2020. \u003cspan data-pos=\"26\"\u003e\u003c/span\u003eThe protective order stated that Abrego Garcia posed a threat to their son and her stepchildren, accusing him of verbally and physically abusing her and mentally abusing the children.\u003cspan data-pos=\"28\"\u003e\u003c/span\u003eEarlier this month, Abrego Garcia pleaded not guilty to smuggling charges.\u003cspan data-pos=\"30\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-27T04:01:00+05:30",
  "modifiedTime": null
}
