{
  "id": "42ececd2-6648-401c-999a-4df8b36fef02",
  "title": "Exclusive-Order by Hegseth to cancel Ukraine weapons caught White House off guard",
  "link": "https://www.yahoo.com/news/exclusive-order-hegseth-cancel-ukraine-091712524.html",
  "description": "",
  "author": "",
  "published": "2025-05-06T09:17:12Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Erin Banco, Phil Stewart, Gram Slattery and Mike Stone",
  "length": 12156,
  "excerpt": "Roughly a week after Donald Trump started his second term as president, the U.S. military issued an order to three freight airlines operating out of Dover...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "By Erin Banco, Phil Stewart, Gram Slattery and Mike StoneNEW YORK/WASHINGTON (Reuters) - Roughly a week after Donald Trump started his second term as president, the U.S. military issued an order to three freight airlines operating out of Dover Air Force Base in Delaware and a U.S. base in Qatar: Stop 11 flights loaded with artillery shells and other weaponry and bound for Ukraine.In a matter of hours, frantic questions reached Washington from Ukrainians in Kyiv and from officials in Poland, where the shipments were coordinated. Who had ordered the U.S. Transportation Command, known as TRANSCOM, to halt the flights? Was it a permanent pause on all aid? Or just some?Top national security officials — in the White House, the Pentagon and the State Department — couldn’t provide answers. Within one week, flights were back in the air.The verbal order originated from the office of Pete Hegseth, the secretary of defense, according to TRANSCOM records reviewed by Reuters. A TRANSCOM spokesperson said the command received the order via the Pentagon's Joint Staff.The cancelations came after Trump wrapped up a January 30 Oval Office meeting about Ukraine that included Hegseth and other top national security officials, according to three sources familiar with the situation. During the meeting, the idea of stopping Ukraine aid came up, said two people with knowledge of the meeting, but the president issued no instruction to stop aid to Ukraine.The president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.Asked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration's position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”The cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.An order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.The story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.The multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.Reuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.“This is consistent with the administration's policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”The stop in shipments caused consternation in Kyiv.The Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.The shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of U.S. military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.That hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the U.S. military's orders.The revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.The canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.Reuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.Four other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.Two people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.FLIGHTS CANCELEDAccording to two sources with knowledge of the meeting, Hegseth arrived at the January 30 Oval Office meeting with Trump with a memo drafted by some of his top policy advisers, advocating that their boss push the White House to consider pausing weapons deliveries to Ukraine to gain leverage in peace negotiations with Russia.The sources said the secretary attended the meeting with other top officials involved in Ukraine policy, including National Security Adviser Mike Waltz and Ukraine envoy Keith Kellogg. The group broadly discussed U.S. policy on Ukraine and Russia, including potentially tightening sanctions on Moscow.It’s not clear the extent to which Hegseth proposed stopping aid during the meeting, but the idea came up in discussions, said one of the sources and another person familiar with the meeting.Since the beginning of Russia’s full-scale invasion in February 2022, the U.S. had approved billions of dollars worth of military aid to Ukraine. Most was delivered under the Biden administration. But a few shipments remained in the pipeline, scheduled into this summer.Trump had threatened to freeze aid repeatedly on the campaign trail, but had yet to do so. And during the meeting, he again declined to stop aid to Ukraine or order Hegseth to implement any policy changes when it came to sending equipment to Kyiv, the sources said.An order effectively freezing any military support for an ally would normally be discussed intensively among top national security officials and approved by the president. It requires the coordination of multiple agencies and often multiple freight companies.None of that discussion or coordination happened when Hegseth’s office canceled the scheduled flights carrying American artillery shells and ammunition to Poland from Al Udeid military base in Qatar and the Dover U.S. military base in Delaware, three of the sources said.The pause came as Ukraine’s military was struggling to fend off Russian forces in eastern Ukraine and in the consequential battle for the Kursk region of Russia, where Ukrainian forces were losing ground and have since all but been expelled.Close Trump advisers got tipped off to the pause by Pentagon staffers and discussed with the president whether to restore the aid shipments, according to two sources. By then, TRANSCOM had canceled 11 flights, according to the records reviewed by Reuters. Some media outlets, including Reuters, wrote about the pause but Hegseth’s role was previously unknown.It’s unclear if Trump subsequently questioned or reprimanded Hegseth. One source with direct knowledge of the matter said National Security Adviser Waltz ultimately intervened to reverse the cancelations. Waltz was forced out on Thursday and is expected to be nominated as U.S. ambassador to the United Nations.GROWING INFIGHTINGWhen Trump entered office, aid to Ukraine continued flowing and he pledged to work with Ukraine and Russia to end the war – or at the very least broker a ceasefire.Two of his most prominent envoys, Kellogg, a supporter of Kyiv who worked with Trump in his first administration, and Steve Witkoff, a real-estate magnate and close friend of the president, set out to negotiate with both parties.Separately, at the Pentagon, some of Hegseth’s policy advisers privately started drafting proposals to pull back American support for Ukraine, according to two sources briefed on the matter.That group of staffers align themselves closely with the anti-interventionist philosophy.Some have previously advised Republican lawmakers advocating for an America-first approach to foreign policy and have called publicly, in writings and talks, for the U.S. to pull back from military commitments in the Mideast and Europe – a view similarly held by Vice President JD Vance. Several have advocated that the U.S. instead focus on China.Supporters of the staffers have slammed those pushing back on the anti-interventionist movement in the administration, claiming Vance and others are merely trying to save the lives of people living in warzones like Ukraine and prevent future American military deaths.The infighting has complicated the policy-making process, according to a person familiar with the matter and four other sources. At a time when Kellogg and Witkoff are trying to broker a peace deal with Russia and Ukraine, the staffers have advocated behind the scenes for the U.S. to draw back its support for Kyiv – a policy that has angered Ukrainian officials and pressured European allies to fill the gap, five people with knowledge of the situation said.Washington has signed a deal with Kyiv for rights to its rare earth minerals – an agreement U.S. officials say is an attempt to recoup money America has spent to prop up Ukraine’s war effort.At least one of the staffers who had previously pushed for the administration to pull back its support for Kyiv, Dan Caldwell, was escorted out of the Pentagon for a leak he claims never happened. Caldwell, a veteran, served as one of Hegseth’s chief advisers, including on Ukraine.Despite the brief pause in February and the longer one that began in early March, the Trump administration has resumed sending the last of the aid approved under U.S. President Joe Biden. No new policy has been announced.(This story has been corrected to say that the U.S. base is in Qatar, not United Arab Emirates, in paragraph 31)(Reporting by Erin Banco, Phil Stewart, Gram Slattery and Mike Stone. Editing by Don Durfee and Lori Hinnant.)",
  "image": "https://media.zenfs.com/en/reuters.com/0d53f7d944f85fee59ae9ae7dce0ee59",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eBy Erin Banco, Phil Stewart, Gram Slattery and Mike Stone\u003c/p\u003e\u003cp\u003eNEW YORK/WASHINGTON (Reuters) - Roughly a week after Donald Trump started his second term as president, the U.S. military issued an order to three freight airlines operating out of Dover Air Force Base in Delaware and a U.S. base in Qatar: Stop 11 flights loaded with artillery shells and other weaponry and bound for Ukraine.\u003c/p\u003e\u003cp\u003eIn a matter of hours, frantic questions reached Washington from Ukrainians in Kyiv and from officials in Poland, where the shipments were coordinated. Who had ordered the U.S. Transportation Command, known as TRANSCOM, to halt the flights? Was it a permanent pause on all aid? Or just some?\u003c/p\u003e\u003cp\u003eTop national security officials — in the White House, the Pentagon and the State Department — couldn’t provide answers. Within one week, flights were back in the air.\u003c/p\u003e\u003cp\u003eThe verbal order originated from the office of Pete Hegseth, the secretary of defense, according to TRANSCOM records reviewed by Reuters. A TRANSCOM spokesperson said the command received the order via the Pentagon\u0026#39;s Joint Staff.\u003c/p\u003e\u003cp\u003eThe cancelations came after Trump wrapped up a January 30 Oval Office meeting about Ukraine that included Hegseth and other top national security officials, according to three sources familiar with the situation. During the meeting, the idea of stopping Ukraine aid came up, said two people with knowledge of the meeting, but the president issued no instruction to stop aid to Ukraine.\u003c/p\u003e\u003cp\u003eThe president was unaware of Hegseth’s order, as were other top national security officials in the meeting, according to two sources briefed on the private White House discussions and another with direct knowledge of the matter.\u003c/p\u003e\u003cp\u003eAsked to comment on this report, the White House told Reuters that Hegseth had followed a directive from Trump to pause aid to Ukraine, which it said was the administration\u0026#39;s position at the time. It did not explain why, according to those who spoke to Reuters, top national security officials in the normal decision making process didn’t know about the order or why it was so swiftly reversed.\u003c/p\u003e\u003cp\u003e“Negotiating an end to the Russia-Ukraine War has been a complex and fluid situation. We are not going to detail every conversation among top administration officials throughout the process,” said Karoline Leavitt, the White House spokeswoman. “The bottom line is the war is much closer to an end today than it was when President Trump took office.”\u003c/p\u003e\u003cp\u003eThe cancelations cost TRANSCOM $2.2 million, according to the records reviewed by Reuters. In response to a request for comment, TRANSCOM said that the total cost was $1.6 million – 11 flights were canceled but one incurred no charge.\u003c/p\u003e\u003cp\u003eAn order halting military aid authorized under the Biden administration went into effect officially a month later, on March 4, with a White House announcement.\u003c/p\u003e\u003cp\u003eThe story of how flights were canceled, detailed by Reuters for the first time, points to an at-times haphazard policy-making process within the Trump administration and a command structure that is unclear even to its own ranking members.\u003c/p\u003e\u003cp\u003eThe multiday pause of the flights, confirmed by five people with knowledge of it, also shows confusion in how the administration has created and implemented national security policy. At the Pentagon, the disarray is an open secret, with many current and former officials saying the department is plagued by internal disagreements on foreign policy, deep-seated grudges, and inexperienced staff.\u003c/p\u003e\u003cp\u003eReuters couldn’t establish exactly when Hegseth’s office ordered the freight flights canceled. Two sources said Ukrainian and European officials began asking about the pause on February 2. The TRANSCOM records indicate that there was a verbal order from “SECDEF” – the secretary of defense – that stopped the flights and that they had resumed by February 5.\u003c/p\u003e\u003cp\u003e“This is consistent with the administration\u0026#39;s policy to move fast, break things and sort it out later. That is their managing philosophy,” said Mark Cancian, a retired Marine officer and defense expert with the Center for Strategic and International Studies think tank. “That is great for Silicon Valley. But when you’re talking about institutions that have been around for hundreds of years, you are going to run into problems.”\u003c/p\u003e\u003cp\u003eThe stop in shipments caused consternation in Kyiv.\u003c/p\u003e\u003cp\u003eThe Ukrainians quickly asked the administration through multiple channels but had difficulty obtaining any useful information, according to a Ukrainian official with direct knowledge of the situation. In later conversations with the Ukrainians, the administration wrote off the pause as “internal politics,” said the source. Ukrainian officials did not respond to requests for comment.\u003c/p\u003e\u003cp\u003eThe shipping of American weapons to Ukraine requires sign-off from multiple agencies and can take weeks or even months to complete, depending on the size of the cargo. The majority of U.S. military assistance goes through a logistics hub in Poland before being picked up by Ukrainian representatives and transported into the country.\u003c/p\u003e\u003cp\u003eThat hub can hold shipments for extended periods of time. It’s not clear if the 11 canceled flights were the only ones scheduled that week in February, how much aid was already stockpiled in Poland and if it continued to flow into Ukraine despite the U.S. military\u0026#39;s orders.\u003c/p\u003e\u003cp\u003eThe revelations come at a time of upheaval in the department. Several of Hegseth’s top advisers were escorted from the building April 15 after being accused of unauthorized disclosure of classified information. The secretary continues to face scrutiny, including from Congress, about his own communications. Previously he’s attributed allegations of upheaval to disgruntled employees.\u003c/p\u003e\u003cp\u003eThe canceled flights contained weapons that had long been approved by the Biden administration, authorized by lawmakers on Capitol Hill.\u003c/p\u003e\u003cp\u003eReuters couldn’t determine if Hegseth or his team knew how the order to TRANSCOM would play out or that the order would be a substantial change in U.S. policy on Ukraine. Three sources familiar with the situation said Hegseth misinterpreted discussions with the president about Ukraine policy and aid shipments without elaborating further.\u003c/p\u003e\u003cp\u003eFour other people briefed on the situation said a small cadre of staffers inside the Pentagon, many of whom have never held a government job and who have for years spoken out against U.S. aid to Ukraine, advised Hegseth to consider pausing aid to the country.\u003c/p\u003e\u003cp\u003eTwo people familiar with the matter denied there was a true cutoff in aid. One of them described it as a logistical pause.\u003c/p\u003e\u003cp\u003e“(They) just wanted to get a handle on what was going on and people, as a result, misinterpreted that as: ‘You need to stop everything,’” said one.\u003c/p\u003e\u003cp\u003eFLIGHTS CANCELED\u003c/p\u003e\u003cp\u003eAccording to two sources with knowledge of the meeting, Hegseth arrived at the January 30 Oval Office meeting with Trump with a memo drafted by some of his top policy advisers, advocating that their boss push the White House to consider pausing weapons deliveries to Ukraine to gain leverage in peace negotiations with Russia.\u003c/p\u003e\u003cp\u003eThe sources said the secretary attended the meeting with other top officials involved in Ukraine policy, including National Security Adviser Mike Waltz and Ukraine envoy Keith Kellogg. The group broadly discussed U.S. policy on Ukraine and Russia, including potentially tightening sanctions on Moscow.\u003c/p\u003e\u003cp\u003eIt’s not clear the extent to which Hegseth proposed stopping aid during the meeting, but the idea came up in discussions, said one of the sources and another person familiar with the meeting.\u003c/p\u003e\u003cp\u003eSince the beginning of Russia’s full-scale invasion in February 2022, the U.S. had approved billions of dollars worth of military aid to Ukraine. Most was delivered under the Biden administration. But a few shipments remained in the pipeline, scheduled into this summer.\u003c/p\u003e\u003cp\u003eTrump had threatened to freeze aid repeatedly on the campaign trail, but had yet to do so. And during the meeting, he again declined to stop aid to Ukraine or order Hegseth to implement any policy changes when it came to sending equipment to Kyiv, the sources said.\u003c/p\u003e\u003cp\u003eAn order effectively freezing any military support for an ally would normally be discussed intensively among top national security officials and approved by the president. It requires the coordination of multiple agencies and often multiple freight companies.\u003c/p\u003e\u003cp\u003eNone of that discussion or coordination happened when Hegseth’s office canceled the scheduled flights carrying American artillery shells and ammunition to Poland from Al Udeid military base in Qatar and the Dover U.S. military base in Delaware, three of the sources said.\u003c/p\u003e\u003cp\u003eThe pause came as Ukraine’s military was struggling to fend off Russian forces in eastern Ukraine and in the consequential battle for the Kursk region of Russia, where Ukrainian forces were losing ground and have since all but been expelled.\u003c/p\u003e\u003cp\u003eClose Trump advisers got tipped off to the pause by Pentagon staffers and discussed with the president whether to restore the aid shipments, according to two sources. By then, TRANSCOM had canceled 11 flights, according to the records reviewed by Reuters. Some media outlets, including Reuters, wrote about the pause but Hegseth’s role was previously unknown.\u003c/p\u003e\u003cp\u003eIt’s unclear if Trump subsequently questioned or reprimanded Hegseth. One source with direct knowledge of the matter said National Security Adviser Waltz ultimately intervened to reverse the cancelations. Waltz was forced out on Thursday and is expected to be nominated as U.S. ambassador to the United Nations.\u003c/p\u003e\u003cp\u003eGROWING INFIGHTING\u003c/p\u003e\u003cp\u003eWhen Trump entered office, aid to Ukraine continued flowing and he pledged to work with Ukraine and Russia to end the war – or at the very least broker a ceasefire.\u003c/p\u003e\u003cp\u003eTwo of his most prominent envoys, Kellogg, a supporter of Kyiv who worked with Trump in his first administration, and Steve Witkoff, a real-estate magnate and close friend of the president, set out to negotiate with both parties.\u003c/p\u003e\u003cp\u003eSeparately, at the Pentagon, some of Hegseth’s policy advisers privately started drafting proposals to pull back American support for Ukraine, according to two sources briefed on the matter.\u003c/p\u003e\u003cp\u003eThat group of staffers align themselves closely with the anti-interventionist philosophy.\u003c/p\u003e\u003cp\u003eSome have previously advised Republican lawmakers advocating for an America-first approach to foreign policy and have called publicly, in writings and talks, for the U.S. to pull back from military commitments in the Mideast and Europe – a view similarly held by Vice President JD Vance. Several have advocated that the U.S. instead focus on China.\u003c/p\u003e\u003cp\u003eSupporters of the staffers have slammed those pushing back on the anti-interventionist movement in the administration, claiming Vance and others are merely trying to save the lives of people living in warzones like Ukraine and prevent future American military deaths.\u003c/p\u003e\u003cp\u003eThe infighting has complicated the policy-making process, according to a person familiar with the matter and four other sources. At a time when Kellogg and Witkoff are trying to broker a peace deal with Russia and Ukraine, the staffers have advocated behind the scenes for the U.S. to draw back its support for Kyiv – a policy that has angered Ukrainian officials and pressured European allies to fill the gap, five people with knowledge of the situation said.\u003c/p\u003e\u003cp\u003eWashington has signed a deal with Kyiv for rights to its rare earth minerals – an agreement U.S. officials say is an attempt to recoup money America has spent to prop up Ukraine’s war effort.\u003c/p\u003e\u003cp\u003eAt least one of the staffers who had previously pushed for the administration to pull back its support for Kyiv, Dan Caldwell, was escorted out of the Pentagon for a leak he claims never happened. Caldwell, a veteran, served as one of Hegseth’s chief advisers, including on Ukraine.\u003c/p\u003e\u003cp\u003eDespite the brief pause in February and the longer one that began in early March, the Trump administration has resumed sending the last of the aid approved under U.S. President Joe Biden. No new policy has been announced.\u003c/p\u003e\u003cp\u003e(This story has been corrected to say that the U.S. base is in Qatar, not United Arab Emirates, in paragraph 31)\u003c/p\u003e\u003cp\u003e(Reporting by Erin Banco, Phil Stewart, Gram Slattery and Mike Stone. Editing by Don Durfee and Lori Hinnant.)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2025-05-06T09:17:12Z",
  "modifiedTime": null
}
