{
  "id": "452a54d0-2043-49fc-9b5d-3590bdfaf69c",
  "title": "U.S. energy secretary says shale industry will 'survive and thrive' despite plunging crude prices",
  "link": "https://www.cnbc.com/2025/04/11/us-energy-secretary-bullish-on-shale-despite-plunging-oil-prices-.html",
  "description": "Commodities analysts estimate that U.S. crude needs to stay above $65 per barrel to keep shale producers in business.",
  "author": "",
  "published": "Fri, 11 Apr 2025 13:50:38 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Natasha Turak",
  "length": 4103,
  "excerpt": "Commodities analysts estimate that U.S. crude needs to stay above $65 per barrel to keep shale producers in business.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "ABU DHABI, United Arab Emirates — U.S. Energy Secretary Chris Wright is not worried about falling oil prices and their impact on America's shale oil industry, and is stressing that the coming years should be a time of energy abundance for the world's largest economy.\"The U.S. shale industry is going to is going to survive and thrive,\" Wright said in an interview with CNBC's Dan Murphy in the United Arab Emirates' capital Abu Dhabi. \"But of course,\" he added, \"investment decisions are going to be tailored if prices stay long for stay this low for a long period of time. But I'm quite bullish on the U.S. industry.\"Oil prices have come under pressure amid lower global demand, mounting uncertainty over tariffs, and greater supply on the market from both OPEC and non-OPEC countries — with lower revenues threatening the viability of shale producers.The June expiry contract of global benchmark Brent crude was trading at $63.51 per barrel on Friday at 1:43 p.m. in London, up 0.28% from the Thursday settlement. The front-month May U.S. WTI contract was at $60.26 per barrel, higher by 0.32% from the previous day's close price. Both contracts are down roughly 22% in the last year.To make his point, Wright referenced the 2014 to 2016 period, during which a boom in shale production coincided with lower global demand and brought oil prices down 70%. The industry was forced to grapple with a tidal wave of bankruptcies.But the energy secretary took an optimistic angle. \"In 2015 and 2016 oil prices twice hit $28 [per barrel], and what happened? What did the U.S. shale industry do in that time — innovate, get smarter, drive their costs down, and that's what's happening right now,\" Wright said.Commodities analysts estimate that U.S. crude needs to stay above $65 per barrel to keep shale producers in business. Goldman Sachs this week lowered its oil price forecast for U.S. WTI to $58 per barrel by December 2025 and $51 per barrel by December 2026, down from a previous outlook of $66 per barrel this year and $59 per barrel in 2026.Wright himself is a former shale executive, having founded and served as CEO of the Denver-based oilfield services company Liberty Energy until stepping down to join the U.S. President Donald Trump's administration. Liberty Energy's share price has suffered amid the slide in oil prices and trade tensions, with shares down over 46% year-to-date.The energy secretary's comments come roughly a week after the alliance of OPEC and its non-OPEC oil-producing partners, known as OPEC+, made the shock decision to accelerate its already planned crude production hikes, adding more supply to an already saturated market. The decision helped push crude prices down further.Long-term, however, OPEC+ members need higher oil prices to balance their budgets. By contrast, Trump has promised to \"drill, baby, drill\" to keep prices down for American consumers, and has long been vocal about wanting OPEC members to pump more oil for that reason.Asked if this could eventually put the U.S. and OPEC on a collision course, Wright responded in the negative.\"I don't think it's a collision course at all. What we see, and what I saw here in the UAE, and you see in Saudi [Arabia] and Qatar is a very long-term vision of energy,\" Wright said.\"Yeah, of course there's some extra short term reduction in revenues if you have lower oil and gas prices. But the investments that are made here and the relationships that are built here, these are looking out decades into the future.\"Wright insisted there was overall alignment in the energy strategies of the U.S. and its oil-rich Arab Gulf allies in particular, whose leaders he is scheduled to meet with during the course of his Middle East visit, which comes ahead of an anticipated visit to the region by Trump.\"The way to make American lives better, and the citizens of the world better, is larger energy, more affordable energy, and just a much more bright and prosperous future,\" Wright said. \"That's the path we're on. And I think certainly [the] UAE and Saudi Arabia and Qatar, I think we're all aligned in that mission.\"",
  "image": "https://image.cnbcfm.com/api/v1/image/108118687-17424203262025-03-19t213750z_387949733_rc2lgda0xghi_rtrmadp_0_usa-trump.jpeg?v=1742420403\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108130744\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000372661\" aria-labelledby=\"Placeholder-ArticleBody-Video-108130744\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108130745-17443767651744376763-39311830378-1080pnbcnews.jpg?v=1744376764\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"U.S. Energy Secretary: America\u0026#39;s shale industry will \u0026#39;survive and thrive\u0026#39; despite tanking oil prices\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eABU DHABI, United Arab Emirates — U.S. Energy Secretary Chris Wright is not worried about falling oil prices and their impact on America\u0026#39;s shale oil industry, and is stressing that the coming years should be a time of energy abundance for the world\u0026#39;s largest economy.\u003c/p\u003e\u003cp\u003e\u0026#34;The U.S. shale industry is going to is going to survive and thrive,\u0026#34; Wright said in an interview with CNBC\u0026#39;s Dan Murphy in the United Arab Emirates\u0026#39; capital Abu Dhabi. \u0026#34;But of course,\u0026#34; he added, \u0026#34;investment decisions are going to be tailored if prices stay long for stay this low for a long period of time. But I\u0026#39;m quite bullish on the U.S. industry.\u0026#34;\u003c/p\u003e\u003cp\u003eOil prices have come under pressure amid lower global demand, mounting uncertainty over tariffs, and \u003ca href=\"https://www.cnbc.com/2025/04/04/why-opec-is-accelerating-oil-production-as-prices-tank-tariffs-hit.html\"\u003egreater supply on the market from both OPEC and non-OPEC countries\u003c/a\u003e — with lower revenues threatening the viability of shale producers.\u003c/p\u003e\u003cp\u003eThe June expiry contract of global benchmark Brent crude was trading at $63.51 per barrel on Friday at 1:43 p.m. in London, up 0.28% from the Thursday settlement. The front-month May \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-2\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/@CL.1/\"\u003eU.S. WTI\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e contract was at $60.26 per barrel, higher by 0.32% from the previous day\u0026#39;s close price. Both contracts are down roughly 22% in the last year.\u003c/p\u003e\u003cp\u003eTo make his point, Wright referenced the 2014 to 2016 period, during which a boom in shale production coincided with lower global demand and brought oil prices down 70%. The industry was forced to grapple with \u003ca href=\"https://asia.nikkei.com/Business/Markets/Commodities/Bankruptcies-continue-in-US-shale-oil-industry\" target=\"_blank\"\u003ea tidal wave of bankruptcies.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eBut the energy secretary took an optimistic angle. \u0026#34;In 2015 and 2016 oil prices twice hit $28 [per barrel], and what happened? What did the U.S. shale industry do in that time — innovate, get smarter, drive their costs down, and that\u0026#39;s what\u0026#39;s happening right now,\u0026#34; Wright said.\u003c/p\u003e\u003cp\u003eCommodities analysts estimate that U.S. crude needs to stay above $65 per barrel to keep shale producers in business. Goldman Sachs this week lowered its oil price forecast for U.S. WTI to $58 per barrel by December 2025 and $51 per barrel by December 2026, down from a previous outlook of $66 per barrel this year and $59 per barrel in 2026.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108130615\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000372628\" aria-labelledby=\"Placeholder-ArticleBody-Video-108130615\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108130616-17443618321744361829-39309301987-1080pnbcnews.jpg?v=1744361831\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"U.S. could tip into recession next year, weakening the oil demand outlook: Analyst\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWright himself is a former shale executive, having founded and served as CEO of the Denver-based oilfield services company \u003ca href=\"https://www.cnbc.com/quotes/LBRT\"\u003eLiberty Energy\u003c/a\u003e until stepping down to join the U.S. President Donald Trump\u0026#39;s administration. Liberty Energy\u0026#39;s \u003ca href=\"https://www.cnbc.com/2025/04/04/energy-secretarys-former-firm-plummets-after-trump-tariff-escalation.html\"\u003eshare price has suffered\u003c/a\u003e amid the slide in oil prices and trade tensions, with shares down over 46% year-to-date.\u003c/p\u003e\u003cp\u003eThe energy secretary\u0026#39;s comments come roughly a week after the alliance of OPEC and its non-OPEC oil-producing partners, known as OPEC+, \u003ca href=\"https://www.cnbc.com/2025/04/03/eight-opec-producers-accelerate-crude-oil-output-hikes-pushing-oil-prices-down-6percent-.html\"\u003emade the shock decision to accelerate\u003c/a\u003e its already planned crude production hikes, adding more supply to an already saturated market. The decision helped push crude prices down further.\u003c/p\u003e\u003cp\u003eLong-term, however, OPEC+ members need higher oil prices to balance their budgets. By contrast, Trump has promised to \u0026#34;drill, baby, drill\u0026#34; to keep prices down for American consumers, and has long been vocal about wanting OPEC members to pump more oil for that reason.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108126430\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000371824\" aria-labelledby=\"Placeholder-ArticleBody-Video-108126430\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108126431-17437625801743762576-39207050434-1080pnbcnews.jpg?v=1743762579\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"OPEC is still holding a lot of the cards, energy analyst says\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAsked if this could eventually put the U.S. and OPEC on a collision course, Wright responded in the negative.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t think it\u0026#39;s a collision course at all. What we see, and what I saw here in the UAE, and you see in Saudi [Arabia] and Qatar is a very long-term vision of energy,\u0026#34; Wright said.\u003c/p\u003e\u003cp\u003e\u0026#34;Yeah, of course there\u0026#39;s some extra short term reduction in revenues if you have lower oil and gas prices. But the investments that are made here and the relationships that are built here, these are looking out decades into the future.\u0026#34;\u003c/p\u003e\u003cp\u003eWright insisted there was overall alignment in the energy strategies of the U.S. and its oil-rich Arab Gulf allies in particular, whose leaders he is scheduled to meet with during the course of his Middle East visit, which comes ahead of an anticipated visit to the region by Trump.\u003c/p\u003e\u003cp\u003e\u0026#34;The way to make American lives better, and the citizens of the world better, is larger energy, more affordable energy, and just a much more bright and prosperous future,\u0026#34; Wright said. \u0026#34;That\u0026#39;s the path we\u0026#39;re on. And I think certainly [the] UAE and Saudi Arabia and Qatar, I think we\u0026#39;re all aligned in that mission.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-11T12:47:04Z",
  "modifiedTime": "2025-04-11T13:50:38Z"
}
