{
  "id": "485ce5eb-34c1-43a9-a938-047365b59233",
  "title": "Elon Musk says he has formed a new U.S. political party, the 'America Party'",
  "link": "https://www.cnbc.com/2025/07/05/elon-musk-america-party-democrats-trump.html",
  "description": "Elon Musk, the world's richest man, suggests the new party would focus \"on just 2 or 3 Senate seats and 8 to 10 House districts.\"",
  "author": "",
  "published": "Sat, 05 Jul 2025 21:45:59 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Erin Doherty",
  "length": 3312,
  "excerpt": "Elon Musk, the world's richest man, suggests the new party would focus \"on just 2 or 3 Senate seats and 8 to 10 House districts.\"",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Elon Musk applaudes in the Oval Office as he attends a press conference with U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 30, 2025.Nathan Howard | ReutersElon Musk said Saturday that he has formed a new political party, the \"America Party,\" which he claims will give Americans \"back your freedom.\"\"By a factor of 2 to 1, you want a new political party and you shall have it!\" Musk wrote on X, one day after he posted a poll on the platform asking his followers if they support creating the \"America Party.\" Musk, the world's richest man, suggested Friday that the new party could focus \"on just 2 or 3 Senate seats and 8 to 10 House districts.\" \"Given the razor-thin legislative margins, that would be enough to serve as the deciding vote on contentious laws, ensuring that they serve the true will of the people,\" Musk said Friday.Musk did not say where the party may be registered. It did not appear to be registered with the Federal Election Committee.He also said that the party would caucus independently and that \"legislative discussions would be had with both parties,\" according to a reply to a user on X.Read more CNBC politics coverageBessent: Tariffs will 'boomerang' back to April levels by Aug. 1 for countries without dealsRep. Green resigns, leaving Speaker Johnson with an even narrower House majorityElon Musk says he has formed a new U.S. political party, the 'America Party'Tariff letters to 12 countries signed, going out Monday: TrumpTrump's tariffs deadline is looming for Europe. Here's where things standTrump speaks with Putin after U.S. pauses some weapons shipments to UkraineHouse narrowly passes Trump's megabill in major victory for RepublicanHouse Republicans race to pass Trump's megabill amid GOP divisionsTrump says U.S. struck Vietnam trade deal that imposes 20% tariff on its importsMusk was the largest donor during the 2024 presidential campaign, giving more than $280 million throughout the cycle, predominantly to presidential candidate Donald Trump, although he also supported other Republican candidates.If Musk chooses to get involved in any competitive congressional races in 2026, it could make a significant difference in a close contest.The Tesla CEO's post comes after a public feud with Trump erupted.It was a dramatic turnaround for the two men, who had been close allies during the early days of the second Trump administration. But their relationship deteriorated as the two men exchanged barbs on social media, mainly due to Musk's vocal opposition to Trump's \"big, beautiful bill,\" CNBC has reported.Musk had previously spearheaded Trump's efforts to slash the federal government through the controversial \"Department of Government Efficiency\" (DOGE), but stepped back from his role in May after his special government employee term ended. Since feuding with Trump, Musk has publicly floated the idea of a new political party, particularly amid his continued strong opposition to Trump's sweeping domestic policy package, which passed last week.\"It is obvious with the insane spending of this bill, which increases the debt ceiling by a record FIVE TRILLION DOLLARS that we live in a one-party country – the PORKY PIG PARTY!!\" Musk said Monday. \"Time for a new political party that actually cares about the people,\" he said.",
  "image": "https://image.cnbcfm.com/api/v1/image/108153868-17489607742025-05-30t180811z_1707832482_rc2isea3gbqm_rtrmadp_0_usa-trump.jpeg?v=1748960814\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108153868\" data-test=\"InlineImage\"\u003e\u003cp\u003eElon Musk applaudes in the Oval Office as he attends a press conference with U.S. President Donald Trump, at the White House in Washington, D.C., U.S., May 30, 2025.\u003c/p\u003e\u003cp\u003eNathan Howard | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.cnbc.com/elon-musk/\"\u003eElon Musk\u003c/a\u003e said Saturday that he has formed a new political party, the \u0026#34;America Party,\u0026#34; which he claims will give Americans \u0026#34;back your freedom.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;By a factor of 2 to 1, you want a new political party and you shall have it!\u0026#34; Musk \u003ca href=\"https://x.com/elonmusk/status/1941584569523732930\" target=\"_blank\"\u003ewrote\u003c/a\u003e on X, one day after he posted a \u003ca href=\"https://x.com/elonmusk/status/1941119099532378580\" target=\"_blank\"\u003epoll\u003c/a\u003e on the platform asking his followers if they support creating the \u0026#34;America Party.\u0026#34; \u003c/p\u003e\u003cp\u003eMusk, the world\u0026#39;s richest man, \u003ca href=\"https://x.com/elonmusk/status/1941125459628179641\" target=\"_blank\"\u003esuggested\u003c/a\u003e Friday that the new party could focus \u0026#34;on just 2 or 3 Senate seats and 8 to 10 House districts.\u0026#34; \u003c/p\u003e\u003cp\u003e\u0026#34;Given the razor-thin legislative margins, that would be enough to serve as the deciding vote on contentious laws, ensuring that they serve the true will of the people,\u0026#34; Musk said Friday.\u003c/p\u003e\u003cp\u003eMusk did not say where the party may be registered. It did not appear to be registered with the Federal Election Committee.\u003c/p\u003e\u003cp\u003eHe also said that the party would caucus independently and that \u0026#34;legislative discussions would be had with both parties,\u0026#34; according to a \u003ca href=\"https://x.com/elonmusk/status/1941202585580699970\" target=\"_blank\"\u003ereply\u003c/a\u003e to a user on X.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"RegularArticle-RelatedContent-1\"\u003e\u003ch2\u003eRead more CNBC politics coverage\u003c/h2\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/06/bessent-tarrifs-trump-august.html\"\u003eBessent: Tariffs will \u0026#39;boomerang\u0026#39; back to April levels by Aug. 1 for countries without deals\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/05/rep-mark-green-announces-resignation.html\"\u003eRep. Green resigns, leaving Speaker Johnson with an even narrower House majority\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/05/elon-musk-america-party-democrats-trump.html\"\u003eElon Musk says he has formed a new U.S. political party, the \u0026#39;America Party\u0026#39;\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/05/trump-says-tariff-letters-to-12-countries-signed-going-out-monday.html\"\u003eTariff letters to 12 countries signed, going out Monday: Trump\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/04/trumps-tariffs-deadline-is-looming-for-europe-heres-where-things-stand.html\"\u003eTrump\u0026#39;s tariffs deadline is looming for Europe. Here\u0026#39;s where things stand\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/03/trump-putin-russia-ukraine.html\"\u003eTrump speaks with Putin after U.S. pauses some weapons shipments to Ukraine\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/03/trump-megabill-house-vote.html\"\u003eHouse narrowly passes Trump\u0026#39;s megabill in major victory for Republican\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/02/trump-bill-house-republicans.html\"\u003eHouse Republicans race to pass Trump\u0026#39;s megabill amid GOP divisions\u003c/a\u003e\u003c/li\u003e\u003cli\u003e\u003ca href=\"https://www.cnbc.com/2025/07/02/trump-trade-vietnam-deal.html\"\u003eTrump says U.S. struck Vietnam trade deal that imposes 20% tariff on its imports\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eMusk was the \u003ca href=\"https://www.cnbc.com/2024/11/07/how-elon-musk-stands-to-cash-in-on-trumps-presidential-victory.html\"\u003elargest donor\u003c/a\u003e during the 2024 presidential campaign, giving more than \u003ca href=\"vhttps://www.washingtonpost.com/politics/2025/01/31/elon-musk-trump-donor-2024-election/\" target=\"_blank\"\u003e$280 million\u003c/a\u003e throughout the cycle, predominantly to presidential candidate \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e, although he also supported other Republican candidates.\u003c/p\u003e\u003cp\u003eIf Musk chooses to get involved in any competitive congressional races in 2026, it could make a significant difference in a close contest.\u003c/p\u003e\u003cp\u003eThe \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-9\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TSLA/\"\u003eTesla\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e CEO\u0026#39;s post comes after a public feud with Trump \u003ca href=\"https://www.cnbc.com/2025/06/28/elon-musk-trump-senate-bill.html\"\u003eerupted\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eIt was a dramatic turnaround for the two men, who had been close allies during the early days of the second Trump administration. But their \u003ca href=\"https://www.cnbc.com/2025/06/05/trump-musk-crazy-government-contracts.html\"\u003erelationship deteriorated\u003c/a\u003e as the two men exchanged barbs on social media, mainly due to Musk\u0026#39;s vocal opposition to Trump\u0026#39;s \u0026#34;big, beautiful bill,\u0026#34; \u003ca href=\"https://www.cnbc.com/2025/06/04/musk-trump-tax-bill.html\"\u003eCNBC has reported\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eMusk had previously spearheaded Trump\u0026#39;s efforts to slash the federal government through the controversial \u0026#34;Department of Government Efficiency\u0026#34; (DOGE), but stepped back from his role in May after his special government employee term ended. \u003c/p\u003e\u003cp\u003eSince feuding with Trump, Musk has publicly floated the idea of a new political party, particularly amid his continued \u003ca href=\"https://www.cnbc.com/2025/06/30/musk-trump-tax-bill-deficit.html\"\u003estrong opposition\u003c/a\u003e to Trump\u0026#39;s sweeping domestic policy package, which passed last week.\u003c/p\u003e\u003cp\u003e\u0026#34;It is obvious with the insane spending of this bill, which increases the debt ceiling by a record FIVE TRILLION DOLLARS that we live in a one-party country – the PORKY PIG PARTY!!\u0026#34; Musk said Monday. \u003c/p\u003e\u003cp\u003e\u0026#34;Time for a new political party that actually cares about the people,\u0026#34; he said. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-07-05T21:28:55Z",
  "modifiedTime": "2025-07-05T21:45:59Z"
}
