{
  "id": "50c9df1a-c7a5-4c23-b658-aa4705261d1a",
  "title": "Iran strikes back after Israel's Operation Rising Lion; Netanyahu warns 'more is on the way' - How the night unfolded",
  "link": "https://timesofindia.indiatimes.com/world/middle-east/iran-strikes-back-after-israels-operation-rising-lion-netanyahu-warns-more-is-on-the-way-what-happened-overnight/articleshow/121840211.cms",
  "description": "Tensions soared as Iran launched retaliatory missile strikes against Israel, following Israeli attacks on Iranian nuclear and military sites. Explosions rocked Tel Aviv and Jerusalem, prompting air raid sirens and shelter warnings. The IRGC claimed responsibility, asserting successful hits on strategic targets, while Israel maintained its defense systems intercepted many missiles.",
  "author": "TOI World Desk",
  "published": "2025-06-14T05:45:04+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 5389,
  "excerpt": "Middle East News: Tensions soared as Iran launched retaliatory missile strikes against Israel, following Israeli attacks on Iranian nuclear and military sites. Explosio",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "A tense escalation unfolded across the Middle East overnight, as Iran launched missile strikes toward Israel late Friday and early Saturday. The move came in response to what Iran described as Israel’s earlier attacks on its territory. The confrontation began with Israel’s \"greatest military operations in history,\" against Iran. In a sweeping and highly coordinated attack on Thursday night, Israeli warplanes and drones, some of them reportedly smuggled into Iranian territory in advance, struck deep inside the Islamic Republic. Key targets included parts of Iran’s nuclear infrastructure, ballistic missile production sites, and command centers. The strike also killed top Iranian military commanders and nuclear scientists.'Everyone will feel it': IranIran launched a barrage of ballistic missiles at central Tel Aviv, following a warning from its military that \"everyone will feel it.\"Earlier, Supreme Leader Ayatollah Ali Khamenei had cautioned that Israel \"should expect severe punishment\" in response to its sweeping attack on Iran’s nuclear facilities and top military officials.'More is on the way': Netanyahu\"In the past 24 hours, we have taken out top military commanders, senior nuclear scientists, the Islamic regime's most significant enrichment facility, and a large portion of its ballistic missile arsenal,\" declared Israeli Prime Minister Benjamin Netanyahu in a defiant video address. \"The regime does not know what hit them, or what will hit them. It has never been weaker.\"Netanyahu also addressed the people of Iran directly: \"To the proud people of Iran, we are in the midst of one of the greatest military operations in history, Operation Rising Lion. The Islamic regime, which has oppressed you for almost 50 years, threatens to destroy our country, the State of Israel. More is on the way.\"That promise of escalation was swiftly realised — by both sides.Late Friday night, Iran responded with a salvo of ballistic missiles and drones targeting Israeli territory. Explosions thundered over Tel Aviv and Jerusalem, as sirens blared and the Israeli military urged residents to take cover. Buildings shook under the pressure of near-simultaneous detonations, with several of them likely the result of Israel’s air defence systems intercepting incoming threats.Iran calls it response to 'criminal aggression'In a pointed statement, Iran’s powerful Islamic Revolutionary Guard Corps (IRGC) claimed responsibility for the retaliatory attacks.\"Using a combination of precision-guided and smart systems,\" the IRGC said, \"Iran targeted military centers and airbases that served as the source of the criminal aggression against our country.\" The IRGC added that its missiles struck Israeli military-industrial centers that produce missiles and other war equipment, stating that \"field reports, satellite imagery, and intercepted intelligence indicate that dozens of ballistic missiles effectively hit strategic targets.\"\"Despite claims of interception, the enemy failed to counter the waves of missile strikes launched by the Islamic Republic of Iran,\" the statement continued.But Israel maintained it had successfully intercepted a significant portion of the threat.'The world cannot stay silent': IDF The Israel Defence Forces (IDF) released footage of a Navy missile ship intercepting five Iranian drones over Israeli waters early Saturday. \"Attached is documentation of the interception of two drones launched earlier today from Iran,\" the IDF posted on social media platform X.The IDF also published a map highlighting areas across Israel currently under threat from Iranian attacks, warning, \"Israeli civilians are currently being targeted by the Iranian regime. The world cannot stay silent.\"Inside a fortified command center, Israeli Prime Minister Netanyahu and defence minister Yoav Gallant conducted ongoing situation assessments. According to an Israeli official who spoke with CNN, the leadership is \"fully engaged in real-time military coordination and strategic planning.\"'Second barrage of missiles from Iran': IDF confirmsThe attacks did not cease after Netanyahu's fiery speech. Minutes after his video was posted, more Iranian missiles were launched, with renewed explosions reported in Jerusalem and Tel Aviv. The tension inside Israel remained palpable as citizens were urged to stay inside shelters.Israel also confirmed Iran's continued strikes and second barrage of missiles from Khamenei-led country.A senior Iranian official, speaking to CNN, warned that Iran is prepared to escalate even further: “Iran will intensify its attacks on Israel and target the regional bases of any country that tries to defend it.”Meanwhile, US President Donald Trump issued a stern warning to Tehran while reaffirming support for Israel. \"Of course we support Israel in its actions,\" Trump told CNN. \"Iran better agree to a nuclear deal before there is nothing left.\"Trump wrote on his Truth Social: \"Two months ago I gave Iran a 60 day ultimatum to “make a deal.” They should have done it! Today is day 61. I told them what to do, but they just couldn’t get there. Now they have, perhaps, a second chance! \"As the skies over the Middle East lit up with missile trails and fireballs, the world watched anxiously, hoping the night’s violence would not spiral into a broader regional war. But with both sides promising more to come, a return to calm appears distant.",
  "image": "https://static.toiimg.com/thumb/msid-121840271,width-1070,height-580,imgsize-823664,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121840271,imgsize-823664,width-400,resizemode-4/121840271.jpg\" alt=\"Iran strikes back after Israel\u0026#39;s Operation Rising Lion; Netanyahu warns \u0026#39;more is on the way\u0026#39; - How the night unfolded\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA tense escalation unfolded across the Middle East overnight, as Iran launched missile strikes toward Israel late Friday and early Saturday. The move came in response to what Iran described as Israel’s earlier attacks on its territory. \u003cspan data-pos=\"3\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"5\"\u003e\u003c/span\u003eThe confrontation began with Israel’s \u0026#34;greatest military operations in history,\u0026#34; against Iran. \u003cspan data-pos=\"7\"\u003e\u003c/span\u003eIn a sweeping and highly coordinated attack on Thursday night, Israeli warplanes and drones, some of them reportedly smuggled into Iranian territory in advance, struck deep inside the Islamic Republic. \u003cspan data-pos=\"9\"\u003e\u003c/span\u003eKey targets included parts of Iran’s nuclear infrastructure, ballistic missile production sites, and command centers. The strike also killed top Iranian military commanders and nuclear scientists.\u003cspan data-pos=\"13\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"14\"\u003e\u003ch3\u003e\u0026#39;Everyone will feel it\u0026#39;: Iran\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"15\"\u003e\u003c/span\u003eIran launched a barrage of ballistic missiles at central Tel Aviv, following a warning from its military that \u0026#34;everyone will feel it.\u0026#34;\u003cspan data-pos=\"17\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"19\"\u003e\u003c/span\u003eEarlier, Supreme Leader Ayatollah Ali Khamenei had cautioned that Israel \u0026#34;should expect severe punishment\u0026#34; in response to its sweeping attack on Iran’s nuclear facilities and top military officials.\u003c/p\u003e\u003cp data-pos=\"23\"\u003e\u003ch3\u003e\u0026#39;More is on the way\u0026#39;: Netanyahu\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"24\"\u003e\u003c/span\u003e\u0026#34;In the past 24 hours, we have taken out top military commanders, senior nuclear scientists, the Islamic regime\u0026#39;s most significant enrichment facility, and a large portion of its ballistic missile arsenal,\u0026#34; declared Israeli Prime Minister Benjamin Netanyahu in a defiant video address. \u0026#34;The regime does not know what hit them, or what will hit them. It has never been weaker.\u0026#34;\u003cspan data-pos=\"26\"\u003e\u003c/span\u003eNetanyahu also addressed the people of Iran directly: \u0026#34;To the proud people of Iran, we are in the midst of one of the greatest military operations in history, Operation Rising Lion. The Islamic regime, which has oppressed you for almost 50 years, threatens to destroy our country, the State of Israel. More is on the way.\u0026#34;\u003cspan data-pos=\"30\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"32\"\u003e\u003c/span\u003eThat promise of escalation was swiftly realised — by both sides.\u003cspan data-pos=\"34\"\u003e\u003c/span\u003eLate Friday night, Iran responded with a salvo of ballistic missiles and drones targeting Israeli territory. Explosions thundered over Tel Aviv and Jerusalem, as sirens blared and the Israeli military urged residents to take cover. \u003cspan data-pos=\"37\"\u003e\u003c/span\u003eBuildings shook under the pressure of near-simultaneous detonations, with several of them likely the result of Israel’s air defence systems intercepting incoming threats.\u003cspan data-pos=\"39\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"40\"\u003e\u003ch3\u003eIran calls it response to \u0026#39;criminal aggression\u0026#39;\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"41\"\u003e\u003c/span\u003eIn a pointed statement, Iran’s powerful Islamic Revolutionary Guard Corps (IRGC) claimed responsibility for the retaliatory attacks.\u003cspan data-pos=\"43\"\u003e\u003c/span\u003e\u0026#34;Using a combination of precision-guided and smart systems,\u0026#34; the IRGC said, \u0026#34;Iran targeted military centers and airbases that served as the source of the criminal aggression against our country.\u0026#34; \u003cspan data-pos=\"46\"\u003e\u003c/span\u003eThe IRGC added that its missiles struck Israeli military-industrial centers that produce missiles and other war equipment, stating that \u0026#34;field reports, satellite imagery, and intercepted intelligence indicate that dozens of ballistic missiles effectively hit strategic targets.\u0026#34;\u003cspan data-pos=\"48\"\u003e\u003c/span\u003e\u0026#34;Despite claims of interception, the enemy failed to counter the waves of missile strikes launched by the Islamic Republic of Iran,\u0026#34; the statement continued.\u003cspan data-pos=\"51\"\u003e\u003c/span\u003eBut Israel maintained it had successfully intercepted a significant portion of the threat.\u003cspan data-pos=\"53\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"54\"\u003e\u003ch3\u003e\u0026#39;The world cannot stay silent\u0026#39;: IDF \u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"55\"\u003e\u003c/span\u003eThe Israel Defence Forces (IDF) released footage of a Navy missile ship intercepting five Iranian drones over Israeli waters early Saturday. \u0026#34;Attached is documentation of the interception of two drones launched earlier today from Iran,\u0026#34; the IDF posted on social media platform X.\u003cspan data-pos=\"57\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"59\"\u003e\u003c/span\u003eThe IDF also published a map highlighting areas across Israel currently under threat from Iranian attacks, warning, \u0026#34;Israeli civilians are currently being targeted by the Iranian regime. The world cannot stay silent.\u0026#34;\u003cspan data-pos=\"63\"\u003e\u003c/span\u003eInside a fortified command center, Israeli Prime Minister Netanyahu and defence minister Yoav Gallant conducted ongoing situation assessments. According to an Israeli official who spoke with CNN, the leadership is \u0026#34;fully engaged in real-time military coordination and strategic planning.\u0026#34;\u003cspan data-pos=\"65\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"66\"\u003e\u003ch3\u003e\u0026#39;Second barrage of missiles from Iran\u0026#39;: IDF confirms\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"67\"\u003e\u003c/span\u003eThe attacks did not cease after Netanyahu\u0026#39;s fiery speech. Minutes after his video was posted, more Iranian missiles were launched, with renewed explosions reported in Jerusalem and Tel Aviv. The tension inside Israel remained palpable as citizens were urged to stay inside shelters.\u003cspan data-pos=\"71\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"73\"\u003e\u003c/span\u003eIsrael also confirmed Iran\u0026#39;s continued strikes and second barrage of missiles from Khamenei-led country.\u003cspan data-pos=\"75\"\u003e\u003c/span\u003eA senior Iranian official, speaking to CNN, warned that Iran is prepared to escalate even further: “Iran will intensify its attacks on Israel and target the regional bases of any country that tries to defend it.”\u003cspan data-pos=\"77\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"79\"\u003e\u003c/span\u003eMeanwhile, US President Donald Trump issued a stern warning to Tehran while reaffirming support for Israel. \u0026#34;Of course we support Israel in its actions,\u0026#34; Trump told CNN. \u0026#34;Iran better agree to a nuclear deal before there is nothing left.\u0026#34;\u003cspan data-pos=\"83\"\u003e\u003c/span\u003eTrump wrote on his Truth Social: \u0026#34;Two months ago I gave Iran a 60 day ultimatum to “make a deal.” They should have done it! Today is day 61. I told them what to do, but they just couldn’t get there. Now they have, perhaps, a second chance! \u0026#34;\u003cspan data-pos=\"85\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"87\"\u003e\u003c/span\u003eAs the skies over the Middle East lit up with missile trails and fireballs, the world watched anxiously, hoping the night’s violence would not spiral into a broader regional war. But with both sides promising more to come, a return to calm appears distant.\u003cspan data-pos=\"89\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-14T05:45:00+05:30",
  "modifiedTime": null
}
