{
  "id": "52fc7f65-409b-4244-9f4c-513d0732fd32",
  "title": "Trump's nominee Caine approved as top US military leader amid partisan battle",
  "link": "https://timesofindia.indiatimes.com/world/us/trumps-nominee-caine-approved-as-top-us-military-leader-amid-partisan-battle/articleshow/120221673.cms",
  "description": "Dan 'Razin' Caine is now the chairman of Joint Chiefs of Staff. The Senate confirmed the retired Air Force Lieutenant General. This happened after President Trump dismissed Gen. CQ Brown Jr. earlier. Caine's confirmation vote saw some opposition. Senator Schumer expressed concerns over Brown's dismissal. Caine pledged to offer unbiased advice to Trump. He also denied wearing any political merchandise.",
  "author": "TOI World Desk",
  "published": "2025-04-12T06:31:11+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3373,
  "excerpt": "US News: Dan 'Razin' Caine is now the chairman of Joint Chiefs of Staff. The Senate confirmed the retired Air Force Lieutenant General. This happened after Pre",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Lt. Gen. John Caine (Retired) (AP Photo)On Friday, the Senate confirmed retired Air Force Lt. Gen. Dan “Razin” Caine as the new chairman of the Joint Chiefs of Staff, nearly two months after President Donald Trump dismissed his predecessor. Trump nominated Caine for the position in February, following the abrupt firing of Gen. CQ Brown Jr., who had served as chairman and was the second Black general to hold the role. The dismissal was part of the administration’s broader efforts to remove military leaders who supported diversity and equity initiatives within the ranks. The confirmation vote for Caine passed with a 60-25 tally in the Senate, just before lawmakers left for a two-week recess. A highly decorated F-16 pilot, Caine has held leadership roles in several special operations commands and some of the Pentagon’s most classified operations. He has also worked with the CIA. However, Caine does not meet the usual qualifications set by the 1986 law for the position, such as being a combatant commander or a service chief. These prerequisites can be waived by the president if deemed necessary for national security interests. The confirmation vote, which took place in the early morning hours before the Senate's recess, highlighted the partisan divide over Trump’s appointments. Senate Majority Leader John Thune, R-S.D., organized the expedited vote after Senate Democrats pushed back against speeding up the process. Senate Democratic Leader Chuck Schumer of New York opposed Caine’s confirmation, expressing his continued outrage over the firing of Gen. Brown. He stated, “I remain outraged\" about Brown's dismissal, and voiced skepticism about Trump’s motivations in nominating Caine. Schumer added, “General Caine has served our nation with distinction in the Air Force and Air National Guard, including over multiple combat deployments. Now, as our nation’s top military advisor, I hope he will continue to fight for the needs of our servicemembers, speak truth to power, and resist Donald Trump when he’s wrong.” Despite the opposition, the vote was bipartisan, with 15 Democrats and Independent Senator Angus King of Maine voting in favor of Caine’s appointment. At his confirmation hearing earlier this month, Caine pledged to offer candid and apolitical advice to Trump. He also denied the president's claim that Caine wore a “Make America Great Again” hat when they first met, saying, “I have never worn any political merchandise.” When asked how he would respond if ordered to carry out a potentially illegal directive, such as using the military against civilians for domestic law enforcement, Caine emphasized that it was his responsibility to resist such orders. He stated, “It is the duty and the job that I have to push back.” Trump and Caine’s relationship dates back to the president’s first term. They first met during a trip to Iraq, and Trump has referred to Caine as “a real general, not a television general” in a 2019 speech. The relationship between Trump and his previous Joint Chiefs Chairman, Gen. Mark Milley, deteriorated as Milley took steps to prevent the politicization of the office. Milley notably reminded military personnel that their oath was to the Constitution, not to the president. Following Trump’s inauguration, Milley’s portrait was removed from the Pentagon, and his security clearance and detail were revoked.",
  "image": "https://static.toiimg.com/thumb/msid-120221674,width-1070,height-580,imgsize-126566,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-120221674,imgsize-126566,width-400,resizemode-4/Senate-confirms-Trump-nominee-Caine-for-chairman-of-Joint-Chiefs-of-Staff-in-overnight-vote.jpg\" alt=\"Trump\u0026#39;s nominee Caine approved as top US military leader amid partisan battle\" title=\"Lt. Gen. John Caine (Retired) (AP Photo)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"Lt. Gen. John Caine (Retired) (AP Photo)\"\u003eLt. Gen. John Caine (Retired) (AP Photo)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eOn Friday, the Senate confirmed retired Air Force Lt. Gen. Dan “Razin” Caine as the new chairman of the Joint Chiefs of Staff, nearly two months after President \u003ca href=\"https://timesofindia.indiatimes.com/topic/donald-trump\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eDonald Trump\u003c/a\u003e dismissed his predecessor.\u003cbr/\u003e Trump nominated Caine for the position in February, following the abrupt firing of Gen. CQ Brown Jr., who had served as chairman and was the second Black general to hold the role. The dismissal was part of the administration’s broader efforts to remove military leaders who supported diversity and equity initiatives within the ranks. The confirmation vote for Caine passed with a 60-25 tally in the Senate, just before lawmakers left for a two-week recess.\u003cbr/\u003e A highly decorated F-16 pilot, Caine has held leadership roles in several special operations commands and some of the Pentagon’s most classified operations. He has also worked with the CIA. However, Caine does not meet the usual qualifications set by the 1986 law for the position, such as being a combatant commander or a service chief. These prerequisites can be waived by the president if deemed necessary for national security interests.\u003cbr/\u003e The confirmation vote, which took place in the early morning hours before the Senate\u0026#39;s recess, highlighted the partisan divide over Trump’s appointments. Senate Majority Leader John Thune, R-S.D., organized the expedited vote after Senate Democrats pushed back against speeding up the process.\u003c/p\u003e\u003cp\u003e Senate Democratic Leader Chuck Schumer of New York opposed Caine’s confirmation, expressing his continued outrage over the firing of Gen. Brown. He stated, “I remain outraged\u0026#34; about Brown\u0026#39;s dismissal, and voiced skepticism about Trump’s motivations in nominating Caine. Schumer added, “General Caine has served our nation with distinction in the Air Force and Air National Guard, including over multiple combat deployments. Now, as our nation’s top military advisor, I hope he will continue to fight for the needs of our servicemembers, speak truth to power, and resist Donald Trump when he’s wrong.”\u003cbr/\u003e Despite the opposition, the vote was bipartisan, with 15 Democrats and Independent Senator Angus King of Maine voting in favor of Caine’s appointment.\u003cbr/\u003e At his confirmation hearing earlier this month, Caine pledged to offer candid and apolitical advice to Trump. He also denied the president\u0026#39;s claim that Caine wore a “Make America Great Again” hat when they first met, saying, “I have never worn any political merchandise.”\u003cbr/\u003e When asked how he would respond if ordered to carry out a potentially illegal directive, such as using the military against civilians for domestic law enforcement, Caine emphasized that it was his responsibility to resist such orders. He stated, “It is the duty and the job that I have to push back.”\u003cbr/\u003e Trump and Caine’s relationship dates back to the president’s first term. They first met during a trip to Iraq, and Trump has referred to Caine as “a real general, not a television general” in a 2019 speech.\u003cbr/\u003e The relationship between Trump and his previous Joint Chiefs Chairman, Gen. Mark Milley, deteriorated as Milley took steps to prevent the politicization of the office. Milley notably reminded military personnel that their oath was to the Constitution, not to the president. Following Trump’s inauguration, Milley’s portrait was removed from the Pentagon, and his security clearance and detail were revoked.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-12T06:31:00+05:30",
  "modifiedTime": null
}
