{
  "id": "5bd1fcae-f82d-49f8-8894-e47f47efd136",
  "title": "Israeli Military Tightens Media Rules Over War Crimes Prosecution Concern",
  "link": "https://www.ndtv.com/world-news/israeli-military-tightens-media-rules-over-war-crimes-prosecution-concern-7431652",
  "description": "The Israeli military placed new restrictions on media coverage of soldiers on active combat duty amid growing concern at the risk of legal action against reservists travelling abroad over allegations of involvement in war crimes in Gaza.",
  "author": "",
  "published": "Thu, 09 Jan 2025 05:13:02 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 2345,
  "excerpt": "The Israeli military placed new restrictions on media coverage of soldiers on active combat duty amid growing concern at the risk of legal action against reservists travelling abroad over allegations of involvement in war crimes in Gaza.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Jerusalem: The Israeli military placed new restrictions on media coverage of soldiers on active combat duty amid growing concern at the risk of legal action against reservists travelling abroad over allegations of involvement in war crimes in Gaza.The move came after an Israeli reservist vacationing in Brazil left the country abruptly when a Brazilian judge ordered federal police to open an investigation following allegations from a pro-Palestinian group that he had committed war crimes while serving in Gaza.Under the new rules, media interviewing soldiers of the rank of colonel and under will not be able to display their full names or faces, similar to the rules that already exist for pilots and members of special forces units, Lieutenant Colonel Nadav Shoshani, an Israeli military spokesperson told reporters.The interviewees must not be linked to a specific combat event they participated in.\"This is our new guideline to protect our soldiers and to make sure they are safe from these types of incident hosted by anti-Israel activists around the world,\" Shoshani said.He said that under existing military rules, soldiers were already not supposed to post videos and other images from war zones on social media \"even though that's never perfect and we have a large army.\" There were also long-standing rules and guidelines for soldiers travelling abroad, he said.Shoshani said activist groups, such as the Belgium-based Hind Rajab Foundation, which pushed for the action in Brazil, were \"connecting the dots\" between soldiers who posted material from Gaza and then posted other photos and videos of themselves while on holiday abroad.Last year, the International Criminal Court issued arrest warrants against Israeli Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant, as well as a Hamas leader, Ibrahim Al-Masri, over alleged war crimes in Gaza, drawing outrage in Israel.Shoshani said there had been \"a handful\" of cases where reservists travelling abroad had been targeted, in addition to the case in Brazil, all of which had been started by activist groups pushing authorities for an investigation.\"They didn't open an investigation, they didn't press charges or anything like that,\" he said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-10/p5kd7dj_israeli-army-in-gaza_625x300_07_October_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eJerusalem: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Israeli military placed new restrictions on media coverage of soldiers on active combat duty amid growing concern at the risk of legal action against reservists travelling abroad over allegations of involvement in war crimes in Gaza.\u003c/p\u003e\u003cp\u003eThe move came after an Israeli reservist vacationing in Brazil left the country abruptly when a Brazilian judge ordered federal police to open an investigation following allegations from a pro-Palestinian group that he had committed war crimes while serving in Gaza.\u003c/p\u003e\u003cp\u003eUnder the new rules, media interviewing soldiers of the rank of colonel and under will not be able to display their full names or faces, similar to the rules that already exist for pilots and members of special forces units, Lieutenant Colonel Nadav Shoshani, an Israeli military spokesperson told reporters.\u003c/p\u003e\u003cp\u003eThe interviewees must not be linked to a specific combat event they participated in.\u003c/p\u003e\u003cp\u003e\u0026#34;This is our new guideline to protect our soldiers and to make sure they are safe from these types of incident hosted by anti-Israel activists around the world,\u0026#34; Shoshani said.\u003c/p\u003e\u003cp\u003eHe said that under existing military rules, soldiers were already not supposed to post videos and other images from war zones on social media \u0026#34;even though that\u0026#39;s never perfect and we have a large army.\u0026#34; There were also long-standing rules and guidelines for soldiers travelling abroad, he said.\u003c/p\u003e\u003cp\u003eShoshani said activist groups, such as the Belgium-based Hind Rajab Foundation, which pushed for the action in Brazil, were \u0026#34;connecting the dots\u0026#34; between soldiers who posted material from Gaza and then posted other photos and videos of themselves while on holiday abroad.\u003c/p\u003e\u003cp\u003eLast year, the International Criminal Court issued arrest warrants against Israeli Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant, as well as a Hamas leader, Ibrahim Al-Masri, over alleged war crimes in Gaza, drawing outrage in Israel.\u003c/p\u003e\u003cp\u003eShoshani said there had been \u0026#34;a handful\u0026#34; of cases where reservists travelling abroad had been targeted, in addition to the case in Brazil, all of which had been started by activist groups pushing authorities for an investigation.\u003c/p\u003e\u003cp\u003e\u0026#34;They didn\u0026#39;t open an investigation, they didn\u0026#39;t press charges or anything like that,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-09T05:13:02+05:30",
  "modifiedTime": null
}
