{
  "id": "5ed57af9-7ceb-4f1e-b969-ab24ebfe894a",
  "title": "Hurricane Erick: Category 3 storm nears Mexico; southern states on high alert",
  "link": "https://timesofindia.indiatimes.com/world/rest-of-world/hurricane-erick-category-3-storm-nears-mexico-southern-states-on-high-alert/articleshow/121942048.cms",
  "description": "Hurricane Erick, a Category 3 storm, is nearing Mexico's southern Pacific coast, posing threats of destructive winds and flash floods. Oaxaca, Guerrero, and Chiapas are on high alert, with residents urged to seek shelter. Acapulco, still recovering from Hurricane Otis, is taking extra precautions.",
  "author": "TOI World Desk",
  "published": "2025-06-19T06:30:26+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3624,
  "excerpt": "Rest of World News: Hurricane Erick, a Category 3 storm, is nearing Mexico's southern Pacific coast, posing threats of destructive winds and flash floods. Oaxaca, Guerrer",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Hurricane Erick has strengthened into a powerful Category 3 storm and is closing in on Mexico’s southern Pacific coast, the US National Hurricane Center said on Wednesday. The NHC has warned that the storm could bring “potentially destructive winds and life-threatening flash floods.”According to NHC, Erick had maximum sustained winds of 120 mph (195 km/h) and was moving northwest at a speed of 9 mph (15 km/h). The storm was located about 55 miles (90 kilometres) south-southwest of Puerto Ángel and roughly 160 miles (260 kilometres) southeast of Punta Maldonado.Forecasters said the hurricane is expected to strengthen before making landfall early Thursday, bringing dangerous storm surges, coastal flooding, and destructive waves to parts of the southern coast.States on high alertThe Mexican states of Oaxaca, Guerrero, and Chiapas are on high alert, with the government urging residents to move to shelters and avoid risk zones. President Claudia Sheinbaum appealed to the public to stay indoors and follow official instructions.“We tell the population to stay tuned to official communications, to stay indoors, and not go out,” she said. “If you are in low-lying areas, near rivers, near waterways, it is best for you to go to shelters, to the shelters that have already been set up for this situation.” She also urged boat owners not to go out to sea.More than 2,000 temporary shelters have been established across the three states, and hundreds of troops, electricity workers, and civil protection teams have been deployed. Local authorities suspended classes, closed ports, and heightened alerts in cities and tourist destinations along the coast, including Acapulco.Communities prepare for floodingAuthorities are particularly concerned about the risk of flash floods and mudslides in mountainous regions. Torrential rains are forecast in Guerrero, Oaxaca and Chiapas, with up to 16 inches (40 centimetres) of rainfall expected in some areas.Laura Velázquez, Mexico’s national civil defence coordinator, said rivers and dams are being monitored closely. “Torrential” rain is expected, with risks heightened in regions with steep terrain.Guerrero Governor Evelyn Salgado confirmed that all schools were closed and 582 shelters had been prepared. The port of Acapulco was shut Tuesday evening, and fishing and tourism operators were advised to secure their equipment.Erick is the fifth named storm of the Pacific hurricane season, which runs through November. Authorities continue to urge residents in the storm’s path to take precautions seriously and stay informed.'Strongest storm in Mexico'Having doubled in strength in less than a day, Hurricane Erick rapidly intensified as it moved through ideal conditions off Mexico’s southern coast. Scientists say this rapid intensification — defined as a storm gaining at least 35 mph in 24 hours — has become more frequent in a warmer climate. Erick surged by 50 mph in just 18 hours, and forecasters expect it to strengthen further. “It’s likely that when Erick hits, it will be the strongest storm to make landfall in that part of Mexico this early in the season,” said University of Miami hurricane researcher Brian McNoldy.Experts note that while Erick is powerful, it differs from the deadly Hurricane Otis, which struck Acapulco in October 2023 after forming over deeper, warmer waters. The current storm’s environment is slightly cooler below the surface, though surface temperatures remain high. “It’s got a good stormy eye forming,” said atmospheric scientist Kristen Corbosiero, adding the storm’s surroundings are “extremely moist,” which fuels its growth.",
  "image": "https://static.toiimg.com/thumb/msid-121942111,width-1070,height-580,imgsize-1030946,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cp\u003e\u003cspan data-pos=\"1\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eHurricane Erick has strengthened into a powerful Category 3 storm and is closing in on Mexico’s southern Pacific coast, the US \u003c/span\u003e\u003ca href=\"https://timesofindia.indiatimes.com/topic/national-hurricane-center\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eNational Hurricane Center\u003c/a\u003e\u003cspan data-pos=\"3\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e said on Wednesday. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"5\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe NHC has warned that the storm could bring “potentially destructive winds and life-threatening flash floods.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"9\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eAccording to NHC, Erick had maximum sustained winds of 120 mph (195 km/h) and was moving northwest at a speed of 9 mph (15 km/h). The storm was located about 55 miles (90 kilometres) south-southwest of Puerto Ángel and roughly 160 miles (260 kilometres) southeast of Punta Maldonado.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"11\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eForecasters said the hurricane is expected to strengthen before making landfall early Thursday, bringing dangerous storm surges, coastal flooding, and destructive waves to parts of the southern coast.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"14\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eStates on high alert\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"17\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe Mexican states of Oaxaca, Guerrero, and Chiapas are on high alert, with the government urging residents to move to shelters and avoid risk zones. President Claudia Sheinbaum appealed to the public to stay indoors and follow official instructions.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"19\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e“We tell the population to stay tuned to official communications, to stay indoors, and not go out,” she said. “If you are in low-lying areas, near rivers, near waterways, it is best for you to go to shelters, to the shelters that have already been set up for this situation.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"21\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eShe also urged boat owners not to go out to sea.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"23\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eMore than 2,000 temporary shelters have been established across the three states, and hundreds of troops, electricity workers, and civil protection teams have been deployed. Local authorities suspended classes, closed ports, and heightened alerts in cities and tourist destinations along the coast, including Acapulco.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"25\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eCommunities prepare for flooding\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"28\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eAuthorities are particularly concerned about the risk of flash floods and mudslides in mountainous regions. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"30\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eTorrential rains are forecast in Guerrero, Oaxaca and Chiapas, with up to 16 inches (40 centimetres) of rainfall expected in some areas.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"32\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eLaura Velázquez, Mexico’s national civil defence coordinator, said rivers and dams are being monitored closely. “Torrential” rain is expected, with risks heightened in regions with steep terrain.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"34\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eGuerrero Governor Evelyn Salgado confirmed that all schools were closed and 582 shelters had been prepared. \u003c/span\u003e\u003cspan data-pos=\"36\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe port of Acapulco was shut Tuesday evening, and fishing and tourism operators were advised to secure their equipment.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"38\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eErick is the fifth named storm of the Pacific hurricane season, which runs through November. Authorities continue to urge residents in the storm’s path to take precautions seriously and stay informed.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"40\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u0026#39;Strongest storm in Mexico\u0026#39;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"43\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eHaving doubled in strength in less than a day, Hurricane Erick rapidly intensified as it moved through ideal conditions off Mexico’s southern coast. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"45\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eScientists say this rapid intensification — defined as a storm gaining at least 35 mph in 24 hours — has become more frequent in a warmer climate. Erick surged by 50 mph in just 18 hours, and forecasters expect it to strengthen further. “It’s likely that when Erick hits, it will be the strongest storm to make landfall in that part of Mexico this early in the season,” said University of Miami hurricane researcher Brian McNoldy.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"48\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eExperts note that while Erick is powerful, it differs from the deadly Hurricane Otis, which struck Acapulco in October 2023 after forming over deeper, warmer waters. The current storm’s environment is slightly cooler below the surface, though surface temperatures remain high. “It’s got a good stormy eye forming,” said atmospheric scientist Kristen Corbosiero, adding the storm’s surroundings are “extremely moist,” which fuels its growth.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-19T06:30:00+05:30",
  "modifiedTime": null
}
