{
  "id": "68332e43-1af0-4520-9900-cd91a1d58ac6",
  "title": "Trump accuses UK's Labour Party of 'foreign interference'",
  "link": "https://www.bbc.com/news/articles/cdjej417009o",
  "description": "Labour activists volunteering in the US presidential election amounts to illegal \"contributions\", the complaint alleges.",
  "author": "",
  "published": "Tue, 22 Oct 2024 22:55:30 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Bernd Debusmann Jr",
  "length": 2500,
  "excerpt": "Labour activists volunteering in the US presidential election amounts to illegal \"contributions\", the complaint alleges.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Donald Trump's campaign has filed a Federal Election Commission (FEC) complaint against the UK's Labour Party, accusing it of \"blatant foreign interference\" in the US election in aid of the Harris-Walz campaign. The complaint cites media reports about contact between Labour and the Harris campaign as well as apparent volunteering efforts, arguing that this amounts to illegal \"contributions\". The BBC understands that Labour activists campaigning in the US presidential election are doing so in a personal capacity.The Labour Party has not issued an official response. Specifically, the complaint cites newspaper reporting that Labour-linked individuals have travelled to the US to campaign for Harris. That reporting, the complaint alleges, creates a \"reasonable inference that the Labour Party has made, and the Harris campaign has accepted, illegal foreign national contributions.\" Election polls - is Harris or Trump ahead?The letter refers to Washington Post reporting that communications were exchanged between the parties and that senior officials have met in private. The BBC has reached out to the Harris-Walz campaign for comment on the complaint, and the various news reports it cites.At the moment, however, there is no indication that the Harris-Walz campaign was aware of any efforts by Labour or its staffers.Additionally, the complaint cites a social media post on LinkedIn in which a Labour staff member said that \"nearly 100\" current and former party members will be headed to battleground states in the US. The post, from Labour Party head of operations Sofia Patel, added that 10 \"spots\" are available and that \"we will sort your housing\".It appears to have since been deleted.The complaint makes comparisons to an international programme in 2016 in which the Australian Labor Party, or ALP, sent delegates to help with Bernie Sanders' campaign.In that instance, however, the ALP paid for flights and daily stipends. The party and the campaign were each handed down civil penalties of $14,500. Labour activists' trips were not organised or funded by the party, it is understood from party officials. Foreign nationals are permitted to serve as campaign volunteers as long as they are not compensated, according to FEC rules. It is considered normal for party officials from the UK to be in contact with counterparts in the US. It also has taken place previously between the UK's Conservative Party and US Republicans. The BBC has contacted the Harris-Walz campaign for comment.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02e0/live/677f42a0-90d2-11ef-83dc-fbcda4a0417c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDonald Trump\u0026#39;s campaign has filed a Federal Election Commission (FEC) complaint against the UK\u0026#39;s Labour Party, accusing it of \u0026#34;blatant foreign interference\u0026#34; in the US election in aid of the Harris-Walz campaign. \u003c/p\u003e\u003cp\u003eThe complaint cites media reports about contact between Labour and the Harris campaign as well as apparent volunteering efforts, arguing that this amounts to illegal \u0026#34;contributions\u0026#34;. \u003c/p\u003e\u003cp\u003eThe BBC understands that Labour activists campaigning in the US presidential election are doing so in a personal capacity.\u003c/p\u003e\u003cp\u003eThe Labour Party has not issued an official response. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSpecifically, the complaint cites newspaper reporting that Labour-linked individuals have travelled to the US to campaign for Harris. \u003c/p\u003e\u003cp\u003eThat reporting, the complaint alleges, creates a \u0026#34;reasonable inference that the Labour Party has made, and the Harris campaign has accepted, illegal foreign national contributions.\u0026#34; \u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cj4x71znwxdo\"\u003eElection polls - is Harris or Trump ahead?\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe letter refers to Washington Post reporting that communications were exchanged between the parties and that senior officials have met in private. \u003c/p\u003e\u003cp\u003eThe BBC has reached out to the Harris-Walz campaign for comment on the  complaint, and the various news reports it cites.\u003c/p\u003e\u003cp\u003eAt the moment, however, there is no indication that the Harris-Walz campaign was aware of any efforts by Labour or its staffers.\u003c/p\u003e\u003cp\u003eAdditionally, the complaint cites a social media post on LinkedIn in which a Labour staff member said that \u0026#34;nearly 100\u0026#34; current and former party members will be headed to battleground states in the US. \u003c/p\u003e\u003cp\u003eThe post, from Labour Party head of operations Sofia Patel, added that 10 \u0026#34;spots\u0026#34; are available and that \u0026#34;we will sort your housing\u0026#34;.\u003c/p\u003e\u003cp\u003eIt appears to have since been deleted.\u003c/p\u003e\u003cp\u003eThe complaint makes comparisons to an international programme in 2016 in which the Australian Labor Party, or ALP, sent delegates to help with Bernie Sanders\u0026#39; campaign.\u003c/p\u003e\u003cp\u003eIn that instance, however, the ALP paid for flights and daily stipends. The party and the campaign were each handed down civil penalties of $14,500. \u003c/p\u003e\u003cp\u003eLabour activists\u0026#39; trips were not organised or funded by the party, it is understood from party officials. \u003c/p\u003e\u003cp\u003eForeign nationals are permitted to serve as campaign volunteers as long as they are not compensated, according to FEC rules. \u003c/p\u003e\u003cp\u003eIt is considered normal for party officials from the UK to be in contact with counterparts in the US. \u003c/p\u003e\u003cp\u003eIt also has taken place previously between the UK\u0026#39;s Conservative Party and US Republicans. \u003c/p\u003e\u003cp\u003eThe BBC has contacted the Harris-Walz campaign for comment. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-22T21:48:21.555Z",
  "modifiedTime": null
}
