{
  "id": "6c886550-3a49-46bb-af95-4cd94dd7fd33",
  "title": "\"More Sad Than Shocked\": US TikTok Users Brace For Ban",
  "link": "https://www.ndtv.com/world-news/more-sad-than-shocked-us-tiktok-users-brace-for-ban-7499904",
  "description": "\"I almost, like, don't know how to define myself without TikTok,\" content creator Ayman Chaudhary sighed, reflecting the consternation of millions over US authorities' scheduled banning Sunday of the hugely popular app.",
  "author": "",
  "published": "Sat, 18 Jan 2025 05:37:47 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 4091,
  "excerpt": "\u0026quot;I almost, like, don\u0026#039;t know how to define myself without TikTok,\u0026quot; content creator Ayman Chaudhary sighed, reflecting the consternation of millions over US authorities\u0026#039; scheduled banning Sunday of the hugely popular app.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: \"I almost, like, don't know how to define myself without TikTok,\" content creator Ayman Chaudhary sighed, reflecting the consternation of millions over US authorities' scheduled banning Sunday of the hugely popular app.After months of legal tussles, the US Supreme Court on Friday upheld a law that would ban the video-sharing platform -- used by 170 million Americans -- in the name of national security, unless its Chinese owners reach an 11th-hour deal to sell it to American buyers.\"I'm more sad than shocked,\" the 24-year-old Chaudhary told AFP. \"But still, it's sad and disappointing that the US government has come together to ban an app instead of banding together to adopt a law that matters about health or education.\"It remains uncertain whether TikTok will turn out the lights Sunday -- for a single day or forever. Potential buyers exist, though TikTok's owner, Chinese tech company ByteDance, has systematically refused to part with its crown jewel.President-elect Donald Trump, just days from his second inauguration, said Friday that he \"must have time\" to decide whether to enforce the high court's ruling. He promised a decision \"in the not too distant future.\"Until then, Ayman and countless other content creators have been left gloomily contemplating a future without TikTok.- Mandarin 'out of spite'? -\"I started five years ago in 2020 during (the Covid-19) quarantine, and I've been employed, like, through TikTok, and now it just feels like suddenly I'm unemployed,\" said Ayman, an avid reader who offers book recommendations on the platform, earning enough from ads and sponsors to pay her bills.Like thousands of other worried TikTok users, she has protectively created a profile on Xiaohongshu (\"Little Red Book\"), a Chinese social media network similar to Instagram.Nicknamed \"Red Note\" by its American users, it was the most-downloaded app on the American Apple Store this week.People are turning to Red Note, Ayman said, as \"kind of a protest, because it is a Chinese-owned app, and TikTok is being banned because it's, like, Chinese-owned.\"The language-teaching app Duolingo made a clear pitch to people looking for life after TikTok.\"Learning Mandarin out of spite? You're not alone,\" Duolingo posted on X. \"We've seen a 216% growth in new Chinese (Mandarin) learners in the US compared to this time last year.\"On TikTok, many American creators have published videos combining their favorite moments on the app with farewell messages urging fans to follow them to other platforms, including Xiaohongshu -- while openly mocking the concerns of American lawmakers.- 'Micro-influencers' -\"Most students don't buy the narrative that there's Chinese spies that are controlling the algorithm\" on TikTok, said Chris Dier, a history teacher who shares educational videos on TikTok and uses them as well in his classes.He said students \"think that the United States government is not a fan of TikTok because... the government can't easily control it.\"Xiaohongshu, which is entirely in Mandarin, would not appear to provide a realistic long-term alternative for frustrated American users.Popular even before the pandemic, TikTok exploded among young people living in quarantine, and became a must-have resource for many small companies and start-ups.\"It's a scary time for a lot of smaller creators, because I think TikTok is one of the very few platforms on the internet where micro-influencers can really thrive,\" said Nathan Espinoza, who has more than 550,000 subscribers on the app.Indeed, the social network has built its success not so much via personal recommendations as through its ultra-powerful algorithm, which lets it rapidly identify users' interests and funnel content of particular interest to them.\"I'm a more YouTube-centric creator now,\" Espinoza said.\"But I wouldn't be where I am today without TikTok, because that first viral video showed me that it's possible, and there's an audience for the type of videos that I make.\"(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2023-03/cg079a48_tiktok-generic-reuters_625x300_17_March_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I almost, like, don\u0026#39;t know how to define myself without TikTok,\u0026#34; content creator Ayman Chaudhary sighed, reflecting the consternation of millions over US authorities\u0026#39; scheduled banning Sunday of the hugely popular app.\u003c/p\u003e\u003cp\u003eAfter months of legal tussles, the US Supreme Court on Friday upheld a law that would ban the video-sharing platform -- used by 170 million Americans -- in the name of national security, unless its Chinese owners reach an 11th-hour deal to sell it to American buyers.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m more sad than shocked,\u0026#34; the 24-year-old Chaudhary told AFP. \u0026#34;But still, it\u0026#39;s sad and disappointing that the US government has come together to ban an app instead of banding together to adopt a law that matters about health or education.\u0026#34;\u003c/p\u003e\u003cp\u003eIt remains uncertain whether TikTok will turn out the lights Sunday -- for a single day or forever. Potential buyers exist, though TikTok\u0026#39;s owner, Chinese tech company ByteDance, has systematically refused to part with its crown jewel.\u003c/p\u003e\u003cp\u003ePresident-elect Donald Trump, just days from his second inauguration, said Friday that he \u0026#34;must have time\u0026#34; to decide whether to enforce the high court\u0026#39;s ruling. He promised a decision \u0026#34;in the not too distant future.\u0026#34;\u003c/p\u003e\u003cp\u003eUntil then, Ayman and countless other content creators have been left gloomily contemplating a future without TikTok.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- Mandarin \u0026#39;out of spite\u0026#39;? -\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I started five years ago in 2020 during (the Covid-19) quarantine, and I\u0026#39;ve been employed, like, through TikTok, and now it just feels like suddenly I\u0026#39;m unemployed,\u0026#34; said Ayman, an avid reader who offers book recommendations on the platform, earning enough from ads and sponsors to pay her bills.\u003c/p\u003e\u003cp\u003eLike thousands of other worried TikTok users, she has protectively created a profile on Xiaohongshu (\u0026#34;Little Red Book\u0026#34;), a Chinese social media network similar to Instagram.\u003c/p\u003e\u003cp\u003eNicknamed \u0026#34;Red Note\u0026#34; by its American users, it was the most-downloaded app on the American Apple Store this week.\u003c/p\u003e\u003cp\u003ePeople are turning to Red Note, Ayman said, as \u0026#34;kind of a protest, because it is a Chinese-owned app, and TikTok is being banned because it\u0026#39;s, like, Chinese-owned.\u0026#34;\u003c/p\u003e\u003cp\u003eThe language-teaching app Duolingo made a clear pitch to people looking for life after TikTok.\u003c/p\u003e\u003cp\u003e\u0026#34;Learning Mandarin out of spite? You\u0026#39;re not alone,\u0026#34; Duolingo posted on X. \u0026#34;We\u0026#39;ve seen a 216% growth in new Chinese (Mandarin) learners in the US compared to this time last year.\u0026#34;\u003c/p\u003e\u003cp\u003eOn TikTok, many American creators have published videos combining their favorite moments on the app with farewell messages urging fans to follow them to other platforms, including Xiaohongshu -- while openly mocking the concerns of American lawmakers.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- \u0026#39;Micro-influencers\u0026#39; -\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;Most students don\u0026#39;t buy the narrative that there\u0026#39;s Chinese spies that are controlling the algorithm\u0026#34; on TikTok, said Chris Dier, a history teacher who shares educational videos on TikTok and uses them as well in his classes.\u003c/p\u003e\u003cp\u003eHe said students \u0026#34;think that the United States government is not a fan of TikTok because... the government can\u0026#39;t easily control it.\u0026#34;\u003c/p\u003e\u003cp\u003eXiaohongshu, which is entirely in Mandarin, would not appear to provide a realistic long-term alternative for frustrated American users.\u003c/p\u003e\u003cp\u003ePopular even before the pandemic, TikTok exploded among young people living in quarantine, and became a must-have resource for many small companies and start-ups.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a scary time for a lot of smaller creators, because I think TikTok is one of the very few platforms on the internet where micro-influencers can really thrive,\u0026#34; said Nathan Espinoza, who has more than 550,000 subscribers on the app.\u003c/p\u003e\u003cp\u003eIndeed, the social network has built its success not so much via personal recommendations as through its ultra-powerful algorithm, which lets it rapidly identify users\u0026#39; interests and funnel content of particular interest to them.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m a more YouTube-centric creator now,\u0026#34; Espinoza said.\u003c/p\u003e\u003cp\u003e\u0026#34;But I wouldn\u0026#39;t be where I am today without TikTok, because that first viral video showed me that it\u0026#39;s possible, and there\u0026#39;s an audience for the type of videos that I make.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-18T05:37:47+05:30",
  "modifiedTime": null
}
