{
  "id": "720fe6b3-70c3-4d51-ad10-e547130bb71e",
  "title": "Trump says he will call Putin, Zelenskyy, and NATO members on Monday to talk ceasefire, trade",
  "link": "https://www.cnbc.com/2025/05/17/trump-to-call-putin-zelenskyy-nato-members-monday-to-talk-ceasefire.html",
  "description": "Trump told reporters on Friday that he would speak with Putin after the Russian president skipped peace talks between Russia and Ukraine in Turkey.",
  "author": "",
  "published": "Sat, 17 May 2025 16:05:33 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Pia Singh",
  "length": 2298,
  "excerpt": "Trump told reporters on Friday that he would speak with Putin after the Russian president skipped peace talks between Russia and Ukraine in Turkey.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "U.S. President Donald Trump gestures, while he boards Air Force One, in Abu Dhabi, United Arab Emirates, May 16, 2025. Brian Snyder | ReutersPresident Donald Trump said Saturday he plans to speak separately to Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy on Monday in an effort to reach a ceasefire.\"I WILL BE SPEAKING, BY TELEPHONE, TO PRESIDENT VLADIMIR PUTIN OF RUSSIA ON MONDAY, AT 10:00 A.M. THE SUBJECTS OF THE CALL WILL BE, STOPPING THE \"BLOODBATH\" THAT IS KILLING, ON AVERAGE, MORE THAN 5000 RUSSIAN AND UKRAINIAN SOLDIERS A WEEK, AND TRADE,\" Trump said in a Saturday post on Truth Social.\"I WILL THEN BE SPEAKING TO PRESIDENT ZELENSKYY OF UKRAINE AND THEN, WITH PRESIDENT ZELENSKYY, VARIOUS MEMBERS OF NATO,\" he continued. \"HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END. GOD BLESS US ALL!!!\"Trump told reporters on Friday that he was setting up talks with Putin after the Russian president skipped peace talks between Russia and Ukraine in Turkey. \"I think it's time for us to just do it,\" Trump said.\"He and I will meet, and I think we'll solve it or maybe not,\" Trump said in comments to reporters after boarding Air Force One, as he departed for the U.S. following his four-day trip to the Middle East. \"At least we'll know. And if we don't solve it, it'll be very interesting.\"Trump has grown frustrated with his administration's efforts to facilitate a deal between Russia and Ukraine and has told advisers in private discussions that mediating a peace deal has been more difficult than he expected, CNN previously reported, citing sources. During his campaign, the U.S. president repeatedly said he would be able to end the war between Russia and Ukraine \"in 24 hours\" upon taking office.Trump has lately taken to blaming both sides, where he previously assigned blame solely on Ukraine's Zelenskyy for making \"inflammatory statements\" that \"makes it so difficult to settle this war.\" He also accused the Ukrainian leader of adding to war complications by \"boasting\" that Kyiv would not legally recognize ceding Crimea to Russia. Trump recently chastised Putin for Russia's strikes on Ukraine in late April that were \"not necessary, and very bad timing.\"",
  "image": "https://image.cnbcfm.com/api/v1/image/108146687-17474007212025-05-16t102949z_271238192_rc2yieaktdof_rtrmadp_0_usa-trump-gulf.jpeg?v=1747400774\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108146687\" data-test=\"InlineImage\"\u003e\u003cp\u003eU.S. President Donald Trump gestures, while he boards Air Force One, in Abu Dhabi, United Arab Emirates, May 16, 2025. \u003c/p\u003e\u003cp\u003eBrian Snyder | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePresident \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e said Saturday he plans to speak separately to Russian President \u003ca href=\"https://www.cnbc.com/vladimir-putin/\"\u003eVladimir Putin\u003c/a\u003e and Ukrainian President \u003ca href=\"https://www.cnbc.com/volodymyr-zelenskyy/\"\u003eVolodymyr Zelenskyy\u003c/a\u003e on Monday in an effort to reach a ceasefire.\u003c/p\u003e\u003cp\u003e\u0026#34;I WILL BE SPEAKING, BY TELEPHONE, TO PRESIDENT VLADIMIR PUTIN OF RUSSIA ON MONDAY, AT 10:00 A.M. THE SUBJECTS OF THE CALL WILL BE, STOPPING THE \u0026#34;BLOODBATH\u0026#34; THAT IS KILLING, ON AVERAGE, MORE THAN 5000 RUSSIAN AND UKRAINIAN SOLDIERS A WEEK, AND TRADE,\u0026#34; Trump said \u003ca href=\"https://truthsocial.com/@realDonaldTrump/114523762104941397\" target=\"_blank\"\u003ein a Saturday post\u003c/a\u003e on Truth Social.\u003c/p\u003e\u003cp\u003e\u0026#34;I WILL THEN BE SPEAKING TO PRESIDENT ZELENSKYY OF UKRAINE AND THEN, WITH PRESIDENT ZELENSKYY, VARIOUS MEMBERS OF NATO,\u0026#34; he continued. \u0026#34;HOPEFULLY IT WILL BE A PRODUCTIVE DAY, A CEASEFIRE WILL TAKE PLACE, AND THIS VERY VIOLENT WAR, A WAR THAT SHOULD HAVE NEVER HAPPENED, WILL END. GOD BLESS US ALL!!!\u0026#34;\u003c/p\u003e\u003cp\u003eTrump told reporters on Friday that \u003ca href=\"https://www.cbsnews.com/news/trump-putin-russia-ukraine-war-meeting-proposal/\" target=\"_blank\"\u003ehe was setting up talks\u003c/a\u003e with Putin after the Russian president skipped peace talks between Russia and Ukraine in Turkey. \u0026#34;I think it\u0026#39;s time for us to just do it,\u0026#34; Trump said.\u003c/p\u003e\u003cp\u003e\u0026#34;He and I will meet, and I think we\u0026#39;ll solve it or maybe not,\u0026#34; Trump said in comments to reporters after boarding Air Force One, as he departed for the U.S. following his four-day trip to the Middle East. \u0026#34;At least we\u0026#39;ll know. And if we don\u0026#39;t solve it, it\u0026#39;ll be very interesting.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump \u003ca href=\"https://www.cnn.com/2025/04/24/politics/trump-ukraine-war-frustration\" target=\"_blank\"\u003ehas grown frustrated\u003c/a\u003e with his administration\u0026#39;s efforts to facilitate a deal between Russia and Ukraine and has told advisers in private discussions that mediating a peace deal has been more difficult than he expected, CNN previously reported, citing sources. During his campaign, the U.S. president\u003ca href=\"https://www.nbcnews.com/politics/politics-news/trump-vowed-end-ukraine-war-24-hours-conflict-still-rages-rcna203085\" target=\"_blank\"\u003e repeatedly said he would be able to end the war\u003c/a\u003e between Russia and Ukraine \u0026#34;in 24 hours\u0026#34; upon taking office.\u003c/p\u003e\u003cp\u003eTrump has lately taken to blaming both sides, where he previously assigned blame solely on Ukraine\u0026#39;s Zelenskyy for making \u0026#34;inflammatory statements\u0026#34; that \u0026#34;makes it so difficult to settle this war.\u0026#34; He also accused the Ukrainian leader of adding to war complications by \u0026#34;boasting\u0026#34; that Kyiv would not legally recognize ceding Crimea to Russia. Trump recently chastised Putin for Russia\u0026#39;s strikes on Ukraine in late April that were \u003ca href=\"https://www.nbcnews.com/news/world/putin-trump-zelenskyy-ukraine-russia-kyiv-kharkiv-war-peace-crimea-rcna202736\" target=\"_blank\"\u003e\u0026#34;\u003c/a\u003enot necessary, and very bad timing.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-05-17T16:04:18Z",
  "modifiedTime": "2025-05-17T16:05:33Z"
}
