{
  "id": "77bb1c86-3d4c-45da-b13d-aba2f3558087",
  "title": "Trump travel ban: US bars entry of nationals from 12 countries. Who is on the list?",
  "link": "https://timesofindia.indiatimes.com/world/us/trump-travel-ban-us-bars-entry-of-nationals-from-12-countries-who-is-on-the-list/articleshow/121635168.cms",
  "description": "President Trump has implemented a travel ban on nationals from 12 countries, citing national security concerns related to screening and vetting deficiencies. The White House highlights high visa overstay rates and lack of cooperation in accepting removable nationals as key factors.",
  "author": "TOI World Desk",
  "published": "2025-06-05T06:19:20+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 8021,
  "excerpt": "US News: President Trump has implemented a travel ban on nationals from 12 countries, citing national security concerns related to screening and vetting defici",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US President Donald Trump (fie Image)US President Donald Trump issued a proclamation implementing a travel ban from nationals of 12 countries, citing national security risks, according to the White House.\"The Proclamation fully restricts and limits the entry of nationals from 12 countries found to be deficient with regard to screening and vetting and determined to pose a very high risk to the United States,\" the White House said in a statement.White House spokesperson Abigail Jackson posted on X: \"President Trump is fulfilling his promise to protect Americans from dangerous foreign actors that want to come to our country and cause us harm.\"During his initial presidency, Trump introduced restrictions on travellers from seven predominantly Muslim countries, a policy that underwent several revisions before receiving Supreme Court approval in 2018. However, his successor, Democratic President Joe Biden, abolished these restrictions in 2021, stating it was \"a stain on our national conscience.\"Which are the 12 countries?Afghanistan: The Taliban, a Specially Designated Global Terrorist (SDGT) group, controls Afghanistan. Afghanistan lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. According to the Fiscal Year 2023 Department of Homeland Security (DHS) Entry/Exit Overstay Report (“Overstay Report”), Afghanistan had a business/tourist (B1/B2) visa overstay rate of 9.70 percent and a student (F), vocational (M), and exchange visitor (J) visa overstay rate of 29.30 percent, the White House said in a statement.Burma: According to the US citing Overstay Report, Burma had a B1/B2 visa overstay rate of 27.07 percent and an F, M, and J visa overstay rate of 42.17 percent. Additionally, Burma has historically not cooperated with the United States to accept back their removable nationals.Chad: \"According to the Overstay Report, Chad had a B1/B2 visa overstay rate of 49.54 percent and an F, M, and J visa overstay rate of 55.64 percent. According to the Fiscal Year 2022 Overstay Report, Chad had a B1/B2 visa overstay rate of 37.12 percent. The high visa overstay rate for 2022 and 2023 is unacceptable and indicates a blatant disregard for US immigration laws,\" as per the statement released by the White House. Republic of the Congo: According to the Overstay Report, the Republic of the Congo had a B1/B2 visa overstay rate of 29.63 percent and an F, M, and J visa overstay rate of 35.14 percent.Equatorial Guinea: \"According to the Overstay Report, Equatorial Guinea had a B1/B2 visa overstay rate of 21.98 percent and an F, M, and J visa overstay rate of 70.18 percent,\" the statement read. Eritrea: The United States questions the competence of the central authority for issuance of passports or civil documents in Eritrea. Criminal records are not available to the United States for Eritrean nationals. Eritrea has historically refused to accept back its removable nationals. According to the Overstay Report, Eritrea had a B1/B2 visa overstay rate of 20.09 percent and an F, M, and J visa overstay rate of 55.43 percent.Haiti: According to the Overstay Report, Haiti had a B1/B2 visa overstay rate of 31.38 percent and an F, M, and J visa overstay rate of 25.05 percent. Additionally, hundreds of thousands of illegal Haitian aliens flooded into the United States during the Biden Administration. This influx harms American communities by creating acute risks of increased overstay rates, establishment of criminal networks, and other national security threats. As is widely known, Haiti lacks a central authority with sufficient availability and dissemination of law enforcement information necessary to ensure its nationals do not undermine the national security of the United States.Iran: Iran is a state sponsor of terrorism. Iran regularly fails to cooperate with the United States Government in identifying security risks, is the source of significant terrorism around the world, and has historically failed to accept back its removable nationals, as per the statement released by the White House.Libya: There is no competent or cooperative central authority for issuing passports or civil documents in Libya. The historical terrorist presence within Libya’s territory amplifies the risks posed by the entry into the United States of its nationals.Somalia: \"Somalia lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. Somalia stands apart from other countries in the degree to which its government lacks command and control of its territory, which greatly limits the effectiveness of its national capabilities in a variety of respects. A persistent terrorist threat also emanates from Somalia’s territory. The United States Government has identified Somalia as a terrorist safe haven. Terrorists use regions of Somalia as safe havens from which they plan, facilitate, and conduct their operations. Somalia also remains a destination for individuals attempting to join terrorist groups that threaten the national security of the United States. The Government of Somalia struggles to provide governance needed to limit terrorists’ freedom of movement. Additionally, Somalia has historically refused to accept back its removable nationals,\" the statement reads.Sudan: Sudan lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures, the White House said in a statement. According to the Overstay Report, Sudan had a B1/B2 visa overstay rate of 26.30 percent and an F, M, and J visa overstay rate of 28.40 percent.Yemen: Yemen lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. The government does not have physical control over its own territory. Since January 20, 2025, Yemen has been the site of active US military operations.The Proclamation partially also restrict and limit the entry of nationals from 7 countries who also pose a high level of risk to the United States.Trump's order partially restricts travel from 7 other countries: Which are they?Burundi: According to the White House citing Overstay Report, Burundi had a B1/B2 visa overstay rate of 15.35 percent and an F, M, and J visa overstay rate of 17.52 percent. Cuba: Cuba is a state sponsor of terrorism. The Government of Cuba does not cooperate or share sufficient law enforcement information with the United States. Cuba has historically refused to accept back its removable nationals. According to the Overstay Report, Cuba had a B1/B2 visa overstay rate of 7.69 percent and a F, M, and J visa overstay rate of 18.75 percent. Laos: According to the Overstay Report, Laos had a B1/B2 visa overstay rate of 34.77 percent and a F, M, and J visa overstay rate of 6.49 percent. Laos has historically failed to accept back its removable nationals. Sierra Leone: According to the Overstay Report, Sierra Leone had a B1/B2 visa overstay rate of 15.43 percent and a F, M, and J visa overstay rate of 35.83 percent. Sierra Leone has historically failed to accept back its removable nationals. Togo: According to the Overstay Report, Togo had a B1/B2 visa overstay rate of 19.03 percent and a F, M, and J visa overstay rate of 35.05 percent. Turkmenistan: According to the White House citing Overstay Report, Turkmenistan had a B1/B2 visa overstay rate of 15.35 percent and a F, M, and J visa overstay rate of 21.74 percent. Venezuela: As per the White House's statement, Venezuela lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. Venezuela has historically refused to accept back its removable nationals. According to the Overstay Report, Venezuela had a B1/B2 visa overstay rate of 9.83 percent.",
  "image": "https://static.toiimg.com/thumb/msid-121635195,width-1070,height-580,imgsize-24286,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121635195,imgsize-24286,width-400,resizemode-4/121635195.jpg\" alt=\"Trump travel ban: US bars entry of nationals from 12 countries. Who is on the list?\" title=\"US President Donald Trump (fie Image)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"US President Donald Trump (fie Image)\"\u003eUS President Donald Trump (fie Image)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eUS President Donald Trump issued a proclamation implementing a travel ban from nationals of 12 countries, citing national security risks, according to the White House.\u003cspan data-pos=\"1\"\u003e\u003c/span\u003e\u0026#34;The Proclamation fully restricts and limits the entry of nationals from 12 countries found to be deficient with regard to screening and vetting and determined to pose a very high risk to the United States,\u0026#34; the White House said in a statement.\u003cspan data-pos=\"4\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"6\"\u003e\u003c/span\u003eWhite House spokesperson Abigail Jackson posted on X: \u0026#34;President Trump is fulfilling his promise to protect Americans from dangerous foreign actors that want to come to our country and cause us harm.\u0026#34;\u003cspan data-pos=\"8\"\u003e\u003c/span\u003eDuring his initial presidency, Trump introduced restrictions on travellers from seven predominantly Muslim countries, a policy that underwent several revisions before receiving Supreme Court approval in 2018. However, his successor, Democratic President Joe Biden, abolished these restrictions in 2021, stating it was \u0026#34;a stain on our national conscience.\u0026#34;\u003cspan data-pos=\"12\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"13\"\u003e\u003ch3\u003eWhich are the 12 countries?\u003cbr/\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"14\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eAfghanistan\u003c/span\u003e: The Taliban, a Specially Designated Global Terrorist (SDGT) group, controls Afghanistan. Afghanistan lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. \u003c/p\u003e\u003cp\u003eAccording to the Fiscal Year 2023 Department of Homeland Security (DHS) Entry/Exit Overstay Report (“Overstay Report”), Afghanistan had a business/tourist (B1/B2) visa overstay rate of 9.70 percent and a student (F), vocational (M), and exchange visitor (J) visa overstay rate of 29.30 percent, the White House said in a statement.\u003cspan data-pos=\"19\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eBurma\u003c/span\u003e: According to the US citing Overstay Report, Burma had a B1/B2 visa overstay rate of 27.07 percent and an F, M, and J visa overstay rate of 42.17 percent. Additionally, Burma has historically not cooperated with the United States to accept back their removable nationals.\u003cspan data-pos=\"24\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eChad\u003c/span\u003e: \u0026#34;According to the Overstay Report, Chad had a B1/B2 visa overstay rate of 49.54 percent and an F, M, and J visa overstay rate of 55.64 percent. According to the Fiscal Year 2022 Overstay Report, Chad had a B1/B2 visa overstay rate of 37.12 percent. The high visa overstay rate for 2022 and 2023 is unacceptable and indicates a blatant disregard for US immigration laws,\u0026#34; as per the statement released by the White House. \u003cspan data-pos=\"28\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eRepublic of the Congo\u003c/span\u003e: According to the Overstay Report, the Republic of the Congo had a B1/B2 visa overstay rate of 29.63 percent and an F, M, and J visa overstay rate of 35.14 percent.\u003cspan data-pos=\"31\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eEquatorial Guinea\u003c/span\u003e: \u0026#34;According to the Overstay Report, Equatorial Guinea had a B1/B2 visa overstay rate of 21.98 percent and an F, M, and J visa overstay rate of 70.18 percent,\u0026#34; the statement read. \u003cspan data-pos=\"34\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eEritrea\u003c/span\u003e: The United States questions the competence of the central authority for issuance of passports or civil documents in Eritrea. Criminal records are not available to the United States for Eritrean nationals. Eritrea has historically refused to accept back its removable nationals. According to the Overstay Report, Eritrea had a B1/B2 visa overstay rate of 20.09 percent and an F, M, and J visa overstay rate of 55.43 percent.\u003cspan data-pos=\"39\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eHaiti\u003c/span\u003e: According to the Overstay Report, Haiti had a B1/B2 visa overstay rate of 31.38 percent and an F, M, and J visa overstay rate of 25.05 percent. Additionally, hundreds of thousands of illegal Haitian aliens flooded into the United States during the Biden Administration. This influx harms American communities by creating acute risks of increased overstay rates, establishment of criminal networks, and other national security threats. As is widely known, Haiti lacks a central authority with sufficient availability and dissemination of law enforcement information necessary to ensure its nationals do not undermine the national security of the United States.\u003cspan data-pos=\"46\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eIran\u003c/span\u003e: Iran is a state sponsor of terrorism. Iran regularly fails to cooperate with the United States Government in identifying security risks, is the source of significant terrorism around the world, and has historically failed to accept back its removable nationals, as per the statement released by the White House.\u003cspan data-pos=\"49\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eLibya\u003c/span\u003e: There is no competent or cooperative central authority for issuing passports or civil documents in Libya. The historical terrorist presence within Libya’s territory amplifies the risks posed by the entry into the United States of its nationals.\u003cspan data-pos=\"54\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eSomalia\u003c/span\u003e: \u0026#34;Somalia lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. Somalia stands apart from other countries in the degree to which its government lacks command and control of its territory, which greatly limits the effectiveness of its national capabilities in a variety of respects. A persistent terrorist threat also emanates from Somalia’s territory. The United States Government has identified Somalia as a terrorist safe haven. Terrorists use regions of Somalia as safe havens from which they plan, facilitate, and conduct their operations. Somalia also remains a destination for individuals attempting to join terrorist groups that threaten the national security of the United States. The Government of Somalia struggles to provide governance needed to limit terrorists’ freedom of movement. Additionally, Somalia has historically refused to accept back its removable nationals,\u0026#34; the statement reads.\u003cspan data-pos=\"62\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eSudan\u003c/span\u003e: Sudan lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures, the White House said in a statement. According to the Overstay Report, Sudan had a B1/B2 visa overstay rate of 26.30 percent and an F, M, and J visa overstay rate of 28.40 percent.\u003cspan data-pos=\"66\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eYemen\u003c/span\u003e: Yemen lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures. The government does not have physical control over its own territory. Since January 20, 2025, Yemen has been the site of active US military operations.\u003cspan data-pos=\"69\"\u003e\u003c/span\u003eThe Proclamation partially also restrict and limit the entry of nationals from 7 countries who also pose a high level of risk to the United States.\u003cspan data-pos=\"71\"\u003e\u003c/span\u003e\u003c/p\u003e\u003cp data-pos=\"72\"\u003e\u003ch3\u003eTrump\u0026#39;s order partially restricts travel from 7 other countries: Which are they?\u003c/h3\u003e\u003c/p\u003e\u003cdiv data-pos=\"73\"\u003e\u003cul\u003e\u003cli\u003eBurundi: According to the White House citing Overstay Report, Burundi had a B1/B2 visa overstay rate of 15.35 percent and an F, M, and J visa overstay rate of 17.52 percent. \u003c/li\u003e\u003cli\u003e Cuba: Cuba is a state sponsor of terrorism.  The Government of Cuba does not cooperate or share sufficient law enforcement information with the United States.  Cuba has historically refused to accept back its removable nationals.  According to the Overstay Report, Cuba had a B1/B2 visa overstay rate of 7.69 percent and a F, M, and J visa overstay rate of 18.75 percent.\u003c/li\u003e\u003cli\u003e Laos: According to the Overstay Report, Laos had a B1/B2 visa overstay rate of 34.77 percent and a F, M, and J visa overstay rate of 6.49 percent.  Laos has historically failed to accept back its removable nationals. \u003c/li\u003e\u003cli\u003e Sierra Leone: According to the Overstay Report, Sierra Leone had a B1/B2 visa overstay rate of 15.43 percent and a F, M, and J visa overstay rate of 35.83 percent.  Sierra Leone has historically failed to accept back its removable nationals. \u003c/li\u003e\u003cli\u003e Togo: According to the Overstay Report, Togo had a B1/B2 visa overstay rate of 19.03 percent and a F, M, and J visa overstay rate of 35.05 percent. \u003c/li\u003e\u003cli\u003e Turkmenistan: According to the White House citing Overstay Report, Turkmenistan had a B1/B2 visa overstay rate of 15.35 percent and a F, M, and J visa overstay rate of 21.74 percent. \u003c/li\u003e\u003cli\u003e Venezuela: As per the White House\u0026#39;s statement, Venezuela lacks a competent or cooperative central authority for issuing passports or civil documents and it does not have appropriate screening and vetting measures.  Venezuela has historically refused to accept back its removable nationals.  According to the Overstay Report, Venezuela had a B1/B2 visa overstay rate of 9.83 percent.\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-05T06:19:00+05:30",
  "modifiedTime": null
}
