{
  "id": "7d25e8cb-0c30-40d4-9177-8d9e91eb9b82",
  "title": "Israel PM Vows \"Merciless Strikes\" On Hezbollah, Including Beirut",
  "link": "https://www.ndtv.com/world-news/israel-pm-netanyahu-vows-merciless-strikes-on-hezbollah-including-beirut-6789657",
  "description": "Israeli Prime Minister Benjamin Netanyahu on Monday vowed to strike Hezbollah without mercy following a deadly drone strike on a military base in Israel, and retaliation would extend to targets in Beirut.",
  "author": "",
  "published": "Mon, 14 Oct 2024 23:06:18 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 5616,
  "excerpt": "Israeli Prime Minister Benjamin Netanyahu on Monday vowed to strike Hezbollah without mercy following a deadly drone strike on a military base in Israel, and retaliation would extend to targets in Beirut.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Jerusalem: Israeli Prime Minister Benjamin Netanyahu on Monday vowed to strike Hezbollah without mercy, a day after the Iran-backed group's deadliest strike on Israel since the start of the war in late September.Hezbollah's drone attack on an Israeli base killed four soldiers on Sunday, while another 60 people were injured, according to the Israeli volunteer rescue service United Hatzalah.\"We will continue to mercilessly strike Hezbollah in all parts of Lebanon -- including Beirut,\" Netanyahu said as he visited the base near Binyamina, south of Haifa.Hezbollah said it launched the \"squadron of attack drones\" in response to Israeli attacks, including one last week that Lebanon's health ministry said killed at least 22 people in central Beirut.Since Israel on September 23 escalated its bombing against targets in Lebanon the war has killed at least 1,315 people, according to an AFP tally of Lebanese health ministry figures, though the real toll is likely to be higher.Prior to Netanyahu's comments a string of new air strikes had already occurred against targets around Lebanon, including one in a northern Christian-majority village which killed at least 21 people, according to the health ministry.Yousef, the manager of a restaurant near the Binyamina base, told AFP he heard \"a huge boom\" before many ambulances arrived.Hezbollah said on Monday around midday that it had launched rockets at a naval base near Haifa before a further \"big rocket salvo\" in the early evening at the northern Israeli town of Safed.Its fighters were also \"engaged in violent clashes\" in the Lebanese frontier village of Aita al-Shaab, and were fighting elsewhere as well, it said.Air raid sirens sounded across central Israel in the early evening, including in the commercial hub of Tel Aviv, the military said, after it earlier reported the interception of two drones approaching from Syria.'Never-ending' strikesAfter almost a year of tit-for-tat exchanges between Hezbollah and Israeli forces over the Lebanon border, Israel intensified its strikes against targets in Lebanon late last month before sending ground troops across the frontier.Israel wants to push back Hezbollah in order to secure its northern boundary and allow tens of thousands of people displaced by rocket fire over the last year to return home safely.Hezbollah says its strikes are in solidarity with its Palestinian ally, Hamas, which attacked Israel on October 7 last year, triggering the ongoing Gaza war with Israel.The International Organization for Migration said last week it had verified 690,000 displaced people in Lebanon.Israel's deadly air strike on the village of Aito in northern Lebanon on Monday marked a departure from the usual pattern, being located far from the main combat area and in a mostly Christian area.Israel has focused its firepower mostly on Hezbollah strongholds in Shiite Muslim-majority areas in the south and in the suburbs of Beirut.An AFP photographer in Aito said the missile levelled a residential building. Body parts were scattered in the rubble.In the southern border town of Marjayoun, civil defence chief Anis Abla told AFP his rescue teams were exhausted.\"Our rescue missions are becoming more and more difficult, because the strikes are never-ending and target us,\" he said.Lebanon's health ministry condemned Israel's \"continued targeting of medical, relief and paramedics teams.\"Israel also continues to face criticism over injuries and damage sustained by the UN peacekeeping force which has been deployed in Lebanon since 1978.Five peacekeepers were injured in a series of incidents last week, with the UN force on Sunday accusing Israeli troops of breaking through a gate with two tanks and entering one of their positions.The Israeli military said a tank \"backed several meters into a UNIFIL post\" while \"under fire\" and attempting to evacuate injured soldiers.Anti-missile defencePrime Minister Simon Harris of Ireland, which has troops in the UNIFIL mission, on Monday told Israeli President Isaac Herzog in a phone call that UNIFIL has \"a clear mandate from the Security Council, and that it must be allowed to carry out its functions unimpeded,\" Harris's office said.The Hamas attack on Israel last year which triggered war in Gaza resulted in the deaths of 1,206 people, mostly civilians, according to an AFP tally of official Israeli figures.The number includes hostages killed in captivity.Israel's retaliatory military campaign in Gaza has killed, according to the health ministry in the Hamas-run territory, 42,289 people, the majority civilians. The UN has described the figures as reliable.With the war there, and in Lebanon, showing no sign of abating, fears of even wider regional conflict have seen Iran, which backs Hezbollah and Hamas, engage in diplomatic efforts with allies and other powers.Iranian Foreign Minister Abbas Araghchi met a senior official from Yemen's Iran-backed Huthi movement in Oman, the latest stop in a regional diplomatic tour.Jordan's King Abdullah II warned of \"a regional war that will be costly for everyone,\" during a meeting with Lebanon's Prime Minister Najib Mikati on Monday.Just before Sunday's attack on the Israeli army base, the Pentagon said it would deploy a high-altitude anti-missile system known as THAAD to Israel to further boost its ally's defences against a potential Iranian attack.Israel is still weighing its response to an October 1 missile attack by Iran, the latest of two it has carried out against Israel this year.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-10/shuf1vd_benjamin-netanyahu-_625x300_09_October_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eJerusalem: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eIsraeli Prime Minister Benjamin Netanyahu on Monday vowed to strike Hezbollah without mercy, a day after the Iran-backed group\u0026#39;s deadliest strike on Israel since the start of the war in late September.\u003c/p\u003e\u003cp\u003eHezbollah\u0026#39;s drone attack on an Israeli base killed four soldiers on Sunday, while another 60 people were injured, according to the Israeli volunteer rescue service United Hatzalah.\u003c/p\u003e\u003cp\u003e\u0026#34;We will continue to mercilessly strike Hezbollah in all parts of Lebanon -- including Beirut,\u0026#34; Netanyahu said as he visited the base near Binyamina, south of Haifa.\u003c/p\u003e\u003cp\u003eHezbollah said it launched the \u0026#34;squadron of attack drones\u0026#34; in response to Israeli attacks, including one last week that Lebanon\u0026#39;s health ministry said killed at least 22 people in central Beirut.\u003c/p\u003e\u003cp\u003eSince Israel on September 23 escalated its bombing against targets in Lebanon the war has killed at least 1,315 people, according to an AFP tally of Lebanese health ministry figures, though the real toll is likely to be higher.\u003c/p\u003e\u003cp\u003ePrior to Netanyahu\u0026#39;s comments a string of new air strikes had already occurred against targets around Lebanon, including one in a northern Christian-majority village which killed at least 21 people, according to the health ministry.\u003c/p\u003e\u003cp\u003eYousef, the manager of a restaurant near the Binyamina base, told AFP he heard \u0026#34;a huge boom\u0026#34; before many ambulances arrived.\u003c/p\u003e\u003cp\u003eHezbollah said on Monday around midday that it had launched rockets at a naval base near Haifa before a further \u0026#34;big rocket salvo\u0026#34; in the early evening at the northern Israeli town of Safed.\u003c/p\u003e\u003cp\u003eIts fighters were also \u0026#34;engaged in violent clashes\u0026#34; in the Lebanese frontier village of Aita al-Shaab, and were fighting elsewhere as well, it said.\u003c/p\u003e\u003cp\u003eAir raid sirens sounded across central Israel in the early evening, including in the commercial hub of Tel Aviv, the military said, after it earlier reported the interception of two drones approaching from Syria.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u0026#39;Never-ending\u0026#39; strikes\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAfter almost a year of tit-for-tat exchanges between Hezbollah and Israeli forces over the Lebanon border, Israel intensified its strikes against targets in Lebanon late last month before sending ground troops across the frontier.\u003c/p\u003e\u003cp\u003eIsrael wants to push back Hezbollah in order to secure its northern boundary and allow tens of thousands of people displaced by rocket fire over the last year to return home safely.\u003c/p\u003e\u003cp\u003eHezbollah says its strikes are in solidarity with its Palestinian ally, Hamas, which attacked Israel on October 7 last year, triggering the ongoing Gaza war with Israel.\u003c/p\u003e\u003cp\u003eThe International Organization for Migration said last week it had verified 690,000 displaced people in Lebanon.\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s deadly air strike on the village of Aito in northern Lebanon on Monday marked a departure from the usual pattern, being located far from the main combat area and in a mostly Christian area.\u003c/p\u003e\u003cp\u003eIsrael has focused its firepower mostly on Hezbollah strongholds in Shiite Muslim-majority areas in the south and in the suburbs of Beirut.\u003c/p\u003e\u003cp\u003eAn AFP photographer in Aito said the missile levelled a residential building. Body parts were scattered in the rubble.\u003c/p\u003e\u003cp\u003eIn the southern border town of Marjayoun, civil defence chief Anis Abla told AFP his rescue teams were exhausted.\u003c/p\u003e\u003cp\u003e\u0026#34;Our rescue missions are becoming more and more difficult, because the strikes are never-ending and target us,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eLebanon\u0026#39;s health ministry condemned Israel\u0026#39;s \u0026#34;continued targeting of medical, relief and paramedics teams.\u0026#34;\u003c/p\u003e\u003cp\u003eIsrael also continues to face criticism over injuries and damage sustained by the UN peacekeeping force which has been deployed in Lebanon since 1978.\u003c/p\u003e\u003cp\u003eFive peacekeepers were injured in a series of incidents last week, with the UN force on Sunday accusing Israeli troops of breaking through a gate with two tanks and entering one of their positions.\u003c/p\u003e\u003cp\u003eThe Israeli military said a tank \u0026#34;backed several meters into a UNIFIL post\u0026#34; while \u0026#34;under fire\u0026#34; and attempting to evacuate injured soldiers.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAnti-missile defence\u003c/strong\u003e\u003c/p\u003e\u003cp\u003ePrime Minister Simon Harris of Ireland, which has troops in the UNIFIL mission, on Monday told Israeli President Isaac Herzog in a phone call that UNIFIL has \u0026#34;a clear mandate from the Security Council, and that it must be allowed to carry out its functions unimpeded,\u0026#34; Harris\u0026#39;s office said.\u003c/p\u003e\u003cp\u003eThe Hamas attack on Israel last year which triggered war in Gaza resulted in the deaths of 1,206 people, mostly civilians, according to an AFP tally of official Israeli figures.\u003c/p\u003e\u003cp\u003eThe number includes hostages killed in captivity.\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s retaliatory military campaign in Gaza has killed, according to the health ministry in the Hamas-run territory, 42,289 people, the majority civilians. The UN has described the figures as reliable.\u003c/p\u003e\u003cp\u003eWith the war there, and in Lebanon, showing no sign of abating, fears of even wider regional conflict have seen Iran, which backs Hezbollah and Hamas, engage in diplomatic efforts with allies and other powers.\u003c/p\u003e\u003cp\u003eIranian Foreign Minister Abbas Araghchi met a senior official from Yemen\u0026#39;s Iran-backed Huthi movement in Oman, the latest stop in a regional diplomatic tour.\u003c/p\u003e\u003cp\u003eJordan\u0026#39;s King Abdullah II warned of \u0026#34;a regional war that will be costly for everyone,\u0026#34; during a meeting with Lebanon\u0026#39;s Prime Minister Najib Mikati on Monday.\u003c/p\u003e\u003cp\u003eJust before Sunday\u0026#39;s attack on the Israeli army base, the Pentagon said it would deploy a high-altitude anti-missile system known as THAAD to Israel to further boost its ally\u0026#39;s defences against a potential Iranian attack.\u003c/p\u003e\u003cp\u003eIsrael is still weighing its response to an October 1 missile attack by Iran, the latest of two it has carried out against Israel this year.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-14T23:06:18+05:30",
  "modifiedTime": null
}
