{
  "id": "810fd4d5-da57-4d51-92ed-560db05c7540",
  "title": "US judge rules NSO Group liable for hacking WhatsApp with Pegasus spyware",
  "link": "https://timesofindia.indiatimes.com/world/us/us-judge-rules-israels-nso-group-liable-for-hacking-whatsapp-using-pegasus-spyware/articleshow/116552454.cms",
  "description": "A California judge ruled against Israeli spyware firm NSO Group in a lawsuit filed by WhatsApp, accusing NSO of exploiting a bug to install Pegasus spyware. The judge held NSO liable for hacking and breach of contract, with the case now proceeding to trial solely to determine damages.",
  "author": "TOI World Desk",
  "published": "2024-12-22T05:50:25+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 4207,
  "excerpt": "US News: A California judge ruled against Israeli spyware firm NSO Group in a lawsuit filed by WhatsApp, accusing NSO of exploiting a bug to install Pegasus sp",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "WhatsApp and NSO Group (Picture credit: Agencies)A US judge ruled against Israel's NSO Group on Friday, holding it responsible for hacking WhatsApp and breaching its contract. The lawsuit accused NSO of exploiting a flaw in WhatsApp to install spyware called Pegasus. The case will now proceed to trial to determine the damages NSO must pay.WhatsApp filed the lawsuit in 2019, claiming the company accessed its servers without permission to install Pegasus on approximately 1,400 devices. These devices belonged to journalists, human rights activists, and others.The judgmentIn a summary judgment, US district judge Phyllis Hamilton in Oakland, California, held Israeli surveillance company NSO Group Technologies, also known as Q Cyber Technologies, responsible for hacking Meta's WhatsApp using its advanced military-grade spyware, Pegasus.The court found that NSO violated the Computer Fraud and Abuse Act and the Comprehensive Computer Data Access and Fraud Act by sending malicious messages through WhatsApp servers to compromise user devices. Additionally, it ruled that NSO breached its contract by violating WhatsApp's Terms of Service.The summary judgment dated December 20 states, as quoted by Live Law:\"Thus, the Court grants summary judgment in plaintiffs' favour on the CFAA claim under both section (a)(2) and (a)(4), on theory that defendants exceeded their authorisation. Defendants appear to fully acknowledge that the WIS sent messages through WhatsApp servers that caused Pegasus to be installed on target users' devices and that the WIS was then able to obtain protected information by having it sent from the target users, through the WhatsApp servers, and back to the WIS... defendants argue that Pegasus was operated by their clients, and thus defendants did not collect any information. Defendants further argue that terms such as 'illegal,' 'unauthorised,' and 'harmful' as used in terms of service are vague and ambiguous. Finally, the defendants argue that plaintiffs waived those contractual provisions by failing to enforce them against any other users. The Court finds no merit in the arguments raised by the defendants.\"WhatsApp's reaction\"We spent five years presenting our case because we firmly believe that spyware companies could not hide behind immunity or avoid accountability for their unlawful actions,\" said Will Cathcart, head of WhatsApp. \"Surveillance companies should be on notice that illegal spying will not be tolerated,\" he added.A WhatsApp spokesperson expressed gratitude for the decision, stating, \"We’re proud to have stood up against NSO and thankful to the many organizations that were supportive of this case. WhatsApp will never stop working to protect people’s private communication.\"NSO's defenceNSO argued that its software is used by law enforcement and intelligence agencies to combat crime and terrorism.The company appealed a trial judge's 2020 decision denying it \"conduct-based immunity,\" a legal doctrine shielding foreign officials acting in their official capacity.In 2021, the San Francisco-based 9th US Circuit Court of Appeals upheld the ruling, describing it as an \"easy case\" since NSO's licensing of Pegasus and provision of technical support did not exempt it from liability under the Foreign Sovereign Immunities Act, which overruled common law.The US Supreme Court declined to hear NSO's appeal last year, allowing the lawsuit to proceed.'Landmark ruling'John Scott-Railton, a senior researcher with Citizen Lab, described the ruling as a landmark decision with \"huge implications for the spyware industry.\" He stated, \"The entire industry has hidden behind the claim that whatever their customers do with their hacking tools, it's not their responsibility. Today's ruling makes it clear that NSO Group is in fact responsible for breaking numerous laws.\" Citizen Lab was the first to expose NSO's Pegasus spyware in 2016.The lawsuitThe case originated in 2019 when WhatsApp filed a lawsuit against NSO Group, accusing it of violating federal anti-hacking laws. The lawsuit alleged that NSO's flagship spyware, Pegasus, was used in a widespread attack targeting 1,400 individuals, including human rights advocates and journalists.",
  "image": "https://static.toiimg.com/thumb/msid-116552848,width-1070,height-580,imgsize-605597,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003csection\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-116552848,imgsize-605597,width-400,resizemode-4/116552848.jpg\" alt=\"US judge rules Israel\u0026#39;s NSO Group liable for hacking WhatsApp using Pegasus spyware\" title=\"WhatsApp and NSO Group (Picture credit: Agencies)\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan title=\"WhatsApp and NSO Group (Picture credit: Agencies)\"\u003eWhatsApp and NSO Group (Picture credit: Agencies)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003cp\u003eA US judge ruled against Israel\u0026#39;s NSO Group on Friday, holding it responsible for hacking \u003ca href=\"https://timesofindia.indiatimes.com/topic/whatsapp\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eWhatsApp\u003c/a\u003e and breaching its contract. The lawsuit accused NSO of exploiting a flaw in WhatsApp to install spyware called Pegasus. The case will now proceed to trial to determine the damages NSO must pay.\u003cbr/\u003eWhatsApp filed the lawsuit in 2019, claiming the company accessed its servers without permission to install Pegasus on approximately 1,400 devices. These devices belonged to journalists, human rights activists, and others.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe judgment\u003c/span\u003e\u003cbr/\u003eIn a summary judgment, US district judge Phyllis Hamilton in Oakland, California, held Israeli surveillance company NSO Group Technologies, also known as Q Cyber Technologies, responsible for hacking Meta\u0026#39;s WhatsApp using its advanced military-grade spyware, Pegasus.\u003c/p\u003e\u003cp\u003eThe court found that NSO violated the Computer Fraud and Abuse Act and the Comprehensive Computer Data Access and Fraud Act by sending malicious messages through WhatsApp servers to compromise user devices. Additionally, it ruled that NSO breached its contract by violating WhatsApp\u0026#39;s Terms of Service.\u003cbr/\u003eThe summary judgment dated December 20 states, as quoted by Live Law:\u003cbr/\u003e\u0026#34;Thus, the Court grants summary judgment in plaintiffs\u0026#39; favour on the CFAA claim under both section (a)(2) and (a)(4), on theory that defendants exceeded their authorisation. Defendants appear to fully acknowledge that the WIS sent messages through WhatsApp servers that caused Pegasus to be installed on target users\u0026#39; devices and that the WIS was then able to obtain protected information by having it sent from the target users, through the WhatsApp servers, and back to the WIS... defendants argue that Pegasus was operated by their clients, and thus defendants did not collect any information. Defendants further argue that terms such as \u0026#39;illegal,\u0026#39; \u0026#39;unauthorised,\u0026#39; and \u0026#39;harmful\u0026#39; as used in terms of service are vague and ambiguous. Finally, the defendants argue that plaintiffs waived those contractual provisions by failing to enforce them against any other users. The Court finds no merit in the arguments raised by the defendants.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eWhatsApp\u0026#39;s reaction\u003c/span\u003e\u003cbr/\u003e\u0026#34;We spent five years presenting our case because we firmly believe that spyware companies could not hide behind immunity or avoid accountability for their unlawful actions,\u0026#34; said Will Cathcart, head of WhatsApp. \u0026#34;Surveillance companies should be on notice that illegal spying will not be tolerated,\u0026#34; he added.\u003cbr/\u003eA WhatsApp spokesperson expressed gratitude for the decision, stating, \u0026#34;We’re proud to have stood up against NSO and thankful to the many organizations that were supportive of this case. WhatsApp will never stop working to protect people’s private communication.\u0026#34;\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eNSO\u0026#39;s defence\u003c/span\u003e\u003cbr/\u003eNSO argued that its software is used by law enforcement and intelligence agencies to combat crime and terrorism.\u003cbr/\u003eThe company appealed a trial judge\u0026#39;s 2020 decision denying it \u0026#34;conduct-based immunity,\u0026#34; a \u003ca href=\"https://timesofindia.indiatimes.com/topic/legal\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003elegal\u003c/a\u003e doctrine shielding foreign officials acting in their official capacity.\u003cbr/\u003eIn 2021, the San Francisco-based 9th US Circuit Court of Appeals upheld the ruling, describing it as an \u0026#34;easy case\u0026#34; since NSO\u0026#39;s licensing of Pegasus and provision of technical support did not exempt it from liability under the Foreign Sovereign Immunities Act, which overruled common law.\u003cbr/\u003eThe US Supreme Court declined to hear NSO\u0026#39;s appeal last year, allowing the lawsuit to proceed.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u0026#39;Landmark ruling\u0026#39;\u003c/span\u003e\u003cbr/\u003eJohn Scott-Railton, a senior researcher with Citizen Lab, described the ruling as a landmark decision with \u0026#34;huge implications for the spyware industry.\u0026#34; He stated, \u0026#34;The entire industry has hidden behind the claim that whatever their customers do with their hacking tools, it\u0026#39;s not their responsibility. Today\u0026#39;s ruling makes it clear that NSO Group is in fact responsible for breaking numerous laws.\u0026#34; Citizen Lab was the first to expose NSO\u0026#39;s Pegasus spyware in 2016.\u003cbr/\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe lawsuit\u003c/span\u003e\u003cbr/\u003eThe case originated in 2019 when WhatsApp filed a lawsuit against NSO Group, accusing it of violating federal anti-hacking laws. The lawsuit alleged that NSO\u0026#39;s flagship spyware, Pegasus, was used in a widespread attack targeting 1,400 individuals, including human rights advocates and journalists.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-22T05:50:00+05:30",
  "modifiedTime": null
}
