{
  "id": "8bdc5645-b866-4399-9a9d-b76c04e7c7a3",
  "title": "\"Torture\": Palestinians Released From Israeli Jails Bear Psychological Scars",
  "link": "https://www.ndtv.com/world-news/torture-palestinians-released-from-israeli-jails-bear-psychological-scars-7372073",
  "description": "Once muscular and strong, Palestinian bodybuilder Moazaz Obaiyat's nine-month spell in Israeli custody left him unable to walk unaided upon his release in July. Then, in an October pre-dawn raid on his home, soldiers detained him again.",
  "author": "",
  "published": "Tue, 31 Dec 2024 20:39:12 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 9176,
  "excerpt": "Once muscular and strong, Palestinian bodybuilder Moazaz Obaiyat\u0026#039;s nine-month spell in Israeli custody left him unable to walk unaided upon his release in July. Then, in an October pre-dawn raid on his home, soldiers detained him again.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Cairo: Once muscular and strong, Palestinian bodybuilder Moazaz Obaiyat's nine-month spell in Israeli custody left him unable to walk unaided upon his release in July. Then, in an October pre-dawn raid on his home, soldiers detained him again.Before being re-arrested, the 37-year-old father of five was diagnosed with severe PTSD by Bethlehem Psychiatric Hospital, related to his time at Israel's remote Ktz'iot prison, according to medical notes seen by Reuters from the hospital, a public clinic in the occupied West Bank.The notes said Obaiyat was subjected to \"physical and psychological violence and torture\" in prison and described symptoms including severe anxiety, withdrawal from his family and avoidance of discussion of traumatic events and current affairs.Alleged abuses and psychological harm to Palestinian detainees in Israeli prisons and camps are in renewed focus amid stepped-up efforts in December by international mediators to secure a ceasefire that could see the release of thousands of inmates detained during the Gaza war and before, in return for Israeli hostages held by the Palestinian group Hamas in Gaza.In the event of the release of detainees in any future deal, many \"will require long-term medical care to recover from the physical and psychological abuse they have endured,\" said Qadoura Fares, head of the Palestinian Commission for Detainees and Ex-Detainees Affairs, a government body in the West Bank. Fares said he was aware of Obaiyat's case.For this story, Reuters spoke to four Palestinian men detained by Israel since the war's outbreak after the Hamas attacks of Oct. 7, 2023. All were held for months, accused of affiliating with an illegal organisation, and released without being formally charged or convicted of any crime.All described lasting psychological scars they attributed to abuses including beatings, sleep and food deprivation and prolonged restraint in stress positions during their time inside. Reuters could not independently verify the conditions in which they were held.Their accounts are consistent with multiple investigations by human rights groups that reported grave abuses of Palestinians in Israeli detention.An investigation published by the United Nations human rights office in August described substantiated reports of widespread \"torture, sexual assault and rape, amid atrocious inhumane conditions\" in prisons since the war began. The U.N. office has also said Hamas' Oct. 7 attacks could amount to war crimes and crimes against humanity.The White House has called the reports of torture, rape and abuse in Israel's prisons \"deeply concerning.\"In response to Reuters questions, the Israeli military said it was investigating several cases of alleged abuse of Gazan detainees by military personnel but \"categorically\" rejected allegations of systematic abuse within its detention facilities.The military declined to comment on individual cases. The Israel Prison Service (IPS), which falls under hard-right national security minister Itamar Ben-Gvir, and the country's internal security service said they were not in a position to comment on individual cases.\"Terrorists in Israeli prisons are granted supervised living conditions and accommodations appropriate for criminals,\" Ben Gvir's office said in response to Reuters questions, adding that the facilities operate in accordance with the law. \"The 'summer camp' is over,\" Ben Gvir's office said.Tal Steiner, executive director of the Israeli rights group Public Committee Against Torture in Israel (PCATI), said the symptoms the men recounted were common and can echo through victims' lifetimes, often shattering their families.\"Torture in Israeli prisons has exploded since October 7. It will have and already has had a devastating effect on Palestinian society,\" said Steiner.Speaking from his hospital bed in July, a severely emaciated Obaiyat called the treatment of himself and fellow prisoners \"disgusting,\" showing scars on his wasted legs and describing isolation, hunger, handcuffs and abuse with metal rods, without giving details.Photos of Obaiyat taken before his incarceration show a powerfully-built man.On Dec. 19, Israel's High Court ordered the state to answer a petition brought by rights groups about the lack of adequate food for Palestinian prisoners.Israel has also reported mistreatment of some of the 251 of its citizens taken captive to Gaza after the Hamas attacks. A report by the Israeli Health Ministry, published on Saturday said hostages were subjected to torture, including sexual and psychological abuse. Hamas has repeatedly denied abuse of the hostages.WITHOUT CHARGEObaiyat is currently being held in a small detention centre in Etzion, south of Bethlehem, according to the Palestinian Prisoners' Club, an advocacy group.He is being held for six months under \"administrative detention\", a form of incarceration without charge or trial, and the official reason for his arrest is unknown, the group said. Israel's military, internal security service and prison service did not respond to questions about his specific case.PCATI said at least 56 Palestinians had died in custody during the war, compared to just one or two annually in the years preceding the conflict. Israel's military said it launches criminal investigations of all deaths of Palestinians in its custody.Palestinian prisoner numbers have at least doubled in Israel and the West Bank to more than 10,000 during the war, PCATI estimates, based on court documents and data obtained through freedom of information requests.Through the course of the war, around 6,000 Gazans have been incarcerated, the Israeli military said in response to a query from Reuters.Unlike Palestinians from the West Bank who are held under military law, Palestinians from Gaza are held in Israel under its Unlawful Combatants Law.The law has been used to hold people incommunicado, deny them their rights as prisoners of war or as prisoners under military occupation, and incarcerate them for extended periods without charge or trial, according to Professor Neve Gordon, an Israeli scholar who specialises in human rights and international law at London's Queen Mary University.The Palestinian Prisoners' Club likened the detentions to forced disappearance.Israel's prison service declined to comment on prisoner numbers and deaths.SDE TEIMAN CAMPFadi Ayman Mohammad Radi, 21, a former engineering student from Khan Younis, Gaza, was one of a couple dozen Palestinians released at the Kerem Shalom crossing into Gaza on Aug. 20.Radi described struggling to stretch out his limbs after being cuffed and chained for four months at Israel's Sde Teiman military detention camp, officially a temporary prisoner sorting facility.\"They didn't interrogate us, they destroyed us,\" said Radi.Located in the Negev desert, Sde Teiman has been the site of grave abuses including rape, according to allegations by whistleblowers among the camp's guards.Israel is currently investigating what the U.N called \"a particularly gruesome case\" of alleged sexual abuse at Sde Teiman in which five soldiers are accused of anally penetrating a detainee with a rod that punctured his internal organs.Radi said he was beaten repeatedly and arbitrarily, permanently restrained and blindfolded, hung up in stress positions and forced to sit on the floor almost constantly without moving.At one point, he said he was deprived of sleep for five consecutive days in a space he said Israeli soldiers called the 'disco room,' subjected to loud music. He did not describe sexual violence.Radi said he found it difficult to sleep and that even talking about his ordeal made him relive it.\"Every time I say the words, I visualise the torture,\" said Radi, who was arrested by Israeli soldiers in Gaza on March 4.Reuters could not independently verify his story. The Israeli military said it was unable to comment, saying it could not find Radi's files because Reuters was unable to provide his ID number.Despite a government decision to phase out Sde Teiman, the camp is still operational, PCATI said.OFER AND KTZ'IOTWidespread abuses have also been reported at more established facilities, such as the Ktz'iot prison, also in the Negev, and Ofer military camp, south of Ramallah in the West Bank.After collating evidence and testimony from 55 former Palestinian prisoners, Israeli rights group B'Tselem earlier this year released a report accusing Israel of deliberately turning the prison system into a 'network of torture camps'.Using emergency legislation introduced after the Oct. 7 attack on Israel by Hamas, Ben Gvir, the hardline minister, ordered conditions be downgraded for 'security prisoners', a category almost entirely comprising Palestinians.Human rights scholar Gordon likened what he said was the use of torture in Israel's prisons to terrorism.\"Terrorism usually is an act that's limited in the number of people directly impacted, but the psychosocial effect is dramatic. It's the same with torture,\" said Gordon, who co-edited a book on abuses in the Israeli prison system.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-12/nmvvh7d_palestinian-moazaz-obaiyat_625x300_31_December_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eCairo: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eOnce muscular and strong, Palestinian bodybuilder Moazaz Obaiyat\u0026#39;s nine-month spell in Israeli custody left him unable to walk unaided upon his release in July. Then, in an October pre-dawn raid on his home, soldiers detained him again.\u003c/p\u003e\u003cp\u003eBefore being re-arrested, the 37-year-old father of five was diagnosed with severe PTSD by Bethlehem Psychiatric Hospital, related to his time at Israel\u0026#39;s remote Ktz\u0026#39;iot prison, according to medical notes seen by Reuters from the hospital, a public clinic in the occupied West Bank.\u003c/p\u003e\u003cp\u003eThe notes said Obaiyat was subjected to \u0026#34;physical and psychological violence and torture\u0026#34; in prison and described symptoms including severe anxiety, withdrawal from his family and avoidance of discussion of traumatic events and current affairs.\u003c/p\u003e\u003cp\u003eAlleged abuses and psychological harm to Palestinian detainees in Israeli prisons and camps are in renewed focus amid stepped-up efforts in December by international mediators to secure a ceasefire that could see the release of thousands of inmates detained during the Gaza war and before, in return for Israeli hostages held by the Palestinian group Hamas in Gaza.\u003c/p\u003e\u003cp\u003eIn the event of the release of detainees in any future deal, many \u0026#34;will require long-term medical care to recover from the physical and psychological abuse they have endured,\u0026#34; said Qadoura Fares, head of the Palestinian Commission for Detainees and Ex-Detainees Affairs, a government body in the West Bank. Fares said he was aware of Obaiyat\u0026#39;s case.\u003c/p\u003e\u003cp\u003eFor this story, Reuters spoke to four Palestinian men detained by Israel since the war\u0026#39;s outbreak after the Hamas attacks of Oct. 7, 2023. All were held for months, accused of affiliating with an illegal organisation, and released without being formally charged or convicted of any crime.\u003c/p\u003e\u003cp\u003eAll described lasting psychological scars they attributed to abuses including beatings, sleep and food deprivation and prolonged restraint in stress positions during their time inside. Reuters could not independently verify the conditions in which they were held.\u003c/p\u003e\u003cp\u003eTheir accounts are consistent with multiple investigations by human rights groups that reported grave abuses of Palestinians in Israeli detention.\u003c/p\u003e\u003cp\u003eAn investigation published by the United Nations human rights office in August described substantiated reports of widespread \u0026#34;torture, sexual assault and rape, amid atrocious inhumane conditions\u0026#34; in prisons since the war began. The U.N. office has also said Hamas\u0026#39; Oct. 7 attacks could amount to war crimes and crimes against humanity.\u003c/p\u003e\u003cp\u003eThe White House has called the reports of torture, rape and abuse in Israel\u0026#39;s prisons \u0026#34;deeply concerning.\u0026#34;\u003c/p\u003e\u003cp\u003eIn response to Reuters questions, the Israeli military said it was investigating several cases of alleged abuse of Gazan detainees by military personnel but \u0026#34;categorically\u0026#34; rejected allegations of systematic abuse within its detention facilities.\u003c/p\u003e\u003cp\u003eThe military declined to comment on individual cases. The Israel Prison Service (IPS), which falls under hard-right national security minister Itamar Ben-Gvir, and the country\u0026#39;s internal security service said they were not in a position to comment on individual cases.\u003c/p\u003e\u003cp\u003e\u0026#34;Terrorists in Israeli prisons are granted supervised living conditions and accommodations appropriate for criminals,\u0026#34; Ben Gvir\u0026#39;s office said in response to Reuters questions, adding that the facilities operate in accordance with the law. \u0026#34;The \u0026#39;summer camp\u0026#39; is over,\u0026#34; Ben Gvir\u0026#39;s office said.\u003c/p\u003e\u003cp\u003eTal Steiner, executive director of the Israeli rights group Public Committee Against Torture in Israel (PCATI), said the symptoms the men recounted were common and can echo through victims\u0026#39; lifetimes, often shattering their families.\u003c/p\u003e\u003cp\u003e\u0026#34;Torture in Israeli prisons has exploded since October 7. It will have and already has had a devastating effect on Palestinian society,\u0026#34; said Steiner.\u003c/p\u003e\u003cp\u003eSpeaking from his hospital bed in July, a severely emaciated Obaiyat called the treatment of himself and fellow prisoners \u0026#34;disgusting,\u0026#34; showing scars on his wasted legs and describing isolation, hunger, handcuffs and abuse with metal rods, without giving details.\u003c/p\u003e\u003cp\u003ePhotos of Obaiyat taken before his incarceration show a powerfully-built man.\u003c/p\u003e\u003cp\u003eOn Dec. 19, Israel\u0026#39;s High Court ordered the state to answer a petition brought by rights groups about the lack of adequate food for Palestinian prisoners.\u003c/p\u003e\u003cp\u003eIsrael has also reported mistreatment of some of the 251 of its citizens taken captive to Gaza after the Hamas attacks. A report by the Israeli Health Ministry, published on Saturday said hostages were subjected to torture, including sexual and psychological abuse. Hamas has repeatedly denied abuse of the hostages.\u003c/p\u003e\u003cp\u003eWITHOUT CHARGE\u003c/p\u003e\u003cp\u003eObaiyat is currently being held in a small detention centre in Etzion, south of Bethlehem, according to the Palestinian Prisoners\u0026#39; Club, an advocacy group.\u003c/p\u003e\u003cp\u003eHe is being held for six months under \u0026#34;administrative detention\u0026#34;, a form of incarceration without charge or trial, and the official reason for his arrest is unknown, the group said. Israel\u0026#39;s military, internal security service and prison service did not respond to questions about his specific case.\u003c/p\u003e\u003cp\u003ePCATI said at least 56 Palestinians had died in custody during the war, compared to just one or two annually in the years preceding the conflict. Israel\u0026#39;s military said it launches criminal investigations of all deaths of Palestinians in its custody.\u003c/p\u003e\u003cp\u003ePalestinian prisoner numbers have at least doubled in Israel and the West Bank to more than 10,000 during the war, PCATI estimates, based on court documents and data obtained through freedom of information requests.\u003c/p\u003e\u003cp\u003eThrough the course of the war, around 6,000 Gazans have been incarcerated, the Israeli military said in response to a query from Reuters.\u003c/p\u003e\u003cp\u003eUnlike Palestinians from the West Bank who are held under military law, Palestinians from Gaza are held in Israel under its Unlawful Combatants Law.\u003c/p\u003e\u003cp\u003eThe law has been used to hold people incommunicado, deny them their rights as prisoners of war or as prisoners under military occupation, and incarcerate them for extended periods without charge or trial, according to Professor Neve Gordon, an Israeli scholar who specialises in human rights and international law at London\u0026#39;s Queen Mary University.\u003c/p\u003e\u003cp\u003eThe Palestinian Prisoners\u0026#39; Club likened the detentions to forced disappearance.\u003c/p\u003e\u003cp\u003eIsrael\u0026#39;s prison service declined to comment on prisoner numbers and deaths.\u003c/p\u003e\u003cp\u003eSDE TEIMAN CAMP\u003c/p\u003e\u003cp\u003eFadi Ayman Mohammad Radi, 21, a former engineering student from Khan Younis, Gaza, was one of a couple dozen Palestinians released at the Kerem Shalom crossing into Gaza on Aug. 20.\u003c/p\u003e\u003cp\u003eRadi described struggling to stretch out his limbs after being cuffed and chained for four months at Israel\u0026#39;s Sde Teiman military detention camp, officially a temporary prisoner sorting facility.\u003c/p\u003e\u003cp\u003e\u0026#34;They didn\u0026#39;t interrogate us, they destroyed us,\u0026#34; said Radi.\u003c/p\u003e\u003cp\u003eLocated in the Negev desert, Sde Teiman has been the site of grave abuses including rape, according to allegations by whistleblowers among the camp\u0026#39;s guards.\u003c/p\u003e\u003cp\u003eIsrael is currently investigating what the U.N called \u0026#34;a particularly gruesome case\u0026#34; of alleged sexual abuse at Sde Teiman in which five soldiers are accused of anally penetrating a detainee with a rod that punctured his internal organs.\u003c/p\u003e\u003cp\u003eRadi said he was beaten repeatedly and arbitrarily, permanently restrained and blindfolded, hung up in stress positions and forced to sit on the floor almost constantly without moving.\u003c/p\u003e\u003cp\u003eAt one point, he said he was deprived of sleep for five consecutive days in a space he said Israeli soldiers called the \u0026#39;disco room,\u0026#39; subjected to loud music. He did not describe sexual violence.\u003c/p\u003e\u003cp\u003eRadi said he found it difficult to sleep and that even talking about his ordeal made him relive it.\u003c/p\u003e\u003cp\u003e\u0026#34;Every time I say the words, I visualise the torture,\u0026#34; said Radi, who was arrested by Israeli soldiers in Gaza on March 4.\u003c/p\u003e\u003cp\u003eReuters could not independently verify his story. The Israeli military said it was unable to comment, saying it could not find Radi\u0026#39;s files because Reuters was unable to provide his ID number.\u003c/p\u003e\u003cp\u003eDespite a government decision to phase out Sde Teiman, the camp is still operational, PCATI said.\u003c/p\u003e\u003cp\u003eOFER AND KTZ\u0026#39;IOT\u003c/p\u003e\u003cp\u003eWidespread abuses have also been reported at more established facilities, such as the Ktz\u0026#39;iot prison, also in the Negev, and Ofer military camp, south of Ramallah in the West Bank.\u003c/p\u003e\u003cp\u003eAfter collating evidence and testimony from 55 former Palestinian prisoners, Israeli rights group B\u0026#39;Tselem earlier this year released a report accusing Israel of deliberately turning the prison system into a \u0026#39;network of torture camps\u0026#39;.\u003c/p\u003e\u003cp\u003eUsing emergency legislation introduced after the Oct. 7 attack on Israel by Hamas, Ben Gvir, the hardline minister, ordered conditions be downgraded for \u0026#39;security prisoners\u0026#39;, a category almost entirely comprising Palestinians.\u003c/p\u003e\u003cp\u003eHuman rights scholar Gordon likened what he said was the use of torture in Israel\u0026#39;s prisons to terrorism.\u003c/p\u003e\u003cp\u003e\u0026#34;Terrorism usually is an act that\u0026#39;s limited in the number of people directly impacted, but the psychosocial effect is dramatic. It\u0026#39;s the same with torture,\u0026#34; said Gordon, who co-edited a book on abuses in the Israeli prison system.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-12-31T20:39:12+05:30",
  "modifiedTime": null
}
