{
  "id": "8e0d1510-755e-48bc-9ecf-da1d5b852b43",
  "title": "Putin Says Europeans, Others Can \"Participate\" In Ukraine Talks",
  "link": "https://www.ndtv.com/world-news/putin-says-europeans-others-can-participate-in-ukraine-talks-7787557",
  "description": "Russian President Vladimir Putin said Monday that European countries, as well as others, can participate in talks to resolve the conflict in Ukraine.",
  "author": "",
  "published": "Tue, 25 Feb 2025 04:08:11 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 2838,
  "excerpt": "Russian President Vladimir Putin said Monday that European countries, as well as others, can participate in talks to resolve the conflict in Ukraine.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Moscow: Russian President Vladimir Putin said Monday that European countries, as well as others, can participate in talks to resolve the conflict in Ukraine.In an interview airing on state television, Putin expressed agreement with US President Donald Trump on numerous points but said European countries could also play a role in ending the fighting in Ukraine.\"I see nothing wrong with this\", Putin said, asked what he thought of European countries insisting on a role in talks on Ukraine.\"Well probably no one can demand anything here. Especially not from Russia,\" he added.\"But their participation in the talks process is in demand,\" he added, claiming that European countries \"themselves rejected contacts with us\", wanting Ukraine to win on the battlefield.\"If they want to come back, they're welcome,\" he said.And \"in this case, of course, we are not rejecting the participation of our European countries\".Putin said, however, that Russia also respects the views of \"our friends from BRICS\", the bloc comprising Brazil, Russia, India, China, South Africa and other emerging economies.\"We are grateful to all our partners who raise these questions, who aim for peace to be achieved. And that's why I'm saying that not only Europeans but other countries have the right and can take part. And we view this calmly.\"He criticised European countries' reaction to a meeting last week between Russian and US officials in Riyadh as \"emotional\", saying it was part of a process of improving \"the level of trust\" between the two countries.Both in his recent phone conversation with Trump and at the meeting in Riyadh, \"problems related to the Ukrainian crisis were touched on,\" Putin said.\"But it was not discussed in essence. We just agreed that we will approach this.\"Putin described Trump's proposals on Ukraine as based on \"cold reasoning\" and said that as a newly elected president he has his \"hands free\".Putin also mocked Ukrainian counterpart Volodymyr Zelensky after Trump claimed he is highly unpopular and a \"dictator\".Asked about Europe's critical reaction to Trump's comments, Putin said the \"current head of the Kyiv regime is becoming a toxic figure\" among the armed forces for giving \"ridiculous orders\", and \"is becoming toxic in society as a whole\".Putin said that Ukrainian former military commander-in-chief Valery Zaluzhny, who is now Kyiv's ambassador in London, has a much higher approval rating than Zelensky, calling him a \"possible rival\".He also backed a suggestion by Trump that Russia, the United States and China should all cut their military budgets in half.\"I think it's a good idea. The US would cut by 50 percent and we would cut by 50 percent and then China would join if it wanted,\" Putin said.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-12/nep7lkfo_vladimir-putin-reuters_625x300_27_December_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eMoscow: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eRussian President Vladimir Putin said Monday that European countries, as well as others, can participate in talks to resolve the conflict in Ukraine.\u003c/p\u003e\u003cp\u003eIn an interview airing on state television, Putin expressed agreement with US President Donald Trump on numerous points but said European countries could also play a role in ending the fighting in Ukraine.\u003c/p\u003e\u003cp\u003e\u0026#34;I see nothing wrong with this\u0026#34;, Putin said, asked what he thought of European countries insisting on a role in talks on Ukraine.\u003c/p\u003e\u003cp\u003e\u0026#34;Well probably no one can demand anything here. Especially not from Russia,\u0026#34; he added.\u003c/p\u003e\u003cp\u003e\u0026#34;But their participation in the talks process is in demand,\u0026#34; he added, claiming that European countries \u0026#34;themselves rejected contacts with us\u0026#34;, wanting Ukraine to win on the battlefield.\u003c/p\u003e\u003cp\u003e\u0026#34;If they want to come back, they\u0026#39;re welcome,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eAnd \u0026#34;in this case, of course, we are not rejecting the participation of our European countries\u0026#34;.\u003c/p\u003e\u003cp\u003ePutin said, however, that Russia also respects the views of \u0026#34;our friends from BRICS\u0026#34;, the bloc comprising Brazil, Russia, India, China, South Africa and other emerging economies.\u003c/p\u003e\u003cp\u003e\u0026#34;We are grateful to all our partners who raise these questions, who aim for peace to be achieved. And that\u0026#39;s why I\u0026#39;m saying that not only Europeans but other countries have the right and can take part. And we view this calmly.\u0026#34;\u003c/p\u003e\u003cp\u003eHe criticised European countries\u0026#39; reaction to a meeting last week between Russian and US officials in Riyadh as \u0026#34;emotional\u0026#34;, saying it was part of a process of improving \u0026#34;the level of trust\u0026#34; between the two countries.\u003c/p\u003e\u003cp\u003eBoth in his recent phone conversation with Trump and at the meeting in Riyadh, \u0026#34;problems related to the Ukrainian crisis were touched on,\u0026#34; Putin said.\u003c/p\u003e\u003cp\u003e\u0026#34;But it was not discussed in essence. We just agreed that we will approach this.\u0026#34;\u003c/p\u003e\u003cp\u003ePutin described Trump\u0026#39;s proposals on Ukraine as based on \u0026#34;cold reasoning\u0026#34; and said that as a newly elected president he has his \u0026#34;hands free\u0026#34;.\u003c/p\u003e\u003cp\u003ePutin also mocked Ukrainian counterpart Volodymyr Zelensky after Trump claimed he is highly unpopular and a \u0026#34;dictator\u0026#34;.\u003c/p\u003e\u003cp\u003eAsked about Europe\u0026#39;s critical reaction to Trump\u0026#39;s comments, Putin said the \u0026#34;current head of the Kyiv regime is becoming a toxic figure\u0026#34; among the armed forces for giving \u0026#34;ridiculous orders\u0026#34;, and \u0026#34;is becoming toxic in society as a whole\u0026#34;.\u003c/p\u003e\u003cp\u003ePutin said that Ukrainian former military commander-in-chief Valery Zaluzhny, who is now Kyiv\u0026#39;s ambassador in London, has a much higher approval rating than Zelensky, calling him a \u0026#34;possible rival\u0026#34;.\u003c/p\u003e\u003cp\u003eHe also backed a suggestion by Trump that Russia, the United States and China should all cut their military budgets in half.\u003c/p\u003e\u003cp\u003e\u0026#34;I think it\u0026#39;s a good idea. The US would cut by 50 percent and we would cut by 50 percent and then China would join if it wanted,\u0026#34; Putin said.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-25T04:08:11+05:30",
  "modifiedTime": null
}
