{
  "id": "8e1df165-8f69-40ab-9735-862fc0c00bad",
  "title": "Shingles vax can decrease dementia risk, finds study",
  "link": "https://timesofindia.indiatimes.com/world/us/shingles-vax-can-decrease-dementia-risk-finds-study/articleshow/119960888.cms",
  "description": "",
  "author": "",
  "published": "2025-04-04T06:15:02+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "NYT News Service",
  "length": 1747,
  "excerpt": "US News: Getting vaccinated against shingles can reduce the risk of developing dementia, a large new study finds.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Getting vaccinated against shingles can reduce the risk of developing dementia, a large new study finds. The results provide some of the strongest evidence yet that some viral infections can have effects on brain function years later and that preventing them can help stave off cognitive decline.The study, published in the journal Nature, found people who received the vaccine were 20% less likely to develop dementia in the seven years afterward than those who were not vaccinated. \"If you're reducing the risk of dementia by 20%, that's quite important in a public health context, given that we don't really have much else at the moment that slows down the onset of dementia,\" said Paul Harrison, a professor of psychiatry at the University of Oxford. Harrison was not involved in the study but has done other research indicating shingles vaccines lower dementia risk.Whether the protection can last beyond seven years can only be determined with further research. But with few currently effective treatments or preventions, Harrison said, shingles vaccines appear to have \"some of the strongest potential protective effects against dementia...\"Shingles cases stem from the virus that causes childhood chickenpox, varicella-zoster, which typically remains dormant in nerve cells for decades. As people age and their immune systems weaken, the virus can reactivate and cause shingles, with symptoms like burning, tingling, painful blisters and numbness. The nerve pain can become chronic and disabling. The study involved an older form of shingles vaccine, Zostavax, which contains a modified version of the live virus. The new vaccine, Shingrix, which contains an inactivated portion of the virus, is more effective and lasting, research shows.",
  "image": "https://static.toiimg.com/thumb/msid-119960898,width-1070,height-580,imgsize-740769,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-119960898,imgsize-740769,width-400,resizemode-4/Representative-image.jpg\" alt=\"Shingles vax can decrease dementia risk, finds study\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eGetting vaccinated against shingles can reduce the risk of developing dementia, a large new study finds. The results provide some of the strongest evidence yet that some viral infections can have effects on brain function years later and that preventing them can help stave off cognitive decline.\u003cbr/\u003eThe study, published in the journal Nature, found people who received the vaccine were 20% less likely to develop dementia in the seven years afterward than those who were not vaccinated. \u0026#34;If you\u0026#39;re reducing the risk of dementia by 20%, that\u0026#39;s quite important in a public health context, given that we don\u0026#39;t really have much else at the moment that slows down the onset of dementia,\u0026#34; said Paul Harrison, a professor of psychiatry at the University of Oxford. Harrison was not involved in the study but has done other research indicating shingles vaccines lower dementia risk.\u003cbr/\u003eWhether the protection can last beyond seven years can only be determined with further research. But with few currently effective treatments or preventions, Harrison said, shingles vaccines appear to have \u0026#34;some of the strongest potential protective effects against dementia...\u0026#34;\u003cbr/\u003eShingles cases stem from the virus that causes childhood chickenpox, varicella-zoster, which typically remains dormant in nerve cells for decades. As people age and their immune systems weaken, the virus can reactivate and cause shingles, with symptoms like burning, tingling, painful blisters and numbness. The nerve pain can become chronic and disabling. \u003c/p\u003e\u003cp\u003eThe study involved an older form of shingles vaccine, Zostavax, which contains a modified version of the live virus. The new vaccine, Shingrix, which contains an inactivated portion of the virus, is more effective and lasting, research shows.\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-04T06:15:00+05:30",
  "modifiedTime": null
}
