{
  "id": "92a3845d-294c-4458-b903-24dfad473c48",
  "title": "Kilmar in El Salvador: Court orders Trump to undo deportation disaster",
  "link": "https://timesofindia.indiatimes.com/world/us/kilmar-in-el-salvador-supreme-court-orders-trump-team-to-undo-deportation-disaster/articleshow/120182151.cms",
  "description": "The Supreme Court told the Donald Trump administration to help Kilmar Armando Abrego Garcia return. He was wrongly deported to El Salvador. The court did not order his direct return. A lower court will decide the next steps. Abrego Garcia had protection from deportation. He was deported despite the ruling. The case raises questions about immigration and executive power.",
  "author": "TOI World Desk",
  "published": "2025-04-11T06:00:58+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 5939,
  "excerpt": "US News: The Supreme Court told the Donald Trump administration to help Kilmar Armando Abrego Garcia return. He was wrongly deported to El Salvador. The court",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "The Supreme Court has instructed the administration of President Donald Trump to “facilitate” the return of Kilmar Armando Abrego Garcia, a Maryland resident mistakenly deported to El Salvador. However, it stopped short of requiring that he be brought back to the United States directly, leaving the next steps to be determined by a lower court. Abrego Garcia, who entered the United States around 2011, had previously been granted protection from deportation by an immigration judge in 2019. The judge ruled that he should not be removed to El Salvador due to threats against his life stemming from his family’s pupusa business. Despite that ruling, he was detained by immigration officers on March 12 and flown out of the country three days later. “Tonight, the rule of law prevailed. The Supreme Court upheld the District Judge’s order that the government has to bring Kilmar home,” said his attorney, Simon Sandoval-Moshenberg. “Now they need to stop wasting time and get moving.”The conditions inside the infamous El Salvador prison where deported migrants are heldThe unsigned opinion from the high court did not specify a deadline for facilitating Abrego Garcia’s return. It upheld US District Judge Paula Xinis’ order but distinguished between the terms “facilitate” and “effectuate.” While supporting the notion that the government should assist in bringing him back, the justices signaled concern that the original directive may have exceeded judicial authority. In a noteworthy remark, Justice Sonia Sotomayor pointed to existing executive policies that call for assisting with an alien’s return if their presence is necessary for continued immigration proceedings. She, along with the other liberal justices, also criticized the administration’s characterization of the wrongful deportation as a mere “oversight.” “The Government now requests an order from this Court permitting it to leave Abrego Garcia, a husband and father without a criminal record, in a Salvadoran prison for no reason recognized by the law,” the liberal justices stated. “The only argument the Government offers in support of its request, that United States courts cannot grant relief once a deportee crosses the border, is plainly wrong.” Though the court did not reject the administration’s emergency appeal outright, the three liberal justices expressed that it should have been dismissed in full. The Trump administration, in its legal filings, argued that being compelled to “effectuate” Abrego Garcia’s return would intrude upon executive authority, especially in foreign affairs. It emphasized that “facilitate” should be interpreted narrowly—merely removing any procedural or legal obstacles without mandating specific actions.Bondi reacts to Supreme Court pausing order on man mistakenly deported to El SalvadorSolicitor General D. John Sauer, recently confirmed to lead the administration’s appellate division, alleged that Abrego Garcia was a “ranking member” of MS-13. That claim has been used to argue that the protections granted by the 2019 court ruling no longer apply, since the administration designated MS-13 as a foreign terrorist group. However, Abrego Garcia’s legal team disputes those accusations, asserting that he has no criminal history in Maryland or anywhere else in the country. Judge Stephanie Thacker of the 4th Circuit Court noted, “The government has made no effort to demonstrate that Abrego Garcia is, in fact, a member of any gang.” She described him instead as “a gainfully employed family man who lives a law abiding and productive life.” The case now returns to the lower court, where Judge Xinis is expected to provide clarification on the scope of her directive. The Supreme Court’s opinion emphasized that the court must proceed with “due regard for the deference owed to the Executive Branch in the conduct of foreign affairs.” Legal analyst and Georgetown law professor Steve Vladeck weighed in on the ambiguity of the ruling: “Although the ruling makes clear that the district court can order the Trump administration to facilitate Abrego Garcia’s return to the United States, it is maddeningly vague about exactly how it’s supposed to do so.” “For instance, if the judge asks the government about the specific arrangements it’s made with the Salvadoran government and the government invokes the state secrets privilege, what happens then?” Vladeck added. “It is, yet again, punting in a context in which the government can take advantage of the punt – a loss for Trump on the big question, but a loss for Abrego García on what matters most.” Abrego Garcia’s deportation took place under a different authority than the controversial 1798 Alien Enemies Act, which has recently been invoked by the Trump administration and is facing multiple legal challenges. On Tuesday, the Supreme Court upheld the use of that statute but required that detainees be given notice and the opportunity for judicial review—though it left many procedural questions unanswered. Trump officials argued that negotiating with El Salvador on short notice was not feasible when the district court originally ordered Abrego Garcia’s return by a specific deadline. They also contended that decisions by the attorney general concerning deportation fall outside the jurisdiction of federal courts.Pres. Trump on man deported in error to El Salvador: 'We don't want him back'Despite these arguments, the 4th US Circuit Court of Appeals ruled unanimously in favor of Abrego Garcia. The court determined that the judiciary retained the authority to review whether his deportation violated prior legal protections and that he remained, effectively, in US custody—even while imprisoned in El Salvador. Abrego Garcia was deported on March 15 and placed in a notoriously harsh Salvadoran prison. His case continues to raise broader questions about immigration enforcement, executive power, and the extent of judicial oversight in foreign affairs.",
  "image": "https://static.toiimg.com/thumb/msid-120182225,width-1070,height-580,imgsize-159838,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cp\u003e\u003cspan data-pos=\"1\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe \u003c/span\u003e\u003ca href=\"https://timesofindia.indiatimes.com/topic/supreme-court-of-india\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eSupreme Court\u003c/a\u003e\u003cspan data-pos=\"3\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e has instructed the administration of President Donald Trump to “facilitate” the return of \u003c/span\u003e\u003cspan data-pos=\"4\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eKilmar Armando Abrego Garcia\u003c/span\u003e\u003cspan data-pos=\"5\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e, a Maryland resident mistakenly deported to \u003c/span\u003e\u003cspan data-pos=\"6\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eEl Salvador\u003c/span\u003e\u003cspan data-pos=\"7\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"9\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eHowever, it stopped short of requiring that he be brought back to the United States directly, leaving the next steps to be determined by a lower court.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"11\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Abrego Garcia, who entered the United States around 2011, had previously been granted protection from \u003c/span\u003e\u003cspan data-pos=\"12\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003edeportation\u003c/span\u003e\u003cspan data-pos=\"13\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e by an \u003c/span\u003e\u003cspan data-pos=\"14\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eimmigration judge\u003c/span\u003e\u003cspan data-pos=\"15\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e in 2019. The judge ruled that he should not be removed to El Salvador due to threats against his life stemming from his family’s pupusa business. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"17\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eDespite that ruling, he was detained by immigration officers on March 12 and flown out of the country three days later.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"19\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e “Tonight, the rule of law prevailed. The Supreme Court upheld the District Judge’s order that the government has to bring Kilmar home,” said his attorney, \u003c/span\u003e\u003cspan data-pos=\"20\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eSimon Sandoval-Moshenberg\u003c/span\u003e\u003cspan data-pos=\"21\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e. “Now they need to stop wasting time and get moving.”\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eThe conditions inside the infamous El Salvador prison where deported migrants are held\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan data-pos=\"25\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe unsigned opinion from the high court did not specify a deadline for facilitating Abrego Garcia’s return. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"27\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eIt upheld US District Judge Paula Xinis’ order but distinguished between the terms “facilitate” and “effectuate.” While supporting the notion that the government should assist in bringing him back, the justices signaled concern that the original directive may have exceeded judicial authority.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"29\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e In a noteworthy remark, Justice Sonia Sotomayor pointed to existing executive policies that call for assisting with an alien’s return if their presence is necessary for continued immigration proceedings. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"31\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eShe, along with the other liberal justices, also criticized the administration’s characterization of the wrongful deportation as a mere “oversight.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"34\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e “The Government now requests an order from this Court permitting it to leave Abrego Garcia, a husband and father without a criminal record, in a Salvadoran prison for no reason recognized by the law,” the liberal justices stated. “The only argument the Government offers in support of its request, that United States courts cannot grant relief once a deportee crosses the border, is plainly wrong.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"37\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Though the court did not reject the administration’s emergency appeal outright, the three liberal justices expressed that it should have been dismissed in full.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"39\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e The \u003c/span\u003e\u003cspan data-pos=\"40\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eTrump administration\u003c/span\u003e\u003cspan data-pos=\"41\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e, in its legal filings, argued that being compelled to “effectuate” Abrego Garcia’s return would intrude upon executive authority, especially in foreign affairs. It emphasized that “facilitate” should be interpreted narrowly—merely removing any procedural or legal obstacles without mandating specific actions.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eBondi reacts to Supreme Court pausing order on man mistakenly deported to El Salvador\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan data-pos=\"46\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eSolicitor General D. John Sauer, recently confirmed to lead the administration’s appellate division, alleged that Abrego Garcia was a “ranking member” of MS-13. That claim has been used to argue that the protections granted by the 2019 court ruling no longer apply, since the administration designated MS-13 as a foreign terrorist group.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"48\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e However, Abrego Garcia’s legal team disputes those accusations, asserting that he has no criminal history in Maryland or anywhere else in the country. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"50\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eJudge Stephanie Thacker of the 4th Circuit Court noted, “The government has made no effort to demonstrate that Abrego Garcia is, in fact, a member of any gang.” She described him instead as “a gainfully employed family man who lives a law abiding and productive life.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"52\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e The case now returns to the lower court, where Judge Xinis is expected to provide clarification on the scope of her directive. The Supreme Court’s opinion emphasized that the court must proceed with “due regard for the deference owed to the Executive Branch in the conduct of foreign affairs.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"55\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Legal analyst and Georgetown law professor Steve Vladeck weighed in on the ambiguity of the ruling: “Although the ruling makes clear that the district court can order the Trump administration to facilitate Abrego Garcia’s return to the United States, it is maddeningly vague about exactly how it’s supposed to do so.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"57\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e “For instance, if the judge asks the government about the specific arrangements it’s made with the Salvadoran government and the government invokes the state secrets privilege, what happens then?” Vladeck added. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"59\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e“It is, yet again, punting in a context in which the government can take advantage of the punt – a loss for Trump on the big question, but a loss for Abrego García on what matters most.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"61\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Abrego Garcia’s deportation took place under a different authority than the controversial 1798 Alien Enemies Act, which has recently been invoked by the Trump administration and is facing multiple legal challenges. On Tuesday, the Supreme Court upheld the use of that statute but required that detainees be given notice and the opportunity for judicial review—though it left many procedural questions unanswered.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"64\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Trump officials argued that negotiating with El Salvador on short notice was not feasible when the district court originally ordered Abrego Garcia’s return by a specific deadline. They also contended that decisions by the attorney general concerning deportation fall outside the jurisdiction of federal courts.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003ePres. Trump on man deported in error to El Salvador: \u0026#39;We don\u0026#39;t want him back\u0026#39;\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan data-pos=\"68\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eDespite these arguments, the 4th US Circuit Court of Appeals ruled unanimously in favor of Abrego Garcia. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"70\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eThe court determined that the judiciary retained the authority to review whether his deportation violated prior legal protections and that he remained, effectively, in US custody—even while imprisoned in El Salvador.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan data-pos=\"72\" data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e Abrego Garcia was deported on March 15 and placed in a notoriously harsh Salvadoran prison. His case continues to raise broader questions about immigration enforcement, executive power, and the extent of judicial oversight in foreign affairs.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-11T06:00:00+05:30",
  "modifiedTime": null
}
