{
  "id": "9a8659de-881a-4b12-8b8e-6b1fcc819eea",
  "title": "‘Rampant’ tow truck scam targeting Southern California drivers, officials say",
  "link": "https://www.yahoo.com/news/rampant-tow-truck-scam-targets-021253190.html",
  "description": "",
  "author": "",
  "published": "2025-02-19T02:12:53Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Josh DuBose",
  "length": 2497,
  "excerpt": "Officials at the California Department of Insurance are warning Southland residents of a “vehicle hostage” scam involving tow truck companies targeting...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "Officials at the California Department of Insurance are warning Southland residents of a “vehicle hostage” scam involving tow truck companies targeting motorists involved in traffic accidents. In a Tuesday news release, department officials said the scam, which bilks drivers out of large sums of money to get their vehicles back, has become rampant in Southern California. “One of the scams in this case involves a tow truck showing up immediately after a collision occurs and offering to help the driver by towing their vehicle to a body shop,” the release stated. “Then the body shop forces the driver to pay a large amount of money typically not covered by your insurance in order to get your vehicle back.”In a sweeping investigation by CDI’s Inland Empire Automobile Insurance Fraud Task Force, 16 people were charged in an alleged conspiracy to create fake insurance claims that illegally collected nearly $217,000.Officials said the same ring was charged in similar scheme where vehicles were taken under false pretenses and delivered to California Collision in San Bernardino. Red flags that drivers involved in a traffic accident should be aware of include:Tow trucks that arrive moments after an accident, even if you haven’t calledTow truck driver tells victim which body shop their car is going toTow truck driver informs victim that someone will call or asks for a signatureTow truck driver requests a ride share for the victimAnyone who believes they may be a target of this illegal scheme is encouraged to verify the tow truck company with their insurer or wait for California Highway Patrol to confirm that they dispatched the tow truck. Lastly, do not sign any documents until the tow truck company has been confirmed. Nicole Kidman, Keith Urban’s Los Angeles home reportedly broken into “This type of scam is preying on drivers at their most vulnerable moments—immediately after an accident—when they should be focused on their safety and next steps, not fighting to get their vehicle back,” Insurance Commissioner Ricardo Lara said. “Our department is committed to protecting Californians from fraud.”For more information on how to protect yourself or to report suspected fraud, contact the California Department of Insurance at 800-927-4357 or online at insurance.ca.gov.Copyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. For the latest news, weather, sports, and streaming video, head to KTLA.",
  "image": "https://media.zenfs.com/en/ktla_articles_362/15d1131fc3af658558cd3e03bf06f98f",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eOfficials at the California Department of Insurance are warning Southland residents of a “vehicle hostage” scam involving tow truck companies targeting motorists involved in traffic accidents. \u003c/p\u003e\u003cp\u003eIn a Tuesday \u003ca href=\"https://www.insurance.ca.gov/0400-news/0100-press-releases/2025/Department-of-Insurance-warns-drivers-ab.cfm\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:news release;elm:context_link;itc:0;sec:content-canvas\"\u003enews release\u003c/a\u003e, department officials said the scam, which bilks drivers out of large sums of money to get their vehicles back, has become rampant in Southern California. \u003c/p\u003e\u003cp\u003e“One of the scams in this case involves a tow truck showing up immediately after a collision occurs and offering to help the driver by towing their vehicle to a body shop,” the release stated. “Then the body shop forces the driver to pay a large amount of money typically not covered by your insurance in order to get your vehicle back.”\u003c/p\u003e\u003cp\u003eIn a sweeping investigation by CDI’s Inland Empire Automobile Insurance Fraud Task Force, 16 people were charged in an alleged conspiracy to create fake insurance claims that illegally collected nearly $217,000.\u003c/p\u003e\u003cp\u003eOfficials said the same \u003ca href=\"https://www.insurance.ca.gov/0400-news/0100-press-releases/2024/release016-2024.cfm\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:ring was charged in similar scheme;elm:context_link;itc:0;sec:content-canvas\"\u003ering was charged in similar scheme\u003c/a\u003e where vehicles were taken under false pretenses and delivered to California Collision in San Bernardino. \u003c/p\u003e\u003cp\u003eRed flags that drivers involved in a traffic accident should be aware of include:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eTow trucks that arrive moments after an accident, even if you haven’t called\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eTow truck driver tells victim which body shop their car is going to\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eTow truck driver informs victim that someone will call or asks for a signature\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eTow truck driver requests a ride share for the victim\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAnyone who believes they may be a target of this illegal scheme is encouraged to verify the tow truck company with their insurer or wait for California Highway Patrol to confirm that they dispatched the tow truck. Lastly, do not sign any documents until the tow truck company has been confirmed. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.yahoo.com/news/nicole-kidman-keith-urban-los-004512375.html\" data-ylk=\"slk:Nicole Kidman, Keith Urban’s Los Angeles home reportedly broken into;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e Nicole Kidman, Keith Urban’s Los Angeles home reportedly broken into \u003c/a\u003e\u003c/p\u003e\u003cp\u003e“This type of scam is preying on drivers at their most vulnerable moments—immediately after an accident—when they should be focused on their safety and next steps, not fighting to get their vehicle back,” Insurance Commissioner Ricardo Lara said. “Our department is committed to protecting Californians from fraud.”\u003c/p\u003e\u003cp\u003eFor more information on how to protect yourself or to \u003ca href=\"https://www.insurance.ca.gov/0300-fraud/0350-fraud-claims-and-forms/index.cfm\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:report suspected fraud;elm:context_link;itc:0;sec:content-canvas\"\u003ereport suspected fraud\u003c/a\u003e, contact the California Department of Insurance at 800-927-4357 or online at \u003ca href=\"https://www.insurance.ca.gov/01-consumers/101-help/index.cfm\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:insurance.ca.gov;elm:context_link;itc:0;sec:content-canvas\"\u003einsurance.ca.gov\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003ci\u003eCopyright 2025 Nexstar Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://ktla.com\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:For the latest news, weather, sports, and streaming video, head to KTLA.;elm:context_link;itc:0;sec:content-canvas\"\u003e For the latest news, weather, sports, and streaming video, head to KTLA. \u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-19T02:12:53Z",
  "modifiedTime": null
}
