{
  "id": "a01f18bb-c75e-4007-ba74-bc271e197b6e",
  "title": "China Won't \"Surpass\" US, Says Biden In Farewell Speech",
  "link": "https://www.ndtv.com/world-news/china-wont-surpass-us-says-joe-biden-in-farewell-speech-7467852",
  "description": "Joe Biden said Monday that America was stronger on the global stage than it had been for decades, in a swansong foreign policy speech one week before Donald Trump's White House comeback.",
  "author": "",
  "published": "Tue, 14 Jan 2025 05:10:34 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "",
  "length": 3806,
  "excerpt": "Joe Biden said Monday that America was stronger on the global stage than it had been for decades, in a swansong foreign policy speech one week before Donald Trump's White House comeback.",
  "siteName": "www.ndtv.com",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: Joe Biden said Monday that America was stronger on the global stage than it had been for decades, in a swansong foreign policy speech one week before Donald Trump's White House comeback.The outgoing US president took aim at Russia, China and Iran, and urged the West to maintain support for Ukraine in an address at the State Department setting out his international legacy.But Biden's unspoken target was Trump as he touted his rebuilding of international alliances over the last four years after his Republican rival's chaotic first term.\"The United States is winning the worldwide competition compared to four years ago,\" said Biden, after diplomats at the State Department gave him a standing ovation.\"America is stronger. Our alliances are stronger, our adversaries and competitors are weaker.\"The Democrat added that America's ties with its allies were the strongest \"in decades,\" and said partners in the NATO military alliance were now \"paying their fair share.\"Trump has repeatedly criticized NATO countries, at one point saying he would encourage Russia to do \"whatever the hell it wants\" to allies that did not pay their way.The incoming president has also previously expressed admiration for Russian President Vladimir Putin -- but Biden mocked Putin over the progress of Moscow's invasion of Ukraine.\"When Putin invaded, he thought he'd conquer Kyiv in a matter of days. The truth is, since that war began I'm the only one that stood in the center of Kyiv, not him,\" said Biden.Biden became the first sitting US president to visit a warzone not controlled by American forces when he made a top secret visit to Ukraine's capital in 2023.He said the United States and its allies \"can't walk away\" from Ukraine, to which Washington has sent billions of dollars in military aid since the war started in 2022.- China won't 'surpass' US -\"There is more to do,\" said Biden.Trump has vowed to get a Russia-Ukraine peace deal \"in 24 hours\" and there are fears in Kyiv he may force a ceasefire that sees Ukraine cede territory to Moscow.Biden meanwhile insisted that China would \"never surpass us\" and that the United States would remain the world's dominant superpower.\"According to the latest predictions, on China's current course they will never surpass us -- period,\" Biden said.He added that Washington managed its complex ties with Beijing and that the relationship \"never tipped over into conflict\" in his four years as president.Biden's speech was more restrained on Israel's war in Gaza, with his administration facing criticism from within his own party for its unstinting support of Israel.But he said a Gaza ceasefire and hostage-release deal was \"on the brink\" of \"finally coming to fruition.\"The Democrat also defended another major foreign policy fiasco -- the fall of Afghanistan's US-backed government to the Taliban and the bloody US withdrawal of 2021.\"Ending the war was the right thing to do. And I believe history will reflect that,\" Biden said.The 82-year-old president finally urged the Trump administration to continue Biden's green energy policies, saying climate deniers under Trump were \"dead wrong\" and \"come from a different century.\"Biden's foreign policy speech will be followed by a farewell address to the nation from the Oval Office in primetime on Wednesday.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Featured Video Of The Day Siddaramaiah-DKS Status Quo Continues!",
  "image": "https://c.ndtvimg.com/2025-01/5maspu24_joe-biden_625x300_14_January_25.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eJoe Biden said Monday that America was stronger on the global stage than it had been for decades, in a swansong foreign policy speech one week before Donald Trump\u0026#39;s White House comeback.\u003c/p\u003e\u003cp\u003eThe outgoing US president took aim at Russia, China and Iran, and urged the West to maintain support for Ukraine in an address at the State Department setting out his international legacy.\u003c/p\u003e\u003cp\u003eBut Biden\u0026#39;s unspoken target was Trump as he touted his rebuilding of international alliances over the last four years after his Republican rival\u0026#39;s chaotic first term.\u003c/p\u003e\u003cp\u003e\u0026#34;The United States is winning the worldwide competition compared to four years ago,\u0026#34; said Biden, after diplomats at the State Department gave him a standing ovation.\u003c/p\u003e\u003cp\u003e\u0026#34;America is stronger. Our alliances are stronger, our adversaries and competitors are weaker.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Democrat added that America\u0026#39;s ties with its allies were the strongest \u0026#34;in decades,\u0026#34; and said partners in the NATO military alliance were now \u0026#34;paying their fair share.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump has repeatedly criticized NATO countries, at one point saying he would encourage Russia to do \u0026#34;whatever the hell it wants\u0026#34; to allies that did not pay their way.\u003c/p\u003e\u003cp\u003eThe incoming president has also previously expressed admiration for Russian President Vladimir Putin -- but Biden mocked Putin over the progress of Moscow\u0026#39;s invasion of Ukraine.\u003c/p\u003e\u003cp\u003e\u0026#34;When Putin invaded, he thought he\u0026#39;d conquer Kyiv in a matter of days. The truth is, since that war began I\u0026#39;m the only one that stood in the center of Kyiv, not him,\u0026#34; said Biden.\u003c/p\u003e\u003cp\u003eBiden became the first sitting US president to visit a warzone not controlled by American forces when he made a top secret visit to Ukraine\u0026#39;s capital in 2023.\u003c/p\u003e\u003cp\u003eHe said the United States and its allies \u0026#34;can\u0026#39;t walk away\u0026#34; from Ukraine, to which Washington has sent billions of dollars in military aid since the war started in 2022.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e- China won\u0026#39;t \u0026#39;surpass\u0026#39; US -\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;There is more to do,\u0026#34; said Biden.\u003c/p\u003e\u003cp\u003eTrump has vowed to get a Russia-Ukraine peace deal \u0026#34;in 24 hours\u0026#34; and there are fears in Kyiv he may force a ceasefire that sees Ukraine cede territory to Moscow.\u003c/p\u003e\u003cp\u003eBiden meanwhile insisted that China would \u0026#34;never surpass us\u0026#34; and that the United States would remain the world\u0026#39;s dominant superpower.\u003c/p\u003e\u003cp\u003e\u0026#34;According to the latest predictions, on China\u0026#39;s current course they will never surpass us -- period,\u0026#34; Biden said.\u003c/p\u003e\u003cp\u003eHe added that Washington managed its complex ties with Beijing and that the relationship \u0026#34;never tipped over into conflict\u0026#34; in his four years as president.\u003c/p\u003e\u003cp\u003eBiden\u0026#39;s speech was more restrained on Israel\u0026#39;s war in Gaza, with his administration facing criticism from within his own party for its unstinting support of Israel.\u003c/p\u003e\u003cp\u003eBut he said a Gaza ceasefire and hostage-release deal was \u0026#34;on the brink\u0026#34; of \u0026#34;finally coming to fruition.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Democrat also defended another major foreign policy fiasco -- the fall of Afghanistan\u0026#39;s US-backed government to the Taliban and the bloody US withdrawal of 2021.\u003c/p\u003e\u003cp\u003e\u0026#34;Ending the war was the right thing to do. And I believe history will reflect that,\u0026#34; Biden said.\u003c/p\u003e\u003cp\u003eThe 82-year-old president finally urged the Trump administration to continue Biden\u0026#39;s green energy policies, saying climate deniers under Trump were \u0026#34;dead wrong\u0026#34; and \u0026#34;come from a different century.\u0026#34;\u003c/p\u003e\u003cp\u003eBiden\u0026#39;s foreign policy speech will be followed by a farewell address to the nation from the Oval Office in primetime on Wednesday.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                \u003cdiv\u003e\n                                                    \u003cp\u003eFeatured Video Of The Day\u003c/p\u003e\n                                                    \n                                                    \u003cp\u003eSiddaramaiah-DKS Status Quo Continues!\u003c/p\u003e\n\n                                                \u003c/div\u003e\n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
