{
  "id": "a2feb905-b929-417c-85a7-d9d4b1376b7a",
  "title": "South Korea avoids technical recession as GDP expands 0.6% in second quarter",
  "link": "https://www.cnbc.com/2025/07/24/south-korea-avoids-technical-recession-as-gdp-expands-0point6percent-in-second-quarter.html",
  "description": "This was higher than the 0.5% expected by economists polled by Reuters, and a reversal from the 0.2% contraction seen in the first quarter.",
  "author": "",
  "published": "Thu, 24 Jul 2025 01:15:55 GMT",
  "source": "https://www.cnbc.com/id/100727362/device/rss/rss.html",
  "categories": null,
  "byline": "Lim Hui Jie",
  "length": 3975,
  "excerpt": "This was higher than the 0.5% expected by economists polled by Reuters, and a reversal from the 0.2% contraction seen in the first quarter.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "View across the Hangang River in Seoul, South Korea.Universal History Archive | Universal Images Group | Getty ImagesSouth Korea avoided a technical recession as its economy expanded by 0.6% from the previous quarter, beating expectations, according to advance estimates.This was higher than the 0.5% expected by economists polled by Reuters, and a reversal from the 0.2% contraction seen in the first quarter.On a year-over-year basis, the country's GDP rose 0.5%, up from 0% in the first quarter and higher than a 0.4% expansion expected by the Reuters poll.Data from the Bank of Korea showed exports of both goods and services grew strongly in the second quarter, rising 4.2% quarter over quarter as shipments of semiconductors, petroleum products, and chemical products increased.\"Net exports were the principal driver of growth,\" Louise Loo, Head of Asia Economics at Oxford Economics, said in a note following the data release.Loo noted that export volumes rose at their fastest pace since the third quarter of 2020, as firms expedited shipments ahead of anticipated adjustments to U.S. trade policy, in particular, tariffs.Shivaan Tandon, markets economist at Capital Economics, said that South Korea's externally facing sectors, such as trade, are likely to struggle as global trade growth softens under the specter of tariffs. \"While demand for AI-related hardware could continue to support semiconductor exports, we think other parts of the export basket will come under pressure,\" he adds.South Korea is currently trying to close a trade deal with the U.S., failing that, the country's exports to the U.S. would be hit with a 25% tariff from August 1. On Thursday, South Korea's finance ministry reportedly said that talks with the U.S. were cancelled after U.S. Treasury Secretary Scott Bessent, who has been leading tariff negotiations for the Trump administration, had a scheduling conflict, according Reuters. The report added that Bessent would hold a meeting with South Korean Finance Minister Koo Yun-cheol \"as soon as possible.\"Exports of goods and services make up about 44% of South Korea's GDP in 2023, according to the latest figures from the World Bank, with the U.S. as its second-largest export market.South Korean media outlet Yonhap reported that Seoul has ruled out changes to beef and rice imports as bargaining chips in tariff negotiations with the United States.Domestic headwindsOn the domestic front, South Korea's total consumption, which includes private and government expenditure, increased 0.7% from the previous quarter, a stronger showing compared to the 0.1% contraction seen in the first three months of the year.Government expenditure, which rose 1.2% quarter over quarter, was mostly powered by an increase in healthcare benefits, while private expenditure, which increased by 0.5% in the same period, was driven by increased spending on motor vehicles, as well as recreation and sporting activities.Oxford Economics' Loo said while domestic demand has seen a turnaround, due to early effects of the country' supplementary budget, private consumption growth was outweighed by a slowdown in the construction and equipment investment sectors.Capital Economics' Tandon also agreed, adding that the \"pace of growth is unlikely to last.\" While government spending should support growth in the near term, thanks to the passage of two supplementary budgets this year, the boost from government spending is likely to be offset by drags from elsewhere, Tandon added.Given this, Oxford Economics expects South Korea's full-year GDP to expand just 0.8% year over year in 2025, marking the slowest annual pace since 2020, which may nudge the BOK to cut rates.The BOK held rates in its previous monetary policy meeting on July 10, despite noting a stable inflation rate and forecasting low growth for the country, choosing to focus on financial stability.Inflation in South Korea stood at 2.2% in June, just slightly above the BOK's 2% target.",
  "image": "https://image.cnbcfm.com/api/v1/image/108176101-1753311520617-gettyimages-1449275566-917_14_wha_164_0971.jpeg?v=1753311541\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108176101\" data-test=\"InlineImage\"\u003e\u003cp\u003eView across the Hangang River in Seoul, South Korea.\u003c/p\u003e\u003cp\u003eUniversal History Archive | Universal Images Group | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eSouth Korea avoided a technical recession as its economy expanded by 0.6% from the previous quarter, beating expectations, according to advance estimates.\u003c/p\u003e\u003cp\u003eThis was higher than the 0.5% expected by economists polled by Reuters, and a reversal from the 0.2% contraction seen in the first quarter.\u003c/p\u003e\u003c/div\u003e\u003cp\u003eOn a year-over-year basis, the country\u0026#39;s GDP rose 0.5%, up from 0% in the first quarter and higher than a 0.4% expansion expected by the Reuters poll.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.bok.or.kr/eng/bbs/E0000634/view.do?nttId=10092639\u0026amp;amp;searchCnd=1\u0026amp;amp;searchKwd=\u0026amp;amp;depth2=400417\u0026amp;amp;depth3=400423\u0026amp;amp;depth=400423\u0026amp;amp;pageUnit=10\u0026amp;amp;pageIndex=1\u0026amp;amp;programType=newsDataEng\u0026amp;amp;menuNo=400423\u0026amp;amp;oldMenuNo=400423\" target=\"_blank\"\u003eData from the Bank of Korea\u003c/a\u003e showed exports of both goods and services grew strongly in the second quarter, rising 4.2% quarter over quarter as shipments of semiconductors, petroleum products, and chemical products increased.\u003c/p\u003e\u003cp\u003e\u0026#34;Net exports were the principal driver of growth,\u0026#34; Louise Loo, Head of Asia Economics at Oxford Economics, said in a note following the data release.\u003c/p\u003e\u003cp\u003eLoo noted that export volumes rose at their fastest pace since the third quarter of 2020, as firms expedited shipments ahead of anticipated adjustments to U.S. trade policy, in particular, tariffs.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eShivaan Tandon, markets economist at Capital Economics, said that South Korea\u0026#39;s externally facing sectors, such as trade, are likely to struggle as global trade growth softens under the specter of tariffs. \u003c/p\u003e\u003cp\u003e\u0026#34;While demand for AI-related hardware could continue to support semiconductor exports, we think other parts of the export basket will come under pressure,\u0026#34; he adds.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSouth Korea is currently trying to close a trade deal with the U.S., failing that, the country\u0026#39;s exports to the U.S. would be hit with a 25% tariff from August 1. \u003c/p\u003e\u003cp\u003eOn Thursday, South Korea\u0026#39;s finance ministry reportedly said that talks with the U.S. were cancelled after U.S. Treasury Secretary Scott Bessent, who has been leading tariff negotiations for the Trump administration, had a scheduling conflict, according Reuters. The report added that Bessent would hold a meeting with South Korean Finance Minister Koo Yun-cheol \u0026#34;as soon as possible.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp\u003eExports of goods and services make up about 44% of South Korea\u0026#39;s GDP in 2023, according to the \u003ca href=\"https://data.worldbank.org/indicator/NE.EXP.GNFS.ZS?locations=KR\" target=\"_blank\"\u003elatest figures from the World Bank\u003c/a\u003e, with the U.S. as its second-largest export market.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://en.yna.co.kr/view/AEN20250723004900320?section=economy-finance/economy\" target=\"_blank\"\u003eSouth Korean media outlet Yonhap\u003c/a\u003e reported that Seoul has ruled out changes to beef and rice imports as bargaining chips in tariff negotiations with the United States.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eDomestic headwinds\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eOn the domestic front, South Korea\u0026#39;s total consumption, which includes private and government expenditure, increased 0.7% from the previous quarter, a stronger showing compared to the 0.1% contraction seen in the first three months of the year.\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cbr/\u003eGovernment expenditure, which rose 1.2% quarter over quarter, was mostly powered by an increase in healthcare benefits, while private expenditure, which increased by 0.5% in the same period, was driven by increased spending on motor vehicles, as well as recreation and sporting activities.\u003c/p\u003e\u003cp\u003eOxford Economics\u0026#39; Loo said while domestic demand has seen a turnaround, due to early effects of the country\u0026#39; supplementary budget, private consumption growth was outweighed by a slowdown in the construction and equipment investment sectors.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eCapital Economics\u0026#39; Tandon also agreed, adding that the \u0026#34;pace of growth is unlikely to last.\u0026#34; \u003c/p\u003e\u003cp\u003eWhile government spending should support growth in the near term, thanks to the passage of two \u003ca href=\"https://urldefense.com/v3/__https:/click.m.capitaleconomics.com/?qs=a5f4c25622e98ff65101eba02b7cc145f7b9ad710a7c0f2b71010268d6ddb23c91c2a3afed1205cf0b84e3cd542ddae1d6b406f60db39405__;!!PIZeeW5wscynRQ!tI7heo7MOg25t9eiGBBs2f42Rx8HX9VulfZIQBICP1qV8NNbvO9FAJw6avXMn3Cad3VHHYSJZ06HxZM7dQf8X8iFjWhcKhgO$\" target=\"_blank\"\u003esupplementary budgets\u003c/a\u003e this year, the boost from government spending is likely to be offset by drags from elsewhere, Tandon added.\u003cstrong\u003e\u003cbr/\u003e\u003c/strong\u003e\u003cbr/\u003eGiven this, Oxford Economics expects South Korea\u0026#39;s full-year GDP to expand just 0.8% year over year in 2025, marking the slowest annual pace since 2020, which may nudge the BOK to cut rates.\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe BOK \u003ca href=\"https://www.cnbc.com/2025/07/10/bank-of-korea-expectedly-keeps-rates-steady-at-an-almost-three-year-low.html\"\u003eheld rates\u003c/a\u003e in its previous monetary policy meeting on July 10, despite noting a stable inflation rate and forecasting low growth for the country, choosing to focus on financial stability.\u003c/p\u003e\u003cp\u003eInflation in South Korea stood at 2.2% in June, just slightly above the BOK\u0026#39;s 2% target.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-23T23:03:42Z",
  "modifiedTime": "2025-07-24T01:15:55Z"
}
