{
  "id": "a434ec75-4961-40dd-90db-3162e228a571",
  "title": "US tech stocks steady after DeepSeek AI app shock",
  "link": "https://www.bbc.com/news/articles/c4gpq01rvd4o",
  "description": "DeepSeek's claim that its model was made at a fraction of the cost of its rivals has rocked the AI industry.",
  "author": "",
  "published": "Tue, 28 Jan 2025 18:04:13 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Peter Hoskins \u0026 Charlotte Edwards",
  "length": 5885,
  "excerpt": "DeepSeek's claim that its model was made at a fraction of the cost of its rivals has rocked the AI industry.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "US tech stocks steady after DeepSeek AI app shockPeter Hoskins \u0026 Charlotte EdwardsBusiness reporters, BBC NewsGetty ImagesUS tech stocks were steady on Tuesday after they slumped on Monday following the sudden rise of Chinese-made artificial intelligence (AI) app DeepSeek.Shares in chip giant Nvidia were up over 6% by mid-day trade having sank on Monday, as experts said the US AI sell-off may have been an over-reaction. The market hit came as investors rapidly adjusted bets on AI, after DeepSeek's claim that its model was made at a fraction of the cost of those of its rivals.Analysts said the development raised questions about the future of America's AI dominance and the scale of investments US firms are planning.US President Donald Trump described the moment as \"a wake-up call\" for the US tech industry, while also suggesting that it could ultimately prove \" a positive\" for the US.\"If you could do it cheaper, if you could do it [for] less [and] get to the same end result. I think that's a good thing for us,\" he told reporters on board Air Force One.He also said he was not concerned about the breakthrough, adding the US will remain a dominant player in the field.Optimism about AI investments has powered much of the boom in US stock markets over the last two years, raising fears of a possible bubble.DeepSeek has become the most downloaded free app in the US just a week after it was launched.Its emergence comes as the US has been warning of a tech race with China, and taking steps to restrict the sale of the advanced chip technology that powers AI to China.To continue their work without steady supplies of imported advanced chips, Chinese AI developers have shared their work with each other and experimented with new approaches to the technology.This has resulted in AI models that require far less computing power than before.It also means that they cost a lot less than previously thought possible, which has the potential to upend the industry.Nvidia - the company behind the high-tech chips that dominate many AI investments, that had seen its share price surge in the last two years due to growing demand - was the hardest hit on Monday.Its share price dropped by roughly 17% on Monday, wiping roughly $600bn off its market value. Janet Mui, head of market analysis at RBC Brewin Dolphin, said investors' first response to something that appears groundbreaking is to sell because of the uncertainty. But she said she expected many companies, like Apple, to benefit if the cost of AI models becomes becomes cheaper. It could also be a boon for other tech giants, which have faced scrutiny for their high spending on AI so far. Trump: DeepSeek AI release should be 'wake-up call' for USFollowing the shock to markets in the US on Monday, the main indexes were steady.As of mid-day trading in New York, the Dow Jones was roughly flat, the S\u0026P was up about 0.8% and the tech-heavy Nasdaq had risen 1.7%.The FTSE 100 stock index of the UK's biggest publicly-listed companies was also steady on Tuesday, closing 0.35% higher.Earlier shares in Japanese AI-related firms including Advantest, Softbank and Tokyo Electron fell sharply, helping to push the benchmark Nikkei 225 down by 1.4%.Several other markets in Asia were closed for the Lunar New Year holiday. Mainland China's financial markets will be shut from Tuesday and will reopen on 5 February.Who founded DeepSeek?The company was founded in 2023 by Liang Wenfeng in Hangzhou, a city in southeastern China. The 40-year-old, an information and electronic engineering graduate, also founded the hedge fund that backed DeepSeek. He was recently seen at a meeting between industry experts and the Chinese premier Li Qiang. In a July 2024 interview with The China Academy, Mr Liang said he was surprised by the reaction to the previous version of his AI model. \"We didn't expect pricing to be such a sensitive issue,\" he said. \"We were simply following our own pace, calculating costs, and setting prices accordingly.\"After DeepSeek-R1 was launched earlier this month, the company boasted of \"performance on par with\" one of OpenAI's latest models when used for tasks such as maths, coding and natural language reasoning.DeepSeek's technology has been praised by high profile figures including OpenAI chief Sam Altman who called it \"an impressive model, particularly around what they're able to deliver for the price\", though he added that OpenAI would \"obviously deliver much better models\" moving forward. \"DeepSeek's ability to rival US models despite limited access to advanced hardware demonstrates that software ingenuity and data efficiency can compensate for hardware constraints,\" said Marina Zhang, an associate professor at the University of Technology Sydney, who focuses on China's high-tech industries.Ion Stoica, co-founder and executive chair of AI software company Databricks, told the BBC the lower cost of DeepSeek could spur more companies to adopt AI in their business.\"If that happens, this reduction in cost can accelerate the progress of AI,\" he said. \"So overall, the market will expand faster, and the value of the market will grow faster.\"The Chinese company claims its model can be trained on 2,000 specialised chips compared to an estimated 16,000 for leading models.But not everyone is convinced. Some have cast doubt on some of DeepSeek's claims, including tech mogul Elon Musk. He responded to a post which claimed that DeepSeek actually has around 50,000 Nvidia chips that have now been banned from export to China, saying: \"Obviously.\"The sudden explosion in popularity has prompted some to raise cyber security concerns.In Australia, science minister Ed Husic was among the experts urging caution, telling Australia's national broadcaster ABC: \"There are a lot of questions that will need to be answered in time on quality, consumer preferences, data and privacy management.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"headline-block\"\u003e\u003ch2\u003eUS tech stocks steady after DeepSeek AI app shock\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003ePeter Hoskins \u0026amp; Charlotte Edwards\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBusiness reporters, BBC News\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/d54c/live/27f31550-dda1-11ef-926a-cbf3c346618d.jpg.webp\" alt=\"Getty Images A trade on the New York Stock Exchange anxiously looks at screen with share prices\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUS tech stocks were steady on Tuesday after they slumped on Monday following the sudden rise of Chinese-made artificial intelligence (AI) app DeepSeek.\u003c/p\u003e\u003cp\u003eShares in chip giant Nvidia were up over 6% by mid-day trade having sank on Monday, as experts said the US AI sell-off may have been an over-reaction. \u003c/p\u003e\u003cp\u003eThe market hit came as investors rapidly adjusted bets on AI, after DeepSeek\u0026#39;s claim that its model was made at a fraction of the cost of those of its rivals.\u003c/p\u003e\u003cp\u003eAnalysts said the development raised questions about the future of America\u0026#39;s AI dominance and the scale of investments US firms are planning.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eUS President Donald Trump described the moment as \u0026#34;a wake-up call\u0026#34; for the US tech industry, while also suggesting that it could ultimately prove \u0026#34; a positive\u0026#34; for the US.\u003c/p\u003e\u003cp\u003e\u0026#34;If you could do it cheaper, if you could do it [for] less [and] get to the same end result. I think that\u0026#39;s a good thing for us,\u0026#34; he told reporters on board Air Force One.\u003c/p\u003e\u003cp\u003eHe also said he was not concerned about the breakthrough, adding the US will remain a dominant player in the field.\u003c/p\u003e\u003cp\u003eOptimism about AI investments has powered much of the boom in US stock markets over the last two years, raising fears of a possible bubble.\u003c/p\u003e\u003cp\u003eDeepSeek has become the most downloaded free app in the US just a week after it was launched.\u003c/p\u003e\u003cp\u003eIts emergence comes as the US has been warning of a tech race with China, and taking steps to restrict the sale of the advanced chip technology that powers AI to China.\u003c/p\u003e\u003cp\u003eTo continue their work without steady supplies of imported advanced chips, Chinese AI developers have shared their work with each other and experimented with new approaches to the technology.\u003c/p\u003e\u003cp\u003eThis has resulted in AI models that require far less computing power than before.\u003c/p\u003e\u003cp\u003eIt also means that they cost a lot less than previously thought possible, which has the potential to upend the industry.\u003c/p\u003e\u003cp\u003eNvidia - the company behind the high-tech chips that dominate many AI investments, that had seen its share price surge in the last two years due to growing demand - was the hardest hit on Monday.\u003c/p\u003e\u003cp\u003eIts share price dropped by roughly 17% on Monday, wiping roughly $600bn off its market value. \u003c/p\u003e\u003cp\u003eJanet Mui, head of market analysis at RBC Brewin Dolphin, said investors\u0026#39; first response to something that appears groundbreaking is to sell because of the uncertainty. \u003c/p\u003e\u003cp\u003eBut she said she expected many companies, like Apple, to benefit if the cost of AI models becomes becomes cheaper. \u003c/p\u003e\u003cp\u003eIt could also be a boon for other tech giants, which have faced scrutiny for their high spending on AI so far. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eTrump: DeepSeek AI release should be \u0026#39;wake-up call\u0026#39; for US\u003c/figcaption\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFollowing the shock to markets in the US on Monday, the main indexes were steady.\u003c/p\u003e\u003cp\u003eAs of mid-day trading in New York, the Dow Jones was roughly flat, the S\u0026amp;P was up about 0.8% and the tech-heavy Nasdaq had risen 1.7%.\u003c/p\u003e\u003cp\u003eThe FTSE 100 stock index of the UK\u0026#39;s biggest publicly-listed companies was also steady on Tuesday, closing 0.35% higher.\u003c/p\u003e\u003cp\u003eEarlier shares in Japanese AI-related firms including Advantest, Softbank and Tokyo Electron fell sharply, helping to push the benchmark Nikkei 225 down by 1.4%.\u003c/p\u003e\u003cp\u003eSeveral other markets in Asia were closed for the Lunar New Year holiday. Mainland China\u0026#39;s financial markets will be shut from Tuesday and will reopen on 5 February.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2\u003eWho founded DeepSeek?\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe company was founded in 2023 by Liang Wenfeng in Hangzhou, a city in southeastern China. \u003c/p\u003e\u003cp\u003eThe 40-year-old, an information and electronic engineering graduate, also founded the hedge fund that backed DeepSeek. \u003c/p\u003e\u003cp\u003eHe was recently seen at a meeting between industry experts and the Chinese premier Li Qiang. \u003c/p\u003e\u003cp\u003eIn a July 2024 interview with \u003ca target=\"_blank\" href=\"https://thechinaacademy.org/interview-with-deepseek-founder-were-done-following-its-time-to-lead/#\"\u003eThe China Academy\u003c/a\u003e, Mr Liang said he was surprised by the reaction to the previous version of his AI model. \u003c/p\u003e\u003cp\u003e\u0026#34;We didn\u0026#39;t expect pricing to be such a sensitive issue,\u0026#34; he said. \u003c/p\u003e\u003cp\u003e\u0026#34;We were simply following our own pace, calculating costs, and setting prices accordingly.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAfter DeepSeek-R1 was launched earlier this month, the company boasted of \u0026#34;performance on par with\u0026#34; one of OpenAI\u0026#39;s latest models when used for tasks such as maths, coding and natural language reasoning.\u003c/p\u003e\u003cp\u003eDeepSeek\u0026#39;s technology has been praised by high profile figures including OpenAI chief Sam Altman who called it \u0026#34;an impressive model, particularly around what they\u0026#39;re able to deliver for the price\u0026#34;, though he added that OpenAI would \u0026#34;obviously deliver much better models\u0026#34; moving forward. \u003c/p\u003e\u003cp\u003e\u0026#34;DeepSeek\u0026#39;s ability to rival US models despite limited access to advanced hardware demonstrates that software ingenuity and data efficiency can compensate for hardware constraints,\u0026#34; said Marina Zhang, an associate professor at the University of Technology Sydney, who focuses on China\u0026#39;s high-tech industries.\u003c/p\u003e\u003cp\u003eIon Stoica, co-founder and executive chair of AI software company Databricks, told the BBC the lower cost of DeepSeek could spur more companies to adopt AI in their business.\u003c/p\u003e\u003cp\u003e\u0026#34;If that happens, this reduction in cost can accelerate the progress of AI,\u0026#34; he said. \u0026#34;So overall, the market will expand faster, and the value of the market will grow faster.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Chinese company claims its model can be trained on 2,000 specialised chips compared to an estimated 16,000 for leading models.\u003c/p\u003e\u003cp\u003eBut not everyone is convinced. Some have cast doubt on some of DeepSeek\u0026#39;s claims, including tech mogul Elon Musk. \u003c/p\u003e\u003cp\u003eHe responded to a post which claimed that DeepSeek actually has around 50,000 Nvidia chips that have now been banned from export to China, saying: \u0026#34;Obviously.\u0026#34;\u003c/p\u003e\u003cp\u003eThe sudden explosion in popularity has prompted some to raise cyber security concerns.\u003c/p\u003e\u003cp\u003eIn Australia, science minister Ed Husic was among the experts urging caution, telling Australia\u0026#39;s national broadcaster ABC: \u0026#34;There are a lot of questions that will need to be answered in time on quality, consumer preferences, data and privacy management.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6ec8/live/29b89380-dd27-11ef-a37f-eba91255dc3d.png.webp\" alt=\"Banner which reads: Tech Decoded. The world\u0026#39;s biggest tech development, decoded in your inbox every Monday.\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-28T05:38:03.95Z",
  "modifiedTime": null
}
