{
  "id": "c4edcaf3-21e3-4f99-b206-efe5acce97d5",
  "title": "Biden, Trump send different Christmas messages",
  "link": "https://www.yahoo.com/news/biden-trump-send-different-christmas-185915995.html",
  "description": "",
  "author": "",
  "published": "2024-12-25T18:59:15Z",
  "source": "https://www.yahoo.com/news/rss",
  "categories": null,
  "byline": "Reuters",
  "length": 2853,
  "excerpt": "WASHINGTON (Reuters) -The outgoing and incoming U.S. presidents had different messages for the Christmas holiday on Wednesday, with Democrat Joe Biden urging...",
  "siteName": "Yahoo News",
  "favicon": "",
  "text": "WASHINGTON (Reuters) -The outgoing and incoming U.S. presidents had different messages for the Christmas holiday on Wednesday, with Democrat Joe Biden urging Americans to reflect and unite, while Republican Donald Trump offered a holiday greeting and then took aim at his political opponents.Biden narrated a video tour of the White House Christmas decorations that was published on YouTube late on Christmas Eve, in which he urges Americans to set aside \"all the noise and everything that divides us.\"\"We're here on this Earth to care for one another, to love one another,\" Biden says in a voiceover as a camera pans past adorned evergreen trees and bedecked fireplaces inside the White House. \"Too often we see each other as enemies, not as neighbors, not as fellow Americans,\" he said.Biden urged Americans to find a moment of \"quiet reflection\" to remind themselves to treat each other with dignity and respect, to \"live in the light\" and remember there was more to unite than divide Americans. \"We're truly blessed to live in this nation,\" he said.Trump published a mid-morning \"Merry Christmas\" message on Truth Social on Christmas Day with a photo of himself and his wife Melania, followed by over two dozen re-posts of articles or other social media posts that backed his political positions on topics including Defense Secretary nominee Pete Hegseth and his pursuit of Greenland and the Panama Canal.Later, Trump published a more lengthy \"Merry Christmas\" message that claimed Chinese soldiers were operating the Panama Canal, and criticized Canadian Prime Minister Justin Trudeau, Biden and Democrats.\"Merry Christmas to the Radical Left Lunatics, who are constantly trying to obstruct our Court System and our Elections,\" Trump wrote. \"They know that their only chance of survival is getting pardons from a man who has absolutely no idea what he is doing.\"\"Also, to Governor Justin Trudeau of Canada, whose Citizens’ Taxes are far too high, but if Canada was to become our 51st State, their Taxes would be cut by more than 60%,\" Trump wrote.Biden took office in 2021 vowing to \"end this uncivil war that pits red against blue, rural versus urban, conservative versus liberal,\" and said he bowed out of the 2024 presidential race in July to unite the country.Biden's Democrats lost every battleground state and both houses of Congress in the November election.By some measures, polarization in the country has increased, including during the 2024 campaign that saw Biden face Trump, again, before Democrat Kamala Harris took over.The incoming U.S. Congress is on track to be the most polarized ever.Trump has called for the prosecution of perceived political enemies, the U.S. takeover of the Panama Canal and vowed to restructure the federal government.(Reporting by Heather Timmons and Lucia Mutikani; Editing by Sandra Maler and Rod Nickel)",
  "image": "https://media.zenfs.com/en/reuters.com/c6523fc3200d0b60633edfe92ff8cf3c",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-article-body=\"true\"\u003e\u003cp\u003eWASHINGTON (Reuters) -The outgoing and incoming U.S. presidents had different messages for the Christmas holiday on Wednesday, with Democrat Joe Biden urging Americans to reflect and unite, while Republican Donald Trump offered a holiday greeting and then took aim at his political opponents.\u003c/p\u003e\u003cp\u003eBiden narrated a video tour of the White House Christmas decorations that was published on YouTube late on Christmas Eve, in which he urges Americans to set aside \u0026#34;all the noise and everything that divides us.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re here on this Earth to care for one another, to love one another,\u0026#34; Biden says in a voiceover as a camera pans past adorned evergreen trees and bedecked fireplaces inside the White House. \u0026#34;Too often we see each other as enemies, not as neighbors, not as fellow Americans,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eBiden urged Americans to find a moment of \u0026#34;quiet reflection\u0026#34; to remind themselves to treat each other with dignity and respect, to \u0026#34;live in the light\u0026#34; and remember there was more to unite than divide Americans. \u0026#34;We\u0026#39;re truly blessed to live in this nation,\u0026#34; he said.\u003c/p\u003e\u003cp\u003eTrump published a mid-morning \u0026#34;Merry Christmas\u0026#34; message on Truth Social on Christmas Day with a photo of himself and his wife Melania, followed by over two dozen re-posts of articles or other social media posts that backed his political positions on topics including Defense Secretary nominee Pete Hegseth and his pursuit of Greenland and the Panama Canal.\u003c/p\u003e\u003cp\u003eLater, Trump published a more lengthy \u0026#34;Merry Christmas\u0026#34; message that claimed Chinese soldiers were operating the Panama Canal, and criticized Canadian Prime Minister Justin Trudeau, Biden and Democrats.\u003c/p\u003e\u003cp\u003e\u0026#34;Merry Christmas to the Radical Left Lunatics, who are constantly trying to obstruct our Court System and our Elections,\u0026#34; Trump wrote. \u0026#34;They know that their only chance of survival is getting pardons from a man who has absolutely no idea what he is doing.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Also, to Governor Justin Trudeau of Canada, whose Citizens’ Taxes are far too high, but if Canada was to become our 51st State, their Taxes would be cut by more than 60%,\u0026#34; Trump wrote.\u003c/p\u003e\u003cp\u003eBiden took office in 2021 vowing to \u0026#34;end this uncivil war that pits red against blue, rural versus urban, conservative versus liberal,\u0026#34; and said he bowed out of the 2024 presidential race in July to unite the country.\u003c/p\u003e\u003cp\u003eBiden\u0026#39;s Democrats lost every battleground state and both houses of Congress in the November election.\u003c/p\u003e\u003cp\u003eBy some measures, polarization in the country has increased, including during the 2024 campaign that saw Biden face Trump, again, before Democrat Kamala Harris took over.\u003c/p\u003e\u003cp\u003eThe incoming U.S. Congress is on track to be the most polarized ever.\u003c/p\u003e\u003cp\u003eTrump has called for the prosecution of perceived political enemies, the U.S. takeover of the Panama Canal and vowed to restructure the federal government.\u003c/p\u003e\u003cp\u003e(Reporting by Heather Timmons and Lucia Mutikani; Editing by Sandra Maler and Rod Nickel)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-25T21:01:51Z",
  "modifiedTime": null
}
