{
  "id": "cdc28630-226b-4b27-b5cc-6d7eb8635690",
  "title": "Middle East crisis: Putin proposes peace talks between Iran and Israel; Trump tells him to focus on Ukraine first",
  "link": "https://timesofindia.indiatimes.com/world/europe/middle-east-crisis-putin-proposes-peace-talks-between-iran-and-israel-trump-tells-him-to-focus-on-ukraine-first/articleshow/121941183.cms",
  "description": "Amid escalating Middle East tensions, Vladimir Putin offered Russia's mediation between Iran and Israel, citing Moscow's unique ties. He revealed proposals shared with Iran, Israel, and the U.S. for de-escalation. While Trump dismissed the offer, Putin highlighted Russia's nuclear cooperation with Iran, assuring Israel of security measures.",
  "author": "TOI World Desk",
  "published": "2025-06-19T05:58:42+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 3596,
  "excerpt": "Europe News: Amid escalating Middle East tensions, Vladimir Putin offered Russia's mediation between Iran and Israel, citing Moscow's unique ties. He revealed prop",
  "siteName": "Times of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "Russian President Vladimir Putin has offered to mediate between Iran and Israel amid escalating tensions in the Middle East.He claimed that Moscow’s longstanding ties with both countries make it uniquely positioned to help broker peace.Speaking at a meeting with senior editors from global news agencies at the St. Petersburg International Economic Forum, Putin said Russia had already shared proposals with Iran, Israel and the United States aimed at de-escalating the situation.“We are not imposing anything on anyone; we are simply talking about how we see a possible way out of the situation,” he said. “But the decision, of course, is up to the political leadership of all these countries, primarily Iran and Israel.”Putin acknowledged the complexity of the crisis, saying “it’s a delicate issue,” but said that a solution to the conflict is possible. “In my view, a solution could be found,\" the Russian president said.His comments come at a time of growing concern that Israeli strikes on Iranian targets and the potential for a wider war could draw in other regional and global powers.Khamenei under threat, Putin refuses to speculateAsked how Russia would respond if Israel were to assassinate Iran’s Supreme Leader Ayatollah Ali Khamenei, Putin refused to engage in speculation. “I don't even want to discuss such a possibility,” he told reporters.Iran's Supreme Leader Khamenei has rejected calls from the US to stand down amid Israel’s ongoing military actions. Warning Washington against any direct involvement, Khamenei said such a move would result in “irreparable damage to them.”Trump shrugs off mediation ideaPutin’s offer to mediate was also raised during a phone call with US President Donald Trump last weekend. However, Trump later indicated he was uninterested in Russia’s involvement.“I said, ‘Do me a favour, mediate your own,’” Trump recalled telling Putin. “I said, ‘Vladimir, let’s mediate Russia first. You can worry about this later.’”This marked a shift from Trump’s earlier comments in which he had said he was “open” to the idea of Russian mediation in the Middle East.Russia’s nuclear ties with IranPutin highlighted Russia’s nuclear cooperation with Iran, including the construction of the Bushehr nuclear power plant. He said over 200 Russian workers are currently helping to build two additional reactors at the site, located along the Persian Gulf.He added that Russia had made security assurances to Israel in connection with the nuclear programme. “We agreed with the Israeli leadership that their security will be ensured,” he said.While Russia has previously supplied some air defence systems to Iran, Putin clarified that a comprehensive air defence network had been offered but was declined by Tehran. “Our proposal was to create a system, not isolated deliveries,” he said. “But the Iranian side showed little interest.”Israel has since claimed it neutralised some of Iran’s Russian-made S-300 systems during airstrikes last year.Civilian toll in UkraineWhen questioned about Russia’s airstrikes in Ukraine, particularly as Moscow continues to criticise Israeli strikes on Iran, Putin defended the operations. “The strikes were carried out against military industries, not residential quarters,” he said.However, AP reporters recently documented civilian casualties in Kyiv, where 28 people died after a missile hit a nine-storey apartment building.Putin vowed to achieve Russia’s goal of “demilitarising” Ukraine, either through negotiation or military action. “If we fail to reach a settlement, we will achieve our goals by military means,” he said.",
  "image": "https://static.toiimg.com/thumb/msid-121941760,width-1070,height-580,imgsize-967951,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-121941760,imgsize-967951,width-400,resizemode-4/121941760.jpg\" alt=\"Middle East crisis: Putin proposes peace talks between Iran and Israel; Trump tells him to focus on Ukraine first\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eRussian President Vladimir Putin has offered to mediate between Iran and Israel amid escalating tensions in the Middle East.\u003cspan data-pos=\"1\"\u003e\u003c/span\u003eHe claimed that Moscow’s longstanding ties with both countries make it uniquely positioned to help broker peace.\u003cspan data-pos=\"4\"\u003e\u003c/span\u003eSpeaking at a meeting with senior editors from global news agencies at the St. Petersburg International Economic Forum, Putin said Russia had already shared proposals with Iran, Israel and the United States aimed at de-escalating the situation.\u003cspan data-pos=\"6\"\u003e\u003c/span\u003e“We are not imposing anything on anyone; we are simply talking about how we see a possible way out of the situation,” he said. “But the decision, of course, is up to the political leadership of all these countries, primarily Iran and Israel.”\u003cspan data-pos=\"9\"\u003e\u003c/span\u003ePutin acknowledged the complexity of the crisis, saying “it’s a delicate issue,” but said that a solution to the conflict is possible. “In my view, a solution could be found,\u0026#34; the Russian president said.\u003cspan data-pos=\"11\"\u003e\u003c/span\u003eHis comments come at a time of growing concern that Israeli strikes on Iranian targets and the potential for a wider war could draw in other regional and global powers.\u003cspan data-pos=\"13\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eKhamenei under threat, Putin refuses to speculate\u003c/span\u003e\u003cspan data-pos=\"15\"\u003e\u003c/span\u003e\u003cspan data-pos=\"16\"\u003e\u003c/span\u003eAsked how Russia would respond if Israel were to assassinate Iran’s Supreme Leader Ayatollah Ali Khamenei, Putin refused to engage in speculation. \u003c/p\u003e\u003cp\u003e“I don\u0026#39;t even want to discuss such a possibility,” he told reporters.\u003cspan data-pos=\"20\"\u003e\u003c/span\u003eIran\u0026#39;s Supreme Leader Khamenei has rejected calls from the US to stand down amid Israel’s ongoing military actions. Warning Washington against any direct involvement, Khamenei said such a move would result in “irreparable damage to them.”\u003cspan data-pos=\"22\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eTrump shrugs off mediation idea\u003c/span\u003e\u003cspan data-pos=\"24\"\u003e\u003c/span\u003e\u003cspan data-pos=\"25\"\u003e\u003c/span\u003ePutin’s offer to mediate was also raised during a phone call with US President Donald Trump last weekend. However, Trump later indicated he was uninterested in Russia’s involvement.\u003cspan data-pos=\"28\"\u003e\u003c/span\u003e“I said, ‘Do me a favour, mediate your own,’” Trump recalled telling Putin. “I said, ‘Vladimir, let’s mediate Russia first. You can worry about this later.’”\u003cspan data-pos=\"30\"\u003e\u003c/span\u003eThis marked a shift from Trump’s earlier comments in which he had said he was “open” to the idea of Russian mediation in the Middle East.\u003cspan data-pos=\"32\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eRussia’s nuclear ties with Iran\u003c/span\u003e\u003cspan data-pos=\"34\"\u003e\u003c/span\u003e\u003cspan data-pos=\"35\"\u003e\u003c/span\u003ePutin highlighted Russia’s nuclear cooperation with Iran, including the construction of the Bushehr nuclear power plant. He said over 200 Russian workers are currently helping to build two additional reactors at the site, located along the Persian Gulf.\u003cspan data-pos=\"38\"\u003e\u003c/span\u003eHe added that Russia had made security assurances to Israel in connection with the nuclear programme. “We agreed with the Israeli leadership that their security will be ensured,” he said.\u003cspan data-pos=\"40\"\u003e\u003c/span\u003eWhile Russia has previously supplied some air defence systems to Iran, Putin clarified that a comprehensive air defence network had been offered but was declined by Tehran. “Our proposal was to create a system, not isolated deliveries,” he said. “But the Iranian side showed little interest.”\u003cspan data-pos=\"44\"\u003e\u003c/span\u003eIsrael has since claimed it neutralised some of Iran’s Russian-made S-300 systems during airstrikes last year.\u003cspan data-pos=\"46\"\u003e\u003c/span\u003e\u003cspan data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003eCivilian toll in Ukraine\u003c/span\u003e\u003cspan data-pos=\"48\"\u003e\u003c/span\u003e\u003cspan data-pos=\"49\"\u003e\u003c/span\u003eWhen questioned about Russia’s airstrikes in Ukraine, particularly as Moscow continues to criticise Israeli strikes on Iran, Putin defended the operations. “The strikes were carried out against military industries, not residential quarters,” he said.\u003cspan data-pos=\"52\"\u003e\u003c/span\u003eHowever, AP reporters recently documented civilian casualties in Kyiv, where 28 people died after a missile hit a nine-storey apartment building.\u003cspan data-pos=\"54\"\u003e\u003c/span\u003ePutin vowed to achieve Russia’s goal of “demilitarising” Ukraine, either through negotiation or military action. “If we fail to reach a settlement, we will achieve our goals by military means,” he said.\u003cspan data-pos=\"56\"\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-19T05:58:00+05:30",
  "modifiedTime": null
}
