{
  "id": "d4697304-51e9-445f-a977-0f93b5541399",
  "title": "\"JOE, YOU'RE FIRED\": Trump Revokes Biden's Security Clearances",
  "link": "https://www.ndtv.com/world-news/donald-trump-revokes-bidens-security-clearances-7660762",
  "description": "US President Donald Trump said Friday he was revoking his predecessor Joe Biden's security clearance, which entitles former presidents to receive sensitive information even after they have left office.",
  "author": "",
  "published": "Sat, 08 Feb 2025 05:42:59 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Agence France-Presse",
  "length": 1468,
  "excerpt": "US President Donald Trump said Friday he was revoking his predecessor Joe Biden\u0026#039;s security clearance, which entitles former presidents to receive sensitive information even after they have left office.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Washington: US President Donald Trump said Friday he was revoking Joe Biden's security clearance, ending his predecessor's right to receive intelligence briefings after leaving office.\"There is no need for Joe Biden to continue receiving access to classified information,\" Trump said on his Truth Social network.\"Therefore, we are immediately revoking Joe Biden's Security Clearances, and stopping his daily Intelligence Briefings.\"In a reference to the catchphrase of his former reality TV show \"The Apprentice,\"  Trump added in capitals: \"JOE, YOU'RE FIRED.\"US presidents are traditionally given the right to receive intelligence briefings even after they step down.Trump said he was making the move because Democrat Biden had removed his own security clearance after winning the 2020 election.Biden at the time cited Trump's \"erratic behavior\" both before and after the January 6, 2021 attack on the US Capitol by protesters trying to overturn Trump's election loss.In his post on Friday, Trump claimed that Biden \"could not be trusted\" with intelligence briefings because a special counsel's report into classified documents found at the Democrat's home found that Biden, 82, suffered from \"poor memory.\"Trump was also prosecuted for mishandling classified documents but the Justice Department ended the case after the Republican won the 2024 election.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-11/o6pc1h88_joe-biden-trump_625x300_07_November_24.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eWashington: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS President Donald Trump said Friday he was revoking Joe Biden\u0026#39;s security clearance, ending his predecessor\u0026#39;s right to receive intelligence briefings after leaving office.\u003c/p\u003e\u003cp\u003e\u0026#34;There is no need for Joe Biden to continue receiving access to classified information,\u0026#34; Trump said on his Truth Social network.\u003c/p\u003e\u003cp\u003e\u0026#34;Therefore, we are immediately revoking Joe Biden\u0026#39;s Security Clearances, and stopping his daily Intelligence Briefings.\u0026#34;\u003c/p\u003e\u003cp\u003eIn a reference to the catchphrase of his former reality TV show \u0026#34;The Apprentice,\u0026#34;  Trump added in capitals: \u0026#34;JOE, YOU\u0026#39;RE FIRED.\u0026#34;\u003c/p\u003e\u003cp\u003eUS presidents are traditionally given the right to receive intelligence briefings even after they step down.\u003c/p\u003e\u003cp\u003eTrump said he was making the move because Democrat Biden had removed his own security clearance after winning the 2020 election.\u003c/p\u003e\u003cp\u003eBiden at the time cited Trump\u0026#39;s \u0026#34;erratic behavior\u0026#34; both before and after the January 6, 2021 attack on the US Capitol by protesters trying to overturn Trump\u0026#39;s election loss.\u003c/p\u003e\u003cp\u003eIn his post on Friday, Trump claimed that Biden \u0026#34;could not be trusted\u0026#34; with intelligence briefings because a special counsel\u0026#39;s report into classified documents found at the Democrat\u0026#39;s home found that Biden, 82, suffered from \u0026#34;poor memory.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump was also prosecuted for mishandling classified documents but the Justice Department ended the case after the Republican won the 2024 election.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-08T05:42:59+05:30",
  "modifiedTime": null
}
