{
  "id": "da925ce9-7708-4b95-915c-0ff2c5647c64",
  "title": "Elon Musk Slams Australia's Plan To Ban Social Media For Kids Under 16",
  "link": "https://www.ndtv.com/world-news/elon-musk-slams-australias-plan-to-ban-social-media-for-kids-under-16-7075957",
  "description": "US billionaire Elon Musk, owner of social media platform X, has criticised Australia's proposed law to ban social media for children under 16 and fine social media platforms of up to A$49.5 million ($32 million) for companies for systemic breaches.",
  "author": "",
  "published": "Fri, 22 Nov 2024 05:05:24 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "Reuters",
  "length": 1638,
  "excerpt": "US billionaire Elon Musk, owner of social media platform X, has criticised Australia\u0026#039;s proposed law to ban social media for children under 16 and fine social media platforms of up to A$49.5 million ($32 million) for companies for systemic breaches.",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Sydney: US billionaire Elon Musk, owner of social media platform X, has criticised Australia's proposed law to ban social media for children under 16 and fine social media platforms of up to A$49.5 million ($32 million) for companies for systemic breaches.Australia's centre-left government on Thursday introduced the bill in parliament. It plans to try an age-verification system to enforce a social media age cut-off, some of the toughest controls imposed by any country to date.\"Seems like a backdoor way to control access to the Internet by all Australians,\" Musk, who views himself as a champion of free speech, said in a reply late on Thursday to Prime Minister Anthony Albanese's post on X about the bill.Several countries have already vowed to curb social media use by children through legislation, but Australia's policy could become one of the most stringent with no exemption for parental consent and pre-existing accounts.France last year proposed a ban on social media for those under 15 but allowed parental consent, while the US has for decades required technology companies to seek parental consent to access the data of children under 13.Musk has previously clashed with Australia's centre-left Labor government over its social media policies and had called it \"fascists\" over its misinformation law.In April, X went to an Australian court to challenge a cyber regulator's order for the removal of some posts about the stabbing of a bishop in Sydney, prompting Albanese to call Musk an \"arrogant billionaire\".(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
  "image": "https://c.ndtvimg.com/2024-11/jcmdalmo_elon-musk_625x300_22_November_24.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                                                                \u003cp\u003e\u003cb\u003eSydney: \u003c/b\u003e\u003c/p\u003e\u003cp\u003eUS billionaire Elon Musk, owner of social media platform X, has criticised Australia\u0026#39;s proposed law to ban social media for children under 16 and fine social media platforms of up to A$49.5 million ($32 million) for companies for systemic breaches.\u003c/p\u003e\u003cp\u003eAustralia\u0026#39;s centre-left government on Thursday introduced the bill in parliament. It plans to try an age-verification system to enforce a social media age cut-off, some of the toughest controls imposed by any country to date.\u003c/p\u003e\u003cp\u003e\u0026#34;Seems like a backdoor way to control access to the Internet by all Australians,\u0026#34; Musk, who views himself as a champion of free speech, said in a reply late on Thursday to Prime Minister Anthony Albanese\u0026#39;s post on X about the bill.\u003c/p\u003e\u003cp\u003eSeveral countries have already vowed to curb social media use by children through legislation, but Australia\u0026#39;s policy could become one of the most stringent with no exemption for parental consent and pre-existing accounts.\u003c/p\u003e\u003cp\u003eFrance last year proposed a ban on social media for those under 15 but allowed parental consent, while the US has for decades required technology companies to seek parental consent to access the data of children under 13.\u003c/p\u003e\u003cp\u003eMusk has previously clashed with Australia\u0026#39;s centre-left Labor government over its social media policies and had called it \u0026#34;fascists\u0026#34; over its misinformation law.\u003c/p\u003e\u003cp\u003eIn April, X went to an Australian court to challenge a cyber regulator\u0026#39;s order for the removal of some posts about the stabbing of a bishop in Sydney, prompting Albanese to call Musk an \u0026#34;arrogant billionaire\u0026#34;.\u003c/p\u003e\u003cp\u003e\u003ci\u003e(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\u003c/i\u003e\u003c/p\u003e                                        \n                                        \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-22T05:05:24+05:30",
  "modifiedTime": null
}
