{
  "id": "dae14da4-33ee-479c-8d9e-03518710c346",
  "title": "Russian minister sacked by Putin found dead",
  "link": "https://www.bbc.com/news/articles/cy7nvxzrvr0o",
  "description": "On Monday morning a presidential decree stated that Starovoit had been dismissed from his post.",
  "author": "",
  "published": "Mon, 07 Jul 2025 15:21:26 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "Laura Gozzi",
  "length": 1712,
  "excerpt": "On Monday morning a presidential decree stated that Starovoit had been dismissed from his post.",
  "siteName": "BBC News",
  "favicon": "https://static.files.bbci.co.uk/bbcdotcom/web/20250701-150711-e3d94715db-web-2.24.1-1/apple-touch-icon.png",
  "text": "Russia's Investigative Committee says former Russian transport minister Roman Starovoit has been found dead, apparently with a self-inflicted gunshot wound.He was dismissed earlier on Monday by President Vladimir Putin.No reason for Starovoit's dismissal was given and deputy transport minister Andrei Nikitin was announced as his replacement shortly after.The Investigative Committee said it was working to establish the circumstances of the incident.Starovoit was appointed minister of transport in May 2024. Before that, Starovoit had served as governor of the Kursk region for almost six years, until May 2024. The region was partly seized by Ukrainian troops in August 2024 in a surprise offensive. Moscow only recently managed to drive out the Ukrainian forces, although in late June Kyiv said it was still holding a small area of territory inside Russia.Starovoit's successor, Aleksey Smirnov, was only in post for a short while. He was arrested in April and was later accused of embezzling funds that had been allocated for the building of fortifications on the border with Ukraine. According to Russian outlet Kommersant, Starovoit was about to be brought in as a defendant in the same case. It is unclear when, exactly, Starovoit died. The head of the State Duma Defence Committee, Andrei Kartapolov, told Russian outlet RTVI that his death occurred \"quite a while ago\".Earlier on Monday, before Starovoit's death was announced, Kremlin spokesman Dmitry Peskov was pressed by reporters on whether the dismissal meant Putin had lost trust in Starovoit over the events in Kursk.\"A loss of trust is mentioned if there is a loss of trust. Such wording was not used [in the Kremlin decree],\" Peskov replied.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0e61/live/07295f90-5b3d-11f0-b5c5-012c5796682d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRussia\u0026#39;s Investigative Committee says former Russian transport minister Roman Starovoit has been found dead, apparently with a self-inflicted gunshot wound.\u003c/p\u003e\u003cp\u003eHe was dismissed earlier on Monday by President Vladimir Putin.\u003c/p\u003e\u003cp\u003eNo reason for Starovoit\u0026#39;s dismissal was given and deputy transport minister Andrei Nikitin was announced as his replacement shortly after.\u003c/p\u003e\u003cp\u003eThe Investigative Committee said it was working to establish the circumstances of the incident.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eStarovoit was appointed minister of transport in May 2024. \u003c/p\u003e\u003cp\u003eBefore that, Starovoit had served as governor of the Kursk region for almost six years, until May 2024. \u003c/p\u003e\u003cp\u003eThe region was partly seized by Ukrainian troops in August 2024 in a surprise offensive. Moscow only recently managed to drive out the Ukrainian forces, although in late June Kyiv said it was still holding a small area of territory inside Russia.\u003c/p\u003e\u003cp\u003eStarovoit\u0026#39;s successor, Aleksey Smirnov, was only in post for a short while. He was arrested in April and was later accused of embezzling funds that had been allocated for the building of fortifications on the border with Ukraine. \u003c/p\u003e\u003cp\u003eAccording to Russian outlet Kommersant, Starovoit was about to be brought in as a defendant in the same case. \u003c/p\u003e\u003cp\u003eIt is unclear when, exactly, Starovoit died. \u003c/p\u003e\u003cp\u003eThe head of the State Duma Defence Committee, Andrei Kartapolov, told Russian outlet RTVI that his death occurred \u0026#34;quite a while ago\u0026#34;.\u003c/p\u003e\u003cp\u003eEarlier on Monday, before Starovoit\u0026#39;s death was announced, Kremlin spokesman Dmitry Peskov was pressed by reporters on whether the dismissal meant Putin had lost trust in Starovoit over the events in Kursk.\u003c/p\u003e\u003cp\u003e\u0026#34;A loss of trust is mentioned if there is a loss of trust. Such wording was not used [in the Kremlin decree],\u0026#34; Peskov replied.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-07T15:21:26.054Z",
  "modifiedTime": "2025-07-07T15:21:26.054Z"
}
