{
  "id": "dce79fe6-5a7d-4aa6-8060-dd0a7e14d70a",
  "title": "Indian Students In Iran Being Moved To Safer Places As Conflict Deepens",
  "link": "https://www.ndtv.com/world-news/indian-students-in-iran-being-moved-to-safer-places-within-the-country-says-new-delhi-as-middle-east-conflict-intensifies-8677313#publisher=newsstand",
  "description": "Indian students in Iran being moved to safer places within the country, says New Delhi as Middle East conflict intensifies",
  "author": "",
  "published": "Mon, 16 Jun 2025 01:24:28 +0530",
  "source": "http://feeds.feedburner.com/ndtvnews-world-news",
  "categories": null,
  "byline": "NDTV Newsdesk",
  "length": 2603,
  "excerpt": "Indian students in Iran being moved to safer places within the country, says New Delhi as Middle East conflict intensifies",
  "siteName": "NDTV",
  "favicon": "https://www.ndtv.com/static/images/logo_ndtv_touch_icon.png",
  "text": "Indian students in Iran are being relocated to safer areas amid escalating tensions.The embassy in Tehran is monitoring the security situation in Iran, India said.Over 1,500 Indian students, primarily from Jammu and Kashmir, are stranded in Iran. Some Indian students in Iran were being relocated to \"safer places\" within the country, the government said in a statement early Monday, stressing that \"other feasible options\" were also being examined. The development comes as Israel and Iran continue to trade missiles, with neither side showing any sign of backing down.\"The Indian Embassy in Tehran is continuously monitoring the security situation and engaging Indian students in Iran to ensure their safety. In some cases, students are being relocated with the Embassy's facilitation to safer places within Iran. Other feasible options are also under examination,\" the Ministry of External Affairs said in a statement.It comes hours after Jammu and Kashmir Chief Minister Omar Abdullah spoke to External Affairs Minister S Jaishankar regarding students from the Union Territory stuck in Iran. More than 1,500 Indian students, most of them from Jammu and Kashmir, are stranded in Iran. The parents have appealed to Prime Minister Narendra Modi and S Jaishankar to intervene and facilitate the safe return of the Indian students. The majority of the students stranded in Tehran, Shiraz, and Qom cities of Iran are pursuing professional courses, primarily MBBS.Read | Israel, Iran Continue To Trade Missile Attacks, Sirens Heard In JerusalemEarlier, the Indian embassy in Iran asked all Indian nationals and Persons of Indian Origin to remain vigilant, and also provided a Google form on its X account, asking the Indian citizens to fill it out to provide their details. \"Please remember, it is important not to panic, exercise due caution and maintain contact with the Embassy of India in Tehran,\" it said.It also provided a Telegram Link and asked the Indian citizens to join it to receive updates on the situation from the mission.Israel launched \"Operation Rising Lion\" with a surprise attack on Friday morning that wiped out the top echelon of Iran's military command and damaged its nuclear sites. Iran retaliated with air strikes, with both countries launching hundreds of missiles at each other in the last three days.While Israel has said the campaign will continue to escalate in the coming days, Iran has vowed to \"open the gates of hell\" in retaliation.",
  "image": "https://c.ndtvimg.com/2025-06/m6v94nh_israel-iran-conflict-afp_625x300_15_June_25.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"ignorediv\"\u003e\n                                        \n                                        \u003cdiv\u003e\n                                \u003cul\u003e\u003cli\u003eIndian students in Iran are being relocated to safer areas amid escalating tensions.\u003c/li\u003e\u003cli\u003eThe embassy in Tehran is monitoring the security situation in Iran, India said.\u003c/li\u003e\u003cli\u003eOver 1,500 Indian students, primarily from Jammu and Kashmir, are stranded in Iran.\u003c/li\u003e\u003c/ul\u003e\n                        \n                                    \n                                    \u003c/div\u003e                                        \u003cp\u003eSome Indian students in Iran were being relocated to \u0026#34;safer places\u0026#34; within the country, the government said in a statement early Monday, stressing that \u0026#34;other feasible options\u0026#34; were also being examined. The development comes as Israel and Iran continue to trade missiles, with neither side showing any sign of backing down.\u003c/p\u003e\u003cp\u003e\u0026#34;The Indian Embassy in Tehran is continuously monitoring the security situation and engaging Indian students in Iran to ensure their safety. In some cases, students are being relocated with the Embassy\u0026#39;s facilitation to safer places within Iran. Other feasible options are also under examination,\u0026#34; the Ministry of External Affairs said in a statement.\u003c/p\u003e\u003cp\u003eIt comes hours after Jammu and Kashmir Chief Minister Omar Abdullah spoke to External Affairs Minister S Jaishankar regarding students from the Union Territory stuck in Iran. More than 1,500 Indian students, most of them from Jammu and Kashmir, are stranded in Iran. \u003c/p\u003e\u003cp\u003eThe parents have appealed to Prime Minister Narendra Modi and S Jaishankar to intervene and facilitate the safe return of the Indian students. The majority of the students stranded in Tehran, Shiraz, and Qom cities of Iran are pursuing professional courses, primarily MBBS.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRead | \u003ca href=\"https://www.ndtv.com/world-news/israel-army-says-iran-missiles-incoming-sirens-heard-in-jerusalem-8676921\"\u003eIsrael, Iran Continue To Trade Missile Attacks, Sirens Heard In Jerusalem\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eEarlier, the Indian embassy in Iran asked all Indian nationals and Persons of Indian Origin to remain vigilant, and also provided a Google form on its X account, asking the Indian citizens to fill it out to provide their details. \u0026#34;Please remember, it is important not to panic, exercise due caution and maintain contact with the Embassy of India in Tehran,\u0026#34; it said.\u003c/p\u003e\u003cp\u003eIt also provided a Telegram Link and asked the Indian citizens to join it to receive updates on the situation from the mission.\u003c/p\u003e\u003cp\u003eIsrael launched \u0026#34;Operation Rising Lion\u0026#34; with a surprise attack on Friday morning that wiped out the top echelon of Iran\u0026#39;s military command and damaged its nuclear sites. Iran retaliated with air strikes, with both countries launching hundreds of missiles at each other in the last three days.\u003c/p\u003e\u003cp\u003eWhile Israel has said the campaign will continue to escalate in the coming days, Iran has vowed to \u0026#34;open the gates of hell\u0026#34; in retaliation.\u003c/p\u003e                                                                                \n                                                                                \n                                                                                                                        \n                                                                                                                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-16T01:03:03+05:30",
  "modifiedTime": null
}
