{
  "id": "deda611b-f3d6-4c6a-b722-e1bc0c18c8f7",
  "title": "Watch: Harris supporter yells into a young girl's face",
  "link": "https://timesofindia.indiatimes.com/world/us/watch-harris-supporter-yells-into-a-young-girls-face/articleshow/114666819.cms",
  "description": "",
  "author": "TOI World Desk",
  "published": "2024-10-28T03:38:31+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 1739,
  "excerpt": "US News: A disturbing video from Kamala Harris' recent rally in Houston has gone viral, capturing a woman yelling directly into a young girl's face.",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "A disturbing video from Kamala Harris' recent rally in Houston has gone viral, capturing a woman yelling directly into a young girl's face. The incident took place at the Houston Metro station near Shell Energy Stadium, where Beyonce had just endorsed the vice president and joined her on the campaign trail last Friday.In the widely shared footage, a woman in a light blue t-shirt can be seen leaning over and screaming at a child seated in a stroller. Shocked onlookers reacted swiftly, with one woman was seen holding a \"Harris/Walz\" sign pulling the aggressor away from the child. The girl's father quickly scooped her up, putting distance between them and the agitated individual.The exact cause of the confrontation remains unclear, but the child's father appeared to be holding a microphone, indicating that he may have been addressing the crowd shortly before the verbal assault. An onlooker can be heard admonishing the woman, saying, \"Are you not ashamed at all? Look at her face!\"The video has amassed over 21 million views on X (formerly Twitter), with users expressing outrage at the woman's behavior. One user questioned, \"What kind of unhinged psychopath screams at another person's child like that?\" Another emphasized that the issue transcends political affiliations, stating, \"It's not about being a Democrat, Republican or Liberal, it's about having zero common sense and/or empathy. Extremely creepy behavior when an adult doesn't show kindness towards another human being especially towards a child.\" A third user pointed out the disturbing reaction of the person filming the incident, who appeared to be laughing as it unfolded. Another lamented, \"That's disgraceful…woke culture is destroying humanity and altruism.\"",
  "image": "https://static.toiimg.com/thumb/msid-114666814,width-1070,height-580,imgsize-498562,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-114666814,imgsize-498562,width-400,resizemode-4/114666814.jpg\" alt=\"Watch: Harris supporter yells into a young girl\u0026#39;s face\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA disturbing video from Kamala Harris\u0026#39; recent rally in Houston has gone viral, capturing a woman yelling directly into a young girl\u0026#39;s face. The incident took place at the Houston Metro station near Shell Energy Stadium, where Beyonce had just endorsed the vice president and joined her on the campaign trail last Friday.\u003cbr/\u003eIn the widely shared footage, a woman in a light blue t-shirt can be seen leaning over and screaming at a child seated in a stroller. Shocked onlookers reacted swiftly, with one woman was seen holding a \u0026#34;Harris/Walz\u0026#34; sign pulling the aggressor away from the child. The girl\u0026#39;s father quickly scooped her up, putting distance between them and the agitated individual.\u003c/p\u003e\u003cp\u003eThe exact cause of the confrontation remains unclear, but the child\u0026#39;s father appeared to be holding a microphone, indicating that he may have been addressing the crowd shortly before the verbal assault. An onlooker can be heard admonishing the woman, saying, \u0026#34;Are you not ashamed at all? Look at her face!\u0026#34;\u003c/p\u003e\u003cp\u003eThe video has amassed over 21 million views on X (formerly Twitter), with users expressing outrage at the woman\u0026#39;s behavior. One user questioned, \u0026#34;What kind of unhinged psychopath screams at another person\u0026#39;s child like that?\u0026#34; Another emphasized that the issue transcends political affiliations, stating, \u0026#34;It\u0026#39;s not about being a Democrat, Republican or Liberal, it\u0026#39;s about having zero common sense and/or empathy. Extremely creepy behavior when an adult doesn\u0026#39;t show kindness towards another human being especially towards a child.\u0026#34; A third user pointed out the disturbing reaction of the person filming the incident, who appeared to be laughing as it unfolded. Another lamented, \u0026#34;That\u0026#39;s disgraceful…woke culture is destroying humanity and altruism.\u0026#34;\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-28T03:38:00+05:30",
  "modifiedTime": null
}
