{
  "id": "ebdee76b-6f01-4742-b642-a62eccacfb7c",
  "title": "Palestinians and Israelis dare to hope as Gaza deal reportedly close",
  "link": "https://www.bbc.com/news/articles/cy48gzxky85o",
  "description": "Mediator Qatar says there are no major issues blocking a ceasefire and hostage release agreement.",
  "author": "",
  "published": "Tue, 14 Jan 2025 20:59:16 GMT",
  "source": "http://feeds.bbci.co.uk/news/world/rss.xml",
  "categories": null,
  "byline": "David Gritten, Paul Adams and Tom Bateman",
  "length": 7909,
  "excerpt": "Mediator Qatar says there are no major issues blocking a ceasefire and hostage release agreement.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Palestinians and Israelis dare to hope as Gaza deal reportedly closeBBCSanabel says she wants any ceasefire to last \"for a long time - for the rest of our lives\"Palestinians and Israelis have expressed cautious optimism that a deal on a ceasefire in the Gaza Strip and the release of hostages held there is close after 15 months of devastating war.\"I can't believe that I am still alive to witness this moment,\" 17-year-old Sanabel said in a voice note sent from Gaza City. \"We've been waiting for this with bated breath since the first month of [last] year.\"Sharon Lifshitz, whose elderly father is among the remaining hostages, said: \"I'm trying to breathe. I'm trying to be optimistic. I'm trying to imagine it's possible that a deal will happen now and that all the hostages will return.\"Qatar's foreign ministry spokesman said on Tuesday that there were no major issues blocking a deal between Israel and Hamas and that the indirect talks in Doha were focused on \"the final details of reaching an agreement\".An Israeli government official said the talks had made \"real progress\" and entered a critical and sensitive period, while Hamas said it was satisfied with the status of the negotiations.US Secretary of State Antony Blinken said a deal was \"right on the brink\".ReutersIsraeli hostages' families want all 98 of those still being held to be released at the same timeSanabel, who lives with her family in their partially destroyed home, told the BBC's OS programme that everyone in northern Gaza was \"feeling happy, cheerful, optimistic to see their best friends, to see their families who were displaced to the south of the Gaza Strip, to start over\".The teenager said she had called her displaced best friend and discussed \"what we would do if the war ended\", adding that she would start by trying to \"make up for every moment that deprived me of seeing her\".\"But after I called her, there was a huge bomb in my area. This reminded me of the [last ceasefire and hostage release deal] in November 2023. There were huge bombs and missiles [before it started]. I'm really frightened that this will be repeated.\"\"In the last hours of this war, I don't want to lose one of my family members. I don't want a ceasefire for a year or five months. I want a ceasefire for a long time - for the rest of our lives.\"Asmaa Tayeh, a young graduate who is sheltering with her family at her grandparents' house in the western Gaza City neighbourhood of al-Nasr, also said people were once again daring to hope.\"You can never imagine how excited and nervous people are here,\" she told the BBC. \"Everyone is waiting as if they will only survive after the announcement.\"Asmaa is from Jabalia, Gaza's largest urban refugee camp, whose residents have been forced to evacuate their homes multiple times by the Israeli military.When the Israeli military launched a new ground offensive in Jabalia in October, Asmaa's family was forced to flee once more.Fierce fighting has raged in Jabalia ever since. In December, Asmaa said her whole area had been \"wiped out\".Asmaa TayehAsmaa Tayeh says Palestinians in Gaza are daring to hope that the end of their ordeal is closeRelatives of Israeli hostages held in Gaza since October 2023 have also been speaking to the BBC about the news that a ceasefire deal could be imminent.Sharon Lifshitz is a British-Israeli artist and filmmaker whose has had no news about her 84-year-old father Oded since the woman who was being held with him was released during the week-long ceasefire in November 2023.\"For us, we know there will be so much heartbreak. We know quite a few of [the hostages] are not alive anymore. We are desperate for the return first of the living ones so they can come back to their families. Each of them is a whole world,\" she told the Today programme.She said her mother, Yocheved - who was also abducted in the 7 October attack but was released weeks later - was sceptical about the chances of a deal but that \"I can feel the cracks of optimism coming through\".Eyal Kalderon - the cousin of 54-year-old Ofer Kalderon, two of whose children were among the 105 hostages released from captivity in November - said in a voice note sent to BBC OS: \"We are hoping that the deal will be closed soon and we will reach the moment that we are hugging Ofer, that his four children are hugging him.\"\"We want this deal to include all the hostages, all the 98 hostages. We are demanding that. We are just hoping to see all of them in Israeli [territory].\"Lee Siegel - the brother of Keith Siegel, 64, whose wife Aviva was also released in November - insisted: \"All of the hostages must come home - those who are still alive, to work on rebuilding their lives and their families; those who are deceased, for a proper burial in their home country.\"Daniel LifshitzOded Lifshitz and his wife Yocheved were both taken hostage on 7 October 2023, but Yocheved was released after several weeks in captivity in GazaSome families of hostages not included in the initial releases expressed anger that their relatives might be left behind if the deal falters at a later stage.Ruby Chen's son, Itay, was killed during the 7 October 2023 attack and his body is being held in Gaza.\"The prime minister unfortunately is moving ahead with a deal that does not include my son and 65 additional hostages, where it is not known how my son is going to come out. And for most of the families this deal is unacceptable,\" he said.Prime Minister Benjamin Netanyahu is facing opposition from far-right cabinet ministers and some in his own party, who object to prisoner releases and a wider ceasefire deal. Sharon Lifshitz said a majority of Israelis had supported such a deal for a \"very long time\", but that a combined pressure from the administrations of outgoing US President Joe Biden and President-elect Donald Trump had finally given Netanyahu's government the \"extra push\" it needed.\"It appears that this deal is very much the deal that was on the table in July,\" she added. \"Many, many hostages died since July. Soldiers, Palestinians. So much suffering.\"Speaking later on Tuesday, Foreign Minister Gideon Saar said he was confident a majority in the Israeli government would support a deal.Meanwhile Blinken - approaching the end of his tenure as US secretary of state - laid out for the first time the plan the Biden administration wants to hand over to Trump for post-war Gaza. It did not envisage immediate full control of Gaza by the Palestinian Authority (PA) – the entity created by the Oslo accords that has limited governance in parts of the occupied West Bank. Critically, Gaza's security forces would be comprised of personnel from other countries – most likely Arab states although he didn't name them - alongside \"vetted\" Palestinian forces.Blinken said, as he has before, that Hamas had sought to spark a regional war and derail US-led efforts to integrate Israel and its Arab neighbours. Meanwhile Israel, he said, had pursued its military campaign \"past the point\" of destroying Hamas' military capacity and killing its leaders responsible for the 7 October attack. He suggested this was self defeating, adding that the US assessed Hamas had recruited almost as many new militants as Israel had killed.Israel launched a campaign to destroy Hamas in response to the group's 7 October 2023 attack, in which about 1,200 people were killed and 251 others were taken hostage.More than 46,640 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry. Most of the 2.3 million population has also been displaced, there is widespread destruction, and there are severe shortages of food, fuel, medicine and shelter due to an struggle to get aid to those in need.Israel says 94 of the hostages are still being held by Hamas, of whom 34 are presumed dead. In addition, there are four Israelis who were abducted before the war, two of whom are dead.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cp data-component=\"headline-block\"\u003e\u003ch2\u003ePalestinians and Israelis dare to hope as Gaza deal reportedly close\u003c/h2\u003e\u003c/p\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6e6b/live/480b8c30-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp\" alt=\"BBC Sanabel, a 17-year-old Palestinian living in Gaza City\"/\u003e\u003cspan\u003eBBC\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eSanabel says she wants any ceasefire to last \u0026#34;for a long time - for the rest of our lives\u0026#34;\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003ePalestinians and Israelis have expressed cautious optimism that a deal on a ceasefire in the Gaza Strip and the release of hostages held there is close after 15 months of devastating war.\u003c/p\u003e\u003cp\u003e\u0026#34;I can\u0026#39;t believe that I am still alive to witness this moment,\u0026#34; 17-year-old Sanabel said in a voice note sent from Gaza City. \u0026#34;We\u0026#39;ve been waiting for this with bated breath since the first month of [last] year.\u0026#34;\u003c/p\u003e\u003cp\u003eSharon Lifshitz, whose elderly father is among the remaining hostages, said: \u0026#34;I\u0026#39;m trying to breathe. I\u0026#39;m trying to be optimistic. I\u0026#39;m trying to imagine it\u0026#39;s possible that a deal will happen now and that all the hostages will return.\u0026#34;\u003c/p\u003e\u003cp\u003eQatar\u0026#39;s foreign ministry spokesman said on Tuesday that there were no major issues blocking a deal between Israel and Hamas and that the indirect talks in Doha were focused on \u0026#34;the final details of reaching an agreement\u0026#34;.\u003c/p\u003e\u003cp\u003eAn Israeli government official said the talks had made \u0026#34;real progress\u0026#34; and entered a critical and sensitive period, while Hamas said it was satisfied with the status of the negotiations.\u003c/p\u003e\u003cp\u003eUS Secretary of State Antony Blinken said a deal was \u0026#34;right on the brink\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c36a/live/137adce0-d2b4-11ef-87df-d575b9a434a4.jpg.webp\" alt=\"Reuters Israeli hostages\u0026#39; families and supporters hold a demonstration to demand the Israeli government agree a Gaza ceasefire and hostage release deal with Hamas, in Jerusalem (14 January 2025)\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eIsraeli hostages\u0026#39; families want all 98 of those still being held to be released at the same time\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSanabel, who lives with her family in their partially destroyed home, told the BBC\u0026#39;s OS programme that everyone in northern Gaza was \u0026#34;feeling happy, cheerful, optimistic to see their best friends, to see their families who were displaced to the south of the Gaza Strip, to start over\u0026#34;.\u003c/p\u003e\u003cp\u003eThe teenager said she had called her displaced best friend and discussed \u0026#34;what we would do if the war ended\u0026#34;, adding that she would start by trying to \u0026#34;make up for every moment that deprived me of seeing her\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;But after I called her, there was a huge bomb in my area. This reminded me of the [last ceasefire and hostage release deal] in November 2023. There were huge bombs and missiles [before it started]. I\u0026#39;m really frightened that this will be repeated.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;In the last hours of this war, I don\u0026#39;t want to lose one of my family members. I don\u0026#39;t want a ceasefire for a year or five months. I want a ceasefire for a long time - for the rest of our lives.\u0026#34;\u003c/p\u003e\u003cp\u003eAsmaa Tayeh, a young graduate who is sheltering with her family at her grandparents\u0026#39; house in the western Gaza City neighbourhood of al-Nasr, also said people were once again daring to hope.\u003c/p\u003e\u003cp\u003e\u0026#34;You can never imagine how excited and nervous people are here,\u0026#34; she told the BBC. \u0026#34;Everyone is waiting as if they will only survive after the announcement.\u0026#34;\u003c/p\u003e\u003cp\u003eAsmaa is from Jabalia, Gaza\u0026#39;s largest urban refugee camp, whose residents have been forced to evacuate their homes multiple times by the Israeli military.\u003c/p\u003e\u003cp\u003eWhen the Israeli military launched a new ground offensive in Jabalia in October, Asmaa\u0026#39;s family was forced to flee once more.\u003c/p\u003e\u003cp\u003eFierce fighting has raged in Jabalia ever since. In December, Asmaa said her whole area had been \u0026#34;wiped out\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ae27/live/3fb09210-d2b3-11ef-b2ff-23c7e0d06ab9.jpg.webp\" alt=\"Asmaa Tayeh Asmaa Tayeh\"/\u003e\u003cspan\u003eAsmaa Tayeh\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eAsmaa Tayeh says Palestinians in Gaza are daring to hope that the end of their ordeal is close\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRelatives of Israeli hostages held in Gaza since October 2023 have also been speaking to the BBC about the news that a ceasefire deal could be imminent.\u003c/p\u003e\u003cp\u003eSharon Lifshitz is a British-Israeli artist and filmmaker whose has had no news about her 84-year-old father Oded since the woman who was being held with him was released during the week-long ceasefire in November 2023.\u003c/p\u003e\u003cp\u003e\u0026#34;For us, we know there will be so much heartbreak. We know quite a few of [the hostages] are not alive anymore. We are desperate for the return first of the living ones so they can come back to their families. Each of them is a whole world,\u0026#34; she told the Today programme.\u003c/p\u003e\u003cp\u003eShe said her mother, Yocheved - who was also abducted in the 7 October attack but was released weeks later - was sceptical about the chances of a deal but that \u0026#34;I can feel the cracks of optimism coming through\u0026#34;.\u003c/p\u003e\u003cp\u003eEyal Kalderon - the cousin of 54-year-old Ofer Kalderon, two of whose children were among the 105 hostages released from captivity in November - said in a voice note sent to BBC OS: \u0026#34;We are hoping that the deal will be closed soon and we will reach the moment that we are hugging Ofer, that his four children are hugging him.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;We want this deal to include all the hostages, all the 98 hostages. We are demanding that. We are just hoping to see all of them in Israeli [territory].\u0026#34;\u003c/p\u003e\u003cp\u003eLee Siegel - the brother of Keith Siegel, 64, whose wife Aviva was also released in November - insisted: \u0026#34;All of the hostages must come home - those who are still alive, to work on rebuilding their lives and their families; those who are deceased, for a proper burial in their home country.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/308b/live/662f0b00-d2b4-11ef-94cb-5f844ceb9e30.jpg.webp\" alt=\"Daniel Lifshitz Oded Lifshitz and his wife Yocheved\"/\u003e\u003cspan\u003eDaniel Lifshitz\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eOded Lifshitz and his wife Yocheved were both taken hostage on 7 October 2023, but Yocheved was released after several weeks in captivity in Gaza\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSome families of hostages not included in the initial releases expressed anger that their relatives might be left behind if the deal falters at a later stage.\u003c/p\u003e\u003cp\u003eRuby Chen\u0026#39;s son, Itay, was killed during the 7 October 2023 attack and his body is being held in Gaza.\u003c/p\u003e\u003cp\u003e\u0026#34;The prime minister unfortunately is moving ahead with a deal that does not include my son and 65 additional hostages, where it is not known how my son is going to come out. And for most of the families this deal is unacceptable,\u0026#34; he said.\u003c/p\u003e\u003cp\u003ePrime Minister Benjamin Netanyahu is facing opposition from far-right cabinet ministers and some in his own party, who object to prisoner releases and a wider ceasefire deal. \u003c/p\u003e\u003cp\u003eSharon Lifshitz said a majority of Israelis had supported such a deal for a \u0026#34;very long time\u0026#34;, but that a combined pressure from the administrations of outgoing US President Joe Biden and President-elect Donald Trump had finally given Netanyahu\u0026#39;s government the \u0026#34;extra push\u0026#34; it needed.\u003c/p\u003e\u003cp\u003e\u0026#34;It appears that this deal is very much the deal that was on the table in July,\u0026#34; she added. \u0026#34;Many, many hostages died since July. Soldiers, Palestinians. So much suffering.\u0026#34;\u003c/p\u003e\u003cp\u003eSpeaking later on Tuesday, Foreign Minister Gideon Saar said he was confident a majority in the Israeli government would support a deal.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMeanwhile Blinken - approaching the end of his tenure as US secretary of state - laid out for the first time the plan the Biden administration wants to hand over to Trump for post-war Gaza.  \u003c/p\u003e\u003cp\u003eIt did not envisage immediate full control of Gaza by the Palestinian Authority (PA) – the entity created by the Oslo accords that has limited governance in parts of the occupied West Bank. \u003c/p\u003e\u003cp\u003eCritically, Gaza\u0026#39;s security forces would be comprised of personnel from other countries – most likely Arab states although he didn\u0026#39;t name them - alongside \u0026#34;vetted\u0026#34; Palestinian forces.\u003c/p\u003e\u003cp\u003eBlinken said, as he has before, that Hamas had sought to spark a regional war and derail US-led efforts to integrate Israel and its Arab neighbours. \u003c/p\u003e\u003cp\u003eMeanwhile Israel, he said, had pursued its military campaign \u0026#34;past the point\u0026#34; of destroying Hamas\u0026#39; military capacity and killing its leaders responsible for the 7 October attack. \u003c/p\u003e\u003cp\u003eHe suggested this was self defeating, adding that the US assessed Hamas had recruited almost as many new militants as Israel had killed.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIsrael launched a campaign to destroy Hamas in response to the group\u0026#39;s 7 October 2023 attack, in which about 1,200 people were killed and 251 others were taken hostage.\u003c/p\u003e\u003cp\u003eMore than 46,640 people have been killed in Gaza since then, according to the territory\u0026#39;s Hamas-run health ministry. Most of the 2.3 million population has also been displaced, there is widespread destruction, and there are severe shortages of food, fuel, medicine and shelter due to an struggle to get aid to those in need.\u003c/p\u003e\u003cp\u003eIsrael says 94 of the hostages are still being held by Hamas, of whom 34 are presumed dead. In addition, there are four Israelis who were abducted before the war, two of whom are dead.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-14T20:59:16.237Z",
  "modifiedTime": null
}
