{
  "id": "ec90d83d-0f30-469b-b092-9f22d5e86be7",
  "title": "'We have a deal with Russia': Trump accuses Zelenskyy of derailing peace",
  "link": "https://timesofindia.indiatimes.com/world/us/we-have-a-deal-with-russia-trump-accuses-zelenskyy-of-derailing-peace-in-ukraine-war/articleshow/120566267.cms",
  "description": "Donald Trump thinks Russia is ready to make a peace deal to end the Ukraine conflict. He blames Volodymyr Zelenskyy for the delay. Trump criticised Zelenskyy for rejecting any agreement that legitimises Russia’s annexation of Crimea. Zelenskyy says Ukraine's constitution does not allow surrendering territory. Relations between Trump and Zelenskyy worsened after a heated meeting.",
  "author": "TOI World Desk",
  "published": "2025-04-24T05:33:46+05:30",
  "source": "https://timesofindia.indiatimes.com/rssfeeds/296589292.cms",
  "categories": null,
  "byline": "TOI World Desk",
  "length": 1882,
  "excerpt": "US News: Donald Trump thinks Russia is ready to make a peace deal to end the Ukraine conflict. He blames Volodymyr Zelenskyy for the delay. Trump criticised Ze",
  "siteName": "Times Of India",
  "favicon": "https://m.timesofindia.com/touch-icon-ipad-retina-precomposed.png",
  "text": "US president Donald Trump said on Wednesday that he believed Russia was ready to strike a peace deal to end the ongoing conflict in Ukraine, but blamed Ukrainian president Volodymyr Zelenskyy for holding up progress.Speaking from the Oval Office, Trump said, “I think we have a deal with Russia. We have to get a deal with Zelensky. I thought it might be easier to deal with Zelensky. So far it’s been harder,” news agency AFP quoted him as saying.Trump Believes He's Reached A Deal With Russia Earlier the same day, Trump took to Truth Social to criticise Zelenskyy for rejecting any agreement that legitimises Russia’s annexation of Crimea, which occurred in 2014. Trump called this stance “very harmful” to peace efforts and accused Zelenskyy of making “inflammatory statements” that have stalled negotiations., Zelenskyy, however, has remained firm. Speaking at a press event on Tuesday, he reiterated that Ukraine’s constitution does not allow for the surrender of its territory. “There’s nothing to talk about here,” he said, referring to Crimea. Relations between the two leaders worsened after a heated Oval Office meeting in February. Trump reportedly raised his voice and accused Zelenskyy of risking global conflict. In response, Trump paused military aid to Ukraine, including intelligence sharing. Meanwhile, efforts to broker peace through high-level diplomatic meetings have faltered. US officials Marco Rubio and Steve Witkoff withdrew from scheduled talks in London, weakening the prospects of a near-term agreement. Despite this, Ukrainian officials, including presidential chief of staff Andriy Yermak, continued to meet with Western allies in the UK. Zelenskyy later acknowledged that “emotions have run high” but stressed the importance of dialogue. “Each side contributed meaningfully,” he posted online. “It is this joint work that can lead to lasting peace.”",
  "image": "https://static.toiimg.com/thumb/msid-120566367,width-1070,height-580,imgsize-23774,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-articlebody=\"1\"\u003e\u003cdiv data-ua-type=\"1\" onclick=\"stpPgtnAndPrvntDefault(event)\"\u003e\u003cp\u003e\u003cimg src=\"https://static.toiimg.com/thumb/msid-120566367,imgsize-23774,width-400,resizemode-4/Untitled-design-2025-04-16T094315-412.jpg\" alt=\"\u0026#39;We have a deal with Russia\u0026#39;: Trump accuses Zelenskyy of derailing peace in Ukraine war\" title=\"AP photo\" decoding=\"async\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e US president \u003ca href=\"https://timesofindia.indiatimes.com/topic/donald-trump\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eDonald Trump\u003c/a\u003e said on Wednesday that he believed Russia was ready to strike a peace deal to end the ongoing conflict in Ukraine, but blamed Ukrainian president \u003ca href=\"https://timesofindia.indiatimes.com/topic/volodymyr-zelenskyy\" styleobj=\"[object Object]\" commonstate=\"[object Object]\" frmappuse=\"1\"\u003eVolodymyr Zelenskyy\u003c/a\u003e for holding up progress.\u003cbr/\u003eSpeaking from the Oval Office, Trump said, “I think we have a deal with Russia. We have to get a deal with Zelensky. I thought it might be easier to deal with Zelensky. So far it’s been harder,” news agency AFP quoted him as saying.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTrump Believes He\u0026#39;s Reached A Deal With Russia\u003c/p\u003e\u003c/div\u003e\u003cp\u003e Earlier the same day, Trump took to Truth Social to criticise Zelenskyy for rejecting any agreement that legitimises Russia’s annexation of Crimea, which occurred in 2014. Trump called this stance “very harmful” to peace efforts and accused Zelenskyy of making “inflammatory statements” that have stalled negotiations.\u003c/p\u003e\u003cdiv data-pos=\"0\"\u003e\u003cp\u003e\u003cimg alt=\"Screenshot 2025-04-24 054442\" msid=\"120566436\" width=\"600\" title=\",\" placeholdersrc=\"https://static.toiimg.com/photo/83033472.cms\" imgsize=\"23456\" resizemode=\"4\" offsetvertical=\"0\" placeholdermsid=\"\" type=\"thumb\" src=\"https://static.toiimg.com/photo/83033472.cms\" data-src=\"https://static.toiimg.com/thumb/imgsize-23456,msid-120566436,width-600,resizemode-4/screenshot-2025-04-24-054442.jpg\" data-api-prerender=\"true\"/\u003e\u003c/p\u003e\u003cp\u003e,\u003c/p\u003e\u003c/div\u003e\u003cp\u003e Zelenskyy, however, has remained firm. Speaking at a press event on Tuesday, he reiterated that Ukraine’s constitution does not allow for the surrender of its territory. “There’s nothing to talk about here,” he said, referring to Crimea.\u003cbr/\u003e Relations between the two leaders worsened after a heated Oval Office meeting in February. Trump reportedly raised his voice and accused Zelenskyy of risking global conflict. In response, Trump paused military aid to Ukraine, including intelligence sharing.\u003cbr/\u003e Meanwhile, efforts to broker peace through high-level diplomatic meetings have faltered. US officials Marco Rubio and Steve Witkoff withdrew from scheduled talks in London, weakening the prospects of a near-term agreement. Despite this, Ukrainian officials, including presidential chief of staff Andriy Yermak, continued to meet with Western allies in the UK.\u003cbr/\u003e Zelenskyy later acknowledged that “emotions have run high” but stressed the importance of dialogue. “Each side contributed meaningfully,” he posted online. “It is this joint work that can lead to lasting peace.”\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-24T05:33:00+05:30",
  "modifiedTime": null
}
