{
  "id": "07c1383f-1f25-4fb4-a137-c741f98ab76b",
  "title": "You Can Now Give ChatGPT Specific Personality Traits—Here's How It Works",
  "link": "https://www.makeuseof.com/how-assign-chatgpt-specific-personality-traits/",
  "description": "It's easier than ever to have unique, highly-tailored ChatGPT responses.",
  "author": "Yasir Mahmood",
  "published": "Sun, 26 Jan 2025 23:34:19 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Technology Explained",
    "ChatGPT",
    "Artificial Intelligence"
  ],
  "byline": "Yasir Mahmood",
  "length": 18362,
  "excerpt": "It's easier than ever to have unique, highly-tailored ChatGPT responses.",
  "siteName": "MakeUseOf",
  "favicon": "https://www.makeuseof.com/public/build/images/favicon-240x240.df310da5.png",
  "text": "ChatGPT Sign in to your MUO account Quick Links What Are ChatGTP's Personality Traits? How to Customize ChatGPT’s Personality Traits Try Giving ChatGPT These 3 New Traits For Even Better Responses ChatGPT is evolving, bringing even more flexibility to users' interactions with AI. With the ability to customize its personality traits, you can now shape ChatGPT’s responses to better match your needs and preferences, promising more tailored conversations. What Are ChatGTP's Personality Traits? Specifying personality traits for ChatGPT allows you to customize how the AI chatbot interacts with you. You can give it a name to call you and describe the traits you want it to exhibit, such as being chatty, witty, and encouraging, or transform ChatGPT into a Gen Z, opinionated chatbot. While it’s tempting to go all out and add a long list of desired traits immediately, I found it easier to start simple. Begin with just a few key characteristics and refine them as you interact with ChatGPT more. You can always edit the traits later to fine-tune ChatGPT’s persona. You need to create separate chats for different needs, as the traits are enabled only for new chats. How to Customize ChatGPT’s Personality Traits Tailoring ChatGPT’s personality is a straightforward process. Click on your profile picture and select Customize ChatGPT. Fill in the “What should ChatGPT call you?” and “What traits should ChatGPT have?” fields to give ChatGPT context about you. You can also use the checkboxes to select the traits you want ChatGPT to exhibit. Toggle on “Enable for new chats” and click Save. At the time of writing, the specific personality traits based on the new UI are not yet available on mobile. However, OpenAI has stated that it will roll out this feature to mobile and MacOS in the next few weeks. Once available, you might look for the Customize ChatGPT option in the app’s settings or menu and follow the prompts to set your desired traits. You can always modify these traits later as you refine your preferred ChatGPT persona. Try Giving ChatGPT These 3 New Traits For Even Better Responses The new personality customization options give you more control over the tone, style, and depth of responses so that ChatGPT’s responses don’t go wild. After experimenting, here are three traits I’ve found particularly useful for getting more preferred responses. Analytical and Detail-Oriented If you want precise and well-reasoned answers, setting ChatGPT to be “analytical” and “detail-oriented” is a great choice. For example, I asked, “How can I improve my home budget?” and got this response: “Start by categorizing your expenses—essentials like rent, groceries, and utilities. Then, track discretionary spending like subscriptions or dining out. Use apps like Mint or YNAB to visualize patterns. Finally, set clear savings goals and automate them to stay consistent.” This trait combination is perfect for tasks like breaking down complex problems, creating actionable plans, or maybe when you need an in-depth explanation. Straight-Shooting and Opinionated Need clarity or a no-nonsense answer? The “straight-shooting” and “opinionated” traits make ChatGPT reach the point. For example, I asked, “Is remote work better than office work?” and received: “It depends on your personality. Introverts might thrive at home, but remote work isn’t for everyone—offices still offer collaboration benefits. For me? Remote all the way.” This setup is great when looking for direct answers and confident opinions without unnecessary fluff. Forward-Thinking When you need motivation or advice, “forward-thinking” traits work wonders. I tested this by asking, “How can I overcome procrastination?” ChatGPT replied: “Start small! Tackle one task today, and reward yourself after. Imagine how great it’ll feel to achieve your goals—your future self will thank you!” This combination makes ChatGPT a supportive partner for tackling challenges or planning for the future. It’s ideal for personal development or when morale needs to be boosted. The personality customization feature, while still new, offers exciting possibilities for tailoring ChatGPT to your unique needs and preferences. As OpenAI continues to refine and expand these options, I expect we’ll see even more creative and productive uses emerge and set ChatGPT to complete tasks.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/08/chatgpt-user-experience-design-elements-with-openai-logos.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n        \n        \n        \n\n\n\n\n\n            \u003carticle\u003e\n\n        \n                \n    \n\n\n\n    \n    \n    \n        \n           \u003cheader\u003e\n            \n                                                \n\n\n    \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n\n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                    \n\n        \u003ca href=\"https://www.makeuseof.com/tag/chatgpt/\"\u003e\u003cspan\u003eChatGPT\u003c/span\u003e\u003c/a\u003e\n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F678b3af63a67c-Yasir%20Valnet.png?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n\n            \u003ca id=\"login-button-article-sidebar\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                                            \n                                                                \n    \n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/header\u003e\n\n                            \n        \n\n        \n                                        \n                                \n            \n                        \n        \n        \n\n    \n            \n    \n                                                            \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                            \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n                                                    \n                        \n    \n                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n               \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                                                                                                                                                                                                                                            \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n                                                        \n                                \n                                \n                                                \n            \n        \n    \n        \n                                                                                                                                                                    \n            \n    \n    \n        \n                    \n                        \n                                    \u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e        \u003cdiv\u003e\n        \u003ch3\u003eQuick Links\u003c/h3\u003e\n        \u003cdiv\u003e\n                                                                                                    \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#what-are-chatgtp-39-s-personality-traits\"\u003eWhat Are ChatGTP\u0026#39;s Personality Traits?\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#how-to-customize-chatgpt-rsquo-s-personality-traits\"\u003eHow to Customize ChatGPT’s Personality Traits\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#try-giving-chatgpt-these-3-new-traits-for-even-better-responses\"\u003eTry Giving ChatGPT These 3 New Traits For Even Better Responses\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n            \n            \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eChatGPT is evolving, bringing even more flexibility to users\u0026#39; interactions with AI. With the ability to customize its personality traits, you can now shape ChatGPT’s responses to better match your needs and preferences, promising more tailored conversations.\u003c/p\u003e    \u003ch2 id=\"what-are-chatgtp-39-s-personality-traits\"\u003e\n                        What Are ChatGTP\u0026#39;s Personality Traits?\n               \u003c/h2\u003e\n\u003cp\u003eSpecifying personality traits for ChatGPT allows you to customize how the AI chatbot interacts with you. You can give it a name to call you and describe the traits you want it to exhibit, such as being chatty, witty, and encouraging, or \u003ca href=\"https://www.makeuseof.com/customize-chatgpt-traits-new-settings-menu/\" target=\"_blank\"\u003etransform ChatGPT into a Gen Z, opinionated chatbot\u003c/a\u003e.\u003c/p\u003e    \n\u003cp\u003eWhile it’s tempting to go all out and add a long list of desired traits immediately, I found it easier to start simple. Begin with just a few key characteristics and refine them as you interact with ChatGPT more. You can always edit the traits later to fine-tune ChatGPT’s persona.\u003c/p\u003e    \n\n\u003cdiv id=\"custom_block_4\"\u003e\n\n        \n            \u003cp\u003eYou need to create separate chats for different needs, as the traits are enabled only for new chats.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"how-to-customize-chatgpt-rsquo-s-personality-traits\"\u003e\n                        How to Customize ChatGPT’s Personality Traits\n               \u003c/h2\u003e\n\u003cp\u003eTailoring ChatGPT’s personality is a straightforward process. \u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        Click on your profile picture and select \u003cstrong\u003eCustomize ChatGPT\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Fill in the “What should ChatGPT call you?” and “What traits should ChatGPT have?” fields to give ChatGPT context about you.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        You can also use the checkboxes to select the traits you want ChatGPT to exhibit.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Toggle on “Enable for new chats” and click \u003cstrong\u003eSave\u003c/strong\u003e.\n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                \n    \n\n\u003cp\u003eAt the time of writing, the specific personality traits based on the new UI are not yet available on mobile. However, \u003ca href=\"https://x.com/OpenAI/status/1880323050798973295\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eOpenAI\u003c/a\u003e has stated that it will roll out this feature to mobile and MacOS in the next few weeks.\u003c/p\u003e    \n\u003cp\u003eOnce available, you might look for the \u003cstrong\u003eCustomize ChatGPT\u003c/strong\u003e option in the app’s settings or menu and follow the prompts to set your desired traits. You can always modify these traits later as you refine your preferred ChatGPT persona.\u003c/p\u003e    \u003ch2 id=\"try-giving-chatgpt-these-3-new-traits-for-even-better-responses\"\u003e\n                        Try Giving ChatGPT These 3 New Traits For Even Better Responses\n               \u003c/h2\u003e\n\u003cp\u003eThe new personality customization options give you more control over the tone, style, and depth of responses so that \u003ca href=\"https://www.makeuseof.com/chatgpt-hot-takes-wild-responses/\" target=\"_blank\"\u003eChatGPT’s responses don’t go wild\u003c/a\u003e. After experimenting, here are three traits I’ve found particularly useful for getting more preferred responses.\u003c/p\u003e    \u003ch3 id=\"analytical-and-detail-oriented\"\u003e\n            Analytical and Detail-Oriented\n    \u003c/h3\u003e\n\n\u003cp\u003eIf you want precise and well-reasoned answers, setting ChatGPT to be “analytical” and “detail-oriented” is a great choice. For example, I asked, “How can I improve my home budget?” and got this response:\u003c/p\u003e    \u003cblockquote\u003e\n                        \n\u003cp\u003e“Start by categorizing your expenses—essentials like rent, groceries, and utilities. Then, track discretionary spending like subscriptions or dining out. Use apps like Mint or YNAB to visualize patterns. Finally, set clear savings goals and automate them to stay consistent.”\u003c/p\u003e    \n            \u003c/blockquote\u003e\n\u003cp\u003eThis trait combination is perfect for tasks like breaking down complex problems, creating actionable plans, or maybe when you need an in-depth explanation.\u003c/p\u003e    \u003ch3 id=\"straight-shooting-and-opinionated\"\u003e\n            Straight-Shooting and Opinionated\n    \u003c/h3\u003e\n\n\u003cp\u003eNeed clarity or a no-nonsense answer? The “straight-shooting” and “opinionated” traits make ChatGPT reach the point. For example, I asked, “Is remote work better than office work?” and received:\u003c/p\u003e    \u003cblockquote\u003e\n                        \n\u003cp\u003e“It depends on your personality. Introverts might thrive at home, but remote work isn’t for everyone—offices still offer collaboration benefits. For me? Remote all the way.”\u003c/p\u003e    \n            \u003c/blockquote\u003e\n\u003cp\u003eThis setup is great when looking for direct answers and confident opinions without unnecessary fluff.\u003c/p\u003e    \u003ch3 id=\"forward-thinking\"\u003e\n            Forward-Thinking\n    \u003c/h3\u003e\n\n\u003cp\u003eWhen you need motivation or advice, “forward-thinking” traits work wonders. I tested this by asking, “How can I overcome procrastination?” ChatGPT replied:\u003c/p\u003e    \u003cblockquote\u003e\n                        \n\u003cp\u003e“Start small! Tackle one task today, and reward yourself after. Imagine how great it’ll feel to achieve your goals—your future self will thank you!”\u003c/p\u003e    \n            \u003c/blockquote\u003e\n\u003cp\u003eThis combination makes ChatGPT a supportive partner for tackling challenges or planning for the future. It’s ideal for personal development or when morale needs to be boosted.\u003c/p\u003e    \n\u003cp\u003eThe personality customization feature, while still new, offers exciting possibilities for tailoring ChatGPT to your unique needs and preferences. As OpenAI continues to refine and expand these options, I expect we’ll see even more creative and productive uses emerge and \u003ca href=\"https://www.makeuseof.com/chatgpt-scheduled-tasks-tips/\" target=\"_blank\"\u003eset ChatGPT to complete tasks\u003c/a\u003e.\u003c/p\u003e    \u003c/div\u003e\n    \n                \n        \n        \n\n\n        \n\n\n\n\n\n                    \n        \n    \u003c/article\u003e\n\n    \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "20 min read",
  "publishedTime": "2025-01-26T23:34:19Z",
  "modifiedTime": "2025-01-26T23:34:19Z"
}
