{
  "id": "17723281-069f-47b4-837a-600df1d084d0",
  "title": "I Hacked My Household Chores With This Overlooked iPhone Tool",
  "link": "https://www.makeuseof.com/i-hacked-my-household-chores-with-this-overlooked-iphone-tool/",
  "description": "Hack household chores with this digital magnifying glass in your pocket.",
  "author": "Saikat Basu",
  "published": "Sat, 05 Apr 2025 18:00:15 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "IPhone",
    "iPhone Tips",
    "iOS Apps",
    "Productivity Tricks"
  ],
  "byline": "Saikat Basu",
  "length": 9741,
  "excerpt": "Hack household chores with this digital magnifying glass in your pocket.",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "The iPhone's Magnifier app is more powerful than we realize. I started using it to read tiny labels on medicine bottles. I ended up discovering a dozen ways it can make everyday life easier. 1 Decipher Unreadable Labels on Medicine Bottles Let's start where my Magnifier journey began. Prescription labels and supplement bottles often use tiny fonts to fit everything in the corner. Ensuring the right composition, instructions, and expiration date is critical. The Magnifier is a digital magnifying glass and an image-to-text OCR tool. Tap on Capture and then select the Reader icon to display the text. Tap the Text button (double-A) and adjust readability by tweaking the text's font, size, and color. To hear the text spoken aloud, tap on Listen. The Magnifier makes the iPhone user-friendly for seniors. But it's also handy for reading tiny fine print on everyday items like insurance policies, clothing care labels, and ingredient lists on food packaging. 2 Find Dust in Hard-to-Reach Places Keyboards, vents, remote controls—dust hides where your eyes can't easily go. You can easily use the Magnifier to zoom into tiny crevices and spot what needs proper cleaning. It's convenient for finding lint in charging ports or headphone jacks. Boost the view by sliding the Contrast levels, which helps the foreground object stand out. Of course, I am always careful not to lose my grip on the phone and let it slip from my hands. 3 Check for Leftover Stickers and Residue Whether repurposing jars or unboxing new electronics, you'll often find half-peeled stickers or leftover gunk (for instance, on a car windshield) that's hard to spot. Use the Magnifier with increased contrast settings to see and scrape off every bit of residue. Blame my perfectionism, but I also use the Magnifier to check for tiny bubbles after applying a screen protector on a new phone. 4 Detect Tiny Splinters or Cuts on the Skin If you've ever gotten a splinter but couldn't tell if it was still in your finger, Magnifier is your new best friend. It helps zoom into cuts, scrapes, or irritated skin to assess what's happening without grabbing a flashlight and mirror. Remember, the Magnifier works just as well with the front camera if you want to do some self-inspection around your face. The Magnifier is not a medical device. Please seek a doctor's advice for injuries. 5 Look Into Awkward Corners Without Twisting Your Neck Some places are nearly impossible to peek into, from under the couch to behind the washing machine. The iPhone's flashlight, combined with the Magnifier, lets you check for fallen items, dust bunnies, or pests without crawling on the floor. The Magnifier's Contrast filters have become my secret weapon for this chore. By adjusting the colors (try the Red filter) and sweeping the camera over the area, I can make the lost item pop against the background. Earrings, screws, or stapler pins... you'll be surprised what suddenly becomes visible. If you use a specific Magnifier setting frequently, save it as an Activity. It's like a pre-set for specific activities you perform with the Magnifier. The Magnifier remembers the last settings used; booking each as an Activity helps to organize the settings for their unique use. I wanted to buy one of those field microscopes for my niece. Then, one afternoon, I handed my phone to my niece and opened the Magnifier. She ended up exploring the backyard, inspecting bugs, leaves, and bark textures up close. It's like giving them a \"free\" microscope on a familiar device kids use for YouTube and TikTok shorts. And they can always use it to bear down on something and take nice macro photos of common objects. The Magnifier can zoom up to 10x. Zoom levels can be adjusted with a swipe on the screen instead of using the slider. 7 Read Serial Numbers and Model Info on Devices Serial numbers are often printed in the tiniest fonts on the backs or bottoms of electronics. Instead of grabbing a magnifying glass, launch the app and zoom in. You can use Capture to take a photo or to jot things down before sharing it with technical support. 8 Spot Fine Fabric Damage or Stains We often don't notice tiny tears and upholstery stains. The Magnifier can catch what our eyes might miss, especially on patterned or textured surfaces. It's a subtle but helpful tool for understanding clothing care instructions. I occasionally use it to zoom in on counterfeit logos and lousy stitching. 9 Snap Photos Without Saving Them The Magnifier is ideal for capturing impromptu photos without saving them in the Photos app. You can click single or multiple images and share them directly from the app. Tap on Capture directly to click a single photo. Alternatively, you can tap the two-overlapping rectangle icons to enable the Multipart mode and click multiple shots in one go. You can also save the images in your Photos app via Save Image under the Share options. 10 Read Cooking Instructions Without Squinting Frozen foods and sauce jars often have microscopic cooking instructions or expiration dates. Rather than bringing them to the brightest room in the house, point your iPhone at the label, zoom in, and adjust brightness or filters if necessary. If tour eyesight is poor, use the magnification to read the graduated levels on measuring jars. The OCR behind the Magnifier can read neat, handwritten text but fails with the messier ones. 11 Document Flaws for Customer Support Shopping online? Before returning a defective item, use the Magnifier to photograph the cracks, discoloration, or stitching issues and add them to your feedback. This way, you can document the proof, which no support team can deny. 12 Turn It Into a DIY Helper From checking if a screw fits correctly into a small part to confirming whether glue has dried, the Magnifier is handy for DIY projects, arts, crafts, or tech repairs. It's especially useful for anything involving fine details. Here are a few more ideas to put it into everyday use: Thread needles effortlessly by zooming in on the eye. Assemble tiny tech parts like watch batteries or MacBook screws. Inspect solder paste on electronics for cracks, gaps, or uneven application. Find ports on any device in the dark or a difficult-to-reach place. Closely examine 3D prints for defects and troubleshooting. Use it as a hand mirror after eating at a restaurant. If the Magnifier goes on to make your life easier, tweak a few settings to make it quicker to access. The suggestions below apply to iPhone 16 and iOS 18 onwards but should be workable on older iPhone models, too. The Magnifier app is available by default in the Control Center or the App Library. The other quick ways to launch the Magnifier instantly include triple-clicking the side button (on iPhones with Face ID) or the Home button (on older iPhones). You can also prompt Siri to launch the tool. The Magnifier app isn't just for those with vision impairments. iPhone Pro models with the LiDAR Scanner have more accessibility advantages like people and door detection while scanning your surroundings. But the basic Magnifier is still a good app that extends the use of the iPhone's camera, helping you solve everyday problems.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/04/ios-magnifier.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eThe iPhone\u0026#39;s \u003cstrong\u003eMagnifier\u003c/strong\u003e app is more powerful than we realize. I started using it to read tiny labels on medicine bottles. I ended up discovering a dozen ways it can make everyday life easier.\u003c/p\u003e    \u003ch2 id=\"decipher-unreadable-labels-on-medicine-bottles\"\u003e\n            \u003cspan\u003e1 \u003c/span\u003e\n        \u003cspan\u003e\n                            Decipher Unreadable Labels on Medicine Bottles\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eLet\u0026#39;s start where my Magnifier journey began. Prescription labels and supplement bottles often use tiny fonts to fit everything in the corner. Ensuring the right composition, instructions, and expiration date is critical.\u003c/p\u003e    \n\u003cp\u003eThe Magnifier is a digital magnifying glass and an image-to-text OCR tool. Tap on \u003cstrong\u003eCapture\u003c/strong\u003e and then select the \u003cstrong\u003eReader\u003c/strong\u003e icon to display the text.\u003c/p\u003e    \n\u003cp\u003eTap the Text button (double-A) and adjust readability by tweaking the text\u0026#39;s font, size, and color. To hear the text spoken aloud, tap on \u003cstrong\u003eListen\u003c/strong\u003e.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                    \n    \n\n\n\u003cdiv id=\"custom_block_6\" data-nosnippet=\"\"\u003e\n\n        \n            \u003cp\u003eThe Magnifier \u003ca href=\"https://www.makeuseof.com/tag/iphone-for-seniors-tweaks/\" target=\"_blank\"\u003emakes the iPhone user-friendly for seniors\u003c/a\u003e. But it\u0026#39;s also handy for reading tiny fine print on everyday items like insurance policies, clothing care labels, and ingredient lists on food packaging.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"find-dust-in-hard-to-reach-places\"\u003e\n            \u003cspan\u003e2 \u003c/span\u003e\n        \u003cspan\u003e\n                            Find Dust in Hard-to-Reach Places\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eKeyboards, vents, remote controls—dust hides where your eyes can\u0026#39;t easily go. You can easily use the Magnifier to zoom into tiny crevices and spot what needs proper cleaning.\u003c/p\u003e    \n\u003cp\u003eIt\u0026#39;s convenient for finding lint in charging ports or headphone jacks. Boost the view by sliding the \u003cstrong\u003eContrast\u003c/strong\u003e levels, which helps the foreground object stand out.\u003c/p\u003e    \n\u003cp\u003eOf course, I am always careful not to lose my grip on the phone and let it slip from my hands.\u003c/p\u003e    \u003ch2 id=\"check-for-leftover-stickers-and-residue\"\u003e\n            \u003cspan\u003e3 \u003c/span\u003e\n        \u003cspan\u003e\n                            Check for Leftover Stickers and Residue\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eWhether repurposing jars or unboxing new electronics, you\u0026#39;ll often find half-peeled stickers or leftover gunk (for instance, on a car windshield) that\u0026#39;s hard to spot. Use the Magnifier with increased contrast settings to see and scrape off every bit of residue.\u003c/p\u003e    \n\u003cp\u003eBlame my perfectionism, but I also use the Magnifier to check for tiny bubbles after applying a screen protector on a new phone.\u003c/p\u003e    \u003ch2 id=\"detect-tiny-splinters-or-cuts-on-the-skin\"\u003e\n            \u003cspan\u003e4 \u003c/span\u003e\n        \u003cspan\u003e\n                            Detect Tiny Splinters or Cuts on the Skin\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eIf you\u0026#39;ve ever gotten a splinter but couldn\u0026#39;t tell if it was still in your finger, Magnifier is your new best friend. It helps zoom into cuts, scrapes, or irritated skin to assess what\u0026#39;s happening without grabbing a flashlight and mirror.\u003c/p\u003e    \n\u003cp\u003eRemember, the Magnifier works just as well with the front camera if you want to do some self-inspection around your face.\u003c/p\u003e    \n\n\u003cdiv id=\"custom_block_17\" data-nosnippet=\"\"\u003e\n\n        \n            \u003cp\u003eThe Magnifier is not a medical device. Please seek a doctor\u0026#39;s advice for injuries.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"look-into-awkward-corners-without-twisting-your-neck\"\u003e\n            \u003cspan\u003e5 \u003c/span\u003e\n        \u003cspan\u003e\n                            Look Into Awkward Corners Without Twisting Your Neck\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eSome places are nearly impossible to peek into, from under the couch to behind the washing machine. The iPhone\u0026#39;s flashlight, combined with the Magnifier, lets you check for fallen items, dust bunnies, or pests without crawling on the floor.\u003c/p\u003e    \n\u003cp\u003eThe Magnifier\u0026#39;s \u003cstrong\u003eContrast\u003c/strong\u003e filters have become my secret weapon for this chore. By adjusting the colors (try the \u003cstrong\u003eRed\u003c/strong\u003e filter) and sweeping the camera over the area, I can make the lost item pop against the background. Earrings, screws, or stapler pins... you\u0026#39;ll be surprised what suddenly becomes visible.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\n\n\u003cdiv id=\"custom_block_22\" data-nosnippet=\"\"\u003e\n\n        \n            \u003cp\u003eIf you use a specific Magnifier setting frequently, save it as an \u003cstrong\u003eActivity\u003c/strong\u003e. It\u0026#39;s like a pre-set for specific activities you perform with the Magnifier. The Magnifier remembers the last settings used; booking each as an Activity helps to organize the settings for their unique use.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\n\u003cp\u003eI wanted to buy one of those field microscopes for my niece. Then, one afternoon, I handed my phone to my niece and opened the Magnifier. She ended up exploring the backyard, inspecting bugs, leaves, and bark textures up close.\u003c/p\u003e    \n\u003cp\u003eIt\u0026#39;s like giving them a \u0026#34;free\u0026#34; microscope on a familiar device kids use for YouTube and TikTok shorts. And they can always use it to bear down on something and \u003ca href=\"https://www.makeuseof.com/iphone-16-macro-photography/\" target=\"_blank\"\u003etake nice macro photos of common objects\u003c/a\u003e.\u003c/p\u003e    \n\u003cp\u003eThe Magnifier can zoom up to 10x. Zoom levels can be adjusted with a swipe on the screen instead of using the slider.\u003c/p\u003e    \u003ch2 id=\"read-serial-numbers-and-model-info-on-devices\"\u003e\n            \u003cspan\u003e7 \u003c/span\u003e\n        \u003cspan\u003e\n                            Read Serial Numbers and Model Info on Devices\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eSerial numbers are often printed in the tiniest fonts on the backs or bottoms of electronics. Instead of grabbing a magnifying glass, launch the app and zoom in.\u003c/p\u003e    \n\u003cp\u003eYou can use Capture to take a photo or to jot things down before sharing it with technical support.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\u003ch2 id=\"spot-fine-fabric-damage-or-stains\"\u003e\n            \u003cspan\u003e8 \u003c/span\u003e\n        \u003cspan\u003e\n                            Spot Fine Fabric Damage or Stains\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eWe often don\u0026#39;t notice tiny tears and upholstery stains. The Magnifier can catch what our eyes might miss, especially on patterned or textured surfaces.\u003c/p\u003e    \n\u003cp\u003eIt\u0026#39;s a subtle but helpful tool for understanding clothing care instructions. I occasionally use it to zoom in on counterfeit logos and lousy stitching.\u003c/p\u003e    \u003ch2 id=\"snap-photos-without-saving-them\"\u003e\n            \u003cspan\u003e9 \u003c/span\u003e\n        \u003cspan\u003e\n                            Snap Photos Without Saving Them\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eThe Magnifier is ideal for capturing impromptu photos without saving them in the Photos app. You can click single or multiple images and share them directly from the app. Tap on Capture directly to click a single photo.\u003c/p\u003e    \n\u003cp\u003eAlternatively, you can tap the two-overlapping rectangle icons to enable the Multipart mode and click multiple shots in one go.\u003c/p\u003e    \n\u003cp\u003eYou can also save the images in your Photos app via \u003cstrong\u003eSave Image\u003c/strong\u003e under the Share options.\u003c/p\u003e    \n\n\n\n    \n\n\n\n                                                                                                                                                                                \n    \n\u003ch2 id=\"read-cooking-instructions-without-squinting\"\u003e\n            \u003cspan\u003e10 \u003c/span\u003e\n        \u003cspan\u003e\n                            Read Cooking Instructions Without Squinting\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eFrozen foods and sauce jars often have microscopic cooking instructions or expiration dates. Rather than bringing them to the brightest room in the house, point your iPhone at the label, zoom in, and adjust brightness or filters if necessary. If tour eyesight is poor, use the magnification to read the graduated levels on measuring jars.\u003c/p\u003e    \n\n\u003cdiv id=\"custom_block_41\" data-nosnippet=\"\"\u003e\n\n        \n            \u003cp\u003eThe OCR behind the Magnifier can read neat, handwritten text but fails with the messier ones.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"document-flaws-for-customer-support\"\u003e\n            \u003cspan\u003e11 \u003c/span\u003e\n        \u003cspan\u003e\n                            Document Flaws for Customer Support\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eShopping online? Before returning a defective item, use the Magnifier to photograph the cracks, discoloration, or stitching issues and add them to your feedback. This way, you can document the proof, which no support team can deny.\u003c/p\u003e    \u003ch2 id=\"turn-it-into-a-diy-helper\"\u003e\n            \u003cspan\u003e12 \u003c/span\u003e\n        \u003cspan\u003e\n                            Turn It Into a DIY Helper\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eFrom checking if a screw fits correctly into a small part to confirming whether glue has dried, the Magnifier is handy for DIY projects, arts, crafts, or tech repairs. It\u0026#39;s especially useful for anything involving fine details.\u003c/p\u003e    \n\u003cp\u003eHere are a few more ideas to put it into everyday use:\u003c/p\u003e        \u003cul\u003e\n                    \u003cli\u003e\n                                        Thread needles effortlessly by zooming in on the eye.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Assemble tiny tech parts like watch batteries or MacBook screws.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Inspect \u003ca href=\"https://www.makeuseof.com/what-is-solder-paste-and-what-is-it-used-for/\" target=\"_blank\"\u003esolder paste on electronics\u003c/a\u003e for cracks, gaps, or uneven application.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Find ports on any device in the dark or a difficult-to-reach place.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Closely examine 3D prints for defects and troubleshooting.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Use it as a hand mirror after eating at a restaurant.\n                        \u003c/li\u003e\n            \u003c/ul\u003e\n\n    \n    \n    \n\n\u003cp\u003e If the Magnifier goes on to make your life easier, tweak a few settings to make it quicker to access. The suggestions below apply to iPhone 16 and iOS 18 onwards but should be workable on older iPhone models, too.\u003c/p\u003e    \n\u003cp\u003eThe Magnifier app is available by default in the Control Center or the App Library. The other quick ways to launch the Magnifier instantly include triple-clicking the side button (on iPhones with Face ID) or the Home button (on older iPhones). You can also prompt Siri to launch the tool.\u003c/p\u003e    \n\u003cp\u003eThe Magnifier app isn\u0026#39;t just for those with vision impairments. iPhone Pro models with the LiDAR Scanner have more accessibility advantages like people and door detection while scanning your surroundings. But the basic Magnifier is still a good app that \u003ca href=\"https://www.makeuseof.com/extra-uses-for-iphone-camera/\" target=\"_blank\"\u003eextends the use of the iPhone\u0026#39;s camera\u003c/a\u003e, helping you solve everyday problems.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-04-05T18:00:15Z",
  "modifiedTime": "2025-04-05T18:00:15Z"
}
