{
  "id": "2981658a-6af5-4606-8907-b7e73073c3b3",
  "title": "Transmission Belts: Types and Applications",
  "link": "https://www.doityourself.com/stry/transmission-belts-types-and-applications",
  "description": "In 15 BC, mention was first made about the use of flat belt to transfer power for weaver’s shuttles in the weaving of silk. By 1430 the technology was well established, by then not just with flat belts, but also using chain drives, as depicted in one of Leonardo da Vinci's sketches. However, it was",
  "author": "",
  "published": "",
  "source": "https://www.doityourself.com/feed",
  "categories": null,
  "byline": "Alan Loveard",
  "length": 12347,
  "excerpt": "In 15 BC, mention was first made about the use of flat belt to transfer power for weaver’s shuttles in the weaving of silk. By 1430 the technology was well established, by then not just with flat belts, but also using chain drives, as depicted in one of Leonardo da Vinci's sketches.",
  "siteName": "DoItYourself.com",
  "favicon": "https://assets.doityourself.com/apple-touch-icon.png",
  "text": "In 15 BC, mention was first made about the use of flat belt to transfer power for weaver’s shuttles in the weaving of silk. By 1430 the technology was well established, by then not just with flat belts, but also using chain drives, as depicted in one of Leonardo da Vinci's sketches.However, it was the industrial revolution of the late 18th century that brought the use of mechanical belt drives into the mainstream of industry. The application was to transfer power between shafts, therefore avoiding the potential problems of meshing gears, bearing wear and other problems associated with direct contact methods.It is interesting to note that even in the 21st century, the use of belt drives continues. An example of this is the record player where rim drives are still commonly used for reasons of cheapness in construction, but with the negative effect of also transferring rumble from the drive motor to the platter and tone arm. The belt drive in mid-priced and even some high-end systems is still used as a superior alternative to contact (rim) drives.For industrial and automotive use, flat belt power transmission continues to be extensively used and there is every expectation that this will continue for the foreseeable future. It is generally simpler, cheaper and safer than most alternatives. Belts are the cheapest utility for power transmission between shafts and clutch action is simple, activated by releasing the belt tension. Different speeds can be obtained by using stepped or tapered pulleys.Drive belts were traditionally made of rubber or leather, then later by synthetic polymers. Nylon or polyurethane are now common. Top grain leather continues to be among the best of all materials. Many belts are reinforced by other fibres and for extreme conditions of deployment that material may be Kevlar.Belts ends are joined by lacing the ends together with leather thongs (the oldest of the methods), steel comb fasteners and/or lacing, or by gluing or welding in the case of polyurethane or polyester. Flat belts were traditionally jointed, but they can also be extruded for endless construction.Today, virtually all industrial belt drives are contained within removable guards to prevent accidental contact between the belt and the operator.Design changesFlat belts in particular have problems with slippage and wandering, the latter being mostly due to misalignment. The two main ways of controlling these potential defects are the use of idler wheels to maintain belt tension, as well as significant changes to the design of the belts themselves. Flat belts tend to climb towards the higher side of the pulley, so the design of the latter has mostly been changed to a slightly convex or \"crowned\" surface that helps the belt to self-center.Correct belt tension is absolutely essential. Manual designs will have bolts allowing adjustment of one or other pulley to maintain tension. The way to check the tension can be as simple as applying finger pressure or by using a sophisticated measuring device like a small lazer.An improvement over a manual tensioning is the deployment of a spring- loaded idler wheel that keeps the belt under the desired tension. This will automatically move to accommodate any looseness and is widely used in automotive applications. Where several “slave” units are to be driven, a “serpentine” belt is used to drive multiple items like an alternator, power-steering pump, air-conditioning compressor etc. The system will invariably employ a spring-loaded idler to maintain optimum tension.V beltsIn many situations, the V-Belt is more appropriate than a flat belt, mainly due to superior grip. A trapezoid-shaped V-belt body allows superior fit into the grooves of a pulley or sheave, This provides better friction, torque and mechanical efficiency.There are several design variations, the most significant of which is the cogged V-belt. The former is widely used, but more prone to slippage than the cogged belt unless the tension is optimum.All V-belts must have a large tensile strength with great flexibility, in order to be suitable for various applications. Although Kevlar is the strongest material used to manufacture V-belts, this is overkill for most applications. Rubber is still the most common material in use for the core because it provides the elasticity needed to recover its shape. Layered with steel tension cords and lined with a fabric cover, it is the strongest type of general-use belt.Pulley alignmentOther than general wear and tear, the most significant problem affecting belt drive systems is misalignment of the driver and/or driven pulley wheels. A pulley that is not turning freely will cause considerable wear on a belt, so routine adjustment and application of oil or grease to the bearings will be essential.Pulleys must be checked for even rotation and straightness. In particular, any bearing preventing free rotation must be replaced. Broken mounting brackets and/or missing/broken bolts will also cause misalignment. Good maintenance practice demands checking, tightening and/or replacement of all transmission mounting bolts.Out-of-alignment pulleys are just waiting for a belt to break or slip off. There is no excuse for this condition, because testing and adjustment is mostly a very simple matter. Misalignment will generate some or all of the following symptoms: Shaky Belt Motion. ... Visible Wear of the belt and/or pulleys. ... Belt “squealing” or “whining” noises. ... Knocking or slapping noises. ... Damaged bearings or pulleys. Pulley misalignment can be angular, (between the driving and driven pulleys) or it can be parallel, with one pulley offset from the other as viewed from the edge.Traditional mechanical alignment methods are cheap, quick and dirty but they are often inaccurate. The method involves straightedges, tape measures, wire, string, feeler gauges, spirit levels and calibrated cones. However, these are better than nothing and will usually allow the operator to diagnose the source of the misalignment quickly.However, laser belt alignment tools will align the faces of the pulleys, or their grooves. This provides superior accuracy and will accommodate pulleys of different thickness, brand, type or face quality.Frequently, correcting misaligned pulleys can be as simple as removing the offending unit and either replacing it, or even just adding shims onto the shaft.However, diagnosing the problem is one thing – fixing it is quite another. Although there are many generic components in use, it is entirely possible that the unit requiring adjustment or replacement is specific to a particular make and model. It will save a lot of angst if a workshop manual is consulted to determine the precise type and specification of the various components. Alternatively, specialist parts suppliers will often provide this information, availability and price details when a make and model is specified.Belt maintenanceRegular inspection of belts is strongly recommended. Looking carefully all round the belt and by feeling around the inner face for damage will usually identify any point of failure.Worn or otherwise deficient belts need to be replaced as they will eventually break or run off the pulleys.Welcome to the Lawn MowerLess than a hundred years ago, household and gardening appliances were primitive, at best.A washing machine was famously described as “a woman with fat arms.” Fridges were edifices containing blocks of ice and a lawn mower was a goat or sheep. Progress, however slow, did eventually arrive and the first human-propulsion lawn mower was created in 1870, consisting of a horizontal drum inside a frame. The design was patented in 1868 and hard though it may be to believe, such devices are still sold today and the design has changed very little.Over $160 can be spent on one of these devices that are sold by many “big-box” hardware stores.Steam powered mowers actually did exist from the 1890’s, but Ransomes, a company still around today, introduced the first mower powered by steam and subsequently by an internal combustion engine in 1902. These evolved in 1814 into a slightly more advanced design, still based on the Ransome design.It was not until 1929 that the first horizontal- cut machine appeared. In 1938, the first machine that was truly practical and affordable mower was launched, followed by the Briggs \u0026 Stratton mower with a lightweight aluminium engine in 1953. For many decades, Briggs \u0026 Stratton accounted for around 80% of all lawn mower engines.Today, reel mowers are a viable alternative to rotary mowers for domestic use, because the latter perform better at higher mowing heights in rougher conditions. Reel mowers are more effective when the grass is not too long, wet, or undulating and have difficulty chopping twigs and going over rocks. The maximum mowing height of a self-propelled reel mower is usually between 8 and 10 mm. Functionality is defined by the front roller that lays grass blades down before being cut by the reel.The level of sophistication in mower design is endless and where large areas of grass are involved, there may be justification for ride-on mowers that have not only comfort and convenience, but also far greater adjustments to suit a variety of terrains.Lawn mower drive systems \u0026 maintenanceObviously, a powered mower requires an engine of some sort and the innovative development of lawn mowers is mind-boggling. We have mowers with mains powered, as well as battery-powered motors, solar-powered mowers, tractor-drawn slasher / mowers and even autonomous robotic mowers, most of which are beyond the scope of this article.All mowers work by placing blades into proximity with the medium to be cut and not to be confused with planetary gear systems common to tractors and other heavy machinery, this still mostly consists of pulleys and drive belts,The design of any belt-driven mower has a significant effect on pulley alignment and performance. For example, Zero Turn mowers have two transmissions usually powered by the same belt. Up/down movement of pulleys contributes to belts coming off.The vibrations inherent in riding mowers will cause bolts to loosen and the strains imposed on transmission mounting points lead to their failure. Loose bolts will add to the failure of the transmission mounts. Loose or missing bolts will allow the transmission to tilt and that will misalign the pulleys and cause belt to come off pulleys.Pulley alignment and belt tension has been discussed above but that is not the end of the matter. The combination of the motor, the transmission and cutting blades requires a systematic approach to maintenance. Use a clean air filter. ... Use a clean fuel filter. ... Replace the oil. ... Replace the spark plug. ... Check the blade. ... Check tire pressure. ... Clean the undercarriage. Poor maintenance may have far more adverse repercussions than poor performance. A blade rotating at high speed can send dirt and bacteria deep into a wound, creating a high risk for severe infection. In addition, a lawn mower can eject a piece of metal or wood up to 160 KPH or greater and the potential risk of injury or even death can only be imagined. Debris may consist of grass clippings, leaves, hedge trimmings and other vegetative material generated from residential property or landscaping activities, but the inclusion of wood materials is highly possible.The condition of the blades themselves cannot be overlooked. Damage may be caused by impact, but the importance of metal fatigue is critical to safe operation. Fatigue occurs when any metal (or plastic) is subjected to multiple shock, rotational imbalance, bending or similar events, eventually causing the grain structure of the material to break down. The higher the speed at which such breakage occurs the greater the potential for catastrophic outcomes.There is really no excuse for having a broken blade caused by metal fatigue, because routine inspection for cracks, bends, dents or nicks on the cutting edges will avoid most failures and replacement is cheap and simple.Sharpening is entirely possible for blades that are merely blunt but there is a limit to the effectiveness of this. If in doubt, it is always best to replace any blades showing signs of excessive wear or any type of damage as just described.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content725547\"\u003e\n            \n\u003cp\u003eIn 15 BC, mention was first made about the use of flat belt to transfer power for weaver’s shuttles in the weaving of silk. By 1430 the technology was well established, by then not just with flat belts, but also using chain drives, as depicted in one of Leonardo da Vinci\u0026#39;s sketches.\u003c/p\u003e\u003cp\u003eHowever, it was the industrial revolution of the late 18th century that brought the use of mechanical belt drives into the mainstream of industry. The application was to transfer power between shafts, therefore avoiding the potential problems of meshing gears, bearing wear and other problems associated with direct contact methods.\u003c/p\u003e\u003cp\u003eIt is interesting to note that even in the 21st century, the use of belt drives continues. An example of this is the record player where rim drives are still commonly used for reasons of cheapness in construction, but with the negative effect of also transferring rumble from the drive motor to the platter and tone arm. The belt drive in mid-priced and even some high-end systems is still used as a superior alternative to contact (rim) drives.\u003c/p\u003e\u003cp\u003eFor industrial and automotive use, flat belt power transmission continues to be extensively used and there is every expectation that this will continue for the foreseeable future. It is generally simpler, cheaper and safer than most alternatives. Belts are the cheapest utility for power transmission between shafts and clutch action is simple, activated by releasing the belt tension. Different speeds can be obtained by using stepped or tapered pulleys.\u003c/p\u003e\u003cp\u003eDrive belts were traditionally made of rubber or leather, then later by synthetic polymers. Nylon or polyurethane are now common. Top grain leather continues to be among the best of all materials. Many belts are reinforced by other fibres and for extreme conditions of deployment that material may be Kevlar.\u003c/p\u003e\u003cp\u003eBelts ends are joined by lacing the ends together with leather thongs (the oldest of the methods), steel comb fasteners and/or lacing, or by gluing or welding in the case of polyurethane or polyester. Flat belts were traditionally jointed, but they can also be extruded for endless construction.\u003c/p\u003e\u003cp\u003eToday, virtually all industrial belt drives are contained within removable guards to prevent accidental contact between the belt and the operator.\u003c/p\u003e\u003ch2\u003eDesign changes\u003c/h2\u003e\u003cp\u003eFlat belts in particular have problems with slippage and wandering, the latter being mostly due to misalignment. The two main ways of controlling these potential defects are the use of idler wheels to maintain belt tension, as well as significant changes to the design of the belts themselves. Flat belts tend to climb towards the higher side of the pulley, so the design of the latter has mostly been changed to a slightly convex or \u0026#34;crowned\u0026#34; surface that helps the belt to self-center.\u003c/p\u003e\u003cp\u003eCorrect belt tension is absolutely essential. Manual designs will have bolts allowing adjustment of one or other pulley to maintain tension. The way to check the tension can be as simple as applying finger pressure or by using a sophisticated measuring device like a small lazer.\u003c/p\u003e\u003cp\u003eAn improvement over a manual tensioning is the deployment of a spring- loaded idler wheel that keeps the belt under the desired tension. This will automatically move to accommodate any looseness and is widely used in automotive applications. Where several “slave” units are to be driven, a “serpentine” belt is used to drive multiple items like an alternator, power-steering pump, air-conditioning compressor etc. The system will invariably employ a spring-loaded idler to maintain optimum tension.\u003c/p\u003e\u003ch2\u003eV belts\u003c/h2\u003e\u003cp\u003eIn many situations, the V-Belt is more appropriate than a flat belt, mainly due to superior grip. A trapezoid-shaped V-belt body allows superior fit into the grooves of a pulley or sheave, This provides better friction, torque and mechanical efficiency.\u003c/p\u003e\u003cp\u003eThere are several design variations, the most significant of which is the cogged V-belt. The former is widely used, but more prone to slippage than the cogged belt unless the tension is optimum.\u003c/p\u003e\u003cp\u003eAll V-belts must have a large tensile strength with great flexibility, in order to be suitable for various applications. Although Kevlar is the strongest material used to manufacture V-belts, this is overkill for most applications. Rubber is still the most common material in use for the core because it provides the elasticity needed to recover its shape. Layered with steel tension cords and lined with a fabric cover, it is the strongest type of general-use belt.\u003c/p\u003e\u003ch2\u003ePulley alignment\u003c/h2\u003e\u003cp\u003eOther than general wear and tear, the most significant problem affecting belt drive systems is misalignment of the driver and/or driven pulley wheels. A pulley that is not turning freely will cause considerable wear on a belt, so routine adjustment and application of oil or grease to the bearings will be essential.\u003c/p\u003e\u003cp\u003ePulleys must be checked for even rotation and straightness. In particular, any bearing preventing free rotation must be replaced. Broken mounting brackets and/or missing/broken bolts will also cause misalignment. Good maintenance practice demands checking, tightening and/or replacement of all transmission mounting bolts.\u003c/p\u003e\u003cp\u003eOut-of-alignment pulleys are just waiting for a belt to break or slip off. There is no excuse for this condition, because testing and adjustment is mostly a very simple matter. Misalignment will generate some or all of the following symptoms:\u003c/p\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eShaky Belt Motion. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eVisible Wear of the belt and/or pulleys. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eBelt “squealing” or “whining” noises. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eKnocking or slapping noises. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eDamaged bearings or pulleys.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cp\u003ePulley misalignment can be angular, (between the driving and driven pulleys) or it can be parallel, with one pulley offset from the other as viewed from the edge.\u003c/p\u003e\u003cp\u003eTraditional mechanical alignment methods are cheap, quick and dirty but they are often inaccurate. The method involves straightedges, tape measures, wire, string, feeler gauges, spirit levels and calibrated cones. However, these are better than nothing and will usually allow the operator to diagnose the source of the misalignment quickly.\u003c/p\u003e\u003cp\u003eHowever, laser belt alignment tools will align the faces of the pulleys, or their grooves. This provides superior accuracy and will accommodate pulleys of different thickness, brand, type or face quality.\u003c/p\u003e\u003cp\u003eFrequently, correcting misaligned pulleys can be as simple as removing the offending unit and either replacing it, or even just adding shims onto the shaft.\u003c/p\u003e\u003cp\u003eHowever, diagnosing the problem is one thing – fixing it is quite another. Although there are many generic components in use, it is entirely possible that the unit requiring adjustment or replacement is specific to a particular make and model. It will save a lot of angst if a workshop manual is consulted to determine the precise type and specification of the various components. Alternatively, specialist parts suppliers will often provide this information, availability and price details when a make and model is specified.\u003c/p\u003e\u003cp\u003e\u003ci\u003eBelt maintenance\u003c/i\u003e\u003c/p\u003e\u003cp\u003eRegular inspection of belts is strongly recommended. Looking carefully all round the belt and by feeling around the inner face for damage will usually identify any point of failure.\u003c/p\u003e\u003cp\u003eWorn or otherwise deficient belts need to be replaced as they will eventually break or run off the pulleys.\u003c/p\u003e\u003cp\u003eW\u003ci\u003eelcome to the Lawn Mower\u003c/i\u003e\u003c/p\u003e\u003cp\u003eLess than a hundred years ago, household and gardening appliances were primitive, at best.\u003c/p\u003e\u003cp\u003eA washing machine was famously described as “a woman with fat arms.” Fridges were edifices containing blocks of ice and a lawn mower was a goat or sheep. Progress, however slow, did eventually arrive and the first human-propulsion lawn mower was created in 1870, consisting of a horizontal drum inside a frame. The design was patented in 1868 and hard though it may be to believe, such devices are still sold today and the design has changed very little.\u003c/p\u003e\u003cp\u003eOver $160 can be spent on one of these devices that are sold by many “big-box” hardware stores.\u003c/p\u003e\u003cp\u003eSteam powered mowers actually did exist from the 1890’s, but Ransomes, a company still around today, introduced the first mower powered by steam and subsequently by an internal combustion engine in 1902. These evolved in 1814 into a slightly more advanced design, still based on the Ransome design.\u003c/p\u003e\u003cp\u003eIt was not until 1929 that the first horizontal- cut machine appeared. In 1938, the first machine that was truly practical and affordable mower was launched, followed by the Briggs \u0026amp; Stratton mower with a lightweight aluminium engine in 1953. For many decades, Briggs \u0026amp; Stratton accounted for around 80% of all lawn mower engines.\u003c/p\u003e\u003cp\u003eToday, reel mowers are a viable alternative to rotary mowers for domestic use, because the latter perform better at higher mowing heights in rougher conditions. Reel mowers are more effective when the grass is not too long, wet, or undulating and have difficulty chopping twigs and going over rocks. The maximum mowing height of a self-propelled reel mower is usually between 8 and 10 mm. Functionality is defined by the front roller that lays grass blades down before being cut by the reel.\u003c/p\u003e\u003cp\u003eThe level of sophistication in mower design is endless and where large areas of grass are involved, there may be justification for ride-on mowers that have not only comfort and convenience, but also far greater adjustments to suit a variety of terrains.\u003c/p\u003e\u003cp\u003e\u003ci\u003eLawn mower drive systems \u0026amp; maintenance\u003c/i\u003e\u003c/p\u003e\u003cp\u003eObviously, a powered mower requires an engine of some sort and the innovative development of lawn mowers is mind-boggling. We have mowers with mains powered, as well as battery-powered motors, solar-powered mowers, tractor-drawn slasher / mowers and even autonomous robotic mowers, most of which are beyond the scope of this article.\u003c/p\u003e\u003cp\u003eAll mowers work by placing blades into proximity with the medium to be cut and not to be confused with planetary gear systems common to tractors and other heavy machinery, this still mostly consists of pulleys and drive belts,\u003c/p\u003e\u003cp\u003eThe design of any belt-driven mower has a significant effect on pulley alignment and performance. For example, Zero Turn mowers have two transmissions usually powered by the same belt. Up/down movement of pulleys contributes to belts coming off.\u003c/p\u003e\u003cp\u003eThe vibrations inherent in riding mowers will cause bolts to loosen and the strains imposed on transmission mounting points lead to their failure. Loose bolts will add to the failure of the transmission mounts. Loose or missing bolts will allow the transmission to tilt and that will misalign the pulleys and cause belt to come off pulleys.\u003c/p\u003e\u003cp\u003ePulley alignment and belt tension has been discussed above but that is not the end of the matter. The combination of the motor, the transmission and cutting blades requires a systematic approach to maintenance.\u003c/p\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eUse a clean air filter. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eUse a clean fuel filter. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eReplace the oil. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eReplace the spark plug. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eCheck the blade. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eCheck tire pressure. ...\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cul\u003e\n\u003cli aria-level=\"1\"\u003e\n\u003cp\u003eClean the undercarriage.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\u003cp\u003ePoor maintenance may have far more adverse repercussions than poor performance. A blade rotating at high speed can send dirt and bacteria deep into a wound, creating a high risk for severe infection. In addition, a lawn mower can eject a piece of metal or wood up to 160 KPH or greater and the potential risk of injury or even death can only be imagined. Debris may consist of grass clippings, leaves, hedge trimmings and other vegetative material generated from residential property or landscaping activities, but the inclusion of wood materials is highly possible.\u003c/p\u003e\u003cp\u003eThe condition of the blades themselves cannot be overlooked. Damage may be caused by impact, but the importance of metal fatigue is critical to safe operation. Fatigue occurs when any metal (or plastic) is subjected to multiple shock, rotational imbalance, bending or similar events, eventually causing the grain structure of the material to break down. The higher the speed at which such breakage occurs the greater the potential for catastrophic outcomes.\u003c/p\u003e\u003cp\u003eThere is really no excuse for having a broken blade caused by metal fatigue, because routine inspection for cracks, bends, dents or nicks on the cutting edges will avoid most failures and replacement is cheap and simple.\u003c/p\u003e\u003cp\u003eSharpening is entirely possible for blades that are merely blunt but there is a limit to the effectiveness of this. If in doubt, it is always best to replace any blades showing signs of excessive wear or any type of damage as just described.\u003c/p\u003e\n\n            \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2023-06-27T11:51:22Z",
  "modifiedTime": "2023-08-16T00:00:00Z"
}
