{
  "id": "44042ce8-100d-4533-877d-c468ee315222",
  "title": "What's the Standard Height for an Outdoor Spigot?",
  "link": "https://www.doityourself.com/stry/what-s-the-standard-height-for-an-outdoor-spigot",
  "description": "Get it up to code.",
  "author": "",
  "published": "",
  "source": "https://www.doityourself.com/feed",
  "categories": null,
  "byline": "KC Morgan",
  "length": 11025,
  "excerpt": "Learn how high you should make your outdoor spigot by finding out the standard height of this plumbing feature.",
  "siteName": "DoItYourself.com",
  "favicon": "https://assets.doityourself.com/apple-touch-icon.png",
  "text": "Whether you call it an outdoor spigot, a sill cock, an outdoor faucet, or a hose bib, the thing you use to turn on water outside is not as resilient as it looks. Knowing the standard height for an outdoor spigot matters for a number of reasons, and it's not the only consideration you need to make for this outside water source.What's the standard height for an outdoor spigot? Get this wrong, and you could wind up dealing with lots of little inconveniences, not to mention some real plumbing problems, code violations, and angry homeowner’s associations. The Outdoor SpigotBy any name, the hose bib is a water faucet that is accessible from the exterior of the home. The faucet and the valve that controls water flow all sit outside the house.This makes the whole thing susceptible to freezing in the winter, which creates leaks and plumbing problems. This faucet may also be required to be installed at a standard height to meet certain code requirements.There are several things to consider when it comes to your outdoor spigot and some phone calls you’re going to need to make before you place a new one outside your home.Before you make any buying decisions or start planning to have the spigot installed, find out what you’re required to do and maybe then, you can start thinking about what you want to do with your outdoor spigot.What's the Standard Height?So, what is the standard height for an outdoor spigot? That answer depends entirely on where you live.There is no specific height for outside water faucets that is standardized across the U.S. You don’t have to worry about any federal plumbing codes and hose bibs, as a rule, are not specifically designed to function only at a certain height from the ground.However, all states have their own plumbing codes, and cities, counties, and townships may also have their own codes for plumbing in addition to these state codes. This means you need to know what those codes require you to do before you install a new hose bib, aka spigot or outdoor faucet.Not every state, city, township, or county has a standard height for hose bibs, though some do.Some homeowner's associations may even have a standard height for these faucets, as outdoor water faucets are viewable from the exterior of the home, and homeowner's associations may impose restrictions on items like this that can be seen outside.To find out what the standard height for your water spigot is, and whether or not you have a standard height you need to observe, you will need to contact your local department of permits or the office of planning and zoning in your area. Check the state, city, and county requirements where you live.If you live in an area with a homeowner's association, they will likely have a website or a social media group that you can access to ask questions about codes.You might need to make several phone calls and look around online in order to find out this information, and remember to learn about plumbing codes, specifically where the property is where the spigot will be installed.This is a lot of busy work, and you may find it frustrating because you will be put on hold a lot, but it’s a necessary evil.When There Is No Standard HeightAfter you do your due diligence and learn about any code requirements you may need to follow in regard to your outdoor faucet, you might find that there are no such requirements. Some states and other localities do not have codes regarding the height of the hose bib.However, this matter is still very much worth considering. Just because you can install the hose bib anywhere does not mean that you should.Think carefully about where to place the faucet when there are no codes to guide you. You can place the hose bib near the ground, but this means bending over every time you have to turn it on.Remember that the chief purpose for this faucet is to attach a hose, which requires twisting and turning and untwisting and unturning. What position do you want to be standing in while you are doing all of this?This faucet should also be reasonably accessible should there be any plumbing problems. Putting this faucet too near the ground will result in it being covered with debris and mud that can actually cause blockages and plumbing problems you don't want to deal with.Plumbers are also not going to want to lay down on the ground outside to service a hose bib. While they probably will not refuse to do the job, the job is certainly going to be difficult for them, and it may even take longer for them to complete, which results in a bigger bill for you.The look of the outside of the home is important, so you want the spigot to look nice where it sits, but even more than that, you need to consider accessibility and your own comfort after you’ve made sure you’re going to be following all coding requirements.What to Know About WinterizingFiguring out the height for installing a hose bib is important, but there is something else you must think about when it comes to this outdoor faucet: winter. Because the faucet and the valve for the faucet are outside the home, they are exposed to freezing temperatures in the winter.When the water inside the faucet and the valve freezes, it expands. This can cause the faucet or the pipe, or both, to literally burst and break.When that happens, the entire faucet, including the valve and the pipe, must be replaced, or it cannot be used. It will often also start leaking, which ends up costing you money.The good news is, winterizing these spigots is easy. All you need to do is turn the shut-off valve for the spigot to the off position once the temperature outside drops below freezing.When temperatures hit freezing levels in the fall, 32 degrees F or 0 degrees Celsius, it's time to turn this shut-off valve. Once temperatures have warmed up enough that they do not drop below freezing for a week, you can turn the shut-off valve back on again.This is another reason to consider installing the hose bib up off the ground. If there are no codes to follow and you want to keep the hose bib low for your own reasons, install it at least a little bit higher than the average snowfall your region experiences on a yearly basis.If the hose bib sits in snow for days or weeks at a time, it could freeze and take damage even if it has been properly winterized.Frost-free hose bibs are designed to resist the ravages of winter and to prevent bursting even in freezing weather. However, this will only work if you disconnect the garden hose.Always winterize your outdoor faucets as part of your normal routine. Do this and a hose bib should last you from 15 to 20 years, on average.What's the Standard Height For An Outdoor Spigot?There is no one standard height for outdoor spigots because this number varies greatly depending on the plumbing codes and homeowner's association requirements where you live.You may discover that there is no such requirement at all, and you need to only consider your own comfort and the look you want to have for your exterior when you're installing an outdoor faucet.Check with the office that does your local permits and your HOA before installing a hose bib. Once you get all the information, you may have the choice of deciding exactly where you want this useful feature to go.Choose the placement wisely because if all goes as it should, then you will be living with your hose bib for a long, long time.FAQWhat is the difference between a spigot and a hose bib?A spigot and a hose bib are the same thing. This feature may also be called an outdoor faucet or a sill cock because all these words and phrases are used interchangeably, even sometimes by professional plumbers.Not all of this can be chalked up to jargon, though for most people, it's really all the same what you call this spigot. But according to plumbing definitions, a faucet is attached to a sink or a tub.A spigot is connected to a pipe outside. So if you want to be technically correct, you must call this feature a spigot and not a faucet, though people would know what you meant either way.Plumbers, by the way, call spigots hose bibs. This is also correct.Spigots and hose bibs are the exact same thing... and if you call it an outdoor faucet, it's not likely anyone will get too upset about this minor slip.What size is a standard outdoor water spigot?Outdoor spigots are typically available in two sizes: 1/2 inch and 3/4 inch. This is the size of the valve and pipe leading to the spigot but it does not really change the look of the spigot in any way.That’s because the mouth of the spigot itself, where the water comes out, is nearly always sized to match the size of a standard garden hose. All outdoor spigots end up looking pretty much the same in either size because of this.Do I need to drain my hose bib?When you are turning off the hose bib at the shut-off valve, you will need to drain the hose bib to get rid of any water left inside of it. To do this, turn the spigot on after the shut-off valve has been engaged, and any remaining water inside the spigot should drain out.This will fully prepare your hose bib for the winter, so it is far less likely to freeze and take damage due to the cold weather. Any outdoor plumbing is very vulnerable to freezing temperatures, so winterizing is a necessity unless you live somewhere freezing weather doesn’t happen.Should I turn off the hose bib in winter?Before winter weather causes freezing temperatures, you want to use the shut-off valve to turn off the hose bib. This will keep the spigot from freezing, which results in its bursting and breaking.When a hose bib freezes, it could start to leak, which costs you more money, and it will certainly be unusable as a source of strong and steady water for outdoor use. There is no fixing this problem, which means the whole thing must be replaced if it freezes like this.When turned off in the winter and used properly, a standard hose bib can last as long as 20 years without being replaced.It is definitely worth the investment of time to turn the shut-off valve off and on again once a year because it will save you the cost of a new spigot and replacement installation.Do frost-free hose bibs need to be shut off in winter?Frost-free hose bibs are specifically designed to resist frost. This means you do not have to turn them off using the shut-off valve, even in winter when the temperatures drop below freezing.However, you must disconnect the hose attached to these hose bibs. Frost-free hose bibs are designed so that they do not hold water inside of them, unlike standard spigots, which means they are not subject to freezing... unless they are connected to a hose that will be holding a little bit of water right around the spout.Further Reading5 Basic Plumbing Skills You Should HaveBest Place to Hang a Hose ReelDo You Need an Outdoor Faucet Cover?How to Attach a Hose Bib to a PVC PipeHow to Repair a Retractable Hose ReelHow to Repair an Outdoor Faucet With Low Water PressureHow to Repair or Replace a Leaky Hose BibNew Homeowner's Guide to Winterizing",
  "image": "https://cimg1.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/617/Shutterstock_478062661-696617.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content725635\"\u003e\n            \n\u003cp\u003eWhether you call it an outdoor spigot, a sill cock, an outdoor faucet, or a hose bib, the thing you use to turn on water outside is not as resilient as it looks. Knowing the standard height for an outdoor spigot matters for a number of reasons, and it\u0026#39;s not the only consideration you need to make for this outside water source.\u003c/p\u003e\u003cp\u003eWhat\u0026#39;s the standard height for an outdoor spigot? Get this wrong, and you could wind up dealing with lots of little inconveniences, not to mention some real plumbing problems, code violations, and angry homeowner’s associations. \u003c/p\u003e\u003ch2\u003eThe Outdoor Spigot\u003c/h2\u003e\u003cp\u003eBy any name, the hose bib is a \u003ca href=\"https://www.doityourself.com/stry/how-to-replace-an-outdoor-faucet\" rel=\"noopener\" target=\"_blank\"\u003ewater faucet\u003c/a\u003e that is accessible from the exterior of the home. The faucet and the valve that controls water flow all sit outside the house.\u003c/p\u003e\u003cp\u003eThis makes the whole thing susceptible to freezing in the winter, which creates leaks and plumbing problems. This faucet may also be required to be installed at a standard height to meet certain code requirements.\u003c/p\u003e\u003cp\u003eThere are several things to consider when it comes to your outdoor spigot and some phone calls you’re going to need to make before you place a new one outside your home.\u003c/p\u003e\u003cp\u003eBefore you make any buying decisions or start planning to have the spigot installed, find out what you’re required to do and maybe then, you can start thinking about what you want to do with your outdoor spigot.\u003c/p\u003e\u003ch2\u003eWhat\u0026#39;s the Standard Height?\u003c/h2\u003e\u003cp\u003eSo, what is the standard height for an outdoor spigot? That answer depends entirely on where you live.\u003c/p\u003e\u003cp\u003eThere is no specific height for outside water faucets that is standardized across the U.S. You don’t have to worry about any federal plumbing codes and hose bibs, as a rule, are not specifically designed to function only at a certain height from the ground.\u003c/p\u003e\u003cp\u003eHowever, all states have their own plumbing codes, and cities, counties, and townships may also have their own codes for plumbing in addition to these state codes. This means you need to know what those codes require you to do before you install a new hose bib, aka spigot or outdoor faucet.\u003c/p\u003e\u003cp\u003eNot every state, city, township, or county has a standard height for hose bibs, though some do.\u003c/p\u003e\u003cp\u003eSome homeowner\u0026#39;s associations may even have a standard height for these faucets, as outdoor water faucets are viewable from the exterior of the home, and homeowner\u0026#39;s associations may impose restrictions on items like this that can be seen outside.\u003c/p\u003e\u003cp\u003eTo find out what the standard height for your water spigot is, and whether or not you have a standard height you need to observe, you will need to contact your local department of permits or the office of planning and zoning in your area. Check the state, city, and county requirements where you live.\u003c/p\u003e\u003cp\u003eIf you live in an area with a homeowner\u0026#39;s association, they will likely have a website or a social media group that you can access to ask questions about codes.\u003c/p\u003e\u003cp\u003eYou might need to make several phone calls and look around online in order to find out this information, and remember to learn about plumbing codes, specifically where the property is where the spigot will be installed.\u003c/p\u003e\u003cp\u003eThis is a lot of busy work, and you may find it frustrating because you will be put on hold a lot, but it’s a necessary evil.\u003c/p\u003e\u003ch3\u003eWhen There Is No Standard Height\u003c/h3\u003e\u003cp\u003eAfter you do your due diligence and learn about any code requirements you may need to follow in regard to your outdoor faucet, you might find that there are no such requirements. Some states and other localities do not have codes regarding the height of the hose bib.\u003c/p\u003e\u003cp\u003eHowever, this matter is still very much worth considering. Just because you can install the hose bib anywhere does not mean that you should.\u003c/p\u003e\u003cp\u003eThink carefully about where to place the faucet when there are no codes to guide you. You can place the hose bib near the ground, but this means bending over every time you have to turn it on.\u003c/p\u003e\u003cp\u003eRemember that the chief purpose for this faucet is to attach a hose, which requires twisting and turning and untwisting and unturning. What position do you want to be standing in while you are doing all of this?\u003c/p\u003e\u003cp\u003eThis faucet should also be reasonably accessible should there be any plumbing problems. Putting this faucet too near the ground will result in it being covered with debris and mud that can actually cause blockages and plumbing problems you don\u0026#39;t want to deal with.\u003c/p\u003e\u003cp\u003ePlumbers are also not going to want to lay down on the ground outside to service a hose bib. While they probably will not refuse to do the job, the job is certainly going to be difficult for them, and it may even take longer for them to complete, which results in a bigger bill for you.\u003c/p\u003e\u003cp\u003eThe look of the outside of the home is important, so you want the spigot to look nice where it sits, but even more than that, you need to consider accessibility and your own comfort after you’ve made sure you’re going to be following all coding requirements.\u003c/p\u003e\u003ch3\u003eWhat to Know About Winterizing\u003c/h3\u003e\u003cp\u003eFiguring out the height for installing a \u003ca href=\"https://www.doityourself.com/stry/how-to-prevent-a-hose-bib-from-freezing\" rel=\"noopener\" target=\"_blank\"\u003ehose bib\u003c/a\u003e is important, but there is something else you must think about when it comes to this outdoor faucet: winter. Because the faucet and the valve for the faucet are outside the home, they are exposed to freezing temperatures in the winter.\u003c/p\u003e\u003cp\u003eWhen the water inside the faucet and the valve freezes, it expands. This can cause the faucet or the pipe, or both, to literally burst and break.\u003c/p\u003e\u003cp\u003eWhen that happens, the entire faucet, including the valve and the pipe, must be replaced, or it cannot be used. It will often also start leaking, which ends up costing you money.\u003c/p\u003e\u003cp\u003eThe good news is, winterizing these spigots is easy. All you need to do is turn the shut-off valve for the spigot to the off position once the temperature outside drops below freezing.\u003c/p\u003e\u003cp\u003eWhen temperatures hit freezing levels in the fall, 32 degrees F or 0 degrees Celsius, it\u0026#39;s time to turn this shut-off valve. Once temperatures have warmed up enough that they do not drop below freezing for a week, you can turn the shut-off valve back on again.\u003c/p\u003e\u003cp\u003eThis is another reason to consider installing the hose bib up off the ground. If there are no codes to follow and you want to keep the hose bib low for your own reasons, install it at least a little bit higher than the average snowfall your region experiences on a yearly basis.\u003c/p\u003e\u003cp\u003eIf the hose bib sits in snow for days or weeks at a time, it could freeze and take damage even if it has been properly winterized.\u003c/p\u003e\u003cp\u003eFrost-free hose bibs are designed to resist the ravages of winter and to prevent bursting even in freezing weather. However, this will only work if you disconnect the garden hose.\u003c/p\u003e\u003cp\u003eAlways winterize your outdoor faucets as part of your normal routine. Do this and a hose bib should last you from 15 to 20 years, on average.\u003c/p\u003e\u003ch2\u003eWhat\u0026#39;s the Standard Height For An Outdoor Spigot?\u003c/h2\u003e\u003cp\u003eThere is no one standard height for outdoor spigots because this number varies greatly depending on the plumbing codes and homeowner\u0026#39;s association requirements where you live.\u003c/p\u003e\u003cp\u003eYou may discover that there is no such requirement at all, and you need to only consider your own comfort and the look you want to have for your exterior when you\u0026#39;re installing an outdoor faucet.\u003c/p\u003e\u003cp\u003eCheck with the office that does your local permits and your HOA before installing a hose bib. Once you get all the information, you may have the choice of deciding exactly where you want this useful feature to go.\u003c/p\u003e\u003cp\u003eChoose the placement wisely because if all goes as it should, then you will be living with your hose bib for a long, long time.\u003c/p\u003e\u003ch2\u003eFAQ\u003c/h2\u003e\u003ch3\u003eWhat is the difference between a spigot and a hose bib?\u003c/h3\u003e\u003cp\u003eA spigot and a hose bib are the same thing. This feature may also be called an outdoor faucet or a sill cock because all these words and phrases are used interchangeably, even sometimes by professional plumbers.\u003c/p\u003e\u003cp\u003eNot all of this can be chalked up to jargon, though for most people, it\u0026#39;s really all the same what you call this spigot. But according to plumbing definitions, a faucet is attached to a sink or a tub.\u003c/p\u003e\u003cp\u003eA spigot is connected to a pipe outside. So if you want to be technically correct, you must call this feature a spigot and not a faucet, though people would know what you meant either way.\u003c/p\u003e\u003cp\u003ePlumbers, by the way, call spigots hose bibs. This is also correct.\u003c/p\u003e\u003cp\u003eSpigots and hose bibs are the exact same thing... and if you call it an outdoor faucet, it\u0026#39;s not likely anyone will get too upset about this minor slip.\u003c/p\u003e\u003ch3\u003eWhat size is a standard outdoor water spigot?\u003c/h3\u003e\u003cp\u003eOutdoor spigots are typically available in two sizes: 1/2 inch and 3/4 inch. This is the size of the valve and pipe leading to the spigot but it does not really change the look of the spigot in any way.\u003c/p\u003e\u003cp\u003eThat’s because the mouth of the spigot itself, where the water comes out, is nearly always sized to match the size of a standard garden hose. All outdoor spigots end up looking pretty much the same in either size because of this.\u003c/p\u003e\u003ch3\u003eDo I need to drain my hose bib?\u003c/h3\u003e\u003cp\u003eWhen you are turning off the hose bib at the shut-off valve, you will need to drain the hose bib to get rid of any water left inside of it. To do this, turn the spigot on after the shut-off valve has been engaged, and any remaining water inside the spigot should drain out.\u003c/p\u003e\u003cp\u003eThis will fully prepare your hose bib for the winter, so it is far less likely to freeze and take damage due to the cold weather. Any outdoor plumbing is very vulnerable to freezing temperatures, so winterizing is a necessity unless you live somewhere freezing weather doesn’t happen.\u003c/p\u003e\u003ch3\u003eShould I turn off the hose bib in winter?\u003c/h3\u003e\u003cp\u003eBefore winter weather causes freezing temperatures, you want to use the shut-off valve to turn off the hose bib. This will keep the spigot from \u003ca href=\"https://www.doityourself.com/stry/insulatepipes\" rel=\"noopener\" target=\"_blank\"\u003efreezing\u003c/a\u003e, which results in its bursting and breaking.\u003c/p\u003e\u003cp\u003eWhen a hose bib freezes, it could start to leak, which costs you more money, and it will certainly be unusable as a source of strong and steady water for outdoor use. There is no fixing this problem, which means the whole thing must be replaced if it freezes like this.\u003c/p\u003e\u003cp\u003eWhen turned off in the winter and used properly, a standard hose bib can last as long as 20 years without being replaced.\u003c/p\u003e\u003cp\u003eIt is definitely worth the investment of time to turn the shut-off valve off and on again once a year because it will save you the cost of a new spigot and replacement installation.\u003c/p\u003e\u003ch3\u003eDo frost-free hose bibs need to be shut off in winter?\u003c/h3\u003e\u003cp\u003eFrost-free hose bibs are specifically designed to resist frost. This means you do not have to turn them off using the shut-off valve, even in winter when the temperatures drop below freezing.\u003c/p\u003e\u003cp\u003eHowever, you must disconnect the hose attached to these hose bibs. Frost-free hose bibs are designed so that they do not hold water inside of them, unlike standard spigots, which means they are not subject to freezing... unless they are connected to a hose that will be holding a little bit of water right around the spout.\u003c/p\u003e\u003ch3\u003eFurther Reading\u003c/h3\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/5-basic-plumbing-skills-you-should-have\" rel=\"noopener\" target=\"_blank\"\u003e5 Basic Plumbing Skills You Should Have\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/best-place-to-hang-a-hose-reel\" rel=\"noopener\" target=\"_blank\"\u003eBest Place to Hang a Hose Reel\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/do-you-need-an-outdoor-faucet-cover\" rel=\"noopener\" target=\"_blank\"\u003eDo You Need an Outdoor Faucet Cover?\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/how-to-attach-a-hose-bib-to-a-pvc-pipe\" rel=\"noopener\" target=\"_blank\"\u003eHow to Attach a Hose Bib to a PVC Pipe\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/how-to-repair-a-retractable-hose-reel\" rel=\"noopener\" target=\"_blank\"\u003eHow to Repair a Retractable Hose Reel\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/how-to-repair-an-outdoor-faucet-with-low-water-pressure\" rel=\"noopener\" target=\"_blank\"\u003eHow to Repair an Outdoor Faucet With Low Water Pressure\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/how-to-repair-a-leaky-hose-bib\" rel=\"noopener\" target=\"_blank\"\u003eHow to Repair or Replace a Leaky Hose Bib\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.doityourself.com/stry/new-homeowners-guide-to-winterizing\" rel=\"noopener\" target=\"_blank\"\u003eNew Homeowner\u0026#39;s Guide to Winterizing\u003c/a\u003e\u003c/p\u003e\n\n            \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2023-06-29T18:29:53Z",
  "modifiedTime": "2023-08-16T00:00:00Z"
}
