{
  "id": "6db0ca44-fb53-4aac-81c3-150443ffe2c4",
  "title": "Your Microsoft 365 Subscription Will Now Cost More Unless You Do This",
  "link": "https://www.makeuseof.com/microsoft-365-subscription-with-copilot-price-increase/",
  "description": "Now that Microsoft 365 has Copilot built in, your subscription price is automatically going up—but you can avoid the hike.",
  "author": "Tess Ryan",
  "published": "Fri, 24 Jan 2025 23:34:18 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Productivity",
    "Artificial Intelligence",
    "Microsoft",
    "Microsoft 365",
    "Microsoft Copilot"
  ],
  "byline": "Tess Ryan",
  "length": 6451,
  "excerpt": "Now that Microsoft 365 has Copilot built in, your subscription price is automatically going up—but you can avoid the hike.",
  "siteName": "MakeUseOf",
  "favicon": "https://www.makeuseof.com/public/build/images/favicon-240x240.df310da5.png",
  "text": "Microsoft 365 users might have noticed a friendly-looking message this month, letting them know that Copilot, Microsoft's AI tool, is now included in their plan. You should know that this \"gift\" comes with a price—that could be easy to miss. Microsoft 365's Copilot Bundle Triggers an Automatic Price Increase As of January 2025, Microsoft 365 Office apps automatically come with Copilot, Microsoft's AI tool. The bundle is a shift away from the company's former structure, which only offered Copilot Pro as a robust, optional add-on to your Microsoft 365 workflow. Now, you no longer have a choice: Copilot is busting down the door of your Office apps, including Word, Outlook, PowerPoint, and so on. The update, which occurs automatically with your next Microsoft 365 renewal, prompts a price increase of $3 on your subscription. If you're not fond of Copilot or AI features in general, or at least, you're not ready to pay for them, you do have the power to downgrade—or, go back to a non-Copilot plan. How to Go Back to a Classic Plan The process of finding your way back to a standard or \"Classic\" plan, as Microsoft has dubbed them, is not quite straightforward. This isn't surprising, considering that Microsoft hopes you'll stay on the AI-inclusive plan. Here are the steps to switch your plan to one without Copilot built in: To access your account settings, go to Microsoft's Subscriptions page on a browser. Locate your plan, which will either say Microsoft 365 Family or Microsoft 365 Personal. Under the plan is your next billing date and the amount of that charge. In the upper right corner of the plan description, select Manage. At the bottom of your account management options, select the button to Cancel subscription. Don't worry! Microsoft wouldn't make it that easy to cancel. The next page contains a multitude of reasons to stay, and perhaps even an offer to extend your plan for free. Scroll down to the carousel of plans titled Choose a plan that’s right for you. Here, you can select the Classic plan that does not include AI, locking in your former rate—for now. Per Microsoft Support, the Personal Classic or Family Classic plan \"may not always be offered,\" so it's possible that the price increase will catch up with us somewhere down the line. Hopefully, that's not any time soon. The Price Limit Does Not Exist It's not a great feeling when a subscription service jacks up its price for a feature you didn't opt to add yourself, but it's nice that you have some control, in this case. Price increases are inevitable; we're certainly seeing it with streaming services, from Netflix inflating its ad-free subscription to $17.99 and YouTube TV bumping its monthly fee by $10 to a whopping $82.99. Productivity apps are no different. In Microsoft's announcement of the Copilot bundle, the company made sure to remind us that this is the \"first time since its release\" in 2013 that it has increased the price. Equally inevitable is AI, which is coming into our apps whether we like it or not. That being said, AI-related laws and regulations are still playing catch up. So, as long as AI remains prohibited in specific situations, there will always be some level of control in separating, or disabling, these features from our day-to-day tools.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft365-copilot-fi-art.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eMicrosoft 365 users might have noticed a friendly-looking message this month, letting them know that Copilot, Microsoft\u0026#39;s AI tool, is now included in their plan. You should know that this \u0026#34;gift\u0026#34; comes with a price—that could be easy to miss.\u003c/p\u003e    \u003ch2 id=\"microsoft-365-39-s-copilot-bundle-triggers-an-automatic-price-increase\"\u003e\n                        Microsoft 365\u0026#39;s Copilot Bundle Triggers an Automatic Price Increase \n               \u003c/h2\u003e\n\u003cp\u003eAs of January 2025, \u003ca href=\"https://www.makeuseof.com/microsoft-365-office-apps-copilot-bundle/\" target=\"_blank\"\u003eMicrosoft 365 Office apps automatically come with Copilot\u003c/a\u003e, Microsoft\u0026#39;s AI tool. The bundle is a shift away from the company\u0026#39;s former structure, which only offered \u003ca href=\"https://www.microsoft.com/en-us/store/b/copilotpro\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eCopilot Pro\u003c/a\u003e as a robust, optional add-on to your Microsoft 365 workflow. Now, you no longer have a choice: Copilot is busting down the door of your Office apps, including Word, Outlook, PowerPoint, and so on. \u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2766\" height=\"1383\" loading=\"lazy\" decoding=\"async\" alt=\"A Copilot update notification on Microsoft Word \" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2025/01/microsoft-365-copilot-update-notification.png\"/\u003e\n    \u003c/picture\u003e\n                                    \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003eThe update, which occurs automatically with your next Microsoft 365 renewal, prompts a price increase of $3 on your subscription. If you\u0026#39;re not fond of Copilot or AI features in general, or at least, you\u0026#39;re not ready to pay for them, you do have the power to downgrade—or, go back to a non-Copilot plan.\u003c/p\u003e    \u003ch2 id=\"how-to-go-back-to-a-classic-plan\"\u003e\n                        How to Go Back to a Classic Plan\n               \u003c/h2\u003e\n\u003cp\u003eThe process of finding your way back to a standard or \u0026#34;Classic\u0026#34; plan, as Microsoft has dubbed them, is not quite straightforward. This isn\u0026#39;t surprising, considering that Microsoft hopes you\u0026#39;ll stay on the AI-inclusive plan. \u003c/p\u003e    \n\u003cp\u003eHere are the steps to switch your plan to one without Copilot built in:\u003c/p\u003e        \u003col\u003e\n                    \u003cli\u003e\n                                        To access your account settings, go to \u003ca href=\"https://account.microsoft.com/services/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMicrosoft\u0026#39;s Subscriptions page\u003c/a\u003e on a browser. \n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Locate your plan, which will either say \u003cstrong\u003eMicrosoft 365 Family\u003c/strong\u003e or \u003cstrong\u003eMicrosoft 365 Personal\u003c/strong\u003e. Under the plan is your next billing date and the amount of that charge.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        In the upper right corner of the plan description, select \u003cstrong\u003eManage\u003c/strong\u003e. \n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        At the bottom of your account management options, select the button to \u003cstrong\u003eCancel subscription\u003c/strong\u003e.\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Don\u0026#39;t worry! Microsoft wouldn\u0026#39;t make it that easy to cancel. The next page contains a multitude of reasons to stay, and perhaps even an offer to extend your plan for free. Scroll down to the carousel of plans titled \u003cstrong\u003eChoose a plan that’s right for you.\u003c/strong\u003e\n                        \u003c/li\u003e\n                    \u003cli\u003e\n                                        Here, you can select the \u003cstrong\u003eClassic \u003c/strong\u003eplan that does not include AI, locking in your former rate—for now. \n                        \u003c/li\u003e\n            \u003c/ol\u003e\n\n\n\n\n    \n\n\n\n                                                                                                                                                                                                                                                                                                                                \n    \n\n\n\u003cdiv id=\"custom_block_10\"\u003e\n\n        \n            \u003cp\u003ePer \u003ca href=\"https://support.microsoft.com/en-us/office/switching-to-microsoft-365-personal-and-family-classic-plans-58342e83-38e7-4cda-b63b-88604a8fb7ef\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMicrosoft Support\u003c/a\u003e, the Personal Classic or Family Classic plan \u0026#34;may not always be offered,\u0026#34; so it\u0026#39;s possible that the price increase will catch up with us somewhere down the line. Hopefully, that\u0026#39;s not any time soon.\u003c/p\u003e\n    \n        \n    \u003c/div\u003e\u003ch2 id=\"the-price-limit-does-not-exist\"\u003e\n                        The Price Limit Does Not Exist\n               \u003c/h2\u003e\n\u003cp\u003eIt\u0026#39;s not a great feeling when a subscription service jacks up its price for a feature you didn\u0026#39;t opt to add yourself, but it\u0026#39;s nice that you have some control, in this case. Price increases are inevitable; we\u0026#39;re certainly seeing it with streaming services, from \u003ca href=\"https://www.makeuseof.com/netflix-raises-standard-plan-cost/\" target=\"_blank\"\u003eNetflix inflating its ad-free subscription\u003c/a\u003e to $17.99 and \u003ca href=\"https://www.makeuseof.com/youtube-tv-raises-prices-again/\" target=\"_blank\"\u003eYouTube TV bumping its monthly fee\u003c/a\u003e by $10 to a whopping $82.99. \u003c/p\u003e    \n\u003cp\u003eProductivity apps are no different. In \u003ca href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2025/01/16/copilot-is-now-included-in-microsoft-365-personal-and-family/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eMicrosoft\u0026#39;s announcement\u003c/a\u003e of the Copilot bundle, the company made sure to remind us that this is the \u0026#34;first time since its release\u0026#34; in 2013 that it has increased the price. \u003c/p\u003e    \n\u003cp\u003eEqually inevitable is AI, which is coming into our apps whether we like it or not. That being said, AI-related laws and regulations are still playing catch up. So, as long as AI remains prohibited in specific situations, there will always be some level of control in separating, or disabling, these features from our day-to-day tools. \u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-24T23:34:18Z",
  "modifiedTime": "2025-01-24T23:34:18Z"
}
