{
  "id": "a6182471-cb50-4a9e-be26-5fda1d30e6eb",
  "title": "How to Remove a Septic Tank Lid",
  "link": "https://www.doityourself.com/stry/how-to-remove-a-septic-tank-lid",
  "description": "It's important to check your septic every few years and to do that, you must find and locate the lid.",
  "author": "",
  "published": "",
  "source": "https://www.doityourself.com/feed",
  "categories": null,
  "byline": "Tim Bossie",
  "length": 4188,
  "excerpt": "A septic tank lid is the uppermost portion of the sewage tank.",
  "siteName": "DoItYourself.com",
  "favicon": "https://assets.doityourself.com/apple-touch-icon.png",
  "text": "A septic tank lid is the uppermost portion of the sewage tank. This lid needs to be removed every few years in order to empty the tank. Depending on the size of the tank, a homeowner will need to have the septic tank emptied every three to five years.It is important not to let the tank get too full, start to back up into the house, or overflow out of the lid. This causes severe damage to the tank. Removing the lid is an easy task that can be done before the pumping service gets there or when you want to check content levels.Step 1 - Locate Septic TankIf you have just purchased a home, or are having the septic tank pumped out for the first time you will need to locate the tank itself. Depending on the size of your lot, and the type of ground you are on (sand, ledge, clay) the tank can be just about anywhere. It should be stated in your property deed where the tank is located, but it may be approximate. There are three surefire ways to find the tank, but they do require time.Use a metal detector to find the septic tank. Most tanks today are made out of concrete material, but they have metal rebar in them. With the use of a metal detector you can go to the approximate location and start searching. Once you find the tank, it is a matter of digging to find the lid.Use a metal pole to poke into the earth to locate the tank. This can be time consuming if the property deed is not right. Simply poke the metal pole into the earth about 12 to 14 inches. Once you strike something solid continue in the area to determine that it is the tank.You can also follow the drain pipe that comes from your home. However, this method entails digging up your yard to follow the pipe to the tank.Step 2 - Dig Up Septic Tank LidAfter you have found the septic tank, you can begin the process of digging up the lid. Use a shovel to excavate the ground around the tank until you find the lid. It will be flat against the tank with a small seam around it. Dig the ground to create at least 16 inches of clearance on all sides of the lid. It is also recommended that you slope the land as you dig down to the lid so that the gravel will not fall back in.Step 3 - Pry Off Septic Tank LidDepending on the size of the septic tank, the lid can be quite heavy. It is a solid piece of concrete that is flat on all sides. It may have a handle to pull on. The majority of septic tank lids will require a pry bar to lift them out of their seating. Set the prybar in the seam and press down. As the lid lifts out of the hole, have someone move it to the side. Set the lid on the surface of the ground out of the way of the pumping vehicle.Remove a Septic Tank Lid FAQHow do you lift a septic tank lid?Before lifting a septic tank lid, scrape all the dirt away to start with a clean lid. Insert a screwdriver into the seam of the lid to break the seal.When you have a small opening, use a pry bar to lift the lid the rest of the way. If you're going to remove or move the lid, get help from at least one more person because this is not a solo task.Some septic tank lids can be incredibly heavy and may in fact require special equipment to lift and move. Do not attempt to lift a septic tank lid, or anything else, that is too heavy for you to reasonably handle.Can I replace the lid on my septic tank?You can replace the lid on a septic tank and this is something you should do if the lid is damaged, but this requires a professional. Septic tank lids must be the exact right size and they must be expertly placed in order to have a tight seal.Septic tank fumes can be dangerous and the septic tank lid is an essential security measure.Should septic tank lid be sealed?When the septic tank is not being serviced, the lid to the tank must be sealed. This prevents fumes and leaks, which are toxic and dangerous to humans and animals.How heavy is a septic tank lid?Modern, lightweight septic tank lids weigh less than 10 pounds. Older septic tank lids weigh far more because they are made of concrete, typically 60 to 80 pounds.What happens if septic tank lid is cracked?Cracked septic tank lids need to be replaced. Cracks can allow fumes and fluid to leak out of the tank, creating a hazardous situation.",
  "image": "https://cimg0.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/124/septic-tank-414124.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content176419\"\u003e\n            \n\u003cp\u003e\u003cspan\u003eA septic tank lid\u003c/span\u003e \u003cspan\u003eis the uppermost portion of the sewage tank. This lid needs to be removed every few years in order to empty the tank. Depending on the size of the tank, a homeowner will need to have the septic tank emptied every three to five years.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt is important not to let the tank get too full, start to back up into the house, or overflow out of the lid. This causes severe damage to the tank. Removing the lid is an easy task that can be done before the pumping service gets there or when you want to check content levels.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003eStep 1 - Locate Septic Tank\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cimg1.ibsrv.net/cimg/www.doityourself.com/320x146_85-1/509/septic-tank-256509.jpg.webp\" media=\"(max-width:320px)\"/\u003e\u003csource type=\"image/webp\" srcset=\"https://cimg1.ibsrv.net/cimg/www.doityourself.com/375x171_85-1/509/septic-tank-256509.jpg.webp\" media=\"(max-width:375px)\"/\u003e\u003csource type=\"image/webp\" srcset=\"https://cimg1.ibsrv.net/cimg/www.doityourself.com/425x194_85-1/509/septic-tank-256509.jpg.webp\" media=\"(max-width:425px)\"/\u003e\u003csource type=\"image/webp\" srcset=\"https://cimg1.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/509/septic-tank-256509.jpg.webp\"/\u003e\u003cimg loading=\"lazy\" alt=\"septic tank\" src=\"https://cimg1.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/509/septic-tank-256509.jpg\" data-target=\"#articlesModal\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIf you have just purchased a home, or are having the septic tank pumped out for the first time you will need to locate the tank itself. Depending on the size of your lot, and the type of ground you are on (sand, ledge, clay) the tank can be just about anywhere. It should be stated in your property deed where the tank is located, but it may be approximate. There are three surefire ways to find the tank, but they do require time.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUse a metal detector to find the septic tank. Most tanks today are made out of concrete material, but they have metal rebar in them. With the use of a metal detector you can go to the approximate location and start searching. Once you find the tank, it is a matter of digging to find the lid.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eUse a metal pole to poke into the earth to locate the tank. This can be time consuming if the property deed is not right. Simply poke the metal pole into the earth about 12 to 14 inches. Once you strike something solid continue in the area to determine that it is the tank.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYou can also follow the drain pipe that comes from your home. However, this method entails digging up your yard to follow the pipe to the tank.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003eStep 2 - Dig Up Septic Tank Lid\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eAfter you have found the septic tank, you can begin the process of digging up the lid. Use a shovel to excavate the ground around the tank until you find the lid. It will be flat against the tank with a small seam around it. Dig the ground to create at least 16 inches of clearance on all sides of the lid. It is also recommended that you slope the land as you dig down to the lid so that the gravel will not fall back in.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003eStep 3 - Pry Off Septic Tank Lid\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eDepending on the size of the septic tank, the lid can be quite heavy. It is a solid piece of concrete that is flat on all sides. It may have a handle to pull on. The majority of \u003ca href=\"https://www.doityourself.com/stry/how-to-replace-a-septic-tank-lid\"\u003eseptic tank lids\u003c/a\u003e will require a pry bar to lift them out of their seating. Set the prybar in the seam and press down. As the lid lifts out of the hole, have someone move it to the side. Set the lid on the surface of the ground out of the way of the pumping vehicle.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eRemove a Septic Tank Lid FAQ\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h2\u003e\u003ch3\u003e\u003cspan\u003eHow do you lift a septic tank lid?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eBefore lifting a septic tank lid, scrape all the dirt away to start with a clean lid. Insert a screwdriver into the seam of the lid to break the seal.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen you have a small opening, use a pry bar to lift the lid the rest of the way. If you\u0026#39;re going to remove or move the lid, get help from at least one more person because this is not a solo task.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSome septic tank lids can be incredibly heavy and may in fact require special equipment to lift and move. Do not attempt to lift a septic tank lid, or anything else, that is too heavy for you to reasonably handle.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eCan I replace the lid on my septic tank?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eYou can replace the lid on a septic tank and this is something you should do if the lid is damaged, but this requires a professional. Septic tank lids must be the exact right size and they must be expertly placed in order to have a tight seal.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSeptic tank fumes can be dangerous and the septic tank lid is an essential security measure.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eShould septic tank lid be sealed?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eWhen the septic tank is not being serviced, the lid to the tank must be sealed. This prevents fumes and leaks, which are toxic and dangerous to humans and animals.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eHow heavy is a septic tank lid?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eModern, lightweight septic tank lids weigh less than 10 pounds. Older septic tank lids weigh far more because they are made of concrete, typically 60 to 80 pounds.\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eWhat happens if septic tank lid is cracked?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eCracked septic tank lids need to be replaced. Cracks can allow fumes and fluid to leak out of the tank, creating a hazardous situation.\u003c/span\u003e\u003c/p\u003e\n\n            \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2010-10-01T06:00:24Z",
  "modifiedTime": "2023-08-16T00:00:00Z"
}
