{
  "id": "c295d7c7-2b42-4cac-9a7c-07fb1410995c",
  "title": "Smartphone Wallet Apps Are Safe, but You Should Still Take These 5 Precautions",
  "link": "https://www.makeuseof.com/how-use-smartphone-wallets-safely/",
  "description": "I love my smartphone wallet app, but that doesn't mean I don't check its security settings.",
  "author": "Yadullah Abidi",
  "published": "Wed, 14 May 2025 23:06:52 GMT",
  "source": "https://www.makeuseof.com/feed/",
  "categories": [
    "Security",
    "Online Payments",
    "Smartphone Security"
  ],
  "byline": "Yadullah Abidi",
  "length": 16918,
  "excerpt": "I love my smartphone wallet app, but that doesn\u0026#039;t mean I don\u0026#039;t check its security settings.",
  "siteName": "MakeUseOf",
  "favicon": "https://static0.makeuseofimages.com/assets/images/favicon-240x240.df310da5.png",
  "text": "Sign in to your MUO account Yadullah Abidi / MakeUseOf Smartphone wallet apps are a super handy replacement for your physical wallet, holding your money, cards, identification, and more. They're super safe to use and make it easy to keep your most important cards nearby without having to lug a wallet or purse around—but there are still some serious precautions you should take. 1 Use Biometric Authentication Most, if not all, smartphones have a fingerprint scanner that you can use to lock both your phone and any apps on it. Digital wallets also support this functionality, letting you use your fingerprint or face to unlock the app. Yadullah Abidi / MakeUseOf Biometric authentication is one of the most secure signing mechanisms you can use. Passwords and PINs are useful, but they can be guessed, stolen, or phished. Biometric data is much harder for a cybercriminal to steal or replicate. It also ensures that even if your device is stolen or lost, someone can't waltz into your digital wallet app and start making payments. Make sure not to abandon your PIN and password altogether. Using a strong password or PIN to lock your phone is still important. In case biometric authentication fails, they come as your only option for accessing your wallet app and phone. 2 Regularly Monitor Account Activity This might sound obvious, but regularly monitoring account activity can help you catch any suspicious transactions before they snowball into bigger losses. Most wallet apps already send real-time notifications for each transaction, but you can always monitor your transaction history within the app. Yadullah Abidi / MakeUseOf Criminals often start with small transactions to test if an account is vulnerable without alerting the owner. Regularly reviewing your account also gives you a bird's eye view of what mode of payment might be leaking money. For example, if your credit card is compromised in a website data leak and hackers try to charge your account, you can spot the smaller, test transactions on your card. I recommend reviewing account activity at least once a week. As an added bonus, you'll also be more aware of where your money is going, which helps a long way in planning monthly budgets in my experience. Some wallet apps also let you set up custom transaction alerts based on the value or location of the transaction. These can immediately alert you to any transactions you might be unaware of. 3 Watch Out for Phishing Attacks Another tip is to always be on the lookout for phishing attacks attempting to steal your payment information. Hackers send scary-sounding fake emails and can even get past your inbox's spam filters. tete_escape/Shutterstock Despite your best efforts, a phishing page, malware, or other hack can always sneak by. For example, a MakeUseOf writer was phished on Steam and ended up losing money in the form of their wallet balance, despite years of experience online and with security matters. The best way to avoid getting phished is to take it slow, carefully read the message or email, and check the URL before clicking any links. There are numerous ways you can check for suspicious links in text messages. Furthermore, scammers often use QR codes, so be careful before scanning random QR codes in emails or messages. 4 Set Transaction Limits When Possible Setting transaction limits in your digital wallet apps is one of the best ways of protecting yourself from random incursions. Transaction limits were initially designed to help manage your finances, but they also double up as a preventive measure in case your wallet gets compromised. Even if an attacker gains access to your digital wallet and can make payments, your transaction limit will reduce the damage to your bank account, long enough for you to take action. Transaction limits don't actively protect your digital wallet or financial information from being abused, but they will keep a hacker from running away with all your money at once. 5 Disable Automatic Saving of Payment Information Digital wallets (especially Google Pay!) will ask to automatically save your payment information on a site you're checking out. Browsers and other apps also offer to link with your digital wallet to make your checkout experience more seamless and avoid the hassle of entering your card details and more every time you make a purchase. Bertel King / MakeUseOf I'll be the first to admit that this is extremely convenient and how online payments should be made. That said, it's also too much of a security risk. Once you let websites or apps start saving your financial data, you're also trusting them to safeguard it. And while safety isn't much of a risk at bigger retailers like Amazon, Best Buy, or eBay, smaller businesses that don't practice the best cybersecurity measures can inadvertently end up leaking your financial information to hackers. Disable automatic saving on your browser, and generally avoid the temptation with other apps as well. Entering your details manually for each purchase can be a hassle, but the peace of mind that comes with it is well worth the effort. The chances of your digital wallet being compromised on its own or on the company's end are quite slim. However, individual users are always a target for hackers and scammers looking to skim their money. Taking a few simple precautions can go a long way in protecting you from any crooks stealing your money.",
  "image": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \n                                                \n\n\n    \n                           \n            \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                                                                                    \n    \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n        \n                            \n            \n                \n    \n    \n        \n    \n\n    \n    \n            \n    \n    \n            \n    \n    \n    \n        \n    \n                        \n                        \n\n\u003cdiv\u003e\n                            \u003cp\u003e\u003cimg src=\"https://static1.makeuseofimages.com/wordpress%2Fwp-content%2Fauthors%2F662749420094d-bew.jpg?fit=crop\u0026amp;w=90\u0026amp;h=90\" alt=\"4\" loading=\"lazy\" decoding=\"async\"/\u003e\n                                    \u003c/p\u003e\n                    \u003c/div\u003e\n\n            \n\n\n            \u003ca id=\"login-button-article-sidebar\"\u003e\n            \u003cp\u003eSign in to your \u003cspan\u003eMUO\u003c/span\u003e account\u003c/p\u003e\n            \n        \u003c/a\u003e\n            \n                                \n                                    \n                                                                                                                        \n                        \n                                                    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;Yadullah Abidi \\/ MakeUseOf\u0026#34;\"\u003e\n\n        \n    \n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n            \n                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=1140\u0026amp;h=\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=1140\u0026amp;h=\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n            \n                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=943\u0026amp;h=\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=943\u0026amp;h=\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n            \n                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=767\u0026amp;h=\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=767\u0026amp;h=\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n            \n                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=480\u0026amp;h=\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG?q=49\u0026amp;fit=crop\u0026amp;w=480\u0026amp;h=\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2560\" height=\"1440\" alt=\"Digital wallets on an Android phone\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallets-featured.JPG\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eYadullah Abidi / MakeUseOf\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n    \u003c/div\u003e\n\n\n            \n                \n    \n    \n        \n    \n\n    \n            \u003c/div\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e\n\u003cp\u003eSmartphone wallet apps are a super handy replacement for your physical wallet, holding your money, cards, identification, and more. They\u0026#39;re super safe to use and make it easy to keep your most important cards nearby without having to lug a wallet or purse around—but there are still some serious precautions you should take.\u003c/p\u003e    \u003ch2 id=\"use-biometric-authentication\"\u003e\n            \u003cspan\u003e1 \u003c/span\u003e\n        \u003cspan\u003e\n                            Use Biometric Authentication\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eMost, if not all, smartphones have a fingerprint scanner that you can use to lock both your phone and any apps on it. Digital wallets also support this functionality, letting you use your fingerprint or face to unlock the app.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;Yadullah Abidi \\/ MakeUseOf\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2560\" height=\"1440\" loading=\"lazy\" decoding=\"async\" alt=\"Biometric scan request when opening Google Pay\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/google-pay-biometric-scan.JPG\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eYadullah Abidi / MakeUseOf\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e Biometric authentication is one of the most secure signing mechanisms you can use. Passwords and PINs are useful, but they can be guessed, stolen, or phished. Biometric data is much harder for a cybercriminal to steal or replicate. It also ensures that even if your device is stolen or lost, someone can\u0026#39;t waltz into your digital wallet app and start making payments.\u003c/p\u003e    \n\u003cp\u003eMake sure not to abandon your PIN and password altogether. Using a strong password or PIN to lock your phone is still important. In case biometric authentication fails, they come as your only option for accessing your wallet app and phone.\u003c/p\u003e    \u003ch2 id=\"regularly-monitor-account-activity\"\u003e\n            \u003cspan\u003e2 \u003c/span\u003e\n        \u003cspan\u003e\n                            Regularly Monitor Account Activity\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eThis might sound obvious, but regularly monitoring account activity can help you catch any suspicious transactions before they snowball into bigger losses. Most wallet apps already send real-time notifications for each transaction, but you can always monitor your transaction history within the app.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;Yadullah Abidi \\/ MakeUseOf\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2560\" height=\"1440\" loading=\"lazy\" decoding=\"async\" alt=\"Google Pay transaction history option\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/05/digital-wallet-transaction-history.JPG\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eYadullah Abidi / MakeUseOf\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e Criminals often start with small transactions to test if an account is vulnerable without alerting the owner. Regularly reviewing your account also gives you a bird\u0026#39;s eye view of what mode of payment might be leaking money. For example, if your credit card is compromised in a website data leak and hackers try to charge your account, you can spot the smaller, test transactions on your card.\u003c/p\u003e    \n\u003cp\u003eI recommend reviewing account activity at least once a week. As an added bonus, you\u0026#39;ll also be more aware of where your money is going, which helps a long way in planning monthly budgets in my experience. Some wallet apps also let you set up custom transaction alerts based on the value or location of the transaction. These can immediately alert you to any transactions you might be unaware of.\u003c/p\u003e    \u003ch2 id=\"watch-out-for-phishing-attacks\"\u003e\n            \u003cspan\u003e3 \u003c/span\u003e\n        \u003cspan\u003e\n                            Watch Out for Phishing Attacks\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eAnother tip is to always be on the lookout for phishing attacks attempting to steal your payment information. Hackers send \u003ca href=\"https://www.makeuseof.com/new-scam-scary-facebook-emails/\" target=\"_blank\"\u003escary-sounding fake emails\u003c/a\u003e and can even \u003ca href=\"https://www.makeuseof.com/scammers-sneak-emails-inbox/\" target=\"_blank\"\u003eget past your inbox\u0026#39;s spam filters\u003c/a\u003e.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;tete_escape\\/\u0026lt;a href=\\\u0026#34;https:\\/\\/www.shutterstock.com\\/image-photo\\/smishing-attack-sms-spam-phishing-scammer-2485921355\\\u0026#34; rel=\\\u0026#34;noopener noreferrer\\\u0026#34; target=\\\u0026#34;_blank\\\u0026#34;\u0026gt;Shutterstock\u0026lt;\\/a\u0026gt;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2100\" height=\"1400\" loading=\"lazy\" decoding=\"async\" alt=\"smishing text with envelope symbol next to laptop\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/11/smishing-text-with-envelope-symbol-next-to-laptop.jpg\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003etete_escape/\u003ca href=\"https://www.shutterstock.com/image-photo/smishing-attack-sms-spam-phishing-scammer-2485921355\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eShutterstock\u003c/a\u003e\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e Despite your best efforts, a phishing page, malware, or other hack can always sneak by. For example, \u003ca href=\"https://www.makeuseof.com/steam-phishing-scams-how-spot-avoid-respond/\" target=\"_blank\"\u003ea MakeUseOf writer was phished on Steam\u003c/a\u003e and ended up losing money in the form of their wallet balance, despite years of experience online and with security matters.\u003c/p\u003e    \n\u003cp\u003eThe best way to avoid getting phished is to take it slow, carefully read the message or email, and check the URL before clicking any links. There are numerous ways you can \u003ca href=\"https://www.makeuseof.com/suspicious-link-text-message-checked-safely/\" target=\"_blank\"\u003echeck for suspicious links in text messages\u003c/a\u003e. Furthermore, \u003ca href=\"https://www.makeuseof.com/how-spot-fake-qr-codes/\" target=\"_blank\"\u003escammers often use QR codes\u003c/a\u003e, so be careful before scanning random QR codes in emails or messages.\u003c/p\u003e    \u003ch2 id=\"set-transaction-limits-when-possible\"\u003e\n            \u003cspan\u003e4 \u003c/span\u003e\n        \u003cspan\u003e\n                            Set Transaction Limits When Possible\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eSetting transaction limits in your digital wallet apps is one of the best ways of protecting yourself from random incursions. Transaction limits were initially designed to help manage your finances, but they also double up as a preventive measure in case your wallet gets compromised.\u003c/p\u003e    \n\u003cp\u003eEven if an attacker gains access to your digital wallet and can make payments, your transaction limit will reduce the damage to your bank account, long enough for you to take action. Transaction limits don\u0026#39;t actively protect your digital wallet or financial information from being abused, but they will keep a hacker from running away with all your money at once.\u003c/p\u003e    \u003ch2 id=\"disable-automatic-saving-of-payment-information\"\u003e\n            \u003cspan\u003e5 \u003c/span\u003e\n        \u003cspan\u003e\n                            Disable Automatic Saving of Payment Information\n                    \u003c/span\u003e\n       \u003c/h2\u003e\n\u003cp\u003eDigital wallets (especially Google Pay!) will ask to automatically save your payment information on a site you\u0026#39;re checking out. Browsers and other apps also offer to link with your digital wallet to make your checkout experience more seamless and avoid the hassle of entering your card details and more every time you make a purchase.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                        \n    \n    \n    \n    \n    \u003cdiv data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;Bertel King \\/ MakeUseOf\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                \n                        \n            \n            \n                                        \n                        \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2560\" height=\"1440\" loading=\"lazy\" decoding=\"async\" alt=\"Privacy app creating virtual payment cards on a Galaxy Z Fold 6.\" data-img-url=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg\" src=\"https://static1.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/02/1000066187.jpg\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eBertel King / MakeUseOf\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e I\u0026#39;ll be the first to admit that this is extremely convenient and how online payments should be made. That said, it\u0026#39;s also too much of a security risk. Once you let websites or apps start saving your financial data, you\u0026#39;re also trusting them to safeguard it. And while safety isn\u0026#39;t much of a risk at bigger retailers like Amazon, Best Buy, or eBay, smaller businesses that don\u0026#39;t practice the best cybersecurity measures can inadvertently end up leaking your financial information to hackers.\u003c/p\u003e    \n\u003cp\u003eDisable automatic saving on your browser, and generally avoid the temptation with other apps as well. Entering your details manually for each purchase can be a hassle, but the peace of mind that comes with it is well worth the effort.\u003c/p\u003e    \n\u003cp\u003eThe chances of your digital wallet being compromised on its own or on the company\u0026#39;s end are quite slim. However, individual users are always a target for hackers and scammers looking to skim their money. Taking a few simple precautions can go a long way in protecting you from any crooks stealing your money.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "18 min read",
  "publishedTime": "2025-05-14T23:06:52Z",
  "modifiedTime": "2025-05-14T23:06:52Z"
}
