{
  "id": "c7f49ef6-25e4-4ad5-9fc2-3932fe13540c",
  "title": "This Round Wall Sconce Hack Is Our New Favorite DIY Project",
  "link": "https://ikeahackers.net/2024/10/round-wall-sconces-diy.html",
  "description": "Norwegian designer Camilla Bakken repurposed the popular SNUDDA lazy susan into a chic, spinning wall sconce! This innovative repurposing might just be the most unexpected use of a turntable yet. The SNUDDA, known for its practicality in the kitchen, has found a new life in Camilla’s hands. By attaching strip LED lights to three SNUDDA units, she created a unique lighting solution that added ambiance and functionality to her space. The lights are controlled via a remote and can be […] The post This Round Wall Sconce Hack Is Our New Favorite DIY Project appeared first on IKEA Hackers.",
  "author": "Jules Yap",
  "published": "Thu, 24 Oct 2024 10:00:00 +0000",
  "source": "https://www.ikeahackers.net/feed",
  "categories": [
    "Wall",
    "Latest on IG",
    "Snudda"
  ],
  "byline": "Jules Yap",
  "length": 2481,
  "excerpt": "Bakken's DIY process for these round wall sconces was simple, especially since the SNUDDA comes fully assembled. Here's how she did it.",
  "siteName": "IKEA Hackers",
  "favicon": "",
  "text": "Norwegian designer Camilla Bakken repurposed the popular SNUDDA lazy susan into a chic, spinning wall sconce! This innovative repurposing might just be the most unexpected use of a turntable yet. The SNUDDA, known for its practicality in the kitchen, has found a new life in Camilla’s hands. By attaching strip LED lights to three SNUDDA units, she created a unique lighting solution that added ambiance and functionality to her space. The lights are controlled via a remote and can be easily adjusted for the ideal brightness. Round Wall Sconce Hack Camilla’s DIY process for these round wall sconces was simple, especially since the SNUDDA comes fully assembled. To start, Camilla attached adhesive LED strips around the rotating base of each lazy susan. Next, she secured the battery pack alongside the base using double-sided tape, ensuring easy access for future battery replacements. Finally, she added strips of Velcro to the back of the SNUDDA and stuck them onto the wall where she wanted the wall lights. When it’s time to replace the batteries, all she needs to do is remove the sconces from the wall and switch them out. Camilla showcased her creation near her stairway, arranging the three sconces for maximum visual impact. I love how the rings of ambient light instantly enhance the space, adding subtle elegance and charm. Seen In A Positive Light The response to Bakken’s DIY project has been overwhelmingly positive, with over 252K likes on her Instagram account @camillabakken, hailing it as a “fresh idea” and pledging to “steal the idea”. Some felt the price was a bit steep. “But it’s $18 each for the lazy susan at IKEA while a wood circle at Lowe’s is half the price. No need to spin.” To which another explained “the lazy suzan allows space between the wall and the wooden platter for the LED strip to shine. You would need to add something to the back of the Home Depot round to set it off the wall for the LED strip to look good.” Another loved the idea but would recreate the IKEA hack with round mirrors instead. Yet another felt the wooden rounds should be painted the same color as the wall for a more muted effect. What are your thoughts on these round wall sconces made from IKEA lazy susans? Would you make one? Share your views in the comments below. And if you’ve got an IKEA hack of your own, do share it with us. Who knows? You might just see it featured in my next post.Browse all IKEA SNUDDA hacks.",
  "image": "https://ikeahackers.net/wp-content/uploads/2024/10/round-wall-sconces.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\u003cp\u003eNorwegian designer \u003ca href=\"https://www.instagram.com/p/C7cKKrWIMNr/\" target=\"_blank\" rel=\"noopener\"\u003eCamilla Bakken\u003c/a\u003e repurposed the popular SNUDDA lazy susan into a chic, spinning wall sconce! This innovative repurposing might just be the most unexpected use of a turntable yet.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe SNUDDA, known for its practicality in the kitchen, has found a new life in Camilla’s hands. By attaching strip LED lights to three SNUDDA units, she created a unique lighting solution that added ambiance and functionality to her space. The lights are controlled via a remote and can be easily adjusted for the ideal brightness.\u003c/p\u003e\n\n\n\n\u003ch2\u003eRound Wall Sconce Hack \u003c/h2\u003e\n\n\n\n\u003cp\u003eCamilla’s DIY process for these round wall sconces was simple, especially since the SNUDDA comes fully assembled. \u003c/p\u003e\n\n\n\n\u003cp\u003eTo start, Camilla attached adhesive LED strips around the rotating base of each lazy susan. Next, she secured the battery pack alongside the base using double-sided tape, ensuring easy access for future battery replacements. Finally, she added \u003ca href=\"https://amzn.to/4hg837y\" target=\"_blank\" rel=\"nofollow noreferrer noopener sponsored\"\u003estrips of Velcro\u003c/a\u003e to the back of the SNUDDA and stuck them onto the wall where she wanted the wall lights. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen it’s time to replace the batteries, all she needs to do is remove the sconces from the wall and switch them out. \u003c/p\u003e\n\n\n\n\u003cp\u003eCamilla showcased her creation near her \u003ca href=\"https://ikeahackers.net/2022/11/under-stairs-storage-ideas-ikea.html\" data-type=\"post\" data-id=\"1377\"\u003estairway\u003c/a\u003e, arranging the three sconces for maximum visual impact. I love how the rings of ambient light instantly enhance the space, adding subtle elegance and charm.\u003c/p\u003e\n\n\n\n\u003ch3\u003eSeen In A Positive Light\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe response to Bakken’s DIY project has been overwhelmingly positive, with over 252K likes on her Instagram account \u003ca href=\"https://www.instagram.com/p/C7cKKrWIMNr/\" target=\"_blank\" rel=\"noopener\"\u003e@camillabakken\u003c/a\u003e, hailing it as a “fresh idea” and pledging to “steal the idea”.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome felt the price was a bit steep. “But it’s $18 each for the lazy susan at IKEA while a wood circle at Lowe’s is half the price. No need to spin.” To which another explained “the lazy suzan allows space between the wall and the wooden platter for the LED strip to shine. You would need to add something to the back of the \u003ca href=\"https://www.homedepot.com/p/Handprint-1-4-in-x-18-in-Birch-Plywood-Circle-420518/313763558\" target=\"_blank\" rel=\"nofollow noreferrer noopener sponsored\"\u003eHome Depot round\u003c/a\u003e to set it off the wall for the LED strip to look good.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAnother loved the idea but would recreate the IKEA hack with round mirrors instead. Yet another felt the wooden rounds should be painted the same color as the wall for a more muted effect. \u003c/p\u003e\n\n\n\n\u003ccenter\u003e\u003cblockquote data-instgrm-permalink=\"https://www.instagram.com/reel/C7cKKrWIMNr/?utm_source=ig_embed\u0026amp;utm_campaign=loading\" data-instgrm-version=\"14\"\u003e\u003c/blockquote\u003e\n\u003c/center\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003eWhat are your thoughts on these round wall sconces made from IKEA lazy susans? Would you make one? Share your views in the comments below. \u003c/p\u003e\u003cp\u003eAnd if you’ve got an IKEA hack of your own, do \u003ca href=\"https://ikeahackers.net/submit-hack\"\u003eshare it with us\u003c/a\u003e. Who knows? You might just see it featured in my next post.\u003c/p\u003e\u003cp\u003eBrowse all \u003ca href=\"https://ikeahackers.net/tag/snudda\"\u003eIKEA SNUDDA hacks\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-24T06:00:00-04:00",
  "modifiedTime": null
}
