{
  "id": "d98e7af5-8a41-4e44-b968-fe1e0bdf8a7b",
  "title": "Quickly Launch Your Favorite Messages Chats from Anywhere on Your iPhone",
  "link": "https://ios.gadgethacks.com/how-to/ios-open-conversation-shortcut/",
  "description": "Your iPhone can already send messages with your voice, reply with a tap, and suggest words while you type. Now, with iOS 18.4, it can instantly launch a specific conversation from virtually anywhere on your device. Thanks to a new action in the Shortcuts app, you're just one tap (or Back Tap) away from texting your favorite contact. Apple introduced the new Open Conversation action in iOS 18.4, and it's also backward compatible with at least iOS 18.3.1. Whether you're setting it up for speed, accessibility, or just pure convenience, it's one of the most useful Shortcuts updates in recent memory. Here's how to create a shortcut that launches your most-used Messages threads — and how to run it from your Home Screen, Lock Screen, Action button, Back Tap, Control Center, or anywhere else Shortcuts can live. This is the most basic shortcut you can create, but you can add to it to create even more useful workflows. RequirementsiPhone or iPad running iOS 18.4 or iPadOS 18.4 or later...more",
  "author": "Justin Meyers",
  "published": "Wed, 16 Apr 2025 20:34:43 GMT",
  "source": "https://www.wonderhowto.com/rss.xml",
  "categories": null,
  "byline": "By Justin Meyers",
  "length": 6427,
  "excerpt": "Your iPhone can already send messages with your voice, reply with a tap, and suggest words while you type. Now, with iOS 18.4, it can instantly launch a specific conversation from virtually anywhere on your device. Thanks to a new action in the Shortcuts app, you're just one tap (or Back Tap) away from texting your favorite contact. Apple introduced the new Open Conversation action in iOS 18.4, and it's also backward compatible with at least iOS 18.3.1. Whether you're setting it up for speed, ac...",
  "siteName": "Gadget Hacks",
  "favicon": "",
  "text": "Your iPhone can already send messages with your voice, reply with a tap, and suggest words while you type. Now, with iOS 18.4, it can instantly launch a specific conversation from virtually anywhere on your device. Thanks to a new action in the Shortcuts app, you're just one tap (or Back Tap) away from texting your favorite contact.Apple introduced the new Open Conversation action in iOS 18.4, and it's also backward compatible with at least iOS 18.3.1. Whether you're setting it up for speed, accessibility, or just pure convenience, it's one of the most useful Shortcuts updates in recent memory.Here's how to create a shortcut that launches your most-used Messages threads — and how to run it from your Home Screen, Lock Screen, Action button, Back Tap, Control Center, or anywhere else Shortcuts can live. This is the most basic shortcut you can create, but you can add to it to create even more useful workflows.RequirementsiPhone or iPad running iOS 18.4 or iPadOS 18.4 or laterShortcuts app (preinstalled)At least one conversation in the Messages app Create a new shortcutStart by launching the Shortcuts app. Tap the Shortcuts tab if you aren't already there, then hit the plus (+) button to create a new workflow. This will be your launcher for a specific Messages conversation. Add the 'Open Conversation' actionIn the search bar, type Open Conversation, then tap the result with the green Messages icon. You'll now see a single Conversation field in the shortcut. Choose your chatTap that Conversation field, and a list of your message threads will appear, starting with the most recent active chats. Select the conversation you want to launch — it could be a friend, family member, group chat, or even yourself (great for quick notes). Rename the shortcutTo keep things organized, tap the chevron (∨) next to the name at the top and hit Rename. Label your shortcut with that chat's name and hit \"done\" on the keyboard to save it. You can also hit Choose Icon from the drop-down menu to change the shortcut's icon, but the default Messages icon is a good fit. Test and save itThat's all there is to it. Your shortcut is now ready to instantly open that exact thread in the Messages app. You can tap the play button to test it, then Done to save it.However, if you want to add an icon to your Home Screen for this shortcut, keep the workflow open and see the instructions below. Add the shortcut to your favorite triggerThe shortcut works on its own, but launching it from the Shortcuts app every time is actually more cumbersome than just opening Messages manually. To make it truly useful, you'll want to connect it to a quick-access trigger. Here are the best ways to do that: Add to the Home ScreenTo launch the chat with a tap from your Home Screen, add the shortcut as an app-style icon. From the Shortcuts tab, tap the ellipsis (•••) icon on the shortcut's card to open the editor if you're not already in it. Then, do one of the following:Tap the ⓥ (chevron) next to the name, then hit Add to Home Screen.Tap the Share button in the bottom toolbar, then hit Add to Home Screen.Tap the ⓘ (info) button in the bottom toolbar, then hit Add to Home Screen.Alternatively, you can touch and hold the shortcut's card on the Shortcuts tab and either tap Details » Add to Home Screen or Share » Add to Home Screen.Tap the Share icon at the bottom of the shortcut editor, then choose Add to Home Screen. Give it a name and icon, then tap Add in the top-right corner. Now you have a tappable icon on your Home Screen that opens your chosen thread. Use the Back Tap gestureTo open the chat by tapping the back of your iPhone two or three times, set up a Back Tap shortcut. Go to Settings » Accessibility » Touch » Back Tap, then choose Double Tap or Triple Tap. Scroll down and tap your shortcut's name. Now, tapping the back of your iPhone will instantly open the conversation — no need to unlock or swipe.On iOS 18.5, a banner appears every time Back Tap is triggered, which can get annoying. However, you can turn off the Show Banner switch in Back Tap's settings to stop it. Assign to the Action button (iPhone 15 Pro or later)If you're using an iPhone 15 Pro or newer, you can assign your Open Conversation shortcut to your Action button above the volume buttons. Go to Settings » Action Button. Swipe to the Shortcut option, tap Choose a Shortcut, and pick the one you just created.A long press of the Action button will now open your selected Messages thread. Add to Control CenterYou can also add the shortcut directly to your Control Center, which is accessible from virtually any screen on your iPhone. Swipe open your Control Center, touch and hold the background, choose Add a Control, and find and select the Shortcut option. From the shortcut selector, choose your Open Conversation shortcut, and it will be added as a control in Control Center, where you can access it at any time. Use on the Lock ScreenYou can also add your chat shortcut to the Lock Screen for near-instant access. Open the Lock Screen, long-press the background, choose Customize, select Lock Screen, and remove one of the two controls at the bottom. Then, tap the plus (+) button and find and select the Shortcut option. From the shortcut selector, choose your Open Conversation shortcut, and it will be added as a control on your Lock Screen. Simply press it to open the chat.You can also add it as a widget if you don't want to waste one of your two control spots. On the Lock Screen editor, tap the widget space, find and select Shortcut, then tap its icon after it appears in the widget space below the time. Next, select your chat shortcut and save it. Then, tap the widget to open the chat. Final thoughtsThe Open Conversation action is one of those Apple features that feels like it should've existed years ago — and now that it's here, it unlocks new possibilities for faster communication. Whether you're constantly texting a partner or in a work chat or note-to-self thread, it saves time and taps.And since it's a native iOS feature, it works securely and smoothly without needing third-party messaging apps or complex workarounds. Combine it with other Shortcuts magic — like Dictate Text, Ask for Input, or Speak Text — and you've got a powerful messaging tool that bends to your workflow.Don't Miss: 70+ iPhone Features in iOS 18.4 — Here's Everything That's New and ChangedCover photo and screenshots by Gadget Hacks.",
  "image": "https://assets.content.technologyadvice.com/messages_app_icon_and_shortcut_home_screen_close_up_7d892ece82.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"contents\" itemprop=\"articleBody\"\u003e \u003cp\u003eYour iPhone can already send messages with your voice, reply with a tap, and suggest words while you type. Now, with \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/news/ios-18.4-features/\"\u003eiOS 18.4\u003c/a\u003e, it can instantly launch a specific conversation from virtually anywhere on your device. Thanks to a new action in the \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://food-hacks.wonderhowto.com/collection/shortcuts/\"\u003eShortcuts\u003c/a\u003e app, you\u0026#39;re just one tap (or Back Tap) away from texting your favorite contact.\u003c/p\u003e\u003cp\u003eApple introduced the new Open Conversation action in iOS 18.4, and it\u0026#39;s also backward compatible with at least iOS 18.3.1. Whether you\u0026#39;re setting it up for speed, accessibility, or just pure convenience, it\u0026#39;s one of the most useful Shortcuts updates in recent memory.\u003c/p\u003e\u003cp\u003eHere\u0026#39;s how to create a shortcut that launches your most-used Messages threads — and how to run it from your Home Screen, Lock Screen, Action button, Back Tap, Control Center, or anywhere else Shortcuts can live. This is the most basic shortcut you can create, but you can add to it to create even more useful workflows.\u003c/p\u003e\u003ch2\u003e\u003cspan id=\"jump-requirements\"\u003e\u003c/span\u003eRequirements\u003c/h2\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eiPhone or iPad running iOS 18.4 or iPadOS 18.4 or later\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eShortcuts app (preinstalled)\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eAt least one conversation in the Messages app\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"1\"\u003e\u003cspan id=\"jump-step1\"\u003e\u003c/span\u003eCreate a new shortcut\u003c/h2\u003e\u003cp\u003eStart by launching the Shortcuts app. Tap the Shortcuts tab if you aren\u0026#39;t already there, then hit the plus (+) button to create a new workflow. This will be your launcher for a specific Messages conversation.\u003c/p\u003e\u003castro-island uid=\"1fOmrr\" prefix=\"v26\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/start_new_shortcut_ios_f6b93cdac6.webp\\\u0026#34; alt=\\\u0026#34;iPhone Shortcuts app showing saved shortcuts on the home screen and a blank new shortcut editor ready for actions.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_start_new_shortcut_ios_f6b93cdac6.webp 60w, https://assets.content.technologyadvice.com/thumbnail_start_new_shortcut_ios_f6b93cdac6.webp 147w, https://assets.content.technologyadvice.com/small_start_new_shortcut_ios_f6b93cdac6.webp 470w, https://assets.content.technologyadvice.com/medium_start_new_shortcut_ios_f6b93cdac6.webp 704w, https://assets.content.technologyadvice.com/large_start_new_shortcut_ios_f6b93cdac6.webp 939w, https://assets.content.technologyadvice.com/xlarge_start_new_shortcut_ios_f6b93cdac6.webp 1803w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632255\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"2\"\u003e\u003cspan id=\"jump-step2\"\u003e\u003c/span\u003eAdd the \u0026#39;Open Conversation\u0026#39; action\u003c/h2\u003e\u003cp\u003eIn the search bar, type Open Conversation, then tap the result with the green Messages icon. You\u0026#39;ll now see a single Conversation field in the shortcut.\u003c/p\u003e\u003castro-island uid=\"1MaJvt\" prefix=\"v27\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_action_ios_83cea38707.webp\\\u0026#34; alt=\\\u0026#34;Shortcuts app showing \u0026amp;quot;Open Conversation\u0026amp;quot; selected from search and added to a new shortcut.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_action_ios_83cea38707.webp 60w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_action_ios_83cea38707.webp 147w, https://assets.content.technologyadvice.com/small_open_conversation_action_ios_83cea38707.webp 470w, https://assets.content.technologyadvice.com/medium_open_conversation_action_ios_83cea38707.webp 704w, https://assets.content.technologyadvice.com/large_open_conversation_action_ios_83cea38707.webp 939w, https://assets.content.technologyadvice.com/xlarge_open_conversation_action_ios_83cea38707.webp 1803w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632254\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"3\"\u003e\u003cspan id=\"jump-step3\"\u003e\u003c/span\u003eChoose your chat\u003c/h2\u003e\u003cp\u003eTap that Conversation field, and a list of your message threads will appear, starting with the most recent active chats. Select the conversation you want to launch — it could be a friend, family member, group chat, or even yourself (great for quick notes).\u003c/p\u003e\u003castro-island uid=\"Z19VEUD\" prefix=\"v28\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_chat_selection_ios_b824169360.webp\\\u0026#34; alt=\\\u0026#34;iOS Shortcuts setup showing the \u0026#39;Open Conversation\u0026#39; action configured to launch the \u0026#39;Gadget Hacks\u0026#39; thread from the Messages app.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_chat_selection_ios_b824169360.webp 60w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_chat_selection_ios_b824169360.webp 147w, https://assets.content.technologyadvice.com/small_open_conversation_chat_selection_ios_b824169360.webp 470w, https://assets.content.technologyadvice.com/medium_open_conversation_chat_selection_ios_b824169360.webp 704w, https://assets.content.technologyadvice.com/large_open_conversation_chat_selection_ios_b824169360.webp 939w, https://assets.content.technologyadvice.com/xlarge_open_conversation_chat_selection_ios_b824169360.webp 1803w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632296\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"4\"\u003e\u003cspan id=\"jump-step4\"\u003e\u003c/span\u003eRename the shortcut\u003c/h2\u003e\u003cp\u003eTo keep things organized, tap the chevron (\u003cstrong\u003e∨\u003c/strong\u003e) next to the name at the top and hit Rename. Label your shortcut with that chat\u0026#39;s name and hit \u0026#34;done\u0026#34; on the keyboard to save it. You can also hit Choose Icon from the drop-down menu to change the shortcut\u0026#39;s icon, but the default Messages icon is a good fit.\u003c/p\u003e\u003castro-island uid=\"1J3kmT\" prefix=\"v29\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/rename_open_conversation_shortcut_63fe53cb53.webp\\\u0026#34; alt=\\\u0026#34;iOS Shortcuts app showing how to rename a shortcut to \u0026#39;Gadget Hacks Chat\u0026#39; after selecting the Messages conversation and configuring the action.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_rename_open_conversation_shortcut_63fe53cb53.webp 64w, https://assets.content.technologyadvice.com/thumbnail_rename_open_conversation_shortcut_63fe53cb53.webp 214w, https://assets.content.technologyadvice.com/small_rename_open_conversation_shortcut_63fe53cb53.webp 500w, https://assets.content.technologyadvice.com/medium_rename_open_conversation_shortcut_63fe53cb53.webp 750w, https://assets.content.technologyadvice.com/large_rename_open_conversation_shortcut_63fe53cb53.webp 1000w, https://assets.content.technologyadvice.com/xlarge_rename_open_conversation_shortcut_63fe53cb53.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632290\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"5\"\u003e\u003cspan id=\"jump-step5\"\u003e\u003c/span\u003eTest and save it\u003c/h2\u003e\u003cp\u003eThat\u0026#39;s all there is to it. Your shortcut is now ready to instantly open that exact thread in the Messages app. You can tap the play button to test it, then Done to save it.\u003c/p\u003e\u003cp\u003eHowever, if you want to add an icon to your Home Screen for this shortcut, keep the workflow open and see the instructions below.\u003c/p\u003e\u003castro-island uid=\"Z7Uftz\" prefix=\"v30\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_test_and_save_ios_dd27780fd3.webp\\\u0026#34; alt=\\\u0026#34;Final setup screen confirming the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut opens the correct Messages thread, with a sample conversation previewed after testing.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_test_and_save_ios_dd27780fd3.webp 60w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_test_and_save_ios_dd27780fd3.webp 147w, https://assets.content.technologyadvice.com/small_open_conversation_test_and_save_ios_dd27780fd3.webp 470w, https://assets.content.technologyadvice.com/medium_open_conversation_test_and_save_ios_dd27780fd3.webp 704w, https://assets.content.technologyadvice.com/large_open_conversation_test_and_save_ios_dd27780fd3.webp 939w, https://assets.content.technologyadvice.com/xlarge_open_conversation_test_and_save_ios_dd27780fd3.webp 1803w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632289\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2 data-ordered=\"\" data-prefix=\"Step\" data-ordered-count=\"6\"\u003e\u003cspan id=\"jump-step6\"\u003e\u003c/span\u003eAdd the shortcut to your favorite trigger\u003c/h2\u003e\u003cp\u003eThe shortcut works on its own, but launching it from the Shortcuts app every time is actually more cumbersome than just opening Messages manually. To make it truly useful, you\u0026#39;ll want to connect it to a quick-access trigger. Here are the best ways to do that:\u003c/p\u003e \u003ch3\u003e\u003cspan id=\"jump-addtothehomescreen\"\u003e\u003c/span\u003eAdd to the Home Screen\u003c/h3\u003e\u003cp\u003eTo launch the chat with a tap from your Home Screen, add the shortcut as an app-style icon. From the Shortcuts tab, tap the ellipsis (•••) icon on the shortcut\u0026#39;s card to open the editor if you\u0026#39;re not already in it. Then, do one of the following:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eTap the ⓥ (chevron) next to the name, then hit \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/how-to/you-dont-need-safari-add-web-apps-your-iphones-home-screen-try-these-browsers-instead-0385351/\"\u003eAdd to Home Screen\u003c/a\u003e.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eTap the Share button in the bottom toolbar, then hit Add to Home Screen.\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eTap the ⓘ (info) button in the bottom toolbar, then hit Add to Home Screen.\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eAlternatively, you can touch and hold the shortcut\u0026#39;s card on the Shortcuts tab and either tap Details » Add to Home Screen or Share » Add to Home Screen.\u003c/p\u003e\u003cp\u003eTap the Share icon at the bottom of the shortcut editor, then choose Add to Home Screen. Give it a name and icon, then tap Add in the top-right corner. Now you have a tappable icon on your Home Screen that opens your chosen thread.\u003c/p\u003e\u003castro-island uid=\"Zsu1ap\" prefix=\"v31\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_add_to_home_screen_ios_0a4c5b6405.webp\\\u0026#34; alt=\\\u0026#34;Steps for adding the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut to the iOS Home Screen, from shortcut options to final placement among app icons.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 214w, https://assets.content.technologyadvice.com/small_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_add_to_home_screen_ios_0a4c5b6405.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632292\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch3\u003e\u003cspan id=\"jump-usethebacktapgesture\"\u003e\u003c/span\u003eUse the Back Tap gesture\u003c/h3\u003e\u003cp\u003eTo open the chat by tapping the back of your iPhone two or three times, set up a \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/collection/back-tap-uses/\"\u003eBack Tap\u003c/a\u003e shortcut. Go to Settings » Accessibility » Touch » Back Tap, then choose Double Tap or Triple Tap. Scroll down and tap your shortcut\u0026#39;s name. Now, tapping the back of your iPhone will instantly open the conversation — no need to unlock or swipe.\u003c/p\u003e\u003cp\u003eOn \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/news/ios-18.5-features/\"\u003eiOS 18.5\u003c/a\u003e, a banner appears every time Back Tap is triggered, which can get annoying. However, you can turn off the Show Banner switch in Back Tap\u0026#39;s settings to stop it.\u003c/p\u003e\u003castro-island uid=\"ZGyqWC\" prefix=\"v32\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_back_tap_ios_d4e870fd23.webp\\\u0026#34; alt=\\\u0026#34;iOS Accessibility settings showing how to assign the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut to a Back Tap gesture using Double Tap or Triple Tap.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_back_tap_ios_d4e870fd23.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_back_tap_ios_d4e870fd23.webp 214w, https://assets.content.technologyadvice.com/small_open_conversation_back_tap_ios_d4e870fd23.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_back_tap_ios_d4e870fd23.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_back_tap_ios_d4e870fd23.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_back_tap_ios_d4e870fd23.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632293\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch3\u003e\u003cspan id=\"jump-assigntotheactionbuttoniphone15proorlater\"\u003e\u003c/span\u003eAssign to the Action button (iPhone 15 Pro or later)\u003c/h3\u003e\u003cp\u003eIf you\u0026#39;re using an iPhone 15 Pro or newer, you can assign your Open Conversation shortcut to your \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/how-to/program-your-iphones-physical-buttons-open-apps-perform-actions-do-almost-anything-else-0385546/\"\u003eAction button\u003c/a\u003e above the volume buttons. Go to Settings » Action Button. Swipe to the Shortcut option, tap Choose a Shortcut, and pick the one you just created.\u003c/p\u003e\u003cp\u003eA long press of the Action button will now open your selected Messages thread.\u003c/p\u003e\u003castro-island uid=\"1JjBbb\" prefix=\"v33\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_action_button_ios_0d57f6f770.webp\\\u0026#34; alt=\\\u0026#34;iOS Settings showing how to assign a Shortcut to the Action Button, with \u0026#39;Gadget Hacks Chat\u0026#39; selected as the custom shortcut.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_action_button_ios_0d57f6f770.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_action_button_ios_0d57f6f770.webp 214w, https://assets.content.technologyadvice.com/small_open_conversation_action_button_ios_0d57f6f770.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_action_button_ios_0d57f6f770.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_action_button_ios_0d57f6f770.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_action_button_ios_0d57f6f770.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632297\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch3\u003e\u003cspan id=\"jump-addtocontrolcenter\"\u003e\u003c/span\u003eAdd to Control Center\u003c/h3\u003e\u003cp\u003eYou can also add the shortcut directly to your \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://apple.gadgethacks.com/how-to/apples-massive-control-center-update-gives-you-11-new-must-try-features-iphone-and-ipad-0385595/\"\u003eControl Center\u003c/a\u003e, which is accessible from virtually any screen on your iPhone. Swipe open your Control Center, touch and hold the background, choose Add a Control, and find and select the Shortcut option. From the shortcut selector, choose your Open Conversation shortcut, and it will be added as a control in Control Center, where you can access it at any time.\u003c/p\u003e\u003castro-island uid=\"Z19gtG1\" prefix=\"v34\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_control_center_ios_3e08246888.webp\\\u0026#34; alt=\\\u0026#34;Steps to run the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut from Control Center, including selecting the Shortcut action and choosing the custom shortcut.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_control_center_ios_3e08246888.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_control_center_ios_3e08246888.webp 214w, https://assets.content.technologyadvice.com/small_open_conversation_control_center_ios_3e08246888.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_control_center_ios_3e08246888.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_control_center_ios_3e08246888.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_control_center_ios_3e08246888.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632294\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch3\u003e\u003cspan id=\"jump-useonthelockscreen\"\u003e\u003c/span\u003eUse on the Lock Screen\u003c/h3\u003e\u003cp\u003eYou can also add your chat shortcut to the \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://apple.gadgethacks.com/how-to/your-lock-screen-just-got-13-times-cooler-with-ios-18-and-ipados-18-0385589/\"\u003eLock Screen\u003c/a\u003e for near-instant access. Open the Lock Screen, long-press the background, choose Customize, select Lock Screen, and remove one of the two controls at the bottom. Then, tap the plus (+) button and find and select the Shortcut option. From the shortcut selector, choose your Open Conversation shortcut, and it will be added as a control on your Lock Screen. Simply press it to open the chat.\u003c/p\u003e\u003castro-island uid=\"Z1HEgOA\" prefix=\"v35\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_lock_screen_ios_93ce99f369.webp\\\u0026#34; alt=\\\u0026#34;Steps to add the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut to the iOS Lock Screen using a customizable Shortcut widget.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_lock_screen_ios_93ce99f369.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_lock_screen_ios_93ce99f369.webp 245w, https://assets.content.technologyadvice.com/small_open_conversation_lock_screen_ios_93ce99f369.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_lock_screen_ios_93ce99f369.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_lock_screen_ios_93ce99f369.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_lock_screen_ios_93ce99f369.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632295\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e\u003cp\u003eYou can also add it as a widget if you don\u0026#39;t want to waste one of your two control spots. On the Lock Screen editor, tap the widget space, find and select Shortcut, then tap its icon after it appears in the widget space below the time. Next, select your chat shortcut and save it. Then, tap the widget to open the chat.\u003c/p\u003e\u003castro-island uid=\"28tc5Y\" prefix=\"v36\" component-url=\"https://static.gadgethacks.com/_astro/CarouselArticleImages.CPzxo3fu.js\" component-export=\"default\" renderer-url=\"https://static.gadgethacks.com/_astro/client.D34J9Mg-.js\" props=\"{\u0026#34;images\u0026#34;:[1,[[0,\u0026#34;\u0026lt;img src=\\\u0026#34;https://assets.content.technologyadvice.com/open_conversation_lock_screen_widget_ios_5c2c96a947.webp\\\u0026#34; alt=\\\u0026#34;iOS Lock Screen customization showing how to add a Shortcut widget and assign it to the \u0026#39;Gadget Hacks Chat\u0026#39; shortcut for quick access.\\\u0026#34; srcset=\\\u0026#34;https://assets.content.technologyadvice.com/xsmall_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 64w, https://assets.content.technologyadvice.com/thumbnail_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 214w, https://assets.content.technologyadvice.com/small_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 500w, https://assets.content.technologyadvice.com/medium_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 750w, https://assets.content.technologyadvice.com/large_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 1000w, https://assets.content.technologyadvice.com/xlarge_open_conversation_lock_screen_widget_ios_5c2c96a947.webp 1920w\\\u0026#34; sizes=\\\u0026#34;(min-width: 768px) 80vw, 100vw\\\u0026#34; data-id=\\\u0026#34;632291\\\u0026#34;\u0026gt;\u0026#34;]]]}\" ssr=\"\" client=\"visible\" opts=\"{\u0026#34;name\u0026#34;:\u0026#34;CarouselArticleImages\u0026#34;,\u0026#34;value\u0026#34;:true}\" await-children=\"\"\u003e\u003c/astro-island\u003e \u003ch2\u003e\u003cspan id=\"jump-finalthoughts\"\u003e\u003c/span\u003eFinal thoughts\u003c/h2\u003e\u003cp\u003eThe Open Conversation action is one of those Apple features that feels like it should\u0026#39;ve existed years ago — and now that it\u0026#39;s here, it unlocks new possibilities for faster communication. Whether you\u0026#39;re constantly texting a partner or in a work chat or note-to-self thread, it saves time and taps.\u003c/p\u003e\u003cp\u003eAnd since it\u0026#39;s a native iOS feature, it works securely and smoothly without needing third-party messaging apps or complex workarounds. Combine it with other Shortcuts magic — like Dictate Text, Ask for Input, or Speak Text — and you\u0026#39;ve got a powerful messaging tool that bends to your workflow.\u003c/p\u003e\u003cblockquote data-type=\"pullquote\"\u003e\u003cp\u003e\u003cstrong\u003eDon\u0026#39;t Miss: \u003c/strong\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://ios.gadgethacks.com/news/ios-18.4-features/\"\u003e\u003cstrong\u003e70+ iPhone Features in iOS 18.4 — Here\u0026#39;s Everything That\u0026#39;s New and Changed\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp\u003e\u003cem\u003eCover photo and screenshots by Gadget Hacks.\u003c/em\u003e\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
