{
  "id": "ee50ff32-91eb-4b1a-a7c5-c20d12036ab0",
  "title": "What Happened to the Android One Program?",
  "link": "https://www.howtogeek.com/what-happened-to-android-one/",
  "description": "The promise of stock-like Android fell short.",
  "author": "Arol Wright",
  "published": "Sun, 01 Dec 2024 22:30:14 GMT",
  "source": "https://www.howtogeek.com/feed/",
  "categories": [
    "Android",
    "Motorola",
    "Samsung",
    "Google Pixel"
  ],
  "byline": "Arol Wright",
  "length": 10059,
  "excerpt": "The promise of stock-like Android fell short.",
  "siteName": "How-To Geek",
  "favicon": "https://www.howtogeek.com/public/build/images/favicon-240x240.f06f736a.png",
  "text": "Quick Links What Is the Android One Program? What Happened to Android One? Should Android One Be Brought Back? Android One was a great idea on paper—a range of phones with Google's core software and no bloatware, often meaning stock-like Android and fast updates. It was awesome, and it produced some great phones, until one day it just... didn't. What Is the Android One Program? The Android One program launched in 2014 as a program by Google to work with OEMs to produce smartphones supported by Google's software. Back then, stock-like Android was perceived by many as the preferred version of Android, since it was more lightweight than Android builds with third-party skins on top. The Android One program was a great way to get a phone that featured this lightweight Android without having to break the bank and buy something like a Google Nexus phone, which were expensive. It was first conceived mostly for budget phones. The first batch of Android One phones launched around 2014-2015 were released mostly in emerging markets, such as India, Bangladesh, and Indonesia, and Google partnered with local brands there to release phones for those markets. The program then got a massive boost in 2017-2018, where it began to serve as a sort of spiritual successor to the Google Play Edition program. This was an initiative which saw big flagship phones launch in a stock Android version, with Google supplying updates instead of the manufacturer. HMD This wasn't a 1:1 replacement, though—while the Google Play Edition program gave us things such as a Samsung Galaxy S4 running Google Android, the Android One program instead gave us phones conceived from the ground up to run stock-like software, with Google helping out with software but not outright providing it. Manufacturers were still allowed to, for one, add proprietary software features as long as they were useful things (not bloatware) and didn't detract from the overall experience. Xiaomi, a Chinese smartphone maker, notably launched one of the first global Android One devices, the Xiaomi Mi A1, which sported stock-like Android rather than the company's heavy MIUI interface. Motorola followed it closely with the first Android One phone available in the United States, the Moto X4. From there, the first batch of Nokia phones powered by Android was released, with many of them belonging to the Android One program. And then it just kept getting bigger. What Happened to Android One? The program began losing steam around 2019. Then, the last Xiaomi phone in the Android One program, the Xiaomi Mi A3, was launched, and other manufacturers such as Motorola, Sharp, and Nokia were also launching theirs. By 2020, however, the only company that remained seriously releasing Android One phones was Nokia, and it did so until 2022. To be fair, Nokia's UI was already pretty stock-like even in non-Android One devices, so it was pretty easy for the company to get certified for that label and slap it on newer releases. In 2023, only one Android One phone, the Kyocera Android One S10, was launched, and it was a Japan-only device. As of the time of writing, in 2024, no new Android One phones have launched since then, and I'm not aware of any that are currently in the works. As for why this happened, OEMs stop doing stuff because it's not selling, and it's probably the same story here. Nowadays, people that are looking for a specifically stock-like Android experience are a minority, and they're likely well served by the Google Pixel range of phones—especially considering that you don't have to go full flagship thanks to A-series entries. Other OEMs, such as Samsung, do use heavy skins, but Samsung started taking its software experience more seriously starting in 2019. One UI isn't stock Android, but it's great. Should Android One Be Brought Back? Lucas Gouveia / How-To Geek | Overearth / Shutterstock The whole situation begs the question of whether it should be brought back. Frankly, I don't think so. Doing the same thing all over again isn't suddenly going to make people interested. What I would seriously like, however, is a resurrection of the Google Play Edition program. Not because of the whole stock-like Android schtick (which is a bonus, but wouldn't be the main point), but for another important reason: updates. With Google providing up to seven years of updates on their phones and most OEMs only committing to rolling out at least four (with most of them only committing to three or two), there's a serious argument to be made for non-Pixel phones where Google handles updates. There aren't a lot of phones that actually last long, keep their resale value, get updates promptly, and aren't end-of-life within three years. This will probably never happen, but I can dream.",
  "image": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/android-one-logo-with-question-marks-around.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article-body\" itemprop=\"articleBody\"\u003e        \u003cdiv\u003e\n        \u003ch3\u003eQuick Links\u003c/h3\u003e\n        \u003cdiv\u003e\n                                                                                                    \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#what-is-the-android-one-program\"\u003eWhat Is the Android One Program?\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#what-happened-to-android-one\"\u003eWhat Happened to Android One?\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n                                                                                            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cdiv\u003e\n                                        \u003cp\u003e\u003ca href=\"#should-android-one-be-brought-back\"\u003eShould Android One Be Brought Back?\u003c/a\u003e\n                                        \u003c/p\u003e\u003c/div\u003e\n                                    \u003c/li\u003e\n            \u003c/ul\u003e\n            \n            \u003c/div\u003e\n    \u003c/div\u003e\n\n\u003cp\u003eAndroid One was a great idea on paper—a range of phones with Google\u0026#39;s core software and no bloatware, often meaning stock-like Android and fast updates. It was awesome, and it produced some great phones, until one day it just... didn\u0026#39;t.\u003c/p\u003e    \u003ch2 id=\"what-is-the-android-one-program\"\u003e\n                        What Is the Android One Program?\n               \u003c/h2\u003e\n\u003cp\u003eThe Android One program launched in 2014 as a program by Google to work with \u003ca href=\"https://www.howtogeek.com/782895/what-does-oem-mean-for-computers/\" target=\"_blank\"\u003eOEMs\u003c/a\u003e to produce smartphones supported by Google\u0026#39;s software. Back then, stock-like Android was perceived by many as the preferred version of Android, since it was more lightweight than Android builds with third-party skins on top. The Android One program was a great way to get a phone that featured this lightweight Android without having to break the bank and buy something like a Google Nexus phone, which were expensive.\u003c/p\u003e    \n\u003cp\u003eIt was first conceived mostly for budget phones. The first batch of Android One phones launched around 2014-2015 were released mostly in emerging markets, such as India, Bangladesh, and Indonesia, and Google partnered with local brands there to release phones for those markets.\u003c/p\u003e    \n\u003cp\u003eThe program then got a massive boost in 2017-2018, where it began to serve as a sort of spiritual successor to the \u003ca href=\"https://www.howtogeek.com/177964/google-play-editions-explained-why-theyre-useful-even-if-you-dont-buy-one/\" target=\"_blank\"\u003eGoogle Play Edition program\u003c/a\u003e. This was an initiative which saw big flagship phones launch in a stock Android version, with Google supplying updates instead of the manufacturer.\u003c/p\u003e    \n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \u003cdiv data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;HMD\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=70\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=1\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"1200\" height=\"675\" loading=\"lazy\" decoding=\"async\" alt=\"HMD Nokia smartphones.\" data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg\" src=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2022/01/hmd-nokia-2022-phones.jpg\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eHMD\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e This wasn\u0026#39;t a 1:1 replacement, though—while the Google Play Edition program gave us things such as a Samsung Galaxy S4 running Google Android, the Android One program instead gave us phones conceived from the ground up to run stock-like software, with Google helping out with software but not outright providing it. Manufacturers were still allowed to, for one, add proprietary software features as long as they were useful things (not bloatware) and didn\u0026#39;t detract from the overall experience.\u003c/p\u003e    \n\u003cp\u003eXiaomi, a Chinese smartphone maker, notably launched one of the first global Android One devices, the Xiaomi Mi A1, which sported stock-like Android rather than the company\u0026#39;s heavy MIUI interface. Motorola followed it closely with the first Android One phone available in the United States, the Moto X4. From there, the first batch of Nokia phones powered by Android was released, with many of them belonging to the Android One program. And then it just kept getting bigger.\u003c/p\u003e    \u003ch2 id=\"what-happened-to-android-one\"\u003e\n                        What Happened to Android One?\n               \u003c/h2\u003e\n\u003cp\u003eThe program began losing steam around 2019. Then, the last Xiaomi phone in the Android One program, the Xiaomi Mi A3, was launched, and other manufacturers such as Motorola, Sharp, and Nokia were also launching theirs.\u003c/p\u003e    \n\u003cp\u003eBy 2020, however, the only company that remained seriously releasing Android One phones was Nokia, and it did so until 2022. To be fair, Nokia\u0026#39;s UI was already pretty stock-like even in non-Android One devices, so it was pretty easy for the company to get certified for that label and slap it on newer releases.\u003c/p\u003e    \n\u003cp\u003eIn 2023, only one Android One phone, the Kyocera Android One S10, was launched, and it was a Japan-only device. As of the time of writing, in 2024, no new Android One phones have launched since then, and I\u0026#39;m not aware of any that are currently in the works.\u003c/p\u003e    \n\u003cp\u003eAs for why this happened, OEMs stop doing stuff because it\u0026#39;s not selling, and it\u0026#39;s probably the same story here. Nowadays, people that are looking for a specifically \u003ca href=\"https://www.howtogeek.com/stock-android-doesnt-exist-anymore-and-it-never-did/\" target=\"_blank\"\u003estock-like Android experience\u003c/a\u003e are a minority, and they\u0026#39;re likely well served by the Google Pixel range of phones—especially considering that you don\u0026#39;t have to go full flagship thanks to A-series entries.\u003c/p\u003e    \n\u003cp\u003eOther OEMs, such as Samsung, do use heavy skins, but Samsung started taking its software experience more seriously starting in 2019. \u003ca href=\"https://www.howtogeek.com/samsungs-one-ui-is-android-how-it-should-be/\" target=\"_blank\"\u003eOne UI isn\u0026#39;t stock Android, but it\u0026#39;s great\u003c/a\u003e.\u003c/p\u003e    \u003ch2 id=\"should-android-one-be-brought-back\"\u003e\n                        Should Android One Be Brought Back?\n               \u003c/h2\u003e\n                \n    \n    \n    \n                \n    \n                \n        \n                                                            \n                                                                                                                        \n                                                                        \n    \n    \n    \u003cdiv data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg\" data-modal-id=\"single-image-modal\" data-modal-container-id=\"single-image-modal-container\" data-img-caption=\"\u0026#34;Lucas Gouveia \\/ How-To Geek | Overearth \\/ \u0026lt;a href=\\\u0026#34;https:\\/\\/www.shutterstock.com\\/image-vector\\/isometric-mobile-phone-vector-mockup-group-2471112101\\\u0026#34; rel=\\\u0026#34;noreferrer noopener\\\u0026#34; target=\\\u0026#34;_blank\\\u0026#34;\u0026gt;Shutterstock\u0026lt;\\/a\u0026gt;\u0026#34;\"\u003e\n\n            \n\n\n\n\n\u003cfigure\u003e\n        \u003cpicture\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 1024px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 768px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=825\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 481px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=800\u0026amp;dpr=2\"/\u003e\n        \n                                        \n                                    \n                                                                                                                                                                            \n            \n                                                            \n            \n            \n                                        \n            \u003csource media=\"(min-width: 0px)\" data-srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\" srcset=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg?q=49\u0026amp;fit=crop\u0026amp;w=500\u0026amp;dpr=2\"/\u003e\n                \u003cimg width=\"2400\" height=\"1600\" loading=\"lazy\" decoding=\"async\" alt=\"Several phones side by side with the Android logo in different colors.\" data-img-url=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg\" src=\"https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/11/several-phones-side-by-side-with-the-android-logo-in-different-colors.jpg\"/\u003e\n    \u003c/picture\u003e\n                                        \u003cfigcaption\u003eLucas Gouveia / How-To Geek | Overearth / \u003ca href=\"https://www.shutterstock.com/image-vector/isometric-mobile-phone-vector-mockup-group-2471112101\" rel=\"noreferrer noopener\" target=\"_blank\"\u003eShutterstock\u003c/a\u003e\u003c/figcaption\u003e\n                        \n    \u003c/figure\u003e\n\n\n        \u003c/div\u003e\n\n\u003cp\u003e The whole situation begs the question of whether it should be brought back. Frankly, I don\u0026#39;t think so. Doing the same thing all over again isn\u0026#39;t suddenly going to make people interested.\u003c/p\u003e    \n\u003cp\u003eWhat I would seriously like, however, is a resurrection of the Google Play Edition program. Not because of the whole stock-like Android schtick (which is a bonus, but wouldn\u0026#39;t be the main point), but for another important reason: updates.\u003c/p\u003e    \n\u003cp\u003eWith Google providing up to seven years of updates on their phones and most OEMs only committing to rolling out at least four (with most of them only committing to three or two), there\u0026#39;s a serious argument to be made for non-Pixel phones where Google handles updates. There aren\u0026#39;t a lot of phones that actually last long, keep their resale value, get updates promptly, and aren\u0026#39;t end-of-life within three years.\u003c/p\u003e    \n\u003cp\u003eThis will probably never happen, but I can dream.\u003c/p\u003e    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-01T22:30:14Z",
  "modifiedTime": "2024-12-01T22:30:14Z"
}
