[
  {
    "id": "04c1994e-f01a-4a03-af22-fc5e92183700",
    "title": "Muons",
    "link": "https://xkcd.com/3043/",
    "description": "",
    "author": "",
    "published": "Mon, 27 Jan 2025 05:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/muons.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "47db2b2f-1d53-4dfd-a68c-f174eb2a312e",
    "title": "T. Rex Evolution",
    "link": "https://xkcd.com/3042/",
    "description": "",
    "author": "",
    "published": "Fri, 24 Jan 2025 05:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/t_rex_evolution.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "9dd1b208-c768-4441-bbcf-18f6df85c292",
    "title": "5 of the Most Important Poops in History",
    "link": "https://www.cracked.com/article_45031_5-of-the-most-important-poops-in-history.html?newsletter-cat=science-history",
    "description": "By Jesse Published: January 09th, 2025",
    "author": "",
    "published": "Thu, 09 Jan 2025 08:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "da10a400-d908-4fdc-bdc6-2ba3c0417554",
    "title": "Deleted Scenes From ‘The Blues Brothers’ Were Rescued by the FBI",
    "link": "https://www.cracked.com/article_45033_deleted-scenes-from-the-blues-brothers-were-rescued-by-the-fbi.html?newsletter-cat=movies-tv",
    "description": "By JM McNab Published: January 09th, 2025",
    "author": "",
    "published": "Thu, 09 Jan 2025 06:40:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "a87255a6-0bae-43ee-9ad2-176414996f7f",
    "title": "Ragged Ann",
    "link": "https://awkwardfamilyphotos.com/ragged-ann",
    "description": "“All the other kids were terrified of the giant doll, but not our granddaughter.” (submitted by Peggy) The post Ragged Ann appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Mon, 20 Jan 2025 14:55:05 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2025/01/19065502/IMG_1384.jpeg",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Kids",
      "Misc"
    ]
  },
  {
    "id": "bcc6278e-8bc2-419b-874c-37cb308b155b",
    "title": "Shades of Blue",
    "link": "https://awkwardfamilyphotos.com/blue-shade",
    "description": "” A classic from back in the day of our family. I don’t remember all the specifics but it was clearly a joyous experience.” (submitted by Stacey) The post Shades of Blue appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Mon, 20 Jan 2025 05:57:24 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2025/01/20225018/blue-1024x828.png",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Family Portrait",
      "Misc"
    ]
  },
  {
    "id": "a7501c5b-75c0-4aa6-95d8-eac33edf4ce3",
    "title": "Comic for 2021.12.21",
    "link": "http://explosm.net/comics/6060/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Tue, 21 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "6eb23385-5ace-48bc-bb57-0ea46a629a94",
    "title": "Comic for 2021.12.20",
    "link": "http://explosm.net/comics/6059/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Mon, 20 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "f68b0534-cf28-4300-a65b-e145e7f6565f",
    "title": "Boss fires 22-year-old employee from first job after only six months, pushing her to question her career path: ‘All that hard work just to end up back in square one’",
    "link": "https://cheezburger.com/38899973/boss-fires-22-year-old-employee-from-first-job-after-only-six-months-pushing-her-to-question-her",
    "description": "The corporate jungle is a wild and unforgiving ecosystem, where fresh-faced graduates are unceremoniously dropped into the undergrowth like unsuspecting prey. In this dense thicket of deadlines and deliverables, young professionals must quickly learn to navigate the treacherous terrain or risk being devoured by the ever-present supervising predators.The canopy above is thick with the vines of office politics, and the forest floor teems with parasitic demands and unrealistic expectations. Toxic workplace plants flourish and the dangers of failure and unemployment are always lurking in the shadows.In this savage habitat, our young marketing rookie found herself thrust into a clearing far too large for her inexperienced paws to manage. With too much to juggle and only one mercurial alpha teammate, who alternates between nurturing guide and snarling beast, she was expected to adapt at lightning speed or perish. As she struggled to keep up with the frenzied pace, her once-bright eyes grew dim, her enthusiasm wilting like a delicate flower in the harsh glare of corporate reality.",
    "author": "Etai Eshet",
    "published": "Mon, 27 Jan 2025 15:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "management",
      "boss",
      "workplace-stories",
      "hr",
      "toxic-workplace",
      "manager",
      "bosses",
      "work",
      "PTO",
      "managers",
      "supervisor",
      "workplace",
      "Horrible Bosses",
      "work-life balance"
    ]
  },
  {
    "id": "3cc88143-5e5d-4a8a-a40f-c78d27c6d591",
    "title": "‘I told him I didn’t know how much longer I could keep doing this:’ Woman does everything in her household, asks husband to pick up some slack and he pushes back",
    "link": "https://cheezburger.com/38778885/i-told-him-i-didnt-know-how-much-longer-i-could-keep-doing-this-woman-does-everything-in-her",
    "description": "Weaponized incompetence. Have you heard of this term? It's one of those new-age phrases where we finally put fancy words to something that's been happening since the dawn of time. Weaponized incompetence is when someone performs their inability to complete a task so that the person who asked them to do it just does it anyway, in fear that the other person would do it wrong. Usually, men are weaponizing their incompetence against the women in their lives. To their mothers, their sisters, their wives. But it is most definitely not a gender-exclusive trait. I know I've purposefully done a really bad job at the dishes so my mom wouldn't ask me to do them again. (I do them now, of course…)What happens, though, when the incompetence becomes too much to bear, and the tasks you've taken on keep piling up? That's what one woman is experiencing with her husband here. She's the breadwinner, the bill payer, and on top of everything, she cooks, cleans, and does all the laundry. With her husband not working, they're financially strapped for cash. So when she comes home one day to find him yet again on the couch, she finally flips her lid. Is this a He Had It Coming Moment? Read on to find out.",
    "author": "Baiz Hoen",
    "published": "Mon, 27 Jan 2025 14:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "Dating-Relationships",
      "toxic-husband",
      "AITAH",
      "wife",
      "reddit story",
      "couples",
      "Reddit",
      "relationship drama"
    ]
  },
  {
    "id": "94ae4e16-de05-489b-8a7a-8cbb6f49087f",
    "title": "Kitten that was born tiny never grows bigger, worrying her owners, but turns out she just has dwarfism and will be tiny forever: 'We weren't sure that she would even make it'",
    "link": "https://cheezburger.com/38905605/kitten-that-was-born-tiny-never-grows-bigger-worrying-her-owners-but-turns-out-she-just-has-dwarfism",
    "description": "Something that we learned very quickly after we adopted our first kitten is that… kittens grow up fast. One moments, your kitten can fit in the palm of your hand because it's so small. The next second, that same kitten is so big it barely fits in your lap when you sit down. Kittenhood passes quickly, so we have to cherish it. Take those pictures, hang them up, kiss that kitten's itty bitty forehead as many times as it will allow, because soon enough, it won't be a kitten anymore. Usually. Sometimes, a kitten is born with a condition that makes it stay small forever. Meet Mini, a kitty cat with dwarfism. This teeny weeny cat is never going to get any bigger than it already is. It is forever a kitten. Sort of. Obviously, she's going to keep growing up and getting smarter and more cunning, but her size will remain forever the same. Which makes everything so much harder. Everyone knows it's way more difficult to ignore the demands of a kitten. The smaller they are, the bigger their powers of meownipulation.",
    "author": "Mariel Ruvinsky",
    "published": "Mon, 27 Jan 2025 06:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "aww",
      "pics",
      "wholesome",
      "cat",
      "dwarf",
      "adorable",
      "tiny",
      "cute",
      "cute cats",
      "small",
      "Cats"
    ]
  },
  {
    "id": "7bacd0f1-e7fd-4b8d-9502-04bfd02ec3d7",
    "title": "23 Cat Memes For Feline Fanatics That Cannot Get Up From Bed on a Monday Meowrning",
    "link": "https://cheezburger.com/38902789/23-cat-memes-for-feline-fanatics-that-cannot-get-up-from-bed-on-a-monday-meowrning",
    "description": "Oh, the meowing morning is here. And to make things even worse, it's a Meownday morning. Oh, meowing Monday, why does this day come every week? Can't it skip a week every once in a while? It means we need to get out of bed and do all these hooman things, like going to work and doing our job. Blah. Well, at least we've had a great weekend with our cat. We snuggled and cuddled all throughout Saturday, and played with the red laser dot all throughout Sunday. But now? Now it's meowing Monday. And no, we're not ready. We want another weekend day with our cat, please.Well, you know? At least we have cat memes. If nothing else, any feline fan can enjoy a bit of cat comedy during that day until we can get back home to our cats. It's like a secret weapon to deal with meowing Mondays. And only us, fellow feline fanatic fans all around the globe, are aware of it. So let's enjoy some Monday cat memes, shall we?",
    "author": "Ayala Sorotsky",
    "published": "Mon, 27 Jan 2025 10:00:00 -0800",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "funny cat memes",
      "funny memes",
      "Memes",
      "funny cats",
      "hilarious memes",
      "Cats",
      "hilarious cats",
      "funny",
      "cat memes"
    ]
  },
  {
    "id": "41cff330-cc76-486f-bb08-fff36d116137",
    "title": "The Tooth House",
    "link": "https://www.penny-arcade.com/news/post/2025/01/27/the-tooth-house",
    "description": "I once had a customer service experience with an Apple phone that was so Kafkaesque that I bought a Pixel the same day. I'm not saying that the Pixel is good or that you should think it's good or that Apple is evil or anything like that. It just occurred to me that it was within my power to never have this particular experience again. I can have other bad experiences, but when I realized I could consign this particular one to The Void I leapt with ravenous hunger.",
    "author": "",
    "published": "Mon, 27 Jan 2025 19:08:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "84eef2a3-aba1-443e-9740-12c34f850588",
    "title": "The Tooth House",
    "link": "https://www.penny-arcade.com/comic/2025/01/27/the-tooth-house",
    "description": "New Comic: The Tooth House",
    "author": "",
    "published": "Mon, 27 Jan 2025 08:01:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "e119976a-3dbe-4efc-b838-6108dbd5a205",
    "title": "Identified the Problem",
    "link": "https://thedailywtf.com/articles/identified-the-problem",
    "description": "Denise's company formed a new team. They had a lot of low-quality legacy code, and it had gotten where it was, in terms of quality, because the company had no real policy or procedures which encouraged good code. \"If it works, it ships,\" was basically the motto. They wanted to change that, and the first step was creating a new software team to kick of green-field projects with an eye towards software craftsmanship. Enter Jack. Jack was the technical lead, and Jack had a vision of good software. This started with banning ORM-generated database models. But it also didn't involve writing raw SQL either- Jack hand-forged their tables with the Visual Table Designer feature of SQL Server Management Studio. \"The advantage,\" he happily explained to Denise, \"is that we can then just generate our ORM layer right off the database. And when the database changes, we just regenerate- it's way easier than trying to build migrations.\" \"Right, but even if we're not using ORM migrations, we still want to write migration scripts for our changes to our database. We need to version control them and test them.\" \"We test them by making the change and running the test suite,\" Jack said. And what a test suite it was. There was 100% test coverage. There was test coverage on simple getter/setter methods. There was test coverage on the data transfer objects, which had no methods but getters and setters. There were unit tests for functions that did nothing more than dispatch to built-in functions. Many of the tests just verified that a result was returned, but never checked what the result was. There were unit tests on the auto-generated ORM objects. The last one, of course, meant that any time they changed the database, there was a significant risk that the test suite would fail on code that they hadn't written. Not only did they need to update the code consuming the data, the tests on that code, they also had to update the tests on the autogenerated code. Jack's magnum opus, in the whole thing, was that he designed the software with a plugin architecture. Instead of tightly coupling different implementations of various modules together, there was a plugin loader which could fetch an assembly at runtime and use that. Unfortunately, while the whole thing could have plugins, all of the abstractions leaked across module boundaries so you couldn't reasonably swap out plugins without rewriting the entire application. Instead of making a modular architecture, Jack just made starting the application wildly inefficient. Denise and her team brought their concerns to management. Conversations were had, and it fell upon Jack to school them all. Cheerfully, he said: \"Look, not everyone gets software craftsmanship, so I'm going to implement a new feature as sort of a reference implementation. If you follow the pattern I lay out, you'll have an easy time building good code!\" The new feature was an identity verification system which called for end users to upload photographs of their IDs- drivers' licenses, passports, etc. It was not a feature which should have had one developer driving the whole thing, and Jack was not implementing the entire lifecycle of data management for this; instead he was just implementing the upload feature. Jack pushed it through, out and up into production. Somehow, he short-cut past any code reviews, feature reviews, or getting anyone else to test it. He went straight to a demo in production, where he uploaded his passport and license. \"So, there you go, a reference implementation for you all.\" Denise went ahead and ran her own test, with a synthetic ID for a test user, which didn't contain any real humans' information. The file upload crashed. In fact, in an ultimate variation of \"it works on my machine,\" the only person who ever successfully used the upload feature was Jack. Of course, since the upload never worked, none of the other features, like retention policies, ever got implemented either. Now, this didn't mean the company couldn't do identity verification- they had an existing system, so they just kept redirecting users to that, instead of the new version, which didn't work. Jack went on to other features, though, because he was a clever craftsman and needed to bring his wisdom to the rest of their project. So the file upload just languished, never getting fixed. Somehow, this wasn't Jack's fault, management didn't hold him responsible, and everyone was still expected to follow the patterns he used in designing the feature to guide their own work. Until, one day, the system was breached by hackers. This, surprisingly, had nothing to do with Jack's choices- one of the admins got phished. This meant that the company needed to send out an announcement, informing users that they were breached. \"We deeply regret the breach in our identity verification system, but can confirm that no personal data for any of our customers was affected.\" Jack, of course, was not a customer, so he got a private disclosure that his passport and ID had been compromised. [Advertisement] Keep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
    "author": "Remy Porter",
    "published": "Mon, 27 Jan 2025 06:30:00 GMT",
    "image": "https://thedailywtf.com/images/inedo/proget-icon.png",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Feature Articles"
    ]
  },
  {
    "id": "7d2608f7-8856-4542-9d40-2aa612a5a129",
    "title": "Error'd: Office Politics",
    "link": "https://thedailywtf.com/articles/office-politics",
    "description": "\"Math is hard, especially timely math,\" explains The Beast in Black.   Cinephile Jono enjoys contemporary dramas far more than sci-fi. \"Letterboxd tells me I've logged this movie 3 times, I'm not sure I'll be watching it in 2566.\" I hope you are, Jono.   Pieter may have to turn in his official pedants card. Pieter is concerned about the apparent contradiction between the two salaries on offer here, declaring: \"The title says She can earn up to 8.000 euro/month. But by the time you get to the actual article link, that amount deflated to 6.000 euro/month. I didn't know it was that bad in the euro zone! Or is it good, since we've got inflation under control? I don't know which way is up anymore...\"Pieter, 6,000 is \"up to\" 8,000. Technically.   Cross-country runner Andrei looks to be taking the long way around for this trip. Says he, \"According to Google Maps, one of my transfers involves teleporting about 70 km away to catch my next train.\"   Finally David B. reports \"My wife works as a quality auditor for Initech [ed: the William Lumberg company, presumably, not the Flavor and Fragrance company]. When setting up contact information for a company she will be auditing in the near future they needed some basic information. So much for gender equality.\" They're just getting ahead of the next batch of executive orders.   [Advertisement] Plan Your .NET 9 Migration with ConfidenceYour journey to .NET 9 is more than just one decision.Avoid migration migraines with the advice in this free guide. Download Free Guide Now!",
    "author": "Lyle Seaman",
    "published": "Fri, 24 Jan 2025 06:30:00 GMT",
    "image": "https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/256/errordgmailtimecalc20250123.png",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Error'd"
    ]
  },
  {
    "id": "b0e3ec4d-bb22-4023-bac9-424d4580961b",
    "title": "In 150 characters or less",
    "link": "http://theoatmeal.com/comics/150_characters?no_popup=1",
    "description": "This is based on a poem by Nikita GillView on my website",
    "author": "Matthew Inman",
    "published": "2025-01-21T20:46:26+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/150_characters_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "f734f1c1-2e1b-4da1-a707-7b7128bfa446",
    "title": "Rudolph with your nose so bright",
    "link": "http://theoatmeal.com/comics/rudolph?no_popup=1",
    "description": "Won't you guide my sleigh tonight?View on my website",
    "author": "Matthew Inman",
    "published": "2024-12-20T18:45:39+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/rudolph_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "4ce27a34-0181-41a3-b78c-034a3f812fa8",
    "title": "01/15/21 PHD comic: 'NEW BOOK! Out of Your Mind!'",
    "link": "http://www.phdcomics.com/comics.php?f=2051",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"NEW BOOK! Out of Your Mind!\" - originally published 1/15/2021 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Mon, 31 Jan 2022 11:24:26 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd011525s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "bb35f440-5564-4bf3-8199-e95340ffae31",
    "title": "08/31/23 PHD comic: 'New Book! Oliver's Great Big Universe!'",
    "link": "http://www.phdcomics.com/comics.php?f=2050",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"New Book! Oliver's Great Big Universe!\" - originally published 8/31/2023 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Tue, 14 Dec 2021 11:53:03 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd083123s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "26ca5f74-338a-4e54-aee9-03874b43c7a0",
    "title": "Not giving up.",
    "link": "https://thebloggess.com/2025/01/20/not-giving-up/",
    "description": "Every so often I write something on my newsletter about art that I think you might want to read even if art is not for you. Today may be one of those so I’m sharing it here just in case: It’s a hard time to be an empath out here, y’all.  I suspect many ofContinue reading \"Not giving up.\"",
    "author": "thebloggess",
    "published": "Mon, 20 Jan 2025 20:31:25 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "f17b9200-7937-4d2f-804c-e5929eb37c10",
    "title": "Long Live Bone Crawford",
    "link": "https://thebloggess.com/2025/01/17/long-live-bone-crawford/",
    "description": "(Sorry I’ve been MIA. This week has been really hard. Sending love to anyone struggling.) Last week we got a letter from our HOA chiding us that our Halloween decorations should have been removed in November, and that we would be fined if we didn’t remedy the 12-foot skeleton on our porch by today. SoContinue reading \"Long Live Bone Crawford\"",
    "author": "thebloggess",
    "published": "Fri, 17 Jan 2025 21:01:33 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "3db7fabc-ecac-47bd-9cce-f988d86211d3",
    "title": "Study Finds 4 In 10 Americans Could Develop Dementia After 55",
    "link": "https://theonion.com/study-finds-4-in-10-americans-could-develop-dementia-after-55/",
    "description": "A study published in the journal Nature Medicine found that about a million Americans a year are expected to develop dementia by 2060, roughly double today’s toll. What do you think? The post Study Finds 4 In 10 Americans Could Develop Dementia After 55 appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Mon, 27 Jan 2025 18:12:07 +0000",
    "image": "https://theonion.com/wp-content/uploads/2024/11/Face-Asian.jpg?w=200",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "American Voices",
      "Health + Wellness",
      "Vol 61: Issue 5"
    ]
  },
  {
    "id": "c6f208fb-0729-4615-95bf-b14fc14ca7ba",
    "title": "Pros And Cons Of Ending Birthright Citizenship",
    "link": "https://theonion.com/pros-and-cons-of-ending-birthright-citizenship/",
    "description": "The Justice Department has vowed to “vigorously defend” President Donald Trump’s executive order ending citizenship for U.S.-born children of undocumented immigrants after a federal judge temporarily blocked it. The Onion examines the pros and cons of ending birthright citizenship.  PRO: A solid start to ending all rights CON: Class of stateless refugees might not buy […] The post Pros And Cons Of Ending Birthright Citizenship appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Mon, 27 Jan 2025 18:10:39 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "News",
      "Explainer",
      "Vol 61: Issue 5"
    ]
  },
  {
    "id": "a00ff965-9767-487b-a87b-7f49ae0cff66",
    "title": "Saturday Morning Breakfast Cereal - Wife",
    "link": "https://www.smbc-comics.com/comic/wife",
    "description": "Click here to go see the bonus panel!Hovertext:In devastating news, I was informed by patreon subscribers after this comic was complete that there is a Dutch town named Winkle, permitting a Winkle Winkle-Winkle Winkel Winkle Winkel Winkel.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Mon, 27 Jan 2025 09:06:51 -0500",
    "image": "https://www.smbc-comics.com/comics/1737986820-20250127.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "72b9a079-7027-4f32-ae02-fddea91acc67",
    "title": "Saturday Morning Breakfast Cereal - Questions",
    "link": "https://www.smbc-comics.com/comic/questions-2",
    "description": "Click here to go see the bonus panel!Hovertext:This is me on bluesky.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Sun, 26 Jan 2025 07:56:24 -0500",
    "image": "https://www.smbc-comics.com/comics/1737896204-20250126.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "ce574c40-7be6-4c94-ab89-65d04c9f6666",
    "title": "Sunday Secrets",
    "link": "https://postsecret.com/2025/01/26/sunday-secets/",
    "description": "The post Sunday Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 26 Jan 2025 00:03:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2025/01/ishare.jpg?resize=370%2C526\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "48c40a6f-1e75-4d5b-8fcf-84d8ea07e027",
    "title": "Street Secrets",
    "link": "https://postsecret.com/2025/01/26/street-secrets-2/",
    "description": "The post Street Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 26 Jan 2025 00:02:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2020/11/barcode.jpg?resize=400%2C46\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  }
]
