[
  {
    "id": "083be4c9-8cf9-4fb0-a01c-15f75e79a3db",
    "title": "Exoplanet System",
    "link": "https://xkcd.com/3103/",
    "description": "",
    "author": "",
    "published": "Mon, 16 Jun 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/exoplanet_system.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "67a99715-2937-4da4-a5b1-963a983ad782",
    "title": "Reading a Big Number",
    "link": "https://xkcd.com/3102/",
    "description": "",
    "author": "",
    "published": "Fri, 13 Jun 2025 04:00:00 -0000",
    "image": "https://imgs.xkcd.com/comics/reading_a_big_number.png",
    "source": "https://xkcd.com/rss.xml",
    "categories": null
  },
  {
    "id": "a1801570-d7e5-4216-86a4-b5a64030fe82",
    "title": "Comic for 2021.12.21",
    "link": "http://explosm.net/comics/6060/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Tue, 21 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "fa08153f-70a9-4306-8b65-c39866f67f1b",
    "title": "Comic for 2021.12.20",
    "link": "http://explosm.net/comics/6059/",
    "description": "New Cyanide and Happiness Comic",
    "author": "",
    "published": "Mon, 20 Dec 2021 00:00:00 -0600",
    "image": "",
    "source": "http://feeds.feedburner.com/Explosm",
    "categories": [
      "Comics"
    ]
  },
  {
    "id": "ba47bd28-0142-4be5-988a-2f72dc15b652",
    "title": "secret rooms, spam and bear costumes.",
    "link": "https://thebloggess.com/2025/06/16/secret-rooms-spam-and-bear-costumes/",
    "description": "A few quick mysteries: In case you missed it, we found a secret room (half room?) in our new house and I still don’t know what it is or what to do with it. several people suggested I use it for storing the Xmas tree but the built-in bookshelf is built over half of theContinue reading \"secret rooms, spam and bear costumes.\"",
    "author": "thebloggess",
    "published": "Mon, 16 Jun 2025 17:17:03 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "0e139043-8aab-438f-87de-d7cc62e3d1f0",
    "title": "I’ve never been so happy to be labeled as”GROSSLY NORMAL AND UNREMARKABLE.”",
    "link": "https://thebloggess.com/2025/06/09/ive-never-been-so-happy-to-be-labeled-asgrossly-normal-and-unremarkable/",
    "description": "So. I’ve been busy with PET scans and CAT scans and tests and moving houses and stressing out about cancer and this all culminated into one of those panic attacks where my chest hurt so much I thought I was literally having a heart attack and it was a very hard week. BUT… I heardContinue reading \"I’ve never been so happy to be labeled as”GROSSLY NORMAL AND UNREMARKABLE.”\"",
    "author": "thebloggess",
    "published": "Mon, 09 Jun 2025 19:15:36 +0000",
    "image": "",
    "source": "https://thebloggess.com/feed/",
    "categories": [
      "Random Crap"
    ]
  },
  {
    "id": "1f7c03f6-5a50-4d38-98ef-a5cf89bda053",
    "title": "Why Addison Rae Is Not a Good Pop Star: From a Pop Music Fan",
    "link": "https://cheezburger.com/33689095/why-addison-rae-is-not-a-good-pop-star-from-a-pop-music-fan",
    "description": "As an avid pop music fan, I always share in the excitement that comes with the arrival of a new voice in the genre. Even in an overcrowded market where stan culture can be ruthlessly competitive, I am a firm believer that there should always be room for more pop stars. Pop music can cover a wide range of subject matter, from the profound to the pointless, and all of it should be welcome. After all, there is an artistry to even the most simplistic pop song. There is a reason why Carly Rae Jepsen's \"Call Me Maybe\" is so catchy, and that's because it is expertly constructed, produced, and delivered. Recently, however, I have discovered a limitation to my feeling that there is a place for pointless pop music. It turns out that I do need to draw the line somewhere, and that line is at Addison Rae.The 24-year-old TikTok personality currently holds 88.4 million followers on the platform. That is no easy feat. She is a master at virality and deserves her flowers there. But when it comes to her artistic ventures outside of TikTok, virality can only get you so far, or so I thought. After initially gaining popularity through dance videos, Rae capitalized on her success by venturing into podcasting, acting, a cosmetics line, and, of course, music. Following a period of a few years in which Rae essentially threw various darts all over the dartboard, music seems to be the avenue that really stuck. Rae's successful foray into pop music, as evidenced by the generally favorable reception of her debut pop album Addison, unfortunately says more about our culture's general decline in collective \"top 40\" taste than anything about Rae as a musician. That's because the musicianship isn't really there. The 33-minute-long rushed album includes 12 tracks, almost half of which audiences had heard before its release, and many of which feel primed for short-form TikTok content, with abridged lengths and incomplete or missing verses. Sure, this could be a strategic business move to boost popularity on the social media platform, but once again, that conscious choice indicates what Addison Rae is really after: Virality. Pop music is a means to her end, and that is an insult to hard-working pop musicians and listeners everywhere. The problem is that we are all falling for it…",
    "author": "Ben Weiss",
    "published": "Mon, 16 Jun 2025 11:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "Music",
      "pop",
      "viral tiktok",
      "hot takes",
      "pop culture",
      "album",
      "addison rae",
      "hot take",
      "pop music",
      "tiktok"
    ]
  },
  {
    "id": "84ac92a5-87b2-4100-a439-867ab359c3ca",
    "title": "Employees share over-hyped dream jobs that sound glamorous until you actually do them: 'I'm 44, a little late to start a new career... but here I am'",
    "link": "https://cheezburger.com/41015045/employees-share-over-hyped-dream-jobs-that-sound-glamorous-until-you-actually-do-them-im-44-a-little",
    "description": "When we were kids, dreaming about our future careers was like picking from a magical world of endless possibilities. You could be a veterinarian, a movie star, a singer, an astronaut, a dolphin trainer, or whatever your little heart desired. But then, adulthood arrived alongside a grim reality check. Maybe the years of school and six-figure debt made you wake up from that dream of becoming a doctor real quick. And being a filmmaker sounded artsy and cool, until you realized the 80-hour work weeks and constant rejection weren't exactly the vibe you were hoping for.Now we're out here scheduling spreadsheet audits at 2 p.m. and updating printer toner in beige cubicles. Welcome to the land of insurance adjusters, data entry clerks, and corporate compliance specialists. How did we get here?",
    "author": "Isabella Penn",
    "published": "Mon, 16 Jun 2025 10:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/failblog",
    "categories": [
      "dream job",
      "salary",
      "school",
      "jobs",
      "employee",
      "lawyer",
      "work",
      "teacher",
      "chef",
      "Office",
      "advice",
      "career",
      "workplace",
      "paycheck",
      "graphic design",
      "job interview",
      "Reality Check"
    ]
  },
  {
    "id": "31fe8593-981c-4a21-8c15-5ddab17ee29c",
    "title": "'Seeing her playing like a kitten is heartwarming': Tiger who has been chained up and forced to do tricks her entire life gets rescued, takes her very first free steps, sniffs grass, scratches a tree, and even makes a friend",
    "link": "https://cheezburger.com/110602241/seeing-her-playing-like-a-kitten-is-heartwarming-tiger-who-has-been-chained-up-and-forced-to-do",
    "description": "We remember, from the time that we were kids, seeing videos on the TV of big cats doing all kinds of cool tricks in circuses. We remember the audiences cheering. We remember thinking that it was amazing. And then, we grew up, and we realized what it took for cats to do stuff like that. Nowadays, it's hard for us to look at things like this, despite the fact that we know it's still going on in some places in the world. We want to look away, but we don't think that we should. It's good to remember, and more than that, it's good to celebrate the times that big cats like that get rescued. Whether it's a lion cub getting rescued and being given a chance at a new life, if it's mountain lions getting rescued and learning to enjoy life again, or if it's a tiger getting rescued, like the one that you will be meeting today, and being given a chance, for the first time in her life, to taste freedom. And like the comments under the video say: \"Such a beautiful animal. And seeing her playing like a kitten is heartwarming. I hope she lives the rest of her life in comfort and peace.\"Your inbox deserves hissterical cat content. We deliver. Weekly. Subscribe here.",
    "author": "Mariel Ruvinsky",
    "published": "Mon, 16 Jun 2025 06:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "aww",
      "wholesome",
      "cat",
      "adorable",
      "youtube",
      "cute",
      "tiger",
      "cute cats",
      "Cats",
      "Video"
    ]
  },
  {
    "id": "5fcb5e89-2325-4f49-9d97-8b2c8f3f13c3",
    "title": "Chonky black cat goes viral with hissterically unphotogenic pictures, instantly becomes the new shareable reaction meme taking the internet by storm",
    "link": "https://cheezburger.com/41021957/chonky-black-cat-goes-viral-with-hissterically-unphotogenic-pictures-instantly-becomes-the-new",
    "description": "Well meowdy there, feline fam. If you're new here, welcome! We're in the business of all things cat-related, and that includes memes. We're something of an expurrt in this topic, having been around when the very first cat meme took over the internet and changed the lives of hoomans furrever. Many hissterical feline funnies have been created since then, but it's not every day you get to witness the birth of a viral cat meme. A true cat meme, not some imitation copy of something that's been done before.The OG pioneers of cat memes were such stars as Grumpy Cat, Smudge, and of course, \"heavy breathing cat\", but this new diamond in the rough comes from the depths of Reddit - a chonky black cat that went viral for playing with a piece of long grass. Her hissterically unphotogenic photos took the internet by storm, and now everyone is sharing memes of this hilarious kitty. Scroll down to see some of the best we found below - you can thank us later.Your inbox deserves hissterical cat content. We deliver. Weekly. Subscribe here.",
    "author": "Blake Seidel",
    "published": "Mon, 16 Jun 2025 09:00:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/icanhascheezburger",
    "categories": [
      "internet",
      "Memes",
      "viral",
      "chonky",
      "Cats",
      "animals",
      "cat memes",
      "black cat"
    ]
  },
  {
    "id": "7b809a68-4376-487a-96e9-31bdfcf54441",
    "title": "I Get Mail, Vol. 2",
    "link": "https://www.penny-arcade.com/news/post/2025/06/16/i-get-mail-vol-2",
    "description": "Hey Jerry! Yo. I just wanted to say thank you for talking up Sunderfolk. My girlfriend is not into video games AT ALL, but she likes boardgames. She was willing to give Sunderfolk a shot and has fallen completely in love with it, to the point that she asks me if we can play when I get home. I love that I can share something I have always enjoyed with her now. I hope we get more games like this in the future. Thanks again.  -Erik I love Secret Door, I love Dreamhaven, and I love Sunderfolk.  I did a sponsored panel for Sunderfolk at PAX with a bunch of other cool people and I charged zero dollars.  That's how cool I think it is.  There are quite a few gamers on PC that don't really understand \"Jackbox Gloomhaven,\" the phone as a controller for a co-op tactics feast is either alien or distasteful, like trying to play the game with a dead rat.  I wonder sometimes if it could have a different life with a PC specific UI, but that's neither here nor there - I'm glad you two are having fun with it.  If you need naming suggestions for any of the things you discover obviously we're here to help. (CW)TB",
    "author": "",
    "published": "Mon, 16 Jun 2025 23:02:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "e80edb1a-c366-47c6-bccf-158c180bc989",
    "title": "Super Wizard Kart Rules!",
    "link": "https://www.penny-arcade.com/news/post/2025/06/16/super-wizard-kart-rules",
    "description": "If you watched my Super Wizard Kart game from yesterday and you’d like to try running it yourself at home, I’ve collected all my rules into a PDF file you can download right here.",
    "author": "",
    "published": "Mon, 16 Jun 2025 20:12:00 +0000",
    "image": "",
    "source": "https://www.penny-arcade.com/feed",
    "categories": null
  },
  {
    "id": "5dd82a0a-724c-44e8-9438-8950c4acca0f",
    "title": "01/15/21 PHD comic: 'NEW BOOK! Out of Your Mind!'",
    "link": "http://www.phdcomics.com/comics.php?f=2051",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"NEW BOOK! Out of Your Mind!\" - originally published 1/15/2021 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Mon, 31 Jan 2022 11:24:26 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd011525s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "14d09a50-a98f-44ac-a3ff-675c38dd5b59",
    "title": "08/31/23 PHD comic: 'New Book! Oliver's Great Big Universe!'",
    "link": "http://www.phdcomics.com/comics.php?f=2050",
    "description": "Piled Higher \u0026 Deeper by Jorge Cham www.phdcomics.com title: \"New Book! Oliver's Great Big Universe!\" - originally published 8/31/2023 For the latest news in PHD Comics, CLICK HERE!",
    "author": "",
    "published": "Tue, 14 Dec 2021 11:53:03 -0800",
    "image": "http://www.phdcomics.com/comics/archive/phd083123s.gif",
    "source": "http://phdcomics.com/gradfeed.php",
    "categories": null
  },
  {
    "id": "a06667e1-9a23-4bca-a50d-72d6254239c6",
    "title": "Saturday Morning Breakfast Cereal - Soul",
    "link": "https://www.smbc-comics.com/comic/soul-9",
    "description": "Click here to go see the bonus panel!Hovertext:Tragedy is when the apes fight until everyone is dead. Comedy is when the apes fight until everyone is married.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Mon, 16 Jun 2025 11:25:00 -0400",
    "image": "https://www.smbc-comics.com/comics/1750013429-20250616.png",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "75a63125-f08a-4e01-848b-b5d09aa86840",
    "title": "Saturday Morning Breakfast Cereal - Poll",
    "link": "https://www.smbc-comics.com/comic/poll",
    "description": "Click here to go see the bonus panel!Hovertext:It absolutely kills me dead when the votey is funnier than the daily comic.Today's News:",
    "author": "Zach Weinersmith",
    "published": "Sun, 15 Jun 2025 11:25:00 -0400",
    "image": "https://www.smbc-comics.com/comics/1749420380-20250615.webp",
    "source": "https://www.smbc-comics.com/comic/rss",
    "categories": null
  },
  {
    "id": "f8872a8e-e44e-470f-ada5-8db277183cdd",
    "title": "Father’s Day Secrets",
    "link": "https://postsecret.com/2025/06/15/fathers-day-secrets-8/",
    "description": "My Dad sent this message to me over Facebook Messenger the night before I was supposed to fly home from a trip to Paris. . .He died last year. I listen to this message every time I fly now. I got these text messages from my dad after my mother confessed he wasn’t actually my […] The post Father’s Day Secrets appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 15 Jun 2025 00:04:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2020/06/1.me_.jpg?resize=736%2C736\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "3265deb9-8f52-461c-9a07-ebf3473d5e3d",
    "title": "25 Dad Questions",
    "link": "https://postsecret.com/2025/06/15/25-questions/",
    "description": "I asked PostSecret followers on facebook for once-in-a-lifetime questions to ask my dad for an unforgettable interview. Over 700 replies with more than 1,000 questions came back. This was the original post: I was thrilled with all the thoughtful questions shared with me, from the delightful to the profound. I read them all and picked […] The post 25 Dad Questions appeared first on PostSecret.",
    "author": "Frank",
    "published": "Sun, 15 Jun 2025 00:03:00 +0000",
    "image": "https://i0.wp.com/postsecret.com/wp-content/uploads/2020/02/screen-shot-2020-02-01-at-9.02.03-pm.png?resize=502%2C398\u0026ssl=1",
    "source": "https://postsecret.com/feed/?alt=rss",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": "ec270ab4-2734-4073-8dfd-178b147c49a7",
    "title": "Seth MacFarlane Claims That This Comedy Was Really Tom Hanks’ Greatest Performance",
    "link": "https://www.cracked.com/article_47006_seth-macfarlane-claims-that-this-comedy-was-really-tom-hanks-greatest-performance.html?newsletter-cat=movies-tv",
    "description": "By JM McNab Published: June 16th, 2025",
    "author": "",
    "published": "Mon, 16 Jun 2025 17:30:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "1dda9860-c243-4fbf-8539-1b2670d3b795",
    "title": "The Original 'Spaceballs' Was Based on This Oscar-Winning Movie, Not 'Star Wars'",
    "link": "https://www.cracked.com/article_47005_the-original-spaceballs-was-based-on-this-oscar-winning-movie-not-star-wars.html?newsletter-cat=movies-tv",
    "description": "By Matt Solomon Published: June 16th, 2025",
    "author": "",
    "published": "Mon, 16 Jun 2025 16:30:00 -0700",
    "image": "",
    "source": "http://feeds.feedburner.com/CrackedRSS",
    "categories": null
  },
  {
    "id": "78763d81-dfd6-495f-9003-0e586a21c286",
    "title": "What The Duck?",
    "link": "https://awkwardfamilyphotos.com/2025/duck-nightmare/",
    "description": "“My mom thought it would be sweet to hire this living hell of a duck to my 3rd birthday party. This photo was taken seconds before I started screaming and crying in terror.” (submitted by Elisabeth) The post What The Duck? appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Thu, 03 Apr 2025 19:06:26 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2025/04/03120623/inbound712178304268553129-819x1024.jpg",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Birthdays",
      "Misc"
    ]
  },
  {
    "id": "a93cb1a5-949f-4f79-ae83-a7b072dc8b53",
    "title": "The Replacement Plan",
    "link": "https://awkwardfamilyphotos.com/2025/replacement",
    "description": "“We had a professional family photo done for my parents Mother’s \u0026 Father’s Day but right after we gave it to them, my brother got a divorce. My dad decided to cut my ex-sister in law out of the photo and replace her with someone else. Then he hung it on the wall like this... The post The Replacement Plan appeared first on AwkwardFamilyPhotos.com.",
    "author": "Team Awkward",
    "published": "Sat, 22 Feb 2025 00:00:30 +0000",
    "image": "https://s3.awkwardfamilyphotos.com/wp-content/uploads/2025/02/21160026/IMG_1495-772x1024.jpeg",
    "source": "https://awkwardfamilyphotos.com/feed/",
    "categories": [
      "Family Portrait",
      "Misc"
    ]
  },
  {
    "id": "b9f41209-ded8-48ff-8ea3-713c78d1a527",
    "title": "CodeSOD: The Firefox Fix",
    "link": "https://thedailywtf.com/articles/the-firefox-fix",
    "description": "Yitzchak was going through some old web code, and found some still in-use JavaScript to handle compatibility issues with older Firefox versions. if ($.browser.mozilla \u0026\u0026 $.browser.version.slice(0, 1) == '1') { … } What a marvel. Using JQuery, they check which browser is reported- I suspect JQuery is grabbing this from the user-agent string- and then its version. And if the version has a 1 in its first digit, we apply a \"fix\" for \"compatibility\". I guess it's a good thing there will never be more than 9 versions of Firefox. I mean, what version are they on now? Surely the version number doesn't start with a \"1\", nor has it started with a \"1\" for some time, right? [Advertisement] Keep all your packages and Docker containers in one place, scan for vulnerabilities, and control who can access different feeds. ProGet installs in minutes and has a powerful free version with a lot of great features that you can upgrade when ready.Learn more.",
    "author": "Remy Porter",
    "published": "Mon, 16 Jun 2025 06:30:00 GMT",
    "image": "https://thedailywtf.com/images/inedo/proget-icon.png",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "CodeSOD"
    ]
  },
  {
    "id": "e3ec1d60-8268-4630-82a9-7e86334d430a",
    "title": "Error'd: Squaring the Circle",
    "link": "https://thedailywtf.com/articles/squaring-the-circle",
    "description": "Time Lord Jason H. has lost control of his calendar. \"This is from my credit card company. A major company you have definitely heard of and depending upon the size of the area you live in, they may even have a bank branch near you. I've reloaded the page and clicked the sort button multiple times to order the rows by date in both ascending and descending order. It always ends up the same. May 17th and 18th happened twice, but not in the expected order.\" I must say that it is more fun when we know who they are.   A job hunter with the unlikely appelation full_name suggested titling this \"[submission_title]\" which seems appropriate.   \"The browser wars continue to fall out in HTML email,\" reports Ben S. \"Looking at the source code of this email, it was evidently written by \u0026 for Microsoft products (including tags!), and the author likely never saw the non-Microsoft version I'm seeing where only a haphazard assortment of the links are styled. But that doesn't explain why it's AN ELEVEN POINT SCALE arranged in a GRID.\"   \"The owl knows who you are,\" sagely stated Jan. \"This happens when you follow someone back. I love how I didn't have to anonymize anything in the screenshot.\"   \"Location, location, location!\" crows Tim K. who is definitely not a Time Lord. \"Snarky snippet: Found while cleaning up miscellaneous accounts held by a former employee. By now we all know to expect how these lists are sorted, but what kind of sadist *created* it? Longer explanation: I wasn't sure what screenshot to send with this one, it just makes less and less sense the more I look at it, and no single segment of the list contains all of the treasures it hides. \"America\" seems to refer to the entire western hemisphere, but from there we either drill down directly to a city, or sometimes to a US state, then a city, or sometimes just to a country. The only context that indicates we're talking about Jamaica the island rather than Jamaica, NY is the timezone listed, assuming we can even trust those. Also, that differentiator only works during DST. There are eight entries for Indiana. There are TEN entries for the Antarctic.\" Well. In this case, there is a perfectly good explanation. TRWTF is time zones, that's all there is to it. These are the official IANA names as recorded in the public TZDB. In other words, this list wasn't concocted by a mere sadist, oh no. This list was cooked up by an entire committee! If you have the courage, you can learn more than you ever wanted to know about time at the IANA time zones website   [Advertisement] Keep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
    "author": "Lyle Seaman",
    "published": "Fri, 13 Jun 2025 06:30:00 GMT",
    "image": "https://d3hvi6t161kfmf.cloudfront.net/images/24/q1/276/cc_date_sorting.png",
    "source": "http://syndication.thedailywtf.com/TheDailyWtf",
    "categories": [
      "Error'd"
    ]
  },
  {
    "id": "52f71f9c-848d-4653-b09e-acd6e147eac9",
    "title": "Crawlspace",
    "link": "http://theoatmeal.com/comics/crawlspace?no_popup=1",
    "description": "A comic about a crawlspace under a house.View on my website",
    "author": "Matthew Inman",
    "published": "2025-06-16T15:59:58+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/crawlspace_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "76bd9f38-89a1-4acb-8b81-e9e838708fc4",
    "title": "God makes a dog",
    "link": "http://theoatmeal.com/comics/dog_mouth?no_popup=1",
    "description": "A comic about God making a dogView on my website",
    "author": "Matthew Inman",
    "published": "2025-05-29T18:53:31+01:00",
    "image": "https://s3.amazonaws.com/theoatmeal-img/thumbnails/dog_mouth_big.png",
    "source": "http://feeds.feedburner.com/oatmealfeed",
    "categories": null
  },
  {
    "id": "d4aa529a-8abf-42f8-a6eb-97d86545ec75",
    "title": "GOP Lawmakers Clarify Their Hate-Filled Rhetoric Only Meant To Stoke Fundraising",
    "link": "https://theonion.com/gop-lawmakers-clarify-their-hate-filled-rhetoric-only-meant-to-stoke-fundraising/",
    "description": "WASHINGTON—Following the Minnesota attacks in which one Democratic state legislator was killed and another was shot nine times, Republican members of Congress issued a statement Monday clarifying that their hate-filled rhetoric was only meant to stoke fundraising. “While some argue that our inflammatory language was intended to dehumanize and fuel violence against our political rivals, […] The post GOP Lawmakers Clarify Their Hate-Filled Rhetoric Only Meant To Stoke Fundraising appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Mon, 16 Jun 2025 20:05:01 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "Politics",
      "Congress",
      "Violence",
      "Vol 61: Issue 25"
    ]
  },
  {
    "id": "27053ea8-8c4a-4745-b53c-846d0bbe9771",
    "title": "Trump Calls Shooting Victims To Rant About Tim Walz",
    "link": "https://theonion.com/trump-calls-shooting-victims-to-rant-about-tim-walz/",
    "description": "WASHINGTON—Reaching out to the surviving victims of Saturday’s shootings as they recovered from their numerous gunshot wounds, President Donald Trump reportedly called Minnesota state Sen. John Hoffman and his wife Yvette Hoffman on Monday to rant about Gov. Tim Walz. “Your governor was very unfair to me in the 2024 election—a real nasty piece of […] The post Trump Calls Shooting Victims To Rant About Tim Walz appeared first on The Onion.",
    "author": "The Onion Staff",
    "published": "Mon, 16 Jun 2025 18:51:10 +0000",
    "image": "",
    "source": "https://www.theonion.com/rss",
    "categories": [
      "Politics",
      "Donald Trump",
      "Tim Walz",
      "Vol 61: Issue 25"
    ]
  }
]
