{
  "id": "02e0e03b-f1b5-47a2-92e9-836d25f4718c",
  "title": "These 20 Android apps steal your money — delete them now before it’s too late",
  "link": "https://www.talkandroid.com/509573-these-20-android-apps-steal-your-money-delete-them-now-before-its-too-late/",
  "description": "Critical alert for Android users: Cybersecurity experts have identified 20 dangerous applications on the Google Play Store designed…",
  "author": "Talk Android",
  "published": "Thu, 19 Jun 2025 15:30:00 +0000",
  "source": "http://feeds.feedburner.com/AndroidNewsGoogleAndroidForums",
  "categories": [
    "Trending"
  ],
  "byline": "Talk Android",
  "length": 5352,
  "excerpt": "Critical alert for Android users: Cybersecurity experts have identified 20 dangerous applications on the Google Play Store designed to steal cryptocurrency.",
  "siteName": "Talk Android",
  "favicon": "https://www.talkandroid.com/wp-content/uploads/2023/12/cropped-Asset-7@2x-8-1-192x192.png",
  "text": "Editorial Note: Talk Android may contain affiliate links on some articles. If you make a purchase through these links, we will earn a commission at no extra cost to you. Learn more. Critical alert for Android users: Cybersecurity experts have identified 20 dangerous applications on the Google Play Store designed to steal cryptocurrency. These malicious apps disguise themselves as legitimate crypto services while targeting users' digital wallets. If you've downloaded any of these applications, immediate action is required to protect your assets. Cryptocurrency theft scheme targets Android users A major security threat has emerged for cryptocurrency holders using Android devices. Cybersecurity firm Cyble has uncovered an elaborate scheme involving 20 malicious applications available on the Google Play Store. These sophisticated malware apps specifically target users' cryptocurrency wallets by impersonating legitimate financial services. The attackers employ a clever social engineering tactic. When users open these compromised applications, they're redirected to fraudulent websites that prompt them to enter their crypto wallet recovery phrases. These deceptive interfaces often claim there's an urgent problem with the user's funds or that verification is needed to resolve an error. Once cybercriminals obtain these recovery phrases, also called mnemonic seeds, they gain complete access to victims' cryptocurrency holdings. Unlike traditional banking fraud, where transactions can sometimes be reversed, cryptocurrency theft is typically permanent due to the decentralized nature of blockchain technology. If you have any of the following applications installed on your Android device, you should delete them immediately and take additional security measures. The malicious apps mimic popular cryptocurrency platforms like PancakeSwap, Raydium, SushiSwap, and various wallet services. Here's the complete list of dangerous applications and their package names: Application NamePackage NamePancake Swapco.median.android.pkmxajSuiet Walletco.median.android.ljqjryHyperliquidco.median.android.jroylxRaydiumco.median.android.yakmjeBullX Cryptoco.median.android.ozjwkaOpenOcean Exchangeco.median.android.ozjjkxMeteora Exchangeco.median.android.kbxqajSushiSwapco.median.android.pkezyzHarvest Finance blogco.median.android.ljmeobRaydium (alt)cryptoknowledge.rays The researchers also identified two additional malicious applications with different package structures: Raydium (cryptoknowledge.rays) and PancakeSwap (com.cryptoknowledge.quizzz). Following the security report, all these applications have now been removed from the Google Play Store. How these crypto-stealing applications work These malicious applications operate through a sophisticated deception process. They're specifically designed to appear legitimate at first glance, often copying the branding and user interface of trusted cryptocurrency services. This makes them particularly dangerous for both novice and experienced crypto users. The attack methodology follows these steps: Initial download and installation from what appears to be the official Google Play Store When launched, the app redirects users to a convincing but fraudulent website Users are prompted to enter their wallet recovery phrase (typically a 12 or 24-word sequence) The attackers capture this information and gain complete access to the victim's cryptocurrency holdings Funds are quickly transferred to attacker-controlled wallets, making recovery nearly impossible Their ability to bypass Google's security screening process makes these applications particularly dangerous. Despite Google's efforts to maintain Play Store security, sophisticated malware developers continue finding ways to circumvent these protections. The apps often operate legitimately at first, only activating their malicious functions after passing initial security reviews. Protecting your digital assets from crypto theft If you've installed any of the listed applications, immediate action is required. Security experts recommend following these critical steps to secure your digital assets: Immediately uninstall the malicious application from your Android device Check your cryptocurrency wallet balances for any unauthorized transactions If possible, transfer remaining funds to a new, secure wallet with a different recovery phrase Run a comprehensive anti-malware scan on your device to detect any remaining threats Update your Android operating system and security patches to the latest version To prevent future cryptocurrency theft, implement these security best practices: only download financial applications directly from official websites, enable two-factor authentication whenever possible, and consider using a hardware wallet for storing significant crypto holdings. Regardless of how legitimate it appears, never share your recovery phrase with any application or website. This incident reminds us that the cryptocurrency ecosystem remains a prime target for cybercriminals. As digital assets gain mainstream adoption, users must maintain heightened vigilance against increasingly sophisticated threats targeting their investments. Previous Post",
  "image": "https://www.talkandroid.com/wp-content/uploads/2025/06/Canva-TalkAndroid-73.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n\n\t\t\n\t\t\n\n\n\t\t\n\t\t\u003cmain id=\"main\"\u003e\n\n\t\t\t\n\t\t\t\u003cdiv id=\"content\"\u003e\n\n\t\n\t\n\n\n\t\n\t\n\t\t\u003csection\u003e\u003cp\u003e\u003cstrong\u003eEditorial Note:\u003c/strong\u003e Talk Android may contain affiliate links on some articles. If you make a purchase through these links, we will earn a commission at no extra cost to you. \u003cu\u003e\u003ca href=\"https://www.talkandroid.com/affiliate-disclosure/\" target=\"_blank\" data-wpel-link=\"internal\"\u003e\u003cspan\u003eLearn more\u003c/span\u003e\u003c/a\u003e\u003c/u\u003e.\u003c/p\u003e\u003c/section\u003e\n\t\t\n\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cdiv\u003e\n        \t\t\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eCritical alert for Android users: Cybersecurity experts have identified 20 dangerous applications on the Google Play Store designed to steal cryptocurrency. These malicious apps disguise themselves as legitimate crypto services while targeting users\u0026#39; digital wallets. If you\u0026#39;ve downloaded any of these applications, immediate action is required to protect your assets.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"cryptocurrency-theft-scheme-targets-android-users\"\u003e\u003cstrong\u003eCryptocurrency theft scheme targets Android users\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eA major security threat has emerged for cryptocurrency holders using Android devices. Cybersecurity firm Cyble has uncovered an elaborate scheme involving 20 malicious applications available on the Google Play Store. These sophisticated malware apps specifically target users\u0026#39; cryptocurrency wallets by impersonating legitimate financial services.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe attackers employ a clever social engineering tactic. When users open these compromised applications, they\u0026#39;re redirected to fraudulent websites that prompt them to enter their crypto wallet recovery phrases. These \u003cstrong\u003edeceptive interfaces often claim there\u0026#39;s an urgent problem with the user\u0026#39;s funds\u003c/strong\u003e or that verification is needed to resolve an error.\u003c/p\u003e\n\n\n\n\u003cp\u003eOnce cybercriminals obtain these recovery phrases, also called mnemonic seeds, they gain complete access to victims\u0026#39; cryptocurrency holdings. Unlike traditional banking fraud, where transactions can sometimes be reversed, \u003cstrong\u003ecryptocurrency theft is typically permanent due to the decentralized nature of blockchain technology\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eIf you have any of the following applications installed on your Android device, you should delete them immediately and take additional security measures. The malicious apps mimic popular cryptocurrency platforms like PancakeSwap, Raydium, SushiSwap, and various wallet services.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere\u0026#39;s the complete list of dangerous applications and their package names:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003ctable\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003e\u003cstrong\u003eApplication Name\u003c/strong\u003e\u003c/td\u003e\u003ctd\u003e\u003cstrong\u003ePackage Name\u003c/strong\u003e\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003ePancake Swap\u003c/td\u003e\u003ctd\u003eco.median.android.pkmxaj\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSuiet Wallet\u003c/td\u003e\u003ctd\u003eco.median.android.ljqjry\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eHyperliquid\u003c/td\u003e\u003ctd\u003eco.median.android.jroylx\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRaydium\u003c/td\u003e\u003ctd\u003eco.median.android.yakmje\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eBullX Crypto\u003c/td\u003e\u003ctd\u003eco.median.android.ozjwka\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eOpenOcean Exchange\u003c/td\u003e\u003ctd\u003eco.median.android.ozjjkx\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eMeteora Exchange\u003c/td\u003e\u003ctd\u003eco.median.android.kbxqaj\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSushiSwap\u003c/td\u003e\u003ctd\u003eco.median.android.pkezyz\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eHarvest Finance blog\u003c/td\u003e\u003ctd\u003eco.median.android.ljmeob\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRaydium (alt)\u003c/td\u003e\u003ctd\u003ecryptoknowledge.rays\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe researchers also identified two additional malicious applications with different package structures: Raydium (cryptoknowledge.rays) and PancakeSwap (com.cryptoknowledge.quizzz). \u003ci\u003eFollowing the security report, all these applications have now been removed from the Google Play Store\u003c/i\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"how-these-crypto-stealing-applications-work\"\u003e\u003cstrong\u003eHow these crypto-stealing applications work\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eThese malicious applications operate through a sophisticated deception process. They\u0026#39;re specifically designed to appear legitimate at first glance, often copying the branding and user interface of trusted cryptocurrency services. This makes them particularly dangerous for both novice and experienced crypto users.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe attack methodology follows these steps:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eInitial download and installation\u003c/strong\u003e from what appears to be the official Google Play Store\u003c/li\u003e\n\n\n\n\u003cli\u003eWhen launched, the app redirects users to a convincing but fraudulent website\u003c/li\u003e\n\n\n\n\u003cli\u003eUsers are prompted to enter their wallet recovery phrase (typically a 12 or 24-word sequence)\u003c/li\u003e\n\n\n\n\u003cli\u003eThe attackers capture this information and gain complete access to the victim\u0026#39;s cryptocurrency holdings\u003c/li\u003e\n\n\n\n\u003cli\u003eFunds are quickly transferred to attacker-controlled wallets, making recovery nearly impossible\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eTheir ability to bypass Google\u0026#39;s security screening process makes these applications particularly dangerous. \u003cem\u003eDespite Google\u0026#39;s efforts to maintain Play Store security, sophisticated malware developers continue finding ways to circumvent these protections\u003c/em\u003e. The apps often operate legitimately at first, only activating their malicious functions after passing initial security reviews.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"protecting-your-digital-assets-from-crypto-theft\"\u003e\u003cstrong\u003eProtecting your digital assets from crypto theft\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you\u0026#39;ve installed any of the listed applications, immediate action is required. Security experts recommend following these critical steps to secure your digital assets:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eImmediately uninstall the malicious application\u003c/strong\u003e from your Android device\u003c/li\u003e\n\n\n\n\u003cli\u003eCheck your cryptocurrency wallet balances for any unauthorized transactions\u003c/li\u003e\n\n\n\n\u003cli\u003eIf possible, transfer remaining funds to a new, secure wallet with a different recovery phrase\u003c/li\u003e\n\n\n\n\u003cli\u003eRun a comprehensive anti-malware scan on your device to detect any remaining threats\u003c/li\u003e\n\n\n\n\u003cli\u003eUpdate your Android operating system and security patches to the latest version\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eTo prevent future cryptocurrency theft, implement these security best practices: only download financial applications directly from official websites, enable two-factor authentication whenever possible, and consider using a hardware wallet for storing significant crypto holdings. \u003cb\u003eRegardless of how legitimate it appears, never share your recovery phrase with any application or website\u003c/b\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis incident reminds us that the cryptocurrency ecosystem remains a prime target for cybercriminals. As digital assets gain mainstream adoption, users must maintain heightened vigilance against increasingly sophisticated threats targeting their investments.\u003c/p\u003e\n\t\t\n\t\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\t\t\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\t\n\n\t\u003cdiv\u003e\n\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch5\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003ePrevious Post\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/h5\u003e\t\t\t\t\u003c/p\u003e\n\n\t\t\t\t\u003cdiv data-scheme=\"inverse\"\u003e\n\t\t\t\t\t\t\t\t\u003cp\u003e\u003cimg width=\"380\" height=\"250\" src=\"https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-380x250.png\" alt=\"Klarna, The Pay Later Platform, Is Launching a Carrier Too 5\" decoding=\"async\" srcset=\"https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-380x250.png 380w, https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-230x150.png 230w, https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-260x170.png 260w\" sizes=\"(max-width: 380px) 100vw, 380px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20width=\u0026#39;380\u0026#39;%20height=\u0026#39;250\u0026#39;%20viewBox=\u0026#39;0%200%20380%20250\u0026#39;%3E%3C/svg%3E\" data-src=\"https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-380x250.png\" data-srcset=\"https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-380x250.png 380w, https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-230x150.png 230w, https://www.talkandroid.com/wp-content/uploads/2025/06/Klarna-Carrier-260x170.png 260w\"/\u003e\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\u003c/div\u003e\n\t\n\t\t\t\n\n\t\t\u003c/div\u003e\n\n\n\t\t\n\n\n\t\n\t\n\n\n\u003c/div\u003e\n\n\t\t\t\t\n\t\t\t\u003c/main\u003e\n\n\t\t\n\t\t\n\n\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-19T16:30:00+01:00",
  "modifiedTime": null
}
