{
  "id": "306b7b64-2a19-4918-bd57-d6de134dab8e",
  "title": "Samsung Galaxy S26, S26 Edge, and S26 Ultra camera details leak",
  "link": "https://www.gsmarena.com/samsung_galaxy_s26_s26_edge_and_s26_ultra_camera_details_leak-news-68619.php",
  "description": "Samsung's Galaxy S26 family launching in January will have three members but not the ones you'd expect - according to a leak from earlier today, these will be the S26, S26 Edge, and S26 Ultra, with the Plus model being retired. Now another rumor indirectly confirms this by revealing the codenames for the upcoming devices, and there are only three of them: NPA1, NPA2, and NPA3. These stand for \"next paradigm\" or \"new paradigm\", as the S25 family's codenames were all \"paradigm\". Samsung Galaxy S25 Edge The S26 Ultra will allegedly have a 200 MP main camera (which could be using a...",
  "author": "",
  "published": "Tue, 15 Jul 2025 00:11:02 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1066,
  "excerpt": "We also get their codenames. Samsung's Galaxy S26 family launching in January will have three members but not the ones you'd expect - according to a leak...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Samsung's Galaxy S26 family launching in January will have three members but not the ones you'd expect - according to a leak from earlier today, these will be the S26, S26 Edge, and S26 Ultra, with the Plus model being retired. Now another rumor indirectly confirms this by revealing the codenames for the upcoming devices, and there are only three of them: NPA1, NPA2, and NPA3. These stand for \"next paradigm\" or \"new paradigm\", as the S25 family's codenames were all \"paradigm\". Samsung Galaxy S25 EdgeThe S26 Ultra will allegedly have a 200 MP main camera (which could be using a new, big Sony sensor), and a 50 MP telephoto camera with 5x optical zoom. The Galaxy S26 Edge is getting a 50 MP ultrawide, while the base model S26 may not receive any camera upgrades at all. All of this information is said to come from (unnamed) publicly accessible databases, which can clearly be linked with Samsung and its suppliers, so the source insists it's more reliable intel than your average leak or rumor. Whether that's true remains to be seen. Source (in German)",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/07/samsung-galaxy-s26-family-camera-details/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eSamsung\u0026#39;s Galaxy S26 family launching in January will have three members but not the ones you\u0026#39;d expect - \u003ca href=\"https://www.gsmarena.com/there_wont_be_a_samsung_galaxy_s26_new_report_claims-news-68617.php\"\u003eaccording to a leak from earlier today\u003c/a\u003e, these will be the S26, S26 Edge, and S26 Ultra, with the Plus model being retired.\u003c/p\u003e\n\n\u003cp\u003eNow another rumor indirectly confirms this by revealing the codenames for the upcoming devices, and there are only three of them: NPA1, NPA2, and NPA3. These stand for \u0026#34;next paradigm\u0026#34; or \u0026#34;new paradigm\u0026#34;, as the S25 family\u0026#39;s codenames were all \u0026#34;paradigm\u0026#34;.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" alt=\"Samsung Galaxy S25 Edge\" src=\"https://fdn.gsmarena.com/imgroot/news/25/07/samsung-galaxy-s26-family-camera-details/inline/-1200w5/gsmarena_001.jpg\"/\u003e\n\u003cspan\u003e\u003cstrong\u003eSamsung Galaxy S25 Edge\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003eThe S26 Ultra will allegedly have a 200 MP main camera (which could be \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_s26_ultra_could_get_a_massive_camera_upgrade-news-68604.php\"\u003eusing a new, big Sony sensor\u003c/a\u003e), and a 50 MP telephoto camera with 5x optical zoom. The Galaxy S26 Edge is getting a 50 MP ultrawide, while the base model S26 may not receive any camera upgrades at all.\u003c/p\u003e\n\n\u003cp\u003eAll of this information is said to come from (unnamed) publicly accessible databases, which can clearly be linked with Samsung and its suppliers, so the source insists it\u0026#39;s more reliable intel than your average leak or rumor. Whether that\u0026#39;s true remains to be seen.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://winfuture.de/news,152206.html\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e (in German)\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-15T00:11:02+02:00",
  "modifiedTime": null
}
