{
  "id": "3600cc17-ed6a-4fe2-8061-a797f2d4b0d3",
  "title": "We Might See a Xiaomi-branded Smartphone Chip Soon",
  "link": "https://phandroid.com/2024/11/27/we-might-see-a-xiaomi-branded-smartphone-chip-soon/",
  "description": "The company is expected to begin mass producing the new chips next year. The post We Might See a Xiaomi-branded Smartphone Chip Soon appeared first on Phandroid.",
  "author": "Mike Viray",
  "published": "Wed, 27 Nov 2024 22:07:29 +0000",
  "source": "http://feeds2.feedburner.com/AndroidPhoneFans",
  "categories": [
    "Devices",
    "News",
    "MediaTek",
    "Qualcomm",
    "Xiaomi"
  ],
  "byline": "Mike Viray",
  "length": 1306,
  "excerpt": "The company is expected to begin mass producing the new chips next year.",
  "siteName": "Phandroid",
  "favicon": "",
  "text": "Qualcomm’s Snapdragon line is probably the undisputed brand when it comes to smartphone silicon, although this has not deterred smartphone manufacturers from designing and using their own chipsets in their respective smartphones, as seen with the likes of Samsung, Google, Huawei, and of course, Apple. With that said, new reports state that Xiaomi is working on a smartphone chip of its own, which will effectively reduce the company’s need for third-party solutions such as products from MediaTek and Qualcomm. The company is expected to begin mass producing the new chips next year, which will then be used on upcoming smartphones within 2025 as well. READ: Could we See Exynos Chips from TSMC Soon? Aside from this however, not much else is known about Xiaomi’s chip efforts at the moment, so it might be a while before we see reports in benchmark performance and such. In any case, it should be interesting to see another brand come up with its own SoC, especially in a market that’s mostly dominated by Qualcomm and MediaTek. Not too long ago, it was reported that Samsung might be considering moving the production of its Exynos chips from its own foundry to Taiwan Semiconductor Manufacturing Corporation (TSMC), following reports of issues with Samsung’s own yield and production. Source: GSMArena",
  "image": "https://phandroid.com/wp-content/uploads/2024/10/xiaomi-15-5-640x405.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                                \u003cp\u003eQualcomm’s Snapdragon line is probably the undisputed brand when it comes to smartphone silicon, although this has not deterred smartphone manufacturers from designing and using their own chipsets in their respective smartphones, as seen with the likes of Samsung, Google, Huawei, and of course, Apple.\u003c/p\u003e\n\u003cp\u003eWith that said, new reports state that Xiaomi is working on a smartphone chip of its own, which will effectively reduce the company’s need for third-party solutions such as products from MediaTek and Qualcomm. The company is expected to begin mass producing the new chips next year, which will then be used on upcoming smartphones within 2025 as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREAD: \u003ca href=\"https://phandroid.com/2024/11/14/could-we-see-exynos-chips-from-tsmc-soon/\" aria-label=\"“Could we See Exynos Chips from TSMC Soon?” (Edit)\"\u003eCould we See Exynos Chips from TSMC Soon?\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAside from this however, not much else is known about Xiaomi’s chip efforts at the moment, so it might be a while before we see reports in benchmark performance and such. In any case, it should be interesting to see another brand come up with its own SoC, especially in a market that’s mostly dominated by Qualcomm and MediaTek.\u003c/p\u003e\n\u003cp\u003eNot too long ago, it was reported that Samsung might be considering moving the production of its Exynos chips from its own foundry to Taiwan Semiconductor Manufacturing Corporation (TSMC), following reports of issues with Samsung’s own yield and production.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSource: \u003ca href=\"https://www.gsmarena.com/xiaomi_is_developing_its_own_smartphone_chipset_heres_when_it_launches-news-65505.php\"\u003eGSMArena\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-27T22:07:29Z",
  "modifiedTime": null
}
