{
  "id": "4b9f835e-8bea-4c55-8edc-bd3c992c8428",
  "title": "I tried gaming on the Google TV Streamer, and it was just awful",
  "link": "https://www.androidauthority.com/google-tv-streamer-gaming-3497573/",
  "description": "If you're hoping to use the Google TV Streamer for playing games, I'd advise you to look elsewhere.",
  "author": "C. Scott Brown",
  "published": "Sun, 17 Nov 2024 18:00:56 +0000",
  "source": "https://www.androidauthority.com/feed",
  "categories": [
    "Features",
    "Google",
    "Google TV",
    "Google TV Streamer"
  ],
  "byline": "C. Scott Brown",
  "length": 11748,
  "excerpt": "The Google TV Streamer runs Android and can be used for gaming. However, I tried using it for gaming, and it did not go well at all.",
  "siteName": "Android Authority",
  "favicon": "https://www.androidauthority.com/pwa/apple-touch-icon.png",
  "text": "The Google TV Streamer is one of the best and most surprising Google products launched this year. It’s Google’s first non-Chromecast streaming product (the Nexus Q doesn’t count), and it incorporates features you don’t find in many other streamers, including access to Google Home controls and working as a Thread border router. During my Google TV Streamer review, I fell in love with how speedy, simple, and powerful the device is.One thing the streamer does not explicitly do is operate as a gaming machine. However, it runs on the Android TV platform, meaning it at least has the capability of both on-device gaming and game streaming too. This, of course, begets the question: Is the Google TV Streamer any good for gaming?The headline of this article gives away the answer. Let me break down my experience with using the Google TV Streamer for gaming so you can see how bad things really are.Do you use Android TV for gaming?55 votesConnecting my controller to the Google TV StreamerC. Scott Brown / Android AuthorityTo get things started, I grabbed my trusty 8bitdo SN30 Pro Plus controller, specifically because it can operate in three different modes: D-input (a legacy input protocol that works very well in Android), X-input (mimicking an Xbox controller), and Switch (mimicking a Nintendo Switch Pro controller). Theoretically, the Google TV Streamer should support all three modes since Android has natively supported all three input protocols since Android 10. In practice, though, that was not the case.I started first in Switch mode because the SN30 Pro Plus’ face buttons are in the Japanese configuration (A on the right, B on the bottom, etc.). However, I couldn’t get the controller to connect reliably in this mode. The streamer saw the controller as an available connection option but refused to connect to it. So that was a bust.The only input protocol I could get to work reliably was D-input, so make sure your controller supports it.Next, I tried the X-input mode. This connected OK, but the Google TV software didn’t recognize it as an available controller. This is confusing, so let me elaborate. I could connect the controller to the underlying Android TV operating system just fine, but once you pulled up games within the Google TV skin (which exists on top of Android TV, similar to Samsung’s One UI on Galaxy smartphones), it wouldn’t let me play them because it said there was no controller connected. So that was a bust, too.Ultimately, switching to D-input was the only mode that both connected to Android TV and was recognized within Google TV. As such, if you do want to try to use the Google TV Streamer as a gaming device, I highly recommend ensuring you have a controller that supports D-input. The SN30 Pro Plus is an older controller that isn’t made anymore, but the newer 8bitdo Pro 2 ($49 at Amazon) offers the same functionality and comes in lots of fun colors, so I would recommend that.Playing native Android games went OKC. Scott Brown / Android AuthorityWith my controller connected, I could use it to navigate around the Google TV interface in place of the Google TV Streamer’s Bluetooth remote. Right away, I noticed something was amiss as using the controller to move around was noticeably slower and jankier than using the remote. I noted that as a possible problem for gaming and moved on.First, I needed some Android games to play. When you open the Play Store on the Google TV Streamer, there’s a section called “Games” that gives you a curated selection of titles that work well with Android TV. However, the list of games here is small, and they aren’t organized very well. For example, you can’t easily find free Android games, nor can you find games that are paid but priced at a certain level. After getting frustrated with this, I just used my phone. I found that Asphalt 8 is free and has Android TV support, so I installed it by using the drop-down menu next to the “Install” button to push it to the Google TV Streamer.Google doesn't make it convenient to find games that work with Android TV.Within a few minutes, I had the game up and running. It immediately worked with my controller — no configuration needed. However, the frame rates were choppy. This is most likely due to the MediaTek MT8696 SoC powering the hardware, which isn’t a high-end piece of kit. Regardless, it worked.What didn’t work (or, at least, didn’t work well) was my controller. As I feared, there was notable latency between when I hit the button and when my car reacted to it. I decided I should try another, less resource-intensive game to see if there was a difference there, and landed on Double Dragon Trilogy. Unfortunately, this game had the same problem: I’d hit the button for punching, and my character would throw the punch with a considerable delay. This problem made fast-paced games like Double Dragon and Asphalt 8 difficult to enjoy.Even when you find a good game, controller latency and a sluggish processor makes it difficult to play.Thankfully, other game genres aren’t affected quite as much by this issue, such as JRPGs like the fantastic Final Fantasy III. However, you could instead opt to emulate the original NES version of that game, too, which brings us to the next trial.Playing emulated console games was terribleC. Scott Brown / Android AuthorityLet me start by explaining something that came up a few times during my initial review of the Google TV Streamer. There is a solitary USB-C port on the device, and Google told us that it was only used for delivering power to the streamer. After the review embargo lifted, though, other folks said that this lone USB-C port could be used for storage, too, if you connect a powered USB-C hub to it. We did our own testing with this, and it turns out this is sort of true, sort of not. Yes, some powered USB-C hubs will work, but some won’t, and there doesn’t appear to be any rhyme or reason as to which ones work and which ones don’t. Also, for the Google TV Streamer to see your connected storage, it must be formatted in exFAT, not NTFS, which is not ideal. In other words, although users can add expandable storage to the streamer, it is very clear that Google had zero interest in making it easy.Without expandable storage, getting emulators and ROMs to work is a real pain.I mention this here because getting your game ROMs onto the Google TV Streamer so you can play them in an emulation app isn’t easy without expandable storage. Even if you use an Android TV-supported web browser to download ROMs to the streamer itself, Google removed the native file explorer within the Android TV operating system. This happened back with the launch of Android TV 12, and I am at a loss to explain why. Regardless, the lack of a native file explorer causes problems as the emulators are looking for your ROMs in the system but can’t find them because, well, there is no file explorer. Even installing a file explorer from the Play Store doesn’t fix this.In the end, my workaround was to open the ROM directly. The Android system then asked me which app to use to open it, and the only emulator I installed that appeared on this list was Snes9x EX+. This allowed me to fire up Super Mario World without issue. It looked great on the big screen, especially when I switched on a CRT overlay to make it look more like it would have back in the 90s.Once you do get a ROM working in an emulator, though, it doesn't matter, because controller latency makes the game unplayable.However, remember that controller latency problem? Hoo boy, it was even worse here. Getting Mario to jump when I wanted him to was basically impossible, making the best-ever platforming game a frustratingly unplayable experience.I tried other emulators, too, but some don’t support installations on Android TV devices (Dolphin, for example), while others simply wouldn’t open a ROM because of the file explorer problem (Lemuroid, for example).At this point, I was too frustrated to continue. Even if I could hack together a way to get a wide selection of emulators and ROMs working well enough on the Google TV Streamer, the controller latency would remain. The whole time I was doing this, I thought to myself that if I hooked pretty much any of the best Android phones to the TV, I would have a better emulation system than this.The only thing left now was to try streaming some games.Surprisingly, streaming games was the best experienceC. Scott Brown / Android AuthorityMy preferred way to game is on PC, so I have a pretty decent rig for that. Because of this, I opted to run Moonlight for this game streaming test. If you’re not aware of Moonlight, it’s an amazing free and open-source service that allows you to play your PC games from anywhere, assuming those games are installed on a connected PC. Its setup procedure is a bit convoluted, but once you get it going, it works great.Using Moonlight, I saw great visuals and controller latency was low enough that the gameplay was an enjoyable experience.I got this all set up on the Google TV Streamer and, surprisingly, found that this was the best gaming experience I’ve had thus far. I streamed Horizon Forbidden West, and the visuals, gameplay, and sound quality were all great. There was some slight latency with the controller, but it wasn’t nearly as bad as all the other games I had tried up to this point. Even in a fast-paced game like HFW, the latency was short enough that I could enjoy myself. If I had to guess, streaming video from my PC left the streamer free to process my button presses a bit quicker than when running Android games or emulating even old titles like Super Mario World.The Google TV Streamer is terrific, but it is no gaming machineC. Scott Brown / Android AuthorityAfter a frustrating afternoon trying to get the Google TV Streamer to be a gaming machine, I gave up. It’s clear that this device is not going to be anyone’s preferred way to enjoy games on their television. Unless you can live with the controller latency issues while simultaneously accepting that emulation is essentially not an option, this isn’t the gaming device you’re looking for.Honestly, the easiest alternative would be to use your phone. A lot of Android phones, particularly newer flagship models, support DisplayPort, so you just need a USB-C-to-HDMI cable, and boom: your phone is now a gaming console of sorts. This allows you to play a huge range of games — native, emulated, or streamed — with solid frame rates and broad controller support.There's no use forcing a square peg into a round hole. The Google TV Streamer just isn't built for gaming.Of course, using your phone will never top the convenience of a streaming device permanently attached to your television. If that’s what you want, then your next best bet would be to invest in the more expensive NVIDIA Shield TV Pro ($199 at Amazon). You’ll have a better experience across the board with this, thanks to better controller support, a much more powerful processor, and multiple USB ports for directly attaching storage.I want to close this out by saying I still think the Google TV Streamer is amazing — just not for gaming. As a standard media streamer with some specialized smart home tricks, you can’t do much better than this, especially for the $100 price. Maybe if Google launches a follow-up in a few years, it will be better for gaming. Until then, grab this to watch movies and TV, but skip it for games.Google TV StreamerGoogle TV StreamerFast processor • Smart home features • Great remote • Flagship productGoogle's boldest streaming device ever.Carrying on the legacy of the Chromecast, the Google TV Streamer brings a sleek new design, more power, a redesigned remote, and smart home hub features to Google TV.",
  "image": "https://www.androidauthority.com/wp-content/uploads/2024/11/Google-TV-Streamer-with-8bitdo-Controller.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Google TV Streamer is one of the best and most surprising Google products launched this year. It’s Google’s first non-Chromecast streaming product (the Nexus Q doesn’t count), and it incorporates features you don’t find in many other streamers, including access to Google Home controls and working as a Thread border router. During my \u003ca href=\"https://www.androidauthority.com/android-tv-experience-painful-vs-google-tv-streamer-3494967/\"\u003eGoogle TV Streamer review\u003c/a\u003e, I fell in love with how speedy, simple, and powerful the device is.\u003c/p\u003e\u003cp\u003eOne thing the streamer does not explicitly do is operate as a gaming machine. However, it runs on the Android TV platform, meaning it at least has the capability of both on-device gaming and game streaming too. This, of course, begets the question: Is the Google TV Streamer any good for gaming?\u003c/p\u003e\u003cp\u003eThe headline of this article gives away the answer. Let me break down my experience with using the Google TV Streamer for gaming so you can see how bad things really are.\u003c/p\u003e\u003cdiv\u003e\u003ch3\u003eDo you use Android TV for gaming?\u003c/h3\u003e\u003cp\u003e55 votes\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003ch2\u003eConnecting my controller to the Google TV Streamer\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer.jpg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1536w-864h.jpg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-675w-380h.jpg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-64w-36h.jpg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1000w-563h.jpg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-300w-170h.jpg.webp 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1280w-720h.jpg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-840w-472h.jpg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"8bitdo Controller Setup on Google TV Streamer\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer.jpg 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1536w-864h.jpg 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-675w-380h.jpg 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-64w-36h.jpg 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1000w-563h.jpg 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-300w-170h.jpg 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-1280w-720h.jpg 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer-840w-472h.jpg 840w\" alt=\"8bitdo Controller Setup on Google TV Streamer\" src=\"https://www.androidauthority.com/wp-content/uploads/2024/11/8bitdo-Controller-Setup-on-Google-TV-Streamer.jpg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eC. Scott Brown / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eTo get things started, I grabbed my trusty 8bitdo SN30 Pro Plus controller, specifically because it can operate in three different modes: D-input (a legacy input protocol that works very well in Android), X-input (mimicking an Xbox controller), and Switch (mimicking a Nintendo Switch Pro controller). Theoretically, the Google TV Streamer should support all three modes since Android has natively supported all three input protocols since Android 10. In practice, though, that was not the case.\u003c/p\u003e\u003cp\u003eI started first in Switch mode because the SN30 Pro Plus’ face buttons are in the Japanese configuration (A on the right, B on the bottom, etc.). However, I couldn’t get the controller to connect reliably in this mode. The streamer saw the controller as an available connection option but refused to connect to it. So that was a bust.\u003c/p\u003e\u003cp\u003e\u003cq\u003eThe only input protocol I could get to work reliably was D-input, so make sure your controller supports it.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eNext, I tried the X-input mode. This connected OK, but the \u003ca href=\"https://www.androidauthority.com/google-tv-3245980/\"\u003eGoogle TV\u003c/a\u003e software didn’t recognize it as an available controller. This is confusing, so let me elaborate. I could connect the controller to the underlying Android TV operating system just fine, but once you pulled up games within the Google TV skin (which exists on top of Android TV, similar to \u003ca href=\"https://www.androidauthority.com/one-ui-7-3429831/\"\u003eSamsung’s One UI\u003c/a\u003e on Galaxy smartphones), it wouldn’t let me play them because it said there was no controller connected. So that was a bust, too.\u003c/p\u003e\u003cp\u003eUltimately, switching to D-input was the only mode that both connected to Android TV and was recognized within Google TV. As such, if you do want to try to use the Google TV Streamer as a gaming device, I highly recommend ensuring you have a controller that supports D-input. The SN30 Pro Plus is an older controller that isn’t made anymore, but the newer 8bitdo Pro 2 (\u003ca href=\"https://clearbuy.com/redirect/4239d7f3f9395fdb9ff8a81759341d46eb356dca?pId=4618\u0026amp;tag=androautho-20\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\"\u003e$49 at Amazon\u003c/a\u003e) offers the same functionality and comes in lots of fun colors, so I would recommend that.\u003c/p\u003e\u003cp\u003e\u003ch2\u003ePlaying native Android games went OK\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer.jpg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1536w-864h.jpg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-675w-380h.jpg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-64w-36h.jpg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1000w-563h.jpg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-300w-170h.jpg.webp 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1280w-720h.jpg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-840w-472h.jpg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"Asphalt 8 Playing on Google TV Streamer\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer.jpg 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1536w-864h.jpg 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-675w-380h.jpg 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-64w-36h.jpg 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1000w-563h.jpg 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-300w-170h.jpg 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-1280w-720h.jpg 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer-840w-472h.jpg 840w\" alt=\"Asphalt 8 Playing on Google TV Streamer\" src=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Asphalt-8-Playing-on-Google-TV-Streamer.jpg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eC. Scott Brown / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eWith my controller connected, I could use it to navigate around the Google TV interface in place of the Google TV Streamer’s Bluetooth remote. Right away, I noticed something was amiss as using the controller to move around was noticeably slower and jankier than using the remote. I noted that as a possible problem for gaming and moved on.\u003c/p\u003e\u003cp\u003eFirst, I needed some \u003ca href=\"https://www.androidauthority.com/best-android-games-316202/\"\u003eAndroid games\u003c/a\u003e to play. When you open the Play Store on the Google TV Streamer, there’s a section called “Games” that gives you a curated selection of titles that work well with Android TV. However, the list of games here is small, and they aren’t organized very well. For example, you can’t easily find \u003ca href=\"https://www.androidauthority.com/best-free-android-games-329736/\"\u003efree Android games\u003c/a\u003e, nor can you find games that are paid but priced at a certain level. After getting frustrated with this, I just used my phone. I found \u003cspan\u003ethat Asphalt 8 is free and has Android TV support, so I installed it by using the drop-down menu next to the “Install” button to push it \u003c/span\u003eto the Google TV Streamer.\u003c/p\u003e\u003cp\u003e\u003cq\u003eGoogle doesn\u0026#39;t make it convenient to find games that work with Android TV.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eWithin a few minutes, I had the game up and running. It immediately worked with my controller — no configuration needed. However, the frame rates were choppy. This is most likely due to the MediaTek MT8696 SoC powering the hardware, which isn’t a high-end piece of kit. Regardless, it worked.\u003c/p\u003e\u003cp\u003eWhat didn’t work (or, at least, didn’t work well) was my controller. As I feared, there was notable latency between when I hit the button and when my car reacted to it. I decided I should try another, less resource-intensive game to see if there was a difference there, and landed on Double Dragon Trilogy. Unfortunately, this game had the same problem: I’d hit the button for punching, and my character would throw the punch with a considerable delay. This problem made fast-paced games like Double Dragon and Asphalt 8 difficult to enjoy.\u003c/p\u003e\u003cp\u003e\u003cq\u003eEven when you find a good game, controller latency and a sluggish processor makes it difficult to play.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eThankfully, other game genres aren’t affected quite as much by this issue, such as JRPGs like the fantastic Final Fantasy III. However, you could instead opt to emulate the original NES version of that game, too, which brings us to the next trial.\u003c/p\u003e\u003cp\u003e\u003ch2\u003ePlaying emulated console games was terrible\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer.jpg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1536w-862h.jpg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-675w-379h.jpg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-64w-36h.jpg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1000w-561h.jpg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1280w-720h.jpg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-840w-472h.jpg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"Super Mario Bros. World Emulated on Google TV Streamer\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer.jpg 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1536w-862h.jpg 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-675w-379h.jpg 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-64w-36h.jpg 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1000w-561h.jpg 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-1280w-720h.jpg 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer-840w-472h.jpg 840w\" alt=\"Super Mario Bros. World Emulated on Google TV Streamer\" src=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Super-Mario-Bros.-World-Emulated-on-Google-TV-Streamer.jpg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eC. Scott Brown / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eLet me start by explaining something that came up a few times during my initial review of the Google TV Streamer. There is a solitary USB-C port on the device, and Google told us that it was only used for delivering power to the streamer. After the review embargo lifted, though, other folks said that this lone USB-C port could be used for storage, too, if you connect a powered USB-C hub to it. We did our own testing with this, and it turns out this is sort of true, sort of not. Yes, \u003cstrong\u003esome \u003c/strong\u003epowered USB-C hubs will work, but some won’t, and there doesn’t appear to be any rhyme or reason as to which ones work and which ones don’t. Also, for the Google TV Streamer to see your connected storage, it must be formatted in exFAT, not NTFS, which is not ideal. In other words, although users \u003cstrong\u003ecan\u003c/strong\u003e add expandable storage to the streamer, it is very clear that Google had zero interest in making it easy.\u003c/p\u003e\u003cp\u003e\u003cq\u003eWithout expandable storage, getting emulators and ROMs to work is a real pain.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eI mention this here because getting your game ROMs onto the Google TV Streamer so you can play them in an \u003ca href=\"https://www.androidauthority.com/emulators-android-guide-tips-tricks-973083/\"\u003eemulation app\u003c/a\u003e isn’t easy without expandable storage. Even if you use an Android TV-supported web browser to download ROMs to the streamer itself, Google removed the native file explorer within the Android TV operating system. This happened back with the launch of Android TV 12, and I am at a loss to explain why. Regardless, the lack of a native file explorer causes problems as the emulators are looking for your ROMs in the system but can’t find them because, well, there is no file explorer. Even installing a file explorer from the Play Store doesn’t fix this.\u003c/p\u003e\u003cp\u003eIn the end, my workaround was to open the ROM directly. The Android system then asked me which app to use to open it, and the only emulator I installed that appeared on this list was \u003ca href=\"https://play.google.com/store/search?q=snes9x\u0026amp;c=apps\" target=\"_blank\"\u003eSnes9x EX+\u003c/a\u003e. This allowed me to fire up Super Mario World without issue. It looked great on the big screen, especially when I switched on a CRT overlay to make it look more like it would have back in the 90s.\u003c/p\u003e\u003cp\u003e\u003cq\u003eOnce you do get a ROM working in an emulator, though, it doesn\u0026#39;t matter, because controller latency makes the game unplayable.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eHowever, remember that controller latency problem? Hoo boy, it was even worse here. Getting Mario to jump when I wanted him to was basically impossible, making the best-ever platforming game a frustratingly unplayable experience.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eI tried other emulators, too, but some don’t support installations on Android TV devices (\u003ca href=\"https://play.google.com/store/apps/details?id=org.dolphinemu.dolphinemu\" target=\"_blank\" rel=\"noopener\"\u003eDolphin\u003c/a\u003e, for example), while others simply wouldn’t open a ROM because of the file explorer problem (\u003ca href=\"https://play.google.com/store/apps/details?id=com.swordfish.lemuroid\" target=\"_blank\" rel=\"noopener\"\u003eLemuroid\u003c/a\u003e, for example).\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAt this point, I was too frustrated to continue. Even if I could hack together a way to get a wide selection of emulators and ROMs working well enough on the Google TV Streamer, the controller latency would remain. The whole time I was doing this, I thought to myself that if I hooked pretty much any of the \u003ca href=\"https://www.androidauthority.com/best-android-phones-568001/\"\u003ebest Android phones\u003c/a\u003e to the TV, I would have a better emulation system than this.\u003c/p\u003e\u003cp\u003eThe only thing left now was to try streaming some games.\u003c/p\u003e\u003cp\u003e\u003ch2\u003eSurprisingly, streaming games was the best experience\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer.jpg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1536w-864h.jpg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-675w-380h.jpg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-64w-36h.jpg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1000w-563h.jpg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-300w-170h.jpg.webp 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1280w-720h.jpg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-840w-472h.jpg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"Moonlight Game Streaming on Google TV Streamer\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer.jpg 1920w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1536w-864h.jpg 1536w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-675w-380h.jpg 675w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-64w-36h.jpg 64w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1000w-563h.jpg 1000w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-300w-170h.jpg 300w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-1280w-720h.jpg 1280w, https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer-840w-472h.jpg 840w\" alt=\"Moonlight Game Streaming on Google TV Streamer\" src=\"https://www.androidauthority.com/wp-content/uploads/2024/11/Moonlight-Game-Streaming-on-Google-TV-Streamer.jpg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eC. Scott Brown / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eMy preferred way to game is on PC, so I have a pretty decent rig for that. Because of this, I opted to run \u003ca href=\"https://play.google.com/store/apps/details?id=com.limelight\" target=\"_blank\"\u003eMoonlight\u003c/a\u003e for this game streaming test. If you’re not aware of Moonlight, it’s an amazing free and open-source service that allows you to play your PC games from anywhere, assuming those games are installed on a connected PC. Its setup procedure is a bit convoluted, but once you get it going, it works great.\u003c/p\u003e\u003cp\u003e\u003cq\u003eUsing Moonlight, I saw great visuals and controller latency was low enough that the gameplay was an enjoyable experience.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eI got this all set up on the Google TV Streamer and, surprisingly, found that this was the best gaming experience I’ve had thus far. I streamed Horizon Forbidden West, and the visuals, gameplay, and sound quality were all great. There was some slight latency with the controller, but it wasn’t nearly as bad as all the other games I had tried up to this point. Even in a fast-paced game like HFW, the latency was short enough that I could enjoy myself. If I had to guess, streaming video from my PC left the streamer free to process my button presses a bit quicker than when running Android games or emulating even old titles like Super Mario World.\u003c/p\u003e\u003cp\u003e\u003ch2\u003eThe Google TV Streamer is terrific, but it is no gaming machine\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003csource sizes=\"(min-width: 64rem) 51.25rem, 80vw\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light.jpg.webp 1920w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1536w-864h.jpg.webp 1536w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-675w-380h.jpg.webp 675w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-64w-36h.jpg.webp 64w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1000w-563h.jpg.webp 1000w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-300w-170h.jpg.webp 300w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1280w-720h.jpg.webp 1280w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-840w-472h.jpg.webp 840w\" type=\"image/webp\"/\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 51.25rem, 80vw\" title=\"Google TV Streamer with Remote on TV console with red light\" srcset=\"https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light.jpg 1920w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1536w-864h.jpg 1536w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-675w-380h.jpg 675w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-64w-36h.jpg 64w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1000w-563h.jpg 1000w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-300w-170h.jpg 300w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-1280w-720h.jpg 1280w, https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light-840w-472h.jpg 840w\" alt=\"Google TV Streamer with Remote on TV console with red light\" src=\"https://www.androidauthority.com/wp-content/uploads/2024/09/Google-TV-Streamer-with-Remote-on-TV-console-with-red-light.jpg\"/\u003e\u003c/picture\u003e\u003cdiv\u003e\u003cp\u003eC. Scott Brown / Android Authority\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eAfter a frustrating afternoon trying to get the Google TV Streamer to be a gaming machine, I gave up. It’s clear that this device is not going to be anyone’s preferred way to enjoy games on their television. Unless you can live with the controller latency issues while simultaneously accepting that emulation is essentially not an option, this isn’t the gaming device you’re looking for.\u003c/p\u003e\u003cp\u003eHonestly, the easiest alternative would be to use your phone. A lot of Android phones, particularly newer flagship models, support DisplayPort, so you just need a \u003ca href=\"https://www.amazon.com/dp/B0C38WDX79?tag=androidautho-20\u0026amp;linkCode=ogi\u0026amp;th=1\u0026amp;psc=1\" target=\"_blank\"\u003eUSB-C-to-HDMI cable\u003c/a\u003e, and boom: your phone is now a gaming console of sorts. This allows you to play a huge range of games — native, emulated, or streamed — with solid frame rates and broad controller support.\u003c/p\u003e\u003cp\u003e\u003cq\u003eThere\u0026#39;s no use forcing a square peg into a round hole. The Google TV Streamer just isn\u0026#39;t built for gaming.\u003c/q\u003e\u003c/p\u003e\u003cp\u003eOf course, using your phone will never top the convenience of a streaming device permanently attached to your television. If that’s what you want, then your next best bet would be to invest in the more expensive NVIDIA Shield TV Pro (\u003ca href=\"https://clearbuy.com/redirect/47dbb02a1ca934026ab5984f49f5239dfe68675a?pId=1137\u0026amp;tag=androautho-20\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\"\u003e$199 at Amazon\u003c/a\u003e). You’ll have a better experience across the board with this, thanks to better controller support, a much more powerful processor, and multiple USB ports for directly attaching storage.\u003c/p\u003e\u003cp\u003eI want to close this out by saying I still think the Google TV Streamer is amazing — just not for gaming. As a standard media streamer with some specialized smart home tricks, you can’t do much better than this, especially for the $100 price. Maybe if Google launches a follow-up in a few years, it will be better for gaming. Until then, grab this to watch movies and TV, but skip it for games.\u003c/p\u003e\u003cdiv data-deal-order=\"1\"\u003e\u003cp\u003e\u003ca id=\"deal-large-5990\"\u003eGoogle TV Streamer\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cpicture\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"(min-width: 64rem) 12.5rem, (min-width: 40rem) calc(100vw / 3), calc(100vw - 2.5rem)\" alt=\"Google TV Streamer\" src=\"https://clearbuy-cloud.nyc3.digitaloceanspaces.com/media/10008/custom_filename.jpg\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cdiv\u003e\u003cpicture\u003e\u003cimg decoding=\"async\" loading=\"lazy\" sizes=\"2.4375rem\" alt=\"AA Editor\u0026#39;s Choice\" src=\"https://clearbuy-cloud.nyc3.digitaloceanspaces.com/media/455/aa2020_editors_choice.png\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cp\u003eGoogle TV Streamer\u003c/p\u003e\u003cp\u003eFast processor  •  Smart home features  •  Great remote  •  Flagship product\u003c/p\u003e\u003cp\u003eGoogle\u0026#39;s boldest streaming device ever.\u003c/p\u003e\u003cp\u003eCarrying on the legacy of the Chromecast, the Google TV Streamer brings a sleek new design, more power, a redesigned remote, and smart home hub features to Google TV.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-11-17T18:00:56Z",
  "modifiedTime": "2024-11-15T16:55:22Z"
}
