{
  "id": "5b73d286-d094-448f-9232-e96efd32bbca",
  "title": "Meet MediaTek’s New Dimensity 7400 Series",
  "link": "https://phandroid.com/2025/02/24/meet-mediateks-new-dimensity-7400-series/",
  "description": "Both chips are very similar, save for a key difference. The post Meet MediaTek’s New Dimensity 7400 Series appeared first on Phandroid.",
  "author": "Mike Viray",
  "published": "Mon, 24 Feb 2025 23:11:38 +0000",
  "source": "http://feeds2.feedburner.com/AndroidPhoneFans",
  "categories": [
    "Devices",
    "News",
    "dimensity 7400",
    "dimensity 7400x",
    "MediaTek"
  ],
  "byline": "Mike Viray",
  "length": 1346,
  "excerpt": "Both chips are very similar, save for a key difference.",
  "siteName": "Phandroid",
  "favicon": "",
  "text": "Following the launch of its new budget-oriented Dimensity 6400 chipset, MediaTek has just announced the debut of its new midrange chips under the Dimensity 7400 series, the 7400 and 7400x. There are some similarities between both chips, although it should be noted that the 7400x is specifically-tailored for foldable devices. For one, both the Dimensity 7400 and 7400X are built on a 4nm process, featuring an octa-core CPU (4x Arm Cortex-A78 at 2.6GHz, 4x Arm Cortex-A55 at 2.0GHz) and an Arm Mali-G615 MC2 GPU. MediaTek claims that this offers as much as 14-36% lower power consumption during gaming sessions; also included is MediaTek’s “Advanced Gaming Technology” (MAGT) 3.0 which provides a bit of boost for graphics, reduced lag, and battery endurance. READ: The Dimensity 6400 is a “New” but Familiar MediaTek Chip Additionally, MediaTek’s NPU 6.0 is present in both chips and on paper provides a 15% performance gain versus the Dimensity 7300 when it comes to running AI-based apps and software. For photography, there’s an Imagiq 950 ISP inside that supports AI-driven camera features for low-light imaging. There’s also support for Google Ultra HDR that carries over to quality even when uploading photos and videos online. Other features include a 5G R16 modem with 3CC carrier aggregation, and support for tri-band Wi-Fi 6E support.",
  "image": "https://phandroid.com/wp-content/uploads/2024/04/mediatek-dimensity-6300-2.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                                \u003cp\u003eFollowing the launch of its new budget-oriented Dimensity 6400 chipset, MediaTek has just announced the debut of its new midrange chips under the Dimensity 7400 series, the 7400 and 7400x. There are some similarities between both chips, although it should be noted that the 7400x is specifically-tailored for foldable devices.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://howl.link/c3z6mxpgwxab1\"\u003e\u003cimg src=\"https://phandroid.com/wp-content/uploads/2025/02/Galaxy-S25-Ultra-1.png\" alt=\"Galaxy S25 Ultra deal\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFor one, both the Dimensity 7400 and 7400X are built on a 4nm process, featuring an octa-core CPU (4x Arm Cortex-A78 at 2.6GHz, 4x Arm Cortex-A55 at 2.0GHz) and an Arm Mali-G615 MC2 GPU. MediaTek claims that this offers as much as 14-36% lower power consumption during gaming sessions; also included is MediaTek’s “Advanced Gaming Technology” (MAGT) 3.0 which provides a bit of boost for graphics, reduced lag, and battery endurance.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREAD: \u003ca href=\"https://phandroid.com/2025/02/17/the-dimensity-6400-is-a-new-but-familiar-mediatek-chip/\" aria-label=\"“The Dimensity 6400 is a “New” but Familiar MediaTek Chip” (Edit)\"\u003eThe Dimensity 6400 is a “New” but Familiar MediaTek Chip\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAdditionally, MediaTek’s NPU 6.0 is present in both chips and on paper provides a 15% performance gain versus the Dimensity 7300 when it comes to running AI-based apps and software.\u003c/p\u003e\n\u003cp\u003eFor photography, there’s an Imagiq 950 ISP inside that supports AI-driven camera features for low-light imaging. There’s also support for Google Ultra HDR that carries over to quality even when uploading photos and videos online. Other features include a 5G R16 modem with 3CC carrier aggregation, and support for tri-band Wi-Fi 6E support.\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-02-24T23:11:38Z",
  "modifiedTime": null
}
