{
  "id": "d4d5fbb7-019b-4b33-819b-0c0b2bb4623e",
  "title": "Samsung wants to expand its phones' AI chops beyond Google's Gemini",
  "link": "https://www.gsmarena.com/samsung_wants_to_expand_its_phones_ai_chops_beyond_googles_gemini-news-68774.php",
  "description": "Samsung's big AI push came with the launch of the Galaxy S24 series last year, and its Galaxy AI suite has expanded in features ever since, powered by Google's Gemini - for now, at least. Today, Choi Won-Joon, president and chief operating officer of Samsung's mobile division, has told Reuters that the company is very open to alternatives. But, of course, only those that can provide its users with the best experiences. Samsung is already in talks with both OpenAI and Perplexity to integrate their respective AI services into upcoming smartphones, most likely starting with the Galaxy S26...",
  "author": "",
  "published": "Fri, 25 Jul 2025 23:39:02 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1348,
  "excerpt": "It's already in talks with two competitors. Samsung's big AI push came with the launch of the Galaxy S24 series last year, and its Galaxy AI suite has...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Samsung's big AI push came with the launch of the Galaxy S24 series last year, and its Galaxy AI suite has expanded in features ever since, powered by Google's Gemini - for now, at least. Today, Choi Won-Joon, president and chief operating officer of Samsung's mobile division, has told Reuters that the company is very open to alternatives. But, of course, only those that can provide its users with the best experiences. Samsung is already in talks with both OpenAI and Perplexity to integrate their respective AI services into upcoming smartphones, most likely starting with the Galaxy S26 family. Samsung is nearing a deal to invest in Perplexity and integrate both its app and assistant into its phones, a previous report claimed in June. And OpenAI is also in the running, but with no investment from Samsung. Choi said: \"We're talking to multiple vendors. As long as these AI agents are competitive and can provide the best user experiences, we are open to any AI agent out there\". While speaking about Apple's rumored entry into the foldable smartphone space, which Samsung has dominated so far, Choi thinks this move would be beneficial for the entire industry. The company is also evaluating both the upcoming Snapdragon 8 Elite 2 and the Exynos 2600 for the Galaxy S26 range, and it sounds like a final decision hasn't been made yet.",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/07/samsung-talking-to-more-ai-vendors/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eSamsung\u0026#39;s big AI push came with the launch of the \u003ca href=\"https://www.gsmarena.com/res.php3?sSearch=galaxy+s24\"\u003eGalaxy S24 series\u003c/a\u003e last year, and its Galaxy AI suite has expanded in features ever since, powered by Google\u0026#39;s Gemini - for now, at least. Today, Choi Won-Joon, president and chief operating officer of Samsung\u0026#39;s mobile division, has told \u003ca href=\"https://www.bloomberg.com/news/articles/2025-07-25/samsung-pushes-for-diverse-ai-agents-in-galaxy-mobile-devices\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eReuters\u003c/a\u003e that the company is very open to alternatives.\u003c/p\u003e\n\n\u003cp\u003eBut, of course, only those that can provide its users with the best experiences. Samsung is already in talks with both OpenAI and Perplexity to integrate their respective AI services into upcoming smartphones, most likely starting with the Galaxy S26 family.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg width=\"1200\" height=\"799\" src=\"https://fdn.gsmarena.com/imgroot/news/25/07/samsung-talking-to-more-ai-vendors/inline/-1200w5/gsmarena_001.jpg\" alt=\"Samsung wants to expand its phones\u0026#39; AI chops beyond Google\u0026#39;s Gemini\"/\u003e\u003c/p\u003e\u003cp\u003eSamsung is nearing a deal to invest in Perplexity and integrate both its app and assistant into its phones, a previous report claimed in June. And OpenAI is also in the running, but with no investment from Samsung.\u003c/p\u003e\n\n\u003cp\u003eChoi said: \u0026#34;We\u0026#39;re talking to multiple vendors. As long as these AI agents are competitive and can provide the best user experiences, we are open to any AI agent out there\u0026#34;. While speaking about Apple\u0026#39;s \u003ca href=\"https://www.gsmarena.com/iphone_fold_screen_sizes_outed-news-68771.php\"\u003erumored entry into the foldable smartphone space\u003c/a\u003e, which Samsung has dominated so far, Choi thinks this move would be beneficial for the entire industry.\u003c/p\u003e\n\n\u003cp\u003eThe company is also evaluating both the upcoming Snapdragon 8 Elite 2 and the Exynos 2600 \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_s26_series_once_again_rumored_to_mark_a_return_to_exynos-news-67653.php\"\u003efor the Galaxy S26 range\u003c/a\u003e, and it sounds like a final decision hasn\u0026#39;t been made yet.\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-07-25T23:39:02+02:00",
  "modifiedTime": null
}
