{
  "id": "e6415d92-c36d-4094-8933-d0329456b591",
  "title": "New Chat Features Arrive for WhatsApp Users",
  "link": "https://phandroid.com/2025/01/15/new-chat-features-arrive-for-whatsapp-users/",
  "description": "WhatsApp wants your chats to be more fun. The post New Chat Features Arrive for WhatsApp Users appeared first on Phandroid.",
  "author": "Mike Viray",
  "published": "Wed, 15 Jan 2025 22:52:45 +0000",
  "source": "http://feeds2.feedburner.com/AndroidPhoneFans",
  "categories": [
    "Apps",
    "Software",
    "Meta",
    "WhatsApp"
  ],
  "byline": "Mike Viray",
  "length": 1090,
  "excerpt": "WhatsApp wants your chats to be more fun.",
  "siteName": "Phandroid",
  "favicon": "",
  "text": "WhatsApp users, rejoice – the team behind the app recently announced new updates to chat features which add a bit more in the way of visual effects and features, adding a bit more flair to otherwise more standard chats. For one, camera effects are now available for photos and videos sent within chats, and WhatsApp has added 30 different backgrounds, filters and effects for users to choose for their messages. The app now lets folks use their selfies and turn them into stickers via the “create sticker” button, which uses the camera to create custom stickers. READ: We Might See Direct Meta AI Integration with WhatsApp Soon Users will also be able to share their favorite sticker packs directly within chats with other users. Additionally, double-tapping on messages will trigger reactions, and users can quickly scroll through their most frequently used reactions handily. Recently, it was reported that WhatsApp is working on a widget that gives users direct access to Meta AI directly from their phone’s homescreen, complete with generative functions and conversational AI responses.",
  "image": "https://phandroid.com/wp-content/uploads/2020/03/whatsapp.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                                                                \u003cp data-sourcepos=\"3:1-3:210\"\u003eWhatsApp users, rejoice – the team behind the app recently announced \u003ca href=\"https://blog.whatsapp.com/new-year-new-ways-to-chat-on-whatsapp\"\u003enew updates to chat features\u003c/a\u003e which add a bit more in the way of visual effects and features, adding a bit more flair to otherwise more standard chats.\u003c/p\u003e\n\u003cp data-sourcepos=\"3:1-3:210\"\u003e\u003cspan\u003eFor one, camera effects are now available for photos and videos sent within chats, and WhatsApp has added 30 different backgrounds, filters and effects for users to choose for their messages. The app now lets folks use their selfies and turn them into stickers via the “create sticker” button, which uses the camera to create custom stickers.\u003c/span\u003e\u003c/p\u003e\n\u003cp data-sourcepos=\"3:1-3:210\"\u003e\u003cstrong\u003eREAD: \u003ca href=\"https://phandroid.com/2025/01/14/we-might-see-direct-meta-ai-integration-with-whatsapp-soon/\" aria-label=\"“We Might See Direct Meta AI Integration with WhatsApp Soon” (Edit)\"\u003eWe Might See Direct Meta AI Integration with WhatsApp Soon\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp data-sourcepos=\"9:1-9:196\"\u003eUsers will also be able to share their favorite sticker packs directly within chats with other users. Additionally, double-tapping on messages will trigger reactions, and users can quickly scroll through their most frequently used reactions handily.\u003c/p\u003e\n\u003cp data-sourcepos=\"9:1-9:196\"\u003eRecently, it was reported that WhatsApp is working on a widget that gives users direct access to Meta AI directly from their phone’s homescreen, complete with generative functions and conversational AI responses.\u003c/p\u003e\n\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-15T22:52:45Z",
  "modifiedTime": null
}
