{
  "id": "f41744ba-4fd2-40ad-a2ff-c979e3504699",
  "title": "New leaked renders show Samsung is launching three squircle Galaxy Watches",
  "link": "https://www.gsmarena.com/new_leaked_renders_show_samsung_is_launching_three_squircle_galaxy_watches-news-68234.php",
  "description": "Samsung is getting ready to unveil the Galaxy Watch8 and Galaxy Watch8 Classic at its next Unpacked event, which is rumored to take place in New York next month. Both models will employ the squircle case design that made its debut in the Galaxy Watch Ultra from last year. As you'd expect, the Classic will feature a rotating bezel. A new leak today brings a plot twist, however. It's now looking like, alongside the Watch8 and Watch8 Classic, Samsung will also introduce the Galaxy Watch Ultra 2025. Here are all three in freshly leaked renders. Samsung Galaxy Watch8 (left), Watch8...",
  "author": "",
  "published": "Fri, 13 Jun 2025 03:02:02 +0200",
  "source": "https://www.gsmarena.com/rss-news-reviews.php3",
  "categories": [
    "news"
  ],
  "byline": "Vlad",
  "length": 1215,
  "excerpt": "A surprise Ultra has appeared. Samsung is getting ready to unveil the Galaxy Watch8 and Galaxy Watch8 Classic at its next Unpacked event, which is rumored...",
  "siteName": "GSMArena",
  "favicon": "",
  "text": "Samsung is getting ready to unveil the Galaxy Watch8 and Galaxy Watch8 Classic at its next Unpacked event, which is rumored to take place in New York next month. Both models will employ the squircle case design that made its debut in the Galaxy Watch Ultra from last year. As you'd expect, the Classic will feature a rotating bezel. A new leak today brings a plot twist, however. It's now looking like, alongside the Watch8 and Watch8 Classic, Samsung will also introduce the Galaxy Watch Ultra 2025. Here are all three in freshly leaked renders. Samsung Galaxy Watch8 (left), Watch8 Classic (center), and Watch Ultra 2025 (right) We haven't heard much about a new Galaxy Watch Ultra recently, so we assumed Samsung wouldn't refresh the Ultra until next year, but this leak comes to contradict that. As you can see above, the design language has been unified between the three devices, with each one having its own unique look - but they also clearly belong to the same line as well. The Watch8 Classic's bezel is different in order to be easily rotatable, and it also gains the Ultra's Quick Button. The Galaxy Watch8 is expected to come in two sizes, while the other two will be one size fits all. Source",
  "image": "https://fdn.gsmarena.com/imgroot/news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/-952x498w6/gsmarena_000.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"review-body\"\u003e\n\n\n\n\n\n\u003cp\u003eSamsung is getting ready to unveil the \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_watch_8_will_be_powered_by_the_familiar_exynos_w1000_chip-news-67946.php\"\u003eGalaxy Watch8\u003c/a\u003e and \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_watch8_classic_prototype_appears_on_ebay_confirms_squircle_rumors-news-68170.php\"\u003eGalaxy Watch8 Classic\u003c/a\u003e at its next Unpacked event, which is rumored to take place in New York next month. Both models will employ the squircle case design that made its debut in the \u003ca href=\"https://www.gsmarena.com/samsung_galaxy_watch_ultra-13127.php\"\u003eGalaxy Watch Ultra\u003c/a\u003e from last year. As you\u0026#39;d expect, the Classic will feature a rotating bezel.\u003c/p\u003e\n\n\u003cp\u003eA new leak today brings a plot twist, however. It\u0026#39;s now looking like, alongside the Watch8 and Watch8 Classic, Samsung will also introduce the Galaxy Watch Ultra 2025. Here are all three in freshly leaked renders.\u003c/p\u003e\n\n\u003cp\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-1200x900m/gsmarena_001.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Samsung Galaxy Watch8 (left), Watch8 Classic (center), and Watch Ultra 2025 (right)\" width=\"207\" height=\"207\" src=\"https://fdn.gsmarena.com/imgroot/news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-x207/gsmarena_001.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-1200x900m/gsmarena_002.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Samsung Galaxy Watch8 (left), Watch8 Classic (center), and Watch Ultra 2025 (right)\" width=\"207\" height=\"207\" src=\"https://fdn.gsmarena.com/imgroot/news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-x207/gsmarena_002.jpg\"/\u003e\u003c/a\u003e\n\u003ca onclick=\"javascript:ShowImg2(\u0026#34;news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-1200x900m/gsmarena_003.jpg\u0026#34;);return false\" href=\"#\"\u003e\u003cimg alt=\"Samsung Galaxy Watch8 (left), Watch8 Classic (center), and Watch Ultra 2025 (right)\" width=\"207\" height=\"207\" src=\"https://fdn.gsmarena.com/imgroot/news/25/06/samsung-galaxy-watch8-galaxy-watch-ultra-2025-leak/popup/-x207/gsmarena_003.jpg\"/\u003e\u003c/a\u003e\n\u003cbr/\u003e\u003cspan\u003e\u003cstrong\u003eSamsung Galaxy Watch8 (left), Watch8 Classic (center), and Watch Ultra 2025 (right)\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003eWe haven\u0026#39;t heard much about a new Galaxy Watch Ultra recently, so we assumed Samsung wouldn\u0026#39;t refresh the Ultra until next year, but this leak comes to contradict that. As you can see above, the design language has been unified between the three devices, with each one having its own unique look - but they also clearly belong to the same line as well.\u003c/p\u003e\n\n\u003cp\u003eThe Watch8 Classic\u0026#39;s bezel is different in order to be easily rotatable, and it also gains the Ultra\u0026#39;s Quick Button. The Galaxy Watch8 is expected to come in two sizes, while the other two will be one size fits all.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://www.androidheadlines.com/samsung-galaxy-watch-8\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSource\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-06-13T03:02:02+02:00",
  "modifiedTime": null
}
