[
  {
    "id": "cbabdd35-b49e-4d9e-8a6c-59887bf06c4f",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "49124964-1ee1-4baa-a6f7-67a0b0d652f3",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "5a0cd357-692b-49d7-97a9-25f7ea285e1b",
    "title": "Playing with depth of field in urban photography",
    "link": "https://iso.500px.com/playing-with-depth-of-field-in-urban-photography/",
    "description": "Depth of field (DoF) is one of the most powerful compositional tools in photography, allowing you to control what’s in focus and what fades into the background. The post Playing with depth of field in urban photography appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 27 Mar 2025 11:30:54 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/02/mr.-wordsworth-redux-By-jeremyglicksteinphotography-2.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "apertures",
      "blur",
      "cityscape",
      "compositions",
      "creative tools",
      "depth of field",
      "elevate your storytelling",
      "emotional photography",
      "focal lengths",
      "focus",
      "guide the viewer’s eye",
      "urban photography",
      "urban shots"
    ]
  },
  {
    "id": "e7f25284-0bbc-4900-bb0f-cef51ce31a05",
    "title": "The art of long exposure in city photography",
    "link": "https://iso.500px.com/the-art-of-long-exposure-in-city-photography/",
    "description": "From light trails to motion blur, mastering long exposure techniques can add depth, movement, and emotion to your city shots. The post The art of long exposure in city photography appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 20 Mar 2025 11:08:02 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/02/Blurred-cars-on-the-freeway-2.jpeg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "500px photography",
      "cinematic photography",
      "city photography",
      "dynamic photos",
      "light trails",
      "long exposure",
      "photography tips and tricks",
      "reflections",
      "streaks of pedestrians",
      "urban scenes"
    ]
  },
  {
    "id": "b10e3264-8e8a-4184-be69-6dbffa9706c4",
    "title": "World Backup Day 2025",
    "link": "https://digital-photography-school.com/world-backup-day-2025/",
    "description": "The post World Backup Day 2025 appeared first on Digital Photography School. It was authored by Sime. A lesser known celebration for a day that, as a photographer / content creator / filmmaker / regular person that takes photos of their kids on their phone.. (everyone!) SHOULD be at the top of your calendar! World Backup Day! – March 31st! Enter Here: https://www.instagram.com/p/DHu3tVXNE_x/ March 31st each year, we all encourage each other […] The post World Backup Day 2025 appeared first on Digital Photography School. It was authored by Sime.",
    "author": "Sime",
    "published": "Fri, 28 Mar 2025 06:06:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2025/03/WORLD-BACKUP-DAY-2.png?resize=600%2C600\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Photography Tips and Tutorials",
      "Synology",
      "worldbackupday"
    ]
  },
  {
    "id": "e3943c99-36be-40ca-ba73-f7cfc5e15205",
    "title": "Memory cards are all the same, right?",
    "link": "https://digital-photography-school.com/memory-cards-are-all-the-same-right/",
    "description": "The post Memory cards are all the same, right? appeared first on Digital Photography School. It was authored by Sime. Memory cards are all the same, right? Well, yes and no. I believe that if you’re simply a hobbyist and you’re not to worried about ever losing data on a card then it’s not going to make much difference if you get a pricey card or a cheap card. Though I would also suggest if […] The post Memory cards are all the same, right? appeared first on Digital Photography School. It was authored by Sime.",
    "author": "Sime",
    "published": "Tue, 04 Mar 2025 03:08:49 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2025/03/unnamed-scaled.jpg?resize=2560%2C1920\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Cameras and Equipment",
      "backup",
      "Memory Cards",
      "progradedigital",
      "review"
    ]
  },
  {
    "id": "224e850d-9fc2-4290-8b59-5c7ff36bb918",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/32PTLQSKVUI6VDICL5JAZBREOM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "e4636278-798e-4682-86f1-7fd14ab1ebd1",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/A27O6IULEUI6VL32SQ7K27FODM.jpg",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "ac722ab3-1331-4bcf-abf8-51c198d4a08b",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "488266dd-ee22-4ab9-aef8-b01c71c5432d",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "5890e30c-43f1-432a-b286-9b6ffa1772c4",
    "title": "Future Full-Frame \u0026 APS-C Canon RV Series Cameras",
    "link": "https://www.canonrumors.com/future-full-frame-aps-c-canon-rv-series-cameras/",
    "description": "This week Canon officially announced their first two “V” series cameras globally, the PowerShot V1 and the EOS R50 V. Both are targeted at video creators but are more than capable tools for photographers as well. There was some confusion in these parts over the last month with both the “EOS RV” and “EOS R50 [...] The post Future Full-Frame \u0026 APS-C Canon RV Series Cameras appeared first on Canon Rumors.",
    "author": "Craig Blair",
    "published": "Fri, 28 Mar 2025 09:52:07 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Canon EOS Rumors",
      "EOS R50 V",
      "EOS R6 V",
      "EOS R7 V",
      "PowerShot V1",
      "PowerShot V3",
      "spotlight"
    ]
  },
  {
    "id": "60e7b88f-daf1-4573-bc5e-c6f91b78cf68",
    "title": "Mirrorless vs DSLR Cameras: Key Differences \u0026 Best Choice",
    "link": "https://www.canonrumors.com/mirrorless-vs-dslr-cameras/",
    "description": "Coffee or Tea? Cats or dogs? DSLR or Mirrorless? There is no right or wrong answer here, just a choice to make that best suits you. Fret not, for you certainly aren’t alone if rows of sophisticated equipment have intimidated or confused you wondering which one will turn you into the next Ansel Adams or [...] The post Mirrorless vs DSLR Cameras: Key Differences \u0026 Best Choice appeared first on Canon Rumors.",
    "author": "Heidi Loren",
    "published": "Fri, 28 Mar 2025 08:30:00 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Buyers Guide",
      "canon cameras 2025",
      "dslr",
      "mirrorless",
      "Smart Picks"
    ]
  },
  {
    "id": "08ab393f-0244-42bc-85e5-ce9661657634",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "33428d60-bfbd-4237-b62e-fdb12ca9fd16",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "1144ce93-3af8-4f3d-bc42-d3bb472107c8",
    "title": "Don’t Sleep On This Underestimated Lightroom Tool!",
    "link": "https://lightroomkillertips.com/dont-sleep-on-this-underestimated-lightroom-tool/",
    "description": "I did a short video to show one of the most powerful yet underrated, or underestimated, or under-something tools in all of Lightroom – check it out below: I use this tool almost every day, and it’s a boss!!!! 🙂 Coming in May: The Lightroom Conference (and you’re invited) It’s happening May 13th and 14th (with a free bonus pre-con session on May 12th). It’s two+ full days, with two simultaneous training tracks and an instructor team made up of the very best in the business. Best of all, it’s all online and so affordable that anybody can be a part of it. These are the Lightroom superstars we’re bringing together to make this the Lightroom training event of the year, and we’d love for you to join us for this remarkable experience. This live-streamed event is open to everyone—photographers from all over are already signing up (we sneaked the news on my weekly photography show, The Grid)—so sign up early to get the best pricing. You can get all the conference details and register right here: The Lightroom Conference. Hope to see you there! And thanks in advance to everyone for helping us spread the word. –Scott The post Don’t Sleep On This Underestimated Lightroom Tool! appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Fri, 28 Mar 2025 08:16:00 +0000",
    "image": "https://s.w.org/images/core/emoji/15.0.3/72x72/1f642.png",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Develop",
      "Featured"
    ]
  },
  {
    "id": "865fde16-af63-4751-9bda-3bac1f5b630f",
    "title": "Q. Do I Need To Prep My Lightroom Files For Uploading To Adobe Portfolio?",
    "link": "https://lightroomkillertips.com/q-what-do-i-need-to-do-to-prep-my-lightroom-files-for-uploading-to-adobe-portfolio/",
    "description": "Adobe Portfolio is an online portfolio site that uses professionally designed templates so you can have an online portfolio really quickly and easily. It is hosted by Adobe and is included in your Adobe subscription, so you don’t have to pay anything extra (go to MyPortfolio.com to get started and log-in with your Adobe user name and ID). That headline above – that’s a question I got asked this week, and here’s what I do: A. The only two things I do are to make sure when I export the files as JPEGs (using Lightroom Classic’s Export window seen below) are: (1) converted to sRGB mode for the Web, and (2) I add sharpening for online in that same Export window. I don’t resize the image – I upload the full-resolution image as is. Above: (1) Here’s where you choose sRGB as your color profile for viewing in a Web Browser. Above: (2) In the Output Sharpening section of the Export dialog, I turn on the Output Sharpening checkbox and choose “Screen” as the destination, and set my Amount to ‘High’ (unless I’ve previously sharpened this image using a plug-in, like Topaz Sharpen AI or On1 Tack Sharp. I have a full course on Adobe Portfolio If you want to learn how to use Adobe Portfolio (to get your portfolio up and running tonight), then you can watch my easy step-by-step course called “Getting your portfolio online tonight using Adobe Tools” which is kind of a lame name, but the course itself is really helpful (at least that’s what photographers who have watched the course have said). You don’t have to be a KelbyOne member to watch the course – you can buy the course and own it for just $29. Here’s the link. Have a great Monday everybody. 🙂 -Scott The post Q. Do I Need To Prep My Lightroom Files For Uploading To Adobe Portfolio? appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Mon, 24 Mar 2025 08:16:00 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2025/03/Lr1-1024x709.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Export",
      "Featured"
    ]
  },
  {
    "id": "ab8cd138-3f97-4406-87ff-9ea5d3fe6108",
    "title": "How Photographers Celebrated Flaco the Owl’s Year of Freedom",
    "link": "https://petapixel.com/2025/03/28/how-photographers-celebrated-flaco-the-owls-year-of-freedom/",
    "description": "The Eurasian eagle-owl (Bubo bubo) Flaco escaped from his longtime enclosure in New York City's Central Park Zoo in February 2023, attracting many admirers and enchanting millions. While his life was ultimately cut short a year after his escape, Flaco left a lasting impact on many, including enthusiastic birders and photographers Jacqueline Emery and David Lei, who celebrate Flaco's journey in the form of their book, Finding Flaco: Our Year With New York City's Beloved Owl. [Read More]",
    "author": "Jeremy Gray",
    "published": "Fri, 28 Mar 2025 19:30:21 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/03/flaco-the-owl-featured.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Inspiration",
      "Interviews",
      "Spotlight",
      "davidlei",
      "findingflaco",
      "flaco",
      "jacquelineemery",
      "nature",
      "owl",
      "Sony",
      "wildlife"
    ]
  },
  {
    "id": "e041ff47-05b4-4894-81f5-6f26212b2a37",
    "title": "TTArtisan Brings Its $200 75mm f/2 AF Prime to L-Mount",
    "link": "https://petapixel.com/2025/03/28/ttartisans-200-75mm-f2-af-arrives-on-l-mount/",
    "description": "TTArtisan's AF 75mm f/2 portrait prime lens, previously available only for E-mount and Z-mount, now comes in an L-Mount version. It is TTArtisan's first autofocus lens for L-Mount cameras. [Read More]",
    "author": "Kate Garibaldi",
    "published": "Fri, 28 Mar 2025 18:38:30 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/03/TTArtisan-75mm-L-Mount-PetaPixel-BG.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Equipment",
      "News",
      "75mm",
      "lmount",
      "mirrorlesslens",
      "ttartisan"
    ]
  },
  {
    "id": "8f54501a-6cc4-4946-a5c0-d92714a75b3c",
    "title": "The 19th Batch",
    "link": "https://stuckincustoms.com/2025/03/28/the-19th-batch/",
    "description": "As always, more on @trairatcliff 🙂 The post The 19th Batch appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Fri, 28 Mar 2025 20:01:00 +0000",
    "image": "https://s.w.org/images/core/emoji/15.0.3/72x72/1f642.png",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "Midjourney"
    ]
  },
  {
    "id": "b6e57bcf-641a-4ba2-b9ee-91359cd17181",
    "title": "Trey’s Recs #4: Many Lives Many Masters by Dr. Brian Weiss + Sarah Breskman Cosme",
    "link": "https://stuckincustoms.com/2025/03/25/treys-recs-4-many-lives-many-masters-by-dr-brian-weiss-sarah-breskman-cosme/",
    "description": "This video explores Many Lives, Many Masters by Dr. Brian Weiss, offering personal insights and reflections on its impact. The book follows Dr. Weiss’s transformation from a skeptic to a believer in past life regression after working with a particularly troubled patient named Katherine. Her journey through a dozen of her 86 past lives not […] The post Trey’s Recs #4: Many Lives Many Masters by Dr. Brian Weiss + Sarah Breskman Cosme appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Tue, 25 Mar 2025 20:01:00 +0000",
    "image": "",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Book",
      "spirituality"
    ]
  },
  {
    "id": "33e90dc2-4e23-4361-9bf1-132290a8f9e7",
    "title": "Fujifilm Has Announced Its First Compact Medium Format Camera – GFX100RF",
    "link": "https://www.lightstalking.com/fujifilm-gfx100rf/",
    "description": "Fujifilm has announced its first fixed lens, medium format camera, the GFX100RF which is very compact, portable and the lightest of the GFX model cameras. It comes with a 102 megapixel sensor and Fujifilm's X-Processor which is designed to have brilliant autofocus and low light performance. The fixed Fujinon lens is a 35mm f/4 lens. The post Fujifilm Has Announced Its First Compact Medium Format Camera – GFX100RF appeared first on Light Stalking.",
    "author": "Dahlia Ambrose",
    "published": "Thu, 27 Mar 2025 12:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  },
  {
    "id": "4ecf9fe7-a7c7-42f8-908f-7ce0294f893a",
    "title": "Google Touts Real-Time Camera AI",
    "link": "https://www.lightstalking.com/google-touts-real-time-camera-ai/",
    "description": "It looks like Google is bringing its advanced AI to Gemini phones, at least if you’re signed up for the Google One AI Premium plan. And not only that, but this AI can view the world as you see it in real time through your phone. That means it can look at screens, your surroundings, […] The post Google Touts Real-Time Camera AI appeared first on Light Stalking.",
    "author": "Kehl Bayern",
    "published": "Thu, 27 Mar 2025 03:37:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  }
]
