[
  {
    "id": "6d41286f-75f6-4d4c-8ced-b21d203fe0b4",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "8538acc9-6315-4bf5-b64a-46fe0d1cb3f9",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "3951cc9c-7fd1-45fd-943d-72b6ffd10928",
    "title": "Mastering Monochrome: The Art of Single-Color Compositions",
    "link": "https://iso.500px.com/mastering-monochrome-art-single-color-compositions/",
    "description": "Monochrome photography isn’t just about black and white It encompasses creating images using varying tones of a single hue. This powerful technique allows photographers to express emotion, simplify complex scenes, and direct viewer attention. Mastering monochrome photography can significantly enhance your visual storytelling, creating elegant, cohesive, and emotionally resonant images. Understanding the Essence of Monochrome Monochrome compositions are built around a single dominant color, employing different shades, tints, and tones […] The post Mastering Monochrome: The Art of Single-Color Compositions appeared first on 500px.",
    "author": "500px Blog",
    "published": "Thu, 08 May 2025 15:00:07 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/05/monochrome-photography-color-blocking-in-photography-purple-paintbrush-flatlay.png",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Featured",
      "Home Feed",
      "black and white photography",
      "black and white photos",
      "Monochromatic color scheme",
      "Monochromatic colors",
      "monochrome",
      "monochrome photography"
    ]
  },
  {
    "id": "523f4b0d-51ae-44fc-bd2a-45f4d80bf39e",
    "title": "Making Bold Statements with Color Blocking in Photography",
    "link": "https://iso.500px.com/making-bold-statements-with-color-blocking-in-photography/",
    "description": "Color blocking is a powerful photographic technique that uses bold, solid colors placed strategically within an image to create visual interest, impact, and drama. By embracing simplicity and contrast, photographers can craft visually striking images that command viewer attention and evoke strong emotions. Here’s how to master color blocking and transform your photographic storytelling. Understanding the Impact of Color Blocking Color blocking involves composing photographs around large, defined areas of […] The post Making Bold Statements with Color Blocking in Photography appeared first on 500px.",
    "author": "500px",
    "published": "Thu, 01 May 2025 15:00:55 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2025/05/color-blocking-in-photography-geometric-red-blue-minimalism.png",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Featured",
      "Home Feed"
    ]
  },
  {
    "id": "1e7c317e-aed1-4724-b3e3-4481b03274cb",
    "title": "Weekly Wrap Up!",
    "link": "https://digital-photography-school.com/weekly-wrap-up/",
    "description": "The post Weekly Wrap Up! appeared first on Digital Photography School. It was authored by Sime. What did you do with your camera this week? We actually want to know! Inspiration goes both ways, right? Pop us a comment, even just to say g’day. I try to get out with my camera as often as life allows! I just (literally, moments ago haha) tried to setup a shot where you could […] The post Weekly Wrap Up! appeared first on Digital Photography School. It was authored by Sime.",
    "author": "Sime",
    "published": "Thu, 08 May 2025 22:38:24 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2025/05/hab.png?resize=1080%2C1080\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Photography Tips and Tutorials"
    ]
  },
  {
    "id": "d813b585-7ccb-4132-95d7-aee9981ec4a4",
    "title": "Photographing Children – Composition",
    "link": "https://digital-photography-school.com/photographing-children-composition/",
    "description": "The post Photographing Children – Composition appeared first on Digital Photography School. It was authored by Darren Rowse. I thoroughly enjoy photographing children and have opportunity to do quite a bit of it lately after many of our friends have had babies. Probably the most important tip I’ve learned in photographing them is to get on their level. So many of my friends show me photos of their kids which are taken from […] The post Photographing Children – Composition appeared first on Digital Photography School. It was authored by Darren Rowse.",
    "author": "Darren Rowse",
    "published": "Thu, 08 May 2025 09:14:13 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/images/composition-kids.jpg?resize=300%2C200\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Portrait Photography",
      "Composition"
    ]
  },
  {
    "id": "6a763f9a-bfa9-46c7-80e4-c0e86dec46a1",
    "title": "Canon EOS R5 C Mark II, Will We See One?",
    "link": "https://www.canonrumors.com/canon-eos-r5-c-mark-ii-will-we-see-it/",
    "description": "One of the most asked questions that we get here at Canon Rumors is whether there will be an EOS R5 C Mark II? We have spent a fair bit of time over the last while figuring out if we’ll indeed see one this year or in the future. Canon EOS R5C Mark II We [...] The post Canon EOS R5 C Mark II, Will We See One? appeared first on Canon Rumors.",
    "author": "Craig Blair",
    "published": "Sat, 10 May 2025 15:56:58 +0000",
    "image": "https://www.canonrumors.com/wp-content/uploads/2025/05/eosr5cheader169.jpg",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Canon Business General",
      "Cinema EOS C400",
      "Cinema EOS C80",
      "Cinema EOS R5 C",
      "Cinema EOS R5 C Mark II",
      "spotlight"
    ]
  },
  {
    "id": "dc0a6bf6-c810-4182-bac2-be67d264a756",
    "title": "Will We Finally See Third-Party Autofocus for Full-Frame RF?",
    "link": "https://www.canonrumors.com/will-we-finally-see-third-party-autofocus-on-full-frame-rf/",
    "description": "This article took a couple of days going back and forth as to whether or not it should be written. The topic of third-party RF lenses for full-frame cameras has been a polarizing one. There are a lot of Canon shooters that would never buying a third-party lens for EOS R and don’t feel there [...] The post Will We Finally See Third-Party Autofocus for Full-Frame RF? appeared first on Canon Rumors.",
    "author": "Craig Blair",
    "published": "Fri, 09 May 2025 15:05:17 +0000",
    "image": "https://www.canonrumors.com/wp-content/uploads/2025/05/viltrox3512header.jpg",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Third Party Lenses",
      "EOS R1",
      "EOS R5 Mark II",
      "EOS R6 Mark II",
      "EOS R8",
      "Meike",
      "sigma",
      "spotlight",
      "tamron",
      "Viltrox"
    ]
  },
  {
    "id": "e64746d8-e3a5-4d50-9d03-d26dc7d17961",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "418859d8-d7f8-48d0-bb20-cc7b454b998f",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "100ca51a-ff90-4e8e-8c6c-ac5db375232a",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "5c6f2489-9be5-43dd-b4a7-211b83fe783a",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "e9f416fe-20fe-48b7-bbdf-73ce62182ecc",
    "title": "Thypoch Simera 75mm f/1.4 Review: A Lovely Pocketable Portrait Prime",
    "link": "https://petapixel.com/2025/05/10/thypoch-simera-75mm-f-1-4-review-a-lovely-pocketable-portrait-prime/",
    "description": "I love the 75mm focal length. In fact, anything around 70mm to 90mm is more like a normal lens for me than a 50mm. And if the lens has a fast aperture, I'm even more enamored. [Read More]",
    "author": "Chris Niccolls",
    "published": "Sat, 10 May 2025 14:01:36 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/05/Thypoch-Simera-75mm-f1.4-Review-M-Mount-for-the-Masses.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Equipment",
      "Reviews",
      "analogfilm",
      "leicamcamera",
      "leicammount",
      "mmount",
      "mmountlens",
      "portraitphotography",
      "rangefinder",
      "streetphotography",
      "thypoch",
      "thypochsimera",
      "thypochsimera75mmf14",
      "voigtlander75mmnoktonf15"
    ]
  },
  {
    "id": "916717c6-ee43-4e88-a4de-b922dd72f864",
    "title": "This Rolling Wildlife Spy Camera Looks Like Dung",
    "link": "https://petapixel.com/2025/05/09/this-rolling-wildlife-spy-camera-looks-like-dung/",
    "description": "What would you do to create unique wildlife footage? Build a robotic spy Dung Cam, of course. [Read More]",
    "author": "Kate Garibaldi",
    "published": "Fri, 09 May 2025 20:22:46 +0000",
    "image": "https://petapixel.com/assets/uploads/2025/05/Dung-Cam-PetaPixel-BG-2.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Spotlight",
      "bbc",
      "camera",
      "dung",
      "dungcam",
      "johndowner",
      "pbs",
      "poo"
    ]
  },
  {
    "id": "3c988ecf-3db0-4761-996f-5028409deb69",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://bostonglobe-bostonglobe-prod.web.arc-cdn.net/resizer/v2/32PTLQSKVUI6VDICL5JAZBREOM.jpg?auth=32b6cce7791266809f447408c2a463dbacf449ce998434cdf179a6e6e3c05d5d\u0026smart=true\u0026width=3048\u0026height=2108",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "116103c5-d8c2-4182-b021-0c417dddf146",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://bostonglobe-bostonglobe-prod.web.arc-cdn.net/resizer/v2/A27O6IULEUI6VL32SQ7K27FODM.jpg?auth=fb7704ff9d568394fa7fb75960a3b3d08935641b422af48f2422539d95eeaed9\u0026smart=true\u0026width=5472\u0026height=3648",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "9aec1571-9d58-43a1-a2f2-5d6ad951de8a",
    "title": "This Photographer Just Choked Out a Camera Thief!",
    "link": "https://www.lightstalking.com/photographer-chokes-camera-thief/",
    "description": "In Barcelona, Spain, a Chinese photographer, Jia Daming, was able to choke down the thief who snatched his camera and this news has gone viral for his heroic act. Footage of the incident can be found here on X. The photographer was not harmed and was able to get his equipment back. The post This Photographer Just Choked Out a Camera Thief! appeared first on Light Stalking.",
    "author": "Dahlia Ambrose",
    "published": "Fri, 09 May 2025 12:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  },
  {
    "id": "67c13063-60be-48fa-84b2-09060a81a80b",
    "title": "DJI Has Released A Teaser Clip “Spin Your World” Ahead Of Its Product Launch",
    "link": "https://www.lightstalking.com/dji-spin-your-world/",
    "description": "DJI has released a new teaser on its channels, which is a very short video clip titled \"Spin Your World.\" It looks like the camera module is capable of rotating, which means it will be a great feature for filmmakers and content creators. The post DJI Has Released A Teaser Clip “Spin Your World” Ahead Of Its Product Launch appeared first on Light Stalking.",
    "author": "Dahlia Ambrose",
    "published": "Wed, 07 May 2025 12:00:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  },
  {
    "id": "3881c27c-292e-443d-9aa3-426b7413badc",
    "title": "More from my in progress Project",
    "link": "https://stuckincustoms.com/2025/04/29/more-from-my-in-progress-project/",
    "description": "Hey awesome reader. A little more from me on Aperty, which if you read the previous post you’ll know I’m using for a current project. A couple of things this time round. Firstly Sklyum let me know that the offer I mentioned expires in the next day or so. Therefore, if you want to grab […] The post More from my in progress Project appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Tue, 29 Apr 2025 19:01:00 +0000",
    "image": "https://i0.wp.com/photos.smugmug.com/photos/i-6Xb2m5Q/0/MgPBWzSwRtXfJnk7mnfF6xSTsgqxSwQ99hdfpSS6z/X2/i-6Xb2m5Q-X2.png?w=900\u0026ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Aperty",
      "Photo Software",
      "Skylum",
      "aperty",
      "portrait",
      "Post processing"
    ]
  },
  {
    "id": "84beaa00-cfc3-4545-90c5-11b31cb3175e",
    "title": "A New Portrait Project",
    "link": "https://stuckincustoms.com/2025/04/27/a-new-portrait-project/",
    "description": "And Exploring Skylum Aperty I’ve started work on a portrait project which is, let’s just say not insignificant, in its scope… because if I think about it too much, I realise it’s quite the crazy undertaking! So, while I was planning this out, I had to think about how my workflow might work. How do […] The post A New Portrait Project appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Sun, 27 Apr 2025 19:01:00 +0000",
    "image": "https://i0.wp.com/photos.smugmug.com/photos/i-7t2GFtK/0/MjXC6J4f4fnB739ZPzG6p2grWLB8QqGG4kndwLhTg/X2/i-7t2GFtK-X2.png?w=900\u0026ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Aperty",
      "Photo Software",
      "Photography Tips",
      "Skylum",
      "portrait"
    ]
  }
]
