[
  {
    "id": "76fbf873-55c0-424f-bcdb-2ed3c87297ab",
    "title": "Fortezza da Basso, Florence",
    "link": "https://www.thesartorialist.com/the-fortezza-florence-10/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 18:00:00 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Boots",
      "Dresses",
      "Florence",
      "Sunglasses"
    ]
  },
  {
    "id": "a20d0f28-f7e9-4b15-8e01-b8b3898c9598",
    "title": "East Village, New York",
    "link": "https://www.thesartorialist.com/east-village-friday-new-york/",
    "description": "",
    "author": "sartorialist",
    "published": "Fri, 01 May 2020 14:00:39 +0000",
    "image": "",
    "source": "https://feeds.feedburner.com/TheSartorialist",
    "categories": [
      "Women",
      "Black",
      "New York",
      "Shorts"
    ]
  },
  {
    "id": "86a26899-0f88-4544-b5f6-d9cc6ce83aa6",
    "title": "November’s Licensing Rush winners are here!",
    "link": "https://iso.500px.com/novembers-licensing-rush-winners-are-here/",
    "description": "This past November, Licensing Rush continued to grow, with more than 25,000 photos submitted from participating photographers around the world. The post November’s Licensing Rush winners are here! appeared first on 500px.",
    "author": "500px Blog",
    "published": "Wed, 18 Dec 2024 12:30:15 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2024/12/Frame-799.png",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "500px photographers",
      "500px portfolio",
      "competition",
      "license your photos",
      "Licensing Quest",
      "Licensing Rush",
      "model release",
      "photo challenge",
      "submit your photos",
      "winners"
    ]
  },
  {
    "id": "2f3d3799-78e8-451b-9bae-57c5c36b4128",
    "title": "The 500px Global Photography Awards 2024: Submit your best work",
    "link": "https://iso.500px.com/global-photography-awards-2024/",
    "description": "The 500px Global Photography Awards is a free international competition with $23,000 in prizes from DJI, Crucial, Lowepro and Manfrotto and a chance to be Photographer of the Year. The post The 500px Global Photography Awards 2024: Submit your best work appeared first on 500px.",
    "author": "500px Blog",
    "published": "Tue, 17 Dec 2024 15:30:48 +0000",
    "image": "https://iso.500px.com/wp-content/uploads/2024/12/Awards-blog-cover-1.jpg",
    "source": "https://iso.500px.com/feed/",
    "categories": [
      "500px Blog",
      "Headline",
      "Home Feed",
      "500px community",
      "500px global photography awards",
      "500px Photographer of the Year",
      "art",
      "competition",
      "Hobbyist",
      "photography contest",
      "prizes",
      "professional photographer",
      "submit your best work"
    ]
  },
  {
    "id": "8812f5a5-c81a-440a-8a15-6963e4d9788e",
    "title": "An AI Image-Quality Enhancer Like No Other: Improve Your Photo’s Quality With Aiarty Image Enhancer",
    "link": "https://digital-photography-school.com/aiarty-image-quality-enhancer/",
    "description": "The post An AI Image-Quality Enhancer Like No Other: Improve Your Photo’s Quality With Aiarty Image Enhancer appeared first on Digital Photography School. It was authored by Darren Rowse. Are you ever frustrated to find images in your catalog that are low resolution, blurry, or noisy? You’re not alone.  Photographers get stuck with low-quality images all the time, for a host of reasons. For instance, most photographers have at least a few folders filled with images captured using camera equipment during the early days […] The post An AI Image-Quality Enhancer Like No Other: Improve Your Photo’s Quality With Aiarty Image Enhancer appeared first on Digital Photography School. It was authored by Darren Rowse.",
    "author": "Darren Rowse",
    "published": "Wed, 18 Dec 2024 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2024/12/Aiarty-image-enhancer-1005.jpg?resize=1200%2C1244\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Photography Tips and Tutorials",
      "beginner",
      "image enhancement"
    ]
  },
  {
    "id": "8f50927e-53e0-40d9-95bb-f70b1fd7de32",
    "title": "How to Buy Used Camera Gear: A Step-By-Step Guide",
    "link": "https://digital-photography-school.com/buy-used-camera-gear/",
    "description": "The post How to Buy Used Camera Gear: A Step-By-Step Guide appeared first on Digital Photography School. It was authored by Suzi Pratt. Digital photography equipment – especially top-notch mirrorless cameras, DSLRs, and lenses – is expensive. While big manufacturers do continue to add more affordable options to their lineups, what if you need a high-level camera or lens but don’t have $3000+ to spend? That’s where used gear comes in handy. If you approach the used market […] The post How to Buy Used Camera Gear: A Step-By-Step Guide appeared first on Digital Photography School. It was authored by Suzi Pratt.",
    "author": "Suzi Pratt",
    "published": "Tue, 17 Dec 2024 09:00:00 +0000",
    "image": "https://i0.wp.com/digital-photography-school.com/wp-content/uploads/2023/01/how-to-buy-used-camera-gear-1005.jpg?resize=1242%2C1265\u0026ssl=1",
    "source": "https://feeds.feedburner.com/DigitalPhotographySchool",
    "categories": [
      "Cameras and Equipment",
      "beginner",
      "camera gear"
    ]
  },
  {
    "id": "d9db6b3a-8161-4e57-bd95-3ff8079df4c1",
    "title": "Mastering the Art of Sports Photography",
    "link": "https://www.canonrumors.com/mastering-the-art-of-sports-photography/",
    "description": "Millions of us grew up dreaming of winning a Super Bowl or hitting the home run that clinches the World Series. Unfortunately, for most of us, those dreams were as far as it went. Even those lucky enough to be talented enough to play for organized teams probably didn’t go on to be a champion [...] The post Mastering the Art of Sports Photography appeared first on Canon Rumors.",
    "author": "Charlie Newsom",
    "published": "Wed, 18 Dec 2024 14:53:49 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Photo News"
    ]
  },
  {
    "id": "4fd3d739-600e-46e0-9371-2b2763898091",
    "title": "Stock Notice: Refurbished Canon RF 35mm f/1.4L VCM $1349 (Reg $1499)",
    "link": "https://www.canonrumors.com/stock-notice-refurbished-canon-rf-35mm-f-1-4l-vcm-1349-reg-1499/",
    "description": "The Canon USA store has refurbished Canon RF 35mm f/1.4L VCM lenses in stock for $1349 (Reg $1499). As always, refurbished gear from the Canon USA store comes with a full 1-year Canon USA warranty REFURBISHED CANON RF 35MM F/1.4L VCM Canon RF 35mm f/1.4L VCM Overview Designed with high-end cinema video in mind, the Canon [...] The post Stock Notice: Refurbished Canon RF 35mm f/1.4L VCM $1349 (Reg $1499) appeared first on Canon Rumors.",
    "author": "Canon Rumors",
    "published": "Wed, 18 Dec 2024 10:55:06 +0000",
    "image": "",
    "source": "https://www.canonrumors.com/feed/",
    "categories": [
      "Deal Zone",
      "DealZone",
      "RF 35 f/1.4L VCM"
    ]
  },
  {
    "id": "0baaf102-21e1-4ec1-a75f-db243792fede",
    "title": "How the iPhone 16 Can Help You Be a Better Content Creator",
    "link": "http://onebigphoto.com/how-the-iphone-16-can-help-you-be-a-better-content-creator/",
    "description": "If you’re a content creator, you know the value of using tools that help you produce better quality content and make the entire editing process easy from start to finish. Whether you’re creating videos, podcasts, written content, or even graphics, the iPhone 16 just might be your new favorite tool. As long as you have […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:49:35 +0000",
    "image": "http://onebigphoto.com/uploads/2019/11/whystudentsneed1-300x200.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "77fd683e-e90b-4330-ab05-fcb4d9d27bd4",
    "title": "Wallet Management 101: How to Keep Your Wallet in Great Shape",
    "link": "http://onebigphoto.com/wallet-management-101-how-to-keep-your-wallet-in-great-shape/",
    "description": "Wallets aren’t incredibly expensive, but if you take good care of them, they can serve you well and last a lifetime. Thankfully, the most important strategies for keeping a wallet in good condition are both inexpensive and highly accessible.   How do you keep your wallet in great shape?   Choose the Right Wallet   […]",
    "author": "Bigphoto",
    "published": "Fri, 24 May 2024 18:34:24 +0000",
    "image": "http://onebigphoto.com/uploads/2024/05/walletobp-300x150.jpg",
    "source": "http://feeds.feedburner.com/OneBigPhoto",
    "categories": [
      "Blog"
    ]
  },
  {
    "id": "48f8da83-865b-4da3-b1d4-691033bbcfec",
    "title": "My “18th Annual Gonzo Holiday Photo Gear Guide” Is Here!",
    "link": "https://lightroomkillertips.com/my-18th-annual-gonzo-holiday-photo-gear-guide-is-here/",
    "description": "Yes, my friends, it’s that time again (well, actually, it’s a little bit late this year, but let’s not dwell on that), because here it is — it’s my “18th Annual Gonzo Holiday Photo Gear Guide.” No one is more surprised than I am about that whole “18th Annual” part. When I wrote the first one, Calvin Coolidge was President, Gunsmoke was a prime-time TV show, and the Spice Girls had just released their epic Hotel California album. It was a wild time, folks. Wild time. Anyway, there is, once again, some really cool, fun, and tasty gear in this year’s guide. So, it’s time to unleash this year’s “gonzoness” upon you. Here are our three gift categories: Just remember, giving one of these gifts by itself isn’t enough. The real magic of the holidays is when you can make others feel inadequate by sharing what you got on Facebook. It’s what separates us from the animals. So, without further ado, I present to you my “18th Annual Gonzo Holiday Photo Gear Guide” and guided path to financial ruin. Important Note: Before you buy anything on this list, if you’re a KelbyOne member, don’t forget to check the Discounts page on the KelbyOne member’s site (it’s under Perks in your Dashboard). A lot of companies have offered special deals just for KelbyOne members, and there’s nothing wrong with saving a buck or two when buying these gifts. STOCKING STUFFERS: These are the perfect gifts for people you don’t really care that much about, but it would be awkward if you didn’t get them anything: Gear Labels from Field Made Co This is a really nice one because it’s easy-to-read, stick-on labels that the photographer on your gift list attaches to their lens caps so, they can easily see at a glance which lens is which in their camera bag (as seen above). This is a can’t-miss stocking stuffer. Price: $29 for a 45 sticker set. Comes in nice packaging. For Canon (link) For Nikon (link) For Sony (link) Note: They have most other lens brands, too. Think Tank Photo Battery Holder 4 I so love mine! It holds four batteries of the most commonly used size for most cameras these days, and it keeps things neat and organized (no more digging around your bag trying to find a fresh battery). I can’t tell you how simple and awesome these are. This gift is a guaranteed hit! Price: $19.75 (link) Vello BL-HS1 Low Profile Bubble Level It’s a very small, super-low-profile bubble level that slides right in their camera’s hot-shoe mount and lets them see at a glance if the camera is level. With this handy little gadget, they’ll finally stop submitting landscape images with crooked horizon lines for the monthly blind critiques episode of The Grid. But I digress. This is such a great gift at such a great price. Price: $11.99 (link) B\u0026H Photo Gift Card What could be better than a gift card to the greatest camera store in the world? Whatever the photographer on your gift list wants, they have it in stock, ready to ship. They’re the magical unicorn of camera stores. Get them a gift card from here, and they’ll follow you anywhere (which may or may not be a good thing). Price: Starting at $25 (link)  A Roll of Gaffer Tape I’ve listed this stocking stuffer many times before because it never goes out of style, and it’s better than just a “roll of tape.” It was developed in Hollywood for use in movies and TV shows because this tape does something very special: when you remove it from a wall, some equipment, your mother-in-law, etc., it doesn’t pull off paint (or skin) or leave a sticky residue. That’s why photographers love it; it’s easy to tear, easy to use, and doesn’t mess up stuff when you’re done. Price: ProTapes Pro Gaffer Tape 2″x 55 Yard Roll: $19.95 (link) My Book, The iPhone Photography Book It’s still my bestselling book for these past few years. I took the principles of taking great photos with a regular DSLR or mirrorless camera and showed you how to apply those same techniques using the camera on your iPhone. I uncover all sorts of great tricks, tips, and settings that’ll help you take images that will have people saying, “You took that with your iPhone? No way!” But oh, yes. Way. Price: $18.99 Paperback (a buck less for the eBook edition. I don’t make the eBook pricing). The Platypod Grip (for iPhone shooters) There are a lot of iPhone holders out there, but I think this one is the best bang for the buck (you can’t believe how expensive good ones like this can be). You can mount it on a regular tripod (the bottom of it fits standard Arca-Swiss type mounts), or you can mount it on the Platypod Base (which is what I do — it’s $9.95), and it’s so easy to use and so well made that this is one mount you’ll actually use. Price: $39.00 (link); Platypod Basic Plate: $9.95 (link) How to Make Money While You Are Sleeping: A Photographer’s Guide to Passive Income and Other Savvy Business Strategies by Rick Sammon Rick has written a string of bestselling books for photographers, and this is one that would make any photographer happy, because who doesn’t want passive income? Rick is a great writer and always shares such helpful information, so this would make an awesome stocking stuffer. Price: Print: $14.95; Kindle: $9.95 (link) Pocket Tripod Pro This is a little engineering miracle — it’s a tripod for your iPhone (or Android phone) that fits in your wallet. It’s about the size and shape of a credit card, but with a twist and two clicks, it transforms into a shooting platform for your phone, and well, it’s just so darn clever and super-handy. It’s also really well made. Price: $35 (link) A Couple of Spare Camera Batteries Even if they have a spare battery, every photographer would still love another one (or two). It’s one of those can’t-go-wrong stocking stuffers. For Canon EOS R5 \u0026 EOS R6 […] The post My “18th Annual Gonzo Holiday Photo Gear Guide” Is Here! appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Tue, 17 Dec 2024 18:37:19 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2024/12/gearfe-1024x576.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Featured",
      "Fun",
      "Gear"
    ]
  },
  {
    "id": "49f208c1-33fb-4b5a-8994-7a33e9d90a3c",
    "title": "Adobe just raised prices – how to keep yours from going up",
    "link": "https://lightroomkillertips.com/adobe-just-raised-prices-heres-how-to-keep-yours-from-going-up/",
    "description": "Don’t know if you’ve heard the news, but Adobe has made some price changes to their Photography Plan pricing, and I’m here today to help you navigate the new changes (and still keep paying the old price. What? Yup – I’ll show you how).  I put together a quick Q\u0026A to explain the new pricing: Q. Did Adobe increase the price for the photography bundle (the one with Lightroom and Photoshop, which has always been around $9.99 a month)? A. Yes, but the price increase only applies to two groups:  (1) People who pay monthly (but I’ll explain a way around the price increase) (2) New users who are not already on the photography plan (but there’s a way around that, too, as I’ll explain in a moment). Q. But I don’t want to pay more.A. Then switch to an annual plan, paid upfront, and you won’t have to. Q. So, are you saying if I pay for my existing yearly plan upfront (rather than monthly), my price doesn’t go up? A. That’s what I’m saying.  Q. Are you sure?A. That’s straight from Adobe. Here’s a link to their blog post explaining the new pricing and the affected plans.  Q. Did all photography plans increase in price? A. The price of the Photography plan that includes Lr \u0026 Ps with 1TB of cloud storage didn’t change. Q. So, let me get this straight – I pay upfront for the year at the old price ($119.88 here in the US), and I don’t have to pay the higher price?A. That is correct.  Q. What if I’m not subscribed to the Photography Plan? What will my price be next year?A. If you sign up before January 15, 2025, you can lock in the old rate (which works out to $9.99 per month), but again – you have to pay the $119.88 upfront to get that rate.  Q. What if I miss the January 15th deadline? Will I have to pay $14.99 a month? A. Don’t miss that deadline, or it gets worse. For photographers who sign up after January 15th, it’s $19.99 a month, but at least it includes one terabyte of cloud storage space, so there’s that.  Q. So, what would you recommend?A. If I were you, I would pay $119.99 upfront to keep your photography plan the same as it always was—you do that, and really, nothing changes for you. If you’re one of those folks who never subscribed, I would definitely sign up before January 15th. Otherwise, you’ll be paying $19.99 a month if you decide to subscribe later. Q. What about the plan that’s just Lightroom ‘Cloud’ (as I call it) with one terabyte of storage? Does that monthly subscription increase? A. Yes – it goes from $9.99 a month to $11.99 a month unless you switch it to the yearly plan and pay the year upfront; then your price stays the same – no increase.  Well, there ya have it – that’s the price increase (and how to avoid it) in a nutshell. If you have any questions, pop ‘em in the comments.  Have a great holiday season Monday, everybody! -Scott P.S. Here’s a link to a pricing FAQ Adobe put together that’s very helpful. The post Adobe just raised prices – how to keep yours from going up appeared first on Lightroom Killer Tips.",
    "author": "Scott Kelby",
    "published": "Mon, 16 Dec 2024 03:29:10 +0000",
    "image": "https://lightroomkillertips.com/wp-content/uploads/2024/12/adobe-1024x576.jpg",
    "source": "https://lightroomkillertips.com/feed/",
    "categories": [
      "Featured",
      "News"
    ]
  },
  {
    "id": "31070ef4-a2da-42d9-8328-0f338526200a",
    "title": "I've Been Working on Something",
    "link": "http://strobist.blogspot.com/2024/06/ive-been-working-on-something.html",
    "description": "Hey gang, it’s David. It’s been a while! In 2021, I archived Strobist as a completed project. I can’t honestly say that I’ve missed the breakneck pace of running a solo site. But I’ve definitely missed interacting with so many cool people all of the time. That said, I am still teaching. X-Peditions gives me the twin advantages much smaller class sizes, plus being in Hanoi every fall. And that’s been wonderful. Better yet, my new schedule has given me the breathing room to be able build my current project. Like Strobist, this project is designed for photographers. But unlike this website, it has nothing at all to do with flash. Today I’m introducing my new book, The Traveling Photographer’s Manifesto. It aspires to be for traveling photographers what Strobist always tried to be for lighting photographers. The premise of the book is that your camera can, and should, be much more than just a pricey recording device when you travel. It can also serve as a passport, opening up new connections and possibilities that otherwise might not have happened. Using a photo trip to Southeast Asia as a framework, the book walks through many things that you can do to help this to happen. I have uploaded three documents to help you to know if TTPM might be suited for you: 1. A 5-minute summary: This will quickly give you a feel for the book. 2. A 27-page supplement: Only a small portion of the book, which is unillustrated, is about camera operation. This visual supplement is available for readers who are more visual learners. And it will give you a quick skim of parts 4 and 5. 3. A sample chapter: How to become more comfortable meeting and engaging with people as a photographer. As you'll see from the summary, most of the book is not about camera operation at all. It’s more about the countless little things that working photojournalists do while on assignment that an enthusiast might not think of. These little habits, taken together, can start to form the impression of a photographer being consistently, conspicuously lucky. When in reality, luck had very little to do with it. So, if this is the sort of thing that interests you, I hope you’ll give the book a spin. It is available now, on Amazon.com worldwide. Just as with Strobist, I welcome your feedback from this project as well. My email is listed on the copyright page and elsewhere. And of course, I will read and take to heart every Amazon review. Because my goal is for the project to continue to evolve and improve over time, just as the material on this website did. Thanks for your interest, and for your readership of Strobist. As always, please say hi at any time on Twitter at @Strobist. Cheers, David The Traveling Photographer’s Manifesto (Amazon.com)",
    "author": "David Hobby",
    "published": "Tue, 11 Jun 2024 22:22:00 +0000",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-W17q9tcAHlutYrIFGWU0YglpFYEfSkjZZWB7RouSVTQJtMvAy9WhRx5n4JMvFjiVVDTJ3P5qMC0Lp1MQ8SPj4ZFsA1RLw5j-6Mo9tBME3hR3nny3H3yn-foRWK-3kVYgYcIcjUFC5K-gQTa7-nMsJ_RgWyoVRxDT6SWAngTK7y7TaDoAEcBi/s400/Lede%20TTPM.JPG",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "c0bf9a8e-36fe-4f29-8aa2-82c1a55fb5c1",
    "title": "So Long (for Now!) and Thank You.",
    "link": "http://strobist.blogspot.com/2021/07/so-long-for-now-and-thank-you.html",
    "description": "In 2006 I started a lighting blog while working full-time as a staffer at The Baltimore Sun. By early 2007, it became obvious that I didn't have the personal resources to give 100% to both Strobist and my job at the newspaper. That’s exactly the position I find myself in today. For the past year I have been working on a new project. It is photography-based, and will be as unique to the photo space as Strobist was back in 2006. But, as I found with Strobist in 2007, this project will require all of my focus. So I am shifting Strobist into archive mode to allow myself the time and mental space to do that. If I had more available brain cells/hours in the day, I would be happy to do both. Alas, I do not. So I am choosing the one I think can make a bigger difference to photographers. When the new project launches, I’ll do my best to make sure you hear about it. So please, stay tuned! For those of you who are interested in our in-person lighting workshops and/or our X-Peditions trips (both of which are currently on pause during the pandemic) we absolutely are planning to restart them once the coast is clear. Please make sure you are on the relevant notification list(s) by clicking through to the links above. Finally, I want to take this moment to say thank you to the countless people I have met, and new friendships made, as a result of publishing Strobist over the past 15 years. It is impossible to express how much you all have enriched my life, and that of my family. Thank you so much, David",
    "author": "David Hobby",
    "published": "Thu, 01 Jul 2021 15:26:00 +0000",
    "image": "http://farm1.static.flickr.com/171/447819702_778a34024c.jpg",
    "source": "http://feeds.feedburner.com/blogspot/WOBq",
    "categories": null
  },
  {
    "id": "5e2a67cb-8d41-4e8e-a573-e47f39bcd75a",
    "title": "DJI Stays Legal: US Congress Finalizes Defense Act Without Drone Ban",
    "link": "https://petapixel.com/2024/12/18/dji-stays-legal-us-congress-finalizes-defense-act-without-drone-ban/",
    "description": "DJI earned a key win today in an increasingly complicated legal landscape for Chinese companies operating within the United States. The Countering CCP Drones Act was not included in the FY25 National Defense Authorization Act (NDAA) that passed in the United States Congress this week, meaning that DJI is not banned from operating or selling products in the United States. [Read More]",
    "author": "Jeremy Gray",
    "published": "Wed, 18 Dec 2024 22:25:41 +0000",
    "image": "https://petapixel.com/assets/uploads/2024/12/dji-header-ndaa-feaetured-1600x840.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Equipment",
      "Law",
      "News",
      "congress",
      "counteringccpdronesact",
      "dji",
      "drones",
      "law"
    ]
  },
  {
    "id": "7cb301b4-7e84-43c1-be12-ae823deaf492",
    "title": "Analog Photography in 2024: Film’s Best Year in Decades",
    "link": "https://petapixel.com/2024/12/18/analog-photography-in-2024-films-best-year-in-decades/",
    "description": "Film has long been considered a dying art since the rise of digital photography, with what seemed like nothing but bad news for many years. 2024, though, saw a welcomed resurgence of this analog medium. It has been a busy and fantastic year for analog photography. [Read More]",
    "author": "Abby Ferguson",
    "published": "Wed, 18 Dec 2024 19:11:43 +0000",
    "image": "https://petapixel.com/assets/uploads/2024/12/film-2024.jpg",
    "source": "https://petapixel.com/feed/",
    "categories": [
      "Analog",
      "Features",
      "analog",
      "analogphotography",
      "filmphotography",
      "kodakprofessional",
      "pentax17",
      "rollei35af"
    ]
  },
  {
    "id": "f65a5b96-931f-4df4-ab79-ecb05f22db44",
    "title": "Globe staff photos of the month, February 2020",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/04/globe-staff-photos-month-february/CDiztYMhad5stG0VBAvsjJ/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Here’s a look at some of the best images taken by Globe photographers last month: the New Hamphire primary, Ash Wednesday, living with progeria, the Beanpot Tournament, and Red Sox spring training.",
    "author": "",
    "published": "Wed, 04 Mar 2020 22:19:03 +0000",
    "image": "https://www.bostonglobe.com/resizer/v2/32PTLQSKVUI6VDICL5JAZBREOM.jpg?auth=32b6cce7791266809f447408c2a463dbacf449ce998434cdf179a6e6e3c05d5d\u0026smart=true\u0026width=3048\u0026height=2108",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "6a541ad4-43e5-4836-ba9f-52a6b0131da0",
    "title": "Life during the coronavirus pandemic",
    "link": "https://www.bostonglobe.com/news/bigpicture/2020/03/30/life-during-coronavirus-pandemic/wOmubnlrYaN8m2epe1FAHO/story.html?rss_id=section_rss_full\u0026s_campaign=bg:full:rss:section",
    "description": "Globe staff photographers document the Boston area and beyond during this unprecented time. The gallery is updated weekly throughout the crisis.",
    "author": "",
    "published": "Mon, 30 Mar 2020 22:49:52 +0000",
    "image": "https://www.bostonglobe.com/resizer/v2/A27O6IULEUI6VL32SQ7K27FODM.jpg?auth=fb7704ff9d568394fa7fb75960a3b3d08935641b422af48f2422539d95eeaed9\u0026smart=true\u0026width=5472\u0026height=3648",
    "source": "https://www.bostonglobe.com/rss/bigpicture",
    "categories": null
  },
  {
    "id": "de829b32-205a-4521-b778-4c1cf17cad87",
    "title": "Minimalist Landscape, New Set and a Creepy Shot!",
    "link": "https://www.lightstalking.com/minimalist-landscape-new-set-and-a-creepy-shot/",
    "description": "Welcome to the weekly Light Stalking community wrap up! When it comes to classic themes in photography, the intertwined relationship of light and shadow has to be on the top 3. Naturally, light flows throughout the entire universe. But only when obstructed, its presence turns into a storytelling element of the scene. If duality is […] The post Minimalist Landscape, New Set and a Creepy Shot! appeared first on Light Stalking.",
    "author": "Federico Alegria",
    "published": "Tue, 17 Dec 2024 07:30:46 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Cool Photos \u0026 Photographers"
    ]
  },
  {
    "id": "c33dffa9-0d14-4419-a0cb-a9901c633cd7",
    "title": "Kodak Film Factory Upgrades to Meet Increased Demand",
    "link": "https://www.lightstalking.com/kodak-film-factory-upgrades-to-meet-increased-demand/",
    "description": "Film in the digital age is a novel thing for many. Yet it’s also an increasingly popular medium, so much so that storied brand name Kodak is revamping its film production to meet the increasing demand for the once-dominant medium. The company recently shut down its New York factory to upgrade its production facilities for […] The post Kodak Film Factory Upgrades to Meet Increased Demand appeared first on Light Stalking.",
    "author": "Kehl Bayern",
    "published": "Sun, 15 Dec 2024 19:26:00 +0000",
    "image": "",
    "source": "https://www.lightstalking.com/feed/",
    "categories": [
      "Photography News"
    ]
  },
  {
    "id": "e168a166-b81a-45b3-af34-0238c76a9c31",
    "title": "The Latest Batch",
    "link": "https://stuckincustoms.com/2024/12/18/the-latest-batch-2/",
    "description": "More from over on my AI Insta…   The post The Latest Batch appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Wed, 18 Dec 2024 20:01:00 +0000",
    "image": "https://i0.wp.com/stuckincustoms.com/wp-content/uploads/2024/12/Trey-Ratcliff-New-AI-039-678x900.png?ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "artificial intelligence",
      "generative",
      "Midjourney"
    ]
  },
  {
    "id": "d12b7d95-d63c-4431-a8fe-51a810e90752",
    "title": "My Pixel 9 Pro Fold Review",
    "link": "https://stuckincustoms.com/2024/12/09/my-pixel-9-pro-fold-review/",
    "description": "Well here’s a spoiler alert… the Google Pixel series of mobile phones are AWESOME! I’ve used them since the first model and consistently they’ve been best phones I’ve ever used. In recent generations there are two (or three… or now four, with a FIFTH rumoured!) different models with a couple being quite close in spec […] The post My Pixel 9 Pro Fold Review appeared first on Stuck in Customs.",
    "author": "Stu Davidson",
    "published": "Mon, 09 Dec 2024 20:30:57 +0000",
    "image": "https://i0.wp.com/stuckincustoms.com/wp-content/uploads/2024/11/pixel-9-pro-fold-black.jpg?w=200\u0026ssl=1",
    "source": "https://stuckincustoms.com/feed/",
    "categories": [
      "Camera Gear",
      "Google Pixel 9 Pro Fold",
      "Scotland",
      "Travel",
      "United Kingdom",
      "Camera",
      "handset",
      "real world",
      "review",
      "teampixel"
    ]
  }
]
