{
  "id": "056c40e5-26de-40ab-ab3e-6f29a4c11d34",
  "title": "False Deaths Mistaken Or Otherwise Plague Social Security",
  "link": "https://www.savingadvice.com/articles/2025/05/06/10155901_false-deaths-mistaken-or-otherwise-plague-social-security.html",
  "description": "Mounting mistakes in the Social Security Administration (SSA) have resulted in delays and disruptions in benefits and an uptick in the number of living...",
  "author": "Max Erkiletian",
  "published": "Tue, 06 May 2025 20:44:23 +0000",
  "source": "https://www.savingadvice.com/feed/",
  "categories": [
    "News",
    "DOGE",
    "DOGE and Social Security",
    "social security",
    "Social Security Dead",
    "social security mistakes",
    "Social Security Staff Cuts"
  ],
  "byline": "Max Erkiletian",
  "length": 5570,
  "excerpt": "False deaths, mistaken or otherwise, plague Social Security and disrupt the financial lives of recipients, making it difficult to work or bank.",
  "siteName": "SavingAdvice.com Blog",
  "favicon": "",
  "text": "Image Source: UnsplashMounting mistakes in the Social Security Administration (SSA) have resulted in delays and disruptions in benefits and an uptick in the number of living beneficiaries being listed as dead. Notably, this uptick in mistakes follows Department of Government Efficiency (DOGE) cuts in staff and efforts to quickly update SSA’s computer system.Not Dead YetRennie Glasgow is a Social Security staffer in Schenectady, N.Y. He is also a local American Federation of Government Employees representative. He and his co-workers are not resurrectionists. However, they have been raising Social Security recipients from the dead recently.Glasgow told KFF Health News that there has been a marked increase in living people whose Social Security records list them as dead. When these walking dead turn up at his office, Glasgow reports, “There is no information on the record, just that they are dead.” As a result, staff have to verify that the recipient is alive and process the paperwork to rectify the mistake.ImmigrantsAnother factor that may add to the increase in SSA beneficiaries being erroneously classified as dead is President Trump’s efforts to push immigrants out of the country.An April story from the Associated Press reported that the administration had reclassified over 6,000 legal immigrants as dead. The move canceled their Social Security numbers, making it impossible for them to work in the United States.These immigrants were allowed to enter and stay in the country temporarily under the Biden Administration. However, Trump’s actions were designed to force them to “self-deport”. DOGE DisruptionAnother factor influencing mistakes made by SSA is staff reductions made by DOGE.Saving Advice reported on those changes launched last month and the consequences that many close to SSA predicted.“Everything they’re doing is driving this agency to system collapse,” O’Malley told CNN. “It will lead to interruptions in service, and that will ultimately cascade into more frequent system interruptions for the processing of claims, ultimately leading to system collapse and eventually the interruption of benefits.”O’Malley told KFF Health that attendees at a recent Racine, WI, reported false SSA deaths.“They are terminating people’s financial lives,” O’Malley said.A Social Security number is needed for employment, banking, and credit accounts, insurance, and other daily necessities. By being declared dead, your Social Security number becomes inactive.Efficient Or IneffectiveIn April, DOGE launched a campaign to reduce SSA expenses and make it more efficient. Part of that effort was to cut 7,000 staff. However, O’Malley and others predicted that it would wreak havoc on the agency. “The only way that slashing the number of workers will save large sums of money is by making it hard for people to access benefits they’ve earned,” according to the Economic Policy Institute. “Such backdoor benefit cuts, and making a popular government program look bad, are the real goals behind DOGE attacks on Social Security.”Rich Couture, a spokesperson for the American Federation of Government Employees’ Social Security Administration general committee, is not so direct.“It has never been explained with any degree of clarity how they came up with that figure,” said Couture. “What’s being served by that by a loss of 7,000 jobs? How does any of that supposedly makes this operation more efficient? How does it improve service? How does it improve productivity? Our position is that losing 7,000 people doesn’t do any of those things.”Staffing Cut As Recipients GrowThe SSA pays benefits to almost 70 million Americans. Furthermore, that number is growing faster than at any time in over 100 years. The U. S. Census Bureau puts citizens 65 or over at 55.8 million, 16.8 percent of the nation’s population. That segment grew nearly five times faster than the total population from 1920 to 2020.Such rapid growth of Social Security aged people led to a record backlog of payment actions, according to a 2024 report by SSA’s inspector general. That report stated in part:“SSA cited unexpected staff reductions, increased workloads, and less than expected overtime funding that would have been used to pay employees to process more PC (Processing Centers) pending actions, as explanation for the record-breaking backlog.”Side Note – No Social Security Checks This Week As PlannedA Social Security check will not be issued this week. There is no problem. That is just the way the payment calendar works.There are two weeks each year during which there are no Social Security payments. The week of May 5 through 10 is one.You can check when checks are do by accessing the SSA payment calendar.Read More:Where Tariff Price Hikes Will Hit Your Wallet FirstWhy Gen Z Could Become The Richest- And Most Disruptive – Generation YetDirect Primary Care Cuts Inefficiency And Cost To Increase Time Doctors Spend With PatientsMax K. Erkiletian began writing for newspapers while still in high school. He went on to become an award-winning journalist and co-founder of the print magazine Free Bird. He has written for a wide range of regional and national publications as well as many on-line publications. That has afforded him the opportunity to interview a variety of prominent figures from former Chairman of the Federal Reserve Bank Paul Volker to Blues musicians Muddy Waters and B. B. King. Max lives in Springfield, MO with his wife Karen and their cat – Pudge. He spends as much time as possible with his kids, grandchildren, and great-grandchildren.",
  "image": "https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle aria-label=\"False Deaths Mistaken Or Otherwise Plague Social Security\"\u003e\u003cdiv\u003e\u003cfigure id=\"attachment_155903\" aria-describedby=\"caption-attachment-155903\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1707\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-scaled.jpg 2560w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-scaled-300x200.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-scaled-550x367.jpg 550w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-768x512.jpg 768w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-1536x1024.jpg 1536w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-2048x1365.jpg 2048w,   https://www.savingadvice.com/wp-content/uploads/2025/05/mark-timberlake-n8Bepoi9YRc-unsplash-100x67.jpg 100w\" sizes=\"(max-width: 2560px) 100vw, 2560px\"/\u003e\u003cfigcaption id=\"caption-attachment-155903\"\u003eImage Source: Unsplash\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cspan\u003eMounting mistakes in the Social Security Administration (SSA) have resulted in delays and disruptions in benefits and an uptick in the number of living beneficiaries being listed as dead. Notably, this uptick in mistakes follows Department of Government Efficiency (DOGE) cuts in staff and efforts to quickly update SSA’s computer system.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eNot Dead Yet\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eRennie Glasgow is a Social Security staffer in Schenectady, N.Y. He is also a local American Federation of Government Employees representative. He and his co-workers are not resurrectionists. However, they have been raising Social Security recipients from the dead recently.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGlasgow told \u003ca href=\"https://kffhealthnews.org/news/article/social-security-administration-beneficiaries-marked-dead-ssn-numbers-delays/\" target=\"_blank\" rel=\"noopener\"\u003eKFF Health News\u003c/a\u003e that there has been a marked increase in living people whose Social Security records list them as dead. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen these walking dead turn up at his office, Glasgow reports, “There is no information on the record, just that they are dead.” As a result, staff have to verify that the recipient is alive and process the paperwork to rectify the mistake.\u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eImmigrants\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eAnother factor that may add to the increase in SSA beneficiaries being erroneously classified as dead is President Trump’s efforts to push immigrants out of the country.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAn April story from the Associated Press reported that the administration had \u003c/span\u003e\u003ca href=\"https://apnews.com/article/social-security-immigration-dhs-deportation-12cf4ab92d5cac3406ded3a343f75005\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003ereclassified over 6,000 legal immigrants as dead\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. The move canceled their Social Security numbers, making it impossible for them to work in the United States.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThese immigrants were allowed to enter and stay in the country temporarily under the Biden Administration. However, Trump’s actions were designed to force them to “self-deport”. \u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eDOGE Disruption\u003c/span\u003e\u003c/h2\u003e\u003cp\u003eAnother factor influencing mistakes made by SSA is staff reductions made by DOGE.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSaving Advice reported on those changes launched last month and the consequences that many close to SSA predicted.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Everything they’re doing is \u003c/span\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/04/02/10153425_the-hidden-equation-fewer-social-security-staff-lower-benefits.html\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003edriving this agency to system collapse\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e,” O’Malley told \u003c/span\u003e\u003ci\u003e\u003cspan\u003eCNN\u003c/span\u003e\u003c/i\u003e\u003cspan\u003e. “It will lead to interruptions in service, and that will ultimately cascade into more frequent system interruptions for the processing of claims, ultimately leading to system collapse and eventually the interruption of benefits.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eO’Malley told KFF Health that attendees at a recent Racine, WI, reported false SSA deaths.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“They are terminating people’s financial lives,” O’Malley said.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eA Social Security number is needed for employment, banking, and credit accounts, insurance, and other daily necessities. By being declared dead, your Social Security number becomes inactive.\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eEfficient Or Ineffective\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eIn April, DOGE launched a campaign to reduce SSA expenses and make it more efficient. Part of that effort was to cut 7,000 staff. However, O’Malley and others predicted that it would wreak havoc on the agency. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“\u003c/span\u003e\u003ca href=\"https://www.epi.org/blog/what-is-doge-doing-to-social-security/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eThe only way that slashing the number of workers will save large sums of money is by making it hard for people to access benefits they’ve earned\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e,” according to the Economic Policy Institute. “Such backdoor benefit cuts, and making a popular government program look bad, are the real goals behind DOGE attacks on Social Security.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eRich Couture, a spokesperson for the American Federation of Government Employees’ Social Security Administration general committee, is not so direct.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“It has never been explained with any degree of clarity how they came up with that figure,” said Couture. “What’s being served by that by a loss of 7,000 jobs? How does any of that supposedly makes this operation more efficient? \u003c/span\u003e\u003ca href=\"https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eHow does it improve service? How does it improve productivity? \u003c/span\u003e\u003c/a\u003e\u003cspan\u003eOur position is that losing 7,000 people doesn’t do any of those things.”\u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eStaffing Cut As Recipients Grow\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eThe SSA pays benefits to almost 70 million Americans. Furthermore, that number is growing faster than at any time in over 100 years. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe U. S. Census Bureau puts citizens 65 or over at 55.8 million, 16.8 percent of the nation’s population. That segment grew nearly five times faster than the total population from 1920 to 2020.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSuch rapid growth of Social Security aged people led to a\u003c/span\u003e \u003ca href=\"https://oig.ssa.gov/news-releases/2024-08-08-record-breaking-backlog-increases-improper-payments-by-over-1b/#:~:text=As%20a%20backlog%20of%20payment,%241.1%20billion%20in%20improper%20payments\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003erecord backlog of payment actions\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, according to a 2024 report by SSA’s inspector general. That report stated in part:\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“SSA cited unexpected staff reductions, increased workloads, and less than expected overtime funding that would have been used to pay employees to process more PC (Processing Centers) pending actions, as explanation for the record-breaking backlog.”\u003c/span\u003e\u003c/p\u003e\u003ch2\u003e\u003cspan\u003eSide Note – No Social Security Checks This Week As Planned\u003c/span\u003e\u003c/h2\u003e\u003cp\u003e\u003cspan\u003eA Social Security check will not be issued this week. There is no problem. That is just the way the payment calendar works.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are two weeks each year during which there are no Social Security payments. The week of May 5 through 10 is one.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYou can check when checks are do by accessing the \u003c/span\u003e\u003ca href=\"https://www.ssa.gov/pubs/EN-05-10031-2025.pdf\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eSSA payment calendar\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eRead More:\u003c/b\u003e\u003c/p\u003e\u003cul\u003e\u003cli aria-level=\"1\"\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/04/07/10153515_where-tariff-price-hikes-will-hit-your-wallet-first.html\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eWhere Tariff Price Hikes Will Hit Your Wallet First\u003c/span\u003e\u003c/a\u003e\u003c/li\u003e\u003cli aria-level=\"1\"\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/03/27/10153238_why-gen-z-could-become-the-richest-and-most-disruptive-generation-yet.html\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eWhy Gen Z Could Become The Richest- And Most Disruptive – Generation Yet\u003c/span\u003e\u003c/a\u003e\u003c/li\u003e\u003cli aria-level=\"1\"\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/02/24/10152119_direct-primary-care-cuts-inefficiency-and-cost-to-increase-time-doctors-spend-with-patients.html\" target=\"_blank\" rel=\"noopener\"\u003e\u003cspan\u003eDirect Primary Care Cuts Inefficiency And Cost To Increase Time Doctors Spend With Patients\u003c/span\u003e\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cdiv itemtype=\"http://schema.org/Person\" itemscope=\"\" itemprop=\"author\"\u003e\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2021/03/Max.jpg\" width=\"100\" height=\"100\" alt=\"\" itemprop=\"image\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eMax K. Erkiletian began writing for newspapers while still in high school. He went on to become an award-winning journalist and co-founder of the print magazine Free Bird. He has written for a wide range of regional and national publications as well as many on-line publications. That has afforded him the opportunity to interview a variety of prominent figures from former Chairman of the Federal Reserve Bank Paul Volker to Blues musicians Muddy Waters and B. B. King. Max lives in Springfield, MO with his wife Karen and their cat – Pudge. He spends as much time as possible with his kids, grandchildren, and great-grandchildren.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-06T20:44:23Z",
  "modifiedTime": null
}
