{
  "id": "099f53da-83a2-4f4d-9110-e4f4bd3b272b",
  "title": "25 Fun and Interesting Things You Can Do with a Dollar Bill",
  "link": "https://www.savingadvice.com/articles/2025/07/14/1016058_things-you-can-do-with-a-one-dollar-bill.html",
  "description": "“What can I do with a dollar?” Many people don’t think a dollar is worth all that much these days, but that doesn’t mean that...",
  "author": "Jeffrey Strain",
  "published": "Mon, 14 Jul 2025 17:40:53 +0000",
  "source": "https://www.savingadvice.com/feed/",
  "categories": [
    "Entertainment",
    "Personal Finance",
    "Saving Money",
    "$1",
    "$1 magic",
    "bar tricks",
    "dollar bill",
    "dollar origami",
    "dollar science",
    "dollar tricks"
  ],
  "byline": "Jeffrey Strain",
  "length": 11142,
  "excerpt": "There are many things you can do with a one dollar bill; saving, folding, and using it for amusing bar tricks are just some ideas.",
  "siteName": "SavingAdvice.com Blog",
  "favicon": "",
  "text": "“What can I do with a dollar?” Many people don’t think a dollar is worth all that much these days, but that doesn’t mean that it’s worthless. In fact, there are a lot of things that you can do with a $1 bill that have nothing to do with spending money (plus a lot that do). Some are interesting. Some are tricks. Others are weird while still others are simply fun activities. If you have a $1 bill in your pocket and are looking for something interesting to do with it, here are a number of ways that you can use it that you may not have considered in the past.Use It as a Bookmark Photo courtesy of felipejcontrerasOne of the most obvious and easy uses for it is as a bookmark. You can do this using it just as it is, or you can get a little fancier and create an origami dollar bill bookmark. Either way, you’ll know exactly where you left off the next time you pick up your book.Here is a fun book on how to create dollar bill origami if you’re so inclined.Blend ItWait…what? Why would you want to blend a dollar bill? For science of course! Dollar bills are made with ink that has iron in it to help prevent counterfeiting. If you blend a dollar bill thoroughly, you can use a strong Neodymium magnet to separate the iron out of the ink. Here is a tutorial for how to perform this experiment. This is an excellent activity to do with kids, because, seriously, who wouldn’t want to blend up a dollar?Track ItDid you ever wonder where the dollar you have in your hand has been? You can find out by inputting it into the database at Where’s George?. If another person has input the serial number of the bill that you’re holding, you can see where it has been before. If nobody has yet, you can input it and follow where it ends up going in the future as others also input it when they get it.Find the OwlMany people believe that there is an owl hidden on the dollar bill. Take some time to try to find it on your own. If you can’t, you might want to take out a microscope to see if you can see it better that way. Then you can let the debate begin as to whether or not you really think it’s an owl or not.Burn It!While you could literally burn the dollar bill, a better way to burn it is with a mixture of water and rubbing alcohol. Doing this will make the dollar bill appear to be burning, but in the end the bill will remain intact so that you can use it for other things as well. This is a fun experiment to do with kids and it’s a wonderful science experiment.Exchange it for a Dollar CoinSince the dollar coins aren’t used in everyday financial transactions, they seem to be special, especially to kids. If you are planning to give your kid some money, why not do it with coins rather than bills. This is especially effective when giving money from the tooth fairy or other special event.Make a RingThis is another fun project that you can do. With a little folding, you can turn your dollar into a ring. It takes a bit of origami skill to accomplish this, but it’s a great project for kids and they’ll have a wonderful time wearing the new ring that they created.Balance a Shot Glass on ItThis is another great trick that you can do to win bets at the bar, or kids can use to amaze their friends. While the example here is with two beer glasses and a shot glass, you can use alternative glasses as well. The challenge is to ask your friends to place the dollar across the two glasses and then to balance the shot glass on top of it. It will appear to be impossible when they try, but then you can do it by folding the dollar accordion style to give it strength. Watch the video below to see how.Find Your BirthdayThere are a lot of people who collect dollar bills that they find interesting. One of the types that are popular are finding ones that have your birthday within the serial number. For example, if you were born in 1985, you would look for a bill that had “1985” somewhere within the serial number. If you find a birthday bill that isn’t for your year, you can keep it as part of a collection or sell it as people will often pay a premium for these birthday bills on eBay because many consider them lucky.Learn a Really Cool Magic TrickIf you have a $1 bill, a playing card and a pen, you can perfect a wonderful magic trick that will amaze your friends and family. Although the trick will look amazing, it’s not really that difficult to perform. It’s a great trick to have in your pocket when you want to make an impression. Skip to 4:11 to get right to it.Exchange It for 100 PenniesIf you want some long-lasting fun, you can take your dollar and exchange it for 100 pennies. There are a lot of fun and interesting things you can do with the pennies. You can also look through all the pennies to see if you were lucky enough to get some older ones.Learn the Conspiracy TheoriesThere are a lot of conspiracy theories that surround the $1 bill and the markings on it. Take one out from your wallet or purse, then follow along for 45 minutes (yes, you read that time correctly) listening to all the conspiracies that some believe can be found in the dollar bill:Discover Where It Was PrintedYou can take a look at the bill you have and determine where it was printed. The bold letter in black on the front of the bill toward the left side indicates the Federal Bank that ordered the bill. Here’s the run down of where your bill is from:A = Boston B = New York City C = Philadelphia D = Cleveland E = Richmond, Virginia F = Atlanta G = Chicago H = St. Louis I = Minneapolis J = Kansas City K = Dallas L = San FranciscoSpend ItHead out to your local dollar store and see what you can find there. While there are certainly things that you never want to but at the dollar store, there are also things that are worthwhile getting there. Since the merchandise in these stores can change on a fairly regular basis, you might also come across some gem of a product that you just must have for the $1 in your hand.Open a Coke or Beer BottleIf you are at a party or want to impress your friends, you can open a beer bottle or Coke bottle with a dollar bill. Yes, you read that correctly. By folding up the bill tightly, you can pop the cap off of any bottle. So the next time you’re someplace and there’s no bottle opener, pull a $1 bill out of your wallet and impress all your friends.Find a StarAnother cool thing to look for on a $1 bill is a star in the serial number. When you find a bill that has a serial number with a star at the end of it, this means there was a printing error during production and the bill needed to be reprinted. These are called Replacement Notes. but are often referred to as “star bills”. This is a great bill to collect, or you can sell it for far more than it’s face value at auction since a lot of people like to collect these.Give It to a Street MusicianIf you are walking down the street and hear some wonderful music brightening up the day, consider giving the dollar to the street musician. My philosophy is that if there is any street performer who is doing something that’s interesting enough for you to stop and watch for ten minutes, then they deserve at least a dollar. The street performer will greatly appreciate the gesture.Balance a CoinThis one takes a little practice, but it’s a fun one when you get it down. Challenge your friends to balance a coin on the side of a $1 bill. When they can’t, you can show them how to do it by folding the bill in half and then slowly opening it up with the coin on it.Hide ItHide the dollar bill somewhere where someone will find it, and when they do it will bring a little joy to their day. I have a few favorite books that aren’t all that popular. When I go to libraries, I like to find the book and slip a dollar into it to surprise the next reader. There are thousands of places that you could place a dollar which would brighten up someone’s day when they found it.Pull it from under a BottleHere’s another trick that you can use to earn money (or just trick your friends). Challenge them to remove a dollar bill from underneath an upside down bottle of beer (or pop) without touching the bottle and not having the bottle tip over. They will likely try to pull the bill from under the bill quickly, but they will find that doing this will knock over the bottle every time. Instead, you will slowly roll up the dollar and win the bet (amaze your friends).Leave It at a BarThere seems to be a growing number of bars that encourage their patrons to staple dollar bills to the walls and the ceilings of the bar. if you visit one of these bars (or you can start a new trend at your local bar), you can write your name on the dollar bill and attach it to the wall.Pull it from between Two BottlesThis is another great trick that you can do with any $1 bill that you have when you are at a bar. Take the bill and place it between two bottles (this example has the top of the bottle to the bottom with the bill in between, but you can also do it with the top of the bottle to the top of the bottle). Ask you friend to try to get the bill out without touching the bottles. They will try to pull the bottle from the side which will make it fall. Then you can do it successfully with this little trick.Make a Paper Airplane Photo courtesy of jarednoelTake your bill and make a paper airplane out of it. The easiest thing would be to make the type of paper airplane you make with a regular piece of paper. You don’t have to stop there. You can also make an F-14 jet fighter if you really want to challenge yourself.Challenge Your Friend to Catch ItThis is an oldie, but goodie. Challenge your friends to try and catch a dollar before it slips through their hands. You hold it while they place their hand around it (without touching) and when you drop it, they try to close their hand quickly enough to catch it. The only rules are that they can’t close their hand before they see it drop and they can’t move their hand down to help them catch it. The reaction of their brain seeing it dropped to have them close their hand is long enough that the bill will be impossible to catch.Save It Photo courtesy of origami touristWe wouldn’t be a responsible financial website if we didn’t mention that saving the money was one of the many options out there. While a single dollar may not seem like a lot, when added together with a lot of other dollars that pass through your hands each year, they can quickly add up to an emergency fund. Tuck it away into your piggy bank and save it for a rainy day.This is obviously a short list of the many things that one can actually do with $1, but I hope that it contains some things that you never considered before, and it has inspired your imagination.Read MoreHere Are 17 Bills Worth More Than Face Value In Your Wallet Right NowThe Best Place To Hide Money In Your Home – Conversations With A BurglarThirty Eight Ways To Make Extra Money You’ve Never Heard OfJeffrey strain is a freelance author, his work has appeared at The Street.com and seekingalpha.com. In addition to having authored thousands of articles, Jeffrey is a former resident of Japan, former owner of Savingadvice.com and a professional digital nomad.",
  "image": "https://www.savingadvice.com/wp-content/uploads/2013/08/blend-a-dollar.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle aria-label=\"25 Fun and Interesting Things You Can Do with a Dollar Bill\"\u003e\u003cdiv\u003e\u003cp\u003e“What can I do with a dollar?” Many people don’t think a dollar is worth all that much these days, but that doesn’t mean that it’s worthless. In fact, there are a lot of things that you can do with a $1 bill that have nothing to do with spending money (plus a lot that do). Some are interesting. Some are tricks. Others are weird while still others are simply fun activities. If you have a $1 bill in your pocket and are looking for something interesting to do with it, here are a number of ways that you can use it that you may not have considered in the past.\u003c/p\u003e\u003ch2\u003eUse It as a Bookmark\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bookmark.jpg\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bookmark-500x375.jpg\" alt=\"dollar heart bookmark\" width=\"500\" height=\"375\"/\u003e\u003c/a\u003e\u003cbr/\u003e \u003csmall\u003ePhoto courtesy of \u003ca href=\"https://www.flickr.com/photos/dollarfolds/6857832140/\"\u003efelipejcontreras\u003c/a\u003e\u003c/small\u003e\u003c/center\u003e\u003cp\u003eOne of the most obvious and easy uses for it is as a bookmark. You can do this using it just as it is, or you can get a little fancier and create an origami dollar bill bookmark\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://ir-na.amazon-adsystem.com/e/ir?t=savingadvice00-20\u0026amp;l=am2\u0026amp;o=1\u0026amp;a=0486470091\" alt=\"\" width=\"1\" height=\"1\"/\u003e. Either way, you’ll know exactly where you left off the next time you \u003ca href=\"https://www.savingadvice.com/2017/01/18/1046897_why-you-should-you-read-more.html\"\u003epick up your book\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eHere is a fun book on how to create dollar bill origami \u003ca href=\"https://amzn.to/3MARaG8\" target=\"_blank\" rel=\"noopener\"\u003eif you’re so inclined\u003c/a\u003e.\u003c/p\u003e\u003ch2\u003eBlend It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/blend-a-dollar.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/blend-a-dollar-500x500.jpg\" alt=\"dollar iron ink experiment\" width=\"500\" height=\"500\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eWait…what? Why would you want to blend a dollar bill? For science of course! Dollar bills are made with ink that has iron in it to help prevent counterfeiting. If you blend a dollar bill thoroughly, you can use a strong Neodymium magnet to separate the iron out of the ink. \u003ca href=\"https://www.stevespanglerscience.com/lab/experiments/money-smoothie\"\u003eHere is a tutorial\u003c/a\u003e for how to perform this experiment. This is an excellent activity to do with kids, because, seriously, who wouldn’t want to blend up a dollar?\u003c/p\u003e\u003ch2\u003eTrack It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/wheres-george.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/wheres-george-500x236.jpg\" alt=\"track dollar bills\" width=\"500\" height=\"236\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eDid you ever wonder where the dollar you have in your hand has been? You can find out by inputting it into the database at Where’s George?. If another person has input the serial number of the bill that you’re holding, you can see where it has been before. If nobody has yet, you can input it and follow where it ends up going in the future as others also input it when they get it.\u003c/p\u003e\u003ch2\u003eFind the Owl\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-owl.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-owl-500x278.jpg\" alt=\"owl hidden on one dollar bill\" width=\"500\" height=\"278\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eMany people believe that there is an owl hidden on the \u003ca href=\"https://www.allthingsfinance.net/how-long-do-dollar-bills-last-the-lifespan-of-a-one-dollar-bill/\"\u003edollar bill\u003c/a\u003e. Take some time to try to find it on your own. If you can’t, you might want to take out a microscope to see if you can see it better that way. Then you can let the debate begin as to whether or not you really think it’s an owl or not.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/A_M998_9xQ0\" width=\"500\" height=\"375\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eBurn It!\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/burn-dollar-bill.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/burn-dollar-bill-500x328.jpg\" alt=\"light dollar on fire science experiment\" width=\"500\" height=\"328\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eWhile you could literally burn the dollar bill, a better way to burn it is with a mixture of water and rubbing alcohol. Doing this will make the dollar bill appear to be burning, but in the end the bill will remain intact so that you can use it for other things as well. This is a fun experiment to \u003ca href=\"https://www.savingadvice.com/2016/01/06/1039620_money-management-skills-to-teach-your-kids.html\"\u003edo with kids\u003c/a\u003e and it’s a wonderful science experiment.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/1z3OINlnnGA\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eExchange it for a Dollar Coin\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-coin.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-coin-500x500.png\" alt=\"$1 coin\" width=\"500\" height=\"500\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eSince the dollar coins aren’t used in everyday financial transactions, they seem to be special, especially to kids. If you are planning to give your kid some money, why not do it with coins rather than bills. This is especially effective when giving money \u003ca href=\"https://www.savingadvice.com/2014/02/27/1017867_how-much-does-the-tooth-fairy-give.html\"\u003efrom the tooth fairy\u003c/a\u003e or other special event.\u003c/p\u003e\u003ch2\u003eMake a Ring\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring.jpg\" alt=\"ring made from $1 bill\" width=\"480\" height=\"360\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring.jpg 480w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring-300x225.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring-230x174.jpg 230w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring-100x75.jpg 100w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-ring-20x15.jpg 20w\" sizes=\"(max-width: 480px) 100vw, 480px\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThis is another fun project that you can do. With a little folding, you can turn your dollar into a ring. It takes a bit of \u003ca href=\"https://www.amazon.com/gp/product/0486272982/ref=as_li_qf_sp_asin_il_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0486272982\u0026amp;linkCode=as2\u0026amp;tag=dimell-20\u0026amp;linkId=RH5OPKPKRPBQPYTH\" target=\"_blank\" rel=\"noopener\"\u003eorigami skill\u003c/a\u003e to accomplish this, but it’s a great project for kids and they’ll have a wonderful time wearing the new ring that they created.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/gyx6kmu4pOw\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eBalance a Shot Glass on It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bar-trick.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bar-trick-500x274.jpg\" alt=\"balance shot glass on dollar\" width=\"500\" height=\"274\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThis is another great trick that you can do to win bets at the bar, or kids can use to amaze their friends. While the example here is with two beer glasses and a shot glass, you can use alternative glasses as well. The challenge is to ask your friends to place the dollar across the two glasses and then to balance the shot glass on top of it. It will appear to be impossible when they try, but then you can do it by folding the dollar accordion style to give it strength. Watch the video below to see how.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/_riRktqw7MU\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eFind Your Birthday\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/birthday-dollar-bill.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/birthday-dollar-bill-500x375.jpg\" alt=\"$1 birthday bill\" width=\"500\" height=\"375\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThere are a lot of people who\u003ca href=\"https://www.savingadvice.com/2013/10/07/1018389_17-bills-in-your-wallet-worth-more-than-face-value.html\"\u003e collect dollar bills that they find interesting\u003c/a\u003e. One of the types that are popular are finding ones that have your birthday within the serial number. For example, if you were born in 1985, you would look for a bill that had “1985” somewhere within the serial number. If you find a birthday bill that isn’t for your year, you can keep it as part of a collection or sell it as people will often pay a premium for these birthday bills on eBay because many consider them lucky.\u003c/p\u003e\u003ch2\u003eLearn a Really Cool Magic Trick\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick.jpg\" alt=\"$1 bill magic trick\" width=\"386\" height=\"358\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick.jpg 386w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick-300x278.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick-100x93.jpg 100w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-magic-trick-20x20.jpg 20w\" sizes=\"(max-width: 386px) 100vw, 386px\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eIf you have a $1 bill, a playing card and a pen, you can perfect a wonderful magic trick that will amaze your friends and family. Although the trick will look amazing, it’s not really that difficult to perform. It’s a great trick to have in your pocket when you want to make an impression. Skip to 4:11 to get right to it.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/haYBNSWBrDo\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eExchange It for 100 Pennies\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/100-pennies.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/100-pennies-500x375.jpg\" alt=\"pile of pennies\" width=\"500\" height=\"375\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eIf you want some long-lasting fun, you can take your dollar and exchange it for 100 pennies. There are a lot of fun and interesting things you can do with the pennies. You can also look through all the pennies to see if you were lucky enough to get some older ones.\u003c/p\u003e\u003ch2\u003eLearn the Conspiracy Theories\u003c/h2\u003e\u003cp\u003eThere are a lot of conspiracy theories that surround the $1 bill and the markings on it. Take one out from your wallet or purse, then follow along for 45 minutes (yes, you read that time correctly) listening to all the conspiracies that some believe can be found in the dollar bill:\u003c/p\u003e\u003ccenter\u003e\u003ciframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/HC4d5iHd6gA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eDiscover Where It Was Printed\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-federal-bank-mark.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-federal-bank-mark-500x499.jpg\" alt=\"$1 federal bank mark\" width=\"500\" height=\"499\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eYou can take a look at the bill you have and determine where it was printed. The bold letter in black on the front of the bill toward the left side indicates the Federal Bank that ordered the bill. Here’s the run down of where your bill is from:\u003c/p\u003e\u003cp\u003eA = Boston\u003cbr/\u003e B = New York City\u003cbr/\u003e C = Philadelphia\u003cbr/\u003e D = Cleveland\u003cbr/\u003e E = Richmond, Virginia\u003cbr/\u003e F = Atlanta\u003cbr/\u003e G = Chicago\u003cbr/\u003e H = St. Louis\u003cbr/\u003e I = Minneapolis\u003cbr/\u003e J = Kansas City\u003cbr/\u003e K = Dallas\u003cbr/\u003e L = San Francisco\u003c/p\u003e\u003ch2\u003eSpend It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store.jpg\" alt=\"$1 store\" width=\"500\" height=\"333\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store.jpg 500w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store-300x200.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store-100x67.jpg 100w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-store-20x13.jpg 20w\" sizes=\"(max-width: 500px) 100vw, 500px\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eHead out to your local dollar store and see what you can find there. While there are certainly things that you \u003ca href=\"https://www.savingadvice.com/2012/04/05/109927_10-things-to-never-buy-at-a-dollar-store.html\"\u003enever want to but at the dollar store\u003c/a\u003e, there are also things that are worthwhile getting there. Since the merchandise in these stores can change on a fairly regular basis, you might also come across some gem of a product that you just must have for the $1 in your hand.\u003c/p\u003e\u003ch2\u003eOpen a Coke or Beer Bottle\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bottle-opener.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bottle-opener-500x339.jpg\" alt=\"Open a beer bottle with a $1 bill\" width=\"500\" height=\"339\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eIf you are at a party or want to impress your friends, you can open a beer bottle or Coke bottle with a dollar bill. Yes, you read that correctly. By folding up the bill tightly, you can pop the cap off of any bottle. So the next time you’re someplace and there’s no bottle opener, pull a $1 bill out of your wallet and impress all your friends.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/Gi8yNx5MDvE\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eFind a Star\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-star-bill.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-star-bill-500x219.jpg\" alt=\"$1 star bill\" width=\"500\" height=\"219\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eAnother cool thing to look for on a $1 bill is a \u003ca href=\"https://www.savingadvice.com/2013/10/07/1018389_17-bills-in-your-wallet-worth-more-than-face-value.html\"\u003estar in the serial number\u003c/a\u003e. When you find a bill that has a serial number with a star at the end of it, this means there was a printing error during production and the bill needed to be reprinted. These are called Replacement Notes. but are often referred to as “star bills”. This is a great bill to collect, or you can sell it for far more than it’s face value at auction since a lot of people like to collect these.\u003c/p\u003e\u003ch2\u003eGive It to a Street Musician\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-musician.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-musician-500x465.jpg\" alt=\"dollar donation to street musician\" width=\"500\" height=\"465\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eIf you are walking down the street and hear some wonderful music brightening up the day, consider giving the dollar to the street musician. \u003ca href=\"https://www.savingadvice.com/2012/01/31/109067_money-lessons-learned-from-traveling-well.html\"\u003eMy philosophy is\u003c/a\u003e that if there is any street performer who is doing something that’s interesting enough for you to stop and watch for ten minutes, then they deserve at least a dollar. The street performer will greatly appreciate the gesture.\u003c/p\u003e\u003ch2\u003eBalance a Coin\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-coin-balance.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-coin-balance-500x264.jpg\" alt=\"balance a quarter on a $1 bill\" width=\"500\" height=\"264\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThis one takes a little practice, but it’s a fun one when you get it down. Challenge your friends to balance a coin on the side of a $1 bill. When they can’t, you can show them how to do it by folding the bill in half and then slowly opening it up with the coin on it.\u003c/p\u003e\u003ch2\u003eHide It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/library.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/library-500x375.jpg\" alt=\"hide dollar bill in library\" width=\"500\" height=\"375\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eHide the dollar bill somewhere where someone will find it, and when they do it will bring a little joy to their day. I have a few favorite books that aren’t all that popular. When I go to libraries, I like to find the book and slip a dollar into it to surprise the next reader. There are thousands of places that you could place a dollar which would brighten up someone’s day when they found it.\u003c/p\u003e\u003ch2\u003ePull it from under a Bottle\u003c/h2\u003e\u003cp\u003eHere’s another trick that you can use to earn money (or just trick your friends). Challenge them to remove a dollar bill from underneath an upside down bottle of beer (or pop) without touching the bottle and not having the bottle tip over. They will likely try to pull the bill from under the bill quickly, but they will find that doing this will knock over the bottle every time. Instead, you will slowly roll up the dollar and win the bet (amaze your friends).\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/2BCayOZL8uI\" width=\"500\" height=\"375\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eLeave It at a Bar\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bar.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-bar-500x500.jpg\" alt=\"$1 bills left at bars\" width=\"500\" height=\"500\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThere seems to be a growing number of bars that encourage their patrons to staple dollar bills to the walls and the ceilings of the bar. if you visit one of these bars (or you can start a new trend at your local bar), you can write your name on the dollar bill and attach it to the wall.\u003c/p\u003e\u003ch2\u003ePull it from between Two Bottles\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles.jpg\" alt=\"$1 between two bottles trick\" width=\"494\" height=\"340\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles.jpg 494w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles-300x206.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles-100x69.jpg 100w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-2-bottles-20x14.jpg 20w\" sizes=\"(max-width: 494px) 100vw, 494px\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThis is another great trick that you can do with any $1 bill that you have when you are at a bar. Take the bill and place it between two bottles (this example has the top of the bottle to the bottom with the bill in between, but you can also do it with the top of the bottle to the top of the bottle). Ask you friend to try to get the bill out without touching the bottles. They will try to pull the bottle from the side which will make it fall. Then you can do it successfully with this little trick.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/RshKbTkUpJg\" width=\"500\" height=\"375\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eMake a Paper Airplane\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-airplane.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-airplane-500x333.jpg\" alt=\"$1 F-14 jet\" width=\"500\" height=\"333\"/\u003e\u003c/a\u003e\u003cbr/\u003e \u003csmall\u003ePhoto courtesy of \u003ca href=\"https://jarednoel.wordpress.com/2009/02/11/dollar-bill-airplanes/\"\u003ejarednoel\u003c/a\u003e\u003c/small\u003e\u003c/center\u003e\u003cp\u003eTake your bill and make a paper airplane out of it. The easiest thing would be to make the type of paper airplane you make with a regular piece of paper. You don’t have to stop there. You can also make an F-14 jet fighter if you really want to challenge yourself.\u003c/p\u003e\u003ch2\u003eChallenge Your Friend to Catch It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop.jpg\" alt=\"drop and catch $1 trick\" width=\"468\" height=\"315\" srcset=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop.jpg 468w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop-300x202.jpg 300w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop-100x67.jpg 100w,   https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-drop-20x13.jpg 20w\" sizes=\"(max-width: 468px) 100vw, 468px\"/\u003e\u003c/a\u003e\u003c/center\u003e\u003cp\u003eThis is an oldie, but goodie. Challenge your friends to try and catch a dollar before it slips through their hands. You hold it while they place their hand around it (without touching) and when you drop it, they try to close their hand quickly enough to catch it. The only rules are that they can’t close their hand before they see it drop and they can’t move their hand down to help them catch it. The reaction of their brain seeing it dropped to have them close their hand is long enough that the bill will be impossible to catch.\u003c/p\u003e\u003ccenter\u003e\u003ciframe src=\"//www.youtube.com/embed/eaZ9Gdj93kg\" width=\"500\" height=\"281\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/center\u003e\u003ch2\u003eSave It\u003c/h2\u003e\u003ccenter\u003e\u003ca href=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-piggy-bank.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://www.savingadvice.com/wp-content/uploads/2013/08/dollar-bill-piggy-bank-500x375.jpg\" alt=\"$1 piggy bank\" width=\"500\" height=\"375\"/\u003e\u003c/a\u003e\u003cbr/\u003e \u003csmall\u003ePhoto courtesy of origami tourist\u003c/small\u003e\u003c/center\u003e\u003cp\u003eWe wouldn’t be a responsible financial website if we didn’t mention that saving the money was one of the many options out there. While a single dollar may not seem like a lot, when added together with a lot of other dollars that pass through your hands each year, they can quickly add up to an \u003ca href=\"https://www.savingadvice.com/2013/01/23/1013883_52-week-savings-challenge.html\"\u003eemergency fund\u003c/a\u003e. Tuck it away into your piggy bank and save it for a rainy day.\u003c/p\u003e\u003cp\u003eThis is obviously a short list of the many things that one can actually do with $1, but I hope that it contains some things that you never considered before, and it has inspired your imagination.\u003c/p\u003e\u003ch2\u003eRead More\u003c/h2\u003e\u003cp\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/03/22/1018389_17-bills-in-your-wallet-worth-more-than-face-value.html\" target=\"_blank\" rel=\"noopener\"\u003eHere Are 17 Bills Worth More Than Face Value In Your Wallet Right Now\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.savingadvice.com/articles/2025/02/18/1042902_the-best-place-to-hide-money-conversation-with-a-burglar.html\" target=\"_blank\" rel=\"noopener\"\u003eThe Best Place To Hide Money In Your Home – Conversations With A Burglar\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.savingadvice.com/articles/2024/06/12/1063125_the-side-hustle-stack-38-easy-ways-to-stack-money-on-the-side.html\" target=\"_blank\" rel=\"noopener\"\u003eThirty Eight Ways To Make Extra Money You’ve Never Heard Of\u003c/a\u003e\u003c/p\u003e\u003cdiv itemtype=\"http://schema.org/Person\" itemscope=\"\" itemprop=\"author\"\u003e\u003cp\u003e\u003cimg alt=\"Jeffrey Strain\" src=\"https://secure.gravatar.com/avatar/1b96c1843294dc80717e420101f93ba4d1aca0134fdd426f36bbe1e0a123976c?s=100\u0026amp;d=monsterid\u0026amp;r=g\" srcset=\"https://secure.gravatar.com/avatar/1b96c1843294dc80717e420101f93ba4d1aca0134fdd426f36bbe1e0a123976c?s=200\u0026amp;d=monsterid\u0026amp;r=g 2x\" height=\"100\" width=\"100\" itemprop=\"image\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ci\u003e\u003cspan\u003eJeffrey strain is a freelance author, his work has appeared at The Street.com and \u003c/span\u003e\u003c/i\u003e\u003ca href=\"http://seekingalpha.com/\"\u003e\u003ci\u003e\u003cspan\u003eseekingalpha.com\u003c/span\u003e\u003c/i\u003e\u003c/a\u003e\u003ci\u003e\u003cspan\u003e. In addition to having authored thousands of articles, Jeffrey is a former resident of Japan, former owner of Savingadvice.com and a professional digital nomad.\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e \u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-07-14T17:40:53Z",
  "modifiedTime": "2025-07-14T20:40:51Z"
}
