{
  "id": "09ee8aa8-df54-4ec9-9551-6be2ae4961f4",
  "title": "Why I’ll Never Manage Money for Anyone for Free Again",
  "link": "https://www.financialsamurai.com/why-ill-never-manage-money-for-anyone-for-free-again/",
  "description": "About a year ago, a relative asked me to help manage his money. He had been paying a ~1% asset management fee with Goldman Sachs Asset Management (GSAM), even though he wasn’t their typical high-net-worth client. The account had been set up through his ex, but since he wanted a clean break, he was ready […] The post Why I’ll Never Manage Money for Anyone for Free Again appeared first on Financial Samurai.",
  "author": "Financial Samurai",
  "published": "Fri, 27 Jun 2025 11:18:00 +0000",
  "source": "https://www.financialsamurai.com/feed/",
  "categories": [
    "Retirement"
  ],
  "byline": "Financial Samurai",
  "length": 12625,
  "excerpt": "Managing other people's money can take an emotional toll, especially during times of volatility. Hence, money management shouldn't be free.",
  "siteName": "Financial Samurai",
  "favicon": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2017/02/cropped-FinancialSamurai-Site-Icon-700x700-180x180.png",
  "text": "About a year ago, a relative asked me to help manage his money. He had been paying a ~1% asset management fee with Goldman Sachs Asset Management (GSAM), even though he wasn’t their typical high-net-worth client. The account had been set up through his ex, but since he wanted a clean break, he was ready to move his money and asked for my guidance. We scheduled a call—just like I do with consulting clients—to go over his financial situation, goals, and concerns. From there, we created an investment strategy designed to preserve his lifestyle and reduce the risk of running out of money. As an artist, finance was not something he really understood or ever got into. Since he was also looking for a new brokerage, I recommended Fidelity, where I’ve had my accounts for over 20 years. I'm familiar with their platform, and with his permission, I’d be able to view his portfolio and make trades on his behalf. By transferring his assets out of GSAM, he eliminated the 1% management fee and I rebuilt his IRA portfolios using low-cost ETFs with a similar asset allocation—saving him thousands a year in fees while maintaining long-term growth potential. However, after about a year, I don't want to manage money for anyone for free again. It's nothing personal. I just want to preserve more time and energy for my family. Why I'd Like To Stop Managing Money For Free We agreed on an asset allocation, and I built it out for him. For the second half of 2024 and into early 2025, everything went smoothly. His portfolio steadily climbed to all-time highs, and I didn’t hear from him once. No problem. I felt proud to help grow his wealth, especially since he doesn’t earn much active income. His portfolio will be his main financial support in the future. But in late March and early April 2025, his portfolio took a hit due to the trade wars, and I got a sudden text asking what was going on. So we got on another call and I explained the situation and tried to calm his nerves. Then came the inevitable question: “What should we do now?”—a fair concern for anyone who has entrusted their money to someone else. But now I started to feel the pressure. What if I made the wrong recommendation at the wrong time? Get a free financial checkup from a professional: If you have over $100,000 in investable assets, you can receive a free financial analysis from an Empower advisor by signing up here. An annual review is always worthwhile as your asset allocation can shift significantly over time, and your financial situation may evolve as well. We all have financial blindspots that are worth recognizing to build more future wealth. To Some, Outperforming Is Not Enough I reminded him of our game plan and emphasized the importance of staying the course. I also shared my outlook on why the markets were likely to rebound in the second half of the year—citing factors like trade agreements, deregulation, and potential tax cuts. Given we had constructed a 60/40 portfolio, when the S\u0026P 500 was down ~20% year-to-date on April 8, his portfolio was only down 8.8%. From my perspective, that was a win! But from his perspective, I had still lost him money. And since he wasn’t a fan of the current administration, the situation felt even more frustrating to him. It didn’t really matter that I highlighted his portfolio’s outperformance or the rationale behind a balanced allocation. He was disappointed—and that, in turn, chipped away at some of my emotional resilience. It doesn't feel good to help someone who is disappointed in your help. Already Stressed With My Own Losses At the time, I was already stressed about my own portfolio losses, which were approaching seven figures. I was buying the dip, watching values continue to fall, and doing my best to stay calm. But deep down, I felt like a fool for jumping in too early with the proceeds from my stable real estate sale. His stress added to mine, and I had to compartmentalize my own emotions to reassure him. It left me with less patience for my wife and kids, which was the biggest negative since I love them more than anything. And when I’m losing a lot of money, I admit I tend to have a shorter fuse. During the bull market, I didn’t hear a word of acknowledgement. But as soon as things took a turn, I was met with concern and urgency. Again, totally understandable. However, I was cast in the role of an unpaid employee, bringing back the very feelings of underappreciation that pushed me to leave the traditional workforce. If I’m expected to actively manage someone’s portfolio and provide emotional support and education during downturns, there needs to be clear compensation or boundaries. Otherwise, I’d rather preserve my energy for writing and taking care of the kiddos. After being free from a day job since 2012, I probably have become overly sensitive to anything that reduces my sense of freedom and joy. As a result, I'm not cut out to be a money manager at this stage in my life. The Problem With Double Fees I was happy to help move my relative’s funds away from GSAM to reduce the double fees he was paying. He was being charged an asset management fee of about 1%, plus fund fees ranging from 0.5% to 1.6%—mostly on Goldman-managed funds. Now, I’m not against hiring an asset manager if you genuinely don’t have the time, interest, or knowledge to manage your own money. Paying a professional to build a risk-appropriate portfolio is far better than sitting in cash and missing out on decades of compounding. A good manager can also serve as an emotional buffer—helping prevent panic selling during downturns and reckless speculation during bull markets. But paying double fees—especially as your portfolio grows—adds up quickly. A $5,000 annual fee on a $500,000 portfolio is one thing. But paying $25,000 on a $2.5 million portfolio, plus another $12,500 to $40,000 in fund fees, starts to feel excessive. He needed to move his money and I was glad to help him do it. Only Reason To Pay Double Fees The only real justification for such fees is if the manager offers access to exclusive private investments with meaningful upside—say, a hot AI company likely to IPO at a much higher valuation in a year or two. But in this case, there was no such access. I reviewed the historical performance of these funds, which was often difficult to find and intentionally opaque. But by simply comparing his portfolio value from a decade ago to when I started managing it, the compounded returns were clearly underwhelming. The double fees weren’t just costly—they were a drag on long-term performance. Personally, I’m not interested in paying another 0.5%+ to own a repackaged basket of public stocks that attempts to beat an index. In Defense of Getting Paid to Manage Money Most DIY investors, myself included, aim to minimize fees. But after managing a relative’s portfolio for a year, I now get why financial professionals charge what they do—the emotional labor is real. Managing money is relatively easy when markets are rising. It’s during downturns that things get difficult. And when you're managing money for a family member, the emotional stakes are even higher. You really don’t want to let them down. Advisors aren’t just managing assets; they’re managing expectations, fears, and behaviors. For that reason alone, they deserve to be compensated. That said, fees should be fair and transparent. A flat 1% management fee feels outdated. Something less—with a tiered structure that declines as assets grow—makes more sense. The Three Main Benefits Of Hiring A Money Manager The real value of hiring a money manager is peace of mind. Knowing someone is actively looking after your portfolio means you can focus on doing what you enjoy or excel at, without constantly worrying about market volatility or portfolio drift. Reducing the mental load is huge, especially for parents juggling work and childcare. During times of stress, it's reassuring to know someone else is thinking about ways to protect your wealth. The second big benefit is consistency. A good advisor helps you stay disciplined—investing regularly, staying diversified, and adjusting risk over time. Even as a committed DIY investor, I’ve had long stretches where I didn’t invest simply because life got in the way. The third benefit is accountability. A trusted advisor can act as a financial coach, helping you follow through on your goals. It’s one thing to know what you should be doing—it’s another to actually do it. Regular check-ins and objective feedback can keep you on track, especially during major life transitions or periods of uncertainty. A financial professional who helps with these three areas is well worth it. If you’re receiving proactive service and your portfolio is meeting expectations, great. But if not, it’s only rational to explore better options. I'm Stuck Managing the Money—But Not My Emotions I’m OK to help my relative create an investment plan. After all, it’s something I’ve done for others for over 15 years. I also love to save people money when there is a clear way to do so. But I also need to protect my time and mental well-being, which means learning to emotionally detach. My long-term goal is to teach him how to manage his own money. The challenge is, he struggles with learning about finances. He is not an FS reader and probably never will be. Ironically, this makes him the exact type of person who benefits most from having someone manage his money for him. So while I’ll continue to oversee his portfolio, I’m adjusting both the investment strategy and my mindset to reduce stress. He's on board with the new, slightly more conservative asset allocation, which falls within an appropriate range for his age and long-term financial goals. Further, to help offset the emotional load of managing his portfolio for free, I remind myself he's saving at least $20,000 a year thanks to me. That cushion gives both of us more resilience in down markets. So the next time a concerned message comes through, I’ll remind both of us just how much he’s saving. Appreciation Goes A Long Way If someone is managing your portfolio for free, don’t forget to show your appreciation once in a while. A simple thank-you note will do. And if you’re really thoughtful, perhaps send them a small gift or treat them to a nice meal at McDonald's if you’re making lots of money. You can do it! And if you don’t have someone to manage your money for free, consider hiring a money manager at a reasonable price. The reduction in stress alone may be well worth the cost. Oh, and if you’re wondering, my relative’s investments have since rebounded and are now at all-time highs. Let’s go! Readers, do any of you manage a friend or relative’s money for free? If so, how have you structured that arrangement—and how do you handle the stress when they’re anxious about market volatility, especially while your own portfolio is also taking a hit? Free Financial Analysis Offer From Empower If you have over $100,000 in investable assets—whether in savings, taxable accounts, 401(k)s, or IRAs—you can get a free financial check-up from an Empower financial professional by signing up here. It’s a no-obligation way to have a seasoned expert, who builds and analyzes portfolios for a living, review your finances. A fresh set of eyes could uncover hidden fees, inefficient allocations, or opportunities to optimize—giving you greater clarity and confidence in your financial plan. I’ve been using Empower’s free financial tools and speaking with their financial professionals since 2012. From 2013 to 2015, I also consulted part-time at their offices when they were still called Personal Capital. As both a longtime user and affiliate partner, I’m genuinely pleased with the value they’ve consistently delivered over the years. Today, my net worth is in the multiple eight figures thanks to getting regular financial checkups, diligent financial management, and consistent saving and investing. The statement is provided to you by Financial Samurai (“Promoter”) who has entered into a written referral agreement with Empower Advisory Group, LLC (“EAG”). Click here to learn more. To expedite your journey to financial freedom, join over 60,000 others and subscribe to the free Financial Samurai newsletter. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.",
  "image": "https://i2.wp.com/financialsamurai.com/wp-content/uploads/2025/06/image-219.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-281177\" itemtype=\"https://schema.org/CreativeWork\" itemscope=\"itemscope\"\u003e\n\n\t\n\t\n\u003cdiv data-ast-blocks-layout=\"true\" itemprop=\"text\"\u003e\n\n\t\t\n\t\t\n\u003cp\u003eAbout a year ago, a relative asked me to help manage his money. He had been paying a ~1% asset management fee with Goldman Sachs Asset Management (GSAM), even though he wasn’t their typical high-net-worth client. The account had been set up through his ex, but since he wanted a clean break, he was ready to move his money and asked for my guidance.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe scheduled a call—just like I do with \u003ca href=\"https://www.financialsamurai.com/career-personal-finance/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003econsulting clients\u003c/a\u003e—to go over his financial situation, goals, and concerns. From there, we created an investment strategy designed to preserve his lifestyle and reduce the risk of running out of money. As an artist, finance was not something he really understood or ever got into.\u003c/p\u003e\n\n\n\n\u003cp\u003eSince he was also looking for a new brokerage, I recommended Fidelity, where I’ve had my accounts for over 20 years. I\u0026#39;m familiar with their platform, and with his permission, I’d be able to view his portfolio and make trades on his behalf.\u003c/p\u003e\n\n\n\n\u003cp\u003eBy transferring his assets out of GSAM, he eliminated the 1% management fee and I rebuilt his IRA portfolios using low-cost ETFs with a similar asset allocation—saving him thousands a year in fees while maintaining long-term growth potential.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, after about a year, I don\u0026#39;t want to manage money for anyone for free again. It\u0026#39;s nothing personal. I just want to preserve more time and energy for my family.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-why-i-d-like-to-stop-managing-money-for-free\"\u003eWhy I\u0026#39;d Like To Stop Managing Money For Free\u003c/h2\u003e\n\n\n\n\u003cp\u003eWe agreed on an asset allocation, and I built it out for him. For the second half of 2024 and into early 2025, everything went smoothly. His portfolio steadily climbed to all-time highs, and I didn’t hear from him once. No problem. I felt proud to help grow his wealth, especially since he doesn’t earn much \u003ca href=\"https://www.financialsamurai.com/difference-between-active-income-and-passive-income/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eactive income\u003c/a\u003e. His portfolio will be his main financial support in the future.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut in late March and early April 2025, his portfolio took a hit due to the \u003ca href=\"https://www.financialsamurai.com/trade-wars-could-be-what-the-housing-market-needs-to-heat-up/\"\u003etrade wars\u003c/a\u003e, and I got a sudden text asking what was going on. So we got on another call and I explained the situation and tried to calm his nerves. \u003c/p\u003e\n\n\n\n\u003cp\u003eThen came the inevitable question: “What should we do now?”—a fair concern for anyone who has entrusted their money to someone else.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut now I started to feel the pressure. What if I made the wrong recommendation at the wrong time?\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eGet a free financial checkup from a professional:\u003c/strong\u003e If you have over $100,000 in investable assets, you can receive a free financial analysis from an Empower advisor by \u003cstrong\u003e\u003ca aria-label=\"signing up here (opens in a new tab)\" href=\"https://www.financialsamurai.com/advisor\" target=\"_blank\" rel=\"nofollow noindex noreferrer noopener\"\u003esigning up here\u003c/a\u003e\u003c/strong\u003e. An annual review is always worthwhile as your asset allocation can shift significantly over time, and your financial situation may evolve as well.\u003c/em\u003e \u003cem\u003eWe all have financial blindspots that are worth recognizing to build more future wealth. \u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-to-some-outperforming-is-not-enough\"\u003eTo Some, Outperforming Is Not Enough \u003c/h3\u003e\n\n\n\n\u003cp\u003eI reminded him of our game plan and emphasized the importance of staying the course. I also shared my outlook on why the markets were likely to rebound in the second half of the year—citing factors like trade agreements, deregulation, and potential tax cuts.\u003c/p\u003e\n\n\n\n\u003cp\u003eGiven we had constructed a \u003ca href=\"https://www.financialsamurai.com/the-60-40-portfolio/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e60/40 portfolio\u003c/a\u003e, when the S\u0026amp;P 500 was down ~20% year-to-date on April 8, his portfolio was \u003cstrong\u003e\u003cem\u003eonly down 8.8%\u003c/em\u003e\u003c/strong\u003e. From my perspective, that was a win!\u003c/p\u003e\n\n\n\n\u003cp\u003eBut from his perspective, I had still lost him money. And since he wasn’t a fan of the current administration, the situation felt even more frustrating to him.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt didn’t really matter that I highlighted his portfolio’s outperformance or the rationale behind a balanced allocation. He was disappointed—and that, in turn, chipped away at some of my emotional resilience.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt doesn\u0026#39;t feel good to help someone who is disappointed in your help. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-already-stressed-with-my-own-losses\"\u003eAlready Stressed With My Own Losses\u003c/h2\u003e\n\n\n\n\u003cp\u003eAt the time, I was already stressed about my own portfolio losses, which were approaching seven figures. I was \u003ca href=\"https://www.financialsamurai.com/buying-the-dip/\"\u003ebuying the dip\u003c/a\u003e, watching values continue to fall, and doing my best to stay calm. But deep down, I felt like a fool for jumping in too early with the proceeds from my stable real estate sale.\u003c/p\u003e\n\n\n\n\u003cp\u003eHis stress added to mine, and I had to compartmentalize my own emotions to reassure him. It left me with less patience for my wife and kids, which was the biggest negative since I love them more than anything. And when I’m losing a lot of money, I admit I tend to have a shorter fuse.\u003c/p\u003e\n\n\n\n\u003cp\u003eDuring the bull market, I didn’t hear a word of acknowledgement. But as soon as things took a turn, I was met with concern and urgency. Again, totally understandable. However, I was cast in the role of an unpaid employee, bringing back the very feelings of underappreciation that pushed me to \u003ca href=\"https://www.financialsamurai.com/taking-a-leap-of-faith-retiring-on-own-terms/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eleave the traditional workforce\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf I’m expected to actively manage someone’s portfolio and provide emotional support and education during downturns, there needs to be clear compensation or boundaries. Otherwise, I’d rather preserve my energy for writing and taking care of the kiddos. \u003c/p\u003e\n\n\n\n\u003cp\u003eAfter being free from a day job since 2012, I probably have become \u003cem\u003eoverly sensitive\u003c/em\u003e to anything that reduces my sense of freedom and joy. As a result, I\u0026#39;m not cut out to be a money manager at this stage in my life.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-problem-with-double-fees\"\u003e\u003cstrong\u003eThe Problem With Double Fees\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eI was happy to help move my relative’s funds away from GSAM to reduce the double fees he was paying. He was being charged an asset management fee of about 1%, plus fund fees ranging from 0.5% to 1.6%—mostly on Goldman-managed funds.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, I’m not against hiring an asset manager if you genuinely don’t have the time, interest, or knowledge to manage your own money. Paying a professional to build a risk-appropriate portfolio is far better than sitting in cash and missing out on decades of compounding. A good manager can also serve as an emotional buffer—helping prevent panic selling during downturns and reckless speculation during bull markets.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut paying double fees—especially as your portfolio grows—adds up quickly. A $5,000 annual fee on a $500,000 portfolio is one thing. But paying $25,000 on a $2.5 million portfolio, plus another $12,500 to $40,000 in fund fees, starts to feel excessive.\u003c/p\u003e\n\n\n\n\u003cp\u003eHe needed to move his money and I was glad to help him do it.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-only-reason-to-pay-double-fees\"\u003eOnly Reason To Pay Double Fees\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe only real justification for such fees is if the manager offers access to \u003ca href=\"https://www.financialsamurai.com/innovation\" rel=\"nofollow noindex noreferrer noopener\" target=\"_blank\" label=\"exclusive private investments (opens in a new tab)\"\u003e\u003cstrong\u003eexclusive private investments\u003c/strong\u003e\u003c/a\u003e with meaningful upside—say, a hot AI company likely to IPO at a much higher valuation in a year or two. But in this case, there was no such access.\u003c/p\u003e\n\n\n\n\u003cp\u003eI reviewed the historical performance of these funds, which was often difficult to find and intentionally opaque. But by simply comparing his portfolio value from a decade ago to when I started managing it, the compounded returns were \u003ca href=\"https://www.financialsamurai.com/active-versus-passive-investing-performance-equities-fixed-income/\"\u003eclearly underwhelming\u003c/a\u003e. The double fees weren’t just costly—they were a drag on long-term performance.\u003c/p\u003e\n\n\n\n\u003cp\u003ePersonally, I’m not interested in paying another 0.5%+ to own a repackaged basket of public stocks that attempts to beat an index.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-in-defense-of-getting-paid-to-manage-money\"\u003eIn Defense of Getting Paid to Manage Money\u003c/h2\u003e\n\n\n\n\u003cp\u003eMost \u003ca href=\"https://www.financialsamurai.com/diy-investing/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDIY investors\u003c/a\u003e, myself included, aim to minimize fees. But after managing a relative’s portfolio for a year, I now get why financial professionals charge what they do—\u003cstrong\u003ethe emotional labor is real\u003c/strong\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eManaging money is relatively easy when markets are rising. It’s during downturns that things get difficult. And when you\u0026#39;re managing money for a family member, the emotional stakes are even higher. You really don’t want to let them down.\u003c/p\u003e\n\n\n\n\u003cp\u003eAdvisors aren’t just managing assets; they’re managing expectations, fears, and behaviors. For that reason alone, they deserve to be compensated.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat said, fees should be fair and transparent. A flat 1% management fee feels outdated. Something less—with a tiered structure that declines as assets grow—makes more sense. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-three-main-benefits-of-hiring-a-money-manager\"\u003eThe Three Main Benefits Of Hiring A Money Manager \u003c/h2\u003e\n\n\n\n\u003cp\u003eThe real value of hiring a money manager is \u003cstrong\u003epeace of mind\u003c/strong\u003e. Knowing someone is actively looking after your portfolio means you can focus on doing what you enjoy or excel at, without constantly worrying about market volatility or portfolio drift. Reducing the mental load is huge, especially for parents juggling work and childcare. During times of stress, it\u0026#39;s reassuring to know someone else is thinking about ways to protect your wealth.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe second big benefit is \u003cstrong\u003econsistency\u003c/strong\u003e. A good advisor helps you stay disciplined—investing regularly, staying diversified, and adjusting risk over time. Even as a committed DIY investor, I’ve had long stretches where I didn’t invest simply because life got in the way.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe third benefit is \u003cstrong\u003eaccountability\u003c/strong\u003e. A trusted advisor can act as a financial coach, helping you follow through on your goals. It’s one thing to know what you should be doing—it’s another to actually do it. Regular check-ins and objective feedback can keep you on track, especially during major life transitions or periods of uncertainty.\u003c/p\u003e\n\n\n\n\u003cp\u003eA \u003ca href=\"https://www.financialsamurai.com/how-a-financial-professional-saved-me-from-myself/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efinancial professional\u003c/a\u003e who helps with these three areas is well worth it. If you’re receiving proactive service and your portfolio is meeting expectations, great. But if not, it’s only rational to explore better options.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-i-m-stuck-managing-the-money-but-not-my-emotions\"\u003eI\u0026#39;m Stuck Managing the Money—But Not My Emotions\u003c/h2\u003e\n\n\n\n\u003cp\u003eI’m OK to help my relative create an investment plan. After all, it’s something I’ve done for others for over 15 years. I also love to save people money when there is a clear way to do so. But I also need to protect my time and mental well-being, which means learning to emotionally detach.\u003c/p\u003e\n\n\n\n\u003cp\u003eMy long-term goal is to teach him how to manage his own money. The challenge is, he struggles with learning about finances. He is not an FS reader and probably never will be. Ironically, this makes him the exact type of person who benefits most from having someone manage his money for him.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo while I’ll continue to oversee his portfolio, I’m adjusting both the investment strategy and my mindset to reduce stress. He\u0026#39;s on board with the new, slightly more \u003ca href=\"https://www.financialsamurai.com/the-proper-asset-allocation-of-stocks-and-bonds-by-age/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003econservative asset allocation\u003c/a\u003e, which falls within an appropriate range for his age and long-term financial goals.\u003c/p\u003e\n\n\n\n\u003cp\u003eFurther, to help offset the emotional load of managing his portfolio for free, I remind myself he\u0026#39;s saving at least \u003cstrong\u003e$20,000 a year\u003c/strong\u003e thanks to me. That cushion gives both of us more resilience in down markets. So the next time a concerned message comes through, I’ll remind both of us just how much he’s saving.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-appreciation-goes-a-long-way\"\u003eAppreciation Goes A Long Way\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf someone is managing your portfolio for free, don’t forget to show your appreciation once in a while. A simple thank-you note will do. And if you’re really thoughtful, perhaps send them a small gift or treat them to a nice meal at McDonald\u0026#39;s if you’re making lots of money. You can do it!\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if you don’t have someone to manage your money for free, consider hiring a money manager at a reasonable price. The reduction in stress alone may be well worth the cost.\u003c/p\u003e\n\n\n\n\u003cp\u003eOh, and if you’re wondering, my relative’s investments have since rebounded and are now at all-time highs. Let’s go!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eReaders, do any of you manage a friend or relative’s money for free? If so, how have you structured that arrangement—and how do you handle the stress when they’re anxious about market volatility, especially while your own portfolio is also taking a hit?\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-free-financial-analysis-offer-from-empower\"\u003eFree Financial Analysis Offer From Empower\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf you have over $100,000 in investable assets—whether in savings, taxable accounts, 401(k)s, or IRAs—you can get a \u003cstrong\u003efree financial check-up\u003c/strong\u003e from an Empower financial professional by \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/advisor\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003esigning up here\u003c/a\u003e\u003c/strong\u003e. It’s a no-obligation way to have a seasoned expert, who builds and analyzes portfolios for a living, review your finances.\u003c/p\u003e\n\n\n\n\u003cp\u003eA fresh set of eyes could uncover hidden fees, inefficient allocations, or opportunities to optimize—giving you greater clarity and confidence in your financial plan.\u003c/p\u003e\n\n\n\n\u003cp\u003eI’ve been using Empower’s free financial tools and speaking with their financial professionals since 2012. From 2013 to 2015, I also consulted part-time at their offices when they were still called Personal Capital. As both a longtime user and affiliate partner, I’m genuinely pleased with the value they’ve consistently delivered over the years.\u003c/p\u003e\n\n\n\n\u003cp\u003eToday, my net worth is in the multiple eight figures thanks to getting regular financial checkups, diligent financial management, and consistent saving and investing. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eThe statement is provided to you by Financial Samurai (“Promoter”) who has entered into a written referral agreement with Empower Advisory Group, LLC (“EAG”). Click \u003ca href=\"https://www.empower.com/affiliate-financial-samurai-disclosure-page\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003ehere\u003c/a\u003e to learn more.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eTo expedite your journey to financial freedom, join over 60,000 others and subscribe to the \u003cstrong\u003e\u003ca href=\"https://www.financialsamurai.com/news\" target=\"_blank\" rel=\"noreferrer noopener\"\u003efree Financial Samurai newsletter\u003c/a\u003e\u003c/strong\u003e. Financial Samurai is among the largest independently-owned personal finance websites, established in 2009. Everything is written based on firsthand experience and expertise.\u003c/em\u003e\u003c/p\u003e\n\n\t\t\n\t\t\n\t\t\t\u003c/div\u003e\n\n\t\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-06-27T11:18:00Z",
  "modifiedTime": "2025-06-29T01:45:25Z"
}
