{
  "id": "2bb7cd14-d930-497a-9b76-c9313884e522",
  "title": "Weekend Reading For Financial Planners (January 18–19)",
  "link": "https://feeds.feedblitz.com/~/911176736/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-January-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that at a time when brokerage firms' cash sweep programs come under increased scrutiny (and as the Federal Reserve has cut interest rates), Charles Schwab (the largest RIA custodian) continues to slash sweep rates for clientRead More... The post Weekend Reading For Financial Planners (January 18–19) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 17 Jan 2025 19:00:12 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 35501,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that at a time when brokerage firms' cash sweep programs come under increased scrutiny (and as the Federal Reserve has cut interest rates), Charles Schwab (the largest RIA custodian) continues to slash sweep rates for client",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" – this week's edition kicks off with the news that at a time when brokerage firms' cash sweep programs come under increased scrutiny (and as the Federal Reserve has cut interest rates), Charles Schwab (the largest RIA custodian) continues to slash sweep rates for client cash (down to 0.05%), well below the rates available on other cash-like products, leaving advisors on the platform with the task of determining whether to move (at least some) client cash to higher-paying offerings (whether from Schwab or using emerging cash management platforms) to help clients earn more on their cash holdings and to ensure they are fulfilling their fiduciary responsibilities. Also in industry news this week: A recent survey indicates that members of Generation X are struggling more with retirement planning compared to older Baby Boomers and younger Millennials, potentially offering opportunities for financial advisors to help Gen Xers create a plan to 'catch up' when it comes to both their retirement savings and their financial confidence According to a recent study, 37% of financial advisors are planning to retire within the next decade, opening up potential opportunities for the 48% of advisors who indicated interest in acquiring a practice From there, we have several articles on retirement planning: Research into a variety of flexible retirement income strategies demonstrates the tradeoffs between current safe withdrawal rates, cash flow volatility, lifetime spending, and legacy interests An analysis suggests that those taking Social Security benefits early to invest them have a high breakeven rate to clear compared to those who delay benefits until Full Retirement Age or beyond Why taking a systematized approach to determining a client's retirement income style preferences can help advisors offer a more personalized client experience We also have a number of articles on advisor marketing: How relatively smaller RIAs are pursuing organic growth at a time when M\u0026A activity is receiving significant attention, from expanding the platforms (and audiences) they reach to refining their service models Eight tips to help advisors get more \"earned media\" opportunities and demonstrate their expertise and credibility to prospective clients Best practices for client events, including creating a sense of community and offering opportunities to gather feedback and preferences from clients We wrap up with three final articles, all about managing stress: How to keep up with the news without getting overly stressed, from deciding how deep to go into particular issues to setting time boundaries for news consumption How regular self-reflection can help identify potential stressors and begin the process of moving past them Why separating one's thoughts from one's sense of self can help avoid the stress that can arise from 'overthinking' Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. Schwab Continues To Slash Cash Sweep Yields, Raising Potential Issues For RIAs (Oisin Breen | RIABiz) A custodian is one of the most crucial vendors for RIAs that manage client assets. From the core custodial services of trading and holding and keeping records of electronically owned securities, to the ancillary technology from trading to (digital) onboarding that custodians provide to help advisors run their business, a good RIA custodial relationship is crucial to help firms attract and retain clients. And despite this range of benefits, RIAs typically are able to access these services without having to pay any direct platform fees, as the custodians earn money in a variety of other ways, including in today's environment what is often a substantial amount of net interest income derived from the difference between the rate paid on RIA client cash held in platform or related-bank sweep programs, and the rate at which they can otherwise invest or lend the money to others (e.g., through margin loans). Which has become particularly important to the custodians as the industry has moved away from ticket charges for trades and is less and less reliant on mutual funds (and the sub-TA fees they historically generated for RIA custodians). In an apparent move to maintain their net interest income as the Federal Reserve itself cut rates in the fourth quarter, Charles Schwab (the largest RIA custodian) in September cut its cash sweep yield from 0.45% to 0.2%, then cut further to 0.1% in early December, and finally down to 0.05% in late December (at a time when rates on other cash-like vehicles are still significantly higher, with Schwab itself offering money market funds with yields greater than 4%). Nonetheless, Schwab's relatively low cash sweep yields don't seem to be leading to an outflow of client dollars, as the firm's cash sweep balances actually grew 5% to $393.7 billion between August and November of last year (suggesting that some advisors either didn't notice the change or didn't think it merited changing their cash management practices). Notably, Fidelity (the second-largest RIA custodian) has made a similar change to maintain its net interest income in the face of Federal Reserve rate cuts, announcing that it is planning to convert the default sweep for RIA's non-retirement client cash balances from money market funds (with the largest Fidelity money market fund currently carrying a 7-day yield above 4%) to its in-house cash management product, FCASH (which offers a 2.19% yield). Though notably the Fidelity rates, after the change, will still greatly exceed the latest Schwab cash sweep rates. Schwab's move comes at a time of increasing scrutiny of brokerage firms' cash sweep programs, with LPL Financial, Wells Fargo, and Morgan Stanley facing probes from the Securities and Exchange Commission over the yields they pay direct clients of their platforms (who engage those firms' RIA advice offerings, and then use the firms' brokerage platforms, where choosing a more-profitable cash sweep for RIA clients in the co-owned brokerage firm is a more direct conflict of interest), and plaintiffs filing lawsuits against those firms and Schwab itself. Further, while the fallout from the cash sweep controversy has so far been mostly limited to the brokerage firms themselves, securities attorneys have pointed out that there's a potential liability exposure for RIAs as well. To the extent that financial advisors allow their clients to have uninvested cash sitting in their brokerage accounts and earning almost no interest – either intentionally, or because of a failure to monitor their cash levels – it could be argued that the advisor has violated their fiduciary duty to act in the client's best interest, especially if the advisor also billed their advisory fee on that cash. Which means that, once the initial wave of lawsuits against brokerage firms has subsided, RIAs could eventually also find themselves the targets of legal action for failing to minimize the amount of clients' cash in low-yielding sweep accounts. Which ultimately leaves RIAs facing lower cash sweep rates with several potential options. The easiest way to avoid receiving a low interest rate on a cash sweep account is to simply not keep uninvested cash in a brokerage account where it would be subject to those low cash sweep rates, and instead either invest it or move it to a higher-earning cash product like a high-yield savings account, cash management account, or at least trading into a money market fund on the platform. Alternatively, slashed cash sweep rates could be the proverbial 'straw that breaks the camel's back' that drives some firms to look for a new custodian (despite the labor involved in repapering clients and learning new systems) that offers better yields and would thus drive incrementally higher returns for clients themselves. In any case, for the time being, for those RIAs with client assets at the largest custodians, having a process for monitoring and managing clients' cash levels may not be just a 'nice-to-have' feature to provide extra value for the client, but a necessity for the advisor to fulfill their fiduciary obligations and protect their clients from their custodian's own business model? Gen X Grappling With Lack Of Retirement Planning: Survey (Edward Hayes | Financial Advisor) Americans across the age spectrum have faced differing environments when it comes to planning for retirement. While older Americans might have been more likely to work at jobs offering defined-benefit pensions (that don't require many choices regarding savings rates or investment options on the part of the worker), their decreasing popularity (alongside the rise of defined-contribution retirement plans) has created a different environment for workers in younger generations. According to a survey of 2,000 investors by investment manager Schroders, those in Generation X (i.e., those currently between the ages of 44 and 59) see themselves as worse off when it comes to retirement planning than older Baby Boomers or younger Millennials. The survey found that 48% of Gen Xers have done no retirement planning and 54% are concerned about outliving their assets in retirement (compared to 40% of Boomers and 50% of Millennials). In addition, only 27% of Gen Xers surveyed said they work with a financial advisor, compared to 37% of Boomers and 31% of Millennials. Further, only 10% of Gen X respondents plan to wait until age 70 to claim Social Security benefits (when they would receive their maximum monthly benefit), with 43% of them saying they don't want to wait because they are concerned Social Security may run out of money or stop making payments (compared to 24% of Boomers and 37% of Millennials citing this reason), which could limit their retirement spending further. In the end, while a significant percentage of individuals across the age spectrum have expressed concern about their retirement security, those in Generation X could be particularly vulnerable, as they have spent most of their time in the workforce amidst the decline of defined-benefit pensions but might have been late to making contributions to defined-contribution plans (as potential balance-boosting features such as auto-enrollment are a more recent phenomenon). Which offers financial advisors several opportunities to add value for clients in this group (who might approach an advisor as they realize their potential retirement insecurity and/or after receiving an inheritance from aging parents?), from crafting a savings plan to help them 'catch up' on retirement savings in their later working years to considering whether delaying Social Security benefits could be in their long-term financial interest. 37% Of Advisors Plan To Retire In Next Decade, Keeping M\u0026A Market Hot: Study (Gregg Greenberg | InvestmentNews) A much-discussed theme over the past several years has been the graying of the financial advisor population, with the pending retirements of many firm founders potentially having an impact not only on their own firms, but also on the makeup of the industry itself (e.g., if a significant number of founders eschew an internal succession and sell to one of the deal-hungry RIA 'aggregators'). According to data from research and consulting firm Cerulli Associates, 105,887 advisors plan to retire in the coming decade, representing 37.4% of industry headcount and 41.4% of total assets. Nevertheless, despite the expectation that they will be retiring within the next several years, many have not prepared for the transition, with 26% indicating they are unsure of their retirement plans (suggesting that some of these advisors might end up deciding to sell their firms to an external buyer, as doing so typically requires a shorter planning runway than completing an internal succession). Notably, the percentage of those unsure of their retirement plans rises to 30% for independent RIAs, who face greater concerns about succession and retirement planning compared to those who are affiliated with larger wealth managers, with independent advisors citing challenges in finding a qualified buyer (with 86% indicating this is a challenge), structuring deal terms (63%) and valuing their practice accurately (53%). While there could be an influx of advisors looking to sell their practices in the coming years, there appears to be a healthy number of potential buyers as well, with 48% of advisors indicating that they are interested in acquiring a practice. At the same time, these advisors face challenges consummating deals as well, including the investment of time necessary to finalize a deal (cited by 67% of these firms) and negotiation and style differences with the seller (53%). Altogether, these data points indicate that advisory firm founders who plan well in advance for their retirement, whether they intend to complete an internal succession or seek an external sale, can give themselves additional time to prepare their firm, seek a suitable buyer and ultimately end up with a better outcome (and perhaps less stress!) for themselves, their team, and their clients! The Best Flexible Strategies For Retirement Income (Amy Arnott | Morningstar) One of the most valuable services financial advisors offer to clients nearing or in retirement is helping them make the transition from receiving most of their income from a salary to withdrawing money from their portfolio (alongside Social Security benefits and other potential income sources). And with a variety of approaches available for determining how much income a client can take from their portfolio in a given year, advisors have the opportunity to select an option that best fits their clients' priorities (and the ability of the advisor to efficiently manage it). To help advisors and their clients assess different retirement income approaches, Morningstar tested several strategies to determine the upsides and downsides of each approach (using a 30-year retirement horizon, a 40% equity/60% bond portfolio, and a 90% probability of success). For instance, one approach is to take fixed real withdrawals throughout retirement but forgo the inflation adjustment for the year following a year in which the portfolio has declined in value. According to Morningstar's analysis, this strategy allows for a higher initial withdrawal rate compared to a similar approach that applies inflation adjustments every year (4.2% vs 3.7%) and entails relatively little year-to-year spending change (which might be attractive to retirees who value stability and predictability over maximizing their total spending in retirement). On the other end of the spectrum is a 'Required Minimum Distribution' (RMD) approach, where the IRS' Single Life Expectancy Table is used to determine the percentage of the portfolio that will be withdrawn each year. While this method is 'safe' in the sense that the portfolio can never be fully depleted due to a certain percentage being withdrawn each year (though portfolio withdrawals could become quite small if it declines in value over time) and offers a higher initial withdrawal rate than the 'fixed' approach (4.7% vs. 3.7%), it also results in the greatest annual cash flow volatility of the different methods tested (because while the percentage withdrawn only changes slightly each year, the amount in dollar terms will vary significantly based on market performance) and typically leaves little money left over (which might be a consideration for those with legacy interests). A middle ground option is the Guyton-Klinger \"Guardrails\" approach which allows for upward and downward spending adjustments depending on changes in portfolio value and offers a higher initial withdrawal rate (5.1%) compared to the previous two approaches. While its annual cash flow volatility is higher than that of the 'forgoing inflation' approach, it offers retirees greater lifetime spending than this method. Further, compared to the 'RMD' approach, the \"Guardrails\" method comes with less annual spending volatility and a greater terminal wealth (for those retirees with legacy interests), while only slightly trailing the 'RMD' method in terms of lifetime spending. Ultimately, the key point is that different retirement income approaches come with varying tradeoffs, whether it comes to lifetime spending, annual spending volatility, or leftover wealth at death. However, a key takeaway is that the flexible withdrawal strategies discussed tend to be superior to a simple fixed withdrawal method (particularly when it comes to the initial safe withdrawal rate), suggesting that advisors can add value not only by choosing a withdrawal rate strategy, but also by analyzing their clients' unique situations on an ongoing basis (and implementing adjustments when necessary!). What's Best For Retirement Income: Delay Social Security Or Claim Early And Invest? (John Manganaro | ThinkAdvisor) One of the most impactful decisions retirees will make is when to claim Social Security benefits. While some individuals might claim benefits at age 62 or soon after (perhaps because they have little retirement savings and need the benefits to support their lifestyles), others wait until their Full Retirement Age, or possibly until age 70, when they can receive their maximum benefit. While delaying benefits (and thereby receiving a larger monthly payment for the remainder of their lives) can be an attractive proposition for those who can afford to do so, many still decide to claim early, sometimes with the plan to invest some or all of these benefits in the hopes of earning a better return than they would by waiting to claim. However, an analysis by retirement researcher David Blanchett throws some cold water on this approach, particularly for married couples and those with longer expected lifespans. He found that for individuals, those who live to age 85 and claim early will have an average breakeven return (i.e., the return they will need to achieve on the Social Security benefits invested) of about 7%, which increases to 8% by age 90 and 9% by age 95 (and while clients might note that those breakevens are relatively in line with long-term stock returns, this approach would require an aggressive asset allocation that could result in sharp drawdowns). The breakeven for married couples is even higher (considering spousal survivor benefits), typically increasing the required breakeven return by approximately 1.5% above the breakeven for an individual. In the end, while the prospect of claiming Social Security benefits before reaching Full Retirement Age or age 70 might be attractive to clients for a variety of reasons (from the assumption that they have a limited life expectancy to concerns that Social Security will not be able to pay out full benefits in the future), the ability to 'beat' the returns from delaying benefits appears to be a challenging proposition (including for the advisor who would be charged with generating these returns!), suggesting that many clients (particularly those with longer life expectancies and/or are married) could benefit financially from delaying benefits! Taking A Systematized Approach To Personalizing Retirement Income Strategies For Clients (Alex Murguía and Wade Pfau | Nerd's Eye View) As average life expectancy has increased over time, so too has the importance for retirees to ensure that they have sufficient income to cover their needs throughout what could be a 30-year (or longer) retirement. While some advisors may rely on a single 'favorite' income strategy to recommend to clients, recognizing that retirees actually have a range of preferences on how to source their retirement income can help advisors better develop sensible strategies that clients may be more inclined to follow. And the starting point for understanding a client's income preferences to help them choose the right retirement income strategy is to identify the client's retirement income style. Murguía and Pfau suggest the two strongest constructs that help to determine a client's income preference style are Probability (depending on market returns) versus Safety (sources of income less reliant on market returns), and Optionality (having flexibility to respond to economic developments or changing personal situation) versus Commitment (being dedicated to one retirement income solution). Together, these constructs were used to create a framework that can be used to identify an individual's Retirement Income Style Awareness (RISA) profile. For advisors, the RISA framework can be used to determine a prospect's or client's preferences, which can then help them design an appropriate and practical retirement income strategy. For example, an individual who expresses a preference for Probability and Optionality would likely appreciate the potential upside from strong market returns and the option to change course as necessary that are offered by a Total Return income strategy. Those who prefer Safety and Commitment may align better with an Income Protection approach, which would involve building a lifetime income floor with simple income annuities. And for those favoring Probability and Commitment, a Risk Wrap strategy (i.e., building a lifetime income floor with deferred annuities offering lifetime withdrawal benefits) could be more appropriate. Finally, those with preferences rooted in Safety and Optionality would likely appreciate a Time Segmentation strategy (e.g., bucketing strategies that use less volatile assets for shorter-term expenses, and more volatile assets offering higher growth potential for future expenses). Ultimately, the key point is that by having a structured process around assessing retirement income preferences (whether by using a standardized RISA Matrix assessment or informally assessing where a prospect or client will be on the Matrix), an advisor can begin to develop a retirement income strategy that will most likely appeal to a particular prospect or client. By doing so, advisors can not only add value to current clients by ensuring that the client's retirement income strategy matches their preferences, but can also attract new clients by offering a more personalized approach to generating retirement income (while perhaps finding the right balance between the level of personalization provided to each client and the time needed to implement different preferences across their client base?). Forget Mega-Money Deals, Here's How Smaller RIAs Are Growing (Alec Rich | Citywire RIA) A major theme in the RIA industry in the past few years has been the active Mergers and Acquisitions (M\u0026A) market, led by a group of (often private equity-backed) RIA 'aggregators' engaging in 'inorganic growth', scooping up smaller firms whose founders are either looking to retire or to grow under the umbrella of a larger firm. Nevertheless, there remains a robust population of smaller RIAs pursuing 'organic growth' by bringing on new clients (and having current clients bring over more of their assets) through a variety of marketing methods. At a time when it can be difficult to compete with the advertising budgets of the largest financial firms (RIAs or otherwise), leveraging a variety of platforms to distribute content has proven to be an effective for many firms to demonstrate their expertise to (and show how they can solve the pain points of) their ideal target clients. For instance, firms are reaching clients and prospects through newsletters, blogs, podcasts, and social media posts. In addition, advisors are looking to 'tried and true' methods such as referrals from clients (e.g., by asking for referrals after celebrating successes) and centers of influence (e.g., by finding professionals working with individuals whose money is in 'motion', such as real estate agents or divorce attorneys). In addition to these marketing tactics, some firms are attracting clients by narrowing in on an ideal client persona and refining their service offerings, offering the highest-value services for their target clients (while potentially dropping other services in order to avoid the potential time costs of being 'too' comprehensive). In the end, while organic growth can be a challenging proposition for some firms in the competitive marketplace for financial advice, the variety of potential ways to reach prospects (and the large percentage of the public that still isn't working with an advisor!) presents opportunities for RIAs of all sizes to grow in 2025 and into the future without having to rely on M\u0026A. At the same time, strong organic growth also can position a firm well for a future acquisition (by demonstrating the ability to scale effectively and onboard and serve new clients, or an eventual sale (as organic growth remains a key metric when valuing a firm)! (Kalli Fedusenko | Advisor Perspectives) Given the high stakes involved when choosing a financial advisor, prospective clients will often seek evidence of an advisor's expertise and credibility, which could come from a friend (i.e., \"social proof\") or another source they trust, such as a media outlet they find credible. This latter option offers a potential way for advisors to get their message out to prospective clients (at no hard dollar cost!), though these \"earned media\" opportunities can require advisors to be proactive. One way to get the attention of media outlets is to create content worth sharing, which could be research findings (relevant to the advisor's target client), a book, or perhaps a rebuttal to inaccurate financial advice being spread online (putting out a press release related to a major piece of content can help grab the attention of reporters as well). In addition to written content, making appearances on finance-related podcasts or webinars can help an advisor gain visibility and the attention of the news media. For advisory firms with a local client base, hosting an event (e.g., a volunteer opportunity) and opening it up to the public can attract coverage from local media outlets. Finally, advisors belonging to membership associations or similar groups can see if the organization curates a list of advisors available to answer media inquiries, which could lead to becoming a trusted expert on a given topic. Ultimately, the key point is that given the hard dollar and time costs involved in advisor marketing, seeking earned media opportunities can be a cost-effective way to gain credibility in the eyes of target prospects (and serve as material to include on an advisor's website!). Nevertheless, doing so does take a bit of work to get on the radar of the media to start with, suggesting that just as an advisor can show how they provide value for their clients, they can also demonstrate (through engaging, useful content and incisive remarks) how they can support reporters as well! How To Host An Effective Client Event (Elyse Stoner and Angela York | NAPFA Advisor) Client events have long been a staple of advisory firms' calendars and can create closer ties between advisors and their clients (hopefully boosting client loyalty and retention over time) and lead to introductions to planning prospects (whether clients bring them to the event or are encouraged to refer them based on their deeper relationship with their advisor). Nevertheless, the potential time and hard dollar cost of holding such events can sometimes leave advisors frustrated if they don't see a clear 'return' from them (e.g., in the form of new clients). To start, Stoner and York suggest that the best events are aligned with client interests, reflecting the passions and preferences of the firm's ideal target client (e.g., an event type many might enjoy or a planning topic important to them) rather than doing a more generic event. Next, effective events often have a collaborative atmosphere (e.g., by incorporating breakout sessions), providing time for clients (and their guests) to connect with each other, allowing them to share experiences and solidifying the advisor's role as a community builder. Finally, events can be used to gather strategic feedback from clients, not only to get their thoughts regarding the firm's service or new initiatives, but also to learn more about them (e.g., if an advisor hosts a wine-tasting event, asking clients about their favorite bottle could provide valuable information for the next time the advisor wants to send a thoughtful client appreciation gift!) In sum, client events do not necessarily have to lead to an immediate influx of prospect referrals to be considered a success (and don't have to cost a significant amount of money to put on!). Rather, the rewards from an effective client event can come over time, whether in the form of greater client loyalty, an expanded professional network, and/or valuable information that can be used to refine the firm's services. How To Keep Up With The News Without Getting Overwhelmed (Rebecca Knight | Harvard Business Review) In the 21st century, it can be challenging to avoid the onslaught of news sources, from websites to social media feeds to print publications. And while staying abreast of information relevant to the community, country, and world can be a productive activity (particularly if there's a constructive action you can take in response to it), some research suggests that overconsumption of news can be associated with mental stress. Which creates a dilemma: how to consume news in a productive way without spending too much time, mental bandwidth, and emotional energy on doing so? One way to improve news consumption is to 'go deep' on topics that are most relevant to you while only having a \"headline-level\" awareness of other issues. This practice, along with focusing on sources of 'hard' news rather than 'hot takes' (particularly when it comes to social media), can help reduce the amount of time spent consuming news. In addition, controlling when news is consumed can also limit the amount of time spent reading it (and thinking about it afterward). For instance, you might reserve a block of time in the evening, well before bed, to see what happened during the day (thereby avoiding interruptions to work and preventing obtrusive thoughts from disrupting your sleep). Relatedly, minimizing the number of news-related interruptions (e.g., cell phone notifications from news organizations) can help prevent the temptation to consume the news outside of the prescribed block of time. Finally, reading the news on paper (e.g., hard-copy newspapers or magazines) rather than online can help you better control what you consume and minimize potential distractions (e.g., the often-toxic comment sections found at the bottom of news articles). In the end, controlling what news you access as well as when and how you do so can help you strike a balance between the value of being aware of the world around you (and inspire opportunities for action) and the stress that can come from being bombarded with news (or commenters) that are outside of your control. Know Thyself (Joy Lere | Finding Joy) Stress is a common part of life, whether it comes from work, home, or the broader world. While it can't be avoided, understanding the triggers that most frequently cause you stress (and what leads to deeper worry) can help you take proactive action to mitigate them going forward and reduce overall stress levels, suggesting that regular self-reflection could offer significant value. For instance, you might consider which relationships (personal or professional) drain you rather than provide energy (which might call for a reassessment of how you interact with the former group). Similarly, you can consider the times when you are most unhappy (e.g., what's happening, what are you doing, and who are you with) and consider ways to avoid those situations. In addition, given that stress can sometimes arise when problems or tasks are avoided, understanding why you are putting them off and considering ways to confront them can help take the stressor off of your plate (even if it might be uncomfortable to do so). Another potentially valuable practice is to consider whether a stressor is within or outside of your control (and then redirecting time and mental energy away from the latter group and towards the former). Further, you can consider whether the goals you're pursuing are your own (the pursuit of which will likely be more fulfilling) rather than those imposed externally (e.g., societal \"shoulds\"), which can lead to a never-ending treadmill of trying to meet others' (perhaps assumed?) expectations. Ultimately, the key point is that while financial planners are experts at asking clients deep questions to better understand their goals and concerns when it comes to money, turning the tables and engaging in self-evaluation can be a valuable way to reveal what causes oneself to be stressed and to start down the path of making changes to reduce these burdens! Thinking Your Way Out Of Problems Doesn't Work (Darius Foroux) Being a thoughtful person can be a positive trait, for instance in being conscientious and considerate of others. However, this can potentially go to an extreme, where it's tempting to constantly overthink matters (\"was that [seemingly innocuous] comment I made in the meeting actually awkward?\"), leading to regular stress. One way to start breaking the overthinking habit is to engage in the mindfulness practice of 'observing' your thoughts. For instance, when a stressful thought arises, you might consider whether it is valid and relevant and, if not, try to set it aside and move on to more important matters. The second (and sometimes also challenging) step is to separate 'you' from your thoughts. By recognizing that intrusive thoughts and a restless mind are natural occurrences, you can be more forgiving of yourself rather than treating the thoughts as a judgment of your character or decision-making. This can then help you turn your attention to the 'real world' outside of your head and live more in the moment, whether at work, home, or otherwise. Altogether, while it can be tempting to overthink a given issue (whether financial planning-related or otherwise), living life 'in your head' typically is less fulfilling (and more stressful) than being more 'present' throughout the day. And while these practices can take time to develop (given the constant pull of the mind), being aware of your thoughts and separating them from your self-image can help you break free of overthinking tendencies (while still maintaining a certain level of conscientiousness and consideration of others!). We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2024/05/Social-Image-Blog-Article-Weekend-Reading-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; – this week\u0026#39;s edition kicks off with the news that at a time when brokerage firms\u0026#39; cash sweep programs come under increased scrutiny (and as the Federal Reserve has cut interest rates), Charles Schwab (the largest RIA custodian) continues to slash sweep rates for client cash (down to 0.05%), well below the rates available on other cash-like products, leaving advisors on the platform with the task of determining whether to move (at least some) client cash to higher-paying offerings (whether from Schwab or using emerging cash management platforms) to help clients earn more on their cash holdings and to ensure they are fulfilling their fiduciary responsibilities.\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA recent survey indicates that members of Generation X are struggling more with retirement planning compared to older Baby Boomers and younger Millennials, potentially offering opportunities for financial advisors to help Gen Xers create a plan to \u0026#39;catch up\u0026#39; when it comes to both their retirement savings and their financial confidence\u003c/li\u003e\n\u003cli\u003eAccording to a recent study, 37% of financial advisors are planning to retire within the next decade, opening up potential opportunities for the 48% of advisors who indicated interest in acquiring a practice\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on retirement planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResearch into a variety of flexible retirement income strategies demonstrates the tradeoffs between current safe withdrawal rates, cash flow volatility, lifetime spending, and legacy interests\u003c/li\u003e\n\u003cli\u003eAn analysis suggests that those taking Social Security benefits early to invest them have a high breakeven rate to clear compared to those who delay benefits until Full Retirement Age or beyond\u003c/li\u003e\n\u003cli\u003eWhy taking a systematized approach to determining a client\u0026#39;s retirement income style preferences can help advisors offer a more personalized client experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on advisor marketing:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHow relatively smaller RIAs are pursuing organic growth at a time when M\u0026amp;A activity is receiving significant attention, from expanding the platforms (and audiences) they reach to refining their service models\u003c/li\u003e\n\u003cli\u003eEight tips to help advisors get more \u0026#34;earned media\u0026#34; opportunities and demonstrate their expertise and credibility to prospective clients\u003c/li\u003e\n\u003cli\u003eBest practices for client events, including creating a sense of community and offering opportunities to gather feedback and preferences from clients\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about managing stress:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHow to keep up with the news without getting overly stressed, from deciding how deep to go into particular issues to setting time boundaries for news consumption\u003c/li\u003e\n\u003cli\u003eHow regular self-reflection can help identify potential stressors and begin the process of moving past them\u003c/li\u003e\n\u003cli\u003eWhy separating one\u0026#39;s thoughts from one\u0026#39;s sense of self can help avoid the stress that can arise from \u0026#39;overthinking\u0026#39;\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" sizes=\"(max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Schwab Slashes Cash Sweep Yields\" id=\"schwab-continues-to-slash-cash-sweep-yields-raising-potential-issues-for-rias\"\u003e\u003cspan\u003e\u003ca href=\"https://riabiz.com/a/2025/1/9/despite-lawsuits-schwab-slashes-sweep-yields-89-in-five-months-including-two-cuts-in-december-raising-risks-for-rias-that-dont-sort-cash-experts-say\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eSchwab Continues To Slash Cash Sweep Yields, Raising Potential Issues For RIAs\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Oisin Breen | RIABiz)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA custodian is one of the most crucial vendors for RIAs that manage client assets. From the core custodial services of trading and holding and keeping records of electronically owned securities, to the ancillary technology from trading to (digital) onboarding that custodians provide to help advisors run their business, a good RIA custodial relationship is crucial to help firms attract and retain clients. And despite this range of benefits, RIAs typically are able to access these services without having to pay any direct platform fees, as \u003ca href=\"https://www.kitces.com/blog/yang-xu-tradingfront-ria-custodian-commission-free-trading-net-interest-margin-income-cash-sweep-bank/\"\u003ethe custodians earn money in a variety of other ways\u003c/a\u003e, including in today\u0026#39;s environment what is often a substantial amount of net interest income derived from the difference between the rate paid on RIA client cash held in platform or related-bank sweep programs, and the rate at which they can otherwise invest or lend the money to others (e.g., through margin loans). Which has become particularly important to the custodians as the industry has moved away from ticket charges for trades and is less and less reliant on mutual funds (and the sub-TA fees they historically generated for RIA custodians).\u003c/p\u003e\n\u003cp\u003eIn an apparent move to maintain their net interest income as the Federal Reserve itself cut rates in the fourth quarter, Charles Schwab (the largest RIA custodian) in September cut its cash sweep yield from 0.45% to 0.2%, then cut further to 0.1% in early December, and finally down to 0.05% in late December (at a time when rates on other cash-like vehicles are still significantly higher, with Schwab itself offering money market funds with yields greater than 4%). Nonetheless, Schwab\u0026#39;s relatively low cash sweep yields don\u0026#39;t seem to be leading to an outflow of client dollars, as the firm\u0026#39;s cash sweep balances actually grew 5% to $393.7 billion between August and November of last year (suggesting that some advisors either didn\u0026#39;t notice the change or didn\u0026#39;t think it merited changing their cash management practices). Notably, Fidelity (the second-largest RIA custodian) has made a similar change to maintain its net interest income in the face of Federal Reserve rate cuts, announcing that it is planning to convert the default sweep for RIA\u0026#39;s non-retirement client cash balances from money market funds (with the largest Fidelity money market fund currently carrying a 7-day yield above 4%) to its in-house cash management product, FCASH (which offers a 2.19% yield). Though notably the Fidelity rates, after the change, will still greatly exceed the latest Schwab cash sweep rates.\u003c/p\u003e\n\u003cp\u003eSchwab\u0026#39;s move comes at a time of increasing scrutiny of brokerage firms\u0026#39; cash sweep programs, with LPL Financial, Wells Fargo, and Morgan Stanley facing probes from the Securities and Exchange Commission over the yields they pay direct clients of their platforms (who engage those firms\u0026#39; RIA advice offerings, and then use the firms\u0026#39; brokerage platforms, where choosing a more-profitable cash sweep for RIA clients in the co-owned brokerage firm is a more direct conflict of interest), and plaintiffs filing lawsuits against those firms and Schwab itself. Further, while the fallout from the cash sweep controversy has so far been mostly limited to the brokerage firms themselves, \u003ca href=\"https://citywire.com/ria/news/legal-experts-cash-sweep-practices-are-a-ticking-time-bomb-for-rias/a2450175?re=124167\u0026amp;refea=1921055\u0026amp;link_id=1711963\"\u003esecurities attorneys have pointed out that there\u0026#39;s a potential liability exposure for RIAs as well\u003c/a\u003e. To the extent that financial advisors allow their clients to have uninvested cash sitting in their brokerage accounts and earning almost no interest – either intentionally, or because of a failure to monitor their cash levels – it could be argued that the advisor has violated their fiduciary duty to act in the client\u0026#39;s best interest, especially if the advisor also billed their advisory fee on that cash. Which means that, once the initial wave of lawsuits against brokerage firms has subsided, RIAs could eventually also find themselves the targets of legal action for failing to minimize the amount of clients\u0026#39; cash in low-yielding sweep accounts.\u003c/p\u003e\n\u003cp\u003eWhich ultimately leaves RIAs facing lower cash sweep rates with several potential options. The easiest way to avoid receiving a low interest rate on a cash sweep account is to simply not keep uninvested cash in a brokerage account where it would be subject to those low cash sweep rates, and instead either invest it or move it to a higher-earning cash product like a high-yield savings account, cash management account, or at least trading into a money market fund on the platform. Alternatively, slashed cash sweep rates could be the proverbial \u0026#39;straw that breaks the camel\u0026#39;s back\u0026#39; that drives some firms \u003ca href=\"https://www.kitces.com/blog/ria-custodian-list-best-platforms-small-startup-ria-altruist-axos-tradepmr-eas-pershing-schwab/\"\u003eto look for a new custodian\u003c/a\u003e (despite the labor involved in repapering clients and learning new systems) that offers better yields and would thus drive incrementally higher returns for clients themselves. In any case, for the time being, for those RIAs with client assets at the largest custodians, \u003ca href=\"https://www.kitces.com/blog/cash-management-rising-interest-rates-inflation-sweep-accounts-fintech-fees-aua/\"\u003ehaving a process for monitoring and managing clients\u0026#39; cash levels\u003c/a\u003e may not be just a \u0026#39;nice-to-have\u0026#39; feature to provide extra value for the client, but a necessity for the advisor to fulfill their fiduciary obligations and protect their clients from their custodian\u0026#39;s own business model?\u003c/p\u003e\n\u003ch2 data-nav-title=\"Gen X\u0026#39;s Lack Of Retirement Planning\" id=\"gen-x-grappling-with-lack-of-retirement-planning-survey\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/generation-x-falling-behind-others-in-retirement--study-finds-80844.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eGen X Grappling With Lack Of Retirement Planning: Survey\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Edward Hayes | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAmericans across the age spectrum have faced differing environments when it comes to planning for retirement. While older Americans might have been more likely to work at jobs offering defined-benefit pensions (that don\u0026#39;t require many choices regarding savings rates or investment options on the part of the worker), their decreasing popularity (alongside the rise of defined-contribution retirement plans) has created a different environment for workers in younger generations.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://mybrand.schroders.com/m/35219fe230f74df7/original/2024_Schroders_US_Retirement_Survey_Gen_X_Rpt_FINAL.pdf\"\u003ea survey of 2,000 investors by investment manager Schroders\u003c/a\u003e, those in Generation X (i.e., those currently between the ages of 44 and 59) see themselves as worse off when it comes to retirement planning than older Baby Boomers or younger Millennials. The survey found that 48% of Gen Xers have done no retirement planning and 54% are concerned about outliving their assets in retirement (compared to 40% of Boomers and 50% of Millennials). In addition, only 27% of Gen Xers surveyed said they work with a financial advisor, compared to 37% of Boomers and 31% of Millennials. Further, only 10% of Gen X respondents plan to wait until age 70 to claim Social Security benefits (when they would receive their maximum monthly benefit), with 43% of them saying they don\u0026#39;t want to wait because \u003ca href=\"https://www.kitces.com/blog/social-security-sustainability-trust-fund-benefits-taxes-legislation-financial-planning/\"\u003ethey are concerned Social Security may run out of money or stop making payments\u003c/a\u003e (compared to 24% of Boomers and 37% of Millennials citing this reason), which could limit their retirement spending further.\u003c/p\u003e\n\u003cp\u003eIn the end, while a significant percentage of individuals across the age spectrum have expressed concern about their retirement security, those in Generation X could be particularly vulnerable, as they have spent most of their time in the workforce amidst the decline of defined-benefit pensions but might have been late to making contributions to defined-contribution plans (as potential balance-boosting features such as auto-enrollment are a more recent phenomenon). Which offers financial advisors several opportunities to add value for clients in this group (who might approach an advisor as they realize their potential retirement insecurity and/or after receiving an inheritance from aging parents?), from crafting a savings plan to help them \u0026#39;catch up\u0026#39; on retirement savings in their later working years to considering whether \u003ca href=\"https://feeds.feedblitz.com/~/911176736/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-January-%e2%80%93/despite%20the%20potential%20benefits%20of%20doing%20so,\"\u003edelaying Social Security benefits could be in their long-term financial interest\u003c/a\u003e.\u003c/p\u003e\n\u003ch2 data-nav-title=\"37% Advisors Plan To Retire In Next Decade\" id=\"37-of-advisors-plan-to-retire-in-next-decade-keeping-ma-market-hot-study\"\u003e\u003cspan\u003e\u003ca href=\"https://www.investmentnews.com/goria/practice-management/retiring-wealth-managers-keeping-ma-market-hot-study-shows/258937\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003e37% Of Advisors Plan To Retire In Next Decade, Keeping M\u0026amp;A Market Hot: Study\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Gregg Greenberg | InvestmentNews)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA much-discussed theme over the past several years has been the graying of the financial advisor population, with the pending retirements of many firm founders potentially having an impact not only on their own firms, but also on the makeup of the industry itself (e.g., if a significant number of founders eschew an internal succession and sell to one of the deal-hungry RIA \u0026#39;aggregators\u0026#39;).\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://www.cerulli.com/press-releases/ria-acquisition-opportunities-remain-fertile-as-succession-looms-large\"\u003edata from research and consulting firm Cerulli Associates\u003c/a\u003e, 105,887 advisors plan to retire in the coming decade, representing 37.4% of industry headcount and 41.4% of total assets. Nevertheless, despite the expectation that they will be retiring within the next several years, many have not prepared for the transition, with 26% indicating they are unsure of their retirement plans (suggesting that some of these advisors might end up deciding to sell their firms to an external buyer, as doing so typically requires a shorter planning runway than completing an internal succession). Notably, the percentage of those unsure of their retirement plans rises to 30% for independent RIAs, who face greater concerns about succession and retirement planning compared to those who are affiliated with larger wealth managers, with independent advisors citing challenges in finding a qualified buyer (with 86% indicating this is a challenge), structuring deal terms (63%) and valuing their practice accurately (53%).\u003c/p\u003e\n\u003cp\u003eWhile there could be an influx of advisors looking to sell their practices in the coming years, there appears to be a healthy number of potential buyers as well, with 48% of advisors indicating that they are interested in acquiring a practice. At the same time, these advisors face challenges consummating deals as well, including the investment of time necessary to finalize a deal (cited by 67% of these firms) and negotiation and style differences with the seller (53%).\u003c/p\u003e\n\u003cp\u003eAltogether, these data points indicate that advisory firm founders who plan well in advance for their retirement, whether they intend to complete an internal succession or seek an external sale, can give themselves additional time to prepare their firm, seek a suitable buyer and ultimately end up with a better outcome (and perhaps less stress!) for themselves, their team, and their clients!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Flexible Strategies For Retirement Income\" id=\"the-best-flexible-strategies-for-retirement-income\"\u003e\u003cspan\u003e\u003ca href=\"https://www.morningstar.com/retirement/best-flexible-strategies-retirement-income-2\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eThe Best Flexible Strategies For Retirement Income\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Amy Arnott | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOne of the most valuable services financial advisors offer to clients nearing or in retirement is helping them make the transition from receiving most of their income from a salary to withdrawing money from their portfolio (alongside Social Security benefits and other potential income sources). And with a variety of approaches available for determining how much income a client can take from their portfolio in a given year, advisors have the opportunity to select an option that best fits their clients\u0026#39; priorities (and the ability of the advisor to efficiently manage it).\u003c/p\u003e\n\u003cp\u003eTo help advisors and their clients assess different retirement income approaches, \u003ca href=\"https://www.morningstar.com/lp/the-state-of-retirement-income\"\u003eMorningstar tested several strategies\u003c/a\u003e to determine the upsides and downsides of each approach (using a 30-year retirement horizon, a 40% equity/60% bond portfolio, and a 90% probability of success). For instance, one approach is to take fixed real withdrawals throughout retirement but forgo the inflation adjustment for the year following a year in which the portfolio has declined in value. According to Morningstar\u0026#39;s analysis, this strategy allows for a higher initial withdrawal rate compared to a similar approach that applies inflation adjustments every year (4.2% vs 3.7%) and entails relatively little year-to-year spending change (which might be attractive to retirees who value stability and predictability over maximizing their total spending in retirement).\u003c/p\u003e\n\u003cp\u003eOn the other end of the spectrum is a \u0026#39;Required Minimum Distribution\u0026#39; (RMD) approach, where the IRS\u0026#39; Single Life Expectancy Table is used to determine the percentage of the portfolio that will be withdrawn each year. While this method is \u0026#39;safe\u0026#39; in the sense that the portfolio can never be fully depleted due to a certain percentage being withdrawn each year (though portfolio withdrawals could become quite small if it declines in value over time) and offers a higher initial withdrawal rate than the \u0026#39;fixed\u0026#39; approach (4.7% vs. 3.7%), it also results in the greatest annual cash flow volatility of the different methods tested (because while the percentage withdrawn only changes slightly each year, the amount in dollar terms will vary significantly based on market performance) and typically leaves little money left over (which might be a consideration for those with legacy interests).\u003c/p\u003e\n\u003cp\u003eA middle ground option is the \u003ca href=\"https://www.kitces.com/blog/implementing-retirement-income-guardrails-to-facilitate-the-right-spending-raises-and-spending-cuts/\"\u003eGuyton-Klinger \u0026#34;Guardrails\u0026#34; approach\u003c/a\u003e which allows for upward and downward spending adjustments depending on changes in portfolio value and offers a higher initial withdrawal rate (5.1%) compared to the previous two approaches. While its annual cash flow volatility is higher than that of the \u0026#39;forgoing inflation\u0026#39; approach, it offers retirees greater lifetime spending than this method. Further, compared to the \u0026#39;RMD\u0026#39; approach, the \u0026#34;Guardrails\u0026#34; method comes with less annual spending volatility and a greater terminal wealth (for those retirees with legacy interests), while only slightly trailing the \u0026#39;RMD\u0026#39; method in terms of lifetime spending.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that different retirement income approaches come with varying tradeoffs, whether it comes to lifetime spending, annual spending volatility, or leftover wealth at death. However, a key takeaway is that the flexible withdrawal strategies discussed tend to be superior to a simple fixed withdrawal method (particularly when it comes to the initial safe withdrawal rate), suggesting that advisors can add value not only by choosing a withdrawal rate strategy, but also by \u003ca href=\"https://www.kitces.com/blog/monte-carlo-one-time-vs-ongoing-retirement-planning-probability-of-success-guardrails/\"\u003eanalyzing their clients\u0026#39; unique situations on an ongoing basis\u003c/a\u003e (and implementing adjustments when necessary!).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Delay Social Security Or Claim Early?\" id=\"whats-best-for-retirement-income-delay-social-security-or-claim-early-and-invest\"\u003e\u003cspan\u003e\u003ca href=\"https://www.thinkadvisor.com/2025/01/03/delay-social-security-invest-more-or-buy-an-annuity-whats-best-for-retirement-income/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eWhat\u0026#39;s Best For Retirement Income: Delay Social Security Or Claim Early And Invest?\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(John Manganaro | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOne of the most impactful decisions retirees will make is when to claim Social Security benefits. While some individuals might claim benefits at age 62 or soon after (perhaps because they have little retirement savings and need the benefits to support their lifestyles), others wait until their Full Retirement Age, or possibly until age 70, when they can receive their maximum benefit.\u003c/p\u003e\n\u003cp\u003eWhile delaying benefits (\u003ca href=\"https://www.kitces.com/blog/how-delaying-social-security-can-be-the-best-long-term-investment-or-annuity-money-can-buy/\"\u003eand thereby receiving a larger monthly payment for the remainder of their lives\u003c/a\u003e) can be an attractive proposition for those who can afford to do so, many still decide to claim early, sometimes with the plan to invest some or all of these benefits in the hopes of earning a better return than they would by waiting to claim. However, \u003ca href=\"https://www.pgim.com/dc-solutions/article/breakeven-returns-delayed-social-security-claiming\"\u003ean analysis\u003c/a\u003e by retirement researcher David Blanchett throws some cold water on this approach, \u003ca href=\"https://www.kitces.com/social-security-optimization-course/\"\u003eparticularly for married couples\u003c/a\u003e and those with longer expected lifespans. He found that for individuals, those who live to age 85 and claim early will have an average breakeven return (i.e., the return they will need to achieve on the Social Security benefits invested) of about 7%, which increases to 8% by age 90 and 9% by age 95 (and while clients might note that those breakevens are relatively in line with long-term stock returns, this approach would require an aggressive asset allocation that could result in sharp drawdowns). The breakeven for married couples is even higher (considering spousal survivor benefits), typically increasing the required breakeven return by approximately 1.5% above the breakeven for an individual.\u003c/p\u003e\n\u003cp\u003eIn the end, while the prospect of claiming Social Security benefits before reaching Full Retirement Age or age 70 might be attractive to clients for a variety of reasons (from the assumption that they have a limited life expectancy to \u003ca href=\"https://www.kitces.com/blog/social-security-sustainability-trust-fund-benefits-taxes-legislation-financial-planning/\"\u003econcerns that Social Security will not be able to pay out full benefits in the future\u003c/a\u003e), the ability to \u0026#39;beat\u0026#39; the returns from delaying benefits appears to be a challenging proposition (including for the advisor who would be charged with generating these returns!), suggesting that many clients (particularly those with longer life expectancies and/or are married) could benefit financially from delaying benefits!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Personalizing Retirement Income Strategies\" id=\"taking-a-systematized-approach-to-personalizing-retirement-income-strategies-for-clients\"\u003e\u003cspan\u003e\u003ca href=\"https://www.kitces.com/blog/risa-framework-retirement-income-planning-client-preferences-total-return-strategy-risk-tolerance/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eTaking A Systematized Approach To Personalizing Retirement Income Strategies For Clients\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alex Murguía and Wade Pfau | Nerd\u0026#39;s Eye View)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs average life expectancy has increased over time, so too has the importance for retirees to ensure that they have sufficient income to cover their needs throughout what could be a 30-year (or longer) retirement. While some advisors may rely on a single \u0026#39;favorite\u0026#39; income strategy to recommend to clients, recognizing that retirees actually have a range of preferences on how to source their retirement income can help advisors better develop sensible strategies that clients may be more inclined to follow. And the starting point for understanding a client\u0026#39;s income preferences to help them choose the right retirement income strategy is to identify the client\u0026#39;s retirement income style.\u003c/p\u003e\n\u003cp\u003eMurguía and Pfau suggest the two strongest constructs that help to determine a client\u0026#39;s income preference style are Probability (depending on market returns) versus Safety (sources of income less reliant on market returns), and Optionality (having flexibility to respond to economic developments or changing personal situation) versus Commitment (being dedicated to one retirement income solution). Together, these constructs were used to create a framework that can be used to identify an individual\u0026#39;s \u003ca href=\"https://retirementresearcher.com/landing/risa/\"\u003eRetirement Income Style Awareness (RISA) profile\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor advisors, the RISA framework can be used to determine a prospect\u0026#39;s or client\u0026#39;s preferences, which can then help them design an appropriate and practical retirement income strategy. For example, an individual who expresses a preference for Probability and Optionality would likely appreciate the potential upside from strong market returns and the option to change course as necessary that are offered by a Total Return income strategy. Those who prefer Safety and Commitment may align better with an Income Protection approach, which would involve building a lifetime income floor with simple income annuities. And for those favoring Probability and Commitment, a Risk Wrap strategy (i.e., building a lifetime income floor with deferred annuities offering lifetime withdrawal benefits) could be more appropriate. Finally, those with preferences rooted in Safety and Optionality would likely appreciate a Time Segmentation strategy (e.g., \u003ca href=\"https://www.kitces.com/blog/managing-sequence-of-return-risk-with-bucket-strategies-vs-a-total-return-rebalancing-approach/\"\u003ebucketing strategies\u003c/a\u003e that use less volatile assets for shorter-term expenses, and more volatile assets offering higher growth potential for future expenses).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that by having a structured process around assessing retirement income preferences (whether by using a standardized RISA Matrix assessment or informally assessing where a prospect or client will be on the Matrix), an advisor can begin to develop a retirement income strategy that will most likely appeal to a particular prospect or client. By doing so, advisors can not only add value to current clients by ensuring that the client\u0026#39;s retirement income strategy matches their preferences, but can also attract new clients by offering a more personalized approach to generating retirement income (while perhaps finding the right balance between the level of personalization provided to each client and the time needed to implement different preferences across their client base?).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Here\u0026#39;s How Smaller RIAs Are Growing\" id=\"forget-megamoney-deals-heres-how-smaller-rias-are-growing\"\u003e\u003cspan\u003e\u003ca href=\"https://citywire.com/ria/news/forget-mega-money-deals-here-s-how-smaller-rias-are-growing/a2454374\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Marketing\"\u003eForget Mega-Money Deals, Here\u0026#39;s How Smaller RIAs Are Growing\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Alec Rich | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA major theme in the RIA industry in the past few years has been the active Mergers and Acquisitions (M\u0026amp;A) market, led by a group of (often private equity-backed) RIA \u0026#39;aggregators\u0026#39; engaging in \u0026#39;inorganic growth\u0026#39;, scooping up smaller firms whose founders are either looking to retire or to grow under the umbrella of a larger firm. Nevertheless, there remains a robust population of smaller RIAs pursuing \u0026#39;organic growth\u0026#39; by bringing on new clients (and having current clients bring over more of their assets) through a variety of \u003ca href=\"https://www.kitces.com/kitces-report-financial-planner-advisor-marketing-tactics-strategies-referrals-centers-influence-networking/\"\u003emarketing methods\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAt a time when \u003ca href=\"https://www.kitces.com/blog/marketing-growth-financial-advisor-prospects-different-ria/\"\u003eit can be difficult to compete with the advertising budgets of the largest financial firms\u003c/a\u003e (RIAs or otherwise), \u003ca href=\"https://www.kitces.com/blog/financial-advisor-content-marketing-repurpose-seo-video-podcast-social-media-newsletter/\"\u003eleveraging a variety of platforms to distribute content\u003c/a\u003e has proven to be an effective for many firms to demonstrate their expertise to (and show how they can solve the pain points of) their ideal target clients. For instance, firms are reaching clients and prospects through \u003ca href=\"https://www.kitces.com/blog/client-newsletters-financial-advisor-service-model-marketing-communication/\"\u003enewsletters\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/blog/editorial-calendar-and-template-for-financial-advisor-blogging/\"\u003eblogs\u003c/a\u003e, \u003ca href=\"https://www.kitces.com/blog/financial-advisor-podcast-lessons-tips-equipment-hosting-tools-resources/\"\u003epodcasts\u003c/a\u003e, and \u003ca href=\"https://www.kitces.com/blog/repurposing-digital-marketing-content-advisors-social-media-blogging-podcasts-newsletters/\"\u003esocial media posts\u003c/a\u003e. In addition, advisors are looking to \u0026#39;tried and true\u0026#39; methods such as referrals from clients (e.g., \u003ca href=\"https://www.kitces.com/blog/veronica-karas-captrust-marketing-referral-questions-prospects-network-coi/\"\u003eby asking for referrals after celebrating successes\u003c/a\u003e) and \u003ca href=\"https://www.kitces.com/blog/advisor-referral-marketing-cois-soft-asset-michael-schein-hype-handbook/\"\u003ecenters of influence\u003c/a\u003e (e.g., by finding professionals working with individuals whose money is in \u0026#39;motion\u0026#39;, such as real estate agents or divorce attorneys). In addition to these marketing tactics, some firms are attracting clients by narrowing in on an \u003ca href=\"https://www.kitces.com/blog/ideal-client-persona-financial-advisor-niche-marketing-messaging/\"\u003eideal client persona\u003c/a\u003e and refining their service offerings, offering the highest-value services for their target clients (while potentially dropping other services in order \u003ca href=\"https://www.kitces.com/blog/financial-comprehensive-plans-advisor-time-income-revenue-outsourcing/\"\u003eto avoid the potential time costs of being \u0026#39;too\u0026#39; comprehensive\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eIn the end, while organic growth can be a challenging proposition for some firms in the competitive marketplace for financial advice, the variety of potential ways to reach prospects (and the large percentage of the public that still isn\u0026#39;t working with an advisor!) presents opportunities for RIAs of all sizes to grow in 2025 and into the future without having to rely on M\u0026amp;A. At the same time, strong organic growth also can position a firm well for a future acquisition (by demonstrating the ability to scale effectively and onboard and serve new clients, or an eventual sale (as organic growth remains a key metric when valuing a firm)!\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Kalli Fedusenko | Advisor Perspectives)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven the high stakes involved when choosing a financial advisor, prospective clients will often seek evidence of an advisor\u0026#39;s expertise and credibility, which could come from a friend (i.e., \u003ca href=\"https://www.kitces.com/blog/ways-to-ask-for-referrals-financial-advisor-questions-marketing/\"\u003e\u0026#34;social proof\u0026#34;\u003c/a\u003e) or another source they trust, such as a media outlet they find credible. This latter option offers a potential way for advisors to get their message out to prospective clients (at no hard dollar cost!), though these \u0026#34;earned media\u0026#34; opportunities can require advisors to be proactive.\u003c/p\u003e\n\u003cp\u003eOne way to get the attention of media outlets is to create content worth sharing, which could be research findings (relevant to the advisor\u0026#39;s target client), \u003ca href=\"https://www.kitces.com/blog/paul-g-mcmanus-more-client-more-fun-book-authorship-authority-author-expert-publishing/\"\u003ea book\u003c/a\u003e, or perhaps a rebuttal to inaccurate financial advice being spread online (putting out a press release related to a major piece of content can help grab the attention of reporters as well). In addition to written content, making appearances on finance-related podcasts or webinars can help an advisor gain visibility and the attention of the news media. For advisory firms with a local client base, hosting an event (e.g., a volunteer opportunity) and opening it up to the public can attract coverage from local media outlets. Finally, advisors belonging to membership associations or similar groups can see if the organization curates a list of advisors available to answer media inquiries, which could lead to becoming a trusted expert on a given topic.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that given the hard dollar and time costs involved in advisor marketing, seeking \u003ca href=\"https://www.kitces.com/blog/building-local-brand-leverage-media-public-relations-financial-advisor-marketing-social-proof-exposure/\"\u003eearned media opportunities can be a cost-effective way to gain credibility in the eyes of target prospects\u003c/a\u003e (and serve as material to include on an advisor\u0026#39;s website!). Nevertheless, doing so does take a bit of work to get on the radar of the media to start with, suggesting that just as an advisor can show how they provide value for their clients, they can also demonstrate (through engaging, useful content and incisive remarks) how they can support reporters as well!\u003c/p\u003e\n\u003ch2 id=\"how-to-host-an-effective-client-event\"\u003e\u003cspan\u003e\u003ca href=\"https://www.naylornetwork.com/napf-nwl/articles/index.asp?aid=857102\u0026amp;issueID=102206\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Marketing\"\u003eHow To Host An Effective Client Event\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Elyse Stoner and Angela York | NAPFA Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClient events have long been a \u003ca href=\"https://www.kitces.com/blog/miye-wire-microsoft-employee-benefits-rsu-espp-community-client-events/\"\u003estaple of advisory firms\u0026#39; calendars\u003c/a\u003e and can create closer ties between advisors and their clients (hopefully boosting client loyalty and retention over time) and lead to introductions to planning prospects (whether clients bring them to the event or are encouraged to refer them based on their deeper relationship with their advisor). Nevertheless, the potential time and hard dollar cost of holding such events can sometimes leave advisors frustrated if they don\u0026#39;t see a clear \u0026#39;return\u0026#39; from them (e.g., in the form of new clients).\u003c/p\u003e\n\u003cp\u003eTo start, Stoner and York suggest that the best events are aligned with client interests, reflecting the passions and preferences of the firm\u0026#39;s ideal target client (e.g., an event type many might enjoy or a planning topic important to them) rather than doing a more generic event. Next, effective events often have a collaborative atmosphere (e.g., by incorporating breakout sessions), providing time for clients (and their guests) to connect with each other, allowing them to share experiences and solidifying the advisor\u0026#39;s role as a community builder. Finally, events can be used to gather strategic feedback from clients, not only to get their thoughts regarding the firm\u0026#39;s service or new initiatives, but also to learn more about them (e.g., if an advisor hosts a wine-tasting event, asking clients about their favorite bottle could provide valuable information for the next time the advisor wants to send a thoughtful client appreciation gift!)\u003c/p\u003e\n\u003cp\u003eIn sum, client events do not necessarily have to lead to an immediate influx of prospect referrals to be considered a success (and don\u0026#39;t have to cost a significant amount of money to put on!). Rather, the rewards from an effective client event can come over time, whether in the form of greater client loyalty, an expanded professional network, and/or valuable information that can be used to refine the firm\u0026#39;s services.\u003c/p\u003e\n\u003ch2 data-nav-title=\"How To Keep Up With The News\" id=\"how-to-keep-up-with-the-news-without-getting-overwhelmed\"\u003e\u003cspan\u003e\u003ca href=\"https://hbr.org/2025/01/how-to-keep-up-with-the-news-without-getting-overwhelmed\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow To Keep Up With The News Without Getting Overwhelmed\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Rebecca Knight | Harvard Business Review)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the 21st century, it can be challenging to avoid the onslaught of news sources, from websites to social media feeds to print publications. And while staying abreast of information relevant to the community, country, and world can be a productive activity (\u003ca href=\"https://store.behaviorgap.com/products/focus-things-that-matter\"\u003eparticularly if there\u0026#39;s a\u003c/a\u003e constructive action you can take in response to it), \u003ca href=\"https://www.mdpi.com/1660-4601/18/24/13198\"\u003esome research\u003c/a\u003e suggests that overconsumption of news can be associated with mental stress. Which creates a dilemma: how to consume news in a productive way without spending too much time, mental bandwidth, and emotional energy on doing so?\u003c/p\u003e\n\u003cp\u003eOne way to improve news consumption is to \u0026#39;go deep\u0026#39; on topics that are most relevant to you while only having a \u0026#34;headline-level\u0026#34; awareness of other issues. This practice, along with focusing on sources of \u0026#39;hard\u0026#39; news rather than \u0026#39;hot takes\u0026#39; (particularly when it comes to social media), can help reduce the amount of time spent consuming news. In addition, controlling when news is consumed can also limit the amount of time spent reading it (and thinking about it afterward). For instance, you might reserve a block of time in the evening, well before bed, to see what happened during the day (thereby avoiding interruptions to work and preventing obtrusive thoughts from disrupting your sleep). Relatedly, minimizing the number of news-related interruptions (e.g., cell phone notifications from news organizations) can help prevent the temptation to consume the news outside of the prescribed block of time. Finally, reading the news on paper (e.g., hard-copy newspapers or magazines) rather than online can help you better control what you consume and minimize potential distractions (e.g., the often-toxic comment sections found at the bottom of news articles).\u003c/p\u003e\n\u003cp\u003eIn the end, controlling what news you access as well as when and how you do so can help you strike a balance between the value of being aware of the world around you (and inspire opportunities for action) and the stress that can come from being bombarded with news (or commenters) that are outside of your control.\u003c/p\u003e\n\u003ch2 id=\"know-thyself\"\u003e\u003cspan\u003e\u003ca href=\"https://joylere.substack.com/p/know-thyself\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eKnow Thyself\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Joy Lere | Finding Joy)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eStress is a common part of life, whether it comes from work, home, or the broader world. While it can\u0026#39;t be avoided, understanding the triggers that most frequently cause you stress (and what leads to deeper worry) can help you take proactive action to mitigate them going forward and reduce overall stress levels, suggesting that regular self-reflection could offer significant value.\u003c/p\u003e\n\u003cp\u003eFor instance, you might consider which relationships (personal or professional) drain you rather than provide energy (which might call for a reassessment of how you interact with the former group). Similarly, you can consider the times when you are most unhappy (e.g., what\u0026#39;s happening, what are you doing, and who are you with) and consider ways to avoid those situations. In addition, given that stress can sometimes arise when problems or tasks are avoided, understanding why you are putting them off and considering ways to confront them can help take the stressor off of your plate (even if it might be uncomfortable to do so). Another potentially valuable practice is to consider whether a stressor is within or outside of your control (and then redirecting time and mental energy away from the latter group and towards the former). Further, you can consider whether the goals you\u0026#39;re pursuing are your own (the pursuit of which will likely be more fulfilling) rather than those imposed externally (e.g., societal \u0026#34;shoulds\u0026#34;), which can lead to a never-ending treadmill of trying to meet others\u0026#39; (perhaps assumed?) expectations.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while financial planners are experts at \u003ca href=\"https://www.kitces.com/blog/growing-your-question-game-21-questions-to-ask-clients-and-prospects-and-how-to-structure-them-for-better-client-engagement/\"\u003easking clients deep questions\u003c/a\u003e to better understand their goals and concerns when it comes to money, turning the tables and engaging in self-evaluation can be a valuable way to reveal what causes oneself to be stressed and to start down the path of making changes to reduce these burdens!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Thinking Your Way Out Of Problems\" id=\"thinking-your-way-out-of-problems-doesnt-work\"\u003e\u003cspan\u003e\u003ca href=\"https://dariusforoux.com/thinking-your-way-out-of-problems-doesnt-work/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eThinking Your Way Out Of Problems Doesn\u0026#39;t Work\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Darius Foroux)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBeing a thoughtful person can be a positive trait, for instance in being conscientious and considerate of others. However, this can potentially go to an extreme, where it\u0026#39;s tempting to constantly overthink matters (\u0026#34;was that [seemingly innocuous] comment I made in the meeting actually awkward?\u0026#34;), leading to regular stress.\u003c/p\u003e\n\u003cp\u003eOne way to start breaking the overthinking habit is to engage in the mindfulness practice of \u0026#39;observing\u0026#39; your thoughts. For instance, when a stressful thought arises, you might consider whether it is valid and relevant and, if not, try to set it aside and move on to more important matters. The second (and sometimes also challenging) step is to separate \u0026#39;you\u0026#39; from your thoughts. By recognizing that intrusive thoughts and a restless mind are natural occurrences, you can be more forgiving of yourself rather than treating the thoughts as a judgment of your character or decision-making. This can then help you turn your attention to the \u0026#39;real world\u0026#39; outside of your head and live more in the moment, whether at work, home, or otherwise.\u003c/p\u003e\n\u003cp\u003eAltogether, while \u003ca href=\"https://www.kitces.com/blog/stop-worrying-manage-stress-notes-exercise-meditation-sleep-diet/\"\u003eit can be tempting to overthink a given issue\u003c/a\u003e (whether financial planning-related or otherwise), living life \u0026#39;in your head\u0026#39; typically is less fulfilling (and more stressful) than being more \u0026#39;present\u0026#39; throughout the day. And while these practices can take time to develop (given the constant pull of the mind), being aware of your thoughts and separating them from your self-image can help you break free of overthinking tendencies (while still maintaining a certain level of conscientiousness and consideration of others!).\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (January 18–19)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-4bd91a4cfe4b00f323808fe8-=\"\"\u003e\u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "37 min read",
  "publishedTime": "2025-01-17T14:00:12-05:00",
  "modifiedTime": "2025-01-17T18:19:49Z"
}
