{
  "id": "313d0b7e-f667-4b04-9a5d-942401f53ce7",
  "title": "#FASuccess Ep 436: Hiring A Branding Firm To Figure Out The Best Way To Connect With Your Ideal Clients, With Nicole Gopoian Wirick",
  "link": "https://feeds.feedblitz.com/~/917825477/0/kitcesnerdseyeview~FASuccess-Ep-Hiring-A-Branding-Firm-To-Figure-Out-The-Best-Way-To-Connect-With-Your-Ideal-Clients-With-Nicole-Gopoian-Wirick/",
  "description": "Welcome everyone! Welcome to the 436th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Nicole Gopoian Wirick. Nicole is the president of Prosperity Wealth Strategies, an RIA based in Bloomfield Hills, Michigan, that oversees $70 million in assets under management for 40 client households. What's unique about Nicole, though, isRead More... The post #FASuccess Ep 436: Hiring A Branding Firm To Figure Out The Best Way To Connect With Your Ideal Clients, With Nicole Gopoian Wirick first appeared on Kitces.com.",
  "author": "Michael Kitces",
  "published": "Tue, 06 May 2025 11:02:58 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Financial Advisor Success Podcast",
    "OPTIN: One Page Business Plan (BAR)",
    "OPTIN: One Page Business Plan (SLIDE IN)"
  ],
  "byline": "Michael Kitces",
  "length": 75193,
  "excerpt": "Welcome everyone! Welcome to the 436th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Nicole Gopoian Wirick. Nicole is the president of Prosperity Wealth Strategies, an RIA based in Bloomfield Hills, Michigan, that oversees $70 million in assets under management for 40 client households. What's unique about Nicole, though, is",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Welcome everyone! Welcome to the 436th episode of the Financial Advisor Success Podcast! My guest on today's podcast is Nicole Gopoian Wirick. Nicole is the president of Prosperity Wealth Strategies, an RIA based in Bloomfield Hills, Michigan, that oversees $70 million in assets under management for 40 client households. What's unique about Nicole, though, is how she hired a branding consultant soon after going out on her own as an independent advisory firm to help her create a unique brand identity that reflects her approach to financial planning, has helped her attract and connect with clients who fit her ideal client persona, and now serves as the filter for evaluating whether any marketing strategy if even worth her time to pursue. In this episode, we talk in-depth about how the branding consultant encouraged Nicole to first take a step back and explore big picture questions for what she wanted from her firm (such as what an ideal day would look like for her) rather than just starting with the characteristics of her target clientele, how Nicole (based on the results from this exercise) then created her \"brand DNA\" (which as Nicole puts it is \"compassionate conversations coupled with planning tenacity\") that serves as the bedrock of both her business plan and her marketing plan including  social media and even speaking engagements (and helps her save time by avoiding marketing tactics that don't fit with her brand identity), and how Nicole incorporates her branding and the language on her website to attract prospects who fit her ideal client persona of those with $2 million to $10 million in investible assets and an interest in going deep on complex financial planning issues (particularly around estate planning, legacy planning, and philanthropy). We also talk about how Nicole, from the early days of her firm (when she had fewer clients and more time) proactively reached out to centers of influence (such as attorneys and CPAs) and tapped into her own personal network to build connections that have led to client introductions over time (even though most didn't produce immediate results), how Nicole's planning focus on going deep into estate and legacy planning issues has built a high level of trust with her clients that has led to subsequent referrals to other members of the same family, and why despite all the branding and marketing effort, Nicole does not intend for her website to be the first interaction that brings a prospect in to her… but is crucial nonetheless because even referrals still want to validate by checking her out online to affirm that she would be a good fit for them after being introduced. And be certain to listen to the end, where Nicole shares how she is evolving her branding to be less founder-centric as she seeks to expand her advisory team beyond herself, how Nicole uses executive summaries (presented to clients in PowerPoint) to explain financial planning recommendations (leaving the output of planning software as an appendix for the few clients who do want to dig into the numbers), and how Nicole handled the ups and downs of breaking away from a larger advisory firm to start her own from scratch, including how she found motivation from being active (for example, by successfully onboarding a new client) rather than just tracking her marketing efforts alone. So, whether you're interested in learning about hiring an external branding consultant to shape an advisory firm's brand, putting a firm's \"brand DNA\" into practice in marketing, or how going deep into estate and legacy planning can help build a high level of trust with clients, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Nicole Gopoian Wirick. Michael Kitces is Head of Planning Strategy at Focus Partners Wealth, which provides an evidence-based approach to private wealth management for near- and current retirees, and Focus Partners Advisor Solutions, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth. In addition, he is a co-founder of the XY Planning Network, AdvicePay, fpPathfinder, and New Planner Recruiting, the former Practitioner Editor of the Journal of Financial Planning, the host of the Financial Advisor Success podcast, and the publisher of the popular financial planning industry blog Nerd’s Eye View through his website Kitces.com, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession. Read all of Michael’s articles here. Never miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email: Resources Featured In This Episode: Nicole Gopoian Wirick: Website | LinkedIn Who Not How: The Formula to Achieve Bigger Goals Through Accelerating Teamwork by Dan Sullivan Rebuild FPA MediaSource Advyzon MoneyGuide Are you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast? Fill out this form to be considered! Full Transcript: Michael: Welcome Nicole Gopoian Wirick to the \"Financial Advisor Success\" Podcast. Nicole: Hi, Michael. Thank you so much for having me. I'm excited to be here with you today. Michael: I'm thrilled to have you joining us today and to get to talk a little about marketing because I find most of us in the advisor world, marketing is not our natural space. Most of us tend to come up through more of the sales end, like get out there, prospect. It's a \"contact sport\" as it was taught to me. You measure activity in terms of how many contacts you make, right? Like cold calls, you picked up business cards, you walked away with from the networking meeting, and most of us were not really trained in the marketing side of things. And in our business, as I learned it, marketing makes the phone ring. Sales is what you do when you answer the call. In our business, the idea that the phone rings is like the punchline to a joke. It's like going fishing without rods and hoping the fish will just jump into the boat if you wait long enough, because most of us aren't wired as marketers. And I know, as you launched and built a firm, you took a different approach of what happens when you actually hire a marketing branding firm, help you figure what the marketing should be and who you should go after and then how you are going to differentiate yourself for them. Because Dan Sullivan and Ben Hardy have a now very popular book called \"Who Not How\" that kind of highlights sometimes the key is not figuring out how to do something like marketing. It's figuring out who you should hire to do it with you or for you instead. So, I'm excited to talk today about how you went into launching a firm like building the marketing and brand on it when you went out on your own and even just how you find someone who can help you do it and make sure that it comes out well. Working With An External Partner To Create Prosperity Wealth's Brand DNA [05:12] Nicole: Sure. So, Michael, I couldn't agree with you more. And it was an area that I also did not feel terribly well-versed in. And I recognized that I needed help and I recognized that early on. I knew I wanted it, it being the firm, to be different, but I didn't know what \"it\" should necessarily look like. I didn't know how to build it myself and I knew I needed help. So, anytime I've ever wanted to get help with something specific, I've always sort of turned to my network. And through a mutual contact, I knew a gentleman from Rebuild in Detroit and connected with him to see if he would be interested in helping me go through this marketing and branding exercise for the new firm. And it was really scary. The reason it was so scary is because I was a brand new firm. I had zero clients. I had zero dollars in the bank. And to make an several thousand dollar investment at that time was a really big leap, but I knew it had to happen. So, I am so grateful for the experience and excited to tell you more about it. Michael: So, I guess, first, just so we have context, paint the picture of what the situation was. Are you brand new to the industry? Are you going out on your own having industry experience but have to build a new firm from scratch? What was the context? Nicole: Sure. Yes. So, I started the firm in 2019, and I had recently left a much larger RIA, a billion-dollar plus RIA to take some time and ultimately decided that I did want to start my own RIA. So, I did have experience, but I didn't have... I wasn't new to the industry. Michael: You didn't have to market yourself. You're in a big firm. They make the website and make the marketing. Nicole: Yes, exactly. I didn't have a clue how to do any of this. I had to figure it all out. And in connecting with the ReBUILD industry, the first thing I did was... I didn't know what to do. I didn't know how to prepare. I'm a planner, so I wanted to prepare for these meetings. They're like, \"You don't bring anything, just come.\" So, I sat in this big room with these marketing experts, and I'll never forget. I came in in my best navy suit because now I'm a representation of my own brand. And here you have these really fun marketing guys who are in really cool jeans and sneakers, and they're kind of looking at me. So, that was initially really, really eye opening. It was like, \"Okay.\" So, they started asking me questions just about myself, and they wanted me to tell stories, \"Tell me a time when...\" And I would tell them a time when. And they would ask me... It was all about storytelling, about who I am, about my approach to planning, about how I felt that business should be done, about who I wanted to serve, about what fulfilling client experiences were to me. And we just talked for a couple of hours and they took notes. And that was the basis for building out the key components of my firm's brand DNA. Michael: So, they were just going through—I guess, even to use the advisor language—a discovery questionnaire as it were of all those things like who you are, your approach to planning, how you felt the business should be done, who you wanted to serve. So, I guess I'm wondering, how much clarity did you have on these questions? I mean, did you already know, \"This is what I want to do and this is the people I want to serve and this is how I want to serve them. And I know where I'm going. I just need you to make me a really good website.\" Is that or was that part of the challenge in figuring out the answers to their questions in the first place? Nicole: That was definitely part of the challenge. So then we had to back it off, right? So, it was like, \"Tell me about a client you enjoyed working with. Tell me about a really good day for you. Tell me what that looked like. Tell me when you're happiest at work. Tell me what you're doing.\" Those type of questions to really narrow...and actually the branding exercise wasn't even about the website. They didn't even build the website for me. So, isn't it funny? We immediately, as advisors, want to jump to the website. I do the same thing too. I'm like, \"When does the website happen, Michael?\" Michael: Yeah. I need a business card, right? I need a tangible deliverable. I know I had a marketing process because there's a business card. Nicole: That's exactly right. And I was very much looking at it through that paradigm. I'm like, \"But does this go on the website?\" So, it was so much more abstract than that. I remember when they said, \"In your past work experience, tell me about a really happy day for you.\" And I had done some great work for a client, and they were so appreciative. At the time, I was getting married and we were having a big...we were in a big staff meeting, and the client brought me...it was very small like a nominal gift for my wedding as a token of their appreciation. And that was so moving to me that someone would make the effort of going out and buying something special for me that they thought I would like and making a special effort of bringing it to the office to give it to me. It was just a very touching and moving experience that stuck with me for years and years and years thereafter that someone would care enough about me and appreciate me so much that they would want to do that. So, the relationship piece is really important to me in my practice. And I didn't say that to the branding people because I didn't have the capacity at the time to be able to do that, but I could tell that story of why that was a really good day and why it was meaningful for me to have my work recognized on a deeper level—we're all busy—so someone would take the time out of their schedule to make that effort to do something special for me and execute it just really stuck with me. So, although I couldn't say at the time, I could tell the story and that story got integrated into a piece of the brand DNA, which focuses on relationships and being able to have compassionate conversations with clients, which is a really important piece of my practice. Michael: So, I'm struck as you're sharing some of, I guess, the stories or the questions that they asked you to prompt the stories, right? Tell me when you're happiest, a good day at work, who's a good client or what was a good client for you, your approach to planning. It's not, \"Nicole, tell me the average income and asset, career of the person that you want to serve.\" Does that show up later or just that's not how they went about the process? It was just very built around who is enjoyable for Nicole to work with and how does she work with them in an enjoyable way, and that's your brand. Nicole: Yeah, so I've done those exercises, too, historically Michael where... What is the demographic? Maybe it's gender-based. Maybe it's income-based. Maybe it's profession-based. Maybe there's some common thread running through that ideal target prospect. So, no, none of that. None of those types of descriptors came into the elements of the brand DNA. The brand DNA is about you and the firm, not the ideal client. That comes way, way, way later, but the brand DNA is about you and the brand, because if you are true to that brand DNA and it really is, sort of, the paradigm that I see all communication going through, then you're going to attract the ideal client. The Key Elements Of Creating A Firm's Brand [14:25] Michael: So, what did you end up with as you went through the process? I mean, is there a brand DNA document now? Is there a written... Nicole: Yes. Michael: ...outcome of the brand? Okay, so what is that? What did you end up with at the end of this question and answer or storytelling process? Nicole: So, in the beginning, you go through this storytelling process and it was very emotional. You have to be very vulnerable throughout the process, and you have to be honest with yourself or else it just is a cookie cutter financial advisor brand DNA and everyone's looks the same, right? And we're not all the same, and they all should be different, because we're all different. So, you have to be really honest with yourself as you're working through it. But after you do all those storytelling, you come back and they identify the key building blocks of the brand and then they identify the benefit derived from those building blocks and then they go so far as to identify the brand outcome or the brand promise. And that all is then what's integrated into the communication, the messaging. The building blocks inform the outcome of what you want it to be and what it's going to look like, so that every... I was very intentional about how I didn't want my messaging to be the same as everyone else's, and I think a lot of advisors feel that way, at least a lot of them that I've talked to. They feel their business is unique, and the messaging should be also. It should be a reflection of their business, their brand, their beliefs, and I really wanted that to come through and to translate in a way that was unique to me. Michael: So, what did they come up with? What are your brand building blocks, your brand promise? Nicole: Yeah. So, it's sort of evolved through time, which is good, and it's supposed to. And I've actually just gone through a second iteration of those key components of the brand DNA. So, one of mine is compassionate conversations coupled with planning tenacity. So, that brings the two unique parts of me, which are that I really love the client relationship. And that was evidenced by that story I told, which almost a decade later is very, very meaningful to me. So, that relational component was really important, the ability to have an open and honest, compassionate conversation with clients, but that wasn't it alone. It was also coupled with the planning tenacity to tackle client issues, to go through the planning process, to handle some more sophisticated or nuanced planning needs, given my background. Those were also important components. So, marrying those two, the compassionate conversations coupled with the planning tenacity, was a really key component that I got through working with these folks. Michael: I like just the language, right? Compassionate and tenacity are not quite words we typically hear in the advisor domain, and it kind of describes things that do overlap to what we do, right? We try to [inaudible 00:15:34] client conversations. We try to make sure we follow through and do the things that we say we were going to do, but I am struck even hearing it. And bless the good marketers who are good at marketing and finding those words. I'm like, \"Compassionate conversations coupled with planning tenacity,\" I'm like, \"Okay, I think there's kind of a unique ring to that for actually being to describe what we do in a little bit of a different way.\" Nicole: Yeah. Well, thank you. So, that was certainly something that came through a few iterations. So then once you kind of understand that one component of the DNA, then you work through what are the benefits of the planning tenacity and the compassionate conversation, and then what is the desired outcome, which of course is a successful advisory relationship. That's what we want. And then what is the outcome from a client perspective? And then you have to use the imagery to show that visually, which is something I wasn't able to do on my own, and I did need help with that as well. Michael: So, how do you show that visually or how did the branding folks figure out how to show that visually? We all go through this. And when we're done, you'll have a financial plan. How do I show that? I can show the financial plan booked, but that's not very exciting. The benefit is you'll have peace of mind. What's a picture of peace of mind look like? Nicole: Yeah. So, I think that's really subjective, right? I think that's subjective to each brand in particular. What does peace of mind mean to you? So, you find an image in working with marketing folks, web design folks. I'm a firm believer in...certainly you can do these things yourself, but for me, it was important to bring in experts, because this is not my strength either. I do not have a background in marketing. I know that I probably couldn't build a website if I tried, although I understand they're pretty easy to do these days. But even still, it was a path I did not want to go down. So, I knew I wanted and needed help to really bring the branding work alive visually through the website, through other communications, and really make sure that everything was aligned through social media. I think the branding is sort of the first step, and it needs to be really solid. But then the branding needs to... The brand work flows through to the website. The brand work flows through to your social media if that's something you do. And the brand work flows through to client communications. And if I'm being really diligent, the branding should be in the back of my head with every client email I write, with every communication that Prosperity puts out into the world. I should have that brand work in the back of my mind, and it should all be sort of coming through as a furtherance of those principles. Some days are better than others. Michael: So, are there other brand DNA principles or statements that came through in addition to compassionate conversations coupled with planning tenacity? Nicole: Yeah, so that was a big one. That was one of linchpins. And then knowing your building blocks was another one, right? So, so many times I had worked or met with prospects who didn't necessarily understand the complexity of their financial situation, and they were challenged in putting the pieces together. And that was an area where I felt I could really help folks who had some sophistication and maybe needed some assistance breaking down those silos of their financial situation. So if they were looking at their investments in a silo, maybe they were looking at their estate planning goals in a silo, their business goals in a silo, their risk, their tax management, etc. So, knowing those building blocks and breaking down the silos became another key theme that ran through some of our discussions and something that kind of emerged. And that came from the, \"What do you like to do, Nicole? What's a good day for you?\" A good day for me is a day when I'm able to kind of put these pieces together. I'm a lawyer by background, so I really love learning about a client and identifying potential issues, sort of issue spotting, and then coming up with potential strategies or solutions after going through that issue spotting exercise. And then many times, that's like breaking down the silos. On a good day, I'm able to break down those silos. I'm able to spot issues and come with strategies and solutions. That's fulfilling to me. That's a good work day for me. So, that kind of came through some of these discussions. Michael: Okay. Were there others that you can share? I'm fascinated by these, compassion conversations, knowing you're building blocks. What else came through? Nicole: So, one of the other ones was finding your prosperity and this idea of what is prosperity. I named my firm Prosperity, so it did resonate with me, but I kept coming back to, \"What does prosperity mean and why?\" and I just kept kind of circling around…it means something different to everyone, so I can't define prosperity for someone else and that's okay. I shouldn't. I do believe people need to define it for themselves, but what was fascinating to me about prosperity, which was that, when there is prosperity, I found there was a sense of peace that came over people's lives. And it was that peace of mind, that peace to be able to care for those you love, that peace of knowing that you can live a life that you value. That sense of peace was really interesting to me, and I kept coming back to peace being universal but the prosperity looks different for each individual. Michael: And then what was the... I think you said there was a brand promise wrapped around this. Nicole: Yeah, so the brand promise of finding your prosperity is living a life you value, taking care of those you love. Michael: Okay. Nicole: Sleeping well at night. The brand promise doesn't have to be fancy, but it has to resonate. Connecting The Brand DNA To Nicole's Ideal Client Persona [25:15] Michael: Okay. So, I get it at a high level, these principles or views around the business and what's meaningful for you and taking the things that you enjoy and expressing them into...therefore, these are the things I want to be doing. How do you then connect that to who are you going to serve? Who are you actually attracting and going to work with who will hopefully respond to these words and have enough money to pay you? Nicole: So, for me, it's not about a specific client demographic. It's more about a persona. So, that conversation we just had about peace, you could have that conversation with someone, and they might be totally turned off, right? They might not understand it. It might be too philosophical. It just simply might not resonate with them, and that's okay. That's just not my client. Someone that would be an ideal client for me, here's that conversation and they breathe a sigh of relief and they think, \"Wow, she really gets it. She gets me.\" I want to sleep well at night. I want that sense of peace that comes from prosperity in knowing that I can live a life of my choosing and knowing that I can take care of myself and the ones I love. I don't mean to not answer your question, but there's not a demographic. I can't say. It's retirees, 65 plus who likes to go boating. It's not about that for me. Michael: Okay. But, I mean, look, there's lots of people up and down the financial spectrum who would love to find financial peace and feel their loved ones are taken care of and sleep well at night. And the reality is those things aren't happening in their life because they don't have enough money to meet their goals, and that's producing a lot of financial stress. That's an unfortunate challenge, but I'm like, \"I can't necessarily help you if you don't have resources in the first place to plan around.\" Nicole: I understand what you're saying now. So, the other piece of it is that, yes, this is a business and part of being in business does mean making money and being able to support my family. So, ideally, in going through some of this, I identified that $2 million to $10 million investible asset space as being a sort of ideal client range, because the planning tenacity piece comes in, too, right? So, part of what I enjoy and where I think I can add significant value for the right client is through my desire to really dive into some of those complex planning issues, especially with maybe some more complex estate desires, legacy transfer desires. Even charitable planning, that emerged through the process as being an area that I really enjoy working with and working on, because I myself am philanthropic and it's something that I enjoy and I found that clients who share that same desire for philanthropy but want to really dive into more efficient ways to give from a tax perspective, from an estate legacy perspective have become great clients, and we share those values. So, that became sort of very clear as well. And when you have that sort of mindset, typically this is someone who has some wealth who desires that more sophisticated strategy and wants to give. The same thing with multi-generational wealth planning. That's something that there's typically wealth if planning on how to transition it to the next generation and beyond is a concern or is of importance. I do want to make clear though, we didn't start there. That's kind of where you end, but that's not where you start in this conversation, at least it wasn't for me. Michael: Because the starting point was very sort of you-centric, Nicole-centric. What do you like doing? Where do you enjoy spending your time? Where do you want to show up? And then we're going to draw the proverbial Venn diagram of like, \"Okay, there's a circle with you. There's a circle of people who can afford what you do. And now we're going to try to find the overlap between these two circles to now draw your ideal clients.\" They have the financial wherewithal complexity, and they fit the things that you enjoy and want to do in the first place. Nicole: Yes, I would say that is absolutely correct. How Prosperity Wealth's Brand Has Changed Over Time [30:40] Michael: And you said then it's evolved over time. So, what's changed as this has lived on? Nicole: So, it's been about five years now, and some of those key principles are still very solid, but what's changed is that... I'm sort of at a crossroads, Michael, in that I'm deciding what the future of this firm looks like. And initially the thought was it's me. I am the advisor. So, it was very Nicole-centric and Nicole-focused. That has changed over time as I'm considering expanding, as I'm considering potential new advisors with paths to partnership. And it can't just be about me. It has to be a bigger picture than just me. So, that's been a shift that's been really hard, especially when you build something from the ground up. And in many ways, it feels like your baby. So, you have to let go of some of that, which I am working through, because I do think it's what's best for the clients and what's best for the firm. Michael: So, what changes in that regard? Because I'm noting, for better or worse, it's not Wirick Financial Planning. Nicole: No, right. I didn't want it to be. Michael: So then what's changing as you start thinking about what does it mean when the brand is less focused on Nicole? Nicole: So, on my website previously, my face was the first thing you saw on the landing page. It felt very personal. It felt like a very personal invitation to come learn about my business. But as your business grows, it's about more than just you, right? So, having your face on that landing page maybe no longer makes sense, and that can be kind of difficult to let that go. Michael: Yep. And the driver for you was, \"I'm starting to think about needing to hire other advisors, so I want to make this shift.\" Nicole: Yes, I wanted it to be less about me and more about the firm while still having that personal touch sort of flow through but just in a less Nicole-centric sort of way. Michael: So, I guess, help us visualize what this marketing branding process ended with or culminated. You're going through all these questions to make your brand DNA. I'm assuming it's the documents that kind of has key statements. You've identified you wanted $2 million to $10 million investable asset clientele to kind of have the complexity and financial capability that fits the work you want to do. I'm like, \"Okay. So, you've kind of figured out what you want to be and who you want to go after. Now do we get to make a website?\" Nicole: You're really excited about the website, Michael. Michael: I'm excited about the website because, \"Okay, but when do we get down to where we...\" Nicole: Yes, I hear you. Michael: \"...do our thing so clients will show up?\" Nicole: It is a brand guide, and it walks through some of these things that we're talking about. It also has visual images as a suggestion for what aligns with the brand messaging. It has colors. It has some icons and things that were then...although they did not create the website for me, I took this sort of brand book and then hired a web designer to take this and create a website that aligns with those key components and bring them to life on a website. So, yes, once you do the brand work, once you get sort of the brand guide, once you understand the brand DNA, the next step is to turn it into marketing collateral. And one of the chief components of marketing collateral is, of course, the website. Michael: Okay. And so then on the website, these sort of words and phrases start to show up. Nicole: They start to live. Yes, they start to live there. Michael: If I go to the website, I can see homepage, at least when we're recording reads, \"Planning with a personal touch.\" So, we're in with the connections. And Prosperity is an independent wealth management firm specializing individuals and families with $2 million to $10 million in assets, so it's right there. It's on the homepage just immediately below the fold. So, we're all getting clear early on about who we go after at the end of the day. Nicole: So, one of the things that came up... And you're absolutely right, Michael. One of the things that came up, which is just above what you just read to me in this sort of second round of brand work is that another thing that I really enjoy is being able to take complex financial topics and make them understandable and approachable for clients. If I can do that, that's another really good day for me. That is fulfilling to me, because a lot of what we do can get very complicated, and it can be easy for us to fall back on our financial planning words that a really smart client might not understand. So, when I see that light bulb go off for the client and I explain something that is sort of complex in a way that is approachable and understandable, I feel great. So, that's where financial intricacies are approachable and understandable strategies are born. That was sort of a second round of going through this. That didn't come through the first round of the branding exercises, but it was something that, in the last few years, I've really leaned into and tried to make sure that every client experience has that, because we've all sat in meetings with folks... Well, I shouldn't say all, but I've sat in plenty of meetings with folks where the eyes just kind of glaze over and you're like, \"Oh, they're totally gone.\" Michael: Right, right, right. I'm guilty of probably a disproportionately high number of those since I like to bring very long financial plans into meetings. Nicole: So, we've all been there, right? I've been there too, and it's like, \"Okay, how do we get them back?\" So, I really want to lean into that. It's like when I go to the doctor and they're talking to me using words that I don't understand and I'm a pretty bright person, I'm like, \"I don't get it. You have to explain it to me differently,\" that type of thing. I want it to be approachable, understandable, obtainable. Michael: And I'm struck as I now scroll through more of the website, hearing this, the words start showing up or how we work, it's more than just business, because we're getting back to relationships. What we do, we blend financial expertise and planning tenacity. They're across multiple disciplines, estate planning, trust administration, advanced tax, philanthropic giving. So, now I'm kind of reinforcing, you don't hear a lot of people with very limited financial means where their struggle is trust administration, advanced tax, and philanthropic giving. There's ways we can say we're focused on somewhat more affluent clientele without necessarily using the words when you just start getting into, \"Well, here are the problems that we help with.\" These are problems that are more common with multimillionaires than others, which is the point of speaking to them without having to say you're speaking to them. Nicole: Absolutely, Michael. The Importance Of Remaining On-Brand When Answering Media Requests [39:06] Nicole: So, I told you I started this business right before COVID, which in hindsight is really interesting, but we didn't know at the time. But there was a while where there wasn't a whole lot of activity. So, I was really looking to get myself out into the media, out into the world, share the message of myself and the firm. And I was answering a lot of press requests that came across my desk. Basically on any sort of financial topic that came across, I would reply. Michael: Where were these press work? Where were these wonderful, magical unicorn press requests coming across your desk from? Nicole: Yeah. So, they came through the Financial Planning Association's central media hub [FPA MediaSource]. I don't know if I'm saying that right. So, I'm sitting there twiddling my thumbs, and I'm answering these press requests. And I wasn't necessarily looking at it through the lens of my branding work. I was looking at it through the lens of this reporter needs a little commentary on X, Y, or Z topic. And some of the replies were probably a little off-brand. And I didn't recognize that in the fact. But at the end of the article, they'd always reference you and have a link to your website or email address. And I did have people reach out to me. And many times, they were not ideal clients, but I would spend a little time with them because I felt it was the right thing to do. But from a time perspective, probably not the best business decision long-term. So, now I am much more selective about the type of commentary that I'm making, trying to really align it with the ideal client persona. Michael: Can you give us an example of one, at least in retrospect, \"Oh, that probably wasn't a good media call or interview to have done\"? Nicole: There were a couple about budgeting that weren't really applicable to my ideal client. Michael: Okay. Okay. So, yes, I can give my two cents about budgeting and be helpful. And then if this goes really well and I get a lot of media visibility, I'll get a whole bunch of people who call me and ask for budgeting help, which is not ideal when I was trying to work with people with $2 to $10 million. Nicole: Correct. Certainly some of them need budgeting help in a very different way. Yeah. Michael: Same principle, more zeros. Nicole: Yeah, yeah. Michael: So, that helps to sort of connect in context. If I want to work with a certain level of client affluence in deep complex planning issues, I should probably be taking media queries for publications and situations that deal with more financially affluent clients with more complex planning issues, not necessarily general budgeting that may not hit my target. Nicole: Correct. Michael: Okay. So, that's what you mean when you say filtering through the brand of, is this even a media opportunity that's going to put me in front of the people that I want to be in front of? Nicole: Absolutely. And I did do several of those because every time that I haven't been true to looking at outreach or looking at an activity through the brand DNA, I found myself truthfully, Michael, feeling frustrated after the fact of this was not a good use of time, as I'm in business. I'm trying to grow a business. This wasn't a good business building activity per se, because it didn't yield a result that was aligned with what I'm trying to accomplish. So, this branding guide has really, when I'm true to it, really keeps me on track and focused. Michael: So, it almost sounds like the...because I guess the branding guide for you, it's not just like, \"Here's the words we use in our website and the hex code for the color of purple that we use.\" This is the marketing plan lens filter for you of, if this isn't going to get to the people that I'm trying to get to with my brands, if this isn't going to put me where my ideal clients are and let me show up the way that I show up with my brand where I have compassionate conversations coupled with planning tenacity, if I can't show up for the right people the way that fits with my brands, then that almost in of itself defines was that a good media call to take, was that a good networking meeting to go to. Nicole: Yes. It really has become the bedrock of my marketing plan, of my business plan, of my social media outreach, of some of the speaking engagements that I've done. It's become the lens and through which I make decisions about how to...time is a resource and it's a limited resource. We all only have so many hours in a day and how we choose to allocate that time, in my opinion, should align with our business goals. And if we have misalignment, we're not being efficient with one of our greatest resources, which is our time. Michael: And so tell me again. So, what was the cost to go through this branding exercise, create your brand DNA document? Nicole: I don't know if I can disclose that, but can I say it was several thousand dollars five years ago? Michael: So, a thousand, not tens of thousands. Nicole: Not tens of thousands, several thousand. Michael: Okay. Okay. And this is in startup phase where...? Nicole: This is in startup phase when there's zero money in the bank. Michael: And I guess, per the earlier comment, this wasn't for them to build your website. This was to make... Nicole: That was a separate engagement, Michael. Michael: It was a separate one. Then you got to go spend a couple thousand dollars more to actually get a website. Nicole: Correct. How The Branding Exercise Helps Nicole Attract Her Ideal Target Client [45:21] Michael: So then help us understand more about what came next, right? I'm going back to, I guess, 2019, 2020 is we do the brand DNA guide. We then go hire the firm to make the website that embodies the brand and the messaging that we want to hopefully connect with the prospects that I want. Cool. Now I have a brand-new firm with an awesome brand and no clients yet. Nicole: Yes, right. Michael: So, what's next to actually get said beautiful brand out to the world so business starts happening or the phone starts ringing or what...? Nicole: So, believe it or not, most people don't come through the...in my experience, most people don't come through the website. Most prospects don't come through the website. I have had a few who have Googled financial planner, Detroit, Michigan, or Detroit suburb, and found my website and called me that way. Total strangers, total cold introduction. And that is sort of interesting, but that is not typical. That is rare. And if that should happen, then great. You can't plan on that obviously or build a business plan around it because it's one of those things, but it has happened a couple of times. More typically, it starts with then you have your network and I have tried throughout the years of my career to build really good relationships with attorneys, with CPAs, with other professionals, even just with the people in my core network, in my core circle, friends, family connections, anytime you're out in the world meeting someone, that someone could become part of your network. And that is how I've always approached social, everything in my life, right? And I've always been curious. I want to learn about people. I want to learn what makes them tick. And I want to be a connector. So, in my experience, typically it starts with a relationship of some sort. And then the person goes to the website maybe to check it out, and it's sort of reaffirming of the experience they have with me. Michael: Oh, interesting. So, it sounds like you view it like... It's a very important step, but it's not the first. It's not the initiator. It's like the really important number two support that when I meet someone and have a good interaction and then they do what most of us do in the modern era, which is you go and cyberstalk, Google... Nicole: Sure. Michael: ...a person, figure out how legitimate of a professional they really are, then they'll get to your website, and be like, \"Oh, okay, this seems to really back up and fit with exactly what I saw from Nicole. Okay, now I'm kind of feeling it more now.\" Nicole: Well, I haven't thought about it until we're having this conversation, but maybe I'd even call it a validator. It's sort of a validator. You want them to leave that interaction with you having a sense of who you are, if you're clicking and it's a good vibe. Yes, of course, they look you up, because that's what we do. They look you up. And then that website sort of validates the messaging, right? And then you're feeling good because it's all consistent. And same thing with the social media. Michael: Okay. So then can you help us understand a little more where did you actually start spending your time as you were starting basically from scratch and trying to get going with this new new brand? Nicole: So, I was basically saying yes to everything. Anytime I was invited anywhere, I said yes. Social things, business things, anything, I said yes. And I really did put myself out there, and I just wanted to be in front of people. I just wanted to be meeting people. And I was never leading with me. I always tried to lead with them and understand them and form connections. And I've been in the industry, so I do have connections with other professionals. I think it's sort of interesting through this experience of starting my own firm. I've really learned who my true friends are, who answers the phone for you when you maybe have nothing to offer them at least not initially. And I feel very grateful for that experience, because I have had centers of influence and I call them friends. They're friends now, friends who believed in me and were willing to answer the phone and want to continue the relationship even though I had zero clients at that moment in time because they knew it would grow and they believed in the mission. So, those relationships are really important. Fostering those relationships are very important. And I truly don't even necessarily think of them as COIs anymore. I just think of them as friends. And actually, many of them have become clients, so that's been great, too. Michael: So, take us, I guess, just a little bit further. When you're saying yes to anything and everything, what were the opportunities coming along that you could yes your way to? Nicole: Yeah, so keep in mind, some of this is before COVID. So, networking events, industry events, women in finance events, women in leadership events, women in law events, there were always events. I was just going to all of them and meeting people. Michael: Okay, and then how do you eventually convert some of these, \"I'm meeting with people,\" into prospect opportunities? Nicole: It takes time. So, some of your existing connections with friends and family and other professionals that you've known throughout the years are a great starting point. And I found that most people generally want to help you. So, being able to just continue to foster those relationships, to do good work for your clients as you build them, leads to more good work for more clients. And it's sort of interesting. So, we all know that the SEC defines households a certain way. FINRA, the states define households a certain way. But I don't really think of households that way. I think of households a little more relationally. So, it is rare that I have a single family member. And what I mean by that is, if I work with an individual, I typically work with other people in their family because they've referred them. So, sometimes it's siblings, brothers and sisters or sisters and sisters, or it's parents and children or parents and children, even in some rare instances, grandparents or it's cousins. There's a situation where I work with in-laws of a friend actually like one spouse's parents and the other spouse's parents. So, relationships for me, I tend to think of them more like that. And it's very rare that I have an individual that doesn't have a connection to someone else in my practice. And I think that really lends itself to that relational piece of it and the high priority I place on family, taking care of those you love. That's really important to me and important to my practice. I think that comes through in that I do have these relationships, even though they're separate households technically. Michael: So, are you a firm, a person that likes to ask for referrals to try to kind of network your way through the family? How do you expand the family relationships? Nicole: I have asked for them, and I don't necessarily think that's a bad idea, but many times it happens organically. Michael: And so, I guess, is there something you do differently? Because I see a lot of advisors out there, they work really hard. They serve their clients well. They're not getting multi-million-dollar family member referrals. Nicole: I take an active interest in the family. I ask about them. I genuinely care. I get invited to family events. I show up. Yeah, I always show up. In my experience, the most meaningful relationships are where you do become an extension of family. So, the connection doesn't seem that hard to draw to me, but it has to be genuine. You really have to care and want to care and want to know about people's families. Michael: So, how does that come back to the... I filter things through my brand lens, my brand DNA guide. So, I'm wondering this sort of blend of, \"My brand guide is supposed to be my filter,\" and, \"I'm also in the phase where I'm trying to say yes to everything.\" Nicole: Right, so that's... Michael: How do you balance those or manage those? Nicole: So, I say yes to invitations. You say yes in the beginning to invitations to get yourself out there. You're going for an hour to an event. That's a very low commitment of time. Now, as you are getting busier, I think you become more selective. That has to evolve. But in the beginning, I did. I said yes to everything. I wasn't in a position to say no. Michael: When did that switch start to flip for you? Nicole: It started to flip as the book of business started to grow and time became more of a sacred resource. Michael: Okay. And then how long did it take to get traction or getting to the point where you're hitting that crossover point? Nicole: So, the whole COVID thing was...the timing was really strange. Michael: You started in 2019. Nicole: Yes. Michael: So, you were a year or less than a year. Nicole: Yes, you start kind of strong, and then everything changes. So, there were starts and stops. But I would say truly, with COVID in there, a couple of years. Michael: Before it felt like you were really getting traction? Nicole: Yeah. Michael: Was there a \"I'm going to make it\" point? Nicole: I can't give you a moment. I can't give you an \"I'm going to make it\" moment that I had, but COVID was a really difficult time for me, especially since I had just started the business, and I had thought to myself, \"What in the world did you do?\" And now I'm like home in my pajamas, in my home office. Oh, and I had office space, right? So, now I'm paying for office space that I'm not using, and I'm home in my pajamas next to my kitchen, snacking all day, thinking like, \"Oh, my goodness. This is it.\" So, getting through that and getting back out into the world was good. That was definitely a high…COVID was a low point for many reasons, but being able to get back into the world and start networking and being with people again was huge for me, because you couldn't network during COVID. You couldn't say yes to events. You couldn't go out in the world. You couldn't connect with people. Yeah, I would try. An estate planner I worked with, she and I would go for walks like distanced walks outside during COVID, and that was good. It was something. But people thought the world was going to end. Thinking about switching a financial planner really wasn't top of mind. So, I found that was a very slow time for me. What Prosperity Wealth Strategies Looks Like Today [58:06] Michael: So then where does the firm stand now? Catch us up to today. Nicole: Yeah, so today, being a boutique firm, I found that clients come. It's not like client acquisition is smooth, right? The peaks are high. The valleys are low. And there was a point last summer where I wasn't onboarding any new clients, and it was really an emotionally challenging time. And I thought, \"Am I doing something wrong? Is this not working? Is something broken?\" And I was trying to figure out what needed to be fixed. And it was nothing. It was just a slow time. Now, this year, I'm onboarding five new clients, which is great. So, the firm is just about $70 million in assets after those clients get fully onboarded, and it's about 40 households as they're defined by FINRA. But I sort of group them a little differently based on family, so it's probably closer to 15 or 20, if you consider those type of relationships. Michael: Okay, so really trying to get deeper within the family with a smaller number of families that have many millions of dollars collectively where you can dig into the complexity side. Nicole: Correct. Michael: So then what comes next for you from here? Are you at capacity, growing the capacity, looking to expand and higher up, want to get to a sweet spot of clients and hang out serving them really well and not need anymore? Nicole: I've thought a lot about this recently. I do still have capacity, but I think that, in my opinion, you don't wait until you hit the capacity mark to...I think you have to start with a plan before you get to that point where you hit your capacity or else it's too late. So, yes, I still do have capacity. I am looking to grow and I want to grow, but I want to do it the right way with the right people. That's really important to me. So, there is someone I've known a long time, and it's not official but I am optimistic that he might be coming onboard soon. And he really fits with the vision and mission of the firm and the brand and the components of the DNA. We're different yet aligned in that way. So, I'm very excited about it and optimistic that that could create a huge opportunity for greater capacity in the firm. Michael: So, would this be someone who also handles client relationships in an advisor capacity or an associate that would support you with your clients? Nicole: This would be an advisor capacity. Michael: Okay. And would that be first hire for the firm or is there other team onboard already? Nicole: That would be the first other advisor hire. So, there is an additional team member who is an operations administration professional onboard who is fantastic and does a lot of the heavy lifting as it relates to firm operations, processes, onboarding, service from a processing perspective. Michael: Okay. So, you hired kind of the ops admin side first and advisor support second. This is the sequencing of hires for the firm. Nicole: Yes. Michael: And when did the operations support come along? When did you get to the point of saying or figuring out now is actually the time to do the first hire? Nicole: I believe it was maybe 2022 perhaps or 2023. Michael: Okay. Nicole: And that was an inflection point. That was a point where it was like, \"Okay, I can't do all of this myself. I need help.\" And part of it was my reluctance to let things go. I probably did it myself for too long, if I am being totally honest with you and your listeners. I had a hard time letting it go. Michael: So, what got you there to finally say, \"I'm going to let it go\"? Nicole: Frustration. Frustration surrounding onboarding and some of the administrative pieces that I really don't enjoy but I was very protective over. So, if you want to grow, you have to let those things go, and that's been hard for me. Michael: And where did you find your first person? Nicole: It's someone that I've known a while who retired, and I contacted her a couple years into retirement and said, \"How are things going?\" And she said, they're fine but, \"I'm kind of bored.\" And I said, \"Well, that's great because I need you.\" So, she did come out of retirement, and we have a really good arrangement where she gets the flexibility that she needs. And in Michigan, our summer place is up north. People go up north in Michigan in the summer. So, she has a lot of flexibility to work remotely because she's not directly client-facing per se. So, we make sure that we have the appropriate security and things in place, but with remote work these days, that's really much easier to accomplish. So, it's working really well. Michael: I guess you're electronic enough, there's not a lot of actual physical paperwork anymore. Nicole: There's no physical paperwork anymore, it's unbelievable. Michael: Yeah. we can queue a Docusign envelope from anywhere now. Nicole: It's not even Docusign anymore. It's all digital workflows now. Docusign has become a thing of the past. Michael: It's an amazing thing. Nicole: Yes, it really is. Using Executive Summaries To Efficiently Communicate Plan Details To Clients [1:04:45] Michael: So, as you reflect back on this journey, what surprised you the most about hanging your shingle and building your own advisory business as someone who had spent time in an employee model in a much larger RIA previously? Nicole: So, when you do that, you are the owner of the business, but many days, you are other things too. Some days you have to be the janitor, right? If the trash doesn't get taken out, it either stinks up the office or you have to take it out to the dumpster, right? So, I really had to learn to wear many hats. If there is an issue with the technology, if the printer isn't printing, for example, there's no one to call to say, \"Hey, the printer's not printing. Can you send IT up?\" type of thing. That doesn't exist, right? You are IT. You are marketing. You are operations. You are facilities. You have to wear a lot of different hats. In the beginning, I would get overwhelmed, and I would get frustrated. And I'd have to pause for a moment and count to ten and say, \"Okay, you can figure this out.\" And there hasn't been any...and I will tell your listeners, in the moment, it might feel like you can't figure out whatever it is, if the printer isn't working or whatever. But at the end of the day, you can figure it out. There hasn't been anything that I haven't not been able to figure out. Michael: And bless YouTube just for how to fix almost anything. Nicole: Right. You could figure it out. You just can. I remember thinking just from an operations perspective, when it's just me, how am I going to know how to process x, y, and z client requests? There are resources. You have to call, you have to be humble. I say you always lead with kindness. I had a fantastic service team at TD. I now have a great service team at Schwab. And if there's something that we've never done before that I don't know how to do, I always led with kindness and was curious and called and asked for help. Can you explain to me why it's this way? And how can I do better next time so that I don't need you? And generally, people respond really well to that, right? So, I learned very quickly skills that I didn't have necessarily, as it relates it to the administrative or operational side of the business. It was quick for me, because I approached it that way. But like your first client onboarding, I had never done an onboarding like that before. There were always people in an operations or a support role to help with that type of thing. So, that was really scary. I had to figure it out. Michael: So then I'm curious in that vein. So, what's the rest of the, I guess, the platform, the tech stack that the firm built around? So, TD, now Schwab is custodial. Nicole: Is custodial, yes. So, I'm a big fan of Advyzon. I think Advyzon is great for portfolio reporting, portfolio accounting, billing, CRM, document storage. So, Advyzon has been a really nice solution. Something that was really important to me is I didn't want to have 15 applications to do things, right? I wanted everything to be as streamlined as possible, and I wanted the functions to talk to each other. I wanted the applications to talk to each other from a tech perspective, and I wanted it to be as simple and as streamlined as possible. Michael: So, that's the appeal for Advyzon. Nicole: Correct. Michael: Most of us kind of build our tech around the big three categories: financial planning software, portfolio management, and CRM. And Advyzon checks two of your boxes at once because it does the portfolio reporting and the CRM side. Nicole: Correct. As far as financial planning goes, I've used most of the major financial planning software out there. I use MoneyGuide Pro. I like it. It works. It's not perfect. So, I do have executive summaries and sort of additional supplemental materials that I've built over time. And to me, the planning software has always just been a tool, it's one tool of many. So, I use it as that for what it's worth, and then I sort of create and build out other sort of ancillary components of the planning that work for me based on what has resonated with my clients. And the executive summary pieces has been, I think, really positive. Michael: So, what is the executive summary for you? What do you create? Nicole: So, it's different for each client based on their needs, but there are some common threads that run through it. So, in the beginning, it's a one-pager that basically summarizes the MoneyGuide Pro report, assumptions, results, etc. Then from there, I do have some Excel models that I've built that kind of import in with cash flows, as well as some tax projections. And then from there, it sort of depends on what the client's needs are, but there's some charitable planning components, if that's something that is of interest. It really depends on what the client's needs are. Then there's sort of an action item list, things bullet pointed, as well as some text, because I found some people like visual images, some people prefer words. I like to have a little bit of everything and really lean into what type of communication is ideal for what client. Michael: So, how many pages is this? How big is this thing? Nicole: Typically five to six. Michael: Okay. Nicole: If it's a more complicated, I think like I've gone up to maybe 12 but the idea is to keep it more brief, depending on the flowchart. If we're doing flowcharts and stuff, it can get a little longer. Michael: And so then what happens to the rest of MoneyGuide Pro? Nicole: So, MoneyGuide Pro is the foundation, right? So, MoneyGuide Pro is sort of the foundation for building out the plan. But then we take that information and sort of expand upon it and then continue to develop it in a way that meets our clients' needs. And the client still gets MoneyGuide Pro planning output, but that in and of itself to me is not... It's good, but I think there's opportunity for something else as well. Michael: So, the output from the software is the technical appendix? Nicole: Yeah. Michael: And after the main portion, the plan that you're making, which is the five to six-page executive summary? Nicole: Correct. That was really drilled down into this particular client. Michael: And how do you produce the executive summaries? Is this manually in Word for each client kind of thing? Nicole: So, it's typically in PowerPoint, but there are components of Excel that kind of are built into it. Michael: Oh, interesting. So, you're building primarily in PowerPoint, so really very bullet point slide by slide. Nicole: There's no paragraphs. Michael: Yeah, not paragraph narrative form at all. Nicole: No, there's no paragraphs. Michael: Okay. Nicole: From my experience, people do not want to read paragraphs of anything. Michael: Okay. And so executive summary leads and then if they've got questions and you get into the software output side. Nicole: So, it depends on the client. Sometimes we'll do sort of a high... I'll ask them. I have some clients... Some of my executives don't want to touch that MoneyGuide Pro report ever, so we go straight to the executive summary. We talk through the one-pager of assumptions and outputs and they're happy. They're like, \"Great. I don't ever want to see that thing again,\" because it is quite big, right? But others sometimes want to spend a little time in it, and that's okay, too. It just sort of depends on the client and what their desire is to dig deep into the data. MoneyGuide Pro does have some really good output that can be valuable in the conversation depending on the situation. Michael: And so what's the ask to the client? Nicole: So, by the point we're getting ready to present a plan, I have a pretty good sense of how they like to share data because keep in mind, they've shared data with me so that I can build a plan. So, it just depends. You get a sense for people in talking with them. And sometimes I'll say, \"I have a lot of materials prepared here for you today. I really want to make the most of our time. So, help me understand, where would you like to start? We could do a high-level review. I also have some supporting documentation that we can dive into with some more detail. Where would you like to start?\" Michael: Okay. Nicole: And I'll put them side by side. And sometimes I toggle between the two. The Low Point On Nicole's Journey [1:14:42] Michael: So then as you've gone through this journey, what was the low point? Nicole: The low point was when I had just started the firm and I had no clients. And I recall there was this day where I looked at my cellphone and I had no emails to my business email. I had no telephone calls. And I remember thinking to myself, \"I have not gotten a single email today. This is never going to work.\" And I was used to getting tons of emails, right? At one point, I thought the phone was broken. Is this working? And that made me very nervous. I was like, \"This is just not going to work.\" And you pick yourself up and keep pushing forward. And it did end up working, but there were certainly slow days, Michael. I was getting emails and phone calls, but I had that sort of same experience as it relates to client onboarding this past summer where there was just not a lot of activity surrounding new client acquisition, and that was a really difficult time for me to navigate through. But I did. I got through it. And now I'm at a point where I'm onboarding multiple clients all at once. So, being a business owner, you have to weather that volatility, those storms of ups and downs, and just have the courage and the strength to know that you will get through the hard days and keep doing what you do, because you have to believe it will work out. Michael: Are there points where you get doubt about whether it will work out? Nicole: Not anymore. Michael: How did you handle it when you did? Nicole: I had doubts. Of course I had doubts. I went back to my why. Why am I doing this? Why? And I truly believe that I am doing good work and that there are people out there who want the relationship, who want the planning tenacity, who want that combination, and I just have to find those people. So, on those days where the doubt started creeping in, I had to go back to my why. Michael: So, are there other things that you know now that you wish you could go back and tell you from five or six years ago when you were first hanging the shingle? Nicole: I would have told myself to be patient. That is not my strongest quality, I will admit, and I would have told myself to be patient. I would have told myself to really dial into that branding guide, dial into the ideal client because there were points in the business, after coming out of some of those slower times, that I did take on client relationships that maybe weren't quite ideal, that didn't quite fit the key components, where there was some misalignment. And it hasn't been positive for me. It hasn't been ideal for the client. It's not a great outcome. So, I want every client to have a great experience. And I want there to be a really nice alignment. I want to get what makes them tick. I want them to get what makes me tick, and I want it to be very...and when that all falls into place, it's just very fulfilling. And there are a couple of scenarios where that was not the case. And if I could rewind time, I would have helped those clients find a better fit in a home for them. Michael: And what did you end up needing to do with them? Did you have to part ways with them? Nicole: Yes, I did, and I do believe it was for the best, but better to not even go down that road, because now you're unwinding things that you did, and again, time is a resource and that is not a good use of a limited resource. Michael: So, I always find this dynamic fascinating, because virtually all of us who have some number of years of experience can tell the story of clients that we took on that weren't a good fit, that were, in retrospect, it actually would have been significantly easier if we've never taken this person than to take them and have to unwind it later. And we all still seem to do it. What would you have told yourself to not succumb to the temptation in the moment to take them when new client flow has been slow and we're freaking out about our revenue a little bit? Nicole: Yes, well, that's it, right? I think you just identified the reason why, at least in my instance, I did that, and that is because that's where the patience comes in, and the conviction in your value, and your messaging, and your branding, because when you're coming off or in a slow period, it feels like... We have recency syndrome. It feels like it's going to be like that forever. And then someone comes along, and maybe they're not ideal and maybe you see some red flags of how they don't necessarily fit into your business model, but you convince yourself that you're going to make it work because it has been slow and because you are running a business and because revenue looks the way it looks and all of those things, right? So, I think that's a very human thing to do. I think it's a very normal thing to do. So, really you're fighting your human tendency on this one, and for me, it's that recency syndrome that really gets me. So, it's like, okay, if it's been a period of time and there haven't been new clients and then your brain starts spiraling, thinking, \"I'm never going to get a new client again.\" So, I would just tell myself to chill and to relax and do whatever you do, to meditate and go back to a calm state so that you can evaluate it with clearer perspective and make the best decision for your business. Michael: And so when you talk about the challenges around being patient while growing the business, that's where it crops up. It's the, \"I took people that felt like I needed revenue at the time. And in retrospect, I probably didn't needed that much given how hard it was to execute myself later.\" Nicole: Absolutely. And I'd maybe even go so far as to say, yes, revenue is a component, but maybe even just activity is another component of like, \"Look, I've onboarded a client. This is activity. This is good, positive activity.\" Because like I said, when you're starting off, you can only review your books and records so many times for completeness. Michael: And so the readjustment advice you'd give your prior self facing that moment is just get back to the ‘why' that you're doing this in the first place. Nicole: Absolutely. And with a boutique firm, I think the alignment is even more important because of the limited resources and because of, by virtue of being a more boutique firm, the closeness of the relationship. You want to fill your life with people that you enjoy, with people who you are aligned with, with people who you share common values with, who appreciate your work, in my instance, who want that sort of partnership, who seek value in it. Looking back at it, as we're having this conversation, I'm thinking, \"Why would you ever have set yourself up in this position?\" Human nature, fear, need to do something, activity. Nicole's Advice For Advisors Thinking About Starting Their Own RIA [1:23:38] Michael: So, any other advice you would give younger or just newer advisors coming into the profession and starting a firm today? Nicole: It is certainly not easy. And when I was deciding what might be next for me, I considered several options to join a larger, more established firm. And none of them felt quite right. There were some very fine options, and there are some very fine firms in my community. But none of them felt quite right for me. And it is not easy. And a lot of people told me, \"Nicole, this is not going to be easy. You should just join another firm.\" And that probably would have been easier. They're right. But it wouldn't have been nearly as fulfilling or as meaningful for me. So, while I agree that it's not easy, I would say if someone is on the brink of wanting to start an RIA, it has been one of the most difficult yet most rewarding things I have ever done. And I would fully encourage them to do that, because as you said, Michael, the tech stack today is amazing. You know, 20 years ago, when I graduated or whatnot and came into the business, I don't know if I would have been able to do that. This technology didn't exist. It exists today so that we can can do what we do successfully and it can truly be an amazing career. I love financial services. I love financial planning. I think it's a phenomenal career. And I would just encourage anyone who is considering it to really take the leap. Michael: It is one of the things that I chuckle about in today's environment. There's all this discussion today of you...you can't survive as a small or solo advisor, right? So, you have to merge and be acquired and be part of a large firm. And all these large firms today were tiny firms 20 years ago, and 20 years ago, the technology was awful. And if you could be a successful...and 20 years ago, it was RIAs and Merrill Lynch and Morgan Stanley. And so if 20 years ago, the startups with terrible technology took on wirehouses and have been the only growing channel for the past 20 years, and then you get all the amazing technology today, I just look at them like... I kind of feel like there's literally never been a better time to be a solo or small firm than today when you look at the amount of tech that we've got and how amazing it is. Nicole: The technology has been a gamechanger truly. It's enabled me to launch this RIA. Michael: So, any other advice or guidance just for other folks in large firms as you had been that are weighing this? Do I hang my own shingle, go to another firm or stay put just as someone who went through that crossroads? Nicole: I think my advice would be to really do a assessment of yourself and evaluate what is important to you and why, evaluate how you like to work, what environment you like to work in, what types of clients you like to work in, and be honest with yourself. What works best for you? And I think that will guide your decision making, right? Because that alignment has to be there. And if it's not, you're going to be unhappy. What Success Means To Nicole [1:27:45] Michael: So, as we wrap up, this is a podcast about success. And just one of the themes that comes up is literally that word success means very different things to different people. And someone who's gone and launched their own business and now on this wonderfully successful path as you're at $70 million after five or six years and getting ready for advisor hires, the business is growing and scaling in such a wonderful place, how do you define success for yourself at this point? Nicole: So, to me, success is the ability to do work that I enjoy and that I find meaningful with people that I enjoy being around and being able to have the financial freedom and flexibility to support my family and to live a life of my choosing. So, that really is success. And I guess I would add also I've always had strong ties in my community. I've always been active in my community. I enjoy being active in certain philanthropic pursuits. And being able to really give back to my community in those ways is another component of success. Michael: Very cool. I love it. Nicole: Thank you for having me, Michael. This was great. Michael: Absolutely. Thank you, Nicole, for joining us on the \"Financial Advisor Success\" Podcast. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Social-Image-FAS-436.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436.png\"\u003e\u003cimg decoding=\"async\" title=\"Nicole Gopoian Wirick Podcast Featured Image FAS\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-300x300.png\" alt=\"Nicole Gopoian Wirick Podcast Featured Image FAS\" width=\"300\" height=\"300\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436.png 1668w\" data-sizes=\"(max-width: 300px) 100vw, 300px\" src=\"https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-300x300.png\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-1024x1024.png 1024w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-768x768.png 768w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-1536x1536.png 1536w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-800x800.png 800w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2025/04/Nicole-Gopoian-Wirick-Podcast-Featured-Image-FAS-436.png 1668w\"/\u003e\u003c/a\u003eWelcome everyone! Welcome to the 436th episode of the \u003cstrong\u003eFinancial Advisor Success Podcast\u003c/strong\u003e!\u003c/p\u003e\n\u003cp\u003eMy guest on today\u0026#39;s podcast is Nicole Gopoian Wirick. Nicole is the president of Prosperity Wealth Strategies, an RIA based in Bloomfield Hills, Michigan, that oversees $70 million in assets under management for 40 client households.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s unique about Nicole, though, is how she hired a branding consultant soon after going out on her own as an independent advisory firm to help her create a unique brand identity that reflects her approach to financial planning, has helped her attract and connect with clients who fit her ideal client persona, and now serves as the filter for evaluating whether any marketing strategy if even worth her time to pursue.\u003c/p\u003e\n\u003cp\u003eIn this episode, we talk in-depth about how the branding consultant encouraged Nicole to first take a step back and explore big picture questions for what she wanted from her firm (such as what an ideal day would look like for her) rather than just starting with the characteristics of her target clientele, how Nicole (based on the results from this exercise) then created her \u0026#34;brand DNA\u0026#34; (which as Nicole puts it is \u0026#34;compassionate conversations coupled with planning tenacity\u0026#34;) that serves as the bedrock of both her business plan and her marketing plan including  social media and even speaking engagements (and helps her save time by avoiding marketing tactics that don\u0026#39;t fit with her brand identity), and how Nicole incorporates her branding and the language on her website to attract prospects who fit her ideal client persona of those with $2 million to $10 million in investible assets and an interest in going deep on complex financial planning issues (particularly around estate planning, legacy planning, and philanthropy).\u003c/p\u003e\n\u003cp\u003eWe also talk about how Nicole, from the early days of her firm (when she had fewer clients and more time) proactively reached out to centers of influence (such as attorneys and CPAs) and tapped into her own personal network to build connections that have led to client introductions over time (even though most didn\u0026#39;t produce immediate results), how Nicole\u0026#39;s planning focus on going deep into estate and legacy planning issues has built a high level of trust with her clients that has led to subsequent referrals to other members of the same family, and why despite all the branding and marketing effort, Nicole does not intend for her website to be the first interaction that brings a prospect in to her… but is crucial nonetheless because even referrals still want to validate by checking her out online to affirm that she would be a good fit for them after being introduced.\u003c/p\u003e\n\u003cp\u003eAnd be certain to listen to the end, where Nicole shares how she is evolving her branding to be less founder-centric as she seeks to expand her advisory team beyond herself, how Nicole uses executive summaries (presented to clients in PowerPoint) to explain financial planning recommendations (leaving the output of planning software as an appendix for the few clients who do want to dig into the numbers), and how Nicole handled the ups and downs of breaking away from a larger advisory firm to start her own from scratch, including how she found motivation from being active (for example, by successfully onboarding a new client) rather than just tracking her marketing efforts alone.\u003c/p\u003e\n\u003cp\u003eSo, whether you\u0026#39;re interested in learning about hiring an external branding consultant to shape an advisory firm\u0026#39;s brand, putting a firm\u0026#39;s \u0026#34;brand DNA\u0026#34; into practice in marketing, or how going deep into estate and legacy planning can help build a high level of trust with clients, then we hope you enjoy this episode of the Financial Advisor Success podcast, with Nicole Gopoian Wirick.\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" data-src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" alt=\"Michael Kitces\" decoding=\"async\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\" data-sizes=\"auto, (max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-300x300.jpg 300w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-768x768.jpg 768w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP-800x800.jpg 800w, https://www.kitces.com/wp-content/uploads/2019/02/Michael-Kitces-Profile-WP.jpg 1022w\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eMichael Kitces is Head of Planning Strategy at \u003ca href=\"https://wealth.focuspartners.com/michael-kitces?utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_source=Kitces\"\u003eFocus Partners Wealth\u003c/a\u003e, which provides an evidence-based approach to private wealth management for near- and current retirees, and \u003ca href=\"https://advisor.focuspartners.com/kitces/?utm_source=Kitces\u0026amp;utm_medium=KitcesReferral\u0026amp;utm_campaign=ForConsumers\u0026amp;utm_id=Kitces\"\u003eFocus Partners Advisor Solutions\u003c/a\u003e, a turnkey wealth management services provider supporting thousands of independent financial advisors through the scaling phase of growth.\u003c/p\u003e\n\u003cp\u003eIn addition, he is a co-founder of the \u003ca href=\"https://www.xyplanningnetwork.com/\"\u003eXY Planning Network\u003c/a\u003e, \u003ca href=\"https://advicepay.com/\"\u003eAdvicePay\u003c/a\u003e, \u003ca href=\"https://www.fppathfinder.com/\" target=\"_blank\" rel=\"noopener\"\u003efpPathfinder\u003c/a\u003e, and \u003ca href=\"https://newplannerrecruiting.com/\"\u003eNew Planner Recruiting\u003c/a\u003e, the former Practitioner Editor of the Journal of Financial Planning, the host of the \u003cem\u003eFinancial Advisor Success \u003c/em\u003epodcast, and the publisher of \u003ca href=\"https://www.kitces.com/blog/\"\u003ethe popular financial planning industry blog \u003cem\u003eNerd’s Eye View\u003c/em\u003e\u003c/a\u003e through his website \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e, dedicated to advancing knowledge in financial planning. In 2010, Michael was recognized with one of the FPA’s “Heart of Financial Planning” awards for his dedication and work in advancing the profession.\u003c/p\u003e\n\u003cp\u003eRead all of Michael’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=13\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\" target=\"_blank\" rel=\"noopener\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cbr/\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003eNever miss a Financial Advisor Success podcast episode! Get notified of the latest episodes (and all our research as it’s released!) directly via email:\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\n\u003ch2 id=\"resources-featured-in-this-episode\"\u003eResources Featured In This Episode:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/42D7s9O\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Who Not How by Dan Sullivan\" data-src=\"https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan-200x300.jpg\" alt=\"Who Not How by Dan Sullivan\" width=\"200\" height=\"300\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan-200x300.jpg 200w, https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan.jpg 333w\" data-sizes=\"auto, (max-width: 200px) 100vw, 200px\" src=\"https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan-200x300.jpg\" srcset=\"https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan-200x300.jpg 200w, https://www.kitces.com/wp-content/uploads/2023/04/Who-Not-How-by-Dan-Sullivan.jpg 333w\"/\u003e\u003c/a\u003eNicole Gopoian Wirick: \u003ca href=\"https://www.prosperityws.com\"\u003eWebsite\u003c/a\u003e | \u003ca href=\"https://www.linkedin.com/in/nicole-gopoian-wirick/\"\u003eLinkedIn\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/42D7s9O\"\u003e\u003cem\u003eWho Not How: The Formula to Achieve Bigger Goals Through Accelerating Teamwork\u003c/em\u003e\u003c/a\u003e by Dan Sullivan\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://rebuild.group/\"\u003eRebuild\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.financialplanningassociation.org/advocacy/media-engagement/mediasource\"\u003eFPA MediaSource\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.advyzon.com/main/index.html\"\u003eAdvyzon\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.moneyguidepro.com/ifa/\"\u003eMoneyGuide\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAre you a successful financial advisor, or do you know of one that would be a great fit for the Financial Advisor Success podcast?\u003c/em\u003e \u003cem\u003e\u003ca href=\"https://www.kitces.com/podcast/#apply-recommend\" target=\"_blank\" rel=\"noopener\"\u003eFill out this form\u003c/a\u003e to be considered!\u003c/em\u003e\u003c/p\u003e\n\u003ch2 id=\"full-transcript\"\u003eFull Transcript:\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Welcome Nicole Gopoian Wirick to the \u0026#34;Financial Advisor Success\u0026#34; Podcast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Hi, Michael. Thank you so much for having me. I\u0026#39;m excited to be here with you today.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m thrilled to have you joining us today and to get to talk a little about marketing because I find most of us in the advisor world, marketing is not our natural space. Most of us tend to come up through more of the sales end, like get out there, prospect. It\u0026#39;s a \u0026#34;contact sport\u0026#34; as it was taught to me. You measure activity in terms of how many contacts you make, right? Like cold calls, you picked up business cards, you walked away with from the networking meeting, and most of us were not really trained in the marketing side of things.\u003c/p\u003e\n\u003cp\u003eAnd in our business, as I learned it, marketing makes the phone ring. Sales is what you do when you answer the call. In our business, the idea that the phone rings is like the punchline to a joke. It\u0026#39;s like going fishing without rods and hoping the fish will just jump into the boat if you wait long enough, because most of us aren\u0026#39;t wired as marketers. And I know, as you launched and built a firm, you took a different approach of what happens when you actually hire a marketing branding firm, help you figure what the marketing should be and who you should go after and then how you are going to differentiate yourself for them. Because Dan Sullivan and Ben Hardy have a now very popular book called \u0026#34;Who Not How\u0026#34; that kind of highlights sometimes the key is not figuring out how to do something like marketing. It\u0026#39;s figuring out who you should hire to do it with you or for you instead. So, I\u0026#39;m excited to talk today about how you went into launching a firm like building the marketing and brand on it when you went out on your own and even just how you find someone who can help you do it and make sure that it comes out well.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Prosperity Wealth’s Brand DNA [05:12]\" id=\"working-with-an-external-partner-to-create-prosperity-wealths-brand-dna-0512\"\u003eWorking With An External Partner To Create Prosperity Wealth\u0026#39;s Brand DNA [05:12]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Sure. So, Michael, I couldn\u0026#39;t agree with you more. And it was an area that I also did not feel terribly well-versed in. And I recognized that I needed help and I recognized that early on. I knew I wanted it, it being the firm, to be different, but I didn\u0026#39;t know what \u0026#34;it\u0026#34; should necessarily look like. I didn\u0026#39;t know how to build it myself and I knew I needed help. So, anytime I\u0026#39;ve ever wanted to get help with something specific, I\u0026#39;ve always sort of turned to my network. And through a mutual contact, I knew a gentleman from Rebuild in Detroit and connected with him to see if he would be interested in helping me go through this marketing and branding exercise for the new firm. And it was really scary. The reason it was so scary is because I was a brand new firm. I had zero clients. I had zero dollars in the bank. And to make an several thousand dollar investment at that time was a really big leap, but I knew it had to happen. So, I am so grateful for the experience and excited to tell you more about it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, I guess, first, just so we have context, paint the picture of what the situation was. Are you brand new to the industry? Are you going out on your own having industry experience but have to build a new firm from scratch? What was the context?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Sure. Yes. So, I started the firm in 2019, and I had recently left a much larger RIA, a billion-dollar plus RIA to take some time and ultimately decided that I did want to start my own RIA. So, I did have experience, but I didn\u0026#39;t have... I wasn\u0026#39;t new to the industry.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e You didn\u0026#39;t have to market yourself. You\u0026#39;re in a big firm. They make the website and make the marketing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, exactly. I didn\u0026#39;t have a clue how to do any of this. I had to figure it all out. And in connecting with the ReBUILD industry, the first thing I did was... I didn\u0026#39;t know what to do. I didn\u0026#39;t know how to prepare. I\u0026#39;m a planner, so I wanted to prepare for these meetings. They\u0026#39;re like, \u0026#34;You don\u0026#39;t bring anything, just come.\u0026#34; So, I sat in this big room with these marketing experts, and I\u0026#39;ll never forget. I came in in my best navy suit because now I\u0026#39;m a representation of my own brand. And here you have these really fun marketing guys who are in really cool jeans and sneakers, and they\u0026#39;re kind of looking at me. So, that was initially really, really eye opening. It was like, \u0026#34;Okay.\u0026#34;\u003c/p\u003e\n\u003cp\u003eSo, they started asking me questions just about myself, and they wanted me to tell stories, \u0026#34;Tell me a time when...\u0026#34; And I would tell them a time when. And they would ask me... It was all about storytelling, about who I am, about my approach to planning, about how I felt that business should be done, about who I wanted to serve, about what fulfilling client experiences were to me. And we just talked for a couple of hours and they took notes. And that was the basis for building out the key components of my firm\u0026#39;s brand DNA.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, they were just going through—I guess, even to use the advisor language—a discovery questionnaire as it were of all those things like who you are, your approach to planning, how you felt the business should be done, who you wanted to serve. So, I guess I\u0026#39;m wondering, how much clarity did you have on these questions? I mean, did you already know, \u0026#34;This is what I want to do and this is the people I want to serve and this is how I want to serve them. And I know where I\u0026#39;m going. I just need you to make me a really good website.\u0026#34; Is that or was that part of the challenge in figuring out the answers to their questions in the first place?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e That was definitely part of the challenge. So then we had to back it off, right? So, it was like, \u0026#34;Tell me about a client you enjoyed working with. Tell me about a really good day for you. Tell me what that looked like. Tell me when you\u0026#39;re happiest at work. Tell me what you\u0026#39;re doing.\u0026#34; Those type of questions to really narrow...and actually the branding exercise wasn\u0026#39;t even about the website. They didn\u0026#39;t even build the website for me. So, isn\u0026#39;t it funny? We immediately, as advisors, want to jump to the website. I do the same thing too. I\u0026#39;m like, \u0026#34;When does the website happen, Michael?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yeah. I need a business card, right? I need a tangible deliverable. I know I had a marketing process because there\u0026#39;s a business card.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e That\u0026#39;s exactly right. And I was very much looking at it through that paradigm. I\u0026#39;m like, \u0026#34;But does this go on the website?\u0026#34; So, it was so much more abstract than that. I remember when they said, \u0026#34;In your past work experience, tell me about a really happy day for you.\u0026#34; And I had done some great work for a client, and they were so appreciative. At the time, I was getting married and we were having a big...we were in a big staff meeting, and the client brought me...it was very small like a nominal gift for my wedding as a token of their appreciation. And that was so moving to me that someone would make the effort of going out and buying something special for me that they thought I would like and making a special effort of bringing it to the office to give it to me. It was just a very touching and moving experience that stuck with me for years and years and years thereafter that someone would care enough about me and appreciate me so much that they would want to do that.\u003c/p\u003e\n\u003cp\u003eSo, the relationship piece is really important to me in my practice. And I didn\u0026#39;t say that to the branding people because I didn\u0026#39;t have the capacity at the time to be able to do that, but I could tell that story of why that was a really good day and why it was meaningful for me to have my work recognized on a deeper level—we\u0026#39;re all busy—so someone would take the time out of their schedule to make that effort to do something special for me and execute it just really stuck with me. So, although I couldn\u0026#39;t say at the time, I could tell the story and that story got integrated into a piece of the brand DNA, which focuses on relationships and being able to have compassionate conversations with clients, which is a really important piece of my practice.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, I\u0026#39;m struck as you\u0026#39;re sharing some of, I guess, the stories or the questions that they asked you to prompt the stories, right? Tell me when you\u0026#39;re happiest, a good day at work, who\u0026#39;s a good client or what was a good client for you, your approach to planning. It\u0026#39;s not, \u0026#34;Nicole, tell me the average income and asset, career of the person that you want to serve.\u0026#34; Does that show up later or just that\u0026#39;s not how they went about the process? It was just very built around who is enjoyable for Nicole to work with and how does she work with them in an enjoyable way, and that\u0026#39;s your brand.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, so I\u0026#39;ve done those exercises, too, historically Michael where... What is the demographic? Maybe it\u0026#39;s gender-based. Maybe it\u0026#39;s income-based. Maybe it\u0026#39;s profession-based. Maybe there\u0026#39;s some common thread running through that ideal target prospect. So, no, none of that. None of those types of descriptors came into the elements of the brand DNA. The brand DNA is about you and the firm, not the ideal client. That comes way, way, way later, but the brand DNA is about you and the brand, because if you are true to that brand DNA and it really is, sort of, the paradigm that I see all communication going through, then you\u0026#39;re going to attract the ideal client.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Key Elements Of Creating A Brand [14:25]\" id=\"the-key-elements-of-creating-a-firms-brand-1425\"\u003eThe Key Elements Of Creating A Firm\u0026#39;s Brand [14:25]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what did you end up with as you went through the process? I mean, is there a brand DNA document now? Is there a written...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e ...outcome of the brand? Okay, so what is that? What did you end up with at the end of this question and answer or storytelling process?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, in the beginning, you go through this storytelling process and it was very emotional. You have to be very vulnerable throughout the process, and you have to be honest with yourself or else it just is a cookie cutter financial advisor brand DNA and everyone\u0026#39;s looks the same, right? And we\u0026#39;re not all the same, and they all should be different, because we\u0026#39;re all different. So, you have to be really honest with yourself as you\u0026#39;re working through it. But after you do all those storytelling, you come back and they identify the key building blocks of the brand and then they identify the benefit derived from those building blocks and then they go so far as to identify the brand outcome or the brand promise. And that all is then what\u0026#39;s integrated into the communication, the messaging. The building blocks inform the outcome of what you want it to be and what it\u0026#39;s going to look like, so that every... I was very intentional about how I didn\u0026#39;t want my messaging to be the same as everyone else\u0026#39;s, and I think a lot of advisors feel that way, at least a lot of them that I\u0026#39;ve talked to. They feel their business is unique, and the messaging should be also. It should be a reflection of their business, their brand, their beliefs, and I really wanted that to come through and to translate in a way that was unique to me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what did they come up with? What are your brand building blocks, your brand promise?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah. So, it\u0026#39;s sort of evolved through time, which is good, and it\u0026#39;s supposed to. And I\u0026#39;ve actually just gone through a second iteration of those key components of the brand DNA. So, one of mine is compassionate conversations coupled with planning tenacity. So, that brings the two unique parts of me, which are that I really love the client relationship. And that was evidenced by that story I told, which almost a decade later is very, very meaningful to me. So, that relational component was really important, the ability to have an open and honest, compassionate conversation with clients, but that wasn\u0026#39;t it alone. It was also coupled with the planning tenacity to tackle client issues, to go through the planning process, to handle some more sophisticated or nuanced planning needs, given my background. Those were also important components. So, marrying those two, the compassionate conversations coupled with the planning tenacity, was a really key component that I got through working with these folks.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I like just the language, right? Compassionate and tenacity are not quite words we typically hear in the advisor domain, and it kind of describes things that do overlap to what we do, right? We try to [inaudible 00:15:34] client conversations. We try to make sure we follow through and do the things that we say we were going to do, but I am struck even hearing it. And bless the good marketers who are good at marketing and finding those words. I\u0026#39;m like, \u0026#34;Compassionate conversations coupled with planning tenacity,\u0026#34; I\u0026#39;m like, \u0026#34;Okay, I think there\u0026#39;s kind of a unique ring to that for actually being to describe what we do in a little bit of a different way.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah. Well, thank you. So, that was certainly something that came through a few iterations. So then once you kind of understand that one component of the DNA, then you work through what are the benefits of the planning tenacity and the compassionate conversation, and then what is the desired outcome, which of course is a successful advisory relationship. That\u0026#39;s what we want. And then what is the outcome from a client perspective? And then you have to use the imagery to show that visually, which is something I wasn\u0026#39;t able to do on my own, and I did need help with that as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, how do you show that visually or how did the branding folks figure out how to show that visually? We all go through this. And when we\u0026#39;re done, you\u0026#39;ll have a financial plan. How do I show that? I can show the financial plan booked, but that\u0026#39;s not very exciting. The benefit is you\u0026#39;ll have peace of mind. What\u0026#39;s a picture of peace of mind look like?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah. So, I think that\u0026#39;s really subjective, right? I think that\u0026#39;s subjective to each brand in particular. What does peace of mind mean to you? So, you find an image in working with marketing folks, web design folks. I\u0026#39;m a firm believer in...certainly you can do these things yourself, but for me, it was important to bring in experts, because this is not my strength either. I do not have a background in marketing. I know that I probably couldn\u0026#39;t build a website if I tried, although I understand they\u0026#39;re pretty easy to do these days. But even still, it was a path I did not want to go down. So, I knew I wanted and needed help to really bring the branding work alive visually through the website, through other communications, and really make sure that everything was aligned through social media. I think the branding is sort of the first step, and it needs to be really solid. But then the branding needs to... The brand work flows through to the website. The brand work flows through to your social media if that\u0026#39;s something you do. And the brand work flows through to client communications. And if I\u0026#39;m being really diligent, the branding should be in the back of my head with every client email I write, with every communication that Prosperity puts out into the world. I should have that brand work in the back of my mind, and it should all be sort of coming through as a furtherance of those principles. Some days are better than others.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, are there other brand DNA principles or statements that came through in addition to compassionate conversations coupled with planning tenacity?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, so that was a big one. That was one of linchpins. And then knowing your building blocks was another one, right? So, so many times I had worked or met with prospects who didn\u0026#39;t necessarily understand the complexity of their financial situation, and they were challenged in putting the pieces together. And that was an area where I felt I could really help folks who had some sophistication and maybe needed some assistance breaking down those silos of their financial situation. So if they were looking at their investments in a silo, maybe they were looking at their estate planning goals in a silo, their business goals in a silo, their risk, their tax management, etc.\u003c/p\u003e\n\u003cp\u003eSo, knowing those building blocks and breaking down the silos became another key theme that ran through some of our discussions and something that kind of emerged. And that came from the, \u0026#34;What do you like to do, Nicole? What\u0026#39;s a good day for you?\u0026#34; A good day for me is a day when I\u0026#39;m able to kind of put these pieces together. I\u0026#39;m a lawyer by background, so I really love learning about a client and identifying potential issues, sort of issue spotting, and then coming up with potential strategies or solutions after going through that issue spotting exercise. And then many times, that\u0026#39;s like breaking down the silos. On a good day, I\u0026#39;m able to break down those silos. I\u0026#39;m able to spot issues and come with strategies and solutions. That\u0026#39;s fulfilling to me. That\u0026#39;s a good work day for me. So, that kind of came through some of these discussions.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Were there others that you can share? I\u0026#39;m fascinated by these, compassion conversations, knowing you\u0026#39;re building blocks. What else came through?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, one of the other ones was finding your prosperity and this idea of what is prosperity. I named my firm Prosperity, so it did resonate with me, but I kept coming back to, \u0026#34;What does prosperity mean and why?\u0026#34; and I just kept kind of circling around…it means something different to everyone, so I can\u0026#39;t define prosperity for someone else and that\u0026#39;s okay. I shouldn\u0026#39;t. I do believe people need to define it for themselves, but what was fascinating to me about prosperity, which was that, when there is prosperity, I found there was a sense of peace that came over people\u0026#39;s lives. And it was that peace of mind, that peace to be able to care for those you love, that peace of knowing that you can live a life that you value. That sense of peace was really interesting to me, and I kept coming back to peace being universal but the prosperity looks different for each individual.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And then what was the... I think you said there was a brand promise wrapped around this.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, so the brand promise of finding your prosperity is living a life you value, taking care of those you love.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Sleeping well at night. The brand promise doesn\u0026#39;t have to be fancy, but it has to resonate.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Connecting Brand DNA To Ideal Client [25:15]\" id=\"connecting-the-brand-dna-to-nicoles-ideal-client-persona-2515\"\u003eConnecting The Brand DNA To Nicole\u0026#39;s Ideal Client Persona [25:15]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So, I get it at a high level, these principles or views around the business and what\u0026#39;s meaningful for you and taking the things that you enjoy and expressing them into...therefore, these are the things I want to be doing. How do you then connect that to who are you going to serve? Who are you actually attracting and going to work with who will hopefully respond to these words and have enough money to pay you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, for me, it\u0026#39;s not about a specific client demographic. It\u0026#39;s more about a persona. So, that conversation we just had about peace, you could have that conversation with someone, and they might be totally turned off, right? They might not understand it. It might be too philosophical. It just simply might not resonate with them, and that\u0026#39;s okay. That\u0026#39;s just not my client.\u003c/p\u003e\n\u003cp\u003eSomeone that would be an ideal client for me, here\u0026#39;s that conversation and they breathe a sigh of relief and they think, \u0026#34;Wow, she really gets it. She gets me.\u0026#34; I want to sleep well at night. I want that sense of peace that comes from prosperity in knowing that I can live a life of my choosing and knowing that I can take care of myself and the ones I love. I don\u0026#39;t mean to not answer your question, but there\u0026#39;s not a demographic. I can\u0026#39;t say. It\u0026#39;s retirees, 65 plus who likes to go boating. It\u0026#39;s not about that for me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. But, I mean, look, there\u0026#39;s lots of people up and down the financial spectrum who would love to find financial peace and feel their loved ones are taken care of and sleep well at night. And the reality is those things aren\u0026#39;t happening in their life because they don\u0026#39;t have enough money to meet their goals, and that\u0026#39;s producing a lot of financial stress. That\u0026#39;s an unfortunate challenge, but I\u0026#39;m like, \u0026#34;I can\u0026#39;t necessarily help you if you don\u0026#39;t have resources in the first place to plan around.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I understand what you\u0026#39;re saying now. So, the other piece of it is that, yes, this is a business and part of being in business does mean making money and being able to support my family. So, ideally, in going through some of this, I identified that $2 million to $10 million investible asset space as being a sort of ideal client range, because the planning tenacity piece comes in, too, right? So, part of what I enjoy and where I think I can add significant value for the right client is through my desire to really dive into some of those complex planning issues, especially with maybe some more complex estate desires, legacy transfer desires. Even charitable planning, that emerged through the process as being an area that I really enjoy working with and working on, because I myself am philanthropic and it\u0026#39;s something that I enjoy and I found that clients who share that same desire for philanthropy but want to really dive into more efficient ways to give from a tax perspective, from an estate legacy perspective have become great clients, and we share those values. So, that became sort of very clear as well. And when you have that sort of mindset, typically this is someone who has some wealth who desires that more sophisticated strategy and wants to give. The same thing with multi-generational wealth planning. That\u0026#39;s something that there\u0026#39;s typically wealth if planning on how to transition it to the next generation and beyond is a concern or is of importance. I do want to make clear though, we didn\u0026#39;t start there. That\u0026#39;s kind of where you end, but that\u0026#39;s not where you start in this conversation, at least it wasn\u0026#39;t for me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Because the starting point was very sort of you-centric, Nicole-centric. What do you like doing? Where do you enjoy spending your time? Where do you want to show up? And then we\u0026#39;re going to draw the proverbial Venn diagram of like, \u0026#34;Okay, there\u0026#39;s a circle with you. There\u0026#39;s a circle of people who can afford what you do. And now we\u0026#39;re going to try to find the overlap between these two circles to now draw your ideal clients.\u0026#34; They have the financial wherewithal complexity, and they fit the things that you enjoy and want to do in the first place.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, I would say that is absolutely correct.\u003c/p\u003e\n\u003ch2 data-nav-title=\"How The Brand Has Changed [30:40]\" id=\"how-prosperity-wealths-brand-has-changed-over-time-3040\"\u003eHow Prosperity Wealth\u0026#39;s Brand Has Changed Over Time [30:40]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And you said then it\u0026#39;s evolved over time. So, what\u0026#39;s changed as this has lived on?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, it\u0026#39;s been about five years now, and some of those key principles are still very solid, but what\u0026#39;s changed is that... I\u0026#39;m sort of at a crossroads, Michael, in that I\u0026#39;m deciding what the future of this firm looks like. And initially the thought was it\u0026#39;s me. I am the advisor. So, it was very Nicole-centric and Nicole-focused. That has changed over time as I\u0026#39;m considering expanding, as I\u0026#39;m considering potential new advisors with paths to partnership. And it can\u0026#39;t just be about me. It has to be a bigger picture than just me. So, that\u0026#39;s been a shift that\u0026#39;s been really hard, especially when you build something from the ground up. And in many ways, it feels like your baby. So, you have to let go of some of that, which I am working through, because I do think it\u0026#39;s what\u0026#39;s best for the clients and what\u0026#39;s best for the firm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what changes in that regard? Because I\u0026#39;m noting, for better or worse, it\u0026#39;s not Wirick Financial Planning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e No, right. I didn\u0026#39;t want it to be.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then what\u0026#39;s changing as you start thinking about what does it mean when the brand is less focused on Nicole?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, on my website previously, my face was the first thing you saw on the landing page. It felt very personal. It felt like a very personal invitation to come learn about my business. But as your business grows, it\u0026#39;s about more than just you, right? So, having your face on that landing page maybe no longer makes sense, and that can be kind of difficult to let that go.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yep. And the driver for you was, \u0026#34;I\u0026#39;m starting to think about needing to hire other advisors, so I want to make this shift.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, I wanted it to be less about me and more about the firm while still having that personal touch sort of flow through but just in a less Nicole-centric sort of way.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, I guess, help us visualize what this marketing branding process ended with or culminated. You\u0026#39;re going through all these questions to make your brand DNA. I\u0026#39;m assuming it\u0026#39;s the documents that kind of has key statements. You\u0026#39;ve identified you wanted $2 million to $10 million investable asset clientele to kind of have the complexity and financial capability that fits the work you want to do. I\u0026#39;m like, \u0026#34;Okay. So, you\u0026#39;ve kind of figured out what you want to be and who you want to go after. Now do we get to make a website?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e You\u0026#39;re really excited about the website, Michael.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I\u0026#39;m excited about the website because, \u0026#34;Okay, but when do we get down to where we...\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, I hear you.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e \u0026#34;...do our thing so clients will show up?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It is a brand guide, and it walks through some of these things that we\u0026#39;re talking about. It also has visual images as a suggestion for what aligns with the brand messaging. It has colors. It has some icons and things that were then...although they did not create the website for me, I took this sort of brand book and then hired a web designer to take this and create a website that aligns with those key components and bring them to life on a website. So, yes, once you do the brand work, once you get sort of the brand guide, once you understand the brand DNA, the next step is to turn it into marketing collateral. And one of the chief components of marketing collateral is, of course, the website.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so then on the website, these sort of words and phrases start to show up.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e They start to live. Yes, they start to live there.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e If I go to the website, I can see homepage, at least when we\u0026#39;re recording reads, \u0026#34;Planning with a personal touch.\u0026#34; So, we\u0026#39;re in with the connections. And Prosperity is an independent wealth management firm specializing individuals and families with $2 million to $10 million in assets, so it\u0026#39;s right there. It\u0026#39;s on the homepage just immediately below the fold. So, we\u0026#39;re all getting clear early on about who we go after at the end of the day.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, one of the things that came up... And you\u0026#39;re absolutely right, Michael. One of the things that came up, which is just above what you just read to me in this sort of second round of brand work is that another thing that I really enjoy is being able to take complex financial topics and make them understandable and approachable for clients. If I can do that, that\u0026#39;s another really good day for me. That is fulfilling to me, because a lot of what we do can get very complicated, and it can be easy for us to fall back on our financial planning words that a really smart client might not understand.\u003c/p\u003e\n\u003cp\u003eSo, when I see that light bulb go off for the client and I explain something that is sort of complex in a way that is approachable and understandable, I feel great. So, that\u0026#39;s where financial intricacies are approachable and understandable strategies are born. That was sort of a second round of going through this. That didn\u0026#39;t come through the first round of the branding exercises, but it was something that, in the last few years, I\u0026#39;ve really leaned into and tried to make sure that every client experience has that, because we\u0026#39;ve all sat in meetings with folks... Well, I shouldn\u0026#39;t say all, but I\u0026#39;ve sat in plenty of meetings with folks where the eyes just kind of glaze over and you\u0026#39;re like, \u0026#34;Oh, they\u0026#39;re totally gone.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Right, right, right. I\u0026#39;m guilty of probably a disproportionately high number of those since I like to bring very long financial plans into meetings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, we\u0026#39;ve all been there, right? I\u0026#39;ve been there too, and it\u0026#39;s like, \u0026#34;Okay, how do we get them back?\u0026#34; So, I really want to lean into that. It\u0026#39;s like when I go to the doctor and they\u0026#39;re talking to me using words that I don\u0026#39;t understand and I\u0026#39;m a pretty bright person, I\u0026#39;m like, \u0026#34;I don\u0026#39;t get it. You have to explain it to me differently,\u0026#34; that type of thing. I want it to be approachable, understandable, obtainable.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And I\u0026#39;m struck as I now scroll through more of the website, hearing this, the words start showing up or how we work, it\u0026#39;s more than just business, because we\u0026#39;re getting back to relationships. What we do, we blend financial expertise and planning tenacity. They\u0026#39;re across multiple disciplines, estate planning, trust administration, advanced tax, philanthropic giving. So, now I\u0026#39;m kind of reinforcing, you don\u0026#39;t hear a lot of people with very limited financial means where their struggle is trust administration, advanced tax, and philanthropic giving. There\u0026#39;s ways we can say we\u0026#39;re focused on somewhat more affluent clientele without necessarily using the words when you just start getting into, \u0026#34;Well, here are the problems that we help with.\u0026#34; These are problems that are more common with multimillionaires than others, which is the point of speaking to them without having to say you\u0026#39;re speaking to them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Absolutely, Michael.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Importance Of Remaining On-Brand [39:06]\" id=\"the-importance-of-remaining-onbrand-when-answering-media-requests-3906\"\u003eThe Importance Of Remaining On-Brand When Answering Media Requests [39:06]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, I told you I started this business right before COVID, which in hindsight is really interesting, but we didn\u0026#39;t know at the time. But there was a while where there wasn\u0026#39;t a whole lot of activity. So, I was really looking to get myself out into the media, out into the world, share the message of myself and the firm. And I was answering a lot of press requests that came across my desk. Basically on any sort of financial topic that came across, I would reply.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Where were these press work? Where were these wonderful, magical unicorn press requests coming across your desk from?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah. So, they came through the Financial Planning Association\u0026#39;s central media hub [FPA MediaSource]. I don\u0026#39;t know if I\u0026#39;m saying that right. So, I\u0026#39;m sitting there twiddling my thumbs, and I\u0026#39;m answering these press requests. And I wasn\u0026#39;t necessarily looking at it through the lens of my branding work. I was looking at it through the lens of this reporter needs a little commentary on X, Y, or Z topic. And some of the replies were probably a little off-brand. And I didn\u0026#39;t recognize that in the fact. But at the end of the article, they\u0026#39;d always reference you and have a link to your website or email address. And I did have people reach out to me. And many times, they were not ideal clients, but I would spend a little time with them because I felt it was the right thing to do. But from a time perspective, probably not the best business decision long-term. So, now I am much more selective about the type of commentary that I\u0026#39;m making, trying to really align it with the ideal client persona.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Can you give us an example of one, at least in retrospect, \u0026#34;Oh, that probably wasn\u0026#39;t a good media call or interview to have done\u0026#34;?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e There were a couple about budgeting that weren\u0026#39;t really applicable to my ideal client.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Okay. So, yes, I can give my two cents about budgeting and be helpful. And then if this goes really well and I get a lot of media visibility, I\u0026#39;ll get a whole bunch of people who call me and ask for budgeting help, which is not ideal when I was trying to work with people with $2 to $10 million.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct. Certainly some of them need budgeting help in a very different way. Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Same principle, more zeros.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, that helps to sort of connect in context. If I want to work with a certain level of client affluence in deep complex planning issues, I should probably be taking media queries for publications and situations that deal with more financially affluent clients with more complex planning issues, not necessarily general budgeting that may not hit my target.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So, that\u0026#39;s what you mean when you say filtering through the brand of, is this even a media opportunity that\u0026#39;s going to put me in front of the people that I want to be in front of?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Absolutely. And I did do several of those because every time that I haven\u0026#39;t been true to looking at outreach or looking at an activity through the brand DNA, I found myself truthfully, Michael, feeling frustrated after the fact of this was not a good use of time, as I\u0026#39;m in business. I\u0026#39;m trying to grow a business. This wasn\u0026#39;t a good business building activity per se, because it didn\u0026#39;t yield a result that was aligned with what I\u0026#39;m trying to accomplish. So, this branding guide has really, when I\u0026#39;m true to it, really keeps me on track and focused.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, it almost sounds like the...because I guess the branding guide for you, it\u0026#39;s not just like, \u0026#34;Here\u0026#39;s the words we use in our website and the hex code for the color of purple that we use.\u0026#34; This is the marketing plan lens filter for you of, if this isn\u0026#39;t going to get to the people that I\u0026#39;m trying to get to with my brands, if this isn\u0026#39;t going to put me where my ideal clients are and let me show up the way that I show up with my brand where I have compassionate conversations coupled with planning tenacity, if I can\u0026#39;t show up for the right people the way that fits with my brands, then that almost in of itself defines was that a good media call to take, was that a good networking meeting to go to.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes. It really has become the bedrock of my marketing plan, of my business plan, of my social media outreach, of some of the speaking engagements that I\u0026#39;ve done. It\u0026#39;s become the lens and through which I make decisions about how to...time is a resource and it\u0026#39;s a limited resource. We all only have so many hours in a day and how we choose to allocate that time, in my opinion, should align with our business goals. And if we have misalignment, we\u0026#39;re not being efficient with one of our greatest resources, which is our time.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so tell me again. So, what was the cost to go through this branding exercise, create your brand DNA document?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I don\u0026#39;t know if I can disclose that, but can I say it was several thousand dollars five years ago?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, a thousand, not tens of thousands.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Not tens of thousands, several thousand.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. Okay. And this is in startup phase where...?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e This is in startup phase when there\u0026#39;s zero money in the bank.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And I guess, per the earlier comment, this wasn\u0026#39;t for them to build your website. This was to make...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e That was a separate engagement, Michael.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It was a separate one. Then you got to go spend a couple thousand dollars more to actually get a website.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Attracting Target Clients [45:21]\" id=\"how-the-branding-exercise-helps-nicole-attract-her-ideal-target-client-4521\"\u003eHow The Branding Exercise Helps Nicole Attract Her Ideal Target Client [45:21]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then help us understand more about what came next, right? I\u0026#39;m going back to, I guess, 2019, 2020 is we do the brand DNA guide. We then go hire the firm to make the website that embodies the brand and the messaging that we want to hopefully connect with the prospects that I want. Cool. Now I have a brand-new firm with an awesome brand and no clients yet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, right.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what\u0026#39;s next to actually get said beautiful brand out to the world so business starts happening or the phone starts ringing or what...?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, believe it or not, most people don\u0026#39;t come through the...in my experience, most people don\u0026#39;t come through the website. Most prospects don\u0026#39;t come through the website. I have had a few who have Googled financial planner, Detroit, Michigan, or Detroit suburb, and found my website and called me that way. Total strangers, total cold introduction. And that is sort of interesting, but that is not typical. That is rare. And if that should happen, then great. You can\u0026#39;t plan on that obviously or build a business plan around it because it\u0026#39;s one of those things, but it has happened a couple of times.\u003c/p\u003e\n\u003cp\u003eMore typically, it starts with then you have your network and I have tried throughout the years of my career to build really good relationships with attorneys, with CPAs, with other professionals, even just with the people in my core network, in my core circle, friends, family connections, anytime you\u0026#39;re out in the world meeting someone, that someone could become part of your network. And that is how I\u0026#39;ve always approached social, everything in my life, right? And I\u0026#39;ve always been curious. I want to learn about people. I want to learn what makes them tick. And I want to be a connector. So, in my experience, typically it starts with a relationship of some sort. And then the person goes to the website maybe to check it out, and it\u0026#39;s sort of reaffirming of the experience they have with me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Oh, interesting. So, it sounds like you view it like... It\u0026#39;s a very important step, but it\u0026#39;s not the first. It\u0026#39;s not the initiator. It\u0026#39;s like the really important number two support that when I meet someone and have a good interaction and then they do what most of us do in the modern era, which is you go and cyberstalk, Google...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Sure.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e ...a person, figure out how legitimate of a professional they really are, then they\u0026#39;ll get to your website, and be like, \u0026#34;Oh, okay, this seems to really back up and fit with exactly what I saw from Nicole. Okay, now I\u0026#39;m kind of feeling it more now.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Well, I haven\u0026#39;t thought about it until we\u0026#39;re having this conversation, but maybe I\u0026#39;d even call it a validator. It\u0026#39;s sort of a validator. You want them to leave that interaction with you having a sense of who you are, if you\u0026#39;re clicking and it\u0026#39;s a good vibe. Yes, of course, they look you up, because that\u0026#39;s what we do. They look you up. And then that website sort of validates the messaging, right? And then you\u0026#39;re feeling good because it\u0026#39;s all consistent. And same thing with the social media.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So then can you help us understand a little more where did you actually start spending your time as you were starting basically from scratch and trying to get going with this new new brand?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, I was basically saying yes to everything. Anytime I was invited anywhere, I said yes. Social things, business things, anything, I said yes. And I really did put myself out there, and I just wanted to be in front of people. I just wanted to be meeting people. And I was never leading with me. I always tried to lead with them and understand them and form connections. And I\u0026#39;ve been in the industry, so I do have connections with other professionals. I think it\u0026#39;s sort of interesting through this experience of starting my own firm. I\u0026#39;ve really learned who my true friends are, who answers the phone for you when you maybe have nothing to offer them at least not initially. And I feel very grateful for that experience, because I have had centers of influence and I call them friends. They\u0026#39;re friends now, friends who believed in me and were willing to answer the phone and want to continue the relationship even though I had zero clients at that moment in time because they knew it would grow and they believed in the mission. So, those relationships are really important. Fostering those relationships are very important. And I truly don\u0026#39;t even necessarily think of them as COIs anymore. I just think of them as friends. And actually, many of them have become clients, so that\u0026#39;s been great, too.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, take us, I guess, just a little bit further. When you\u0026#39;re saying yes to anything and everything, what were the opportunities coming along that you could yes your way to?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, so keep in mind, some of this is before COVID. So, networking events, industry events, women in finance events, women in leadership events, women in law events, there were always events. I was just going to all of them and meeting people.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay, and then how do you eventually convert some of these, \u0026#34;I\u0026#39;m meeting with people,\u0026#34; into prospect opportunities?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It takes time. So, some of your existing connections with friends and family and other professionals that you\u0026#39;ve known throughout the years are a great starting point. And I found that most people generally want to help you. So, being able to just continue to foster those relationships, to do good work for your clients as you build them, leads to more good work for more clients. And it\u0026#39;s sort of interesting. So, we all know that the SEC defines households a certain way. FINRA, the states define households a certain way. But I don\u0026#39;t really think of households that way. I think of households a little more relationally.\u003c/p\u003e\n\u003cp\u003eSo, it is rare that I have a single family member. And what I mean by that is, if I work with an individual, I typically work with other people in their family because they\u0026#39;ve referred them. So, sometimes it\u0026#39;s siblings, brothers and sisters or sisters and sisters, or it\u0026#39;s parents and children or parents and children, even in some rare instances, grandparents or it\u0026#39;s cousins. There\u0026#39;s a situation where I work with in-laws of a friend actually like one spouse\u0026#39;s parents and the other spouse\u0026#39;s parents. So, relationships for me, I tend to think of them more like that. And it\u0026#39;s very rare that I have an individual that doesn\u0026#39;t have a connection to someone else in my practice. And I think that really lends itself to that relational piece of it and the high priority I place on family, taking care of those you love. That\u0026#39;s really important to me and important to my practice. I think that comes through in that I do have these relationships, even though they\u0026#39;re separate households technically.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, are you a firm, a person that likes to ask for referrals to try to kind of network your way through the family? How do you expand the family relationships?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I have asked for them, and I don\u0026#39;t necessarily think that\u0026#39;s a bad idea, but many times it happens organically.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so, I guess, is there something you do differently? Because I see a lot of advisors out there, they work really hard. They serve their clients well. They\u0026#39;re not getting multi-million-dollar family member referrals.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I take an active interest in the family. I ask about them. I genuinely care. I get invited to family events. I show up. Yeah, I always show up. In my experience, the most meaningful relationships are where you do become an extension of family. So, the connection doesn\u0026#39;t seem that hard to draw to me, but it has to be genuine. You really have to care and want to care and want to know about people\u0026#39;s families.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, how does that come back to the... I filter things through my brand lens, my brand DNA guide. So, I\u0026#39;m wondering this sort of blend of, \u0026#34;My brand guide is supposed to be my filter,\u0026#34; and, \u0026#34;I\u0026#39;m also in the phase where I\u0026#39;m trying to say yes to everything.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Right, so that\u0026#39;s...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e How do you balance those or manage those?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, I say yes to invitations. You say yes in the beginning to invitations to get yourself out there. You\u0026#39;re going for an hour to an event. That\u0026#39;s a very low commitment of time. Now, as you are getting busier, I think you become more selective. That has to evolve. But in the beginning, I did. I said yes to everything. I wasn\u0026#39;t in a position to say no.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e When did that switch start to flip for you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It started to flip as the book of business started to grow and time became more of a sacred resource.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And then how long did it take to get traction or getting to the point where you\u0026#39;re hitting that crossover point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, the whole COVID thing was...the timing was really strange.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e You started in 2019.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, you were a year or less than a year.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, you start kind of strong, and then everything changes. So, there were starts and stops. But I would say truly, with COVID in there, a couple of years.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Before it felt like you were really getting traction?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Was there a \u0026#34;I\u0026#39;m going to make it\u0026#34; point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I can\u0026#39;t give you a moment. I can\u0026#39;t give you an \u0026#34;I\u0026#39;m going to make it\u0026#34; moment that I had, but COVID was a really difficult time for me, especially since I had just started the business, and I had thought to myself, \u0026#34;What in the world did you do?\u0026#34; And now I\u0026#39;m like home in my pajamas, in my home office. Oh, and I had office space, right? So, now I\u0026#39;m paying for office space that I\u0026#39;m not using, and I\u0026#39;m home in my pajamas next to my kitchen, snacking all day, thinking like, \u0026#34;Oh, my goodness. This is it.\u0026#34; So, getting through that and getting back out into the world was good. That was definitely a high…COVID was a low point for many reasons, but being able to get back into the world and start networking and being with people again was huge for me, because you couldn\u0026#39;t network during COVID. You couldn\u0026#39;t say yes to events. You couldn\u0026#39;t go out in the world. You couldn\u0026#39;t connect with people. Yeah, I would try. An estate planner I worked with, she and I would go for walks like distanced walks outside during COVID, and that was good. It was something. But people thought the world was going to end. Thinking about switching a financial planner really wasn\u0026#39;t top of mind. So, I found that was a very slow time for me.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Prosperity Wealth Strategies Today [58:06]\" id=\"what-prosperity-wealth-strategies-looks-like-today-5806\"\u003eWhat Prosperity Wealth Strategies Looks Like Today [58:06]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then where does the firm stand now? Catch us up to today.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah, so today, being a boutique firm, I found that clients come. It\u0026#39;s not like client acquisition is smooth, right? The peaks are high. The valleys are low. And there was a point last summer where I wasn\u0026#39;t onboarding any new clients, and it was really an emotionally challenging time. And I thought, \u0026#34;Am I doing something wrong? Is this not working? Is something broken?\u0026#34; And I was trying to figure out what needed to be fixed. And it was nothing. It was just a slow time.\u003c/p\u003e\n\u003cp\u003eNow, this year, I\u0026#39;m onboarding five new clients, which is great. So, the firm is just about $70 million in assets after those clients get fully onboarded, and it\u0026#39;s about 40 households as they\u0026#39;re defined by FINRA. But I sort of group them a little differently based on family, so it\u0026#39;s probably closer to 15 or 20, if you consider those type of relationships.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay, so really trying to get deeper within the family with a smaller number of families that have many millions of dollars collectively where you can dig into the complexity side.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then what comes next for you from here? Are you at capacity, growing the capacity, looking to expand and higher up, want to get to a sweet spot of clients and hang out serving them really well and not need anymore?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I\u0026#39;ve thought a lot about this recently. I do still have capacity, but I think that, in my opinion, you don\u0026#39;t wait until you hit the capacity mark to...I think you have to start with a plan before you get to that point where you hit your capacity or else it\u0026#39;s too late. So, yes, I still do have capacity. I am looking to grow and I want to grow, but I want to do it the right way with the right people. That\u0026#39;s really important to me. So, there is someone I\u0026#39;ve known a long time, and it\u0026#39;s not official but I am optimistic that he might be coming onboard soon. And he really fits with the vision and mission of the firm and the brand and the components of the DNA. We\u0026#39;re different yet aligned in that way. So, I\u0026#39;m very excited about it and optimistic that that could create a huge opportunity for greater capacity in the firm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, would this be someone who also handles client relationships in an advisor capacity or an associate that would support you with your clients?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e This would be an advisor capacity.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And would that be first hire for the firm or is there other team onboard already?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e That would be the first other advisor hire. So, there is an additional team member who is an operations administration professional onboard who is fantastic and does a lot of the heavy lifting as it relates to firm operations, processes, onboarding, service from a processing perspective.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. So, you hired kind of the ops admin side first and advisor support second. This is the sequencing of hires for the firm.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And when did the operations support come along? When did you get to the point of saying or figuring out now is actually the time to do the first hire?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I believe it was maybe 2022 perhaps or 2023.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e And that was an inflection point. That was a point where it was like, \u0026#34;Okay, I can\u0026#39;t do all of this myself. I need help.\u0026#34; And part of it was my reluctance to let things go. I probably did it myself for too long, if I am being totally honest with you and your listeners. I had a hard time letting it go.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what got you there to finally say, \u0026#34;I\u0026#39;m going to let it go\u0026#34;?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Frustration. Frustration surrounding onboarding and some of the administrative pieces that I really don\u0026#39;t enjoy but I was very protective over. So, if you want to grow, you have to let those things go, and that\u0026#39;s been hard for me.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And where did you find your first person?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It\u0026#39;s someone that I\u0026#39;ve known a while who retired, and I contacted her a couple years into retirement and said, \u0026#34;How are things going?\u0026#34; And she said, they\u0026#39;re fine but, \u0026#34;I\u0026#39;m kind of bored.\u0026#34; And I said, \u0026#34;Well, that\u0026#39;s great because I need you.\u0026#34; So, she did come out of retirement, and we have a really good arrangement where she gets the flexibility that she needs. And in Michigan, our summer place is up north. People go up north in Michigan in the summer. So, she has a lot of flexibility to work remotely because she\u0026#39;s not directly client-facing per se. So, we make sure that we have the appropriate security and things in place, but with remote work these days, that\u0026#39;s really much easier to accomplish. So, it\u0026#39;s working really well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e I guess you\u0026#39;re electronic enough, there\u0026#39;s not a lot of actual physical paperwork anymore.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e There\u0026#39;s no physical paperwork anymore, it\u0026#39;s unbelievable.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yeah. we can queue a Docusign envelope from anywhere now.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It\u0026#39;s not even Docusign anymore. It\u0026#39;s all digital workflows now. Docusign has become a thing of the past.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It\u0026#39;s an amazing thing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, it really is.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Communicating Details To Clients [1:04:45]\" id=\"using-executive-summaries-to-efficiently-communicate-plan-details-to-clients-10445\"\u003eUsing Executive Summaries To Efficiently Communicate Plan Details To Clients [1:04:45]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, as you reflect back on this journey, what surprised you the most about hanging your shingle and building your own advisory business as someone who had spent time in an employee model in a much larger RIA previously?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, when you do that, you are the owner of the business, but many days, you are other things too. Some days you have to be the janitor, right? If the trash doesn\u0026#39;t get taken out, it either stinks up the office or you have to take it out to the dumpster, right? So, I really had to learn to wear many hats. If there is an issue with the technology, if the printer isn\u0026#39;t printing, for example, there\u0026#39;s no one to call to say, \u0026#34;Hey, the printer\u0026#39;s not printing. Can you send IT up?\u0026#34; type of thing. That doesn\u0026#39;t exist, right? You are IT. You are marketing. You are operations. You are facilities. You have to wear a lot of different hats. In the beginning, I would get overwhelmed, and I would get frustrated. And I\u0026#39;d have to pause for a moment and count to ten and say, \u0026#34;Okay, you can figure this out.\u0026#34; And there hasn\u0026#39;t been any...and I will tell your listeners, in the moment, it might feel like you can\u0026#39;t figure out whatever it is, if the printer isn\u0026#39;t working or whatever. But at the end of the day, you can figure it out. There hasn\u0026#39;t been anything that I haven\u0026#39;t not been able to figure out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And bless YouTube just for how to fix almost anything.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Right. You could figure it out. You just can. I remember thinking just from an operations perspective, when it\u0026#39;s just me, how am I going to know how to process x, y, and z client requests? There are resources. You have to call, you have to be humble. I say you always lead with kindness. I had a fantastic service team at TD. I now have a great service team at Schwab. And if there\u0026#39;s something that we\u0026#39;ve never done before that I don\u0026#39;t know how to do, I always led with kindness and was curious and called and asked for help. Can you explain to me why it\u0026#39;s this way? And how can I do better next time so that I don\u0026#39;t need you? And generally, people respond really well to that, right? So, I learned very quickly skills that I didn\u0026#39;t have necessarily, as it relates it to the administrative or operational side of the business. It was quick for me, because I approached it that way. But like your first client onboarding, I had never done an onboarding like that before. There were always people in an operations or a support role to help with that type of thing. So, that was really scary. I had to figure it out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then I\u0026#39;m curious in that vein. So, what\u0026#39;s the rest of the, I guess, the platform, the tech stack that the firm built around? So, TD, now Schwab is custodial.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Is custodial, yes. So, I\u0026#39;m a big fan of Advyzon. I think Advyzon is great for portfolio reporting, portfolio accounting, billing, CRM, document storage. So, Advyzon has been a really nice solution. Something that was really important to me is I didn\u0026#39;t want to have 15 applications to do things, right? I wanted everything to be as streamlined as possible, and I wanted the functions to talk to each other. I wanted the applications to talk to each other from a tech perspective, and I wanted it to be as simple and as streamlined as possible.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, that\u0026#39;s the appeal for Advyzon.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Most of us kind of build our tech around the big three categories: financial planning software, portfolio management, and CRM. And Advyzon checks two of your boxes at once because it does the portfolio reporting and the CRM side.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct. As far as financial planning goes, I\u0026#39;ve used most of the major financial planning software out there. I use MoneyGuide Pro. I like it. It works. It\u0026#39;s not perfect. So, I do have executive summaries and sort of additional supplemental materials that I\u0026#39;ve built over time. And to me, the planning software has always just been a tool, it\u0026#39;s one tool of many. So, I use it as that for what it\u0026#39;s worth, and then I sort of create and build out other sort of ancillary components of the planning that work for me based on what has resonated with my clients. And the executive summary pieces has been, I think, really positive.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, what is the executive summary for you? What do you create?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, it\u0026#39;s different for each client based on their needs, but there are some common threads that run through it. So, in the beginning, it\u0026#39;s a one-pager that basically summarizes the MoneyGuide Pro report, assumptions, results, etc. Then from there, I do have some Excel models that I\u0026#39;ve built that kind of import in with cash flows, as well as some tax projections. And then from there, it sort of depends on what the client\u0026#39;s needs are, but there\u0026#39;s some charitable planning components, if that\u0026#39;s something that is of interest. It really depends on what the client\u0026#39;s needs are. Then there\u0026#39;s sort of an action item list, things bullet pointed, as well as some text, because I found some people like visual images, some people prefer words. I like to have a little bit of everything and really lean into what type of communication is ideal for what client.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, how many pages is this? How big is this thing?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Typically five to six.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e If it\u0026#39;s a more complicated, I think like I\u0026#39;ve gone up to maybe 12 but the idea is to keep it more brief, depending on the flowchart. If we\u0026#39;re doing flowcharts and stuff, it can get a little longer.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so then what happens to the rest of MoneyGuide Pro?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, MoneyGuide Pro is the foundation, right? So, MoneyGuide Pro is sort of the foundation for building out the plan. But then we take that information and sort of expand upon it and then continue to develop it in a way that meets our clients\u0026#39; needs. And the client still gets MoneyGuide Pro planning output, but that in and of itself to me is not... It\u0026#39;s good, but I think there\u0026#39;s opportunity for something else as well.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, the output from the software is the technical appendix?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And after the main portion, the plan that you\u0026#39;re making, which is the five to six-page executive summary?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Correct. That was really drilled down into this particular client.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And how do you produce the executive summaries? Is this manually in Word for each client kind of thing?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, it\u0026#39;s typically in PowerPoint, but there are components of Excel that kind of are built into it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Oh, interesting. So, you\u0026#39;re building primarily in PowerPoint, so really very bullet point slide by slide.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e There\u0026#39;s no paragraphs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Yeah, not paragraph narrative form at all.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e No, there\u0026#39;s no paragraphs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e From my experience, people do not want to read paragraphs of anything.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay. And so executive summary leads and then if they\u0026#39;ve got questions and you get into the software output side.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, it depends on the client. Sometimes we\u0026#39;ll do sort of a high... I\u0026#39;ll ask them. I have some clients... Some of my executives don\u0026#39;t want to touch that MoneyGuide Pro report ever, so we go straight to the executive summary. We talk through the one-pager of assumptions and outputs and they\u0026#39;re happy. They\u0026#39;re like, \u0026#34;Great. I don\u0026#39;t ever want to see that thing again,\u0026#34; because it is quite big, right? But others sometimes want to spend a little time in it, and that\u0026#39;s okay, too. It just sort of depends on the client and what their desire is to dig deep into the data. MoneyGuide Pro does have some really good output that can be valuable in the conversation depending on the situation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so what\u0026#39;s the ask to the client?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, by the point we\u0026#39;re getting ready to present a plan, I have a pretty good sense of how they like to share data because keep in mind, they\u0026#39;ve shared data with me so that I can build a plan. So, it just depends. You get a sense for people in talking with them. And sometimes I\u0026#39;ll say, \u0026#34;I have a lot of materials prepared here for you today. I really want to make the most of our time. So, help me understand, where would you like to start? We could do a high-level review. I also have some supporting documentation that we can dive into with some more detail. Where would you like to start?\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e And I\u0026#39;ll put them side by side. And sometimes I toggle between the two.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Low Point On Nicole’s Journey [1:14:42]\" id=\"the-low-point-on-nicoles-journey-11442\"\u003eThe Low Point On Nicole\u0026#39;s Journey [1:14:42]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So then as you\u0026#39;ve gone through this journey, what was the low point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e The low point was when I had just started the firm and I had no clients. And I recall there was this day where I looked at my cellphone and I had no emails to my business email. I had no telephone calls. And I remember thinking to myself, \u0026#34;I have not gotten a single email today. This is never going to work.\u0026#34; And I was used to getting tons of emails, right? At one point, I thought the phone was broken. Is this working? And that made me very nervous. I was like, \u0026#34;This is just not going to work.\u0026#34; And you pick yourself up and keep pushing forward. And it did end up working, but there were certainly slow days, Michael. I was getting emails and phone calls, but I had that sort of same experience as it relates to client onboarding this past summer where there was just not a lot of activity surrounding new client acquisition, and that was a really difficult time for me to navigate through. But I did. I got through it. And now I\u0026#39;m at a point where I\u0026#39;m onboarding multiple clients all at once. So, being a business owner, you have to weather that volatility, those storms of ups and downs, and just have the courage and the strength to know that you will get through the hard days and keep doing what you do, because you have to believe it will work out.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Are there points where you get doubt about whether it will work out?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Not anymore.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e How did you handle it when you did?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I had doubts. Of course I had doubts. I went back to my why. Why am I doing this? Why? And I truly believe that I am doing good work and that there are people out there who want the relationship, who want the planning tenacity, who want that combination, and I just have to find those people. So, on those days where the doubt started creeping in, I had to go back to my why.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, are there other things that you know now that you wish you could go back and tell you from five or six years ago when you were first hanging the shingle?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I would have told myself to be patient. That is not my strongest quality, I will admit, and I would have told myself to be patient. I would have told myself to really dial into that branding guide, dial into the ideal client because there were points in the business, after coming out of some of those slower times, that I did take on client relationships that maybe weren\u0026#39;t quite ideal, that didn\u0026#39;t quite fit the key components, where there was some misalignment. And it hasn\u0026#39;t been positive for me. It hasn\u0026#39;t been ideal for the client. It\u0026#39;s not a great outcome. So, I want every client to have a great experience. And I want there to be a really nice alignment. I want to get what makes them tick. I want them to get what makes me tick, and I want it to be very...and when that all falls into place, it\u0026#39;s just very fulfilling. And there are a couple of scenarios where that was not the case. And if I could rewind time, I would have helped those clients find a better fit in a home for them.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And what did you end up needing to do with them? Did you have to part ways with them?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, I did, and I do believe it was for the best, but better to not even go down that road, because now you\u0026#39;re unwinding things that you did, and again, time is a resource and that is not a good use of a limited resource.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, I always find this dynamic fascinating, because virtually all of us who have some number of years of experience can tell the story of clients that we took on that weren\u0026#39;t a good fit, that were, in retrospect, it actually would have been significantly easier if we\u0026#39;ve never taken this person than to take them and have to unwind it later. And we all still seem to do it. What would you have told yourself to not succumb to the temptation in the moment to take them when new client flow has been slow and we\u0026#39;re freaking out about our revenue a little bit?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Yes, well, that\u0026#39;s it, right? I think you just identified the reason why, at least in my instance, I did that, and that is because that\u0026#39;s where the patience comes in, and the conviction in your value, and your messaging, and your branding, because when you\u0026#39;re coming off or in a slow period, it feels like... We have recency syndrome. It feels like it\u0026#39;s going to be like that forever. And then someone comes along, and maybe they\u0026#39;re not ideal and maybe you see some red flags of how they don\u0026#39;t necessarily fit into your business model, but you convince yourself that you\u0026#39;re going to make it work because it has been slow and because you are running a business and because revenue looks the way it looks and all of those things, right? So, I think that\u0026#39;s a very human thing to do. I think it\u0026#39;s a very normal thing to do. So, really you\u0026#39;re fighting your human tendency on this one, and for me, it\u0026#39;s that recency syndrome that really gets me. So, it\u0026#39;s like, okay, if it\u0026#39;s been a period of time and there haven\u0026#39;t been new clients and then your brain starts spiraling, thinking, \u0026#34;I\u0026#39;m never going to get a new client again.\u0026#34; So, I would just tell myself to chill and to relax and do whatever you do, to meditate and go back to a calm state so that you can evaluate it with clearer perspective and make the best decision for your business.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so when you talk about the challenges around being patient while growing the business, that\u0026#39;s where it crops up. It\u0026#39;s the, \u0026#34;I took people that felt like I needed revenue at the time. And in retrospect, I probably didn\u0026#39;t needed that much given how hard it was to execute myself later.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Absolutely. And I\u0026#39;d maybe even go so far as to say, yes, revenue is a component, but maybe even just activity is another component of like, \u0026#34;Look, I\u0026#39;ve onboarded a client. This is activity. This is good, positive activity.\u0026#34; Because like I said, when you\u0026#39;re starting off, you can only review your books and records so many times for completeness.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e And so the readjustment advice you\u0026#39;d give your prior self facing that moment is just get back to the ‘why\u0026#39; that you\u0026#39;re doing this in the first place.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Absolutely. And with a boutique firm, I think the alignment is even more important because of the limited resources and because of, by virtue of being a more boutique firm, the closeness of the relationship. You want to fill your life with people that you enjoy, with people who you are aligned with, with people who you share common values with, who appreciate your work, in my instance, who want that sort of partnership, who seek value in it. Looking back at it, as we\u0026#39;re having this conversation, I\u0026#39;m thinking, \u0026#34;Why would you ever have set yourself up in this position?\u0026#34; Human nature, fear, need to do something, activity.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Nicole’s Advice For Advisors [1:23:38]\" id=\"nicoles-advice-for-advisors-thinking-about-starting-their-own-ria-12338\"\u003eNicole\u0026#39;s Advice For Advisors Thinking About Starting Their Own RIA [1:23:38]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, any other advice you would give younger or just newer advisors coming into the profession and starting a firm today?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e It is certainly not easy. And when I was deciding what might be next for me, I considered several options to join a larger, more established firm. And none of them felt quite right. There were some very fine options, and there are some very fine firms in my community. But none of them felt quite right for me. And it is not easy. And a lot of people told me, \u0026#34;Nicole, this is not going to be easy. You should just join another firm.\u0026#34; And that probably would have been easier. They\u0026#39;re right. But it wouldn\u0026#39;t have been nearly as fulfilling or as meaningful for me. So, while I agree that it\u0026#39;s not easy, I would say if someone is on the brink of wanting to start an RIA, it has been one of the most difficult yet most rewarding things I have ever done. And I would fully encourage them to do that, because as you said, Michael, the tech stack today is amazing. You know, 20 years ago, when I graduated or whatnot and came into the business, I don\u0026#39;t know if I would have been able to do that. This technology didn\u0026#39;t exist. It exists today so that we can can do what we do successfully and it can truly be an amazing career. I love financial services. I love financial planning. I think it\u0026#39;s a phenomenal career. And I would just encourage anyone who is considering it to really take the leap.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e It is one of the things that I chuckle about in today\u0026#39;s environment. There\u0026#39;s all this discussion today of you...you can\u0026#39;t survive as a small or solo advisor, right? So, you have to merge and be acquired and be part of a large firm. And all these large firms today were tiny firms 20 years ago, and 20 years ago, the technology was awful. And if you could be a successful...and 20 years ago, it was RIAs and Merrill Lynch and Morgan Stanley. And so if 20 years ago, the startups with terrible technology took on wirehouses and have been the only growing channel for the past 20 years, and then you get all the amazing technology today, I just look at them like... I kind of feel like there\u0026#39;s literally never been a better time to be a solo or small firm than today when you look at the amount of tech that we\u0026#39;ve got and how amazing it is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e The technology has been a gamechanger truly. It\u0026#39;s enabled me to launch this RIA.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, any other advice or guidance just for other folks in large firms as you had been that are weighing this? Do I hang my own shingle, go to another firm or stay put just as someone who went through that crossroads?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e I think my advice would be to really do a assessment of yourself and evaluate what is important to you and why, evaluate how you like to work, what environment you like to work in, what types of clients you like to work in, and be honest with yourself. What works best for you? And I think that will guide your decision making, right? Because that alignment has to be there. And if it\u0026#39;s not, you\u0026#39;re going to be unhappy.\u003c/p\u003e\n\u003ch2 id=\"what-success-means-to-nicole-12745\"\u003eWhat Success Means To Nicole [1:27:45]\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e So, as we wrap up, this is a podcast about success. And just one of the themes that comes up is literally that word success means very different things to different people. And someone who\u0026#39;s gone and launched their own business and now on this wonderfully successful path as you\u0026#39;re at $70 million after five or six years and getting ready for advisor hires, the business is growing and scaling in such a wonderful place, how do you define success for yourself at this point?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e So, to me, success is the ability to do work that I enjoy and that I find meaningful with people that I enjoy being around and being able to have the financial freedom and flexibility to support my family and to live a life of my choosing. So, that really is success. And I guess I would add also I\u0026#39;ve always had strong ties in my community. I\u0026#39;ve always been active in my community. I enjoy being active in certain philanthropic pursuits. And being able to really give back to my community in those ways is another component of success.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Very cool. I love it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNicole:\u003c/strong\u003e Thank you for having me, Michael. This was great.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMichael:\u003c/strong\u003e Absolutely. Thank you, Nicole, for joining us on the \u0026#34;Financial Advisor Success\u0026#34; Podcast.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;#FASuccess Ep 436: Hiring A Branding Firm To Figure Out The Best Way To Connect With Your Ideal Clients, With Nicole Gopoian Wirick\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-6a5e3603ec6593c517208673-=\"\"\u003e\n                    \u003cimg decoding=\"async\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "78 min read",
  "publishedTime": "2025-05-06T07:02:58-04:00",
  "modifiedTime": "2025-05-06T21:08:47Z"
}
