{
  "id": "3fad967b-3645-4518-81db-90f44a5420f3",
  "title": "#576: The World’s Richest People Are Weird by Design, with William Green",
  "link": "https://affordanything.com/576-the-worlds-richest-people-are-weird-by-design-with-william-green/",
  "description": "The world's greatest investors have a secret: they're weird. When one young fund manager met Bill Miller for the first time, he refused to shake hands. Instead, he locked eyes and declared: \"I'm going to beat you, man.\" William Green joins us to share what he's learned from decades of conversations with investing legends — from the hyper-competitive to the deeply philosophical. These conversations reveal that success isn't just about strategy; it's about understanding yourself and playing to your strengths. The best investors are mavericks who think differently. They're willing to look strange, be lonely, and diverge from the crowd. Templeton demonstrated this during WWII. When Germany invaded France and markets crashed, he bought 104 stocks trading under $1 — including 37 bankrupt companies. His contrarian bet paid off 5x when markets recovered. But Green emphasizes this isn't just about getting rich. His decades of interviews reveal deeper wisdom about building a good life: — Great investors focus on what they can control. They can't predict markets, but they can manage their behavior and emotions. — They embrace simplicity. Jack Bogle advocated owning low-cost index funds rather than chasing complex strategies. — They understand odds and risk. Howard Marks asks \"What's the consequence if I'm wrong?\" before making decisions. — They play to their strengths. Charlie Munger says if you're 5'3\", don't try to be a pro basketball player. — They live below their means. As investor Tom Gaynor notes, \"If you're living within your means, you're already rich.\" Green shares a practical framework called HALT PS — don't make important decisions when Hungry, Angry, Lonely, Tired, in Pain, or Stressed. This applies beyond investing to daily life. The conversation explores how to build resilience before market crashes through healthy habits, self-awareness, and preparation. Green notes that many successful investors practice meditation and read widely across disciplines. Even legends make mistakes. Bill Miller saw his assets drop from $77 billion to $800 million during the 2008 crisis. But he rebounded by staying true to his principles and learning from failure. Green's key message? Focus less on getting rich and more on building an \"anti-fragile\" life aligned with your values and strengths. The best investors aren't just good at making money — they're skilled at creating lives of meaning and purpose. Find more from William Green at williamgreenwrites.com or on his podcast Richer, Wiser, Happier, featured on the We Study Billionaires feed.",
  "author": "Paula Pant",
  "published": "Sun, 26 Jan 2025 20:58:12 +0000",
  "source": "https://affordanything.com/feed/",
  "categories": [
    "Episodes",
    "Investing"
  ],
  "byline": "",
  "length": 4045,
  "excerpt": "The world’s greatest investors have a secret: they’re weird.",
  "siteName": "",
  "favicon": "https://affordanything.com/wp-content/uploads/eminence/favicon/favicon-196x196.png?v=10932",
  "text": "The world’s greatest investors have a secret: they’re weird. When one young fund manager met Bill Miller for the first time, he refused to shake hands. Instead, he locked eyes and declared: “I’m going to beat you, man.” William Green joins us to share what he’s learned from decades of conversations with investing legends — from the hyper-competitive to the deeply philosophical. These conversations reveal that success isn’t just about strategy; it’s about understanding yourself and playing to your strengths. The best investors are mavericks who think differently. They’re willing to look strange, be lonely, and diverge from the crowd. Templeton demonstrated this during WWII. When Germany invaded France and markets crashed, he bought 104 stocks trading under $1 — including 37 bankrupt companies. His contrarian bet paid off 5x when markets recovered. But Green emphasizes this isn’t just about getting rich. His decades of interviews reveal deeper wisdom about building a good life: — Great investors focus on what they can control. They can’t predict markets, but they can manage their behavior and emotions. — They embrace simplicity. Jack Bogle advocated owning low-cost index funds rather than chasing complex strategies. — They understand odds and risk. Howard Marks asks “What’s the consequence if I’m wrong?” before making decisions. — They play to their strengths. Charlie Munger says if you’re 5’3″, don’t try to be a pro basketball player. — They live below their means. As investor Tom Gaynor notes, “If you’re living within your means, you’re already rich.” Green shares a practical framework called HALT PS — don’t make important decisions when Hungry, Angry, Lonely, Tired, in Pain, or Stressed. This applies beyond investing to daily life. The conversation explores how to build resilience before market crashes through healthy habits, self-awareness, and preparation. Green notes that many successful investors practice meditation and read widely across disciplines. Even legends make mistakes. Bill Miller saw his assets drop from $77 billion to $800 million during the 2008 crisis. But he rebounded by staying true to his principles and learning from failure. Green’s key message? Focus less on getting rich and more on building an “anti-fragile” life aligned with your values and strengths. The best investors aren’t just good at making money — they’re skilled at creating lives of meaning and purpose. Find more from William Green at williamgreenwrites.com or on his podcast Richer, Wiser, Happier, featured on the We Study Billionaires feed. Timestamps: Note: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths. 3:00 – Meeting Sir John Templeton in the Bahamas 5:12 – Templeton’s WWII stock strategy during market crash 14:00 – Wisdom vs survivorship bias in investing stories 17:38 – Why great investors recommend index funds 28:42 – Prioritizing freedom over wealth maximization 38:31 – Bogle’s client-first philosophy 51:32 – Living below means for market volatility 53:37 – HALT PS conditions leading to poor choices 1:01:07 – Using data for better decision making 1:07:01 – Bogle’s emphasis on simple investing 1:10:36 – Danoff’s “stocks follow earnings” strategy Thanks to our sponsors! Shopify Diversify your business by selling physical and digital products through Shopify’s all-in-one platform. Go to shopify.com/paula for a one dollar a month trial and get full access to Shopify’s entire suite of features. Policygenius Go to policygenius.com for free quotes and comparisons across many insurers. With Policygenius, you can find life insurance policies that start at just $292 per year for $1 million of coverage. NetSuite NetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to NetSuite.com/PAULA to download the CFO’s Guide to AI and Machine Learning.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain\u003e\u003carticle aria-label=\"#576: The World’s Richest People Are Weird by Design, with William Green\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/2025/01/william-green-300x189.jpg\" alt=\"\" width=\"300\" height=\"189\" srcset=\"https://affordanything.com/wp-content/uploads/2025/01/william-green-300x189.jpg 300w, https://affordanything.com/wp-content/uploads/2025/01/william-green.jpg 310w\" sizes=\"(max-width: 300px) 100vw, 300px\"/\u003eThe world’s greatest investors have a secret: they’re weird.\u003c/p\u003e\n\u003cp\u003eWhen one young fund manager met Bill Miller for the first time, he refused to shake hands. Instead, he locked eyes and declared: “I’m going to beat you, man.”\u003c/p\u003e\n\u003cp\u003eWilliam Green joins us to share what he’s learned from decades of conversations with investing legends — from the hyper-competitive to the deeply philosophical.\u003c/p\u003e\n\u003cp\u003eThese conversations reveal that success isn’t just about strategy; it’s about understanding yourself and playing to your strengths.\u003c/p\u003e\n\u003cp\u003eThe best investors are mavericks who think differently. They’re willing to look strange, be lonely, and diverge from the crowd.\u003c/p\u003e\n\u003cp\u003eTempleton demonstrated this during WWII. When Germany invaded France and markets crashed, he bought 104 stocks trading under $1 — including 37 bankrupt companies. His contrarian bet paid off 5x when markets recovered.\u003c/p\u003e\n\u003cp\u003eBut Green emphasizes this isn’t just about getting rich.\u003c/p\u003e\n\u003cp\u003eHis decades of interviews reveal deeper wisdom about building a good life:\u003c/p\u003e\n\u003cp\u003e— Great investors focus on what they can control. They can’t predict markets, but they can manage their behavior and emotions.\u003c/p\u003e\n\u003cp\u003e— They embrace simplicity. Jack Bogle advocated owning low-cost index funds rather than chasing complex strategies.\u003c/p\u003e\n\u003cp\u003e— They understand odds and risk. Howard Marks asks “What’s the consequence if I’m wrong?” before making decisions.\u003c/p\u003e\n\u003cp\u003e— They play to their strengths. Charlie Munger says if you’re 5’3″, don’t try to be a pro basketball player.\u003c/p\u003e\n\u003cp\u003e— They live below their means. As investor Tom Gaynor notes, “If you’re living within your means, you’re already rich.”\u003c/p\u003e\n\u003cp\u003eGreen shares a practical framework called HALT PS — don’t make important decisions when Hungry, Angry, Lonely, Tired, in Pain, or Stressed. This applies beyond investing to daily life.\u003c/p\u003e\n\u003cp\u003eThe conversation explores how to build resilience before market crashes through healthy habits, self-awareness, and preparation. Green notes that many successful investors practice meditation and read widely across disciplines.\u003c/p\u003e\n\u003cp\u003eEven legends make mistakes. Bill Miller saw his assets drop from $77 billion to $800 million during the 2008 crisis. But he rebounded by staying true to his principles and learning from failure.\u003c/p\u003e\n\u003cp\u003eGreen’s key message? Focus less on getting rich and more on building an “anti-fragile” life aligned with your values and strengths.\u003c/p\u003e\n\u003cp\u003eThe best investors aren’t just good at making money — they’re skilled at creating lives of meaning and purpose.\u003c/p\u003e\n\u003cp\u003eFind more from William Green at williamgreenwrites.com or on his podcast Richer, Wiser, Happier, featured on the We Study Billionaires feed.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cu\u003eTimestamps:\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNote: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e3:00 – Meeting Sir John Templeton in the Bahamas\u003c/p\u003e\n\u003cp\u003e5:12 – Templeton’s WWII stock strategy during market crash\u003c/p\u003e\n\u003cp\u003e14:00 – Wisdom vs survivorship bias in investing stories\u003c/p\u003e\n\u003cp\u003e17:38 – Why great investors recommend index funds\u003c/p\u003e\n\u003cp\u003e28:42 – Prioritizing freedom over wealth maximization\u003c/p\u003e\n\u003cp\u003e38:31 – Bogle’s client-first philosophy\u003c/p\u003e\n\u003cp\u003e51:32 – Living below means for market volatility\u003c/p\u003e\n\u003cp\u003e53:37 – HALT PS conditions leading to poor choices\u003c/p\u003e\n\u003cp\u003e1:01:07 – Using data for better decision making\u003c/p\u003e\n\u003cp\u003e1:07:01 – Bogle’s emphasis on simple investing\u003c/p\u003e\n\u003cp\u003e1:10:36 – Danoff’s “stocks follow earnings” strategy\u003c/p\u003e\n\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/listen-to-afford-anything-on-itunes.png\" alt=\"listen to afford anything on itunes\" width=\"150\" height=\"38\"/\u003e\u003ca href=\"https://subscribeonandroid.com/paulaandjaymoney.libsyn.com/rss\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/subscribe-on-android-afford-anything.png\" alt=\"subscribe on android afford anything\" width=\"110\" height=\"40\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eThanks to our sponsors!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eShopify\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nDiversify your business by selling physical and digital products through Shopify’s all-in-one platform. Go to \u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eshopify.com/paula\u003c/strong\u003e\u003c/a\u003e for a one dollar a month trial and get full access to Shopify’s entire suite of features.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://policygenius.com/\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003ePolicygenius\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nGo to \u003cstrong\u003e\u003ca href=\"https://policygenius.com/\" target=\"_blank\" rel=\"noopener\"\u003epolicygenius.com\u003c/a\u003e \u003c/strong\u003efor free quotes and comparisons across many insurers. With Policygenius, you can find life insurance policies that start at just $292 per year for $1 million of coverage.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nNetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to \u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite.com/PAULA \u003c/strong\u003e\u003c/a\u003eto download the CFO’s Guide to AI and Machine Learning.\u003c/p\u003e\n\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
