{
  "id": "4ac7d5bb-fed7-4dad-aa38-d715efd45ccb",
  "title": "#552: The Harsh Truth About Getting Wealthy",
  "link": "https://affordanything.com/552-the-harsh-truth-about-getting-wealthy/",
  "description": "Dr. Brad Klontz and Adrian Brambila join us for part two of their three-part series on \"harsh truths\" about building wealth. The first truth sets the tone: being poor sucks. But they quickly distinguish between being \"broke\" (having no money, which can be temporary) and having a \"poor mindset\" (which keeps people stuck). Even high-income earners can have a poor mindset, they explain, sharing examples of pro athletes and celebrities who earned millions but lost it all. The discussion moves to whether the financial system is \"rigged.\" While acknowledging real systemic challenges, they argue that viewing it as a rigged system leads to powerlessness. Instead, they suggest viewing wealth-building as a game with specific rules to learn and master. Several guests share candid stories about their own financial journeys. Brambila describes living in a van while earning seven figures, challenging assumptions about what wealth looks like. Klontz reveals how he lost money day trading during the tech bubble, using that experience to warn against get-rich-quick schemes. The conversation tackles touchy subjects like distancing yourself from friends with poor money mindsets. Klontz shares how he had to end a friendship with his best man when their different approaches to business created tension. They emphasize this isn't about income levels - it's about mindset and habits. Through personal examples, they explore why people often undervalue their work. Brambila describes initially pricing his online courses too low due to imposter syndrome. They discuss how both employees and entrepreneurs need to understand their true market value. The duo challenges common beliefs about jobs, arguing that \"only liars love their jobs\" since most people would change how they work if they had financial freedom. They use the example of petting puppies - even a dream job becomes less appealing when you lose control over your time. On lottery tickets, they expand beyond just criticizing gambling to examine how get-rich-quick mindsets distract from real wealth-building strategies. Klontz shares research showing 97% of day traders lose money, using this to illustrate why seemingly easy paths to wealth usually fail. Throughout the episode, the guests weave together psychology, practical advice, and frank discussion of uncomfortable truths about money. While some of their statements spark controversy, they back up their positions with research and real-world examples from their own lives and their work with clients.",
  "author": "Paula Pant",
  "published": "Mon, 28 Oct 2024 12:08:10 +0000",
  "source": "https://affordanything.com/feed/",
  "categories": [
    "Episodes",
    "FIRE",
    "Investing",
    "Lifestyle",
    "Myths",
    "Personal Finance 101"
  ],
  "byline": "",
  "length": 4994,
  "excerpt": "Dr. Brad Klontz and Adrian Brambila join us for part two of their three-part series on “harsh truths” about building wealth.",
  "siteName": "",
  "favicon": "https://affordanything.com/wp-content/uploads/eminence/favicon/favicon-196x196.png?v=10932",
  "text": "Dr. Brad Klontz and Adrian Brambila join us for part two of their three-part series on “harsh truths” about building wealth. The first truth sets the tone: being poor sucks. But they quickly distinguish between being “broke” (having no money, which can be temporary) and having a “poor mindset” (which keeps people stuck). Even high-income earners can have a poor mindset, they explain, sharing examples of pro athletes and celebrities who earned millions but lost it all. The discussion moves to whether the financial system is “rigged.” While acknowledging real systemic challenges, they argue that viewing it as a rigged system leads to powerlessness. Instead, they suggest viewing wealth-building as a game with specific rules to learn and master. Several guests share candid stories about their own financial journeys. Brambila describes living in a van while earning seven figures, challenging assumptions about what wealth looks like. Klontz reveals how he lost money day trading during the tech bubble, using that experience to warn against get-rich-quick schemes. The conversation tackles touchy subjects like distancing yourself from friends with poor money mindsets. Klontz shares how he had to end a friendship with his best man when their different approaches to business created tension. They emphasize this isn’t about income levels – it’s about mindset and habits. Through personal examples, they explore why people often undervalue their work. Brambila describes initially pricing his online courses too low due to imposter syndrome. They discuss how both employees and entrepreneurs need to understand their true market value. The duo challenges common beliefs about jobs, arguing that “only liars love their jobs” since most people would change how they work if they had financial freedom. They use the example of petting puppies – even a dream job becomes less appealing when you lose control over your time. On lottery tickets, they expand beyond just criticizing gambling to examine how get-rich-quick mindsets distract from real wealth-building strategies. Klontz shares research showing 97% of day traders lose money, using this to illustrate why seemingly easy paths to wealth usually fail. Throughout the episode, the guests weave together psychology, practical advice, and frank discussion of uncomfortable truths about money. While some of their statements spark controversy, they back up their positions with research and real-world examples from their own lives and their work with clients. Timestamps: Note: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths. 0:00 Opening announcement about part two of three-part series with Dr. Brad Klontz and Adrienne Brambila 3:35 Difference between being “broke” (temporary) vs having a “poor mindset” (permanent) 14:00 Why the system isn’t rigged; it’s just a game with rules to learn 21:00 Your teachers can’t teach you to be rich – who to take advice from 30:00 Only liars love their jobs – a discussion of work and fulfillment 47:00 Why you’re getting paid what you’re worth right now 54:00 How lottery tickets and get-rich-quick schemes keep you poor 1:04:00 Getting rid of friends with poor money mindsets 1:19:00 Stories about failed business partnerships and lending money to friends 1:28:00 How successful people handle growing wealth gaps with old friends 1:39:00 Discussion of negative friend behaviors that can sabotage wealth building 1:48:00 Closing thoughts and where to find more information Thanks to our sponsors! Indeed If you’re looking for amazing talent to bolster your team, you need Indeed. Go to indeed.com/paula for a $75 job credit to upgrade your listing and start hiring today. Shopify Diversify your business by selling physical and digital products through Shopify’s all-in-one platform. Go to shopify.com/paula for $1/month trial and get full access to Shopify’s entire suite of features. NetSuite NetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to NetSuite.com/PAULA  to download the CFO’s Guide to AI and Machine Learning. Quince Quince offers a range of high-quality items at prices within reach. Go to Quince.com/paula for free shipping on your order and 365-day returns. Field of Greens FIELD OF GREENS is unlike any fruit and vegetable or green product. Each fruit and vegetable was selected by doctors to help support vital body functions like heart, liver, kidneys, metabolism, and immune system. Go to fieldofgreens.com/paula for 15% off and free shipping. Monarch Money Monarch is the top-rated, all-in-one personal finance app. It gives you a comprehensive view of all your accounts, investments, transactions, cash flow,net worth, and more. Go to monarchmoney.com/paula to for your extended thirty-day FREE trial.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain\u003e\u003carticle aria-label=\"#552: The Harsh Truth About Getting Wealthy\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/2024/10/brad-3-300x298.png\" alt=\"\" width=\"300\" height=\"298\" srcset=\"https://affordanything.com/wp-content/uploads/2024/10/brad-3-300x298.png 300w, https://affordanything.com/wp-content/uploads/2024/10/brad-3-150x150.png 150w, https://affordanything.com/wp-content/uploads/2024/10/brad-3-768x762.png 768w, https://affordanything.com/wp-content/uploads/2024/10/brad-3-480x476.png 480w, https://affordanything.com/wp-content/uploads/2024/10/brad-3-600x595.png 600w, https://affordanything.com/wp-content/uploads/2024/10/brad-3.png 792w\" sizes=\"(max-width: 300px) 100vw, 300px\"/\u003eDr. Brad Klontz and Adrian Brambila join us for part two of their three-part series on “harsh truths” about building wealth.\u003c/p\u003e\n\u003cp\u003eThe first truth sets the tone: being poor sucks. But they quickly distinguish between being “broke” (having no money, which can be temporary) and having a “poor mindset” (which keeps people stuck).\u003c/p\u003e\n\u003cp\u003eEven high-income earners can have a poor mindset, they explain, sharing examples of pro athletes and celebrities who earned millions but lost it all.\u003c/p\u003e\n\u003cp\u003eThe discussion moves to whether the financial system is “rigged.” While acknowledging real systemic challenges, they argue that viewing it as a rigged system leads to powerlessness. Instead, they suggest viewing wealth-building as a game with specific rules to learn and master.\u003c/p\u003e\n\u003cp\u003eSeveral guests share candid stories about their own financial journeys. Brambila describes living in a van while earning seven figures, challenging assumptions about what wealth looks like.\u003c/p\u003e\n\u003cp\u003eKlontz reveals how he lost money day trading during the tech bubble, using that experience to warn against get-rich-quick schemes.\u003c/p\u003e\n\u003cp\u003eThe conversation tackles touchy subjects like distancing yourself from friends with poor money mindsets. Klontz shares how he had to end a friendship with his best man when their different approaches to business created tension. They emphasize this isn’t about income levels – it’s about mindset and habits.\u003c/p\u003e\n\u003cp\u003eThrough personal examples, they explore why people often undervalue their work. Brambila describes initially pricing his online courses too low due to imposter syndrome. They discuss how both employees and entrepreneurs need to understand their true market value.\u003c/p\u003e\n\u003cp\u003eThe duo challenges common beliefs about jobs, arguing that “only liars love their jobs” since most people would change how they work if they had financial freedom. They use the example of petting puppies – even a dream job becomes less appealing when you lose control over your time.\u003c/p\u003e\n\u003cp\u003eOn lottery tickets, they expand beyond just criticizing gambling to examine how get-rich-quick mindsets distract from real wealth-building strategies. Klontz shares research showing 97% of day traders lose money, using this to illustrate why seemingly easy paths to wealth usually fail.\u003c/p\u003e\n\u003cp\u003eThroughout the episode, the guests weave together psychology, practical advice, and frank discussion of uncomfortable truths about money. While some of their statements spark controversy, they back up their positions with research and real-world examples from their own lives and their work with clients.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cu\u003eTimestamps:\u003c/u\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNote: Timestamps will vary on individual listening devices based on dynamic advertising run times. The provided timestamps are approximate and may be several minutes off due to changing ad lengths.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e0:00 Opening announcement about part two of three-part series with Dr. Brad Klontz and Adrienne Brambila\u003c/p\u003e\n\u003cp\u003e3:35 Difference between being “broke” (temporary) vs having a “poor mindset” (permanent)\u003c/p\u003e\n\u003cp\u003e14:00 Why the system isn’t rigged; it’s just a game with rules to learn\u003c/p\u003e\n\u003cp\u003e21:00 Your teachers can’t teach you to be rich – who to take advice from\u003c/p\u003e\n\u003cp\u003e30:00 Only liars love their jobs – a discussion of work and fulfillment\u003c/p\u003e\n\u003cp\u003e47:00 Why you’re getting paid what you’re worth right now\u003c/p\u003e\n\u003cp\u003e54:00 How lottery tickets and get-rich-quick schemes keep you poor\u003c/p\u003e\n\u003cp\u003e1:04:00 Getting rid of friends with poor money mindsets\u003c/p\u003e\n\u003cp\u003e1:19:00 Stories about failed business partnerships and lending money to friends\u003c/p\u003e\n\u003cp\u003e1:28:00 How successful people handle growing wealth gaps with old friends\u003c/p\u003e\n\u003cp\u003e1:39:00 Discussion of negative friend behaviors that can sabotage wealth building\u003c/p\u003e\n\u003cp\u003e1:48:00 Closing thoughts and where to find more information\u003c/p\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/listen-to-afford-anything-on-itunes.png\" alt=\"listen to afford anything on itunes\" width=\"150\" height=\"38\"/\u003e\u003ca href=\"https://subscribeonandroid.com/paulaandjaymoney.libsyn.com/rss\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://affordanything.com/wp-content/uploads/subscribe-on-android-afford-anything.png\" alt=\"subscribe on android afford anything\" width=\"110\" height=\"40\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eThanks to our sponsors!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://indeed.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eIndeed\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nIf you’re looking for amazing talent to bolster your team, you need Indeed. Go to \u003ca href=\"https://indeed.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eindeed.com/paula\u003c/strong\u003e\u003c/a\u003e for a $75 job credit to upgrade your listing and start hiring today.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eShopify\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nDiversify your business by selling physical and digital products through Shopify’s all-in-one platform. Go to \u003ca href=\"https://www.shopify.com/free-trial?utm_campaign=paid_audio_-_podcast_-_amer_-_united_states_-_all_-_experimential_-_english_-_awareness\u0026amp;utm_source=podcast\u0026amp;utm_medium=audio\u0026amp;utm_term=paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eshopify.com/paula\u003c/strong\u003e\u003c/a\u003e for $1/month trial and get full access to Shopify’s entire suite of features.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nNetSuite is the number one cloud financial system, bringing accounting, financial management, inventory, HR, into ONE platform, and ONE source of truth. Head to \u003ca href=\"http://www.netsuite.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eNetSuite.com/PAULA  \u003c/strong\u003e\u003c/a\u003eto download the CFO’s Guide to AI and Machine Learning.\u003c/p\u003e\n\u003carticle aria-label=\"#537: Ask Paula: “I Ran Out of Gas with 85 Cents in My Bank Account”\"\u003e\n\u003cdiv\u003e\n\u003carticle aria-label=\"#537: Ask Paula: “I Ran Out of Gas with 85 Cents in My Bank Account”\"\u003e\n\u003cdiv\u003e\n\u003carticle aria-label=\"#537: Ask Paula: “I Ran Out of Gas with 85 Cents in My Bank Account”\"\u003e\n\u003cdiv\u003e\n\u003carticle aria-label=\"#537: Ask Paula: “I Ran Out of Gas with 85 Cents in My Bank Account”\"\u003e\n\u003cdiv\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://quince.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eQuince\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nQuince offers a range of high-quality items at prices within reach. Go to \u003ca href=\"https://quince.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eQuince.com/paula\u003c/strong\u003e\u003c/a\u003e for free shipping on your order and 365-day returns.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://fieldofgreens.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eField of Greens\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nFIELD OF GREENS is unlike any fruit and vegetable or green product. Each fruit and vegetable was selected by doctors to help support vital body functions like heart, liver, kidneys, metabolism, and immune system. Go to \u003ca href=\"https://fieldofgreens.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003efieldofgreens.com/paula\u003c/strong\u003e\u003c/a\u003e for 15% off and free shipping.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003ca href=\"https://monarchmoney.com/paula\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong\u003eMonarch Money\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\nMonarch is the top-rated, all-in-one personal finance app. It gives you a comprehensive view of all your accounts, investments, transactions, cash flow,net worth, and more. Go to \u003cstrong\u003e\u003ca href=\"https://monarchmoney.com/paula\" target=\"_blank\" rel=\"noopener\"\u003emonarchmoney.com/paula\u003c/a\u003e\u003c/strong\u003e to for your extended thirty-day FREE trial.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\n\u003c/article\u003e\n\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
