{
  "id": "7043c402-9026-4e73-8893-882bcc9abe9e",
  "title": "Weekend Reading For Financial Planners (December 28–29)",
  "link": "https://feeds.feedblitz.com/~/910039955/0/kitcesnerdseyeview~Weekend-Reading-For-Financial-Planners-December-%e2%80%93/",
  "description": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that according to a recent study by DeVoe \u0026 Company, only 42% of RIAs surveyed have written succession plans and either have begun to implement them or have already done so. The report suggests this mightRead More... The post Weekend Reading For Financial Planners (December 28–29) first appeared on Kitces.com.",
  "author": "Adam Van Deusen",
  "published": "Fri, 27 Dec 2024 19:00:26 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Weekend Reading",
    "OPTIN: Value Of Advice (BAR)",
    "OPTIN: Value Of Advice (SLIDE IN)"
  ],
  "byline": "Adam Van Deusen",
  "length": 31658,
  "excerpt": "Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that according to a recent study by DeVoe \u0026 Company, only 42% of RIAs surveyed have written succession plans and either have begun to implement them or have already done so. The report suggests this might",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary Enjoy the current installment of \"Weekend Reading For Financial Planners\" - this week's edition kicks off with the news that according to a recent study by DeVoe \u0026 Company, only 42% of RIAs surveyed have written succession plans and either have begun to implement them or have already done so. The report suggests this might be due in part to increased RIA valuations and the assumption of some firm founders that next-generation employees won't be financially able to buy out the firm from them, though additional data indicates that many firms don't have career paths in place that could help next-generation advisors envision their path to firm ownership. Also in industry news this week: According to a recent survey, advisors are putting an increasing share of client assets into model portfolios, allowing for customization and time savings that advisors appear to be using to provide more comprehensive planning services RIA M\u0026A deal volume saw an annual record in 2024 as a lower cost of capital, increased valuations, and continued competition among RIA aggregators encouraged more transactions From there, we have several articles on retirement planning: Morningstar has released its annual estimate of the safe fixed withdrawal rate for new retirees, though the analysis suggests retirees (perhaps with the help of an advisor) could increase this rate through a more flexible withdrawal strategy How certain retirement savers between the ages of 60 and 63 will be able to make \"super catch-up\" contributions in 2025 and beyond A recent study indicates that most retirees claim Social Security benefits in the year they stop working, though those that delay can potentially benefit from a larger monthly check and tax planning opportunities We also have a number of articles on insurance planning: Why some wealthy homeowners have been unable to secure sufficient property insurance coverage Why some clients might reevaluate their umbrella insurance coverage options amidst elevated claim expenses How advisors can add value for clients by helping them consider the relationship between deductibles and the \"pseudodeductibles\" on their insurance policies and the premiums they pay We wrap up with three final articles, all about sleep health: While some of the 'hottest' sleep trends of 2024 might be tempting to try, most are relatively untested, and some could potentially lead to worse sleep While exercise and good sleep can be part of a healthy lifestyle, the interaction between these two activities can be complicated for some individuals Why some individuals' efforts to maximize the quantity and quality of their sleep can sometimes backfire, leading to more stress and worse sleep Enjoy the 'light' reading! Adam is a Financial Planning Nerd at Kitces.com. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits. Read more of Adam’s articles here. Only Four In Ten RIAs Have A Succession Plan: DeVoe Study (Lilly Riddle | Citywire RIA) Founding owners of financial advisory firms often spend much of their time focusing on the day-to-day aspects of running their business, from providing high-quality client service to pursuing client growth. Which means that longer-term projects, such as creating a succession plan to have in place for the firm when the owner retires, may tend to get put on the back burner. A recent study by M\u0026A advisory firm DeVoe \u0026 Company that surveyed RIAs with at least $100 million in assets bears this out, finding that only 42% of RIAs have written succession plans that are in the \"implementing\" or \"implemented\" stage (down from 50% in its 2021 study). Nevertheless, there appears to be a bit of momentum for at least drafting succession plans, with 20% of firms having a drafted (but not implemented) plan (up from 15% in 2021), with 30% of those firms without a drafted plan indicating that they are committed to crafting one (with only 8% of firms not considering drafting a plan at all). The report attributes these dynamics in part to higher RIA valuations, which might lead some firm owners to conclude that potential G2 buyers on staff might not be able to buy out the founders (and instead assume they will sell to external buyers). Nonetheless, because succession plans not only include financial considerations (the terms of which could be structured in a way to be friendlier to internal successors), but also decisions about management transitions that not only could ensure a seamless transfer of control in the eyes of staff and clients, but also could make the firm more attractive to outside buyers (and employees, particularly if they may be involved in buying out the owner). Further, only 35% of firms surveyed said they had high confidence in G2 successors (with another 32% reporting low confidence or that there is no viable candidate for succession). Perhaps unsurprisingly given these figures, firms aren't universally clearly articulating career paths for employees (which could help them see their potential path to firm ownership), with only 52% doing so (though this number is up from 39% in 2023). Ultimately, the key point is that while some founders might assume that finding a successor is similar to filling a job vacancy (and therefore can be contemplated and completed in short order), in reality, succession planning involves long-term preparation – not just by the firm owner but also by the firm's internal successors (if they are part of the plan) – to provide a seamless transition of knowledge, skills, and culture to ensure that there is continuity of care for clients (whether they founder leaves voluntarily or involuntarily) and the realization of value for owners (either through an external sale or internal succession)! Assets In Model Portfolios Continue To Rise: State Street (Edward Hayes | Financial Advisor) While a financial advisor might choose to craft unique, customized portfolios for each client, doing so can be time intensive, both at the outset and to maintain. Which has led many advisors to use \"model\" portfolios (whether internal, from the advisor's home office, or from a commercial provider), which can cut down significantly on the time needed for implementation while still matching clients with a portfolio that meets their needs. According to a survey by State Street Global Advisors (which offers model portfolio products) of 200 financial advisors with at least $25 million of Assets Under Management (AUM), respondents indicated they have an average of 39% of their current AUM in model portfolios, up from 32% three years earlier. Advisors using model portfolios appear to be leveraging multiple sources, with 54% using self-built models, 45% using home office or broker-dealer models, and 53% using models provided by third parties. Investment objective completion portfolios (that serve as 'satellites' to provide additional diversification to a 'core' portfolio) were the most commonly used models (by 78% of advisors surveyed who use models), followed by target-risk models (69%), and outcome-oriented models (61%), with target-date models being less popular (45%). Further, advisors were fairly evenly divided in terms of what they look for in a model provider, with commitment, performance, price, and communication amongst the most commonly cited factors (though notably, the 29% who cited performance was down significantly from 60% in 2019, perhaps reflecting research suggesting that model portfolios might struggle to outperform investment benchmarks). State Street also surveyed 250 financial advisory clients with at least $500,000 in investible assets, finding that these clients appear to be receiving increasingly comprehensive planning services. For instance, 68% of respondents said their advisor covers retirement or pension planning (up from 57% in 2019), 45% said they receive tax planning guidance (up from 27%), and 37% reported that their advisor offers estate planning services (up from 29%), perhaps reflecting that advisors who use model portfolios could reallocate this time savings to offer more comprehensive planning services. In the end, while model portfolios might not be a source of investment outperformance, they can potentially free up time for advisors (allowing them to provide additional, or more in-depth, services in other planning areas) while still allowing them to offer customizable portfolios to meet their clients' unique needs. 2024 RIA M\u0026A Activity Sets Deal Record (Diana Britton | Wealth Management) Following a period of significant growth in RIA Mergers and Acquisitions (M\u0026A) activity, 2023 saw a pullback in deal flow amidst rising interest rates (that can increase the cost of financing deals) and other headwinds. Nonetheless, many market participants remained positive that underlying factors driving M\u0026A activity (e.g., infusions of Private Equity [PE] capital into large buyers and a large number of retirements among RIA founders) would mean that deals could soon pick up. According to data from M\u0026A advisory firm DeVoe \u0026 Company, these predictions came true, as 2024 has seen a record-high 269 transactions (with two weeks to spare), surpassing the previous high of 264 deals seen in 2022. In addition, the fourth quarter was a record-breaking one as well, with 78 deals in the period (besting the previous record of 76 set in the fourth quarter of 2021). Further, the month of October saw a record number of deals, with 39 transactions, breaking the previous record of 33 deals set in January 2021 (and nearly doubling the 21 deals seen in the previous October). The company cited several potential reasons for the record-breaking numbers, including lower interest rates (decreasing the cost of financing deals), stock market appreciation driving up RIA valuations (perhaps encouraging more founders to sell), and continued competition amongst RIA aggregators (which have historically accounted for approximately 70% of RIA acquisitions) to meet growth targets. Altogether, it appears that demand for RIA M\u0026A deals remains strong from both the supply side (as firm owners seek to monetize their investments and/or seek to scale within a larger firm) and the demand side (as [often PE-backed] RIA aggregators seek to grow their assets and talent base quickly through inorganic growth), with the potential to continue into 2025 (though a reversal in interest rate and/or market trends, or perhaps a future shift towards more internal succession plans [potentially fostered by a lower cost of financing for next-gen buyers], could serve as potential spoilers?). What's A Safe Retirement Spending Rate For 2025? (Christine Benz and Tao Guo | Morningstar) For nearly 30 years, the so-called '4% rule' has been a starting point for retirement planning conversations between financial planners and their clients. But as equity valuations such as the Shiller CAPE ratio have ratcheted up to nearly all-time highs in recent years, with bond yields simultaneously reaching all-time lows (suggesting below-average future returns in both asset classes), some experts have questioned whether a 4% initial withdrawal rate will continue to be 'safe' in the future. Each year, Morningstar produces an updated analysis (based on changes in expected equity and fixed income returns) of a safe initial starting withdrawal rate for a retiree seeking fixed inflation-adjusted portfolio withdrawals and a 90% success rate over a 30-year retirement. Based on higher equity valuations and reduced bond yields during the past year, this year's analysis found that a new retiree could safely withdraw 3.7% of a portfolio with an equity weighting between 20% and 50% (with either higher or lower equity weightings leading to lower safe withdrawal rates), down from its 4.0% estimate from last year and 3.8% rate in 2022 but up from 3.3% in 2021 (notably, the safe withdrawal rates vary significantly by time horizon, ranging from 9.4% for a 10-year period [assuming a 50% equity weighting] down to 3.1% for a 40-year retirement). Recognizing that few retirees will likely have the inclination and/or discipline to take a fixed-withdrawal rate approach throughout their retirements, the analysis updates safe withdrawal rates for a variety of other approaches as well, many of which offer higher initial safe withdrawal rates. For example, if a retiree (with a 40% equity, 60% bond portfolio) were willing to forgo inflation adjustments in the year following a decline in their portfolio value, they could have a 4.20% safe withdrawal rate, while a retiree using the Guyton-Klinger \"Guardrails\" approach (which allows for upward and downward spending adjustments depending on changes in portfolio value) could start with a 5.10% withdrawal rate. In addition, the analysis found that retirees could potentially boost their safe withdrawal rate by incorporating greater guaranteed income (e.g., by delaying claiming Social Security benefits). In the end, Morningstar's analysis demonstrates the benefits to clients of working with a financial advisor who can recommend adjustments to spending over time depending on changes to the size of the client's portfolio, potentially allowing them to enjoy a higher standard of living throughout their retirement than they might if they stuck to a fixed safe withdrawal rate! An Additional Savings Option Is Coming For Pre-Retirees In 2025 (Christine Benz | Morningstar) Recognizing that individuals in their later working years sometimes need to 'catch up' when it comes to saving for retirement, the Federal government those age 50 and older to make additional contributions to their IRAs and workplace retirement accounts (e.g., 401(k) plans) above the 'standard' annual limits. For instance, in 2025, these individuals will be able to make an additional $1,000 contribution to their IRAs (for a maximum contribution of $8,000) and an additional $7,500 in workplace retirement plans (for a maximum contribution of $31,000). Further, thanks to a provision in the 2022 \"SECURE Act 2.0\", starting in 2025 many individuals between ages 60 and 63 will be able to make total catch-up contributions up to $11,250 to their workplace retirement plans ($3,750 more than the normal catch-up contribution), for a total of $34,750 in possible contributions (notably, these savers' workplace plans will need to offer this \"super catch-up\" option, so advisors might encourage interested clients to check with their plan administrator to see whether this is offered). And while some advisors might recall a separate provision in SECURE 2.0 that requires 'Rothification' of catch-up contributions to workplace retirement plans for individuals with wages from the previous year from the employer sponsoring the plan exceeding $145,000 (to be adjusted for inflation), this measure has been delayed until 2026, so individuals making catch-up contributions (or the \"super catch-up\") in 2025 will continue to have the option to make traditional or Roth contributions. Altogether, the availability of \"super catch-up\" contributions could be attractive for many clients within the applicable age range and who have the funds available to do so (considering a couple where each partner is eligible would be able to contribute nearly $70,000 in total!). Which offers multiple ways for their advisor to add value, from determining the appropriate amount for their client to contribute to analyzing whether traditional- or Roth-style contributions make the most sense given their unique financial situation! (David Blanchett | ThinkAdvisor) Social Security benefits make up an important part of the incomes of many older Americans, particularly those who have retired. Nevertheless, individuals aren't required to claim Social Security benefits the year they leave the workforce, and, for those with the means to do so, delaying Social Security benefits can be particularly lucrative. According to data from the Employee Benefit Research Institute and Greenwald Research's 2024 Retirement Confidence Survey, 91% of retirees receive Social Security as a source of income and 62% say that it is a major source of their income. About 75% of respondents who did so between the ages of 62 and 70 claimed their benefits at their retirement age (i.e., the year they left the workforce), with the four most common Social Security claiming ages being 62 (when individuals are first eligible to claim benefits), age 65 (the median expected retirement age according to the survey), age 66 (the full Social Security retirement age for most current recipients) and age 70 (the maximum benefit age). Notably, an individual's level of assets appears to play a significant role in their decision to delay Social Security benefits (which can result in a larger monthly benefit). For instance, while only 8% of respondents with less than $100,000 in total financial assets claimed after their retirement age, 36% of those with more than $500,000 did so (likely because this latter group could use their assets to support their lifestyle needs to delay Social Security and benefit from a larger monthly benefit when they do claim). In sum, this research shows that while many Americans rely on Social Security benefits to replace (a portion of) their income after they (sometimes involuntarily) retire, those who can delay taking benefits (often relatively wealthier individuals) can benefit both from a larger monthly benefit and perhaps the opportunity to use the low-income years between retirement and claiming Social Security for Roth conversions and/or capital gains harvesting, suggesting that advisors can potentially add significant value for clients who might otherwise default to claiming benefits in the year they leave the workforce! Some Wealthy Individuals Are Having Trouble Insuring Their Homes (Jennifer Lea Reed | Financial Advisor) Given that a home is most individuals' most valuable tangible asset, insuring it properly can help prevent financial catastrophe if it were to be severely damaged or destroyed. And while homeowners' insurance rates have been rising around the country during the past few years alongside elevated construction costs, the price (and availability) of homeowners insurance has been particularly acute for some of those with the highest-value properties. According to a survey of 150 high-net-worth and ultra-high-net-worth individuals (defined as having at least $3 million and $20 million in insurable assets [e.g., homes, cars, watercraft, art, and jewelry], respectively) by insurance broker HUB International, 69% of respondents said they faced challenges securing sufficient property insurance in the last year, with those with homes in areas that are susceptible to natural disasters (e.g., beachfront homes in Florida subject to hurricane damage or mountain homes in Colorado that could face wildfires) encountering particular difficulties. Many of these individuals are choosing to increase their deductibles or drop riders in order to reduce premiums, according to the report, while some of those who can't secure coverage at all are fully self-insuring (leaving them entirely on the hook for damages that might occur). Ultimately, the key point is that clients in certain geographic areas (or whose houses are constructed in a way that they would be particularly expensive to replace) might face the specter of having few (or even no) carriers willing to insure their property. Which could lead to important conversations between advisors and these clients, whether in terms of finding the appropriate balance of coverage amounts, deductibles, and premiums or (for those considering a move) determining the full costs of buying a house in a location with elevated rates (e.g., whether home insurance costs and availability might defray the tax benefits of moving to an income-tax-free state like Florida). Umbrella Insurance In The Spotlight As Costs Of Claims, Premiums Rise (Veronica Dagher | The Wall Street Journal) Umbrella insurance is a popular type of policy for financial advisors to recommend to their clients, as it can provide a generous amount of liability protection at a reasonable cost. Part of the reason for this dynamic is that this coverage only kicks in once a claim exceeds the limit of liability coverage on underlying insurance policies (e.g., home and auto), often $300,000 or more. However, amidst broader elevated price levels during the past few years, the costs of insurance claims (e.g., for medical bills and repairs) have risen as well, resulting in several knock-on effects related to umbrella coverage. To start, the higher cost of claims on underlying policies has led to more claims exceeding the liability limit of the underlying policies and claims on umbrella policies (with insurance provider USAA reporting a 45% increase in $1 million umbrella claims opened in 2023 compared to 2021). Which has led some insurance companies to raise premiums on umbrella policies (with insurance data analytics company Verisk reporting a 7% increase between 2019 and 2022, though certain policyholders have seen substantially higher increases). Further, to account for the increasing costs of insurance claims, some individuals might decide to raise the amount of their umbrella policies, increasing their premiums further. In the end, amidst the rising cost of claims, financial advisors have several ways to add value for their clients when it comes to umbrella insurance, whether it's ensuring that they have sufficient coverage based on their assets and exposures, helping them shop for the best policies (though this might require them to change carriers for the underlying liability coverages as well), or, at a more basic level, convincing them (depending on their situation) that the cost-benefit ratio of umbrella insurance remains an attractive proposition. Why The Best P\u0026C Insurance Deductible Is Driven By The Pseudo-Deductible Threshold For Filing A Claim (Derek Tharp | Nerd's Eye View) The concept behind property and casualty (P\u0026C) insurance is straight forward. Consumers pay a premium for insurance coverage and, should they incur a loss greater than their deductible, they can file a claim for the balance. However, when we consider the fact that insurance companies operating in bonus-malus systems typically raise a customer's premium after they submit a claim, the question of whether the insured should submit a claim versus paying for the loss out of pocket becomes substantially more complex. This internal tension when deciding whether to file a claim or not leads to what is known as a \"pseudo-deductible\" – referring to the true dollar amount of a loss one would need to experience before deciding to actually make a claim (above and beyond just the stated deductible itself). The decision of how large of a pseudo-deductible to adopt is naturally influenced by many factors unique to an individual (e.g., our aversion to risk and uncertainty, as well as one's ability to withstand loss in the first place). Though the ideal pseudo-deductible cannot be 'solved' in an algebraic sense, one method we can use to inform the question of how large of a pseudo-deductible may be ideal is Monte Carlo simulation based on real-world assumptions. Using national claims figures combined with peril-specific premium increases (as the premium increase for a loss which could indicate negligence or risky behavior is often higher than one that is completely out of an insured's control, such as a natural disaster), the results of this analysis indicate that, in isolation, an ideal pseudo-deductible for homeowners insurance policy could be somewhere in the range of $500 to $1,500. However, this amount is by no means fixed and is everchanging as both consumers and insurers adjust to the behavior of one another. But the key point is that by adopting some non-trivial pseudo-deductible above and beyond one's deductible, it is possible to reduce both long-term average costs and outcome variability. Yet, if those adhering to conventional wisdom truly adopt deductibles \"as high as they can afford\", this may not put them in a position to strategically forgo claims that may increase long-term costs. Instead, consumers may wish to first identify the maximum pseudo-deductible they can afford to adopt (or wish to adopt given their risk preferences) and then select a lower deductible which allows them to strategically forgo claims that may result in higher costs in the long run (but not a deductible that's too much lower, or consumers are paying a higher premium for a lower deductible threshold they won't use anyway given their higher pseudodeductible). Financial advisors can lend a hand by helping clients understand these dynamics, as well as helping clients develop a better understanding of the actual odds that they will incur a loss (versus their preconceived notions of those odds). Ultimately, though, for relatively wealthier clients, the biggest impact might not necessarily be the difference between their deductible and pseudodeductible (which might represent a few thousand dollars), but rather that they're properly insured in the first place, particularly amidst rising costs for both property and liability claims! Evaluating The Effectiveness Of 2024's Sleep Trends (Lauren Young | Scientific American) Given that everyone sleeps, there are no shortage of opinions on how to get the 'best' sleep possible. A challenge, though, is the how to evaluate the sleep-related tips and trends that pop up on social media and elsewhere. For example, one popular online trend this year was the \"sleepy girl mocktail\" (a combination of cherry juice, seltzer, and magnesium), which adherents suggest helps them sleep better. Nonetheless, while magnesium can help relax muscles and affect pathways in the brain that stabilize mood and anxiety (though it can sometimes act as a sleep-disrupting laxative), it's unclear whether the combination has sleep-enhancing powers. Another trend had individuals with back pain sleeping directly on the floor. While some physiotherapists suggest that doing so could help take pressure off of the back, the hardness of the floor could lead to joint stiffness and put more pressure on the hips and buttocks, which could result in back pain. While the previous trends have questionable benefits, one practice that very likely worsens sleep is \"bed rotting\" or staying in bed for prolonged periods of time (purposely avoiding productive activity in the process). While some promoting this tactic suggest they feel rejuvenated afterwards, some experts suggest doing so can throw off the body's internal clock and make it harder to get to sleep at the 'normal' time. Altogether, while some of these trends might outlast 2024, more mundane sleep hygiene practices (e.g., maintaining a regular sleep schedule and avoiding stressors before bedtime) appear more likely to stand the test of time and lead to a better night's sleep. How To Exercise For Better Sleep (Hannah Singleton | The New York Times) It's widely accepted that sufficient exercise and sleep are part of a healthy lifestyle. However, the interaction between these two habits is murkier. For example, while it might seem logical that a heavy workout would make an individual feel more tired (and therefore have a better night of sleep), some research suggests this isn't always the case, particularly for those with insomnia (i.e., chronic dissatisfaction with sleep quality or quantity for at least three nights a week over three months). While moderate aerobic exercise (e.g., walking, jogging, or cycling) can provide sleep-inducing benefits, more intense activities (e.g., training for a half marathon or a High-Intensity Interval Training [HIIT] session) can increase levels of cortisol (the body's stress hormone), which can make it harder to get to sleep, as well as muscle soreness, which can cause restless sleep during the night. Another factor affecting the exercise-sleep relationship could the timing of one's workout, with one study finding that any physical activity after 8 p.m. caused people to sleep less with another indicating that intense exercise ending one hour before bed may disrupt sleep. For those who don't just face the occasional restless night, but rather full-on insomnia, getting into a regular routine for exercise (i.e., time during the day) and being aware of their body's response (e.g., pain and soreness) can help them access the benefits of exercise while (hopefully) minimally disrupting, or even encouraging, better sleep. Ultimately, the key point is that while exercise and sleep remain cornerstones for a healthy lifestyle, the relationship between these two activities is likely to differ among individuals. Which suggests that testing out different routines (e.g. exercising in the morning versus the afternoon and trying different workout regimens) could help one find a successful balance that leads to a virtuous cycle where exercise and sleep support each other rather than act in opposing directions! How The Pursuit Of Perfect Sleep Can Backfire (Kate Lindsay | The New York Times) In his book The Paradox of Choice: Why Less is More, author Barry Schwartz identifies two personality types: Satisficers, who tend to be content with having just enough, and Maximizers, who continually strive to attain and achieve more, no matter how far they get. While this dynamic can apply to many parts of life (including financial planning!), in recent years sleep has become the latest area for individuals to try to maximize. Thanks to new technology (e.g., wearable devices that can measure body signals and deliver a \"sleep score\" in the morning), it has become easier than ever to track not only the amount of time that one sleeps, but also the quality of that sleep. On the one hand, doing this tracking could encourage people to have better, healthier sleep habits. However, this tracking can become an obsession for some, with the stress caused by seeking the 'perfect' night of sleep actually reducing the quantity and quality of sleep in the process. In fact, researchers at Northwestern University coined the term \"orthosomnia\" to describe people who seek treatment for self-diagnosed sleep issues resulting from their use of sleep trackers. In sum, while pursuing better sleep could be a healthy New Year's Resolution, trying to maximize it (sometimes with the encouragement of online forums and a growing market of sleep-related products, such as mouth tape and jaw straps meant to encourage nasal breathing) could prove counterproductive if it leads to stress that makes it harder to fall and stay asleep. Which suggests that focusing on the 'basics' of sleep hygiene, such as trying to go to bed at the same time each night and avoiding caffeine and alcohol too close to bedtime, could ultimately be a more productive step towards better sleep and a healthier lifestyle. We hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column! In the meantime, if you're interested in more news and information regarding advisor technology, we'd highly recommend checking out Craig Iskowitz's \"Wealth Management Today\" blog. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2024/05/Social-Image-Blog-Article-Weekend-Reading-2024.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eEnjoy the current installment of \u0026#34;Weekend Reading For Financial Planners\u0026#34; - this week\u0026#39;s edition kicks off with the news that according to a recent study by DeVoe \u0026amp; Company, only 42% of RIAs surveyed have written succession plans and either have begun to implement them or have already done so. The report suggests this might be due in part to increased RIA valuations and the assumption of some firm founders that next-generation employees won\u0026#39;t be financially able to buy out the firm from them, though additional data indicates that many firms don\u0026#39;t have career paths in place that could help next-generation advisors envision their path to firm ownership.\u003c/p\u003e\n\u003cp\u003eAlso in industry news this week:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAccording to a recent survey, advisors are putting an increasing share of client assets into model portfolios, allowing for customization and time savings that advisors appear to be using to provide more comprehensive planning services\u003c/li\u003e\n\u003cli\u003eRIA M\u0026amp;A deal volume saw an annual record in 2024 as a lower cost of capital, increased valuations, and continued competition among RIA aggregators encouraged more transactions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFrom there, we have several articles on retirement planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMorningstar has released its annual estimate of the safe fixed withdrawal rate for new retirees, though the analysis suggests retirees (perhaps with the help of an advisor) could increase this rate through a more flexible withdrawal strategy\u003c/li\u003e\n\u003cli\u003eHow certain retirement savers between the ages of 60 and 63 will be able to make \u0026#34;super catch-up\u0026#34; contributions in 2025 and beyond\u003c/li\u003e\n\u003cli\u003eA recent study indicates that most retirees claim Social Security benefits in the year they stop working, though those that delay can potentially benefit from a larger monthly check and tax planning opportunities\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe also have a number of articles on insurance planning:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhy some wealthy homeowners have been unable to secure sufficient property insurance coverage\u003c/li\u003e\n\u003cli\u003eWhy some clients might reevaluate their umbrella insurance coverage options amidst elevated claim expenses\u003c/li\u003e\n\u003cli\u003eHow advisors can add value for clients by helping them consider the relationship between deductibles and the \u0026#34;pseudodeductibles\u0026#34; on their insurance policies and the premiums they pay\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe wrap up with three final articles, all about sleep health:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhile some of the \u0026#39;hottest\u0026#39; sleep trends of 2024 might be tempting to try, most are relatively untested, and some could potentially lead to worse sleep\u003c/li\u003e\n\u003cli\u003eWhile exercise and good sleep can be part of a healthy lifestyle, the interaction between these two activities can be complicated for some individuals\u003c/li\u003e\n\u003cli\u003eWhy some individuals\u0026#39; efforts to maximize the quantity and quality of their sleep can sometimes backfire, leading to more stress and worse sleep\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEnjoy the \u0026#39;light\u0026#39; reading!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" alt=\"Adam Van Deusen Headshot\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" sizes=\"(max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-400x400.jpg 400w, https://www.kitces.com/wp-content/uploads/2021/09/Adam-Van-Deusen-Headshot-scaled-e1690842386831-800x800.jpg 800w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp data-pm-slice=\"1 1 []\"\u003eAdam is a Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\"\u003eKitces.com\u003c/a\u003e. He previously worked at a financial planning firm in Bethesda, Maryland, and as a journalist covering the banking and insurance industries. Outside of work, he serves as a volunteer financial planner and class instructor for local and national non-profits.\u003c/p\u003e\n\u003cp\u003eRead more of Adam’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=7517\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2 data-nav-title=\"Only 4 In 10 RIAs Have A Succession Plan\" id=\"only-four-in-ten-rias-have-a-succession-plan-devoe-study\"\u003e\u003cspan\u003e \u003ca href=\"https://citywire.com/ria/news/only-4-in-10-rias-have-a-succession-plan-devoe/a2456831\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eOnly Four In Ten RIAs Have A Succession Plan: DeVoe Study\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Lilly Riddle | Citywire RIA)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFounding owners of financial advisory firms often spend much of their time focusing on the day-to-day aspects of running their business, from providing high-quality client service to pursuing client growth. Which means that longer-term projects, such as \u003ca href=\"https://www.kitces.com/blog/financial-advisory-firm-ownership-transition-succession-planning-g2-valuation-alignment/\"\u003ecreating a succession plan\u003c/a\u003e to have in place for the firm when the owner retires, may tend to get put on the back burner.\u003c/p\u003e\n\u003cp\u003eA \u003ca href=\"https://static1.squarespace.com/static/5410ec1be4b0b9bdbd0cc342/t/6761a3fd430ad245d4d7881a/1734452222581/2024+DeVoe+Talent+Management+Report+-+FINAL.pdf\"\u003erecent study by M\u0026amp;A advisory firm DeVoe \u0026amp; Company\u003c/a\u003e that surveyed RIAs with at least $100 million in assets bears this out, finding that only 42% of RIAs have written succession plans that are in the \u0026#34;implementing\u0026#34; or \u0026#34;implemented\u0026#34; stage (down from 50% in its 2021 study). Nevertheless, there appears to be a bit of momentum for at least drafting succession plans, with 20% of firms having a drafted (but not implemented) plan (up from 15% in 2021), with 30% of those firms without a drafted plan indicating that they are committed to crafting one (with only 8% of firms not considering drafting a plan at all).\u003c/p\u003e\n\u003cp\u003eThe report attributes these dynamics in part to higher RIA valuations, which might lead some firm owners to conclude that potential G2 buyers on staff might not be able to buy out the founders (and instead assume they will sell to external buyers). Nonetheless, because succession plans not only include financial considerations (\u003ca href=\"https://www.kitces.com/blog/succession-plan-discount-g2-next-gen-buying-selling-ria-succession/\"\u003ethe terms of which could be structured in a way to be friendlier to internal successors\u003c/a\u003e), but also decisions about management transitions that not only could ensure a seamless transfer of control in the eyes of staff and clients, but also could make the firm more attractive to outside buyers (and employees, particularly if they may be involved in buying out the owner). Further, only 35% of firms surveyed said they had high confidence in G2 successors (with another 32% reporting low confidence or that there is no viable candidate for succession). Perhaps unsurprisingly given these figures, firms aren\u0026#39;t universally clearly articulating \u003ca href=\"https://www.kitces.com/blog/financial-advisor-career-tracks-investment-management-financial-planning-advisory-quarterly-performance-reviews/\"\u003ecareer paths\u003c/a\u003e for employees (which could help them see their potential path to firm ownership), with only 52% doing so (though this number is up from 39% in 2023).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while some founders might assume that finding a successor is similar to filling a job vacancy (and therefore can be contemplated and completed in short order), in reality, succession planning involves long-term preparation – not just by the firm owner but also by the firm\u0026#39;s internal successors (if they are part of the plan) – to provide a seamless transition of knowledge, skills, and culture to ensure that there is continuity of care for clients (whether they founder leaves voluntarily or involuntarily) and the realization of value for owners (either through an external sale or internal succession)!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Assets In Model Portfolios Continue To Rise\" id=\"assets-in-model-portfolios-continue-to-rise-state-street\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/assets-in-model-portfolios-continue-to-rise--state-street-report-80740.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003eAssets In Model Portfolios Continue To Rise: State Street\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Edward Hayes | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhile a financial advisor might choose to craft unique, customized portfolios for each client, \u003ca href=\"https://www.kitces.com/blog/market-volatility-customized-client-portfolio-rebalancing-model-management-client-relationship/\"\u003edoing so can be time intensive, both at the outset and to maintain\u003c/a\u003e. Which has led many advisors to use \u0026#34;model\u0026#34; portfolios (whether internal, from the advisor\u0026#39;s home office, or from a commercial provider), which can cut down significantly on the time needed for implementation while still matching clients with a portfolio that meets their needs.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://www.ssga.com/library-content/assets/pdf/north-america/model-portfolios/model-research.pdf\"\u003ea survey by State Street Global Advisors\u003c/a\u003e (which offers model portfolio products) of 200 financial advisors with at least $25 million of Assets Under Management (AUM), respondents indicated they have an average of 39% of their current AUM in model portfolios, up from 32% three years earlier. Advisors using model portfolios appear to be leveraging multiple sources, with 54% using self-built models, 45% using home office or broker-dealer models, and 53% using models provided by third parties. Investment objective completion portfolios (that serve as \u0026#39;satellites\u0026#39; to provide additional diversification to a \u0026#39;core\u0026#39; portfolio) were the most commonly used models (by 78% of advisors surveyed who use models), followed by target-risk models (69%), and outcome-oriented models (61%), with target-date models being less popular (45%). Further, advisors were fairly evenly divided in terms of what they look for in a model provider, with commitment, performance, price, and communication amongst the most commonly cited factors (though notably, the 29% who cited performance was down significantly from 60% in 2019, perhaps reflecting \u003ca href=\"https://roberthuebscher.substack.com/p/the-disappointing-performance-of\"\u003eresearch suggesting that model portfolios might struggle to outperform investment benchmarks\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eState Street also surveyed 250 financial advisory clients with at least $500,000 in investible assets, finding that these clients appear to be receiving \u003ca href=\"https://www.kitces.com/blog/financial-comprehensive-plans-advisor-time-income-revenue-outsourcing/\"\u003eincreasingly comprehensive planning services\u003c/a\u003e. For instance, 68% of respondents said their advisor covers retirement or pension planning (up from 57% in 2019), 45% said they receive tax planning guidance (up from 27%), and 37% reported that their advisor offers estate planning services (up from 29%), perhaps reflecting that advisors who use model portfolios could reallocate this time savings to offer more comprehensive planning services.\u003c/p\u003e\n\u003cp\u003eIn the end, while model portfolios might not be a source of investment outperformance, they can potentially free up time for advisors (allowing them to provide additional, or more in-depth, services in other planning areas) while still allowing them to offer customizable portfolios to meet their clients\u0026#39; unique needs.\u003c/p\u003e\n\u003ch2 id=\"2024-ria-ma-activity-sets-deal-record\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wealthmanagement.com/ria-news/2024-ria-ma-activity-sets-deal-record\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"News\"\u003e2024 RIA M\u0026amp;A Activity Sets Deal Record\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Diana Britton | Wealth Management)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFollowing a period of significant growth in RIA Mergers and Acquisitions (M\u0026amp;A) activity, 2023 saw a pullback in deal flow amidst rising interest rates (that can increase the cost of financing deals) and other headwinds. Nonetheless, many market participants remained positive that underlying factors driving M\u0026amp;A activity (e.g., infusions of Private Equity [PE] capital into large buyers and a large number of retirements among RIA founders) would mean that deals could soon pick up.\u003c/p\u003e\n\u003cp\u003eAccording to \u003ca href=\"https://static1.squarespace.com/static/5410ec1be4b0b9bdbd0cc342/t/67647b5a16b360607c495b19/1734638426541/Press+Release+-+December+Deal+Activity+Alert+FINAL+FINAL+12+19+24.pdf\"\u003edata from M\u0026amp;A advisory firm DeVoe \u0026amp; Company\u003c/a\u003e, these predictions came true, as 2024 has seen a record-high 269 transactions (with two weeks to spare), surpassing the previous high of 264 deals seen in 2022. In addition, the fourth quarter was a record-breaking one as well, with 78 deals in the period (besting the previous record of 76 set in the fourth quarter of 2021). Further, the month of October saw a record number of deals, with 39 transactions, breaking the previous record of 33 deals set in January 2021 (and nearly doubling the 21 deals seen in the previous October). The company cited several potential reasons for the record-breaking numbers, including lower interest rates (decreasing the cost of financing deals), stock market appreciation driving up RIA valuations (perhaps encouraging more founders to sell), and continued competition amongst RIA aggregators (which have historically accounted for approximately 70% of RIA acquisitions) to meet growth targets.\u003c/p\u003e\n\u003cp\u003eAltogether, it appears that demand for RIA M\u0026amp;A deals remains strong from both the supply side (as firm owners seek to monetize their investments and/or seek to scale within a larger firm) and the demand side (as [often PE-backed] RIA aggregators seek to grow their assets and talent base quickly through inorganic growth), with the potential to continue into 2025 (though a reversal in interest rate and/or market trends, or perhaps a future shift towards more \u003ca href=\"https://www.kitces.com/blog/financial-advisory-firm-ownership-transition-succession-planning-g2-valuation-alignment/\"\u003einternal succession plans\u003c/a\u003e [potentially fostered by a lower cost of financing for next-gen buyers], could serve as potential spoilers?).\u003c/p\u003e\n\u003ch2 data-nav-title=\"What\u0026#39;s A Safe Retirement Spending Rate?\" id=\"whats-a-safe-retirement-spending-rate-for-2025\"\u003e\u003cspan\u003e\u003ca href=\"https://www.morningstar.com/retirement/whats-safe-retirement-spending-rate-2025\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eWhat\u0026#39;s A Safe Retirement Spending Rate For 2025?\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Christine Benz and Tao Guo | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor nearly 30 years, the so-called \u003ca href=\"https://www.kitces.com/blog/4-percent-rule-bengen-morningstar-report-the-state-of-retirement-income-safe-withdrawal-rates/\"\u003e\u0026#39;4% rule\u0026#39;\u003c/a\u003e has been a starting point for retirement planning conversations between financial planners and their clients. But as equity valuations such as the Shiller CAPE ratio have ratcheted up to nearly all-time highs in recent years, with bond yields simultaneously reaching all-time lows (suggesting below-average future returns in both asset classes), some experts have questioned whether a 4% initial withdrawal rate will continue to be \u0026#39;safe\u0026#39; in the future.\u003c/p\u003e\n\u003cp\u003eEach year, \u003ca href=\"https://www.morningstar.com/lp/the-state-of-retirement-income\"\u003eMorningstar produces an updated analysis\u003c/a\u003e (based on changes in expected equity and fixed income returns) of a safe initial starting withdrawal rate for a retiree seeking fixed inflation-adjusted portfolio withdrawals and a 90% success rate over a 30-year retirement. Based on higher equity valuations and reduced bond yields during the past year, this year\u0026#39;s analysis found that a new retiree could safely withdraw 3.7% of a portfolio with an equity weighting between 20% and 50% (with either higher or lower equity weightings leading to lower safe withdrawal rates), down from its 4.0% estimate from last year and 3.8% rate in 2022 but up from 3.3% in 2021 (notably, the safe withdrawal rates vary significantly by time horizon, ranging from 9.4% for a 10-year period [assuming a 50% equity weighting] down to 3.1% for a 40-year retirement).\u003c/p\u003e\n\u003cp\u003eRecognizing that few retirees will likely have the inclination and/or discipline to take a fixed-withdrawal rate approach throughout their retirements, the analysis updates safe withdrawal rates for a variety of other approaches as well, many of which offer higher initial safe withdrawal rates. For example, if a retiree (with a 40% equity, 60% bond portfolio) were willing to forgo inflation adjustments in the year following a decline in their portfolio value, they could have a 4.20% safe withdrawal rate, while a retiree using the \u003ca href=\"https://www.kitces.com/blog/implementing-retirement-income-guardrails-to-facilitate-the-right-spending-raises-and-spending-cuts/\"\u003eGuyton-Klinger \u0026#34;Guardrails\u0026#34; approach\u003c/a\u003e (which allows for upward and downward spending adjustments depending on changes in portfolio value) could start with a 5.10% withdrawal rate. In addition, the analysis found that retirees could potentially boost their safe withdrawal rate by incorporating greater guaranteed income (e.g., by \u003ca href=\"https://www.kitces.com/blog/how-delaying-social-security-can-be-the-best-long-term-investment-or-annuity-money-can-buy/\"\u003edelaying claiming Social Security benefits\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eIn the end, Morningstar\u0026#39;s analysis demonstrates the benefits to clients of \u003ca href=\"https://www.kitces.com/blog/monte-carlo-one-time-vs-ongoing-retirement-planning-probability-of-success-guardrails/\"\u003eworking with a financial advisor who can recommend adjustments to spending over time\u003c/a\u003e depending on changes to the size of the client\u0026#39;s portfolio, potentially allowing them to enjoy a higher standard of living throughout their retirement than they might if they stuck to a fixed safe withdrawal rate!\u003c/p\u003e\n\u003ch2 data-nav-title=\"An Additional Savings Option Coming 2025\" id=\"an-additional-savings-option-is-coming-for-preretirees-in-2025\"\u003e\u003cspan\u003e\u003ca href=\"https://www.morningstar.com/personal-finance/look-alive-preretirees-an-additional-savings-option-is-coming-2025\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Retirement\"\u003eAn Additional Savings Option Is Coming For Pre-Retirees In 2025\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Christine Benz | Morningstar)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRecognizing that individuals in their later working years sometimes need to \u0026#39;catch up\u0026#39; when it comes to saving for retirement, the Federal government those age 50 and older to make additional contributions to their IRAs and workplace retirement accounts (e.g., 401(k) plans) above the \u0026#39;standard\u0026#39; annual limits. For instance, in 2025, these individuals will be able to make an additional $1,000 contribution to their IRAs (for a maximum contribution of $8,000) and an additional $7,500 in workplace retirement plans (for a maximum contribution of $31,000).\u003c/p\u003e\n\u003cp\u003eFurther, thanks to a provision in the 2022 \u003ca href=\"https://www.kitces.com/blog/secure-act-2-omnibus-2022-hr-2954-rmd-75-529-roth-rollover-increase-qcd-student-loan-match/\"\u003e\u0026#34;SECURE Act 2.0\u0026#34;\u003c/a\u003e, starting in 2025 many individuals between ages 60 and 63 will be able to make total catch-up contributions up to $11,250 to their workplace retirement plans ($3,750 more than the normal catch-up contribution), for a total of $34,750 in possible contributions (notably, these savers\u0026#39; workplace plans will need to offer this \u0026#34;super catch-up\u0026#34; option, so advisors might encourage interested clients to check with their plan administrator to see whether this is offered). And while some advisors might recall a separate provision in SECURE 2.0 that requires \u0026#39;Rothification\u0026#39; of catch-up contributions to workplace retirement plans for individuals with wages from the previous year from the employer sponsoring the plan exceeding $145,000 (to be adjusted for inflation), this measure has been delayed until 2026, so individuals making catch-up contributions (or the \u0026#34;super catch-up\u0026#34;) in 2025 will continue to have the option to make traditional or Roth contributions.\u003c/p\u003e\n\u003cp\u003eAltogether, the availability of \u0026#34;super catch-up\u0026#34; contributions could be attractive for many clients within the applicable age range and who have the funds available to do so (considering a couple where each partner is eligible would be able to contribute nearly $70,000 in total!). Which offers multiple ways for their advisor to add value, from determining the appropriate amount for their client to contribute to \u003ca href=\"https://www.kitces.com/blog/tax-diversification-roth-optimization-conversion-tax-alpha/\"\u003eanalyzing whether traditional- or Roth-style contributions make the most sense\u003c/a\u003e given their unique financial situation!\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(David Blanchett | ThinkAdvisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSocial Security benefits make up an important part of the incomes of many older Americans, particularly those who have retired. Nevertheless, individuals aren\u0026#39;t required to claim Social Security benefits the year they leave the workforce, and, for those with the means to do so, delaying Social Security benefits can be particularly lucrative.\u003c/p\u003e\n\u003cp\u003eAccording to data from the \u003ca href=\"https://www.ebri.org/retirement/retirement-confidence-survey\"\u003eEmployee Benefit Research Institute and Greenwald Research\u0026#39;s 2024 Retirement Confidence Survey\u003c/a\u003e, 91% of retirees receive Social Security as a source of income and 62% say that it is a major source of their income. About 75% of respondents who did so between the ages of 62 and 70 claimed their benefits at their retirement age (i.e., the year they left the workforce), with the four most common Social Security claiming ages being 62 (when individuals are first eligible to claim benefits), age 65 (the median expected retirement age according to the survey), age 66 (the full Social Security retirement age for most current recipients) and age 70 (the maximum benefit age). Notably, an individual\u0026#39;s level of assets appears to play a significant role in their decision to delay Social Security benefits (\u003ca href=\"https://www.kitces.com/blog/how-delaying-social-security-can-be-the-best-long-term-investment-or-annuity-money-can-buy/\"\u003ewhich can result in a larger monthly benefit\u003c/a\u003e). For instance, while only 8% of respondents with less than $100,000 in total financial assets claimed after their retirement age, 36% of those with more than $500,000 did so (likely because this latter group could use their assets to support their lifestyle needs to delay Social Security and benefit from a larger monthly benefit when they do claim).\u003c/p\u003e\n\u003cp\u003eIn sum, this research shows that while many Americans rely on Social Security benefits to replace (a portion of) their income after they (sometimes involuntarily) retire, those who can delay taking benefits (often relatively wealthier individuals) can benefit both from a larger monthly benefit and perhaps the opportunity to use the low-income years between retirement and claiming Social Security for \u003ca href=\"https://www.kitces.com/blog/navigating-income-harvesting-strategies-harvesting-0-capital-gains-vs-partial-roth-conversions/\"\u003eRoth conversions and/or capital gains harvesting\u003c/a\u003e, suggesting that advisors can potentially add significant value for clients who might otherwise default to claiming benefits in the year they leave the workforce!\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Wealthy Having Trouble Insuring Homes\" id=\"some-wealthy-individuals-are-having-trouble-insuring-their-homes\"\u003e\u003cspan\u003e\u003ca href=\"https://www.fa-mag.com/news/survey-finds-69--of-hnw--clients-face-insurance-challenges-80786.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Insurance\"\u003eSome Wealthy Individuals Are Having Trouble Insuring Their Homes\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Jennifer Lea Reed | Financial Advisor)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven that a home is most individuals\u0026#39; most valuable tangible asset, insuring it properly can help prevent financial catastrophe if it were to be severely damaged or destroyed. And while homeowners\u0026#39; insurance rates have been rising around the country during the past few years alongside elevated construction costs, the price (and availability) of homeowners insurance has been particularly acute for some of those with the highest-value properties.\u003c/p\u003e\n\u003cp\u003eAccording to a \u003ca href=\"https://www.hubinternational.com/insights/outlook/2025/private-client/\"\u003esurvey\u003c/a\u003e of 150 high-net-worth and ultra-high-net-worth individuals (defined as having at least $3 million and $20 million in insurable assets [e.g., homes, cars, watercraft, art, and jewelry], respectively) by insurance broker HUB International, 69% of respondents said they faced challenges securing sufficient property insurance in the last year, with those with homes in areas that are susceptible to natural disasters (e.g., beachfront homes in Florida subject to hurricane damage or mountain homes in Colorado that could face wildfires) encountering particular difficulties. Many of these individuals are choosing to increase their deductibles or drop riders in order to reduce premiums, according to the report, while some of those who can\u0026#39;t secure coverage at all are fully self-insuring (leaving them entirely on the hook for damages that might occur).\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that clients in certain geographic areas (or whose houses are constructed in a way that they would be particularly expensive to replace) might face the specter of having few (or even no) carriers willing to insure their property. Which could lead to important conversations between advisors and these clients, whether in terms of finding the appropriate balance of coverage amounts, deductibles, and premiums or (for those considering a move) determining the full costs of buying a house in a location with elevated rates (e.g., whether home insurance costs and availability might defray the tax benefits of moving to an income-tax-free state like Florida).\u003c/p\u003e\n\u003ch2 data-nav-title=\"Umbrella Insurance In The Spotlight\" id=\"umbrella-insurance-in-the-spotlight-as-costs-of-claims-premiums-rise\"\u003e\u003cspan\u003e\u003ca href=\"https://www.wsj.com/personal-finance/umbrella-insurance-covers-worst-case-scenarios-there-are-now-more-of-them-e655f2d3\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Insurance\"\u003eUmbrella Insurance In The Spotlight As Costs Of Claims, Premiums Rise\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Veronica Dagher | The Wall Street Journal)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUmbrella insurance is a popular type of policy for financial advisors to recommend to their clients, as it can provide a generous amount of liability protection at a reasonable cost. Part of the reason for this dynamic is that this coverage only kicks in once a claim exceeds the limit of liability coverage on underlying insurance policies (e.g., home and auto), often $300,000 or more.\u003c/p\u003e\n\u003cp\u003eHowever, amidst broader elevated price levels during the past few years, the costs of insurance claims (e.g., for medical bills and repairs) have risen as well, resulting in several knock-on effects related to umbrella coverage. To start, the higher cost of claims on underlying policies has led to more claims exceeding the liability limit of the underlying policies and claims on umbrella policies (with insurance provider USAA reporting a 45% increase in $1 million umbrella claims opened in 2023 compared to 2021). Which has led some insurance companies to raise premiums on umbrella policies (with insurance data analytics company Verisk reporting a 7% increase between 2019 and 2022, though certain policyholders have seen substantially higher increases). Further, to account for the increasing costs of insurance claims, some individuals might decide to raise the amount of their umbrella policies, increasing their premiums further.\u003c/p\u003e\n\u003cp\u003eIn the end, amidst the rising cost of claims, financial advisors have several ways to add value for their clients when it comes to umbrella insurance, whether it\u0026#39;s ensuring that they have sufficient coverage based on their assets and exposures, helping them shop for the best policies (though this might require them to change carriers for the underlying liability coverages as well), or, at a more basic level, convincing them (depending on their situation) that the cost-benefit ratio of umbrella insurance remains an attractive proposition.\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Pseudo-Deductible Threshold\" id=\"why-the-best-pc-insurance-deductible-is-driven-by-the-pseudodeductible-threshold-for-filing-a-claim\"\u003e\u003cspan\u003e\u003ca href=\"https://www.kitces.com/blog/pseudodeductible-modeling-threshold-home-auto-insurance-claims-filing/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Insurance\"\u003eWhy The Best P\u0026amp;C Insurance Deductible Is Driven By The Pseudo-Deductible Threshold For Filing A Claim\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Derek Tharp | Nerd\u0026#39;s Eye View)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe concept behind property and casualty (P\u0026amp;C) insurance is straight forward. Consumers pay a premium for insurance coverage and, should they incur a loss greater than their deductible, they can file a claim for the balance. However, when we consider the fact that insurance companies operating in bonus-malus systems typically raise a customer\u0026#39;s premium after they submit a claim, the question of whether the insured should submit a claim versus paying for the loss out of pocket becomes substantially more complex. This internal tension when deciding whether to file a claim or not leads to what is known as a \u0026#34;pseudo-deductible\u0026#34; – referring to the true dollar amount of a loss one would need to experience before deciding to actually make a claim (above and beyond just the stated deductible itself).\u003c/p\u003e\n\u003cp\u003eThe decision of how large of a pseudo-deductible to adopt is naturally influenced by many factors unique to an individual (e.g., our aversion to risk and uncertainty, as well as one\u0026#39;s ability to withstand loss in the first place). Though the ideal pseudo-deductible cannot be \u0026#39;solved\u0026#39; in an algebraic sense, one method we can use to inform the question of how large of a pseudo-deductible may be ideal is Monte Carlo simulation based on real-world assumptions. Using national claims figures combined with peril-specific premium increases (as the premium increase for a loss which could indicate negligence or risky behavior is often higher than one that is completely out of an insured\u0026#39;s control, such as a natural disaster), the results of this analysis indicate that, in isolation, an ideal pseudo-deductible for homeowners insurance policy could be somewhere in the range of $500 to $1,500.\u003c/p\u003e\n\u003cp\u003eHowever, this amount is by no means fixed and is everchanging as both consumers and insurers adjust to the behavior of one another. But the key point is that by adopting some non-trivial pseudo-deductible above and beyond one\u0026#39;s deductible, it is possible to reduce both long-term average costs and outcome variability. Yet, if those adhering to conventional wisdom truly adopt deductibles \u0026#34;as high as they can afford\u0026#34;, this may not put them in a position to strategically forgo claims that may increase long-term costs. Instead, consumers may wish to first identify the maximum pseudo-deductible they can afford to adopt (or wish to adopt given their risk preferences) and then select a lower deductible which allows them to strategically forgo claims that may result in higher costs in the long run (but not a deductible that\u0026#39;s too\u003cem\u003e \u003c/em\u003emuch lower, or consumers are paying a higher premium for a lower deductible threshold they won\u0026#39;t use anyway given their higher pseudodeductible).\u003c/p\u003e\n\u003cp\u003eFinancial advisors can lend a hand by helping clients understand these dynamics, as well as helping clients develop a better understanding of the actual odds that they will incur a loss (versus their preconceived notions of those odds). Ultimately, though, for relatively wealthier clients, the biggest impact might not necessarily be the difference between their deductible and pseudodeductible (which might represent a few thousand dollars), but rather that they\u0026#39;re properly insured in the first place, particularly amidst rising costs for both property and liability claims!\u003c/p\u003e\n\u003ch2 data-nav-title=\"Effectiveness Of 2024’s Sleep Trends\" id=\"evaluating-the-effectiveness-of-2024s-sleep-trends\"\u003e\u003cspan\u003e\u003ca href=\"https://www.scientificamerican.com/article/science-backed-sleep-tips-from-2024-to-help-you-snooze-better/\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eEvaluating The Effectiveness Of 2024\u0026#39;s Sleep Trends\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Lauren Young | Scientific American)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGiven that everyone sleeps, there are no shortage of opinions on how to get the \u0026#39;best\u0026#39; sleep possible. A challenge, though, is the how to evaluate the sleep-related tips and trends that pop up on social media and elsewhere.\u003c/p\u003e\n\u003cp\u003eFor example, one popular online trend this year was the \u0026#34;sleepy girl mocktail\u0026#34; (a combination of cherry juice, seltzer, and magnesium), which adherents suggest helps them sleep better. Nonetheless, while magnesium can help relax muscles and affect pathways in the brain that stabilize mood and anxiety (though it can sometimes act as a sleep-disrupting laxative), it\u0026#39;s unclear whether the combination has sleep-enhancing powers. Another trend had individuals with back pain sleeping directly on the floor. While some physiotherapists suggest that doing so could help take pressure off of the back, the hardness of the floor could lead to joint stiffness and put more pressure on the hips and buttocks, which could result in back pain. While the previous trends have questionable benefits, one practice that very likely worsens sleep is \u0026#34;bed rotting\u0026#34; or staying in bed for prolonged periods of time (purposely avoiding productive activity in the process). While some promoting this tactic suggest they feel rejuvenated afterwards, some experts suggest doing so can throw off the body\u0026#39;s internal clock and make it harder to get to sleep at the \u0026#39;normal\u0026#39; time.\u003c/p\u003e\n\u003cp\u003eAltogether, while some of these trends might outlast 2024, more mundane sleep hygiene practices (e.g., maintaining a regular sleep schedule and avoiding stressors before bedtime) appear more likely to stand the test of time and lead to a better night\u0026#39;s sleep.\u003c/p\u003e\n\u003ch2 id=\"how-to-exercise-for-better-sleep\"\u003e\u003cspan\u003e\u003ca href=\"https://www.nytimes.com/2024/12/02/well/move/how-to-exercise-for-better-sleep.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow To Exercise For Better Sleep\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Hannah Singleton | The New York Times)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s widely accepted that sufficient exercise and sleep are part of a healthy lifestyle. However, the interaction between these two habits is murkier. For example, while it might seem logical that a heavy workout would make an individual feel more tired (and therefore have a better night of sleep), some research suggests this isn\u0026#39;t always the case, particularly for those with insomnia (i.e., chronic dissatisfaction with sleep quality or quantity for at least three nights a week over three months).\u003c/p\u003e\n\u003cp\u003eWhile moderate aerobic exercise (e.g., walking, jogging, or cycling) can provide sleep-inducing benefits, more intense activities (e.g., training for a half marathon or a High-Intensity Interval Training [HIIT] session) can increase levels of cortisol (the body\u0026#39;s stress hormone), which can make it harder to get to sleep, as well as muscle soreness, which can cause restless sleep during the night. Another factor affecting the exercise-sleep relationship could the timing of one\u0026#39;s workout, with \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S2095254620300533?via%3Dihub\"\u003eone study\u003c/a\u003e finding that any physical activity after 8 p.m. caused people to sleep less with \u003ca href=\"https://www.sciencedirect.com/science/article/abs/pii/S1087079221001209\"\u003eanother\u003c/a\u003e indicating that intense exercise ending one hour before bed may disrupt sleep. For those who don\u0026#39;t just face the occasional restless night, but rather full-on insomnia, getting into a regular routine for exercise (i.e., time during the day) and being aware of their body\u0026#39;s response (e.g., pain and soreness) can help them access the benefits of exercise while (hopefully) minimally disrupting, or even encouraging, better sleep.\u003c/p\u003e\n\u003cp\u003eUltimately, the key point is that while exercise and sleep remain cornerstones for a healthy lifestyle, the relationship between these two activities is likely to differ among individuals. Which suggests that testing out different routines (e.g. exercising in the morning versus the afternoon and trying different workout regimens) could help one find a successful balance that leads to a virtuous cycle where exercise and sleep support each other rather than act in opposing directions!\u003c/p\u003e\n\u003ch2 data-nav-title=\"The Pursuit Of Perfect Sleep Can Backfire\" id=\"how-the-pursuit-of-perfect-sleep-can-backfire\"\u003e\u003cspan\u003e\u003ca href=\"https://www.nytimes.com/2024/09/08/well/better-sleep-quality.html\" target=\"_blank\" rel=\"noopener\" data-wknd-cat=\"Other\"\u003eHow The Pursuit Of Perfect Sleep Can Backfire\u003c/a\u003e\u003c/span\u003e\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003e(Kate Lindsay | The New York Times)\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn his book \u003ca href=\"https://amzn.to/49XD9gZ\"\u003eThe Paradox of Choice: Why Less is More\u003c/a\u003e, author Barry Schwartz identifies two personality types: Satisficers, who tend to be content with having just enough, and Maximizers, who continually strive to attain and achieve more, no matter how far they get. While this dynamic can apply to many parts of life (\u003ca href=\"https://www.kitces.com/blog/the-paradox-of-choice-schwartz-maximizers-satisficers-gratitude-comparisons-realistic-goals-financial-satisfaction/\"\u003eincluding financial planning\u003c/a\u003e!), in recent years sleep has become the latest area for individuals to try to maximize.\u003c/p\u003e\n\u003cp\u003eThanks to new technology (e.g., wearable devices that can measure body signals and deliver a \u0026#34;sleep score\u0026#34; in the morning), it has become easier than ever to track not only the amount of time that one sleeps, but also the quality of that sleep. On the one hand, doing this tracking could encourage people to have better, healthier sleep habits. However, this tracking can become an obsession for some, with the stress caused by seeking the \u0026#39;perfect\u0026#39; night of sleep actually reducing the quantity and quality of sleep in the process. In fact, researchers at Northwestern University coined the term \u0026#34;orthosomnia\u0026#34; to describe people who seek treatment for self-diagnosed sleep issues resulting from their use of sleep trackers.\u003c/p\u003e\n\u003cp\u003eIn sum, while pursuing better sleep could be a healthy New Year\u0026#39;s Resolution, trying to maximize it (sometimes with the encouragement of online forums and a growing market of sleep-related products, such as mouth tape and jaw straps meant to encourage nasal breathing) could prove counterproductive if it leads to stress that makes it harder to fall and stay asleep. Which suggests that focusing on the \u0026#39;basics\u0026#39; of sleep hygiene, such as trying to go to bed at the same time each night and avoiding caffeine and alcohol too close to bedtime, could ultimately be a more productive step towards better sleep and a healthier lifestyle.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003eWe hope you enjoyed the reading! Please leave a comment below to share your thoughts, or make a suggestion of any articles you think we should highlight in a future column!\u003c/p\u003e\n\u003cp\u003eIn the meantime, if you\u0026#39;re interested in more news and information regarding advisor technology, we\u0026#39;d highly recommend checking out \u003ca href=\"https://wmtoday.com/\"\u003eCraig Iskowitz\u0026#39;s \u0026#34;Wealth Management Today\u0026#34; blog\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;Weekend Reading For Financial Planners (December 28–29)\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-d5a32c138bc5a51289da6e1e-=\"\"\u003e\u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "33 min read",
  "publishedTime": "2024-12-27T14:00:26-05:00",
  "modifiedTime": "2024-12-27T18:15:14Z"
}
