{
  "id": "7515534b-7d58-4672-bc43-85e7599cae3c",
  "title": "Today’s Car Market: Are New Car Prices Going Up or Down?",
  "link": "https://www.nerdwallet.com/article/cars/car-market-prices",
  "description": "Cars are so expensive now due to post-pandemic demand, higher production costs, and new technology, infotainment, driver assistance, and hybrid/EV powertrains.",
  "author": "Shannon Bradley",
  "published": "Fri, 28 Feb 2025 16:19:50 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Car News",
    "Cars"
  ],
  "byline": "Shannon Bradley",
  "length": 6803,
  "excerpt": "Cars are so expensive now due to post-pandemic demand, higher production costs, and new technology, infotainment, driver assistance, and hybrid/EV powertrains.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Updated February 28From December 2024 to January 2025, the average transaction price of new vehicles fell 2.2% to $48,641, according to analytics company Cox Automotive and Kelley Blue Book. Research company J.D. Power also forecast a January decline in new car prices to an average of $44,636, which is a decrease of $238 compared to the previous year.But new car prices may not continue trending downward, if tariffs announced by the Trump administration are fully implemented. On February 27, President Trump said in a Truth Social post that previously announced 25% tariffs on imports from Mexico and Canada will begin on March 4. He added that an already implemented 10% tariff on imports from China, which includes parts to make cars, will double that day. On February 19, Trump announced tariffs \"in the neighborhood of 25%\" would be imposed on auto imports and semiconductor chips (used in nearly all modern cars) as soon as April 2. While details are still scarce, automakers are likely to pass at least some portion of tariff costs to consumers.Why are cars so expensive now?New car prices are high for three reasons:High consumer demand following the Covid-19 pandemic has enabled car manufacturers and dealers to keep prices high.Ongoing inflation has increased manufacturing and labor costs, which car manufacturers and dealers have passed on to car buyers.Many new cars come with advanced technology, larger infotainment screens, driver-assistance systems, and hybrid/EV powertrains — all adding to the cost.  At the height of the pandemic, supply chain disruptions and semiconductor chip shortages were responsible for slowing, and even halting, vehicle production. As car inventory decreased, new and used car prices skyrocketed and remain elevated today.New car prices climbed 22% since 2019According to the consumer price index (CPI), which is a Bureau of Labor Statistics (BLS) measurement of inflation and prices paid by consumers, new vehicle prices have increased 22% since 2019. Although prices did decrease slightly in 2024, they ticked back up at the end of the year and remained unchanged through January 2025, according to the CPI report released Feb. 12. Average new car prices are still approximately $11,000 higher than they were before COVID-19 hit. They’re hovering near 2022’s all-time highs, which J.D. Power places at $47,329 and Cox Automotive sets at $49,926. Did you know...A tariff is a tax imposed by the government of a country on goods imported from another country. A government might use tariffs to regulate trade, protect domestic interests or raise revenue. The purchaser of the goods (such as a carmaker buying parts) pays the tariff and may choose to pass that cost on to consumers.Will car prices continue to go up under Trump?On top of the previously mentioned tariffs, 25% tariffs on steel and aluminum imports are expected to begin on March 12, both products central to the production of vehicles. With the announcement of so many tariffs, much uncertainty remains about how they will collectively affect car prices.The Canada and Mexico tariffs will disrupt North American free trade and further affect car prices if these countries impose reciprocal tariffs, according to Cox Automotive. The full effect tariffs will have on car prices remains to be seen, but S\u0026P Global Mobility estimates a 25% tariff on a $25,000 car from Mexico or Canada could increase its price by up to $6,250, with importers likely to pass most or all of this increase along to consumers.Elimination of the EV tax credit may also cause prices of certain electric vehicles and plug-in hybrids to rise. Members of the Senate recently introduced legislation to end the EV tax credit (currently up to $7,500 for new vehicles and up to $4,000 for used) and to add a $1,000 tax per EV for road repairs, .What about auto financing rates and payments?On top of paying high car prices, car buyers who finance are likely to continue paying elevated interest rates and payments. Average auto loan interest rates increased to their highest level in years during the pandemic, and they’ve barely budged down. According to J.D. Power, the average new car payment was on pace to be $734 in January. Although presidents don’t control interest rates, their policies may influence them. When prices overall begin to rise, the Federal Reserve usually increases the federal funds rate to slow economic activity and reduce inflation. When the federal funds rate changes, auto loan rates typically follow. The following chart shows movement of the federal funds rate since 2021.Are used car prices dropping?Yes. According to Cox Automotive, in January 2025 the average used-vehicle listing price was $25,128 — a decrease of approximately $650 from the previous month. Used vehicle prices have steadily decreased throughout 2024; however, used car inventory has been tight due to fewer off-lease vehicles being returned and owners keeping their cars longer. If new car prices increase, we could see a repeat of car buyers turning to used cars as they did during the pandemic. The result then was further tightening of low inventory, which drove used car prices higher — in some cases, higher than new car prices.Car ownership cost presents an additional challengeThe upfront price of cars hasn’t been the only financial pain point for consumers, as shown by the NerdWallet Vehicle Ownership Costs Index, which is a measurement of inflation and spending figures from the BLS. Car ownership costs grew at a double-digit annual rate every month from April 2021 to November 2022, according to NerdWallet's ownership index. That growth has slowed overall, but the most recent data shows ownership inflation was 7% in January. Since January 2020, the costs — including gas, repairs and maintenance, parking, insurance and licensing costs — have risen 41%.Is now a good time to buy a car?If you anticipate wanting or needing a new car in the next few years and can afford to buy now, it may be a good idea to do so. Although car prices, auto loan interest rates and ownership costs are higher now than they were five years ago, they may climb even higher. Buying while inventory is plentiful could save you money. “Lower auto loan rates now look less likely in the future, so adding tariff risk points to an environment where it is better to buy sooner rather than later, all else being equal,” according to Cox Automotive Chief Economist Jonathan Smoke.To reduce car costs as much as possible before buying, follow a few simple steps. Check online pricing guides such as Kelley Blue Book, Edmunds or NADA guides to know what price you should pay. Use an auto loan calculator to determine the best scenario — loan amount, interest rate, term and down payment — for a monthly payment that fits your budget.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/02/GettyImages-1426470518-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eUpdated February 28\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFrom December 2024 to January 2025, the average transaction price of new vehicles fell 2.2% to $48,641, according to analytics company Cox Automotive and Kelley Blue Book. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eResearch company J.D. Power also forecast a January decline in new car prices to an average of $44,636, which is a decrease of $238 compared to the previous year.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut new car prices may not continue trending downward, if tariffs announced by the Trump administration are fully implemented. On February 27, President Trump said in a Truth Social post that previously announced 25% tariffs on imports from Mexico and Canada will begin on March 4. He added that an already implemented 10% tariff on imports from China, which includes parts to make cars, will double that day. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eOn February 19, Trump announced tariffs \u0026#34;in the neighborhood of 25%\u0026#34; would be imposed on auto imports and semiconductor chips (used in nearly all modern cars) as soon as April 2\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. While details are still scarce, automakers are likely to pass at least some portion of tariff costs to consumers.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"why-are-cars-so-expensive-now\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWhy are cars so expensive now?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eNew car prices are high for three reasons:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003col data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eHigh consumer demand following the Covid-19 pandemic has enabled car manufacturers and dealers to keep prices high.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eOngoing inflation has increased manufacturing and labor costs, which car manufacturers and dealers have passed on to car buyers.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eMany new cars come with advanced technology, larger infotainment screens, driver-assistance systems, and hybrid/EV powertrains — all adding to the cost.  \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ol\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eAt the height of the pandemic, supply chain disruptions and semiconductor chip shortages were responsible for slowing, and even halting, vehicle production. As car inventory decreased, new and used car prices skyrocketed and remain elevated today.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"new-car-prices-climbed-22percent-since-2019\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eNew car prices climbed 22% since 2019\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAccording to the consumer price index (\u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-cpi\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eCPI\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e), which is a Bureau of Labor Statistics (BLS) measurement of inflation and prices paid by consumers, new vehicle prices have increased 22% since 2019\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. Although prices did decrease slightly in 2024, they ticked back up at the end of the year and remained unchanged through January 2025, according to the CPI report released Feb. 12. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eAverage new car prices are still approximately $11,000 higher than they were before COVID-19 hit. They’re hovering near 2022’s all-time highs, which J.D. Power places at $47,329 and Cox Automotive sets at $49,926. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-currency=\"Text\"\u003eDid you know...\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-a-tariff\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003etariff\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e is a tax imposed by the government of a country on goods imported from another country. A government might use tariffs to regulate trade, protect domestic interests or raise revenue. The purchaser of the goods (such as a carmaker buying parts) pays the tariff and may choose to pass that cost on to consumers.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"will-car-prices-continue-to-go-up-under-trump\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWill car prices continue to go up under Trump?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eOn top of the previously mentioned tariffs, 25% tariffs on steel and aluminum imports are expected to begin on March 12, both products central to the production of vehicles. With the announcement of so many tariffs, much uncertainty remains about how they will collectively affect car prices.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eThe Canada and Mexico tariffs will disrupt North American free trade and further affect car prices if these countries impose reciprocal tariffs, according to Cox Automotive\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. The full effect tariffs will have on car prices remains to be seen, but S\u0026amp;P Global Mobility estimates a 25% tariff on a $25,000 car from Mexico or Canada could increase its price by up to $6,250, with importers likely to pass most or all of this increase along to consumers\u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eElimination of the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/taxes/ev-tax-credit-electric-vehicle-tax-credit\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eEV tax credit\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e may also cause prices of certain electric vehicles and plug-in hybrids to rise. Members of the Senate recently introduced legislation to end the EV tax credit (currently up to $7,500 for new vehicles and up to $4,000 for used) and to add a $1,000 tax per EV for road repairs\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e, \u003c/span\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp id=\"what-about-auto-financing-rates-and-payments\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWhat about auto financing rates and payments?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eOn top of paying high car prices, car buyers who finance are likely to continue paying elevated interest rates and payments. \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/auto-loans/average-car-loan-interest-rates-by-credit-score\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eAverage auto loan interest rates\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e increased to their highest level in years during the pandemic, and they’ve barely budged down. According to J.D. Power, the average new car payment was on pace to be $734 in January\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eAlthough presidents don’t control interest rates, their policies may influence them. When prices overall begin to rise, the Federal Reserve usually increases the federal funds rate to slow economic activity and reduce inflation. When the federal funds rate changes, auto loan rates typically follow. The following chart shows movement of the federal funds rate since 2021.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"are-used-car-prices-dropping\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eAre used car prices dropping?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eYes. According to Cox Automotive, in January 2025 the average used-vehicle listing price was $25,128 — a decrease of approximately $650 from the previous month\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eUsed vehicle prices have steadily decreased throughout 2024; however, used car inventory has been tight due to fewer off-lease vehicles being returned and owners keeping their cars longer. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIf new car prices increase, we could see a repeat of car buyers turning to used cars as they did during the pandemic. The result then was further tightening of low inventory, which drove used car prices higher — in some cases, higher than new car prices.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"car-ownership-cost-presents-an-additional-challenge\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eCar ownership cost presents an additional challenge\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe upfront price of cars hasn’t been the only financial pain point for consumers, as shown by the NerdWallet Vehicle Ownership Costs Index, which is a measurement of inflation and spending figures from the BLS. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCar ownership costs grew at a double-digit annual rate every month from April 2021 to November 2022, according to NerdWallet\u0026#39;s ownership index. That growth has slowed overall, but the most recent data shows ownership inflation was 7% in January. Since January 2020, the costs — including gas, repairs and maintenance, parking, insurance and licensing costs — have risen 41%.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp id=\"is-now-a-good-time-to-buy-a-car\"\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eIs now a good time to buy a car?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIf you anticipate wanting or needing a new car in the next few years and can afford to buy now, it may be a good idea to do so. Although car prices, auto loan interest rates and ownership costs are higher now than they were five years ago, they may climb even higher. Buying while inventory is plentiful could save you money. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Lower auto loan rates now look less likely in the future, so adding tariff risk points to an environment where it is better to buy sooner rather than later, all else being equal,” according to Cox Automotive Chief Economist Jonathan Smoke.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTo reduce car costs as much as possible before buying, follow a few simple steps. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eCheck online pricing guides such as Kelley Blue Book, Edmunds or NADA guides to know what price you should pay. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eUse an \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/calculator/auto-loan-calculator\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eauto loan calculator\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to determine the best scenario — loan amount, interest rate, term and down payment — for a monthly payment that fits your budget.\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-28T16:19:50Z",
  "modifiedTime": null
}
