{
  "id": "81f8d3bb-fef0-42db-8bb0-2a810773fb88",
  "title": "How Will Federal Workforce Cuts Affect the Economy?",
  "link": "https://www.nerdwallet.com/article/finance/federal-job-cuts",
  "description": "Under Trump, tens of thousands of federal workers have been fired or left voluntarily, but it remains to be seen whether the cuts will have significant economic impact.",
  "author": "Anna Helhoski",
  "published": "Tue, 18 Mar 2025 18:21:44 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Personal Finance"
  ],
  "byline": "Anna Helhoski",
  "length": 13787,
  "excerpt": "Under Trump, tens of thousands of federal workers have been fired or left voluntarily, but it remains to be seen whether the cuts will have significant economic impact.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Tens of thousands of federal workers have been fired or left since President Donald Trump’s administration began and there are more cuts on the way.Federal agencies had until March 13 to submit plans for “large-scale reductions in force.” It’s unclear when the results of those plans will result in further layoffs. The latest Education Department (ED) firings, like the gutting of the Consumer Financial Protection Bureau (CFPB), are part of the president’s pledge to trim the federal payroll overall — while targeting some agencies in particular. The official ED announcement ominously called the reduction in personnel the department's “final mission.” While eliminating a department or agency entirely would take an act of Congress, massive cuts can impede its ability to carry out its legally required functions. The majority of the firings are being carried out by the so-called Department of Government Efficiency or DOGE, which is led by billionaire Elon Musk — a “special government employee.” As Musk’s team name suggests, the firings are being justified in the name of “efficiency.” DOGE, which is on track to grow to 200 workers, has promised to reduce the size of the government by $1 trillion by the start of the 2025-2026 fiscal year beginning on Oct. 1. Those reductions could hit numerous departments, including those that have already seen staff cuts. Reuters recently reported that a Veterans Affairs internal memo mentions 80,000 job cuts coming in June. The outlet also reported that another 1,000 layoffs are expected at the National Oceanic and Atmospheric Administration, which already cut 1,300 workers. In the midst of tax season, the Associated Press reported that the IRS is planning to cut around half of its 90,000-person staff. How have the courts responded? At least some of the cuts haven’t held up in court. Earlier in March, a coalition of attorneys general of 19 states and the District of Columbia filed a suit against 18 federal agencies over the mass firing of probationary workers, arguing against the legality of the move. The suit also argues DOGE’s moves will hurt state finances. Following a hearing of the case, U.S. District Judge James Bredar granted a temporary restraining order and ordered that the federal government reinstate their positions. Bredar said, \"This case isn't about whether or not the government can terminate people. It’s about if they decide to terminate people, how they must do it.\"News moves fast. Stay ahead of how it could impact your money.Interest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. In a separate case filed in the Northern District of California by the American Federation of Government Employees union, a judge ruled that the firings were not carried out lawfully. The Office of Personnel Management, which functions as the human resources department for the federal government, ordered the firings, which Judge William Alsup said it went against protocol: Agencies must fire workers directly. This week, some 24,000 probationary employees who were fired have been reinstated to their positions. However, most of the employees were reportedly placed on administrative leave. But on Tuesday, Alsup said that placing reinstated workers on administrative leave was not allowed. DOGE’s firings have drawn a bevy of other lawsuits and it’s unclear how those will pan out in court. How affected departments will function from here on out, is another issue. But what’s also murky is whether the cuts will have a significant impact on an economy that’s already been shaken by tariffs and other executive actions. How many federal government workers are there? The federal government is the nation’s largest employer. U.S. Bureau of Labor Statistics data shows that employment head count in the federal government has remained on a mostly steady level since 2010, with a spike of employment during the Great Recession and the pandemic. As of November 2024, there were some 3 million federal employees across the U.S., a little less than 2% of the entire U.S. workforce. The 1.3 million active-duty military personnel aren’t counted as federal government employees. Among those 3 million federal workers, more than 600,000 work for the U.S. Postal Service, an agency that operates independently of the federal government. It’s a public service required by law, but doesn’t receive money from taxpayers; the USPS supports itself with consumer sales. Nevertheless, the USPS said last week it would work with DOGE to slash operating costs and cut 10,000 employees over 30 days by offering voluntary early retirement. In addition, there are some 3.7 million federal contractors who aren’t counted as federal employees. How the federal workforce is distributedWithout taking the USPS worker population into consideration, here’s how the remaining federal workers are distributed among departments and agencies, according to 2024 data gathered by Pew Research and published in January. These figures are approximate and don’t take into account recent layoffs.The Department of Veterans Affairs: 16%Department of Homeland Security: \u003c1%Department of the Army: 7%Department of the Navy: 7%Department of the Air Force: 6%Department of Defense: 5%Department of Agriculture: 3%Department of Health and Human Services: 3%Department of the Interior: 2%The Social Security Administration: 2%Department of Justice: 4%Department of the Treasury: 4%Department of Transportation: 2%Department of Commerce: 2%The remaining departments and agencies employ fewer than roughly 18,000 workers, or under 1% of the entire federal workforce. In descending order, from most to least, that includes: National Aeronautics and Space Administration (NASA); Department of Energy; Environmental Protection Agency; Department of Labor; National Nuclear Security Administration; Department of State; General Services Administration; Small Business Administration; Department of Housing and Urban Development; Federal Deposit Insurance Corporation. The Department of Education has the fewest number of workers.The majority of workers (92%) would be considered white collar workers, according to the Pew report. The biggest category of workers (16%) work in health-related fields; the most common occupations are in nursing or administrative work.How many federal workers have left or been fired under Trump?Recent unemployment insurance claims and the latest jobs reports haven’t shown a significant slowdown in jobs or unemployment. But delays in the data come with the territory. The exact number of federal employees fired hasn’t been released by the Trump Administration, but Layoffs.fyi, which is tracking reports of the cuts, says 113,331 federal employees have otherwise left or been let go since Trump entered office. That includes 36,091 government employees laid off by DOGE and some 77,000 employees who voluntarily resigned on the condition they would be paid through the end of September.Those figures are estimates only, which means a big picture assessment of the cuts’ impact is still difficult to discern. \"There is clearly a lot of exaggeration happening and attempts to really foment a sense of chaos,” says Skanda Amaranth, executive director of Employ America, a macroeconomic policy research and advocacy organization. “We know they’re haphazardly canceling a lot of contracts and trying to make big cuts to the workforce. Workforce turnover tends to be higher at the beginning of presidential terms.\"Amaranth adds that in past periods of austerity, government employment has declined by 4,000 to 10,000 per month. In a report last week, Wells Fargo economists said their best guess is that federal employment will decline by 25,000 to 50,000 in the coming months. Which employees have been fired?Numerous reports show that job cuts have hit every department of the federal government. After Trump took office, he directed agencies to find what workforce cuts they could, beginning with “probationary employees.” Most of the staff fired have been in their positions for a short period of time; they’re known as “probationary employees” and have been in their positions for less than two years. However, for bureaucratic reasons, some probationary workers aren’t new hires — they’re in the midst of a title or department change. The administration has also made some accidental firings along the way, including nuclear safety workers, scientists studying the H5N1 bird flu and employees that keep power grids running. The accidental layoffs quickly led to rehirings. Will the federal job cuts have a significant economic impact?The 2025 government layoffs will likely be the biggest from a single employer in history. The previous title was held by IBM, a giant in the private sector, which laid off 60,000 workers in 1993.This isn’t the first time the federal government has made mass cuts: In the 1990s, under the Clinton administration’s “Reinventing Government” initiative, some 426,000 workers lost their jobs. But that took seven years to execute — not seven weeks. Here are some of the ways the cuts may — or may not — impact the economyConsumer spending could declineLayoffs, in general, influence spending patterns among consumers who aren’t earning income or are earning less than they once did. If enough workers are unemployed for a lengthy period, it could reduce overall consumer spending. Less spending lowers demand for goods and services, which could have negative effects on economic growth. But that also depends on how other sectors are faring; if unemployment is healthy in other industries, then spending by those workers could offset the impact of layoffs in another sector. Lower government spending means growth could slow DOGE’s goal in reducing the size of the federal government is to reduce spending quickly. But if DOGE succeeds in nosediving government spending, it could theoretically slow the economy. Declining growth is already a concern: The most recent gross domestic product (GDP) forecasting tool published by the Atlanta Federal Reserve shows negative growth for the first quarter of 2025. There hasn’t been quarter-over-quarter negative growth since the first half of 2022. Local economies could take the hardest hitsMass firings tend to have more localized impacts so areas with denser populations of federal workers could see more suffering. “Federal workers tend to have stable incomes that support local economies,” says Amaranth. “If you suddenly cut a lot of those jobs, that’s less spending at local businesses, less demand for housing, and less stability overall.\"A Pew analysis of 2024 federal data shows that while D.C, Maryland and Virginia first come to mind as a hotbed of government workers, together they comprise only about one-fifth of the federal workforce. Outside the beltway, the biggest states have the heftiest number of federal workers: California (147,500 workers) and Texas (130,000 workers), according to Pew data. But concentration is what matters when it comes to localized impact. In D.C., Maryland and Virginia combined, federal workers comprise 5.84% of the region’s total workforce. Outside the D.C. area, the only states with greater than 2.49% concentration are Alaska and New Mexico. Certain sectors that directly and indirectly receive federal government dollars could be affected, too. Amaranth points to state and local governments, as well as health care and social assistance. “That’s where we could start to see spillover effects,” he said. Next steps are crucial to minimizing effects of the cutsThe shorter the duration of unemployment, the lower the impacts to the economy. In a note to PNC investors on March 7, the bank’s Chief Economist Gus Faucher said, “Federal government job losses could be larger than expected, and laid-off workers could pull back on their spending, leading to slower job growth in other industries.” But the job functions of federal employees run the gamut, which means there’s no one sector that laid-off workers can turn to. And as the labor market tightens, it could be tougher to find new positions.\"The labor market right now isn’t bad, but it’s more fragile,\" says Amaranth. “The sectors that were hiring aggressively in the past couple of years — like healthcare and education — have already done their catch-up hiring. So displaced federal workers may not find new jobs as easily as they would in a stronger hiring environment.\"State government might be the next option for many workers. Multiple states have recently launched recruitment efforts targeting laid off federal workers, including Hawaii, Maryland, New York, Pennsylvania and Virginia. Delivery of services and other government functions could be hinderedThe indirect impacts of the workforce cuts are what should worry the typical person the most. Delivery of services including Social Security, Medicaid and Medicare, tax refunds, student loans, veterans benefits and more could be jeopardized by diminished federal staff. There are other critical functions that departments may not be able to perform with lower headcounts. On Monday, Martha Gimbel, executive director at the Budget Lab at Yale University posted on LinkedIn, “In the long-run, the biggest risk to the economy from DOGE is that the government will not be able to head off or respond to a crisis.” She added, “Remember — the government's mission is to ensure the smooth functioning of society by taking on tasks that don’t make sense for the private sector. If those efforts are undermined, that could mean that a crisis like avian flu harms the economy and the government struggles to respond properly.” (Photo by Andrew Harnik/Getty Images News via Getty Images)",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/03/GettyImages-2200924637.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eTens of thousands of federal workers have been fired or left since President Donald Trump’s administration began and there are more cuts on the way.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFederal agencies had until March 13 to submit plans for “large-scale reductions in force.” It’s unclear when the results of those plans will result in further layoffs. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe latest \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/loans/student-loans/education-department\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eEducation Department\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e (ED) firings, like the gutting of the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-cfpb\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eConsumer Financial Protection Bureau\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e (CFPB), are part of the president’s pledge to trim the federal payroll overall — while targeting some agencies in particular. The official ED announcement ominously called the reduction in personnel the department\u0026#39;s “final mission.” While eliminating a department or agency entirely would take an act of Congress, massive cuts can impede its ability to carry out its legally required functions. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe majority of the firings are being carried out by the so-called Department of Government Efficiency or DOGE, which is led by billionaire Elon Musk — a “special government employee.” As Musk’s team name suggests, the firings are being justified in the name of “efficiency.” DOGE, which is on track to grow to 200 workers, has promised to reduce the size of the government by $1 trillion by the start of the 2025-2026 fiscal year beginning on Oct. 1. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThose reductions could hit numerous departments, including those that have already seen staff cuts. Reuters recently reported that a Veterans Affairs internal memo mentions 80,000 job cuts coming in June. The outlet also reported that another 1,000 layoffs are expected at the National Oceanic and Atmospheric Administration, which already cut 1,300 workers. In the midst of \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/taxes/when-is-tax-season-start-date-how-early-you-can-file\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003etax season\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, the Associated Press reported that the IRS is planning to cut around half of its 90,000-person staff. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"how-have-the-courts-responded\"\u003e\u003cspan\u003eHow have the courts responded? \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAt least some of the cuts haven’t held up in court. Earlier in March, a coalition of attorneys general of 19 states and the District of Columbia filed a suit against 18 federal agencies over the mass firing of probationary workers, arguing against the legality of the move. The suit also argues DOGE’s moves will hurt state finances. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFollowing a hearing of the case, U.S. District Judge James Bredar granted a temporary restraining order and ordered that the federal government reinstate their positions. Bredar said, \u0026#34;This case isn\u0026#39;t about whether or not the government can terminate people. It’s about if they decide to terminate people, how they must do it.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch3 data-currency=\"Text\" id=\"news-moves-fast.-stay-ahead-of-how-it-could-impact-your-money.\"\u003e\u003cspan\u003eNews moves fast. Stay ahead of how it could impact your money.\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eInterest rates, inflation, natural disasters — get notified when breaking news could affect your finances, and get expert insights to help you plan your next move. \u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" src=\"https://s3.us-east-1.amazonaws.com/cdns3.nerdwallet.com/User+Engagement/25Q1_UEG_Content-Site-Ads-2-Fed_signals_major.svg\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIn a separate case filed in the Northern District of California by the American Federation of Government Employees union, a judge ruled that the firings were not carried out lawfully. The Office of Personnel Management, which functions as the human resources department for the federal government, ordered the firings, which Judge William Alsup said it went against protocol: Agencies must fire workers directly. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThis week, some 24,000 probationary employees who were fired have been reinstated to their positions. However, most of the employees were reportedly placed on administrative leave. But on Tuesday, Alsup said that placing reinstated workers on administrative leave was not allowed. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDOGE’s firings have drawn a bevy of other lawsuits and it’s unclear how those will pan out in court. How affected departments will function from here on out, is another issue. But what’s also murky is whether the cuts will have a significant impact on an economy that’s already been shaken by tariffs and other executive actions. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"how-many-federal-government-workers-are-there\"\u003e\u003cspan\u003eHow many federal government workers are there? \u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe federal government is the nation’s largest employer. U.S. Bureau of Labor Statistics data shows that employment head count in the federal government has remained on a mostly steady level since 2010, with a spike of employment during the Great Recession and the pandemic. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAs of November 2024, there were some 3 million federal employees across the U.S., a little less than 2% of the entire U.S. workforce. The 1.3 million active-duty military personnel aren’t counted as federal government employees.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAmong those 3 million federal workers, more than 600,000 work for the U.S. Postal Service, an agency that operates independently of the federal government. It’s a public service required by law, but doesn’t receive money from taxpayers; the USPS supports itself with consumer sales. Nevertheless, the USPS said last week it would work with DOGE to slash operating costs and cut 10,000 employees over 30 days by offering voluntary early retirement. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn addition, there are some 3.7 million federal contractors who aren’t counted as federal employees. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan aria-expanded=\"false\" role=\"button\" tabindex=\"0\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eHow the federal workforce is distributed\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eWithout taking the USPS worker population into consideration, here’s how the remaining federal workers are distributed among departments and agencies, according to 2024 data gathered by Pew Research and published in January. These figures are approximate and don’t take into account recent layoffs.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eThe Department of Veterans Affairs: 16%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Homeland Security: \u0026lt;1%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of the Army: 7%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of the Navy: 7%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of the Air Force: 6%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Defense: 5%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Agriculture: 3%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Health and Human Services: 3%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of the Interior: 2%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eThe Social Security Administration: 2%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Justice: 4%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of the Treasury: 4%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Transportation: 2%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eDepartment of Commerce: 2%\u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe remaining departments and agencies employ fewer than roughly 18,000 workers, or under 1% of the entire federal workforce. In descending order, from most to least, that includes: National Aeronautics and Space Administration (NASA); Department of Energy; Environmental Protection Agency; Department of Labor; National Nuclear Security Administration; Department of State; General Services Administration; Small Business Administration; Department of Housing and Urban Development; Federal Deposit Insurance Corporation. The Department of Education has the fewest number of workers.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe majority of workers (92%) would be considered white collar workers, according to the Pew report. The biggest category of workers (16%) work in health-related fields; the most common occupations are in nursing or administrative work.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"how-many-federal-workers-have-left-or-been-fired-under-trump\"\u003e\u003cspan\u003eHow many federal workers have left or been fired under Trump?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eRecent unemployment insurance claims and the latest jobs reports haven’t shown a significant slowdown in jobs or unemployment. But delays in the data come with the territory. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe exact number of federal employees fired hasn’t been released by the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-economy\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eTrump Administration\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, but Layoffs.fyi, which is tracking reports of the cuts, says 113,331 federal employees have otherwise left or been let go \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-executive-orders\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esince Trump entered office\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. That includes 36,091 government employees laid off by DOGE and some 77,000 employees who voluntarily resigned on the condition they would be paid through the end of September.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThose figures are estimates only, which means a big picture assessment of the cuts’ impact is still difficult to discern. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u0026#34;There is clearly a lot of exaggeration happening and attempts to really foment a sense of chaos,” says Skanda Amaranth, executive director of Employ America, a macroeconomic policy research and advocacy organization. “We know they’re haphazardly canceling a lot of contracts and trying to make big cuts to the workforce. Workforce turnover tends to be higher at the beginning of presidential terms.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAmaranth adds that in past periods of austerity, government employment has declined by 4,000 to 10,000 per month. In a report last week, Wells Fargo economists said their best guess is that federal employment will decline by 25,000 to 50,000 in the coming months. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"which-employees-have-been-fired\"\u003e\u003cspan\u003eWhich employees have been fired?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNumerous reports show that job cuts have hit every department of the federal government. After Trump took office, he directed agencies to find what workforce cuts they could, beginning with “probationary employees.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMost of the staff fired have been in their positions for a short period of time; they’re known as “probationary employees” and have been in their positions for less than two years. However, for bureaucratic reasons, some probationary workers aren’t new hires — they’re in the midst of a title or department change. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe administration has also made some accidental firings along the way, including nuclear safety workers, scientists studying the H5N1 bird flu and employees that keep power grids running. The accidental layoffs quickly led to rehirings. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\" id=\"will-the-federal-job-cuts-have-a-significant-economic-impact\"\u003e\u003cspan\u003eWill the federal job cuts have a significant economic impact?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe 2025 government layoffs will likely be the biggest from a single employer in history. The previous title was held by IBM, a giant in the private sector, which laid off 60,000 workers in 1993.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThis isn’t the first time the federal government has made mass cuts: In the 1990s, under the Clinton administration’s “Reinventing Government” initiative, some 426,000 workers lost their jobs. But that took seven years to execute — not seven weeks. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere are some of the ways the cuts may — or may not — impact the economy\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"consumer-spending-could-decline\"\u003e\u003cspan\u003eConsumer spending could decline\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLayoffs, in general, influence spending patterns among consumers who aren’t earning income or are earning less than they once did. If enough workers are unemployed for a lengthy period, it could reduce overall consumer spending. Less spending lowers demand for goods and services, which could have negative effects on economic growth. But that also depends on how other sectors are faring; if unemployment is healthy in other industries, then spending by those workers could offset the impact of layoffs in another sector. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"lower-government-spending-means-growth-could-slow\"\u003e\u003cspan\u003eLower government spending means growth could slow \u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDOGE’s goal in reducing the size of the federal government is to reduce spending quickly. But if DOGE succeeds in nosediving government spending, it could theoretically slow the economy. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDeclining growth is already a concern: The most recent gross domestic product (GDP) forecasting tool published by the Atlanta Federal Reserve shows negative growth for the first quarter of 2025. There hasn’t been quarter-over-quarter negative growth since the first half of 2022. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"local-economies-could-take-the-hardest-hits\"\u003e\u003cspan\u003eLocal economies could take the hardest hits\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMass firings tend to have more localized impacts so areas with denser populations of federal workers could see more suffering. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Federal workers tend to have stable incomes that support local economies,” says Amaranth. “If you suddenly cut a lot of those jobs, that’s less spending at local businesses, less demand for housing, and less stability overall.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA Pew analysis of 2024 federal data shows that while D.C, Maryland and Virginia first come to mind as a hotbed of government workers, together they comprise only about one-fifth of the federal workforce. Outside the beltway, the biggest states have the heftiest number of federal workers: California (147,500 workers) and Texas (130,000 workers), according to Pew data. But concentration is what matters when it comes to localized impact. In D.C., Maryland and Virginia combined, federal workers comprise 5.84% of the region’s total workforce. Outside the D.C. area, the only states with greater than 2.49% concentration are Alaska and New Mexico. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCertain sectors that directly and indirectly receive federal government dollars could be affected, too. Amaranth points to state and local governments, as well as health care and social assistance. “That’s where we could start to see spillover effects,” he said.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"next-steps-are-crucial-to-minimizing-effects-of-the-cuts\"\u003e\u003cspan\u003eNext steps are crucial to minimizing effects of the cuts\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe shorter the duration of unemployment, the lower the impacts to the economy. In a note to PNC investors on March 7, the bank’s Chief Economist Gus Faucher said, “Federal government job losses could be larger than expected, and laid-off workers could pull back on their spending, leading to slower job growth in other industries.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut the job functions of federal employees run the gamut, which means there’s no one sector that laid-off workers can turn to. And as the labor market tightens, it could be tougher to find new positions.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e\u0026#34;The labor market right now isn’t bad, but it’s more fragile,\u0026#34; says Amaranth. “The sectors that were hiring aggressively in the past couple of years — like healthcare and education — have already done their catch-up hiring. So displaced federal workers may not find new jobs as easily as they would in a stronger hiring environment.\u0026#34;\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eState government might be the next option for many workers. Multiple states have recently launched recruitment efforts targeting laid off federal workers, including Hawaii, Maryland, New York, Pennsylvania and Virginia. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\" id=\"delivery-of-services-and-other-government-functions-could-be-hindered\"\u003e\u003cspan\u003eDelivery of services and other government functions could be hindered\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe indirect impacts of the workforce cuts are what should worry the typical person the most. Delivery of services including Social Security, Medicaid and Medicare, tax refunds, student loans, veterans benefits and more could be jeopardized by diminished federal staff. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are other critical functions that departments may not be able to perform with lower headcounts. On Monday, Martha Gimbel, executive director at the Budget Lab at Yale University posted on LinkedIn, “In the long-run, the biggest risk to the economy from DOGE is that the government will not be able to head off or respond to a crisis.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eShe added, “Remember — the government\u0026#39;s mission is to ensure the smooth functioning of society by taking on tasks that don’t make sense for the private sector. If those efforts are undermined, that could mean that a crisis like avian flu harms the economy and the government struggles to respond properly.” \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e(Photo by Andrew Harnik/Getty Images News via Getty Images)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-03-18T18:21:44Z",
  "modifiedTime": null
}
