{
  "id": "b826eb32-2600-4986-b38c-b03b253683bb",
  "title": "How Buying Points Can Help You Save on Hotels",
  "link": "https://www.nerdwallet.com/article/travel/buying-points-save-on-hotels",
  "description": "Buying hotels points is generally ill-advised because it's poor value. However, here's when you should consider making an exception to save on hotel stays.",
  "author": "Carissa Rawson",
  "published": "Wed, 18 Jun 2025 20:05:12 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Loyalty Programs",
    "Travel"
  ],
  "byline": "Carissa Rawson",
  "length": 3551,
  "excerpt": "Buying hotels points is generally ill-advised because it's poor value. However, here's when you should consider making an exception to save on hotel stays.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "You can get hotel points in a variety of ways: staying at hotels, transferring your credit card points to hotel loyalty programs, earning points through spending on a hotel credit card or simply buying them.The general advice for travelers is to avoid purchasing points from hotels because it offers poor value. Hotels often sell points for more than they’re actually worth. For example, you might buy Hilton points for 1 cent each, but according to NerdWallet’s valuation, they can only be redeemed for about 0.6 cent each on average. But in the right circumstances, buying points can help bolster your points balance and make it possible to book a hotel stay you might not have otherwise, especially if you are not in a position to open a hotel or travel credit card.Here’s how buying points can save you money on your hotel stays.When to consider buying pointsDuring points salesThere are some promotions throughout the year that can make a points purchase worthwhile. For example, when Hilton runs a 100% bonus on buying points, you’d be buying points for 0.5 cent and you’d likely be able to redeem them for more than that.If you can get a fourth or fifth night freeThere are some deals that let you get a fourth or fifth night free if you book completely on points. If you can buy points for less than the cost of paying cash for four or five nights, then you’ll save money on these longer stays. Just keep in mind that some programs require you to have elite status (like Hilton) or hold a certain credit card (IHG) to be able to get the free night on award stays.When buying points is less than paying in cashBefore buying points, it’s important to crunch some numbers. For example, here’s a one-night stay at the Hyatt House San Diego/Sorrento Mesa in mid-April:As you can see, it costs about $300 for the night. In points, the cost is 12,000 World of Hyatt points per night:Were you to buy those points straight up from Hyatt (with a 25% discount during a sale), it’d cost you just $234.In this example, you’d save $55 by buying points and using them to book the room with the king bed at the standard rate. That’s not always the case, however. Here’s that same hotel for a stay in mid-September:The cash price is lower, but that doesn’t necessarily mean it’ll cost less in points. In fact, for this stay, you’d pay a few thousand more points for the night. Were you to buy all 15,000 of those points, it’d cost you $292.50 — or nearly $70 more for the king room than just paying in cash. Using all three strategiesSaving $55 by buying points is great, but it’s just the beginning when it comes to redeeming points for hotel stays. One of the best methods is to buy points when they’re on sale, then redeem them for luxury vacations where cash rates are extremely high. For example, the Conrad Bora Bora Nui costs 120,000 Hilton Honors points per night for a lagoon view suite. In cash, you’ll need to pay around $1,300 for the same room. However, when Hilton has one of its many sales offering up to a 100% bonus on purchased points, you can buy Hilton points for 0.5 cent each. This means you can buy 480,000 Hilton points for $2,400.Those 480,000 points can then be combined with Hilton’s fifth night free on award stays (available to anyone with Hilton elite status). All told, you’ll end up paying $2,400 for five nights at the Conrad Bora Bora Nui by choosing to buy your points.Were you to pay cash instead, you’d pay roughly $6,500. In this example, you’re saving 63% by buying points and redeeming them.How to maximize your rewards",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/03/GettyImages-2195395760-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eYou can get hotel points in a variety of ways: staying at hotels, transferring your credit card points to hotel loyalty programs, earning points through spending on a hotel credit card or simply buying them.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe general advice for travelers is to avoid purchasing points from hotels because it offers poor value. Hotels often sell points for more than they’re actually worth. For example, you might buy Hilton points for 1 cent each, but according to \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/how-much-are-my-hilton-honors-points-worth\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eNerdWallet’s valuation\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e, they can only be redeemed for about \u003c/span\u003e\u003cspan\u003e0.6 cent\u003c/span\u003e\u003cspan\u003e each on average. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBut in the right circumstances, buying points can help bolster your points balance and make it possible to book a hotel stay you might not have otherwise, especially if you are not in a position to open a hotel or travel credit card.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere’s how buying points can save you money on your hotel stays.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWhen to consider buying points\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eDuring points sales\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are some promotions throughout the year that can make a points purchase worthwhile. For example, when Hilton runs a 100% bonus on buying points, you’d be buying points for 0.5 cent and you’d likely be able to redeem them for more than that.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eIf you can get a fourth or fifth night free\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are some deals that let you get a fourth or fifth night free if you book completely on points. If you can buy points for less than the cost of paying cash for four or five nights, then you’ll save money on these longer stays. Just keep in mind that some programs require you to have elite status (like \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/hilton-honors-elite-status-your-complete-guide\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eHilton\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e) or hold a certain credit card (\u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/ihg-rewards-more-value-for-the-frugal-traveler\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eIHG\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e) to be able to get the free night on award stays.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eWhen buying points is less than paying in cash\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBefore buying points, it’s important to crunch some numbers. For example, here’s a one-night stay at the Hyatt House San Diego/Sorrento Mesa in mid-April:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Computer Hardware, Electronics, Hardware\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image2.png?fit=600%2C1044\" credit=\"nerdwallet\" id=\"1713209\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eAs you can see, it costs about $300 for the night. In points, the cost is 12,000 \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/world-hyatt-complete-guide\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eWorld of Hyatt\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e points per night:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Computer Hardware, Electronics, Hardware\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image5-1.png?fit=600%2C924\" credit=\"nerdwallet\" id=\"1713211\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWere you to buy those points straight up from Hyatt (with a 25% discount during a sale), it’d cost you just $234.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Text, Document\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image4-1.png?fit=770%2C684\" credit=\"nerdwallet\" id=\"1713213\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIn this example, you’d save $55 by buying points and using them to book the room with the king bed at the standard rate. That’s not always the case, however. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHere’s that same hotel for a stay in mid-September:\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Computer Hardware, Electronics, Hardware\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image6-1.png?fit=600%2C1118\" credit=\"nerdwallet\" id=\"1713212\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThe cash price is lower, but that doesn’t necessarily mean it’ll cost less in points. In fact, for this stay, you’d pay a few thousand more points for the night. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Computer Hardware, Electronics, Hardware\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image3-1.png?fit=600%2C962\" credit=\"nerdwallet\" id=\"1713210\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eWere you to buy all 15,000 of those points, it’d cost you $292.50 — or nearly $70 more for the king room than just paying in cash.  \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Text\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image8.png?fit=770%2C650\" credit=\"nerdwallet\" id=\"1713214\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eUsing all three strategies\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSaving $55 by buying points is great, but it’s just the beginning when it comes to redeeming points for hotel stays. One of the best methods is to buy points when they’re on sale, then redeem them for luxury vacations where cash rates are extremely high. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFor example, the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/travel/conrad-bora-bora-nui\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eConrad Bora Bora Nui\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e costs 120,000 Hilton Honors points per night for a lagoon view suite. \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"File, Water, Waterfront\" src=\"https://www.nerdwallet.com/tachyon/2025/03/image7-1.png?fit=770%2C888\" credit=\"nerdwallet\" id=\"1713215\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eIn cash, you’ll need to pay around $1,300 for the same room. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHowever, when Hilton has one of its many sales offering up to a 100% bonus on purchased points, you can buy Hilton points for 0.5 cent each. This means you can buy 480,000 Hilton points for $2,400.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Architecture, Building, Countryside\" src=\"https://www.nerdwallet.com/tachyon/2025/03/Screenshot-2025-06-10-at-4.16.30%E2%80%AFPM.png?fit=770%2C458\" credit=\"unknown\" id=\"1775162\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eThose 480,000 points can then be combined with Hilton’s fifth night free on award stays (available to anyone with Hilton elite status). All told, you’ll end up paying $2,400 for five nights at the Conrad Bora Bora Nui by choosing to buy your points.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWere you to pay cash instead, you’d pay roughly $6,500. In this example, you’re saving 63% by buying points and redeeming them.\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3 data-currency=\"Text\"\u003e\u003cspan\u003eHow to maximize your rewards\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-18T20:05:12Z",
  "modifiedTime": null
}
