{
  "id": "c9971c63-5c8b-4ed7-afc1-184a1ea8c637",
  "title": "House Budget Would Raise Debt Limit, Cut Taxes and Spending",
  "link": "https://www.nerdwallet.com/article/finance/2025-budget",
  "description": "The House GOP is proposing a sweeping budget resolution to further Trump’s priorities, including spending and tax cuts.",
  "author": "Anna Helhoski",
  "published": "Wed, 12 Feb 2025 22:57:08 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Personal Finance"
  ],
  "byline": "Anna Helhoski",
  "length": 2707,
  "excerpt": "The House GOP is proposing a sweeping budget resolution to further Trump’s priorities, including spending and tax cuts.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "A higher debt limit, spending cuts and tax cuts are all part of the sweeping budget resolution released by the House GOP on Wednesday. The proposed budget would further much of the Trump administration’s ambitions. Since President Donald Trump took office, he has relied on executive orders and the efforts of his so-called Department of Government Efficiency, or DOGE, to fulfill items on his agenda. Those have included downsizing the federal workforce, as well as probing and dismantling certain government departments. House Speaker Mike Johnson posted on X, “this resolution reflects our collective commitment to enacting the President's full agenda — not just a part of it.” Trump has stated in the past that he wants “one big, beautiful bill” to expedite his policy plans. The House’s budget proposal would still need to go through standard procedures like markup before advancing to the broader House and, if it passes, then to the Senate for reconciliation. The reconciled bill will then need to be approved in the Senate by a minimum of 60 votes in order to bypass the legislative filibuster. Reconciliation could prove difficult since the Senate Republicans’ approach to the budget is at odds with its House colleagues; the Senate Budget Committee is working on two separate budget resolutions. Last week, the Senate introduced the first of two bills that includes a $150 billion increase for border security and a $175 billion increase for defense. A second Senate bill would address tax cuts. Both houses’ proposals are just blueprints, which means specific details on cuts and revenue sources would be made by committees, first during markup and then during reconciliation. Here are some of the highlights of what House GOP members are proposing for the coming year: $4.5 trillion in tax cuts over the next 10 years. Trump has said he wants to extend his 2017 Tax Cuts and Jobs Act and axe the tax on tips. $2 trillion in spending cuts to pay for other parts of the bill such as tax cuts, border security and defense. The bill directs several committees to find programs to cut in order to reduce spending, which could mean cuts to two critical safety net programs: Medicaid and the Supplemental Nutrition Assistance Program (SNAP). Raising the debt limit to $4 trillion. The U.S. hit its debt limit last month and the Treasury has had to employ extraordinary measures to stave off a default, which would have catastrophic economic consequences. Raising the debt limit would prevent a default. $100 billion increase to defense spending in the next decade. $90 billion increase for homeland security, which handles border security. (Photo by Anna Moneymaker/Getty Images News via Getty Images)",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2025/02/GettyImages-2198931656-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eA higher debt limit, spending cuts and tax cuts are all part of the sweeping budget resolution released by the House GOP on Wednesday. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe proposed budget would further much of the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-economy\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eTrump administration’s ambitions\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. Since President Donald Trump took office, he has relied on \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/trump-executive-orders\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003eexecutive orders\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e and the efforts of his so-called Department of Government Efficiency, or DOGE, to fulfill items on his agenda. Those have included downsizing the federal workforce, as well as probing and dismantling certain government departments.  \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHouse Speaker Mike Johnson posted on X, “this resolution reflects our collective commitment to enacting the President\u0026#39;s full agenda — not just a part of it.” Trump has stated in the past that he wants “one big, beautiful bill” to expedite his policy plans. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe House’s budget proposal would still need to go through standard procedures like markup before advancing to the broader House and, if it passes, then to the Senate for reconciliation. The reconciled bill will then need to be approved in the Senate by a minimum of 60 votes in order to bypass the legislative filibuster. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eReconciliation could prove difficult since the Senate Republicans’ approach to the budget is at odds with its House colleagues; the Senate Budget Committee is working on two separate budget resolutions. Last week, the Senate introduced the first of two bills that includes a $150 billion increase for border security and a $175 billion increase for defense. A second Senate bill would address tax cuts. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBoth houses’ proposals are just blueprints, which means specific details on cuts and revenue sources would be made by committees, first during markup and then during reconciliation. Here are some of the highlights of what House GOP members are proposing for the coming year: \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cul data-currency=\"List\"\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e$4.5 trillion in tax cuts over the next 10 years. Trump has said he wants to extend his 2017 Tax Cuts and Jobs Act and axe the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/no-tax-on-tips\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003etax on tips\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e$2 trillion in spending cuts to pay for other parts of the bill such as tax cuts, border security and defense. The bill directs several committees to find programs to cut in order to reduce spending, which could mean cuts to two critical safety net programs: Medicaid and the Supplemental Nutrition Assistance Program (SNAP). \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003eRaising the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/debt-ceiling\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003edebt limit\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to $4 trillion. The U.S. hit its debt limit last month and the Treasury has had to employ extraordinary measures to stave off a default, which would have catastrophic economic consequences. Raising the debt limit would prevent a default. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e$100 billion increase to defense spending in the next decade. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e\u003cspan\u003e$90 billion increase for homeland security, which handles border security. \u003c/span\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e(Photo by Anna Moneymaker/Getty Images News via Getty Images)\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-12T22:57:08Z",
  "modifiedTime": null
}
