{
  "id": "cfc65171-cf6c-4b11-ae9f-d845bec0f7f4",
  "title": "Honoring a Beloved Community Member with Our Cancer Survivor Scholarship",
  "link": "https://affordanything.com/honoring-a-beloved-community-member-with-our-cancer-survivor-scholarship/",
  "description": "Our Afford Anything community recently lost a treasured member. Jonathan was a real estate agent, a devoted husband and father, and one of our most active and helpful students in our Your First Rental Property course community. Jonathan was known for his generous spirit. He enriched our community with his enthusiasm, responsiveness, and willingness to [...]",
  "author": "Paula Pant",
  "published": "Wed, 06 Nov 2024 21:53:38 +0000",
  "source": "https://affordanything.com/feed/",
  "categories": [
    "FIRE"
  ],
  "byline": "",
  "length": 2089,
  "excerpt": "Our Afford Anything community recently lost a treasured member. Jonathan was a real estate agent, a devoted husband and father, and one of our most active and helpful students in our Your First Rental Property course community.",
  "siteName": "",
  "favicon": "https://affordanything.com/wp-content/uploads/eminence/favicon/favicon-196x196.png?v=10932",
  "text": "Our Afford Anything community recently lost a treasured member. Jonathan was a real estate agent, a devoted husband and father, and one of our most active and helpful students in our Your First Rental Property course community. Jonathan was known for his generous spirit. He enriched our community with his enthusiasm, responsiveness, and willingness to help others. His passing after a battle with cancer has deeply touched our community. Inspired by Jonathan’s legacy of giving, we’re creating a scholarship for the Fall 2024 cohort of our Your First Rental Property course. This scholarship will be awarded to one cancer survivor or fighter. Scholarship Details: Full enrollment in the YFRP course, beginning Fall 2024 ($1,297 value) Access to all course materials, study halls, and office hours Lifetime membership in our community Who Can Apply: We welcome applications from anyone who has faced a cancer diagnosis. Whether you’re currently in treatment, in remission, living with no evidence of disease, or cancer-free, your journey and your story matter to us. This scholarship is open to you at any stage of your cancer journey. How to Apply: Send an email to support (at) affordanything (dot) com with the subject line “YFRP Scholarship Application” that includes: A brief description of your cancer journey (share only what you’re comfortable with) Why you want to build a rental property portfolio How you hope to make an impact through real estate investing Important Notes: Deadline: Thursday, Nov 7th at 11:59 PM Eastern Applications should be written submissions Financial need is not a consideration The selected recipient will be invited (but not required) to share their story with our community We’ll notify the recipient on Friday, Nov 8th by no later than 5 PM Eastern. This scholarship represents our commitment to supporting those who, despite facing significant health challenges, are determined to build financial independence through real estate investing. Have questions? Please email support (at) affordanything (dot) com.  With gratitude, Paula",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain\u003e\u003carticle aria-label=\"Honoring a Beloved Community Member with Our Cancer Survivor Scholarship\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eOur Afford Anything community recently lost a treasured member. Jonathan was a real estate agent, a devoted husband and father, and one of our most active and helpful students in our Your First Rental Property course community.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eJonathan was known for his generous spirit. He enriched our community with his enthusiasm, responsiveness, and willingness to help others. His passing after a battle with cancer has deeply touched our community.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eInspired by Jonathan’s legacy of giving, we’re creating a scholarship for the Fall 2024 cohort of our Your First Rental Property course. This scholarship will be awarded to one cancer survivor or fighter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eScholarship Details:\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003e Full enrollment in the YFRP course, beginning Fall 2024 ($1,297 value)\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e Access to all course materials, study halls, and office hours\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e Lifetime membership in our community\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cb\u003eWho Can Apply:\u003c/b\u003e\u003cbr/\u003e\n\u003cspan\u003eWe welcome applications from anyone who has faced a cancer diagnosis. Whether you’re currently in treatment, in remission, living with no evidence of disease, or cancer-free, your journey and your story matter to us. This scholarship is open to you at any stage of your cancer journey.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eHow to Apply:\u003c/b\u003e\u003cbr/\u003e\n\u003cspan\u003eSend an email to support (at) affordanything (dot) com with the subject line “YFRP Scholarship Application” that includes:\u003c/span\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cspan\u003e A brief description of your cancer journey (share only what you’re comfortable with)\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e Why you want to build a rental property portfolio\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e How you hope to make an impact through real estate investing\u003c/span\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cb\u003eImportant Notes:\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003e Deadline: Thursday, Nov 7th at 11:59 PM Eastern\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e Applications should be written submissions\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e Financial need is not a consideration\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e The selected recipient will be invited (but not required) to share their story with our community\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan\u003eWe’ll notify the recipient on Friday, Nov 8th by no later than 5 PM Eastern.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThis scholarship represents our commitment to supporting those who, despite facing significant health challenges, are determined to build financial independence through real estate investing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHave questions? Please email support (at) affordanything (dot) com. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWith gratitude,\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003ePaula\u003c/span\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
