{
  "id": "d67bdc06-9fb4-4ff9-a1b2-80a258cdf203",
  "title": "CFPB Will Distribute $1.8B to Victims of Credit Repair ‘Scheme’",
  "link": "https://www.nerdwallet.com/article/finance/cfpb-credit-repair-refund",
  "description": "Two companies were found to have charged illegal advance fees. Refunds will average $435.",
  "author": "Taryn Phaneuf",
  "published": "Thu, 05 Dec 2024 22:15:47 +0000",
  "source": "https://www.nerdwallet.com/blog/feed/",
  "categories": [
    "Improving Your Credit",
    "Personal Finance"
  ],
  "byline": "Taryn Phaneuf",
  "length": 3799,
  "excerpt": "Two companies were found to have charged illegal advance fees. Refunds will average $435.",
  "siteName": "NerdWallet",
  "favicon": "https://www.nerdwallet.com/cdn/apps/prod/global-markup/images/apple-touch-icon-precomposed.png",
  "text": "Customers charged illegal fees by two of the largest credit repair firms will soon see a refund check, the Consumer Financial Protection Bureau announced Thursday.The CFPB says it will distribute $1.8 billion to 4.3 million consumers who were charged illegal advance fees by Lexington Law and CreditRepair.com, which used telemarketing to offer credit repair services to customers. “Lexington Law and CreditRepair.com exploited vulnerable consumers who were trying to rebuild their credit, charging them illegal junk fees for results they hadn’t delivered,” CFPB Director Rohit Chopra said in a news release. What are credit repair services?Credit repair services can help consumers build their credit by doing the tedious work of disputing outdated or incorrect information found on credit reports and following up on the results to be sure errors don’t reappear. It might cost more than $100 per month, with no guarantee of results.There are a number of errors a credit repair service might look for on a person’s credit report, including accounts or legal actions that don’t belong to the customer and negative information that’s too old to be included. Typically, a consumer can perform these actions on their own behalf.Refunds stem from 2019 lawsuitThe CFPB refund announced today stems from a 2019 lawsuit the bureau brought against two Salt Lake City-based companies that own Lexington Law and CreditRepair.com. The bureau accused the companies of violating the Telemarketing Sales Rule by asking customers to pay fees in advance of receiving any services. Under federal law, credit repair companies that use telemarketing can’t collect payment until six months after proving to customers that they delivered results.The lawsuit also accused the companies of using “deceptive” advertising to convince people to sign up for their services.A district court agreed with the CFPB and, in 2023, the companies were ordered to pay $2.7 billion to customers, plus additional civil penalties. The court also banned the companies from telemarketing credit repair services for 10 years. The companies have since filed for Chapter 11 bankruptcy, according to the CFPB, and shut down about 80% of their business, including their call centers. The payments to consumers — averaging $435 — will come from the CFPB’s victims relief fund, which is funded by the civil penalties companies are forced to pay for violating consumer protection laws. “This historic distribution of $1.8 billion demonstrates the CFPB’s commitment to making consumers whole, even when the companies that harm them shut down or declare bankruptcy,” Chopra said.Who gets a refundConsumers who are eligible for a refund check will receive payment by January. Eligible individuals don’t have to do anything to receive payment. But anyone who believes they’re eligible and hasn’t received a payment by mid-January can contact JND Legal Administration, which is administering payments and answering consumers’ questions about this case on behalf of the CFPB. More details about the distribution are available on the CFPB website at cfpb.gov/payments/lexlaw.Alternatives to credit repair servicesWhen trying to build a credit score, consumers don’t have to shell out hundreds of dollars for credit repair services. Instead, consumers can repair their credit on their own using many of the same steps credit repair companies take on customers’ behalf. Consumers can check their credit reports for free from the three major credit reporting bureaus: Experian, Equifax and TransUnion. Then, use each bureau’s dispute processes to call out errors or fraudulent activity. Also, look for unverifiable information, such as a debt to a company that’s no longer in business. Even if it’s accurate, it could be removed if it can’t be substantiated.",
  "image": "https://www.nerdwallet.com/assets/blog/wp-content/uploads/2024/12/GettyImages-157681670-1440x864.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eCustomers charged illegal fees by two of the largest credit repair firms will soon see a refund check, the Consumer Financial Protection Bureau announced Thursday.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe CFPB says it will distribute $1.8 billion to 4.3 million consumers who were charged illegal advance fees by Lexington Law and CreditRepair.com, which used telemarketing to offer credit repair services to customers. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Lexington Law and CreditRepair.com exploited vulnerable consumers who were trying to rebuild their credit, charging them illegal \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/what-is-a-junk-fee\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003ejunk fees\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e for results they hadn’t delivered,” CFPB Director Rohit Chopra said in a news release. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWhat are credit repair services?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://nerdwallet.com/article/finance/credit-repair\" data-currency=\"Link\" rel=\"nofollow noopener noreferrer\" target=\"_self\"\u003e\u003cspan\u003eCredit repair services\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e can help consumers build their credit by doing the tedious work of disputing outdated or incorrect information found on credit reports and following up on the results to be sure errors don’t reappear. It might cost more than $100 per month, with no guarantee of results.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThere are a number of errors a credit repair service might look for on a person’s credit report, including accounts or legal actions that don’t belong to the customer and negative information that’s too old to be included. Typically, a consumer can perform these actions on their own behalf.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eRefunds stem from 2019 lawsuit\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe CFPB refund announced today stems from a 2019 lawsuit the bureau brought against two Salt Lake City-based companies that own Lexington Law and CreditRepair.com. The bureau accused the companies of violating the Telemarketing Sales Rule by asking customers to pay fees in advance of receiving any services. Under federal law, credit repair companies that use telemarketing can’t collect payment until six months after proving to customers that they delivered results.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe lawsuit also accused the companies of using “deceptive” advertising to convince people to sign up for their services.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eA district court agreed with the CFPB and, in 2023, the companies were ordered to pay $2.7 billion to customers, plus additional civil penalties. The court also banned the companies from telemarketing credit repair services for 10 years. The companies have since filed for Chapter 11 bankruptcy, according to the CFPB, and shut down about 80% of their business, including their call centers. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe payments to consumers — averaging $435 — will come from the CFPB’s victims relief fund, which is funded by the civil penalties companies are forced to pay for violating consumer protection laws. “This historic distribution of $1.8 billion demonstrates the CFPB’s commitment to making consumers whole, even when the companies that harm them shut down or declare bankruptcy,” Chopra said.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eWho gets a refund\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eConsumers who are eligible for a refund check will receive payment by January. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eEligible individuals don’t have to do anything to receive payment. But anyone who believes they’re eligible and hasn’t received a payment by mid-January can contact JND Legal Administration, which is administering payments and answering consumers’ questions about this case on behalf of the CFPB. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMore details about the distribution are available on the CFPB website at \u003c/span\u003e\u003ca href=\"https://www.consumerfinance.gov/enforcement/payments-harmed-consumers/payments-by-case/lexlaw/\" data-currency=\"Link\" rel=\"nofollow noopener noreferrer\" target=\"_blank\"\u003e\u003cspan\u003ecfpb.gov/payments/lexlaw\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003ch2 data-currency=\"Text\"\u003e\u003cspan\u003eAlternatives to credit repair services\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen trying to build a credit score, consumers don’t have to shell out hundreds of dollars for credit repair services. Instead, consumers can repair their credit on their own using many of the \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/raise-credit-score-fast\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003esame steps\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e credit repair companies take on customers’ behalf. \u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eConsumers can \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/how-to-use-annualcreditreport-com\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003echeck their credit reports for free\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e from the three major credit reporting bureaus: Experian, Equifax and TransUnion. Then, use each bureau’s \u003c/span\u003e\u003ca href=\"https://www.nerdwallet.com/article/finance/dispute-hard-inquiry-credit-report\" data-currency=\"Link\" target=\"_self\"\u003e\u003cspan\u003edispute processes\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e to call out errors or fraudulent activity. Also, look for unverifiable information, such as a debt to a company that’s no longer in business. Even if it’s accurate, it could be removed if it can’t be substantiated.\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-05T22:15:47Z",
  "modifiedTime": null
}
