{
  "id": "f6d73bbb-be85-4d29-a140-26ea9161e75b",
  "title": "“How Much More Will I Get?”: Calculating The Impact Of WEP And GPO’s Repeal On Social Security Benefits",
  "link": "https://feeds.feedblitz.com/~/912835532/0/kitcesnerdseyeview~%e2%80%9cHow-Much-More-Will-I-Get%e2%80%9d-Calculating-The-Impact-Of-WEP-And-GPO%e2%80%99s-Repeal-On-Social-Security-Benefits/",
  "description": "When the Social Security Fairness Act was signed into law on January 5, 2025, it came as a relief to many recipients of state or local government pensions whose Social Security benefits had been, up until now, reduced by the Windfall Elimination Provision (WEP) for individuals claiming retirement benefits under their own name, or theRead More... The post “How Much More Will I Get?”: Calculating The Impact Of WEP And GPO’s Repeal On Social Security Benefits first appeared on Kitces.com.",
  "author": "Ben Henry-Moreland",
  "published": "Wed, 12 Feb 2025 12:03:34 +0000",
  "source": "http://feeds.feedblitz.com/kitcesnerdseyeview\u0026x=1",
  "categories": [
    "Retirement Planning"
  ],
  "byline": "Ben Henry-Moreland",
  "length": 35061,
  "excerpt": "How advisors can help clients with a realiable estimate of the impact of WEP \u0026 GPO repeal on Social Security Benefits, and its effect on retirement strategies.",
  "siteName": "Nerd's Eye View | Kitces.com",
  "favicon": "https://www.kitces.com/wp-content/uploads/2023/03/cropped-michael-kitces-favicon-192x192.png",
  "text": "Executive Summary When the Social Security Fairness Act was signed into law on January 5, 2025, it came as a relief to many recipients of state or local government pensions whose Social Security benefits had been, up until now, reduced by the Windfall Elimination Provision (WEP) for individuals claiming retirement benefits under their own name, or the Government Pension Offset (GPO) for those claiming spousal or survivor benefits under a current or former spouse's name. The new law repeals both the WEP and GPO, restoring full Social Security benefits to affected individuals, retroactive to January 2024. The caveat, however, is that although the law is set to take effect immediately (and apply retroactively to more than a year's worth of prior benefits), the Social Security Administration (SSA) has indicated that it could take a year or more to fully restore benefits due to the complexity of recalculating payments for millions of affected retirees. While it may take a while for the adjustments to take place, advisors can still help their clients plan for the effect of WEP and GPO's repeal by estimating how much the client will be receiving in Social Security benefits once the new law is implemented. But the challenge in making such an estimate is the fact that SSA doesn't clearly show many individuals what their full benefits would be without the reduction for WEP or GPO. While future retirees can find nonreduced benefit estimates on their Social Security statements or online accounts, those already receiving benefits don't have access to this information – making it necessary to find a different way to predict how much their payments will increase once the law is fully implemented. For individuals eager to know how much they'll be receiving once their full benefits are restored, the best approach is to use their history of Social Security-covered earnings (or their spouse's history, for spousal and survivor benefits) and apply the actual formulas that SSA uses to calculate benefits. However, not everyone will have access to their full earnings history, and individuals who find the Social Security website and identity verification processes to be too onerous to navigate won't necessarily be able to download their history. In these cases, it's still possible to 'back out' an estimate of unreduced benefits using their current reduced benefit – provided they know key details like the age at which they elected benefits. Notably, estimating benefits in this way isn't a simple 'back-of-the-envelope' calculation, given the complexity of the rules determining the calculation of Social Security retirement, spousal, and survivor benefits. To help with this, we've developed a downloadable calculator that simplifies the process of estimating an individual's unreduced Social Security benefits, whether or not a full earnings history is available. The key point is that the question of \"How much will I be getting?\" will be top of mind for clients affected by the WEP and GPO. And given that the reduction can amount to hundreds or even thousands of dollars per month, having a reliable estimate of the impact of WEP and GPO's repeal can help advisors proactively plan for the impact the new law will have on their clients' retirement strategies. While there's still uncertainty about the actual timing of the law's implementation, advisors can still add value today by helping clients understand how the repeal will shape their financial future! Ben Henry-Moreland Team Kitces Ben Henry-Moreland is a Senior Financial Planning Nerd at Kitces.com, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful. Read more of Ben’s articles here. + Read More + Joe Elsasser Guest Contributor Joe is the founder and president of Covisum®, a financial tech company focused on creating software that improves lives through better financial decisions. Covisum helps financial advisors serving mass-affluent clients in or near retirement and powers some of the nation’s largest financial planning institutions. Joe is also a practicing advisor through his own planning firm, Adaptive Advice, LLC in Omaha, NE. He co-authored Social Security Essentials, Smart Ways to help Boost Your Retirement Income, and is a frequent contributor to a variety of industry and news publications. Read more of Joe’s articles here. + Read More + For decades, individuals who worked in state, local, or certain foreign government jobs where they did not pay Social Security taxes on their earnings were subject to reduced Social Security benefits under the Windfall Elimination Provision (WEP) and Government Pension Offset (GPO) rules. These provisions affected approximately 2.8 million retirees, which largely included former state or municipal employees like teachers, police officers, and firefighters, by reducing the amount of Social Security benefits they could receive under their own earnings record (in the case of WEP) or their spouse's record (in the case of GPO) if they also received pension payments from those jobs. The impact of WEP and GPO varied greatly from one individual to the next. For those with relatively small noncovered pensions or shorter, part-time careers in noncovered employment (though still long enough to qualify for a pension), the total reduction might have been only a few hundred dollars per year. But for others, the effect was much greater. For instance, because GPO reduced an individual's Social Security spousal or survivor benefits by up to two-thirds of their noncovered pension payments, a person with a $3,000/month pension would have their benefits reduced by 2/3 × $3,000 = $2,000. In many cases, this was more than the spousal or survivor benefit they would have been owed in the first place. The rationale behind WEP and GPO was to prevent noncovered government workers from receiving disproportionately higher total retirement benefits. Because the calculations for Social Security benefits aim to be more generous to workers with lower average career earnings, non-Social-Security-covered workers appeared – at least on paper – as low earners (since their noncovered earnings were disregarded in the calculation). This resulted in disproportionately higher Social Security benefits than those received by workers who made the same amount of total income, but had paid into the Social Security system throughout their careers. In practice, however, the WEP and GPO provisions were confusing to navigate and difficult to plan for. Many of the people affected viewed them as an unfair reduction of the Social Security benefits that they – or their spouse – had earned through years of work and contributions. To address these challenges, in late 2024, Congress passed the Social Security Fairness Act, which repealed both the WEP and GPO and immediately restored full Social Security benefits for current and future recipients who also receive pensions from noncovered employment. Furthermore, the new law is retroactive to payments payable on and after January 1, 2024, meaning that those whose benefits were reduced by WEP or GPO after that date will receive retroactive payments to make up for the reductions. The caveat, however, is that despite the Social Security Fairness Act technically taking effect immediately (and being retroactive to the beginning of 2024), it could take several months to over a year for affected recipients to see their WEP- and GPO-reduced benefits restored to their full amounts. On the Social Security Administration (SSA) website regarding the Social Security Fairness Act (last updated on February 3rd at the time of this writing), SSA states that it could take more than a year to fully adjust benefits and issue retroactive payments. And with SSA currently in a hiring freeze, and the Trump administration aiming to further downsize the Federal workforce, it's conceivable that implementing the new law's changes could take even longer. For many individuals whose benefits were previously reduced by WEP and GPO, the big question now is: \"How much more will I get?\" The simple answer is that, once SSA is able to implement the Social Security Act's changes, they'll receive their full, unreduced benefit going forward. What isn't so simple, however, is determining exactly what that unreduced benefit will be. Even without WEP and GPO, the calculation of Social Security benefits is complex. First, SSA uses an individual's career earnings to calculate their Primary Insurance Amount (PIA), which is the monthly benefit they would receive based on their own earnings record if they were to apply to receive benefits at their Full Retirement Age (FRA). From that base PIA number, further adjustments are made in the form of benefit reductions for filing before their FRA or increases for delaying beyond FRA up to age 70. For spouses, the base spousal benefit is 50% of the working spouse's PIA, but that number can be reduced if the spouse files for spousal benefits prior to their own FRA (unless they have a child in their care who is under age 16 or disabled). For widows and widowers of deceased earners, the benefit calculation gets even more complex because the calculation changes depending on whether the (deceased) working spouse, the surviving spouse, both spouses, or neither filed for benefits after their FRA. If the deceased spouse filed for retirement benefits after reaching FRA, and the surviving spouse filed for survivor benefits after reaching their own FRA, the base benefit is simply the deceased earner's PIA, plus any delayed retirement credits they had earned. If the deceased spouse had filed for retirement benefits before FRA and was receiving a reduced benefit at the time of their passing, the survivor benefit is reduced as well. In this case, if the surviving spouse files for survivor benefits after reaching their own FRA, the maximum reduction is 17.5%, meaning that the minimum survivor benefit is 1 − 17.5% = 82.5% of the deceased spouse's PIA. In the opposite scenario – where the deceased spouse had filed for retirement benefits after FRA but the surviving spouse files for benefits before FRA – the surviving spouse's benefit is reduced by up to 28.5% of the working spouse's PIA if the surviving spouse files for survivor benefits at age 60, the earliest possible filing age for survivors. And when the working spouse filed for retirement benefits before reaching their FRA, and the surviving spouse filed for benefits before their own FRA, they need to use both of the two calculations above and take the lowest result to determine their spousal benefit. For surviving spouses born before 1962, the FRA for determining survivor benefits may be different from the FRA used for retirement benefits. The surviving spouse uses the FRA for the year two years prior to their birth year on the standard FRA table. For instance, a person born in 1960 with an FRA of 67 for their own retirement benefits would have an FRA of 66 and 8 months for survivor benefits (i.e., the FRA for a person born in 1958). In other words, calculating an individual's Social Security benefit isn't straightforward because it depends on multiple factors. These include their own or their spouse's PIA, their (or their spouse's) FRA, the age at which they (or their spouse) applied for benefits, their earned income (if they're under their FRA), and, in the case of survivor benefits, when the original earner died. Because of these many variables, accurately determining the benefit amount often requires specialized calculation tools that can incorporate all the relevant information to produce an accurate benefit estimate. One of the ironic plot twists in the aftermath of the Social Security Fairness Act is that it's much easier to estimate the effects of the repeal of the WEP and GPO for individuals who have not yet filed for benefits than it is for those who are already receiving benefits. Every individual who has yet to apply for Social Security benefits receives an annual Social Security statement, either in the mail or (for those who have signed up) electronically via their my Social Security account. The statement lists their estimated monthly retirement benefit, in today's dollars, for each filing age from age 62 (the earliest year of eligibility) to age 70 (the highest age at which an individual can continue to receive delayed retirement credits to increase their benefit). Those amounts are not reduced for WEP, and so the amount listed on the statement is simply the amount that the individual can expect to receive as their own benefit at any given age. For the purposes of the Social Security statement, SSA assumes that an individual's future earnings will remain consistent with their most recent year's earnings until they file for benefits. For a more precise estimate of future benefits, individuals can use their actual Social Security-covered earnings history, which is available by logging into their my Social Security account under \"Earnings History\" (previously found on Page 2 of the statement). This earnings record can be entered into SSA's Online Benefits Calculator, along with the individual's current-year earnings and an estimate of their average future earnings until filing. Alternatively, a version of this calculator that automatically incorporates the individual's earnings history is available for those who log into their my Social Security account. For spousal benefits, the standard benefit amount is 50% of the working spouse's Primary Insurance Amount (PIA) – the monthly benefit the worker would receive if claimed at their Full Retirement Age (FRA). While the Social Security statement doesn't explicitly state the PIA, it can be inferred from the worker's FRA benefit amount. Spouses who plan to apply for spousal benefits prior to their own FRA, which reduces their benefit below the standard 50%, can use Social Security's spousal benefit calculator to find the correct percentage of the worker's PIA to use for their estimated spousal benefit. For widowed spouses who haven't yet filed for survivor benefits, it can be harder to track down the necessary information about the original (deceased) worker's benefits. The survivor benefit is based on either: The actual amount the deceased spouse had been receiving (if they had already started receiving benefits); or The amount they would have been eligible to receive (if they hadn't yet applied). To estimate their potential survivor benefit, the surviving spouse would need to find records of the deceased spouse's Social Security payments before they passed away or obtain a copy of their earnings history. Unlike those who have not yet filed for benefits, current Social Security recipients who have had their benefits reduced by the WEP or GPO may have a much harder time finding an accurate estimate of what their 'full' benefit will be once the Social Security Fairness Act is fully implemented. Once an individual begins receiving Social Security benefits, they no longer receive an annual Social Security statement or future benefit estimates. Which makes sense on one level, since once benefits begin, they generally don't change, and there's no longer a need for an estimate of future benefits for someone who has already begun receiving them. However, for someone whose benefits are expected to change – such as individuals whose current WEP- or GPO-reduced benefits will be restored to their full amounts – there's no readily available estimate of their nonreduced benefit that can be pulled from the Social Security statement or online account. In these cases, when an individual may have elected benefits years or even decades ago and may have little information about what their original 'full' benefit would have been, it may be necessary to calculate their benefit based on whatever information is available today. Estimating Benefits Using An Earnings History The simplest way to calculate an estimate of an individual's Social Security retirement benefits is to follow the same process used by SSA: Review the full yearly earnings history; Calculate the Primary Insurance Amount (PIA); Apply any increases or decreases for early and delayed filing; and Factor in any spousal or survivor benefits. Anyone, regardless of whether they've filed for Social Security benefits, can view their earnings record by logging into their my Social Security account. Unfortunately, none of Social Security's online calculators are designed to estimate benefits for older individuals who have already elected benefits. The Quick Calculator, which is often the simplest way to get an estimate of future benefits, will not allow for a benefit filing date that's in the past. The more detailed Online Calculator does work with a past filing date, with the caveat that it will not calculate benefits in today's dollars: It only shows the initial benefit amount without any subsequent Cost Of Living Adjustments (COLAs) since the initial filing year. Anyone using SSA's Online Calculator will need to manually inflate the benefits shown to today's dollars using SSA's COLA rates for each year. For a more precise benefit estimate, Social Security's Detailed Calculator is available for download. Though it is decidedly less user-friendly than SSA's other calculators, it will generally provide the most robust estimate of current benefits, including all reductions and COLA calculations. However, its clunky interface means that it has a steep learning curve to set up and use efficiently. And ultimately, it's only useful as long as the person using it has all the information about the worker (and/or their spouse and children) that it needs to make the estimate. Estimating Benefits When An Earnings History Isn't Available Unfortunately, there's not always a full earnings history readily available, making it difficult to calculate an accurate Social Security benefit estimate. Not everyone has set up an online Social Security account, and even those who did may need to re-register with one of Social Security's new login providers, Login.gov or ID.me, if they created their account prior to September 2021. In these cases, the additional identity verification requirements – which require registrants to choose between a smartphone authentication app, text/voice messages, a list of backup codes, a physical security key, or a government employee ID for those who have them – could be more onerous than some Social Security recipients are willing to bother with. For those who can't (or won't) log in to their Social Security account to retrieve their full earnings history, it's still possible to estimate benefits using available information. Instead of calculating benefits from the 'bottom-up' – starting with their earnings history and calculating benefits by applying SSA's formulas – it's possible to take a 'top-down' approach by working backward from the current (reduced) benefit to determine the benefit that the individual would have been receiving without the reduction. Because of the limitations of Social Security's online calculators and the learning curve associated with Social Security's online Detailed Calculator, Covisum developed a user-friendly calculator for estimating an individual's unreduced Social Security benefits with or without an earnings history, and has made it available for download to Kitces readers for free, with no requirement to register. This calculator can help estimate Social Security retirement, spousal, and survivor benefits for individuals who have already started receiving benefits, and whose benefits were reduced by the WEP and/or GPO. For individuals who have a full earnings history available, the \"Basic Benefit Calculator\" tab allows users to estimate their retirement or spousal benefits based on their earnings history, birth year, and the age at which they elected benefits. For those without an earnings history available, the \"RIB and Spousal Calculator\" tab (for Retirement Income Benefits) and Widow Calculator (for survivor benefits) relies on information that the recipient is likely to have on hand, such as their age at the time of benefits election, their current (reduced) benefit amounts, and the spouse's information for spousal and survivor benefits. Calculations For Spousal And Survivor Benefits Reduced By GPO For spousal or survivor benefits, GPO applies if a spouse in a married couple, or a divorced spouse who was married at least ten years and whose ex-spouse qualifies for Social Security benefits, has a government pension from a non-Social Security-covered job. In these cases, GPO reduces any available spousal or survivor benefit by two-thirds of the pension amount, potentially reducing the benefit to zero. Estimating Survivor Benefits For Widowed Spouses After GPO Repeal For widowed spouses whose benefits were completely eliminated by the GPO, estimating the new benefit is relatively straightforward since the survivor benefit is primarily based on the amount the deceased was already receiving before they passed away. If the surviving spouse knows how much the deceased spouse was receiving, that amount can be adjusted for COLAs between the year of death and the current year to arrive at the current full survivor benefit. An exception applies when the deceased spouse filed for benefits prior to their Full Retirement Age (FRA) and received less than 82.5% of their own Primary Insurance Amount (PIA), and the surviving spouse claimed widow(er) benefits at a time that would result in a reduction of less than 17.5%. In this case, the minimum survivor benefit is equal to 82.5% of the deceased spouse's PIA. Example 1: Jane, an 85-year-old retired teacher, currently receives no Social Security benefit due to the GPO. Her spouse, John, was born in 1937 and passed away in 2022. John originally filed for Social Security benefits at age 64 (one year prior to his FRA of 65). As a result, his monthly Social Security benefit at the time of his death in 2022 was $2,500. Because John retired before his FRA, his benefit represented 93.33% of his PIA, above the 82.5% survivor-benefit limit. Thus, the survivor-benefit rule doesn't apply in Jane's case. To estimate Jane's current 2025 survivor benefit, John's 2022 benefit must be adjusted for Cost Of Living Adjustments (COLAs): 2023 COLA: 3.2% increase 2024 COLA: 2.5% increase The adjusted survivor benefit for 2025 will be $2,500 × 1.032 × 1.025 = $2,644 per month once GPO is fully repealed. Estimating Spousal Benefits After GPO Repeal Spousal benefits are slightly more complicated to estimate than survivor benefits because they are based on the PIA of the primary earner, not the actual benefit amount the earner receives. This means that if the primary earner's current benefit is lower than their PIA (if they filed for benefits early) or higher than their PIA (due to delayed filing), then their benefit amount needs to be adjusted back to their PIA before calculating the spousal benefit. This requires removing any actuarial reductions or delayed retirement credits included in the primary earner's current benefit amount. If the noncovered spouse files for spousal benefits at FRA or later, their benefit is 50% of the covered spouse's PIA. However, if they file early, the benefit is reduced as follows: 25/36% per month for the first 36 months before FRA; and 5/12% for each additional month prior to FRA. Example 2: Phil was born in 1945, and his wife Wanda was born in 1953. Phil filed for Social Security benefits at age 70 and is currently receiving a monthly benefit of $3,432. Wanda, who receives a noncovered pension of $3,000 per month, has never filed for spousal benefits because the GPO reduced her spousal benefit to $0. Now, at age 72, Wanda is well past her FRA, which means she is entitled to receive the full 50% of Phil's PIA. However, we don't know Phil's PIA because it is not listed on his annual Social Security statement, so it must be calculated. We know that Phil's current benefit amount is $3,423 and that he received delayed retirement credits for filing at age 70, 4 years after his FRA of 66. Thus, we can calculate his PIA by adjusting his current benefit downward by the delayed retirement credits he received. Based on Phil's year of birth, his delayed retirement credits equal 8% per year of delayed benefits, or 8% × 4 years = 32% total. This means that Phil's current PIA is $3,432 ÷ 1.32 = $2,600, and Jane's spousal benefit in 2025 would be $2,600 × 50% = $1,300 once the GPO is repealed. Estimating Benefits For Those Affected By WEP (But Not GPO) Evaluating the \"how much will I get?\" question for those who are only affected by the WEP, but not the GPO, is slightly more complicated. This situation applies to single individuals or government workers who are not eligible for a spousal or survivor benefit larger than their own benefit. To estimate an individual's full benefit based on their current (WEP-reduced) benefit, it's important to first review how the WEP-reduced benefit is calculated in the first place. At a high level, this is calculated in three steps: Step 1. Determine The Individual's Average Indexed Monthly Earnings (AIME). The individual's highest 35 years of Social Security-covered earnings are indexed for inflation and divided by 420 (the total number of months in 35 years) to calculate their AIME. Step 2. Calculate The WEP-Adjusted PIA. The individual's PIA is calculated by applying a series of multipliers to their AIME. Bend points – threshold values set annually by the Social Security Administration – determine how different portions of the individual's AIME are weighted and are based on the year the recipient first becomes eligible for benefits (i.e., age 62). Under the regular PIA formula, the multipliers are as follows: 90% of AIME up to the first 'bend point' 32% between the first and second bend points 15% for any AIME above the second bend point Under the WEP PIA formula, the 90% rate is reduced to as low as 40%, depending on the total number of years the individual had substantial earnings covered by Social Security. Step 3. Apply Adjustments For Early Or Delayed Filing. After the WEP-adjusted PIA is determined, the final WEP-reduced benefit is determined by applying any actuarial reductions (for early filing) or delayed retirement credits (for delayed filing). When starting with the current (WEP-reduced) benefit, the process is essentially reversed, meaning that the first step of the process is to 'back out' any delayed retirement credits or actuarial reductions to arrive at the current WEP-adjusted PIA, as illustrated in the example below. Example 3: Zoe, born in 1950, worked for most of her career as a teacher who was not covered by Social Security. However, during the final 10 years, she worked in administration, where she was covered by Social Security. Her FRA for Social Security was 66, but she filed for benefits one year early at age 65. As a result, her current WEP-reduced benefit is $300 per month. Since Zoe filed for benefits one year early, her current benefit was reduced to 93.3% of her WEP-adjusted PIA, meaning that her actual WEP PIA is $300 ÷ .933 = $321.54. After calculating the WEP-adjusted PIA, the next step is to determine the recipient's AIME based on their WEP PIA. This process involves reversing the 'bend point' formula used to calculate benefits. Because the WEP reduction is based on the bend points at the individual's initial eligibility age (i.e., age 62), all COLAs must be removed from the WEP-adjusted PIA from age 62 to the present year to determine the 'original' WEP-adjusted PIA. From there, we can divide the client's current benefit by the reduced bend point rate (ranging between 0.4 and 0.85, depending on the individual's years of Social Security-covered work). This calculation backs out the client's AIME, which is used to determine whether the entire benefit amount falls into the first bend point (the portion reduced by WEP) or if part of the benefit falls outside the first bend point (and is not impacted by WEP). Example 4: Zoe, from the example above, has a current WEP-adjusted PIA of $321.54. Because she first became eligible for Social Security benefits at age 62 (in 2012), we need to reduce her current benefit by all the annual COLAs since 2012, as shown below: Thus, Zoe's WEP-adjusted PIA at age 62 was $232.38. To determine her AIME, we divide her age 62 WEP-adjusted PIA by the WEP-reduced multiplier of 40%. Which means that Zoe's AIME is $232.38 ÷ 0.4 = $580.95. And because this is less than the first bend point of $767 for 2012, it represents her full AIME. Social Security calculates a new PIA each year using an iterative process based on the prior year's PIA. Since the PIA is truncated to the nearest dime annually, small rounding adjustments compound over time. As a result, while the method used in the example above provides a close estimate, actual benefit amounts may become less precise the further the client is from their initial eligibility date. After using the steps above to determine the recipient's original AIME, their full, non-WEP-reduced benefit can be determined by following the standard Social Security formula: Applying the standard Social Security multipliers (90%, 32%, and 15%) to AIME to determine the uninflated PIA in the year of initial eligibility, re-inflating that amount to today's dollars, and re-applying any reduction or increase in benefits for early or late filing. Example 5: As calculated in Example 4 above, Zoe's AIME is $580.95. To determine her unadjusted PIA, we apply the normal Social Security multiplier of 90% (since it lies under the first bend point of $767) to determine her uninflated PIA of $580.95 × 90% = $522.86. Next, we multiply her uninflated PIA by the COLA series in Example 4 above to arrive at her current PIA, which equates to $723.47. Finally, we apply the reduction percentage of 93.3% (as noted in Example 3) to the current PIA to account for Zoe's early filing, or $723.47 × .933 = $675.00 Thus, Zoe's final non-WEP-reduced benefit is $675.00 per month, which she will receive going forward. In other words, she'll have an increase of $675 − $300 = $375 per month once the Social Security Fairness Act is implemented! Notably, the most complicated situations might arise when an individual is subject to both the WEP and GPO. Since individuals eligible for both their own retirement benefit and a spousal benefit can generally only receive the higher of the two, it may be necessary to perform both sets of calculations discussed above to determine the final benefit amount. A further complication occurs when retirement and spousal benefits are claimed at different times – a situation that most commonly arises when there is an age gap between spouses. In these situations, each benefit component is independently calculated and then summed together to determine the total benefit amount. In short, these calculations can be complex and tedious – which is why we've created a calculator to help simplify the process. This tool accounts for most of the key factors involved, making it easier to arrive at a reasonable projection of benefits. Retroactive Benefits: What We Know (And Don't Know) As noted earlier, in addition to the increased benefits going forward, the Social Security Administration (SSA) will also pay retroactive benefits to compensate for any reductions due to WEP and/or GPO starting from January 2024. (Technically, these would begin with the February 2024 benefit payment since Social Security benefits are typically paid in the following month). However, given the expected delays in implementing the Social Security Fairness Act, the timeline for when these retroactive benefits will be paid out remains uncertain. Generally, the amount of the retroactive payment will equal the individual's benefit reduction due to WEP and/or GPO, multiplied by the number of months between January 2024 and the month of the retroactive payment. However, the exact amounts may depend on two unanswered questions: Will SSA Apply COLAs To Retroactive Payments? It's unclear whether SSA will apply COLAs to retroactive payments or if the retroactive benefits for 2024 will reflect the actual reductions from that year. For example, will 2024 retroactive payments be increased to account for the 2.5% COLA for 2025? And if payments are further delayed into 2026, will they include another COLA adjustment? Will Spouses Who Never Filed Be Eligible For Retroactive Benefits? We don't know whether someone who never filed for spousal benefits (because they would have been reduced to $0 by GPO) would be eligible for retroactive benefits going all the way back to January 2024 or only from the date they actually filed. Many people who have filed for retirement or spousal benefits since 2016 have been deemed to file for both sets of benefits, but that isn't the case for everyone. Individuals who would be eligible for a spousal benefit due to the repeal of GPO would be best served by filing for spousal benefits as soon as possible if they haven't done so already (or if they aren't sure whether they've been deemed to file) since benefits claimed after reaching Full Retirement Age (FRA) are generally retroactive for 6 months before the filing date (and 12 months in certain circumstances for spousal and survivor benefits). With implementation still in progress, we expect SSA to provide more guidance in the coming months. The repeal of the WEP and GPO under the Social Security Fairness Act is set to bring meaningful changes for many retirees, including higher monthly benefits and retroactive payments for past reductions dating back to January 2024. While the timeline for implementation is still unclear, those who had assumed their benefits would be reduced to zero may now be eligible to file – and doing so sooner rather than later could make a difference. At the same time, retroactive lump-sum payments could open up tax planning opportunities, giving financial advisors a chance to help clients think through the best strategy for managing increased benefits. As SSA works through the details, key questions remain, such as how retroactive benefits will be adjusted and whether some previously ineligible individuals will be able to claim back payments. While there's still uncertainty ahead, staying informed and ready to act will help those affected make the most of these long-awaited changes. Quality? Nerdy? Relevant? We really do use your feedback to shape our future content! Quality? Nerdy? Relevant? We really do use your feedback to shape our future content!",
  "image": "https://www.kitces.com/wp-content/uploads/2025/02/Social-Image-How-Social-Security-Retirement-Benefits-Are-Determined.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\n\u003ch3 id=\"executive-summary\"\u003eExecutive Summary\u003c/h3\u003e\n\u003cp\u003eWhen the Social Security Fairness Act was signed into law on January 5, 2025, it came as a relief to many recipients of state or local government pensions whose Social Security benefits had been, up until now, reduced by the Windfall Elimination Provision (WEP) for individuals claiming retirement benefits under their own name, or the Government Pension Offset (GPO) for those claiming spousal or survivor benefits under a current or former spouse\u0026#39;s name. The new law repeals both the WEP and GPO, restoring full Social Security benefits to affected individuals, retroactive to January 2024.\u003c/p\u003e\n\u003cp\u003eThe caveat, however, is that although the law is set to take effect immediately (and apply retroactively to more than a year\u0026#39;s worth of prior benefits), the Social Security Administration (SSA) has indicated that it could take a year or more to fully restore benefits due to the complexity of recalculating payments for millions of affected retirees.\u003c/p\u003e\n\u003cp\u003eWhile it may take a while for the adjustments to take place, advisors can still help their clients plan for the effect of WEP and GPO\u0026#39;s repeal by estimating how much the client will be receiving in Social Security benefits once the new law is implemented. But the challenge in making such an estimate is the fact that SSA doesn\u0026#39;t clearly show many individuals what their full benefits would be without the reduction for WEP or GPO. While future retirees can find nonreduced benefit estimates on their Social Security statements or online accounts, those already receiving benefits don\u0026#39;t have access to this information – making it necessary to find a different way to predict how much their payments will increase once the law is fully implemented.\u003c/p\u003e\n\u003cp\u003eFor individuals eager to know how much they\u0026#39;ll be receiving once their full benefits are restored, the best approach is to use their history of Social Security-covered earnings (or their spouse\u0026#39;s history, for spousal and survivor benefits) and apply the actual formulas that SSA uses to calculate benefits. However, not everyone will have access to their full earnings history, and individuals who find the Social Security website and identity verification processes to be too onerous to navigate won\u0026#39;t necessarily be able to download their history. In these cases, it\u0026#39;s still possible to \u0026#39;back out\u0026#39; an estimate of unreduced benefits using their current reduced benefit – provided they know key details like the age at which they elected benefits.\u003c/p\u003e\n\u003cp\u003eNotably, estimating benefits in this way isn\u0026#39;t a simple \u0026#39;back-of-the-envelope\u0026#39; calculation, given the complexity of the rules determining the calculation of Social Security retirement, spousal, and survivor benefits. To help with this, we\u0026#39;ve developed a downloadable calculator that simplifies the process of estimating an individual\u0026#39;s unreduced Social Security benefits, whether or not a full earnings history is available.\u003c/p\u003e\n\u003cp\u003eThe key point is that the question of \u0026#34;How much will I be getting?\u0026#34; will be top of mind for clients affected by the WEP and GPO. And given that the reduction can amount to hundreds or even thousands of dollars per month, having a reliable estimate of the impact of WEP and GPO\u0026#39;s repeal can help advisors proactively plan for the impact the new law will have on their clients\u0026#39; retirement strategies. While there\u0026#39;s still uncertainty about the actual timing of the law\u0026#39;s implementation, advisors can still add value today by helping clients understand how the repeal will shape their financial future!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" alt=\"Guest Headshots\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-200x200.png 200w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-300x300.png 300w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-150x150.png 150w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2-400x400.png 400w, https://www.kitces.com/wp-content/uploads/2023/07/Guest-Headshots-2.png 500w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"ben-henrymoreland\"\u003eBen Henry-Moreland\u003c/h3\u003e\n\u003cp\u003eTeam Kitces\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eBen Henry-Moreland is a Senior Financial Planning Nerd at \u003ca href=\"https://www.kitces.com/\" target=\"_blank\" rel=\"noopener\" data-sk=\"tooltip_parent\"\u003eKitces.com\u003c/a\u003e, where he specializes in writing and speaking on financial planning topics including tax, practice management, and technology. He also co-authors the monthly Kitces #AdvisorTech column. Drawing from his experience as a financial planner and a solo advisory firm owner, Ben is passionate about fulfilling the site’s mission of making financial advicers better and more successful.\u003c/p\u003e\n\u003cp\u003eRead more of Ben’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=3193\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\u003cp\u003e\u003cimg loading=\"lazy\" width=\"200\" height=\"200\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-200x200.jpg\" alt=\"Joe Elsasser Author Photo\" decoding=\"async\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-400x400.jpg 400w\" sizes=\"auto, (max-width: 200px) 100vw, 200px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-200x200.jpg\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-200x200.jpg 200w, https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-150x150.jpg 150w, https://www.kitces.com/wp-content/uploads/2025/02/Joe-Elsasser-Author-Photo-e1738892483677-400x400.jpg 400w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003ch3 id=\"joe-elsasser\"\u003eJoe Elsasser\u003c/h3\u003e\n\u003cp\u003eGuest Contributor\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv\u003e\n\u003cp\u003eJoe is the founder and president of Covisum®, a financial tech company focused on creating software that improves lives through better financial decisions. Covisum helps financial advisors serving mass-affluent clients in or near retirement and powers some of the nation’s largest financial planning institutions. Joe is also a practicing advisor through his own planning firm, Adaptive Advice, LLC in Omaha, NE. He co-authored Social Security Essentials, Smart Ways to help Boost Your Retirement Income, and is a frequent contributor to a variety of industry and news publications.\u003c/p\u003e\n\u003cp\u003eRead more of Joe’s articles \u003ca href=\"https://www.kitces.com/?s=\u0026amp;s=\u0026amp;by-author=5152\u0026amp;by-category=\u0026amp;from-date=\u0026amp;to-date=\u0026amp;submit=\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e+ Read More +\u003c/p\u003e\n\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eFor decades, individuals who worked in state, local, or certain foreign government jobs where they did not pay Social Security taxes on their earnings were subject to reduced Social Security benefits under the \u003ca href=\"https://www.kitces.com/blog/navigating-social-securitys-windfall-elimination-provision-wep-with-a-non-covered-government-pension/\"\u003eWindfall Elimination Provision (WEP)\u003c/a\u003e and \u003ca href=\"https://www.kitces.com/blog/government-pension-offset-gpo-social-security-non-covered-pension-spousal-survivor-benefits/\"\u003eGovernment Pension Offset (GPO)\u003c/a\u003e rules. These provisions affected \u003ca href=\"https://crsreports.congress.gov/product/pdf/IN/IN12451\"\u003eapproximately 2.8 million retirees\u003c/a\u003e, which largely included former state or municipal employees like teachers, police officers, and firefighters, by reducing the amount of Social Security benefits they could receive under their own earnings record (in the case of WEP) or their spouse\u0026#39;s record (in the case of GPO) if they also received pension payments from those jobs.\u003c/p\u003e\n\u003cp\u003eThe impact of WEP and GPO varied greatly from one individual to the next. For those with relatively small noncovered pensions or shorter, part-time careers in noncovered employment (though still long enough to qualify for a pension), the total reduction might have been only a few hundred dollars per year. But for others, the effect was much greater.\u003c/p\u003e\n\u003cp\u003eFor instance, because GPO reduced an individual\u0026#39;s Social Security spousal or survivor benefits by up to two-thirds of their noncovered pension payments, a person with a $3,000/month pension would have their benefits reduced by 2/3 × $3,000 = $2,000. In many cases, this was more than the spousal or survivor benefit they would have been owed in the first place.\u003c/p\u003e\n\u003cp\u003eThe rationale behind WEP and GPO was to prevent noncovered government workers from receiving disproportionately higher total retirement benefits. Because \u003ca href=\"https://www.kitces.com/blog/social-security-and-working-how-adding-to-social-security-work-history-can-increase-retirement-benefit/\"\u003ethe calculations for Social Security benefits\u003c/a\u003e aim to be more generous to workers with lower average career earnings, non-Social-Security-covered workers appeared – at least on paper – as low earners (since their noncovered earnings were disregarded in the calculation). This resulted in disproportionately higher Social Security benefits than those received by workers who made the same amount of total income, but had paid into the Social Security system throughout their careers.\u003c/p\u003e\n\u003cp\u003eIn practice, however, the WEP and GPO provisions were confusing to navigate and difficult to plan for. Many of the people affected viewed them as an unfair reduction of the Social Security benefits that they – or their spouse – had earned through years of work and contributions.\u003c/p\u003e\n\u003cp\u003eTo address these challenges, \u003ca href=\"https://www.kitces.com/blog/social-security-fairness-act-windfall-elimination-provision-government-pension-offset-spousal-benefits-government-pension-wep-gpo-repeal-retirement-latest-industry-news/\"\u003ein late 2024, Congress passed the Social Security Fairness Act\u003c/a\u003e, which repealed both the WEP and GPO and immediately restored full Social Security benefits for current and future recipients who also receive pensions from noncovered employment. Furthermore, the new law is retroactive to payments payable on and after January 1, 2024, meaning that those whose benefits were reduced by WEP or GPO after that date will receive retroactive payments to make up for the reductions.\u003c/p\u003e\n\u003cp\u003eThe caveat, however, is that despite the Social Security Fairness Act technically taking effect immediately (and being retroactive to the beginning of 2024), it could take several months to over a year for affected recipients to see their WEP- and GPO-reduced benefits restored to their full amounts. On \u003ca href=\"https://www.ssa.gov/benefits/retirement/social-security-fairness-act.html\"\u003ethe Social Security Administration (SSA) website regarding the Social Security Fairness Act\u003c/a\u003e (last updated on February 3rd at the time of this writing), SSA states that it could take more than a year to fully adjust benefits and issue retroactive payments. And with SSA currently in a hiring freeze, and the Trump administration aiming to further downsize the Federal workforce, it\u0026#39;s conceivable that implementing the new law\u0026#39;s changes could take even longer.\u003c/p\u003e\n\n\u003cp\u003eFor many individuals whose benefits were previously reduced by WEP and GPO, the big question now is: \u0026#34;How much more will I get?\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe simple answer is that, once SSA is able to implement the Social Security Act\u0026#39;s changes, they\u0026#39;ll receive their full, unreduced benefit going forward.\u003c/p\u003e\n\u003cp\u003eWhat isn\u0026#39;t so simple, however, is determining exactly what that unreduced benefit will \u003cem\u003ebe\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eEven without WEP and GPO, \u003ca href=\"https://www.kitces.com/blog/social-security-and-working-how-adding-to-social-security-work-history-can-increase-retirement-benefit/\"\u003ethe calculation of Social Security benefits is complex\u003c/a\u003e. First, SSA \u003ca href=\"https://www.ssa.gov/oact/cola/piaformula.html\"\u003euses an individual\u0026#39;s career earnings to calculate their Primary Insurance Amount (PIA)\u003c/a\u003e, which is the monthly benefit they would receive based on their own earnings record if they were to apply to receive benefits at their Full Retirement Age (FRA). From that base PIA number, further adjustments are made in the form of \u003ca href=\"https://www.ssa.gov/oact/quickcalc/early_late.html\"\u003ebenefit reductions for filing before their FRA or increases for delaying beyond FRA up to age 70\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Estimating Surviving Spouses Survivor Benefits\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits.png\" alt=\"Estimating Surviving Spouses Survivor Benefits\" width=\"3125\" height=\"1367\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-300x131.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-1024x448.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-768x336.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-1536x672.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-2048x896.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-2000x875.png 2000w\" sizes=\"auto, (max-width: 3125px) 100vw, 3125px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-300x131.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-1024x448.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-768x336.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-1536x672.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-2048x896.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/01-Estimating-Surviving-Spouses-Survivor-Benefits-2000x875.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFor spouses, the base spousal benefit is 50% of the working spouse\u0026#39;s PIA, but that number can be reduced if the spouse files for spousal benefits prior to their own FRA (unless they have a child in their care who is under age 16 or disabled).\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Estimating Surviving Spouses Survivor Benefits\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits.png\" alt=\"Estimating Surviving Spouses Survivor Benefits\" width=\"3125\" height=\"1224\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-300x118.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-1024x401.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-768x301.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-1536x602.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-2048x802.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-2000x783.png 2000w\" sizes=\"auto, (max-width: 3125px) 100vw, 3125px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-300x118.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-1024x401.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-768x301.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-1536x602.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-2048x802.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/02-Estimating-Surviving-Spouses-Survivor-Benefits-2000x783.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eFor widows and widowers of deceased earners, the benefit calculation gets even more complex because the calculation changes depending on whether the (deceased) working spouse, the surviving spouse, both spouses, or neither filed for benefits after their FRA.\u003c/p\u003e\n\u003cp\u003eIf the deceased spouse filed for retirement benefits after reaching FRA, and the surviving spouse filed for survivor benefits after reaching their own FRA, the base benefit is simply the deceased earner\u0026#39;s PIA, plus any delayed retirement credits they had earned.\u003c/p\u003e\n\u003cp\u003eIf the deceased spouse had filed for retirement benefits before FRA and was receiving a reduced benefit at the time of their passing, the survivor benefit is reduced as well. In this case, if the surviving spouse files for survivor benefits after reaching their own FRA, the maximum reduction is 17.5%, meaning that the minimum survivor benefit is 1 − 17.5% = 82.5% of the deceased spouse\u0026#39;s PIA.\u003c/p\u003e\n\u003cp\u003eIn the opposite scenario – where the deceased spouse had filed for retirement benefits after FRA but the surviving spouse files for benefits before FRA – the surviving spouse\u0026#39;s benefit is reduced by up to 28.5% of the working spouse\u0026#39;s PIA if the surviving spouse files for survivor benefits at age 60, the earliest possible filing age for survivors.\u003c/p\u003e\n\u003cp\u003eAnd when the working spouse filed for retirement benefits before reaching their FRA, \u003cem\u003eand\u003c/em\u003e the surviving spouse filed for benefits before their own FRA, they need to use both of the two calculations above and take the lowest result to determine their spousal benefit.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"How Social Security Survivor Benefits Are Determined\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined.png\" alt=\"How Social Security Survivor Benefits Are Determined\" width=\"2811\" height=\"2275\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined.png 2811w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-300x243.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-1024x829.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-768x622.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-1536x1243.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-2048x1657.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-2000x1619.png 2000w\" sizes=\"auto, (max-width: 2811px) 100vw, 2811px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined.png 2811w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-300x243.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-1024x829.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-768x622.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-1536x1243.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-2048x1657.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/02-1-How-Social-Security-Survivor-Benefits-Are-Determined-2000x1619.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e For surviving spouses born before 1962, the FRA for determining survivor benefits may be different from the FRA used for retirement benefits. The surviving spouse uses the FRA for the year two years prior to their birth year on \u003ca href=\"https://www.ssa.gov/benefits/retirement/planner/agereduction.html\"\u003ethe standard FRA table\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor instance, a person born in 1960 with an FRA of 67 for their own retirement benefits would have an FRA of 66 and 8 months for survivor benefits (i.e., the FRA for a person born in 1958).\u003c/p\u003e\n\u003c/div\u003e\n\t\t\n\u003cp\u003eIn other words, calculating an individual\u0026#39;s Social Security benefit isn\u0026#39;t straightforward because it depends on multiple factors. These include their own or their spouse\u0026#39;s PIA, their (or their spouse\u0026#39;s) FRA, the age at which they (or their spouse) applied for benefits, their earned income (if they\u0026#39;re under their FRA), and, in the case of survivor benefits, when the original earner died.\u003c/p\u003e\n\u003cp\u003eBecause of these many variables, accurately determining the benefit amount often requires specialized calculation tools that can incorporate all the relevant information to produce an accurate benefit estimate.\u003c/p\u003e\n\n\u003cp\u003eOne of the ironic plot twists in the aftermath of the Social Security Fairness Act is that it\u0026#39;s much easier to estimate the effects of the repeal of the WEP and GPO for individuals who have \u003cem\u003enot\u003c/em\u003e yet filed for benefits than it is for those who are already receiving benefits.\u003c/p\u003e\n\u003cp\u003eEvery individual who has yet to apply for Social Security benefits receives an annual \u003ca href=\"https://www.ssa.gov/myaccount/statement.html\"\u003eSocial Security statement\u003c/a\u003e, either in the mail or (for those who have signed up) electronically via their \u003ca href=\"https://www.ssa.gov/myaccount/?gad_source=1\u0026amp;gclid=Cj0KCQiAy8K8BhCZARIsAKJ8sfQ8ycxA68-on7ceEVydI0TTyc8lPi5fmTfEOTXWXe2s4QwCJTBHvK8aAuIvEALw_wcB\"\u003e\u003cem\u003emy\u003c/em\u003e Social Security account\u003c/a\u003e. The statement lists their estimated monthly retirement benefit, in today\u0026#39;s dollars, for each filing age from age 62 (the earliest year of eligibility) to age 70 (the highest age at which an individual can continue to receive delayed retirement credits to increase their benefit). Those amounts are \u003cem\u003enot\u003c/em\u003e reduced for WEP, and so the amount listed on the statement is simply the amount that the individual can expect to receive as their own benefit at any given age.\u003c/p\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e For the purposes of the Social Security statement, SSA assumes that an individual\u0026#39;s future earnings will remain consistent with their most recent year\u0026#39;s earnings until they file for benefits. For a more precise estimate of future benefits, individuals can use their actual Social Security-covered earnings history, which is available by logging into their \u003cem\u003emy\u003c/em\u003e Social Security account under \u0026#34;Earnings History\u0026#34; (previously found on Page 2 of the statement).\u003c/p\u003e\n\u003cp\u003eThis earnings record can be entered into \u003ca href=\"https://www.ssa.gov/benefits/retirement/planner/AnypiaApplet.html\"\u003eSSA\u0026#39;s Online Benefits Calculator\u003c/a\u003e, along with the individual\u0026#39;s current-year earnings and an estimate of their average future earnings until filing. Alternatively, a version of this calculator that automatically incorporates the individual\u0026#39;s earnings history is available for those who log into their \u003cem\u003emy\u003c/em\u003e Social Security account.\u003c/p\u003e\n\u003c/div\u003e\n\t\t\n\u003cp\u003eFor spousal benefits, the standard benefit amount is 50% of the working spouse\u0026#39;s Primary Insurance Amount (PIA) – the monthly benefit the worker would receive if claimed at their Full Retirement Age (FRA). While the Social Security statement doesn\u0026#39;t explicitly state the PIA, it can be inferred from the worker\u0026#39;s \u003ca href=\"https://www.ssa.gov/benefits/retirement/planner/agereduction.html\"\u003eFRA benefit amount\u003c/a\u003e. Spouses who plan to apply for spousal benefits prior to their own FRA, which reduces their benefit below the standard 50%, can use \u003ca href=\"https://www.ssa.gov/OACT/quickcalc/spouse.html\"\u003eSocial Security\u0026#39;s spousal benefit calculator\u003c/a\u003e to find the correct percentage of the worker\u0026#39;s PIA to use for their estimated spousal benefit.\u003c/p\u003e\n\u003cp\u003eFor widowed spouses who haven\u0026#39;t yet filed for survivor benefits, it can be harder to track down the necessary information about the original (deceased) worker\u0026#39;s benefits. The survivor benefit is based on either:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe actual amount the deceased spouse had been receiving (if they had already started receiving benefits); or\u003c/li\u003e\n\u003cli\u003eThe amount they \u003cem\u003ewould have\u003c/em\u003e been eligible to receive (if they hadn\u0026#39;t yet applied).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo estimate their potential survivor benefit, the surviving spouse would need to find records of the deceased spouse\u0026#39;s Social Security payments before they passed away or obtain a copy of their earnings history.\u003c/p\u003e\n\n\u003cp\u003eUnlike those who have not yet filed for benefits, \u003cem\u003ecurrent\u003c/em\u003e Social Security recipients who have had their benefits reduced by the WEP or GPO may have a much harder time finding an accurate estimate of what their \u0026#39;full\u0026#39; benefit will be once the Social Security Fairness Act is fully implemented.\u003c/p\u003e\n\u003cp\u003eOnce an individual begins receiving Social Security benefits, they no longer receive an annual Social Security statement or future benefit estimates. Which makes sense on one level, since once benefits begin, they generally don\u0026#39;t change, and there\u0026#39;s no longer a need for an estimate of future benefits for someone who has already begun receiving them. However, for someone whose benefits \u003cem\u003eare \u003c/em\u003eexpected to change – such as individuals whose current WEP- or GPO-reduced benefits will be restored to their full amounts – there\u0026#39;s no readily available estimate of their nonreduced benefit that can be pulled from the Social Security statement or online account.\u003c/p\u003e\n\u003cp\u003eIn these cases, when an individual may have elected benefits years or even decades ago and may have little information about what their original \u0026#39;full\u0026#39; benefit would have been, it may be necessary to calculate their benefit based on whatever information \u003cem\u003eis\u003c/em\u003e available today.\u003c/p\u003e\n\u003ch3 data-nav-title=\"Estimating Using Earnings History\" id=\"estimating-benefits-using-an-earnings-history\"\u003eEstimating Benefits Using An Earnings History\u003c/h3\u003e\n\u003cp\u003eThe simplest way to calculate an estimate of an individual\u0026#39;s Social Security retirement benefits is to follow \u003ca href=\"https://www.ssa.gov/oact/cola/Benefits.html\"\u003ethe same process used by SSA\u003c/a\u003e:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eReview the full yearly earnings history;\u003c/li\u003e\n\u003cli\u003eCalculate the Primary Insurance Amount (PIA);\u003c/li\u003e\n\u003cli\u003eApply any increases or decreases for early and delayed filing; and\u003c/li\u003e\n\u003cli\u003eFactor in any spousal or survivor benefits.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eAnyone, regardless of whether they\u0026#39;ve filed for Social Security benefits, can view their earnings record by logging into their \u003ca href=\"https://www.ssa.gov/myaccount/?gad_source=1\u0026amp;gclid=Cj0KCQiAy8K8BhCZARIsAKJ8sfQ8ycxA68-on7ceEVydI0TTyc8lPi5fmTfEOTXWXe2s4QwCJTBHvK8aAuIvEALw_wcB\"\u003e\u003cem\u003emy\u003c/em\u003e Social Security account\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eUnfortunately, none of \u003ca href=\"https://www.ssa.gov/benefits/calculators/\"\u003eSocial Security\u0026#39;s online calculators\u003c/a\u003e are designed to estimate benefits for older individuals who have already elected benefits. The \u003ca href=\"https://www.ssa.gov/OACT/quickcalc/spouse.html\"\u003eQuick Calculator\u003c/a\u003e, which is often the simplest way to get an estimate of future benefits, will not allow for a benefit filing date that\u0026#39;s in the past. The more detailed \u003ca href=\"https://www.ssa.gov/benefits/retirement/planner/AnypiaApplet.html\"\u003eOnline Calculator\u003c/a\u003e does work with a past filing date, with the caveat that it will not calculate benefits in today\u0026#39;s dollars: It only shows the initial benefit amount without any subsequent Cost Of Living Adjustments (COLAs) since the initial filing year. Anyone using SSA\u0026#39;s Online Calculator will need to manually inflate the benefits shown to today\u0026#39;s dollars using \u003ca href=\"https://www.ssa.gov/oact/cola/colaseries.html\"\u003eSSA\u0026#39;s COLA rates\u003c/a\u003e for each year.\u003c/p\u003e\n\u003cp\u003eFor a more precise benefit estimate, \u003ca href=\"https://www.ssa.gov/OACT/anypia/anypia.html\"\u003eSocial Security\u0026#39;s Detailed Calculator\u003c/a\u003e is available for download. Though it is decidedly less user-friendly than SSA\u0026#39;s other calculators, it will generally provide the most robust estimate of current benefits, including all reductions and COLA calculations. However, its clunky interface means that it has a steep learning curve to set up and use efficiently. And ultimately, it\u0026#39;s only useful as long as the person using it has all the information about the worker (and/or their spouse and children) that it needs to make the estimate.\u003c/p\u003e\n\u003ch3 data-nav-title=\"When Earnings History Isn’t Available\" id=\"estimating-benefits-when-an-earnings-history-isnt-available\"\u003eEstimating Benefits When An Earnings History Isn\u0026#39;t Available\u003c/h3\u003e\n\u003cp\u003eUnfortunately, there\u0026#39;s not always a full earnings history readily available, making it difficult to calculate an accurate Social Security benefit estimate. Not everyone has set up \u003ca href=\"https://www.ssa.gov/myaccount/create.html\"\u003ean online Social Security account\u003c/a\u003e, and even those who did may need to \u003ca href=\"https://www.youtube.com/watch?v=AMADyonYNTE\"\u003ere-register with one of Social Security\u0026#39;s new login providers, Login.gov or ID.me\u003c/a\u003e, if they created their account prior to September 2021.\u003c/p\u003e\n\u003cp\u003eIn these cases, the additional identity verification requirements – which require registrants to choose between a smartphone authentication app, text/voice messages, a list of backup codes, a physical security key, or a government employee ID for those who have them – could be more onerous than some Social Security recipients are willing to bother with.\u003c/p\u003e\n\u003cp\u003eFor those who can\u0026#39;t (or won\u0026#39;t) log in to their Social Security account to retrieve their full earnings history, it\u0026#39;s still possible to estimate benefits using available information. Instead of calculating benefits from the \u0026#39;bottom-up\u0026#39; – starting with their earnings history and calculating benefits by applying SSA\u0026#39;s formulas – it\u0026#39;s possible to take a \u0026#39;top-down\u0026#39; approach by working backward from the current (reduced) benefit to determine the benefit that the individual would have been receiving \u003cem\u003ewithout\u003c/em\u003e the reduction.\u003c/p\u003e\n\u003cp\u003eBecause of the limitations of Social Security\u0026#39;s online calculators and the learning curve associated with Social Security\u0026#39;s online Detailed Calculator, \u003ca href=\"https://www.covisum.com/\"\u003eCovisum\u003c/a\u003e developed \u003ca href=\"https://www.covisum.com/kitces-ssfa\"\u003ea user-friendly calculator for estimating an individual\u0026#39;s unreduced Social Security benefits with or without an earnings history\u003c/a\u003e, and has made it available for download to Kitces readers for free, with no requirement to register. This calculator can help estimate Social Security retirement, spousal, and survivor benefits for individuals who have already started receiving benefits, and whose benefits were reduced by the WEP and/or GPO.\u003c/p\u003e\n\u003cp\u003eFor individuals who have a full earnings history available, the \u0026#34;Basic Benefit Calculator\u0026#34; tab allows users to estimate their retirement or spousal benefits based on their earnings history, birth year, and the age at which they elected benefits.\u003c/p\u003e\n\u003cp\u003eFor those without an earnings history available, the \u0026#34;RIB and Spousal Calculator\u0026#34; tab (for Retirement Income Benefits) and Widow Calculator (for survivor benefits) relies on information that the recipient is likely to have on hand, such as their age at the time of benefits election, their current (reduced) benefit amounts, and the spouse\u0026#39;s information for spousal and survivor benefits.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.covisum.com/kitces-ssfa\" target=\"_blank\" rel=\"noopener\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"Social Security Benefits Estimator For WEP And GPO Repeal\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal.png\" alt=\"Social Security Benefits Estimator For WEP And GPO Repeal\" width=\"3125\" height=\"2359\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-300x226.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-1024x773.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-768x580.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-1536x1159.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-2048x1546.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-2000x1510.png 2000w\" sizes=\"auto, (max-width: 3125px) 100vw, 3125px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal.png 3125w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-300x226.png 300w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-1024x773.png 1024w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-768x580.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-1536x1159.png 1536w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-2048x1546.png 2048w, https://www.kitces.com/wp-content/uploads/2025/02/03-Social-Security-Benefits-Estimator-For-WEP-And-GPO-Repeal-2000x1510.png 2000w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003ch3 data-nav-title=\"Spousal \u0026amp; Survivor Benefits Calculations\" id=\"calculations-for-spousal-and-survivor-benefits-reduced-by-gpo\"\u003eCalculations For Spousal And Survivor Benefits Reduced By GPO\u003c/h3\u003e\n\u003cp\u003eFor spousal or survivor benefits, GPO applies if a spouse in a married couple, or a divorced spouse who was married at least ten years and whose ex-spouse qualifies for Social Security benefits, has a government pension from a non-Social Security-covered job. In these cases, GPO reduces any available spousal or survivor benefit by two-thirds of the pension amount, potentially reducing the benefit to zero.\u003c/p\u003e\n\u003ch4 id=\"estimating-survivor-benefits-for-widowed-spouses-after-gpo-repeal\"\u003eEstimating Survivor Benefits For Widowed Spouses After GPO Repeal\u003c/h4\u003e\n\u003cp\u003eFor widowed spouses whose benefits were completely eliminated by the GPO, estimating the new benefit is relatively straightforward since the survivor benefit is primarily based on the amount the deceased was already receiving before they passed away. If the surviving spouse knows how much the deceased spouse was receiving, that amount can be adjusted for COLAs between the year of death and the current year to arrive at the current full survivor benefit.\u003c/p\u003e\n\u003cp\u003eAn exception applies when the deceased spouse filed for benefits prior to their Full Retirement Age (FRA) and received less than 82.5% of their own Primary Insurance Amount (PIA), and the surviving spouse claimed widow(er) benefits at a time that would result in a reduction of less than 17.5%. In this case, the minimum survivor benefit is equal to 82.5% of the deceased spouse\u0026#39;s PIA.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eExample 1:\u003c/strong\u003e Jane, an 85-year-old retired teacher, currently receives no Social Security benefit due to the GPO. Her spouse, John, was born in 1937 and passed away in 2022.\u003c/p\u003e\n\u003cp\u003eJohn originally filed for Social Security benefits at age 64 (one year prior to his FRA of 65). As a result, his monthly Social Security benefit at the time of his death in 2022 was $2,500. Because John retired before his FRA, his benefit represented 93.33% of his PIA, above the 82.5% survivor-benefit limit. Thus, the survivor-benefit rule doesn\u0026#39;t apply in Jane\u0026#39;s case.\u003c/p\u003e\n\u003cp\u003eTo estimate Jane\u0026#39;s current 2025 survivor benefit, John\u0026#39;s 2022 benefit must be adjusted for \u003ca href=\"https://www.ssa.gov/oact/cola/colaseries.html\"\u003eCost Of Living Adjustments (COLAs)\u003c/a\u003e:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2023 COLA: 3.2% increase\u003c/li\u003e\n\u003cli\u003e2024 COLA: 2.5% increase\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe adjusted survivor benefit for 2025 will be $2,500 × 1.032 × 1.025 = $2,644 per month once GPO is fully repealed.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch4 id=\"estimating-spousal-benefits-after-gpo-repeal\"\u003eEstimating Spousal Benefits After GPO Repeal\u003c/h4\u003e\n\u003cp\u003eSpousal benefits are slightly more complicated to estimate than survivor benefits because they are based on the PIA of the primary earner, not the actual benefit amount the earner receives. This means that if the primary earner\u0026#39;s current benefit is lower than their PIA (if they filed for benefits early) or higher than their PIA (due to delayed filing), then their benefit amount needs to be adjusted back to their PIA before calculating the spousal benefit. This requires removing any actuarial reductions or delayed retirement credits included in the primary earner\u0026#39;s current benefit amount.\u003c/p\u003e\n\u003cp\u003eIf the noncovered spouse files for spousal benefits at FRA or later, their benefit is 50% of the covered spouse\u0026#39;s PIA. However, if they file early, the benefit is reduced as follows:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e25/36% per month for the first 36 months before FRA; and\u003c/li\u003e\n\u003cli\u003e5/12% for each additional month prior to FRA.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eExample 2: \u003c/strong\u003ePhil was born in 1945, and his wife Wanda was born in 1953. Phil filed for Social Security benefits at age 70 and is currently receiving a monthly benefit of $3,432.\u003c/p\u003e\n\u003cp\u003eWanda, who receives a noncovered pension of $3,000 per month, has never filed for spousal benefits because the GPO reduced her spousal benefit to $0.\u003c/p\u003e\n\u003cp\u003eNow, at age 72, Wanda is well past her FRA, which means she is entitled to receive the full 50% of Phil\u0026#39;s PIA. However, we don\u0026#39;t know Phil\u0026#39;s PIA because it is not listed on his annual Social Security statement, so it must be calculated.\u003c/p\u003e\n\u003cp\u003eWe know that Phil\u0026#39;s current benefit amount is $3,423 and that he received delayed retirement credits for filing at age 70, 4 years after his FRA of 66. Thus, we can calculate his PIA by adjusting his current benefit downward by the delayed retirement credits he received.\u003c/p\u003e\n\u003cp\u003eBased on Phil\u0026#39;s year of birth, his delayed retirement credits equal 8% per year of delayed benefits, or 8% × 4 years = 32% total.\u003c/p\u003e\n\u003cp\u003eThis means that Phil\u0026#39;s current PIA is $3,432 ÷ 1.32 = $2,600, and Jane\u0026#39;s spousal benefit in 2025 would be $2,600 × 50% = $1,300 once the GPO is repealed.\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch3 data-nav-title=\"Those Affected By WEP (But Not GPO)\" id=\"estimating-benefits-for-those-affected-by-wep-but-not-gpo\"\u003eEstimating Benefits For Those Affected By WEP (But Not GPO)\u003c/h3\u003e\n\u003cp\u003eEvaluating the \u0026#34;how much will I get?\u0026#34; question for those who are only affected by the WEP, but not the GPO, is slightly more complicated. This situation applies to single individuals or government workers who are not eligible for a spousal or survivor benefit larger than their own benefit.\u003c/p\u003e\n\u003cp\u003eTo estimate an individual\u0026#39;s full benefit based on their current (WEP-reduced) benefit, it\u0026#39;s important to first review how the WEP-reduced benefit is calculated in the first place. At a high level, this is calculated in three steps:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStep 1. Determine The Individual\u0026#39;s Average Indexed Monthly Earnings (AIME).\u003c/strong\u003e The individual\u0026#39;s highest 35 years of Social Security-covered earnings are indexed for inflation and divided by 420 (the total number of months in 35 years) to calculate their AIME.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStep 2. Calculate The WEP-Adjusted PIA. \u003c/strong\u003eThe individual\u0026#39;s PIA is calculated by applying a series of multipliers to their AIME. \u003ca href=\"https://www.ssa.gov/oact/cola/bendpoints.html\"\u003eBend points – threshold values set annually by the Social Security Administration – determine how different portions of the individual\u0026#39;s AIME are weighted and are based on the year the recipient first becomes eligible for benefits (i.e., age 62)\u003c/a\u003e.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnder the regular PIA formula, the multipliers are as follows:\n\u003cul\u003e\n\u003cli\u003e90% of AIME up to the first \u0026#39;bend point\u0026#39;\u003c/li\u003e\n\u003cli\u003e32% between the first and second bend points\u003c/li\u003e\n\u003cli\u003e15% for any AIME above the second bend point\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eUnder the WEP PIA formula, the 90% rate is reduced to as low as 40%, depending on the total number of years the individual had substantial earnings covered by Social Security.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eStep 3. Apply Adjustments For Early Or Delayed Filing. \u003c/strong\u003eAfter the WEP-adjusted PIA is determined, the final WEP-reduced benefit is determined by applying any actuarial reductions (for early filing) or delayed retirement credits (for delayed filing).\u003c/p\u003e\n\u003cp\u003eWhen starting with the current (WEP-reduced) benefit, the process is essentially reversed, meaning that the first step of the process is to \u0026#39;back out\u0026#39; any delayed retirement credits or actuarial reductions to arrive at the current WEP-adjusted PIA, as illustrated in the example below.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eExample 3: \u003c/strong\u003eZoe, born in 1950, worked for most of her career as a teacher who was not covered by Social Security. However, during the final 10 years, she worked in administration, where she was covered by Social Security.\u003c/p\u003e\n\u003cp\u003eHer FRA for Social Security was 66, but she filed for benefits one year early at age 65. As a result, her current WEP-reduced benefit is $300 per month.\u003c/p\u003e\n\u003cp\u003eSince Zoe filed for benefits one year early, her current benefit was reduced to 93.3% of her WEP-adjusted PIA, meaning that her actual WEP PIA is $300 ÷ .933 = $321.54.\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eAfter calculating the WEP-adjusted PIA, the next step is to determine the recipient\u0026#39;s AIME based on their WEP PIA. This process involves reversing the \u0026#39;bend point\u0026#39; formula used to calculate benefits. Because the WEP reduction is based on the bend points at the individual\u0026#39;s initial eligibility age (i.e., age 62), all COLAs must be removed from the WEP-adjusted PIA from age 62 to the present year to determine the \u0026#39;original\u0026#39; WEP-adjusted PIA.\u003c/p\u003e\n\u003cp\u003eFrom there, we can divide the client\u0026#39;s current benefit by the reduced bend point rate (ranging between 0.4 and 0.85, depending on the individual\u0026#39;s years of Social Security-covered work). This calculation backs out the client\u0026#39;s AIME, which is used to determine whether the entire benefit amount falls into the first bend point (the portion reduced by WEP) or if part of the benefit falls outside the first bend point (and is not impacted by WEP).\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eExample 4: \u003c/strong\u003eZoe, from the example above, has a current WEP-adjusted PIA of $321.54.\u003c/p\u003e\n\u003cp\u003eBecause she first became eligible for Social Security benefits at age 62 (in 2012), we need to reduce her current benefit by \u003ca href=\"https://www.ssa.gov/oact/cola/colaseries.html\"\u003eall the annual COLAs since 2012\u003c/a\u003e, as shown below:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula.png\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" title=\"WEP Adjusted PIA Calculation And Formula\" src=\"https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula.png\" alt=\"WEP Adjusted PIA Calculation And Formula\" width=\"1772\" height=\"2352\" srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula.png 1772w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-226x300.png 226w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-771x1024.png 771w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-768x1019.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1157x1536.png 1157w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1543x2048.png 1543w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1507x2000.png 1507w\" sizes=\"auto, (max-width: 1772px) 100vw, 1772px\" data-src=\"https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula.png\" data-srcset=\"https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula.png 1772w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-226x300.png 226w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-771x1024.png 771w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-768x1019.png 768w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1157x1536.png 1157w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1543x2048.png 1543w, https://www.kitces.com/wp-content/uploads/2025/02/04-WEP-Adjusted-PIA-Calculation-And-Formula-1507x2000.png 1507w\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThus, Zoe\u0026#39;s WEP-adjusted PIA at age 62 was $232.38.\u003c/p\u003e\n\u003cp\u003eTo determine her AIME, we divide her age 62 WEP-adjusted PIA by the WEP-reduced multiplier of 40%. Which means that Zoe\u0026#39;s AIME is $232.38 ÷ 0.4 = $580.95. And because this is less than the \u003ca href=\"https://www.ssa.gov/oact/cola/bendpoints.html\"\u003efirst bend point of $767 for 2012\u003c/a\u003e, it represents her full AIME.\u003c/p\u003e\u003c/blockquote\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003e Social Security calculates a new PIA each year using an iterative process based on the prior year\u0026#39;s PIA. Since the PIA is truncated to the nearest dime annually, small rounding adjustments compound over time. As a result, while the method used in the example above provides a close estimate, actual benefit amounts may become less precise the further the client is from their initial eligibility date. \u003c/p\u003e\n\t\t\u003c/div\u003e\n\t\t\n\u003cp\u003eAfter using the steps above to determine the recipient\u0026#39;s original AIME, their full, non-WEP-reduced benefit can be determined by following the standard Social Security formula: Applying the standard Social Security multipliers (90%, 32%, and 15%) to AIME to determine the uninflated PIA in the year of initial eligibility, re-inflating that amount to today\u0026#39;s dollars, and re-applying any reduction or increase in benefits for early or late filing.\u003c/p\u003e\n\u003cblockquote\u003e\u003cp\u003e\u003cstrong\u003eExample 5: \u003c/strong\u003eAs calculated in Example 4 above, Zoe\u0026#39;s AIME is $580.95. To determine her unadjusted PIA, we apply the normal Social Security multiplier of 90% (since it lies under the first bend point of $767) to determine her uninflated PIA of $580.95 × 90% = $522.86.\u003c/p\u003e\n\u003cp\u003eNext, we multiply her uninflated PIA by the COLA series in Example 4 above to arrive at her current PIA, which equates to $723.47.\u003c/p\u003e\n\u003cp\u003eFinally, we apply the reduction percentage of 93.3% (as noted in Example 3) to the current PIA to account for Zoe\u0026#39;s early filing, or $723.47 × .933 = $675.00\u003c/p\u003e\n\u003cp\u003eThus, Zoe\u0026#39;s final non-WEP-reduced benefit is $675.00 per month, which she will receive going forward. In other words, she\u0026#39;ll have an increase of $675 − $300 = $375 per month once the Social Security Fairness Act is implemented!\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eNotably, the most complicated situations might arise when an individual is subject to both the WEP \u003cem\u003eand\u003c/em\u003e GPO. Since individuals eligible for both their own retirement benefit and a spousal benefit can generally only receive the higher of the two, it may be necessary to perform both sets of calculations discussed above to determine the final benefit amount.\u003c/p\u003e\n\u003cp\u003eA further complication occurs when retirement and spousal benefits are claimed at different times – a situation that most commonly arises when there is an age gap between spouses. In these situations, each benefit component is independently calculated and then summed together to determine the total benefit amount.\u003c/p\u003e\n\u003cp\u003eIn short, these calculations can be complex and tedious – which is why we\u0026#39;ve created \u003ca href=\"https://www.covisum.com/kitces-ssfa\"\u003ea calculator\u003c/a\u003e to help simplify the process. This tool accounts for most of the key factors involved, making it easier to arrive at a reasonable projection of benefits.\u003c/p\u003e\n\u003ch2 data-nav-title=\"Retroactive Benefits: What We Know \" id=\"retroactive-benefits-what-we-know-and-dont-know\"\u003eRetroactive Benefits: What We Know (And Don\u0026#39;t Know)\u003c/h2\u003e\n\u003cp\u003eAs noted earlier, in addition to the increased benefits going forward, the Social Security Administration (SSA) will also pay retroactive benefits to compensate for any reductions due to WEP and/or GPO starting from January 2024. (Technically, these would begin with the February 2024 benefit payment since Social Security benefits are typically paid in the following month).\u003c/p\u003e\n\u003cp\u003eHowever, given the expected delays in implementing the Social Security Fairness Act, the timeline for when these retroactive benefits will be paid out remains uncertain. Generally, the amount of the retroactive payment will equal the individual\u0026#39;s benefit reduction due to WEP and/or GPO, multiplied by the number of months between January 2024 and the month of the retroactive payment. However, the exact amounts may depend on two unanswered questions:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003eWill SSA Apply COLAs To Retroactive Payments? \u003c/strong\u003eIt\u0026#39;s unclear whether SSA will apply COLAs to retroactive payments or if the retroactive benefits for 2024 will reflect the actual reductions from that year. For example, will 2024 retroactive payments be increased to account for the 2.5% COLA for 2025? And if payments are further delayed into 2026, will they include another COLA adjustment?\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eWill Spouses Who Never Filed Be Eligible For Retroactive Benefits? \u003c/strong\u003eWe don\u0026#39;t know whether someone who never filed for spousal benefits (because they would have been reduced to $0 by GPO) would be eligible for retroactive benefits going all the way back to January 2024 or only from the date they actually filed. Many people who have filed for retirement or spousal benefits since 2016 have been deemed to file for both sets of benefits, but that isn\u0026#39;t the case for everyone.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eIndividuals who would be eligible for a spousal benefit due to the repeal of GPO would be best served by filing for spousal benefits as soon as possible if they haven\u0026#39;t done so already (or if they aren\u0026#39;t sure whether they\u0026#39;ve been deemed to file) since \u003ca href=\"https://www.ssa.gov/OP_Home/handbook/handbook.15/handbook-1513.html\"\u003ebenefits claimed after reaching Full Retirement Age (FRA) are generally retroactive for 6 months before the filing date (and 12 months in certain circumstances for spousal and survivor benefits)\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWith implementation still in progress, we expect SSA to provide more guidance in the coming months.\u003c/p\u003e\n\u003cp\u003eThe repeal of the WEP and GPO under the Social Security Fairness Act is set to bring meaningful changes for many retirees, including higher monthly benefits and retroactive payments for past reductions dating back to January 2024. While the timeline for implementation is still unclear, those who had assumed their benefits would be reduced to zero may now be eligible to file – and doing so sooner rather than later could make a difference. At the same time, retroactive lump-sum payments could open up tax planning opportunities, giving financial advisors a chance to help clients think through the best strategy for managing increased benefits.\u003c/p\u003e\n\u003cp\u003eAs SSA works through the details, key questions remain, such as how retroactive benefits will be adjusted and whether some previously ineligible individuals will be able to claim back payments. While there\u0026#39;s still uncertainty ahead, staying informed and ready to act will help those affected make the most of these long-awaited changes.\u003c/p\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cdiv id=\"\"\u003e\n\u003cp\u003eQuality? Nerdy? Relevant?\u003c/p\u003e\n\u003cp\u003eWe really do use your feedback to shape our future content!\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"#\" rel=\"nofollow\" onclick=\"if (!window.__cfRLUnblockHandlers) return false; window.print(); pfTrackEvent(\u0026#39;“How Much More Will I Get?”: Calculating The Impact Of WEP And GPO’s Repeal On Social Security Benefits\u0026#39;); return false;\" title=\"Printer Friendly, PDF \u0026amp; Email\" data-cf-modified-d19affdf8fc03a6091a29820-=\"\"\u003e\n                    \u003cimg decoding=\"async\" src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" alt=\"Print Friendly, PDF \u0026amp; Email\" data-src=\"https://cdn.printfriendly.com/buttons/printfriendly-pdf-button.png\" data-old-src=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\"/\u003e\n                    \u003c/a\u003e\n                \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "37 min read",
  "publishedTime": "2025-02-12T07:03:34-05:00",
  "modifiedTime": "2025-02-12T17:57:06Z"
}
