{
  "id": "f7a04c84-d7bd-466b-ac70-a9580a5d5969",
  "title": "Featured Excerpt: The JFK Conspiracy by Brad Meltzer and Josh Mensch",
  "link": "https://www.thehistoryreader.com/us-history/featured-excerpt-the-jfk-conspiracy-by-brad-meltzer-and-josh-mensch/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=featured-excerpt-the-jfk-conspiracy-by-brad-meltzer-and-josh-mensch",
  "description": "by Brad Meltzer and Josh Mensch Belmont, New HampshireSeptember 1960 Richard Pavlick of Belmont, New Hampshire, really cares about flags. American flags, that is. When they’re hung, where they’re displayed, and how they’re raised and lowered. Once, he traveled to Washington, D.C., to march in front of the White House to protest how flags were Read More » The post Featured Excerpt: The JFK Conspiracy by Brad Meltzer and Josh Mensch appeared first on The History Reader.",
  "author": "Sara Eslami",
  "published": "Thu, 19 Dec 2024 16:06:07 +0000",
  "source": "https://www.thehistoryreader.com/feed/",
  "categories": [
    "Historical Figures",
    "U. S. History",
    "brad meltzer",
    "jfk",
    "John F. Kennedy",
    "josh mensch",
    "The JFK Conspiracy",
    "US history",
    "us presidents"
  ],
  "byline": "Sara Eslami",
  "length": 11503,
  "excerpt": "From the authors of The Nazi Conspiracy and The Lincoln Conspiracy comes a true story about the first assassination attempt on JFK.",
  "siteName": "The History Reader",
  "favicon": "https://www.thehistoryreader.com/wp-content/uploads/2023/03/favicon.png",
  "text": "Home /U. S. History/Featured Excerpt: The JFK... by Brad Meltzer and Josh Mensch Belmont, New HampshireSeptember 1960 New York Daily News Archive/New York Daily News via Getty ImagesRichard Pavlick of Belmont, New Hampshire, really cares about flags.American flags, that is.When they’re hung, where they’re displayed, and how they’re raised and lowered.Once, he traveled to Washington, D.C., to march in front of the White House to protest how flags were treated. And back when he worked for the post office in Boston, he wrote an angry letter to the U.S. Postmaster General complaining that they raised the flag in the South Boston station where he worked and left it up improperly overnight. Now, as a full-time resident of Belmont, Pavlick sometimes writes letters to town officials complaining about problems with how American flags are displayed.As a town, Belmont is small and ordinary, like many that dot the rural New England countryside. This area’s only claim to fame is that the author Grace Metalious, who lives in neighboring Gilmanton, based her bestselling 1956 novel Peyton Place on the small towns in the area, including Belmont. After the book was adapted into a movie, the words “Peyton Place” became shorthand for quintessential all-American towns like this.At seventy-three years old, the flag-obsessed Pavlick is a typical small-town retiree. He’s lived in Belmont for six years—and before that in nearby Laconia. Originally from Boston, he served briefly in the Army as a young man, including a short stint in World War I.He considers himself a New Englander through and through. But just as the novel Peyton Place exposed dark undercurrents just beneath the placid surface of a small town, so too Richard Pavlick’s outward normalcy conceals something darker.First, he is a man full of grievances. “A chronic complainer,” one townsperson would later say, and “he was always writing to the newspaper and complaining about something.” No question, Pavlick has strong opinions, some of them personal, some financial. He’d had property disputes with other residents and once battled with the local water company over utility rates and the addition of chemicals to the water supply. Pavlick’s strongest opinions, however, are political. At this moment, he’s intensely focused on the coming Presidential election, theKennedy vs. Nixon contest.From his days in Massachusetts and a lifetime in New England, Pavlick knows all about the influential Kennedy family.He doesn’t like them one bit.In Pavlick’s eyes, Joe Kennedy Sr. is now trying to buy or steal the election for his son with wealth and connections—and Pavlick believes no family should have such an outsize influence in politics. Back when Pavlick lived in Boston, he wrote a few angry letters to then-Senator John Kennedy, complaining about the post office pension system.Yet all it takes is a quick look into Richard Pavlick’s past, and it’s clear that there are other, more noticeable reasons for his particular loathing of the Kennedy family.In 1955, Pavlick attempted to form a veterans’ organization called the Protestant War Veterans Legion. The group, according to Pavlick’s rules, was to include “every war veteran not affiliated with the Jewish or Catholic War Veterans.” To put it in clearer terms, no Jews or Catholics allowed.Writing to several Protestant ministers, he declared, “The safety of the United States can only be preserved by controlling or eliminating those ideologies foreign to the American way of life and those who seek control of the political future of the United States.”To this day, there’s no evidence that Richard Pavlick ever belonged to the Ku Klux Klan or related organizations, but his ideas about Catholics and immigration were of a similar stripe. “Keep the United States of America free from isms—religious, racial or alien-controlled,” he wrote in another letter. In his view, America was under threat from foreign influence, so patriotic Americans like himself had a responsibility to defend it.It’s worth pointing out that Pavlick held his anti-Catholic views long before the Reverend Billy Graham and the Reverend Norman Peale got involved in the 1960 Presidential race. But their reinforcement of that prejudice, straight from the mouths of prominent Protestant leaders, only heightened and legitimized his manner of fear and prejudice.As the weeks of the campaign roll forward, Kennedy and Nixon pull neck and neck. The country is riveted—and Richard Pavlick becomes increasingly agitated.For the residents of Belmont, it won’t be long before they realize just how much darkness is hiding in their midst. “A New Frontier.”John F. Kennedy first used those words on July 15, 1960, in his acceptance speech at the Democratic National Convention in Los Angeles, California, on the night he won the party’s nomination for President.The phrase stuck, soon symbolizing everything from Kennedy’s campaign to the candidate himself.No question, Kennedy was young. Forty-two years old at the start of his campaign. If elected, he’d be the youngest President ever to hold the office. In the twentieth century, only Theodore Roosevelt, who became President back in 1901, was a similar age, and he was an outlier. Every other President was over fifty.From the start, the political class believed Kennedy’s youth would be a liability. When the Massachusetts Senator first announced his Presidential run, former President Harry Truman asked, “Senator, are you certain that you are quite ready for the country, or that the country is ready for you in the role of President . . . ? [We need] a man with the greatest possible maturity and experience.   May I urge you to be patient?”“Grow up and stop acting like a boy,” U.S. Senator and rival for the Democratic nomination Hubert Humphrey also weighed in.During the primaries, the insults kept coming. When Kennedy’s doctors made his medical records public, his Democratic primary opponent Senator Lyndon Johnson of Texas quipped that Kennedy was “lucky to receive a glowing medical report . . . from his pediatrician.” It was a solid jab, yet what none of Kennedy’s opponents understood was that, in 1960, at the start of a decade that would usher in enormous transformation, youth wasn’t a liability. In fact, his youth, confidence, and optimism were probably the defining assets of his campaign.Some of this was due to demographics.The term “teenager,” which would later become an indelible part of the American vocabulary, was still new, referring to a group that had only recently been invented. The first known popular usage of the term was in 1946, not becoming commonplace until the 1950s. In previous generations, young people generally went straight into the workforce, usually into the family business. The jump from kid to breadwinner happened fast. But in the 1940s and 1950s, as child labor was gradually outlawed, young people started going to secondary school, driving cars, and having leisure time. Most vital, in the middle class and above, they had money to spend.It almost sounds absurd now, but back then, older Americans didn’t know what to make of this new category of young Americans, mostly treating them with derision or even fear. “The abolition of child labor and the lengthening span of formal education have given us a huge leisure class of the young, with animal energies never absorbed by tasks of production,” the New York Times worried in 1957. Older Americans also became obsessed with dangers like “juvenile delinquency,” a condition that often boiled down simply to youngpeople not respecting or agreeing with their parents.Needless to say, the youth revolution caused sweeping changes in the culture, especially in entertainment and the arts.In music, pioneering Black artists Little Richard, Chuck Berry, Bo Diddley, and others melded the traditional Black music form the blues with up-tempo rhythms to create a new musical form—rock ’n’ roll—that would send those teenage “animal energies” into overdrive.White artists such as Elvis Presley and Buddy Holly added elements of country and pop music to make the sound more mainstream— turning teen-oriented music into a cultural and commercial juggernaut. For all the hand-wringing that grown-ups did about this new teenage explosion in society, they often ignored a key aspect of the group.Namely, that this new generation of young people, coming of age in the 1940s and 1950s, was the most educated generation in history.In 1920, only 30 percent of teenagers were in high school. By 1936, the percentage had doubled. Since then, the numbers climbed every year.Accompanying this education came an independent spirit . . . and a profound sense of idealism.Young people were the ones who led the way in the defining domestic issue of the day: the Civil Rights Movement. Young Black leaders, many of them still high school and college students, had emerged all over the South, forming organizations to fight the injustice of forced segregation, voting discrimination, and other forms of inequality codified by “Jim Crow” laws in southern states.In 1955, fifteen-year-old Claudette Colvin of Montgomery, Alabama, refused to give up her seat and stand in the whites-only section of a public bus. Police dragged her off and arrested her, sparking a lawsuit.Nine months later, activist Rosa Parks was famously inspired to do the same, which led to the Montgomery bus boycott.At lunch counter sit-ins, nonviolent demonstrations, and protest marches, teenagers and other young people often led the way.More than previous generations, young white Americans were ready to join the struggle for civil rights, often diverging from their own parents. White college students especially were ready to put their hearts—and in a few cases their lives—on the line to join the fight.And a fight it was. The push for Black integration and equality was met with overwhelming force and brutality. Southern governments and law enforcement responded to the movement with shocking violence, using every tool of the state to brutalize, arrest, and imprison protesters.Southern law enforcement often coordinated directly with the Ku Klux Klan and similar white vigilante groups. If there was a sit-in or march, gangs of KKK members would arrive at a designated time, armed with baseball bats and axe handles. Sure, the police were there, but they’d stand back and watch the white foot soldiers beat on nonviolent protesters. Then, the police would arrest the bloodied victims.In the late 1950s, as the battle over civil rights intensified and the images became increasingly violent, America was approaching a crossroads.What kind of country did we want to be?John F. Kennedy, the handsome and young-looking forty-three- year-old, had an idea.Lucky for him, these educated, idealistic, rock-’n’-rolling teenagers who came of age during the 1950s were listening. BRAD MELTZER is the #1 New York Times bestselling author of The Lightning Rod, The Escape Artist, and over ten other bestselling thrillers, as well as the Ordinary People Change the World series. He is also the host of the History Channel TV shows Brad Meltzer’s Decoded and Brad Meltzer’s Lost History, which he used to help find the missing 9/11 flag that the firefighters raised at Ground Zero.",
  "image": "https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-id=\"c630d6c\" data-element_type=\"section\" data-settings=\"{\u0026#34;background_background\u0026#34;:\u0026#34;classic\u0026#34;}\" data-elementor-type=\"single-post\" data-elementor-id=\"8005\" data-elementor-post-type=\"elementor_library\"\u003e\n\t\t\t\t\t\t\u003cdiv data-id=\"795197b\" data-element_type=\"widget\" data-widget_type=\"shortcode.default\"\u003e\n\n\t\t\t\t\t\n\t\t\t\t\t\u003col itemscope=\"\" itemtype=\"https://schema.org/BreadcrumbList\"\u003e\n\t\t\t\t\t\t            \u003cli itemprop=\"itemListElement\" itemscope=\"\" itemtype=\"https://schema.org/ListItem\"\u003e\n                \u003cspan itemprop=\"name\"\u003e\n                    \n                    \u003ca itemprop=\"item\" href=\"https://www.thehistoryreader.com\"\u003e\n                    \n                                                    Home                    \u003c/a\u003e\n                \u003c/span\u003e\n                \u003cmeta itemprop=\"position\" content=\"1\"/\u003e\n             \u003c/li\u003e\u003cli\u003e\u003cspan\u003e/\u003c/span\u003e\u003c/li\u003e\u003cli itemprop=\"itemListElement\" itemscope=\"\" itemtype=\"https://schema.org/ListItem\"\u003e\u003cspan itemprop=\"name\" title=\"Category Name\"\u003e\u003ca itemprop=\"item\" id=\"6\" href=\"https://www.thehistoryreader.com/category/us-history/\"\u003eU. S. History\u003c/a\u003e\u003c/span\u003e\u003cmeta itemprop=\"position\" content=\"2\"/\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003e/\u003c/span\u003e\u003c/li\u003e\u003cli itemprop=\"itemListElement\" itemscope=\"\" itemtype=\"https://schema.org/ListItem\"\u003e\u003cspan itemprop=\"name\" title=\"Featured Excerpt: The JFK Conspiracy by Brad Meltzer and Josh Mensch\"\u003eFeatured Excerpt: The JFK...\u003c/span\u003e\u003cmeta itemprop=\"position\" content=\"3\"/\u003e\u003c/li\u003e\t\t\t\t\t\u003c/ol\u003e\n\t\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\n\t\t\t\t\u003cdiv data-elementor-type=\"wp-post\" data-elementor-id=\"10271\" data-elementor-post-type=\"post\" data-id=\"b8720ee\" data-element_type=\"widget\" data-widget_type=\"theme-post-content.default\"\u003e\n\t\t\t\t\u003cdiv data-id=\"ab02c34\" data-element_type=\"container\" data-widget_type=\"heading.default\"\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch3\u003eby Brad Meltzer and Josh Mensch\u003c/h3\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\u003cdiv data-id=\"49ce7b5\" data-element_type=\"container\"\u003e\n\t\t\t\t\u003cdiv data-id=\"0c0206c\" data-element_type=\"widget\" data-widget_type=\"heading.default\"\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch3\u003eBelmont, New Hampshire\u003cbr/\u003eSeptember 1960\u003cspan\u003e\u003c/span\u003e\u003c/h3\u003e\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003cdiv data-id=\"c3fd82e\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\"\u003e\n\t\t\t\t\t\t\t\t\t\u003cfigure id=\"attachment_10273\" aria-describedby=\"caption-attachment-10273\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-300x240.jpg\" alt=\"\" width=\"310\" height=\"248\" srcset=\"https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-300x240.jpg 300w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-1024x819.jpg 1024w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-768x614.jpg 768w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-1536x1229.jpg 1536w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/7-2048x1638.jpg 2048w\" sizes=\"(max-width: 310px) 100vw, 310px\"/\u003e\u003cfigcaption id=\"caption-attachment-10273\"\u003eNew York Daily News Archive/New York Daily News via Getty Images\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eR\u003cspan\u003eichard Pavlick of Belmont, New Hampshire, really cares about flags.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAmerican flags, that is.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhen they’re hung, where they’re displayed, and how they’re raised and lowered.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eOnce, he traveled to Washington, D.C., to march in front of the White House to protest how flags were treated. And back when he worked for the post office in Boston, he wrote an angry letter to the U.S. Postmaster General complaining that they raised the flag in the South Boston station where he worked and left it up improperly overnight. Now, as a full-time resident of Belmont, Pavlick sometimes writes letters to town officials complaining about problems with how American flags are displayed.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAs a town, Belmont is small and ordinary, like many that dot the rural New England countryside. This area’s only claim to fame is that the author Grace Metalious, who lives in neighboring Gilmanton, based her bestselling 1956 novel \u003c/span\u003e\u003ci\u003e\u003cspan\u003ePeyton Place \u003c/span\u003e\u003c/i\u003e\u003cspan\u003eon the small towns in the area, including Belmont. After the book was adapted into a movie, the words “Peyton Place” became shorthand for quintessential all-American towns like this.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAt seventy-three years old, the flag-obsessed Pavlick is a typical small-town retiree. He’s lived in Belmont for six years—and before that in nearby Laconia. Originally from Boston, he served briefly in the Army as a young man, including a short stint in World War I.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHe considers himself a New Englander through and through. But just as the novel \u003c/span\u003e\u003ci\u003e\u003cspan\u003ePeyton Place \u003c/span\u003e\u003c/i\u003e\u003cspan\u003eexposed dark undercurrents just beneath the placid surface of a small town, so too Richard Pavlick’s outward normalcy conceals something darker.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFirst, he is a man full of grievances. “A chronic complainer,” one townsperson would later say, and “he was always writing to the newspaper and complaining about something.” No question, Pavlick has strong opinions, some of them personal, some financial. He’d had property disputes with other residents and once battled with the local water company over utility rates and the addition of chemicals to the water supply. Pavlick’s strongest opinions, however, are political. At this moment, he’s intensely focused on the coming Presidential election, the\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eKennedy vs. Nixon contest.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFrom his days in Massachusetts and a lifetime in New England, Pavlick knows all about the influential Kennedy family.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHe doesn’t like them one bit.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn Pavlick’s eyes, Joe Kennedy Sr. is now trying to buy or steal the election for his son with wealth and connections—and Pavlick believes no family should have such an outsize influence in politics. Back when Pavlick lived in Boston, he wrote a few angry letters to then-Senator John Kennedy, complaining about the post office pension system.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYet all it takes is a quick look into Richard Pavlick’s past, and it’s clear that there are other, more noticeable reasons for his particular loathing of the Kennedy family.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn 1955, Pavlick attempted to form a veterans’ organization called the Protestant War Veterans Legion. The group, according to Pavlick’s rules, was to include “every war veteran not affiliated with the Jewish or Catholic War Veterans.” To put it in clearer terms, no Jews or Catholics allowed.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWriting to several Protestant ministers, he declared, “The safety of \u003c/span\u003e\u003cspan\u003ethe United States can only be preserved by controlling or eliminating those ideologies foreign to the American way of life and those who seek control of the political future of the United States.”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTo this day, there’s no evidence that Richard Pavlick ever belonged to the Ku Klux Klan or related organizations, but his ideas about Catholics and immigration were of a similar stripe. “Keep the United States of America free from isms—religious, racial or alien-controlled,” he wrote in another letter. In his view, America was under threat from foreign influence, so patriotic Americans like himself had a responsibility to defend it.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt’s worth pointing out that Pavlick held his anti-Catholic views long before the Reverend Billy Graham and the Reverend Norman Peale got involved in the 1960 Presidential race. But their reinforcement of that prejudice, straight from the mouths of prominent Protestant leaders, only heightened and legitimized his manner of fear and prejudice.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAs the weeks of the campaign roll forward, Kennedy and Nixon pull neck and neck. The country is riveted—and Richard Pavlick becomes increasingly agitated.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFor the residents of Belmont, it won’t be long before they realize just how much darkness is hiding in their midst.\u003c/span\u003e\u003c/p\u003e\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\n\t\t\u003cdiv data-id=\"e1ecbef\" data-element_type=\"container\" data-widget_type=\"text-editor.default\"\u003e\n\t\t\t\t\t\t\t\t\t\u003cp\u003e“A New Frontier.”\u003ci\u003e\u003c/i\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eJohn F. Kennedy first used those words on July 15, 1960, in his acceptance speech at the Democratic National Convention in Los Angeles, California, on the night he won the party’s nomination for President.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe phrase stuck, soon symbolizing everything from Kennedy’s campaign to the candidate himself.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNo question, Kennedy \u003c/span\u003e\u003ci\u003e\u003cspan\u003ewas \u003c/span\u003e\u003c/i\u003e\u003cspan\u003eyoung. Forty-two years old at the start of his campaign. If elected, he’d be the youngest President ever to hold the office. In the twentieth century, only Theodore Roosevelt, who became President back in 1901, was a similar age, and he was an outlier. Every other President was over fifty.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eFrom the start, the political class believed Kennedy’s youth would be a liability. When the Massachusetts Senator first announced his Presidential run, former President Harry Truman asked, “Senator, are you certain that you are quite ready for the country, or that the country is ready for you in the role of President . . . ? [We need] a man with the greatest possible maturity and experience.   May I \u003c/span\u003e\u003cspan\u003eurge you to be patient?”\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Grow up and stop acting like a boy,” U.S. Senator and rival for the Democratic nomination Hubert Humphrey also weighed in.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eDuring the primaries, the insults kept coming. When Kennedy’s doctors made his medical records public, his Democratic primary opponent Senator Lyndon Johnson of Texas quipped that Kennedy was “lucky to receive a glowing medical report . . . from his pediatrician.” It was a solid jab, yet what none of Kennedy’s opponents understood was that, in 1960, at the start of a decade that would usher in enormous transformation, youth wasn’t a liability. In fact, his youth, confidence, and optimism were probably the defining assets of his \u003c/span\u003e\u003cspan\u003ecampaign.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSome of this was due to demographics.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe term “teenager,” which would later become an indelible part of the American vocabulary, was still new, referring to a group that had only recently been invented. The first known popular usage of the term was in 1946, not becoming commonplace until the 1950s. In previous generations, young people generally went straight into the workforce, usually into the family business. The jump from kid to breadwinner happened fast. But in the 1940s and 1950s, as child labor was gradually outlawed, young people started going to secondary school, driving cars, and having leisure time. Most vital, in the middle class and above, they had money to spend.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIt almost sounds absurd now, but back then, older Americans didn’t know what to make of this new category of young Americans, mostly treating them with derision or even fear. “The abolition of child labor and the lengthening span of formal education have given us a huge leisure class of the young, with animal energies never absorbed by tasks of production,” the \u003c/span\u003e\u003ci\u003e\u003cspan\u003eNew York Times \u003c/span\u003e\u003c/i\u003e\u003cspan\u003eworried in 1957. Older Americans also became obsessed with dangers like “juvenile delinquency,” a condition that often boiled down simply to young\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003epeople not respecting or agreeing with their parents.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNeedless to say, the youth revolution caused sweeping changes in the culture, especially in entertainment and the arts.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn music, pioneering Black artists Little Richard, Chuck Berry, Bo Diddley, and others melded the traditional Black music form the \u003c/span\u003e\u003cspan\u003eblues with up-tempo rhythms to create a new musical form—rock ’n’ roll—that would send those teenage “animal energies” into overdrive.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhite artists such as Elvis Presley and Buddy Holly added elements of country and pop music to make the sound more mainstream— turning teen-oriented music into a cultural and commercial juggernaut. For all the hand-wringing that grown-ups did about this new teenage explosion in society, they often ignored a key aspect of the group.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNamely, that this new generation of young people, coming of age in the 1940s and 1950s, was the most educated generation in history.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn 1920, only 30 percent of teenagers were in high school. By 1936, the percentage had doubled. Since then, the numbers climbed every year.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAccompanying this education came an independent spirit . . . and a profound sense of idealism.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eYoung people were the ones who led the way in the defining domestic issue of the day: the Civil Rights Movement. Young Black leaders, many of them still high school and college students, had emerged all over the South, forming organizations to fight the injustice of forced segregation, voting discrimination, and other forms of inequality codified by “Jim Crow” laws in southern states.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn 1955, fifteen-year-old Claudette Colvin of Montgomery, Alabama, refused to give up her seat and stand in the whites-only section of a public bus. Police dragged her off and arrested her, sparking a lawsuit.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eNine months later, activist Rosa Parks was famously inspired to do the same, which led to the Montgomery bus boycott.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAt lunch counter sit-ins, nonviolent demonstrations, and protest marches, teenagers and other young people often led the way.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMore than previous generations, young white Americans were ready to join the struggle for civil rights, often diverging from their own parents. White college students especially were ready to put their hearts—and in a few cases their lives—on the line to join the fight.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAnd a fight it was. The push for Black integration and equality was met with overwhelming force and brutality. Southern governments and law enforcement responded to the movement with shocking \u003c/span\u003e\u003cspan\u003eviolence, using every tool of the state to brutalize, arrest, and imprison protesters.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSouthern law enforcement often coordinated directly with the Ku Klux Klan and similar white vigilante groups. If there was a sit-in or march, gangs of KKK members would arrive at a designated time, armed with baseball bats and axe handles. Sure, the police were there, but they’d stand back and watch the white foot soldiers beat on nonviolent protesters. Then, the police would arrest the bloodied victims.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn the late 1950s, as the battle over civil rights intensified and the images became increasingly violent, America was approaching a crossroads.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhat kind of country did we want to be?\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eJohn F. Kennedy, the handsome and young-looking forty-three- year-old, had an idea.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eLucky for him, these educated, idealistic, rock-’n’-rolling teenagers who came of age during the 1950s were listening.\u003c/span\u003e\u003c/p\u003e\t\t\t\t\t\t\t\t\u003c/div\u003e\n\t\t\u003cdiv data-id=\"b912c5e\" data-element_type=\"container\"\u003e\n\t\t\u003cdiv data-id=\"54d4904\" data-element_type=\"container\" data-widget_type=\"image.default\"\u003e\n\t\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" width=\"800\" height=\"800\" src=\"https://www.thehistoryreader.com/wp-content/uploads/2024/12/200061853.jpg\" alt=\"\" srcset=\"https://www.thehistoryreader.com/wp-content/uploads/2024/12/200061853.jpg 870w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/200061853-300x300.jpg 300w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/200061853-150x150.jpg 150w, https://www.thehistoryreader.com/wp-content/uploads/2024/12/200061853-768x768.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\u003cdiv data-id=\"9bab1ce\" data-element_type=\"container\" data-widget_type=\"text-editor.default\"\u003e\u003cp\u003e\u003cb\u003eBRAD MELTZER\u003c/b\u003e is the #1 \u003ci\u003eNew York Times\u003c/i\u003e bestselling author of \u003ci\u003eThe Lightning Rod\u003c/i\u003e, \u003ci\u003eThe Escape Artist\u003c/i\u003e, and over ten other bestselling thrillers, as well as the Ordinary People Change the World series. He is also the host of the History Channel TV shows \u003ci\u003eBrad Meltzer’s Decoded\u003c/i\u003e and \u003ci\u003eBrad Meltzer’s Lost History\u003c/i\u003e, which he used to help find the missing 9/11 flag that the firefighters raised at Ground Zero.\u003c/p\u003e\u003c/div\u003e\n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-12-19T16:06:07Z",
  "modifiedTime": "2024-12-19T16:06:21Z"
}
