{
  "id": "11359876-2331-4333-b361-c8684e1854b7",
  "title": "The One Meal This NYC Chef Always Makes With His Son",
  "link": "https://food52.com/blog/28838-joe-isidori-father-son-cooking",
  "description": "When you want good Italian food around New York City—or really anywhere—there are a few things I always look for. A real Italian accent helps, or at least a whisper of one. Fresh bread and olive oil (with bonus points for roasted garlic swimming in it and slowly infusing it). And fresh parmesan—lots of it. You know it’s the real deal when there’s a full wheel in the dining room and a microplane grater always on standby. At Arthur \u0026 Sons, a red-sauce joint with old-school flair and serious comfort vibes, you’ll find all that and more. Founded by third-generation Italian American chef Joe Isidori, the restaurant is a love letter to the kind of Italian-American cooking that never goes out of style. Think: red booths, checkered tablecloths, stained glass light fixtures, and Caesar salads showered in freshly grated cheese. It’s cozy, classic, and always packed. And chances are, you’ll see Joe personally grating parm over your dish. Read More \u003e\u003e",
  "author": "Julia Youman",
  "published": "Sun, 15 Jun 2025 18:55:13 -0400",
  "source": "http://feeds.feedburner.com/food52-TheAandMBlog",
  "categories": [
    "New \u0026 Now",
    "Kid-Friendly",
    "Father's Day"
  ],
  "byline": "Written by: Julia Youman Email me: [email protected]",
  "length": 5623,
  "excerpt": "How famed chef Joe Isidori is keeping family cooking traditions alive with his son this Father’s Day.",
  "siteName": "Food52",
  "favicon": "https://food52.com/assets/apple-touch-icon/180x180-4f0fc96f9ea242e3851f664c372adcd208dcae1d81b182add1cc5695bf192f57.png",
  "text": "When you want good Italian food around New York City—or really anywhere—there are a few things I always look for. A real Italian accent helps, or at least a whisper of one. Fresh bread and olive oil (with bonus points for roasted garlic swimming in it and slowly infusing it). And fresh parmesan—lots of it. You know it’s the real deal when there’s a full wheel in the dining room and a microplane grater always on standby. At Arthur \u0026 Sons, a red-sauce joint with old-school flair and serious comfort vibes, you’ll find all that and more. Founded by third-generation Italian American chef Joe Isidori, the restaurant is a love letter to the kind of Italian-American cooking that never goes out of style. Think: red booths, checkered tablecloths, stained glass light fixtures, and Caesar salads showered in freshly grated cheese. It’s cozy, classic, and always packed. And chances are, you’ll see Joe personally grating parm over your dish. Isidori, a Michelin-starred chef, didn’t just fall into the restaurant world, he was raised in it. Since he was five years old, he’s been in the kitchen, learning the ropes by cooking English muffin pizzas with his dad. Today, he’s continuing that tradition with his own 8-year-old son, Roman. “Roman reminds me why I fell in love with food in the first place. His curiosity, his laughter, the way he turns stirring sauce into a game—it brings the soul back into cooking,” Joe told Food52. Meet Roman, Joe’s Favorite Sous Chef Roman’s been in the kitchen with Joe since he was a baby. These days, their go-to activities include stirring pots, sprinkling cheese, and jamming out to Sinatra. Though Roman’s already made it clear that he wants to be an architect—not a chef, thank you very much—he still loves cooking with his dad, especially when it involves breakfast (scrambled eggs are a favorite). “When we’re in the kitchen together, it’s our time to connect, laugh, and just be present. He might be tossing basil leaves into a bowl or dancing to Sinatra while we wait for the sauce to simmer, but those are the moments that matter.” Photo by Joe Isidori For Isidori, cooking with Roman isn’t about precision, it’s about learning and playing around. Whether they’re shaping meatballs or picking herbs, the goal is simple: have fun, make memories. “We don’t aim for Michelin stars when Roman’s in the kitchen—we aim for smiles.” And if you’ve ever wondered what a chef really cooks with their family after hours, Joe gave us the inside scoop. What They Cook Together (Hint: Pizza Is Always on the Menu) One of their favorites? Homemade pizza night. Roman rolls the dough, spoons the sauce, picks toppings, and sneaks plenty of cheese along the way. Another hit is their “build-your-own pasta bowl” nights, where Joe lays out the ingredients and Roman assembles his plate like a little food stylist. It gives him autonomy in the kitchen and encourages adventurous eating—though, Joe admits, broccoli is still a non-starter. Joe’s also found ways to keep the kitchen fun without stressing about the mess. “Let go of perfection—that’s the number one rule. Cooking with kids should be messy, loud, and full of laughs. If a meatball comes out square instead of round, who cares?” To keep Roman engaged, he turns tasks into games: who can crack an egg without getting shell in the bowl? How many red ingredients can they throw into a salad? The Tools \u0026 Ingredients They Love Joe’s learned what works—and what doesn’t—when it comes to cooking with kids. He steers clear of anything overly spicy or complicated and opts for tactile, colorful ingredients like cherry tomatoes, fresh mozzarella, and herbs they can pick straight from the garden. And when it comes to tools, Roman has a few favorites: • A mini whisk that makes him feel like a real chef • Cookie cutters for shaping pancakes and sandwiches • A kid-safe paring knife for slicing strawberries and bananas Lessons From the Line and Family Kitchen Teaching Roman to cook has been its own kind of education for Joe. Beyond the recipes and techniques, it’s about passing on values: patience, creativity, curiosity. It’s also about letting go—of perfection, of pressure, of expectations. Joe admits that his mom still gets Roman’s vote for best cook in the family (humbling, to say the least). But at the end of the day, it’s not about the food—it’s about being together. “Cooking with Roman is one of my absolute favorite things to do. It’s not just about the food—it’s about spending real time together.” This Father’s Day, the two will likely be back in the kitchen, doing what they do best: cracking eggs, stirring sauce, and dancing to Sinatra. And while Roman might grow up to be an architect, one thing’s for sure—he’ll always know his way around a kitchen, thanks to the time spent by his dad’s side. Some Recipes to cook with your kids How do you like to cook with your kids in the kitchen?",
  "image": "https://images.food52.com/KPX1DjnffIIeX08S7XgJ9sTmlNg=/fit-in/1200x1200/d76a12b3-a470-458f-ae59-5a7a3c5a2478--2019-0129_lazy-weeknight-pizza-baked-slices_3x2_julia-gartland_163.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eWhen you want good Italian food around New York City—or really anywhere—there are a few things I always look for. A real Italian accent helps, or at least a whisper of one. Fresh bread and olive oil (with bonus points for roasted garlic swimming in it and slowly infusing it). And fresh parmesan—lots of it. You know it’s the real deal when there’s a full wheel in the dining room and a microplane grater always on standby.\u003c/p\u003e\n              \u003cp\u003eAt \u003ca href=\"https://url.usb.m.mimecastprotect.com/s/N84cC7Dq16hz626LsWhvco5H6R\" target=\"_blank\"\u003eArthur \u0026amp; Sons\u003c/a\u003e, a red-sauce joint with old-school flair and serious comfort vibes, you’ll find all that and more. Founded by third-generation Italian American chef \u003ca href=\"https://url.usb.m.mimecastprotect.com/s/AaXeC6YpX6tP979XCpf6c53W-i/\" target=\"_blank\"\u003eJoe Isidori\u003c/a\u003e, the restaurant is a love letter to the kind of Italian-American cooking that never goes out of style. Think: red booths, checkered tablecloths, stained glass light fixtures, and Caesar salads showered in freshly grated cheese. It’s cozy, classic, and always packed. And chances are, you’ll see Joe personally grating parm over your dish.\u003c/p\u003e\n              \u003cp\u003eIsidori, a Michelin-starred chef, didn’t just fall into the restaurant world, he was raised in it. Since he was five years old, he’s been in the kitchen, learning the ropes by cooking English muffin pizzas with his dad. Today, he’s continuing that tradition with his own 8-year-old son, Roman.\u003c/p\u003e\n              \u003cp\u003e“Roman reminds me why I fell in love with food in the first place. His curiosity, his laughter, the way he turns stirring sauce into a game—it brings the soul back into cooking,” Joe told Food52.\u003c/p\u003e\n              \n\n\n              \u003ch2\u003eMeet Roman, Joe’s Favorite Sous Chef\u003c/h2\u003e\n              \u003cp\u003eRoman’s been in the kitchen with Joe since he was a baby. These days, their go-to activities include stirring pots, sprinkling cheese, and jamming out to Sinatra. Though Roman’s already made it clear that he wants to be an architect—not a chef, thank you very much—he still loves cooking with his dad, especially when it involves breakfast (scrambled eggs are a favorite).\u003c/p\u003e\n              \u003cp\u003e“When we’re in the kitchen together, it’s our time to connect, laugh, and just be present. He might be tossing basil leaves into a bowl or dancing to Sinatra while we wait for the sauce to simmer, but those are the moments that matter.”\u003c/p\u003e\n              \n\n  \u003cfigure\u003e\n    \u003cdiv\u003e\n      \u003ca href=\"https://www.pinterest.com/pin/create/button\" data-pin-do=\"buttonPin\" data-pin-media=\"\" data-pin-custom=\"true\" data-ga-event=\"inPageInteraction\" data-ga-event-action=\"Pinterest Share\" data-ga-event-label=\"Article Body Image\" data-ga-destination-url=\"none\"\u003e\n        \u003csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 16.9 20.8\"\u003e\u003cpath d=\"M16.8 6.3C16.5 3.2 13.6.4 10.1.1 4.8-.5.1 2.7 0 7.9c0 2.4.8 4 2.9 4.8 1.5-1.5-.3-2.4-.5-4C2 4.3 7.1.1 11.7 2.9c3.2 1.9 2.6 9.9-1.2 10.7-.8.1-1.8-.1-2.1-.5-1.9-1.8 1.5-4.8.4-7.3-.9-2.1-3.6-.4-3.9 1.5-.2 1 .3 2 .3 2.9 0 2.1-1.3 5-1.7 7.1-.2.9-.3 2.6-.1 3.4h1.5c1-1.6 1.6-4.1 2.1-6.3.3-.2.5.4.7.6 1.8 1.4 5 .6 6.4-.7 2.1-1.7 3-5.2 2.7-8\" fill=\"currentColor\"\u003e\u003c/path\u003e\u003c/svg\u003e\n      \u003c/a\u003e\n\n      \u003cdiv\u003e\u003cpicture\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 1400px)\" type=\"image/webp\" data-srcset=\"https://images.food52.com/7gKMg45xvywIhS3LxnJGQl20ijs=/778x1004/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/LTq5fNlDB9gPqI1L4eRi20u1CMg=/1556x2008/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 1400px)\" data-srcset=\"https://images.food52.com/rZwN9MratbuxfdgQ_HuUK-EZ0pc=/778x1004/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/Pdfs02tRMoYaS1HYYWmwqekBJEw=/1556x2008/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 1024px)\" type=\"image/webp\" data-srcset=\"https://images.food52.com/auuySz63_F_u0ecIhNc6ALMJimQ=/660x851/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/C5mUnYsng3GqDGDHYLXigdKuteo=/1320x1702/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 1024px)\" data-srcset=\"https://images.food52.com/iM7swOF3fPGi9jQGBzccydIJw2I=/660x851/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/S7FvzGPGsljIbutnPAEDMBT_MWM=/1320x1702/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 768px)\" type=\"image/webp\" data-srcset=\"https://images.food52.com/mtlbw8B6NhAKItDKZy-uuC1CKgg=/964x1244/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/ljqXCkpq2meuyZa1k2Mkbn_RCNw=/1928x2488/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 768px)\" data-srcset=\"https://images.food52.com/4kIDc96LP76njncbMR6wPm42Rgw=/964x1244/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/ZUXKSf_HPMqhJs0oknaeZuCZuPI=/1928x2488/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 500px)\" type=\"image/webp\" data-srcset=\"https://images.food52.com/85XJQEbUiN8VHj4hxwB9CNsMHFA=/768x991/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/PbLMojVfJxfxhtvs8QqkZY53KSQ=/1536x1982/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" media=\"(min-width: 500px)\" data-srcset=\"https://images.food52.com/SbU_6SygBorP8kpXju6jVPWOkNc=/768x991/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/rvzawDSYXycdYhuUDgP894vKEsI=/1536x1982/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003csource srcset=\"data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" type=\"image/webp\" data-srcset=\"https://images.food52.com/llvDTRgzcNiY0Y1w3S0zTHpcXvs=/375x484/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/WqRs3U4gqhwqBvC42_k_RF9nLUQ=/750x968/filters:format(webp)/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003cimg srcset=\"https://images.food52.com/eFaFyBzSCDqvB1eu0RwmfJ32YJs=/375x484/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/0Kz1PKPDr-jBHbIbCoygKZ_bAhM=/750x968/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\" alt=\"\" width=\"964\" height=\"1244\" data-expand=\"750\" data-srcset=\"https://images.food52.com/eFaFyBzSCDqvB1eu0RwmfJ32YJs=/375x484/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg, https://images.food52.com/0Kz1PKPDr-jBHbIbCoygKZ_bAhM=/750x968/d334dbe5-c160-4271-850e-c25a5967d8f6--image002.jpg 2x\"/\u003e\u003c/picture\u003e\u003c/div\u003e\n    \u003c/div\u003e\n\n      \u003cfigcaption\u003e\n\n          \u003cspan\u003ePhoto by Joe Isidori\u003c/span\u003e\n      \u003c/figcaption\u003e\n  \u003c/figure\u003e\n\n              \u003cp\u003eFor Isidori, cooking with Roman isn’t about precision, it’s about learning and playing around. Whether they’re shaping meatballs or picking herbs, the goal is simple: have fun, make memories.\u003c/p\u003e\n              \u003cp\u003e“We don’t aim for Michelin stars when Roman’s in the kitchen—we aim for smiles.”\u003c/p\u003e\n              \u003cp\u003eAnd if you’ve ever wondered what a chef \u003cem\u003ereally\u003c/em\u003e cooks with their family after hours, Joe gave us the inside scoop.\u003c/p\u003e\n              \n  \n\n              \u003ch2\u003eWhat They Cook Together (Hint: Pizza Is Always on the Menu)\u003c/h2\u003e\n              \u003cp\u003eOne of their favorites? Homemade pizza night. Roman rolls the dough, spoons the sauce, picks toppings, and sneaks plenty of cheese along the way.\u003c/p\u003e\n              \u003cp\u003eAnother hit is their “build-your-own pasta bowl” nights, where Joe lays out the ingredients and Roman assembles his plate like a little food stylist. It gives him autonomy in the kitchen and encourages adventurous eating—though, Joe admits, broccoli is still a non-starter.\u003c/p\u003e\n              \u003cp\u003eJoe’s also found ways to keep the kitchen fun without stressing about the mess.\u003c/p\u003e\n              \u003cp\u003e“Let go of perfection—that’s the number one rule. Cooking with kids should be messy, loud, and full of laughs. If a meatball comes out square instead of round, who cares?”\u003c/p\u003e\n              \u003cp\u003eTo keep Roman engaged, he turns tasks into games: who can crack an egg without getting shell in the bowl? How many red ingredients can they throw into a salad?\u003c/p\u003e\n              \u003ch2\u003eThe Tools \u0026amp; Ingredients They Love\u003c/h2\u003e\n              \u003cp\u003eJoe’s learned what works—and what doesn’t—when it comes to cooking with kids. He steers clear of anything overly spicy or complicated and opts for tactile, colorful ingredients like cherry tomatoes, fresh mozzarella, and herbs they can pick straight from the garden.\u003c/p\u003e\n              \u003cp\u003eAnd when it comes to tools, Roman has a few favorites:\u003c/p\u003e\n              \u003cp\u003e• A \u003cstrong\u003emini whisk\u003c/strong\u003e that makes him feel like a real chef\u003c/p\u003e\n              \u003cp\u003e• \u003cstrong\u003eCookie cutters\u003c/strong\u003e for shaping pancakes and sandwiches\u003c/p\u003e\n              \u003cp\u003e• A \u003cstrong\u003ekid-safe paring knife\u003c/strong\u003e for slicing strawberries and bananas\u003c/p\u003e\n              \u003ch2\u003eLessons From the Line and Family Kitchen\u003c/h2\u003e\n              \u003cp\u003eTeaching Roman to cook has been its own kind of education for Joe. Beyond the recipes and techniques, it’s about passing on values: patience, creativity, curiosity. It’s also about letting go—of perfection, of pressure, of expectations.\u003c/p\u003e\n              \u003cp\u003eJoe admits that his mom still gets Roman’s vote for best cook in the family (humbling, to say the least). But at the end of the day, it’s not about the food—it’s about being together.\u003c/p\u003e\n              \u003cp\u003e“Cooking with Roman is one of my absolute favorite things to do. It’s not just about the food—it’s about spending real time together.”\u003c/p\u003e\n              \u003cp\u003eThis Father’s Day, the two will likely be back in the kitchen, doing what they do best: cracking eggs, stirring sauce, and dancing to Sinatra.\u003c/p\u003e\n              \u003cp\u003eAnd while Roman might grow up to be an architect, one thing’s for sure—he’ll always know his way around a kitchen, thanks to the time spent by his dad’s side.\u003c/p\u003e\n              \u003ch2\u003eSome Recipes to cook with your kids\u003c/h2\u003e\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \n  \n\n\n\n              \u003chr/\u003e\n\n              \n              \u003ccenter\u003e\n\u003cem\u003eHow do you like to cook with your kids in the kitchen?\u003c/em\u003e\n\u003c/center\u003e\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-15T18:55:13-04:00",
  "modifiedTime": "2025-06-15T18:55:14-04:00"
}
