{
  "id": "33303cc0-08a7-4b87-b759-b786e6bad08e",
  "title": "This Cocktail Uses a Whole Egg—And We’re Drinking It All Summer",
  "link": "https://food52.com/blog/28818-how-to-make-flip-cocktails",
  "description": "If there’s one thing I love in this world, it’s an unexpected cocktail—especially heading into the summer months, when Friday happy hours feel more joyous than ever. I’m always on a quest to perfect my espresso martini (more on that soon), but this month, I’m in the mood for something new. And that leads us to the question that rolls around every June: What’s going to be the drink of the summer? A safe bet (that I’d put actual money on) is the Aperol spritz, still going strong five years later. The limoncello spritz has also gained steam—and honestly, I get the appeal. I recently tried Pallini’s version for their summer spritz activation, and their sunny vibes once again sold me. Read More \u003e\u003e",
  "author": "Julia Youman",
  "published": "Tue, 27 May 2025 15:35:19 -0400",
  "source": "http://feeds.feedburner.com/food52-TheAandMBlog",
  "categories": [
    "New \u0026 Now",
    "Behind the Bar",
    "Cocktail",
    "Trending"
  ],
  "byline": "Julia Youman",
  "length": 4668,
  "excerpt": "We did a deep dive on flip cocktails and how to make them.",
  "siteName": "Food52",
  "favicon": "https://food52.com/assets/apple-touch-icon/180x180-4f0fc96f9ea242e3851f664c372adcd208dcae1d81b182add1cc5695bf192f57.png",
  "text": "If there’s one thing I love in this world, it’s an unexpected cocktail—especially heading into the summer months, when Friday happy hours feel more joyous than ever. I’m always on a quest to perfect my espresso martini (more on that soon), but this month, I’m in the mood for something new. And that leads us to the question that rolls around every June: What’s going to be the drink of the summer? A safe bet (that I’d put actual money on) is the Aperol spritz, still going strong five years later. The limoncello spritz has also gained steam—and honestly, I get the appeal. I recently tried Pallini’s version for their summer spritz activation, and their sunny vibes once again sold me. Then there’s the tomato-tini, which has taken over my social feed for the past two summers. Whether it’s made with fresh or bottled tomato juice, I’m here for a tomato girl cocktail moment—especially when olive brine and a good olive oil drizzle are involved. But about a month ago, I saw something that completely threw me (in the best way): a cocktail that used a whole egg. Enter: the flip. Wait, What Is a Flip Cocktail? Apparently, flips have been around forever. Like, since-the-1600s forever. According to the Oxford English Dictionary, the term originally referred to a hot drink made from beer, rum, and sugar that was heated with a red-hot iron poker. It started as a winter warmer, which might be why one of my coworkers was confused at me pitching flip cocktails for summer content. That said, today’s flip is a a bit different from the beer-and-iron version. Somewhere along the way, the drink evolved into a rich, velvety cocktail made with spirits, sugar, citrus, and a whole egg—yes, yolk and all. It probably does make a great holiday cocktail, but i’ve been seeing citrus versions that look beachy. The Modern Flip (and Why I’m Obsessed) I first spotted the modern flip in a video by one of my favorite cocktail creators, Colette Doran. You can find her mixing up wildly creative drinks on Instagram and TikTok—she once turned sugar cookies into a clarified cocktail, which tells you everything you need to know. The one that caught my eye was her key lime pie flip: creamy, citrusy, and almost ice cream-like, with a touch of zest. I immediately reached out to her to learn more. “It’s a common misconception that eggs are dangerous to consume in cocktails—I promise, it isn’t,” Colette told me. “The alcohol plus the citrus acidity in a flip will help kill 99.99% of anything harmful in the egg.” If you’re still skeptical, just think of eggnog—it’s basically the same concept. Since then, she’s also shared a lemon meringue version as part of her “Lemon Week” series (which I recommend checking out immediately). The real magic of these cocktails lies in their texture. “It gives it a nice froth, but also such a smooth, velvety texture,” Colette explained. “It’s almost dessert-like.” How to Make a Flip (and Make It Yours) Here’s the beauty of the flip: once you’ve got the basics down—spirit, citrus, sugar, and a whole egg—you can really make it your own. For her key lime pie version, Colette rims the glass with demerara syrup and crushed graham crackers, then shakes up a mix of white rum, lime juice, egg, and Greek yogurt (which adds even more creamy body—many flips include something similarly rich to get that dessert-like texture). She likes rum and tequila for their summery flavor, but you can use just about any spirit. I even found a Negroni flip recipe on our site. If you’re into cozier, wintery vibes, there’s this bourbon buttermilk flip with maple syrup and egg that I’m bookmarking for November. Basically, once you’ve got a whole egg, sugar, and citrus, you can experiment from there. So, Should You Try a Flip This Summer? If you ask Colette, she’s looking to her favorite summer flavors for inspiration: grilled peaches, chocolate-covered bananas, and (always) citrus. “You truly can’t go wrong with citrus in the summer,” she said—and I fully agree. If you’re curious to try the key lime pie flip, I’d recommend heading to her TikTok or Instagram for the full how-to (she explains it better than I can). And don’t be surprised if, like me, you end up craving a custardy cocktails from now until Labor Day. Would you try a flip cocktail? What are you sipping on this summer?",
  "image": "https://images.food52.com/hD9pv2-WQVZ4bHPLgyEKH0YN1_M=/fit-in/1200x1200/2f902d46-f15e-4341-b28d-361ab597303f--2025-0411_sawyer-ceramics_ceramic-egg-separator_gif_email-site_1x1_armando-rafael_0077.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n              \u003cp\u003eIf there’s one thing I love in this world, it’s an unexpected cocktail—especially heading into the summer months, when Friday happy hours feel more joyous than ever. I’m always on a quest to perfect my espresso martini (more on that soon), but this month, I’m in the mood for something new.\u003c/p\u003e\n              \u003cp\u003eAnd that leads us to the question that rolls around every June: What’s going to be \u003cem\u003ethe\u003c/em\u003e drink of the summer? A safe bet (that I’d put actual money on) is the Aperol spritz, still going strong five years later. The limoncello spritz has also gained steam—and honestly, I get the appeal. I recently tried Pallini’s version for their summer spritz activation, and their sunny vibes once again sold me.\u003c/p\u003e\n              \u003cp\u003eThen there’s the tomato-tini, which has taken over my social feed for the past two summers. Whether it’s made with fresh or bottled tomato juice, I’m here for a tomato girl cocktail moment—especially when olive brine and a good olive oil drizzle are involved.\u003c/p\u003e\n              \u003cp\u003eBut about a month ago, I saw something that completely threw me (in the best way): a cocktail that used a \u003cem\u003ewhole\u003c/em\u003e egg. Enter: the flip.\u003c/p\u003e\n              \n\n\n  \n\n              \u003ch2\u003eWait, What Is a Flip Cocktail?\u003c/h2\u003e\n              \u003cp\u003eApparently, flips have been around forever. Like, since-the-1600s forever. According to the Oxford English Dictionary, the term originally referred to a hot drink made from beer, rum, and sugar that was heated with a red-hot iron poker. It started as a winter warmer, which might be why one of my coworkers was confused at me pitching flip cocktails for summer content.\u003c/p\u003e\n              \u003cp\u003eThat said, today’s flip is a a bit different from the beer-and-iron version. Somewhere along the way, the drink evolved into a rich, velvety cocktail made with spirits, sugar, citrus, and a whole egg—yes, yolk and all. It probably does make a great holiday cocktail, but i’ve been seeing citrus versions that look beachy.\u003c/p\u003e\n              \u003ch2\u003eThe Modern Flip (and Why I’m Obsessed)\u003c/h2\u003e\n              \u003cp\u003eI first spotted the modern flip in a video by one of my favorite cocktail creators, \u003ca href=\"https://www.instagram.com/colettescocktails/?hl=en\" target=\"_blank\"\u003eColette Doran\u003c/a\u003e. You can find her mixing up wildly creative drinks on Instagram and TikTok—she once turned sugar cookies into a clarified cocktail, which tells you everything you need to know.\u003c/p\u003e\n              \u003cp\u003eThe one that caught my eye was her \u003ca href=\"https://www.instagram.com/p/DHduTsfOq-P/\" target=\"_blank\"\u003e\u003cem\u003ekey lime pie flip\u003c/em\u003e\u003c/a\u003e: creamy, citrusy, and almost ice cream-like, with a touch of zest. I immediately reached out to her to learn more.\u003c/p\u003e\n              \u003cp\u003e“It’s a common misconception that eggs are dangerous to consume in cocktails—I promise, it isn’t,” Colette told me. “The alcohol plus the citrus acidity in a flip will help kill 99.99% of anything harmful in the egg.”\u003c/p\u003e\n              \n  \n\n              \u003cp\u003eIf you’re still skeptical, just think of eggnog—it’s basically the same concept.\nSince then, she’s also shared a \u003ca href=\"https://www.instagram.com/p/DIw2Q9FPD8s/\" target=\"_blank\"\u003elemon meringue version\u003c/a\u003e as part of her “Lemon Week” series (which I recommend checking out immediately). The real magic of these cocktails lies in their texture. “It gives it a nice froth, but also such a smooth, velvety texture,” Colette explained. “It’s almost dessert-like.”\u003c/p\u003e\n              \u003ch2\u003eHow to Make a Flip (and Make It Yours)\u003c/h2\u003e\n              \u003cp\u003eHere’s the beauty of the flip: once you’ve got the basics down—spirit, citrus, sugar, and a whole egg—you can really make it your own. For her key lime pie version, Colette rims the glass with demerara syrup and crushed graham crackers, then shakes up a mix of white rum, lime juice, egg, and Greek yogurt (which adds even more creamy body—many flips include something similarly rich to get that dessert-like texture).\u003c/p\u003e\n              \u003cp\u003eShe likes rum and tequila for their summery flavor, but you can use just about any spirit. I even found a \u003ca href=\"https://food52.com/recipes/26068-negroni-flip\"\u003eNegroni flip\u003c/a\u003e recipe on our site. If you’re into cozier, wintery vibes, there’s this \u003ca href=\"https://food52.com/recipes/90555-buttermilk-flip\"\u003ebourbon buttermilk flip\u003c/a\u003e with maple syrup and egg that I’m bookmarking for November.\u003c/p\u003e\n              \u003cp\u003eBasically, once you’ve got a whole egg, sugar, and citrus, you can experiment from there.\u003c/p\u003e\n              \n  \n\n\n\n              \u003ch2\u003eSo, Should You Try a Flip This Summer?\u003c/h2\u003e\n              \u003cp\u003eIf you ask Colette, she’s looking to her favorite summer flavors for inspiration: grilled peaches, chocolate-covered bananas, and (always) citrus. “You truly can’t go wrong with citrus in the summer,” she said—and I fully agree.\u003c/p\u003e\n              \u003cp\u003eIf you’re curious to try the key lime pie flip, I’d recommend heading to her \u003ca href=\"https://www.tiktok.com/@colettescocktails/video/7486258652941208875\" target=\"_blank\"\u003eTikTok\u003c/a\u003e or \u003ca href=\"https://www.instagram.com/p/DHduTsfOq-P/\" target=\"_blank\"\u003eInstagram\u003c/a\u003e for the full how-to (she explains it better than I can). And don’t be surprised if, like me, you end up craving a custardy cocktails from now until Labor Day.\u003c/p\u003e\n              \u003chr/\u003e\n\n              \n              \u003ccenter\u003e\n\u003cem\u003eWould you try a flip cocktail? What are you sipping on this summer?\u003c/em\u003e\n\u003c/center\u003e\n          \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-27T15:35:19-04:00",
  "modifiedTime": "2025-05-27T15:37:32-04:00"
}
