{
  "id": "81735eb1-0b56-42d9-989f-e5d9df09f718",
  "title": "What I Read in March and April 2025.",
  "link": "https://www.howsweeteats.com/2025/05/what-i-read-in-march-and-april-2025/",
  "description": "A little late on my March reads for you! Oh my gosh – I hate that I missed sharing last month so we’re combining. I had a lot going on with the release of Easy Everyday an just couldn’t get to it. But! The good news is that I have read a TON of great […] The post What I Read in March and April 2025. appeared first on How Sweet Eats.",
  "author": "Jessica",
  "published": "Thu, 01 May 2025 10:45:28 +0000",
  "source": "https://www.howsweeteats.com/feed/",
  "categories": [
    "Crumbs",
    "Reading Lists",
    "What I Read"
  ],
  "byline": "Jessica",
  "length": 6573,
  "excerpt": "A little late on my March reads for you! Oh my gosh – I hate that I missed sharing last month so we’re combining. I had a lot going on with the release of Easy Everyday an just couldn’t get to it. But! The good news is that I have read a TON of great […]",
  "siteName": "How Sweet Eats",
  "favicon": "https://www.howsweeteats.com/wp-content/themes/howsweeteats2020/favicon/apple-touch-icon.png",
  "text": "A little late on my March reads for you! Oh my gosh – I hate that I missed sharing last month so we’re combining. I had a lot going on with the release of Easy Everyday an just couldn’t get to it. But! The good news is that I have read a TON of great books the last two months. Like so many good ones. And now, we’re into my favorite book release months – summer reads have always been my favorite – and I couldn’t be more excited. And hear about what you’re reading! I do have a book of the month membership – I love it so much. I read SO many books from this box. I get so many of my new releases and debut author books there. You can sign up for one here. Most of these books are linked through bookshop (if available!) and I highly suggest shopping through there because it will support your local indie bookstore. You can choose the local bookstore to support! I support Penguin Books when I buy which is my fave here in Pittsburgh. Okay, keep me posted on what you’re reading below! WHAT I READ IN MARCH \u0026 APRIL 2025 Promise Me Sunshine – 3.5 stars A book of the month pick for me. I almost didn’t read this because it deals with best friends + cancer (still scarred from Firefly Lane 17 years later, you know?), but I am so glad I did. the main character loses her best friend and is in a sea of grief. She finds comfort in an unexpected person who says he will help her complete her “to live” bucket list. This was so sweet – Miles, the main male character – is just wonderful an SUCH a good guy. I really enjoyed it. You Between The Lines – 4 stars Another book of the month find! We have two aspiring writers who have known each other since high school attending the same program. I love a second chance romance and this has some enemies to lovers in it too. These characters are super real and I loved how they turned out in the end. I highlighted SO many lines in this book. Say You’ll Remember Me – 5 stars Oh my gosh – this is heart wrenching and wonderful and I can’t even tell you how much I loved it. We have a date between the perfect guy Xavier and Samantha who is in the midst of a family crisis. She can’t really get involved with anyone at the moment. But these two have *so much* there between them. But! These two have so much going against them it’s crazy. There is a family illness trigger here and that was hard for me, but not enough to skip one of my favorite author’s books! Fun For The Whole Family – 5 stars I live for a family drama!! They are some of my favorite books. In this one, we follow four siblings, some are a mess, and there are secrets too. This had me all over the place – the siblings are estranged, but come back together and then get stuck together. If you haven siblings, you will get so much of this and there is a ridiculous amount of feeling in all of it. Lots of nostalgia here! Passion Project – 4 stars Another book of the month box find! This is SO cute. We follow Bennet who is deep in grief, has no desire date, and stands Henry up. He suggests that they take on a project of doing fun and exciting things as friends and it is exciting! I loved the slow burn of this book and SO much of it is real and relatable. I loved the ending and the characters are fabulous. Famous Last Words – 4 stars This is a domestic thriller and oh boy did it keep me guessing. A literary agent wakes up to a weird note from her husband and then later finds out that he is the one holding people hostage. This sucked me in instantly and couldn’t wait to find out what happened! It’s full of twists and turns and is shocking, even if a few moments are a little predictable! Count My Lies – 3.75 stars I definitely needed another thriller the last few weeks! I got this in my book of the month box. In this book, we follow Sloane who tells a lie and ends up as a nanny for a super rich family. Lots of twists in this one and the family isn’t what you think! I couldn’t put it down. Great Big Beautiful Life –  5 stars Emily Henry can do no wrong in my book and this was another winner for me. Her writing is just SO incredibly relatable for me. This story follows two writers who have the chance to tell a tabloid star’s life story. Oh my gosh, this gave me Evelyn Hugo vibes which is probably my favorite book of all time. I LOVED the every character, the story is a bit drawn out but in the best way possible. The ending is good. The whole book is not as romancy as her others, but I didn’t even need that. I loved it. Cash – 4 stars This is the first in a series but they don’t necessarily have to be read in order… though it does help because the ending is a little cliffhanger! These are like cowboy country spicy romance books, haha. I liked them and thought they were cute. Cash is about the oldest son and the daughter of the man who became a father figure to him. She inherits the ranch and it is a serious enemies to lovers trope, which I love. Wyatt – 4 stars This is the second in the series and it’s just as cute. Wyatt is another one of the brothers and this is a friends to lovers trope. Equally as cute. He and his best friend who have always been in love with each other (but neither has known) agree to fake date. Lots of tropes in these books, ha! Still very spicy but you just need to be prepared going in. If you’re a Yellowstone fan you will like these. Sawyer – 4 stars The third book just came out last week! They are such quick fun reads. This one follows Sawyer who is a single dad and our trope in this book is single dad meets single mom. Very cute! Each one of the boys has an attitude of super grumpy, or super funny or the realistic one. The books are so predictable but I love how easy they are to read and the characters are all mostly great! Just finished it yesterday. Story of My Life – 3 stars Lucy Score started a new series set in Story Lake an this is book one. I have to say that at this start of this book, I was soooo turned off by the main character, who was in a downward spiral of life and just living very… gross. I had a hard time getting past it! But then it gets cute and she (a romance writer) buys an old house (without seeing it) and a family of brothers do the renovations. Sparks fly, of course. It’s a funny little town, sort of having a Stars Hollow Vibe! Another enemies to lovers trope. Care and Feeding Loved this memoir even though it was hard to read at time. It was my favorite from March. The author worked with both Anthony Bourdain and Mario Batali and lived a very interesting life, albeit quite chaotic at times. She is a great writer and I laughed out loud many times!",
  "image": "https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png\" alt=\"march and april reading list\" width=\"800\" height=\"1200\" data-jpibfi-post-excerpt=\"\" data-jpibfi-post-url=\"https://www.howsweeteats.com/2025/05/what-i-read-in-march-and-april-2025/\" data-jpibfi-post-title=\"What I Read in March and April 2025.\" data-jpibfi-src=\"https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png\" srcset=\"https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png 800w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-728x1092.png 728w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-768x1152.png 768w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-150x225.png 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20800%201200\u0026#39;%3E%3C/svg%3E\" data-lazy-srcset=\"https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png 800w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-728x1092.png 728w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-768x1152.png 768w, https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2-150x225.png 150w\" data-lazy-src=\"https://www.howsweeteats.com/wp-content/uploads/2025/04/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-you-2.png\"/\u003e\u003c/p\u003e\n\u003cp\u003eA little late on my March reads for you! Oh my gosh – I hate that I missed sharing last month so we’re combining. I had a lot going on with the release of \u003ca href=\"https://amzn.to/3YUqTcQ\" target=\"_blank\" rel=\"noopener\"\u003eEasy Everyday\u003c/a\u003e an just couldn’t get to it. But! The good news is that I have read a TON of great books the last two months. Like so many good ones. And now, we’re into my favorite book release months – summer reads have always been my favorite – and I couldn’t be more excited.\u003c/p\u003e\n\u003cp\u003eAnd hear about what you’re reading!\u003c/p\u003e\n\u003cp\u003eI do have a \u003ca href=\"https://www.mybotm.com/mg89pbf8vga?show_box=true\" target=\"_blank\" rel=\"noopener\"\u003ebook of the month membership\u003c/a\u003e – I love it so much. I read SO many books from this box. I get so many of my new releases and debut author books there. You can \u003ca href=\"https://www.mybotm.com/mg89pbf8vga?show_box=true\" target=\"_blank\" rel=\"noopener\"\u003esign up for one here\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eMost of these books \u003ca href=\"https://bookshop.org/\" target=\"_blank\" rel=\"nofollow noopener skimlink\" data-skimlinks-tracking=\"MJK8ynpJVuLHK4ofwGJ_v~plt|lm\" data-google-interstitial=\"false\"\u003eare linked through bookshop\u003c/a\u003e (if available!) and I highly suggest shopping through there because it will support your local indie bookstore. You can choose the local bookstore to support! I support Penguin Books when I buy which is my fave here in Pittsburgh.\u003c/p\u003e\n\u003cp\u003eOkay, keep me posted on what you’re reading below!\u003c/p\u003e\n\u003ch2\u003eWHAT I READ IN MARCH \u0026amp; APRIL 2025\u003c/h2\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780593595732\" target=\"_blank\" rel=\"noopener\"\u003ePromise Me Sunshine\u003c/a\u003e – 3.5 stars\u003c/h3\u003e\n\u003cp\u003eA book of the month pick for me. I almost didn’t read this because it deals with best friends + cancer (still scarred from Firefly Lane 17 years later, you know?), but I am so glad I did. the main character loses her best friend and is in a sea of grief. She finds comfort in an unexpected person who says he will help her complete her “to live” bucket list. This was so sweet – Miles, the main male character – is just wonderful an SUCH a good guy. I really enjoyed it.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9781538768556\" target=\"_blank\" rel=\"noopener\"\u003eYou Between The Lines\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eAnother book of the month find! We have two aspiring writers who have known each other since high school attending the same program. I love a second chance romance and this has some enemies to lovers in it too. These characters are super real and I loved how they turned out in the end. I highlighted SO many lines in this book.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9781538759196\" target=\"_blank\" rel=\"noopener\"\u003eSay You’ll Remember Me\u003c/a\u003e – 5 stars\u003c/h3\u003e\n\u003cp\u003eOh my gosh – this is heart wrenching and wonderful and I can’t even tell you how much I loved it. We have a date between the perfect guy Xavier and Samantha who is in the midst of a family crisis. She can’t really get involved with anyone at the moment. But these two have *so much* there between them. But! These two have so much going against them it’s crazy. There is a family illness trigger here and that was hard for me, but not enough to skip one of my favorite author’s books!\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780593358306\" target=\"_blank\" rel=\"noopener\"\u003eFun For The Whole Family\u003c/a\u003e – 5 stars\u003c/h3\u003e\n\u003cp\u003eI live for a family drama!! They are some of my favorite books. In this one, we follow four siblings, some are a mess, and there are secrets too. This had me all over the place – the siblings are estranged, but come back together and then get stuck together. If you haven siblings, you will get so much of this and there is a ridiculous amount of feeling in all of it. Lots of nostalgia here!\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780143138563\" target=\"_blank\" rel=\"noopener\"\u003ePassion Project\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eAnother book of the month box find! This is SO cute. We follow Bennet who is deep in grief, has no desire date, and stands Henry up. He suggests that they take on a project of doing fun and exciting things as friends and it is exciting! I loved the slow burn of this book and SO much of it is real and relatable. I loved the ending and the characters are fabulous.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780063338425\" target=\"_blank\" rel=\"noopener\"\u003eFamous Last Words\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eThis is a domestic thriller and oh boy did it keep me guessing. A literary agent wakes up to a weird note from her husband and then later finds out that he is the one holding people hostage. This sucked me in instantly and couldn’t wait to find out what happened! It’s full of twists and turns and is shocking, even if a few moments are a little predictable!\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9781668079348\" target=\"_blank\" rel=\"noopener\"\u003eCount My Lies\u003c/a\u003e – 3.75 stars\u003c/h3\u003e\n\u003cp\u003eI definitely needed another thriller the last few weeks! I got this in my book of the month box. In this book, we follow Sloane who tells a lie and ends up as a nanny for a super rich family. Lots of twists in this one and the family isn’t what you think! I couldn’t put it down.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780593441299\" target=\"_blank\" rel=\"noopener\"\u003eGreat Big Beautiful Life\u003c/a\u003e –  5 stars\u003c/h3\u003e\n\u003cp\u003eEmily Henry can do no wrong in my book and this was another winner for me. Her writing is just SO incredibly relatable for me. This story follows two writers who have the chance to tell a tabloid star’s life story. Oh my gosh, this gave me Evelyn Hugo vibes which is probably my favorite book of all time. I LOVED the every character, the story is a bit drawn out but in the best way possible. The ending is good. The whole book is not as romancy as her others, but I didn’t even need that. I loved it.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://amzn.to/42YULGl\" target=\"_blank\" rel=\"noopener\"\u003eCash\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eThis is the first in a series but they don’t necessarily have to be read in order… though it does help because the ending is a little cliffhanger! These are like cowboy country spicy romance books, haha. I liked them and thought they were cute. Cash is about the oldest son and the daughter of the man who became a father figure to him. She inherits the ranch and it is a serious enemies to lovers trope, which I love.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://amzn.to/3EFUEYd\" target=\"_blank\" rel=\"noopener\"\u003eWyatt\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eThis is the second in the series and it’s just as cute. Wyatt is another one of the brothers and this is a friends to lovers trope. Equally as cute. He and his best friend who have always been in love with each other (but neither has known) agree to fake date. Lots of tropes in these books, ha! Still very spicy but you just need to be prepared going in. If you’re a Yellowstone fan you will like these.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://amzn.to/4lLPdYi\" target=\"_blank\" rel=\"noopener\"\u003eSawyer\u003c/a\u003e – 4 stars\u003c/h3\u003e\n\u003cp\u003eThe third book just came out last week! They are such quick fun reads. This one follows Sawyer who is a single dad and our trope in this book is single dad meets single mom. Very cute! Each one of the boys has an attitude of super grumpy, or super funny or the realistic one. The books are so predictable but I love how easy they are to read and the characters are all mostly great! Just finished it yesterday.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9781464250385\" target=\"_blank\" rel=\"noopener\"\u003eStory of My Life\u003c/a\u003e – 3 stars\u003c/h3\u003e\n\u003cp\u003eLucy Score started a new series set in Story Lake an this is book one. I have to say that at this start of this book, I was soooo turned off by the main character, who was in a downward spiral of life and just living very… gross. I had a hard time getting past it! But then it gets cute and she (a romance writer) buys an old house (without seeing it) and a family of brothers do the renovations. Sparks fly, of course. It’s a funny little town, sort of having a Stars Hollow Vibe! Another enemies to lovers trope.\u003c/p\u003e\n\u003ch3\u003e\u003ca href=\"https://bookshop.org/a/4747/9780063327603\" target=\"_blank\" rel=\"noopener\"\u003eCare and Feeding\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003eLoved this memoir even though it was hard to read at time. It was my favorite from March. The author worked with both Anthony Bourdain and Mario Batali and lived a very interesting life, albeit quite chaotic at times. She is a great writer and I laughed out loud many times!\u003c/p\u003e\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-01T10:45:28Z",
  "modifiedTime": null
}
