{
  "id": "8eb79ed3-d284-4895-9172-b80b9afeb2b6",
  "title": "I LOVE LISTS",
  "link": "https://api.follow.it/track-rss-story-click/v3/-dTIyyDzhoSC5KKE9qOVvmeU8fXU02LJ",
  "description": "I LOVE LISTS  It’s time to plant leeks and onions. How Oprah likes her eggs.  Some dark history facts if you’re into that sorta thing. One day I will make a pumpkin roll. Close-up photographer of the year.  Weather photographer of the year. My mom always ran into friends while traveling. What’s the swish \u0026 swipe cleaning method? I am obsessed with these dioramas!  You can pretend you live in Studio Ghibli world.  How to get stains out of tupperware.  One-legged comedian has fun with Halloween costumes. Time travel to Paris in the 1960s. So many food superstitions!  Clothesline illusions are playful. Sweater tunics! one / two / three  How to maximize your vacation days next year. Andrew Garfield talks about grief on Sesame Street.  Old Taco Bell items, ranked. I hope to finish this audiobook this weekend!  How’s your grief this season? Need a grief buddy? MC and I are here for you! Keep Grief Weird!  My currently workbooks are going to be in my shop soon! Stay tuned! Help me help you! Here are some deals!  Here’s 40% off your first Thrive Market order.  – I saved $450 last year!  Use my affiliate link to get a free month of Skillshare premium!  Want extra discounts and cashback on online purchases? I use Rakuten religiously!  The post I LOVE LISTS appeared first on Shutterbean.",
  "author": "",
  "published": "Fri, 01 Nov 2024 11:22:05 +0200",
  "source": "http://www.shutterbean.com/feed/",
  "categories": null,
  "byline": "",
  "length": 40,
  "excerpt": "Welcome to I LOVE LISTS. It's Friday and Tracy of Shutterbean.com shares her finds from the internet on a weekly list called I LOVE LISTS!",
  "siteName": "Shutterbean",
  "favicon": "https://www.shutterbean.com/wp-content/uploads/2017/07/cropped-logo-192x192.png",
  "text": "SEARCH THE ARCHIVES SEARCH THE ARCHIVES",
  "image": "https://www.shutterbean.com/wp-content/uploads/2024/10/antproblem.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003ch2\u003eSEARCH THE ARCHIVES\u003c/h2\u003e\t\t\u003cp\u003e\u003clabel for=\"archives-dropdown-2\"\u003eSEARCH THE ARCHIVES\u003c/label\u003e\n\t\t\n\n\t\t\t\n\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "Less than 1 min",
  "publishedTime": "2024-11-01T09:22:05Z",
  "modifiedTime": "2024-11-01T05:46:48Z"
}
