{
  "id": "9008efee-f7ee-4bfe-9a09-0fda47f2a183",
  "title": "Spicy Tempeh Crumble Bowl",
  "link": "https://www.101cookbooks.com/spicy-tempeh-crumble-bowl/",
  "description": "A riff on one of my favorite recipes in Andrea Nguyen's Vietnamese Food Any Day - a caramelized tempeh crumble. The sort of thing that immediately becomes the best component in your rice bowl. Continue reading Spicy Tempeh Crumble Bowl on 101 Cookbooks",
  "author": "Heidi Swanson",
  "published": "Wed, 27 Nov 2024 15:55:23 +0000",
  "source": "https://www.101cookbooks.com/feed",
  "categories": [
    "100+ Vegetarian Recipes",
    "260+ Vegan Recipes",
    "Dinner Ideas",
    "Gluten Free Recipes",
    "Main Course Recipes",
    "Spring edit",
    "Uncategorized",
    "Whole Food Plant-Based Diet Recipes",
    "Whole Grain Recipes"
  ],
  "byline": "Heidi Swanson",
  "length": 7153,
  "excerpt": "A riff on one of my favorite recipes in Andrea Nguyen's Vietnamese Food Any Day - a caramelized tempeh crumble. The sort of thing that immediately becomes the best component in your rice bowl.",
  "siteName": "101 Cookbooks",
  "favicon": "https://www.101cookbooks.com/wp-content/uploads/2018/05/cropped-101fav-1-192x192.png",
  "text": "101 Cookbooks logo Welcome! I'm Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and whole foods into your everyday meals. The recipes you 'll find here are vegetarian, often vegan, written with the home cook in mind. This site has been my online “home base” for nearly twenty years. It was initially built on the premise that when you own over 100 cookbooks (raises hand!), it is time to stop buying, and start cooking. This site chronicles a cookbook collection, one (vegetarian) recipe at a time. But there’s a bit more to the story now that we’re a couple decades in, here’s some backstory on both me \u0026 the site... I'm Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and whole foods into your everyday meals. The recipes you'll find here are vegetarian, often vegan, written with the home cook in mind. Read more about me \u0026 the site Membership Premium Ad-Free membership includes: Ad-free content Print-friendly recipes Spice / Herb / Flower / Zest recipe collection PDF Weeknight Express recipe collection PDF Surprise bonuses throughout the year Sign up here! My Books Today's recipe is a riff one of my favorites from Andrea Nguyen's most recent book, Vietnamese Food Any Day. It's a caramelized tempeh crumble, the sort of thing that immediately becomes the best component in your rice bowl. If you're on the fence about tempeh, this is the place to start. What is Tempeh? Tempeh is a fermented whole food, soy-based, and much loved in traditional Indonesian culture. To make tempeh, soybeans are soaked, partially cooked, combined with a starter, and then spread into a layer to allow fermentation to take place. A lot goes on at this stage, and you can read a more detailed play-by-play about tempeh production here. Soybean tempeh is most common, but other variations are also available. You also might see tempeh combined with other power ingredients like flax, or other grains. Andrea acknowledges that tempeh isn't a traditional Viet ingredient, but she uses it in banh mi, pho, and crumbles like this one to mimic meat, \"when crumbled into small pieces...tempeh absorbs the seasonings well and fries up nicely.\" Why Tempeh is such a Power Food Tempeh is widely considered a powerhouse ingredient because it is rich in a good range of nutrients. It also weighs in nicely on fiber, antioxidant, and protein fronts. Add to that the fermentation factor (basically, the fermentation helps with nutrient absorption, and digestibility) and you have a food that is working for you, not against. A lot of people like to substitute tempeh in place of something meaty. For example, this tempeh crumble might take the place of a pork crumble. Here's where you can find more tempeh recipes, and I also like this list of tempeh benefits on McKel's Nutrition Stripped Site. More tempeh in 2020! The Tempeh Crumble recipe In Andrea's version she uses 1/2 cup of chopped lemongrass. The lemongrass adds beautifully fragrant citrus notes, and is one of my favorite flavors. That said, the times I was in a hurry to make dinner, I found myself skipping out on the 1/2 cup of chopped lemongrass (the lemongrass in my yard is crazy tough) and repeatedly making this shortcut version. It uses serrano chiles and extra green onions - still really tasty, just quicker to throw together. Ways to Use the Tempeh Crumble Here (above) you see the tempeh crumble as a component in a rice bowl. The basic components are rice and the tempeh crumble plus what ever is on easy and on hand in the refrigerator or pantry. I grabbed peanuts, some garden lettuces, cucumber, pickled carrots, and avocado. A dollop of guacamole wouldn't be unwelcome. The crumble would also be great on these Vegan Nachos, in these Garlic Lime Lettuce Wraps, or in place of the tempeh in this Taco Salad. More Tempeh Recipes Orange Pan-glazed Tempeh TLT Sandwich (Tempeh Lettuce and Tomato Sandwich) all tempeh recipes 101 Cookbooks Membership Premium Ad-Free membership includes: -Ad-free content -Print-friendly recipes -Spice / Herb / Flower / Zest recipe collection PDF -Weeknight Express recipe collection PDF -Surprise bonuses throughout the year The tempeh crumbles are great as a component in a rice bowl, as pictured here. But don’t let that limit you! They’re also great in dumplings, on nachos, in banh mi, or as a component in a stir-fry. 1 tablespoon sugar 1 tablespoon sriracha 2 tablespoons tamari or soy sauce 3 tablespoons extra-virgin olive oil 2 medium serrano chiles, seeded and chopped 8 green onions, thinly sliced including green parts 8 ounces tempeh, crumbled 3 cloves well-chopped garlic 1 tablespoon toasted sesame seeds To serve: (any / all) cooked whole grain rice, lettuces, chopped cucumber, pickled carrots, avocado, plus more sriracha \u0026 tamari (to taste) In a small bowl combine the sugar, sriracha, tamari, and 1/4 cup water. Set aside. In a large skillet over medium-high heat, warm the olive oil. Stir in the chiles and half of the green onions and cook, stirring regularly, until softened, a few minutes. Stir in the tempeh and sriracha seasoning liquid, and allow the mixture to bubble and fry for about ten minutes. Press on the tempeh to break it up into smaller pieces, to maximize surface area for browning and crisping. Give the occasional stir, and re-spread across the bottom of the pan so as much mixture has contact with the pan as possible. Toward the end of the ten minutes, stir in the garlic, and cook for another minute or two. Remove from heat and stir in the sesame seeds and the remaining green onions. Serve warm or at room temperature over rice with any of the suggested toppings. Tempeh crumbles will keep, refrigerated, for a few days.",
  "image": "https://images.101cookbooks.com/TEMPEH-CRUMBLE-BOWL-3.jpg?w=620\u0026auto=format",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\u003cnav\u003e\n  \n\n  \u003cp id=\"logo\"\u003e\u003ca href=\"https://www.101cookbooks.com/\" rel=\"home\" title=\"101 Cookbooks\"\u003e\u003csvg viewBox=\"68.5 85.8 383 45.7\" xmlns=\"https://www.w3.org/2000/svg\"\u003e\u003ctitle\u003e101 Cookbooks logo\u003c/title\u003e\u003cpath d=\"M76.4 100.3c0-2.4 0-5.3-.1-8.6l5.2-1.3c-.2 7.9-.3 14.8-.3 20.7 0 4.4 0 9 .3 13.9h-5.4c.2-5.3.3-13.6.3-24.7zM90.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.3 0 5.8-1.2 6.6-2.4zM130 100.3c0-2.4 0-5.3-.1-8.6l5.2-1.3c-.2 7.9-.3 14.8-.3 20.7 0 4.4 0 9 .3 13.9h-5.4c.2-5.3.3-13.6.3-24.7zM188.7 120.1c-4.8 3.4-7.5 5.9-11.3 5.9-9.4 0-15.3-6.3-15.3-16 0-6.5 2.8-11.9 8.1-15.6 3.5-2.5 6.4-3.9 10-3.9 2.7 0 5.3.8 7.6 2.3l-3.4 4.1c-2.4-1.5-4.8-2.2-7.8-2.2-3.2 0-5.6.8-6.4 1.4-2.4 2-4.1 6-4.1 10.7 0 8.6 5.9 14.7 14.5 14.7 2.8 0 5.2-.8 7.3-2.3l.8.9zM193 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.3 0 5.8-1.2 6.6-2.4zM230 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.3 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM268.8 108.2c0-6 0-11.7-.3-17l5.8-.2c-.2 5.3-.3 11.1-.3 17.3l9-12c1.4-1.9 2.7-3.6 3.6-5l4-.2-12.5 15.9 13.2 16.4-5.1 2.6c-3-4.2-5.1-7.1-6.3-8.6l-5.8-7.2h-.2c0 4.3.1 9.3.3 14.9l-5.8.2c.4-5.4.4-11.1.4-17.1zM298 108.2c0-6-.1-11.7-.3-17 5.3-.1 8.4-.2 9.1-.2 3.7 0 6.2.3 7.8 1.2 2.3 1.4 3.5 3.6 3.5 6 0 3.7-2.3 6.8-6.9 8.9 5 1.2 7.6 4.2 7.6 8.1 0 5.7-5 9.9-13.1 9.9-.6 0-3.3-.2-8-.2.2-5.1.3-10.7.3-16.7zm7.9-1.8c1.1 0 2.3.1 3.6.4 2.4-1.6 3.7-3.8 3.7-6.4 0-4.1-2.8-6.5-7.9-6.5-.8 0-1.6 0-2.4.1v14.8l3-2.4zm2.6 16.9c.4 0 .8 0 1.3-.1 2.4-1.6 3.6-3.9 3.6-6.7 0-4.3-3.6-7.1-10-7.1h-.6v12.8c2.6.7 4.5 1.1 5.7 1.1zM325.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.2 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM362.1 110.2c0-7 2.4-11.7 8-16.2 2.9-2.4 5.8-3.6 8.9-3.6 3.2 0 6.1 1.1 8.3 2.9 3.7 3.2 5.9 8 5.9 13.5 0 5.3-2.1 10-5.8 13.4-3.8 3.6-7.2 5.7-11.1 5.7-8.2 0-14.2-6.2-14.2-15.7zm24.2 9c1.3-2.3 2.1-5.3 2.1-8.7 0-9.6-5.2-15.6-12.9-15.6-3.4 0-6 1.1-6.7 2.3-1.4 2.1-2.5 5.9-2.5 9.8 0 8.5 5.9 14.6 13.4 14.6 3.4 0 5.9-1.2 6.6-2.4zM400.9 108.2c0-6 0-11.7-.3-17l5.8-.2c-.2 5.3-.3 11.1-.3 17.3l9-12c1.4-1.9 2.7-3.6 3.6-5l4-.2-12.5 15.9 13.2 16.4-5.1 2.6c-3-4.2-5.1-7.1-6.3-8.6l-5.8-7.2h-.2c0 4.3.1 9.3.3 14.9l-5.8.2c.3-5.4.4-11.1.4-17.1zM433 118c1.7 2.9 3.6 4.2 6.5 4.2.5 0 1 0 1.4-.1.8-1.3 1.2-2.9 1.2-4.8 0-3.6-1.8-4.8-5.5-6.6-1.8-.8-3.7-1.5-5.4-3.2-1.5-1.5-2.2-3.5-2.2-5.8 0-3.5 1.5-6.5 4.7-9.2 1.5-1.2 3.9-2.2 6.1-2.2 2.5 0 4.8 1.4 6.4 4.2l-4.2 2.9c-1.7-2.4-3.6-3.6-6-3.6-.6 0-1.3.1-2.2.3-.9 1-1.3 2.4-1.3 4.2 0 2.4 1.6 4.7 4.5 6.2 2.5 1.3 4.7 2.1 6 3.2 1.9 1.6 2.9 3.7 2.9 6.2 0 3.6-1.4 6.7-4.2 9.1-2 1.8-4.6 2.8-6.7 2.8-2.8 0-5.2-1.7-6.7-5l4.7-2.8z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/a\u003e\u003c/p\u003e\n  \n  \u003cdiv id=\"navbarcollapse\"\u003e\n\n\n\n   \n\n\n\n\n\n \u003cdiv\u003e\n    \u003cp\u003e\u003cimg src=\"https://images.101cookbooks.com/heidi-swanson-kitchen-polly.jpg?w=580\u0026amp;auto=compress\u0026amp;auto=format\" alt=\"Heidi Swanson in the kitchen\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\n    \u003c/p\u003e\n    \u003cdiv\u003e\n      \u003ch4\u003eWelcome!\u003c/h4\u003e\n      \u003cp\u003eI\u0026#39;m Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and\n        whole foods into your everyday meals. The recipes you\t\u0026#39;ll find here are vegetarian, often vegan, written with\n        the home cook in mind. This site has been my online “home base” for nearly twenty years. It was initially built on the premise that when you own over 100 cookbooks (raises hand!), it is time to stop buying, and start cooking. This site chronicles a cookbook collection, one (vegetarian) recipe at a time. But there’s a bit more to the story now that we’re a couple decades in, \u003ca href=\"https://www.101cookbooks.com/about/\"\u003ehere’s some backstory on both me \u0026amp; the site...\u003c/a\u003e\n      \u003c/p\u003e\n      \u003cp\u003eI\u0026#39;m Heidi – This site celebrates cooking, and aspires to help you integrate the power of lots of vegetables and\n        whole foods into your everyday meals. The recipes you\u0026#39;ll find here are vegetarian, often vegan, written with\n        the home cook in mind. \u003cspan\u003e \u003ca href=\"https://www.101cookbooks.com/about/\"\u003eRead more about me \u0026amp; the site\u003c/a\u003e\u003c/span\u003e\n      \u003c/p\u003e\n    \u003c/div\u003e\n  \u003c/div\u003e\n\n\n\n \u003cdiv\u003e\n\n\u003cdiv\u003e\n  \u003ch4\u003eMembership\u003c/h4\u003e\n  \u003cp\u003ePremium Ad-Free membership includes:\u003c/p\u003e\n  \u003cul\u003e\n    \u003cli\u003eAd-free content\u003c/li\u003e\n    \u003cli\u003e Print-friendly recipes\u003c/li\u003e\n    \u003cli\u003e Spice / Herb / Flower / Zest recipe collection PDF\u003c/li\u003e\n    \u003cli\u003e Weeknight Express recipe collection PDF\u003c/li\u003e\n    \u003cli\u003e Surprise bonuses throughout the year\u003c/li\u003e\n  \u003c/ul\u003e\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003eSign up here!\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\n\u003cdiv aria-label=\"membership book covers\"\u003e\n\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/spice-herb-flower-cover-lg.png?w=220\u0026amp;auto=format\" alt=\"Spice PDF cover\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n  \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/weeknight-express-cover-lg.png?w=220\u0026amp;auto=format\" alt=\"Weeknight Express PDF book cover\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\n\n\n\u003c/div\u003e\n\n\n \u003cdiv\u003e\n   \u003ch4\u003eMy Books\u003c/h4\u003e\n   \n \u003c/div\u003e\n\n\n  \u003c/div\u003e\n  \n  \u003c/nav\u003e\n  \u003csection id=\"primaryrow\"\u003e\n \n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n    \n\u003carticle id=\"post-9138\"\u003e\n\n\t\t\t\t\n\t\n\t\u003cdiv data-swiftype-name=\"body\" data-swiftype-type=\"text\"\u003e\n\u003cp\u003eToday\u0026#39;s recipe is a riff one of my favorites from \u003ca href=\"https://www.vietworldkitchen.com/\"\u003eAndrea Nguyen\u0026#39;s\u003c/a\u003e most recent book, \u003ca href=\"https://amzn.to/2vA3X7X\"\u003e\u003cem\u003eVietnamese Food Any Day\u003c/em\u003e\u003c/a\u003e. It\u0026#39;s a caramelized tempeh crumble, the sort of thing that immediately becomes the best component in your rice bowl. If you\u0026#39;re on the fence about tempeh, this is the place to start.\u003cbr/\u003e\u003cimg src=\"https://images.101cookbooks.com/TEMPEH-CRUMBLE-BOWL-3.jpg?w=620\u0026amp;auto=format\" alt=\"Spicy Tempeh Crumble Bowl\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/p\u003e\n\u003ch2\u003eWhat is Tempeh?\u003c/h2\u003e\n\u003cp\u003eTempeh is a fermented whole food, soy-based, and much loved in traditional Indonesian culture. To make tempeh, soybeans are soaked, partially cooked, combined with a starter, and then spread into a layer to allow fermentation to take place. A lot goes on at this stage, and you can read a more detailed play-by-play about tempeh production \u003ca href=\"https://en.wikipedia.org/wiki/Tempeh\"\u003ehere\u003c/a\u003e. Soybean tempeh is most common, but other variations are also available. You also might see tempeh combined with other power ingredients like flax, or other grains.\u003c/p\u003e\n\u003cp\u003eAndrea acknowledges that tempeh isn\u0026#39;t a traditional Viet ingredient, but she uses it in banh mi, pho, and crumbles like this one to mimic meat, \u0026#34;when crumbled into small pieces...tempeh absorbs the seasonings well and fries up nicely.\u0026#34; \u003cbr/\u003e\u003cimg src=\"https://images.101cookbooks.com/TEMPEH-CRUMBLE-BOWL-1.jpg?w=620\u0026amp;auto=format\" alt=\"Spicy Tempeh Crumble Bowl\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/p\u003e\n\u003ch2\u003eWhy Tempeh is such a Power Food\u003c/h2\u003e\n\u003cp\u003eTempeh is widely considered a powerhouse ingredient because it is rich in a good range of nutrients. It also weighs in nicely on fiber, antioxidant, and protein fronts. Add to that the fermentation factor (basically, the fermentation helps with nutrient absorption, and digestibility) and you have a food that is working for you, not against. A lot of people like to substitute tempeh in place of something meaty. For example, this tempeh crumble might take the place of a pork crumble. Here\u0026#39;s where you can find more \u003ca href=\"https://www.101cookbooks.com/ingredient/tempeh\"\u003etempeh recipes\u003c/a\u003e, and I also like this list of \u003ca href=\"https://nutritionstripped.com/tempeh-benefits/\"\u003etempeh benefits\u003c/a\u003e on McKel\u0026#39;s \u003cem\u003eNutrition Stripped\u003c/em\u003e Site. More tempeh in 2020!\u003c/p\u003e\n\u003ch2\u003eThe Tempeh Crumble recipe\u003c/h2\u003e\n\u003cp\u003eIn Andrea\u0026#39;s version she uses 1/2 cup of chopped lemongrass. The lemongrass adds beautifully fragrant citrus notes, and is one of my favorite flavors. That said, the times I was in a hurry to make dinner, I found myself skipping out on the 1/2 cup of chopped lemongrass (the lemongrass in my yard is crazy tough) and repeatedly making this shortcut version. It uses serrano chiles and extra green onions - still really tasty, just quicker to throw together.\u003cbr/\u003e\u003cimg src=\"https://images.101cookbooks.com/TEMPEH-CRUMBLE-BOWL-2.jpg?w=620\u0026amp;auto=format\" alt=\"Spicy Tempeh Crumble Bowl\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/p\u003e\n\u003ch2\u003eWays to Use the Tempeh Crumble\u003c/h2\u003e\n\u003cp\u003eHere (above) you see the tempeh crumble as a component in a rice bowl. The basic components are rice and the tempeh crumble plus what ever is on easy and on hand in the refrigerator or pantry. I grabbed peanuts, some garden lettuces, cucumber, pickled carrots, and avocado. A dollop of \u003ca href=\"https://www.101cookbooks.com/guacamole/\"\u003eguacamole\u003c/a\u003e wouldn\u0026#39;t be unwelcome. The crumble would also be great on these \u003ca href=\"https://www.101cookbooks.com/ultimate-vegan-nachos-recipe/\"\u003eVegan Nachos\u003c/a\u003e, in these \u003ca href=\"https://www.101cookbooks.com/garlic-lime-lettuce-wraps/\"\u003eGarlic Lime Lettuce Wraps\u003c/a\u003e, or in place of the tempeh in this \u003ca href=\"https://www.101cookbooks.com/taco-salad/\"\u003eTaco Salad\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eMore Tempeh Recipes\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.101cookbooks.com/panglazed-tempeh-recipe/\"\u003eOrange Pan-glazed Tempeh\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.101cookbooks.com/tlt-sandwich/\"\u003eTLT Sandwich\u003c/a\u003e (Tempeh Lettuce and Tomato Sandwich)\u003c/li\u003e\n\u003cli\u003eall \u003ca href=\"https://www.101cookbooks.com/ingredient/tempeh\"\u003etempeh recipes\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n               \n         \u003cdiv\u003e\n           \n        \u003cdiv\u003e\n                  \u003cp\u003e101 Cookbooks Membership\u003c/p\u003e\n        \n                  \u003cdiv\u003e\n                      \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e \u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1\"\u003e \u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\n                          \n                          \u003c/p\u003e\n        \n                      \u003cp\u003ePremium Ad-Free membership includes: \u003cbr/\u003e\n                          -Ad-free content \u003cbr/\u003e\n                          -Print-friendly recipes \u003cbr/\u003e\n                          -\u003ci\u003eSpice / Herb / Flower / Zest \u003c/i\u003e recipe collection PDF\u003cbr/\u003e\n                          -\u003ci\u003eWeeknight Express\u003c/i\u003e recipe collection PDF  \u003cbr/\u003e\n                          -Surprise bonuses throughout the year \u003cbr/\u003e\n                              \u003c/p\u003e\n                  \u003c/div\u003e\n              \u003c/div\u003e\n\n        \u003cdiv\u003e  \n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/SPICE-HERB-COVER-100.png\" alt=\"spice herb flower zest\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n             \u003cp\u003e\u003ca href=\"https://www.101cookbooks.com/membership-account/membership-checkout.html?level=1#pmpro_level_cost\"\u003e\u003cimg src=\"https://images.101cookbooks.com/WEEKNIGHT-EXPRESS-V2.100.png\" alt=\"weeknight express\" nopin=\"nopin\" width=\"100\" height=\"141\" loading=\"lazy\" fetchpriority=\"low\"/\u003e\u003c/a\u003e\u003c/p\u003e\n        \u003c/div\u003e\n                \u003c/div\u003e\n                \t\u003c/div\u003e\n\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\u003cdiv id=\"recipe\" data-recipe-id=\"9146\" data-servings=\"4\"\u003e\n\t\n\t\n\n\u003cp\u003eThe tempeh crumbles are great as a component in a rice bowl, as pictured here. But don’t let that limit you! They’re also great in dumplings, on nachos, in banh mi, or as a component in a stir-fry.\u003c/p\u003e\n\t\t\n\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003cul\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoon\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003esugar\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoon\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003esriracha\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etamari or soy sauce\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e3\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoons\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eextra-virgin olive oil\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e2\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003emedium serrano chiles, seeded and chopped\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e8\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003egreen onions, thinly sliced including green parts\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e8\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eounces\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etempeh, crumbled\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e3\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ecloves\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003ewell-chopped garlic\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003e1\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etablespoon\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cspan\u003etoasted sesame seeds\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cspan\u003eTo serve: (any / all) cooked whole grain rice, lettuces, chopped cucumber, pickled carrots, avocado, plus more sriracha \u0026amp; tamari (to taste)\u003c/span\u003e\n\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\u003col\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn a small bowl combine the sugar, sriracha, tamari, and 1/4 cup water. Set aside.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn a large skillet over medium-high heat, warm the olive oil. Stir in the chiles and half of the green onions and cook, stirring regularly, until softened, a few minutes. Stir in the tempeh and sriracha seasoning liquid, and allow the mixture to bubble and fry for about ten minutes. Press on the tempeh to break it up into smaller pieces, to maximize surface area for browning and crisping. Give the occasional stir, and re-spread across the bottom of the pan so as much mixture has contact with the pan as possible.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eToward the end of the ten minutes, stir in the garlic, and cook for another minute or two. Remove from heat and stir in the sesame seeds and the remaining green onions.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\t\u003cli\u003e\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003eServe warm or at room temperature over rice with any of the suggested toppings. Tempeh crumbles will keep, refrigerated, for a few days.\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/li\u003e\n\t\t\t\t\t\t\t\u003c/ol\u003e\n\t\t\u003c/div\u003e\n\t\n\t\t\n\t\t\n\t\n\t\n\u003c/div\u003e\u003c/article\u003e\n\n\n\u003c/main\u003e\n  \u003c/section\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-27T15:55:23Z",
  "modifiedTime": "2024-11-27T15:56:44Z"
}
