{
  "id": "02c15686-f003-4af8-bf38-edc634cf8e71",
  "title": "Dream Honeymoons to Italy",
  "link": "https://www.livelifetravel.world/dream-honeymoons-italy/",
  "description": "The post Dream Honeymoons to Italy appeared first on Live Life Travel.",
  "author": "Anne Gordon",
  "published": "Tue, 05 Feb 2019 02:10:27 +0000",
  "source": "https://www.livelifetravel.world/feed/",
  "categories": [
    "Press"
  ],
  "byline": "Anne Gordon",
  "length": 7433,
  "excerpt": "While we do not subscribe to the ‘one size fits all’ theory for any vacation, that especially goes for honeymoons! However, we do have our very favorite Amalfi Coast and Sicily towns as well as the “Best of The Best” hotel and excursion recommendations that should be on the top of everyone’s list when planning their Italian getaway.",
  "siteName": "Live Life Travel",
  "favicon": "https://www.livelifetravel.world/wp-content/uploads/2018/03/cropped-Live-Life-Travel_Logo-192x192.png",
  "text": "While we do not subscribe to the ‘one size fits all’ theory for any vacation, that especially goes for honeymoons! However, we do have our very favorite Amalfi Coast and Sicily towns as well as the “Best of The Best” hotel and excursion recommendations that should be on the top of everyone’s list when planning their Italian getaway.Amalfi Coast – SORRENTO is the northern most town on the Amalfi Coast and a great choice if you can only pick one town to visit during your stay on The Amalfi Coast as it serves as a great “home base” if you are unable to take an extended honeymoon. Day trips and excursions are easy from Sorrento including visiting the other coastal cliffside towns, spending a day on the water, taking the ferry over to Capri or even touring the ruins of Pompeii. Sorrento sits upon a cliff and faces the Bay of Naples with stunning views of Mount Vesuvius. There is a town square, Piazza Tasso that is lined with cafes, restaurants and shops along with narrow alleys with lots of hidden gems to be discovered.Grand Hotel Excelsior Vittoria – Sorrento, ItalyBest of The Best Sorrento Hotel – Grand Hotel Excelsior Vittoria* One of the most iconic hotels of Italy and it is still owned and managed by the same family (and they live there!). Established in 1834, the hotel was built on the same property where Emperor Augustus had his private villa, so it is possible to see ancient Roman ruins across the five-acre private gardens which is also a paradise of orange, lemon and olive trees, all local staples of the coast. Original antiques, unique rooms, amazing views, a central location, stunning pool, a few restaurants and bars (one Michelin starred) all make this hotel an extremely special place on the Amalfi Coast.Best of The Best Sorrento Excursion The Lemon Farm Tour is our favorite, hands down. This half day tour is nothing short of spectacular as you have the opportunity to meet 3 unique Sorrento families and not only learn/watch them do their trade, but also taste/eat/drink/enjoy the results. It is not only delicious, but a very authentic experience and a lot of fun. From the lemon farm with limoncello, lemonade and olive oil to the cheese factory (amazing) and then off to pizza making with the “pizza man.”POSITANO is a village located south of Sorrento and is magically set within a steep cliff lined with narrow streets with a pebble beach along its coastline. Positano is the place to be and be seen and is usually very crowded during high season. There are a lot of great hotels, shopping, boutiques, cafes and bars, the most popular being ‘Music on the Rocks.’John Steinbeck is quoted as saying “Positano bites deep. It is a dream place that isn’t quite real when you are there and becomes beckoningly real after you have gone.” Harper’s Bazaar 1953Best of the Best Positano Hotel – Le Sirenuse* Le Sirenuse opened in 1951, when four Neapolitan brothers turned their summer house in to a charming hotel overlooking the bay of Positano. Today, the 58-room boutique hotel is considered one of Italy’s best, yet it still retains the intimate and personal feel of a private home.We recommend enjoying the luxury spa, heated pool along with evening cocktails and great views at the romantic Champagne \u0026 Oyster Bar and then top the day off with dinner at Michelin starred restaurant, La Sponda. This infamous restaurant, which also boasts gorgeous sea views, is illuminated in the evening by four hundred candles that create an unforgettable atmosphere, especially for honeymooners.Palazzo Avivo – Ravello, ItalyFor those traveling in May and October, you can look forward to somewhat cooler temperatures and fewer crowds. During high season (June through September), we recommend Positano for those couples who want to be in the mix of fun and sun as it becomes a very lively town (sometimes crowded) and very hot during the days. A great pool is essential.And for those who book Le Sirenuse* with Live Life Travel (3 nights or more) in a Junior Suite or Suite, will receive a complimentary evening sunset cruise with bubbly during your stay. One of our favorite things to do, so an incredible deal.Best of the Best Positano Excursion Full Day Private Yacht Charter (and regardless of the wait time, the Blue Grotto is a MUST SEE)RAVELLO is set 365 meters above the Sea by Italy’s Amalfi Coast and home to iconic cliffside gardens, unbeatable views along with a quaint and historic Italian village.Best of the Best Ravello Hotels Belmond Hotel Caruso* was formerly an 11th-century palace. Our absolute favorite part of this hotel is the (almost unbelievable) infinity pool that boasts some of the best views in the world. You will also enjoy complimentary boat rides as part of your stay here. This pool is UNREAL!The truly something unique and special here for honeymooners is the “Infinity Dream Dinner,” which is a private candlelight dinner under the stars while floating on the hotel’s infinity pool, all with a private butler.Palazzo Avino* was built in what was once a 12th century private villa for an Italian noble family, then opened as a hotel in 1997. What makes this resort unique and a favorite of ours is their ‘Clubhouse by the Sea,’ which is located in Marmorata, a short 15-minute drive from Ravello (via complimentary shuttle starting at 930am daily). All hotel guests can enjoy the beach platforms directly on the sea along with a pool, restaurant and lounge chair service. Open May through October. Best of both worlds.As for excursions in Ravello, there is really no reason to leave the sanctuaries that are those two hotels. They are destinations in and of themselves. Of course, go into Ravello town and possibly do a walking tour, enjoy the shops and restaurants, but other than that, enjoy the view!TAORMINA, SICILY is a hilltop town on the east coast of Sicily. Sicily deserves a dedicated trip to see the entire island (we consider it one of the world’s best kept secrets), but if you want just a small taste (and you do), we recommend Taormina. Enjoy some best cannoli’s (we love Roberto’s) and cuisine of your life while strolling along the Corso Umberto.Best of the Best Taormina Hotel – Belmond Grand Hotel Timeo* The first hotel to be built in the city; you will enjoy views of the coast along with the beautiful Mount Etna. It is a Sicilian hideaway in the heart of town that fuels the imagination. Our favorite and most unique part of this hotel is its central location to town and the Greek Theatre (a must see). This resort also offers complimentary shuttle service to its sister hotel’s private beach at the Belmond Villa Sant’Andrea, the other “best” hotel in Taormina. You truly cannot go wrong with this choice since you get them both.Best of the Best Taormina Excursion – Mount Etna Plan for a full day guided tour of this incredible volcano. Venture to the summit, enjoy wine tasting (fun fact: some of the best wine is produced in volcanic soil). Pack a warm jacket, it’s cold up there, but you will literally feel like you are on another planet, it is one of the best experiences we can recommend. Definitely do the helicopter transfers if you can to get the absolute best views as well as maximizing your time on Etna.*Virtuoso property – All Virtuoso properties booked through Live Life Travel will receive VIP amenities that are not available online; contact for specificsTo start planning your honeymoon today, email anne@livelifetravel.world",
  "image": "https://www.livelifetravel.world/wp-content/uploads/2019/02/Live-Life-Travel-Dream-Honeymoon-Italy.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eWhile we do not subscribe to the ‘one size fits all’ theory for any vacation, that especially goes for honeymoons! However, we do have our very favorite Amalfi Coast and Sicily towns as well as the “Best of The Best” hotel and excursion recommendations that should be on the top of everyone’s list when planning their Italian getaway.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAmalfi Coast – \u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eSORRENTO\u003c/strong\u003e is the northern most town on the Amalfi Coast and a great choice if you can only pick one town to visit during your stay on The Amalfi Coast as it serves as a great “home base” if you are unable to take an extended honeymoon. Day trips and excursions are easy from Sorrento including visiting the other coastal cliffside towns, spending a day on the water, taking the ferry over to Capri or even touring the ruins of Pompeii. Sorrento sits upon a cliff and faces the Bay of Naples with stunning views of Mount Vesuvius. There is a town square, Piazza Tasso that is lined with cafes, restaurants and shops along with narrow alleys with lots of hidden gems to be discovered.\u003c/p\u003e\u003cfigure id=\"attachment_2634\" aria-describedby=\"caption-attachment-2634\"\u003e\u003ca href=\"http://www.staging2.livelifetravel.world/wp-content/uploads/2019/02/GRAND-HOTEL-EXCELSIOR-VITTORIA-SORRENTO-AURORA-SUITE.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"http://www.staging2.livelifetravel.world/wp-content/uploads/2019/02/GRAND-HOTEL-EXCELSIOR-VITTORIA-SORRENTO-AURORA-SUITE.jpg\" alt=\"Live Life Travel specializes in dream honeymoon packages\" width=\"400\" height=\"461\" srcset=\"https://www.livelifetravel.world/wp-content/uploads/2019/02/GRAND-HOTEL-EXCELSIOR-VITTORIA-SORRENTO-AURORA-SUITE.jpg 400w, https://www.livelifetravel.world/wp-content/uploads/2019/02/GRAND-HOTEL-EXCELSIOR-VITTORIA-SORRENTO-AURORA-SUITE-260x300.jpg 260w\" sizes=\"(max-width: 400px) 100vw, 400px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2634\"\u003eGrand Hotel Excelsior Vittoria – Sorrento, Italy\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eBest of The Best Sorrento Hotel – Grand Hotel Excelsior Vittoria*\u003cbr/\u003e\n\u003c/strong\u003eOne of the most iconic hotels of Italy and it is still owned and managed by the same family (and they live there!). Established in 1834, the hotel was built on the same property where Emperor Augustus had his private villa, so it is possible to see ancient Roman ruins across the five-acre private gardens which is also a paradise of orange, lemon and olive trees, all local staples of the coast. Original antiques, unique rooms, amazing views, a central location, stunning pool, a few restaurants and bars (one Michelin starred) all make this hotel an extremely special place on the Amalfi Coast.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of The Best Sorrento Excursion\u003cbr/\u003e\n\u003c/strong\u003eThe Lemon Farm Tour is our favorite, hands down. This half day tour is nothing short of spectacular as you have the opportunity to meet 3 unique Sorrento families and not only learn/watch them do their trade, but also taste/eat/drink/enjoy the results. It is not only delicious, but a very authentic experience and a lot of fun. From the lemon farm with limoncello, lemonade and olive oil to the cheese factory (amazing) and then off to pizza making with the “pizza man.”\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePOSITANO \u003c/strong\u003eis a village located south of Sorrento and is magically set within a steep cliff lined with narrow streets with a pebble beach along its coastline. Positano is the place to be and be seen and is usually very crowded during high season. There are a lot of great hotels, shopping, boutiques, cafes and bars, the most popular being ‘Music on the Rocks.’\u003c/p\u003e\u003cp\u003eJohn Steinbeck is quoted as saying “Positano bites deep. It is a dream place that isn’t quite real when you are there and becomes beckoningly real after you have gone.” Harper’s Bazaar 1953\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of the Best Positano Hotel\u003c/strong\u003e – \u003cstrong\u003eLe Sirenuse*\u003cbr/\u003e\n\u003c/strong\u003eLe Sirenuse opened in 1951, when four Neapolitan brothers turned their summer house in to a charming hotel overlooking the bay of Positano. Today, the 58-room boutique hotel is considered one of Italy’s best, yet it still retains the intimate and personal feel of a private home.\u003c/p\u003e\u003cp\u003eWe recommend enjoying the luxury spa, heated pool along with evening cocktails and great views at the romantic Champagne \u0026amp; Oyster Bar and then top the day off with dinner at Michelin starred restaurant, La Sponda. This infamous restaurant, which also boasts gorgeous sea views, is illuminated in the evening by four hundred candles that create an unforgettable atmosphere, especially for honeymooners.\u003c/p\u003e\u003cfigure id=\"attachment_2635\" aria-describedby=\"caption-attachment-2635\"\u003e\u003ca href=\"http://www.staging2.livelifetravel.world/wp-content/uploads/2019/02/PALAZZO-AVIVO-RAVELLO-LOUNGES-BY-THE-POOL-WITH-A-VIEW.jpg\"\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"http://www.staging2.livelifetravel.world/wp-content/uploads/2019/02/PALAZZO-AVIVO-RAVELLO-LOUNGES-BY-THE-POOL-WITH-A-VIEW.jpg\" alt=\"Dream honeymoons by Live Life Travel\" width=\"600\" height=\"400\" srcset=\"https://www.livelifetravel.world/wp-content/uploads/2019/02/PALAZZO-AVIVO-RAVELLO-LOUNGES-BY-THE-POOL-WITH-A-VIEW.jpg 600w, https://www.livelifetravel.world/wp-content/uploads/2019/02/PALAZZO-AVIVO-RAVELLO-LOUNGES-BY-THE-POOL-WITH-A-VIEW-300x200.jpg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2635\"\u003ePalazzo Avivo – Ravello, Italy\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eFor those traveling in May and October, you can look forward to somewhat cooler temperatures and fewer crowds. During high season (June through September), we recommend Positano for those couples who want to be in the mix of fun and sun as it becomes a very lively town (sometimes crowded) and very hot during the days. A great pool is essential.\u003c/p\u003e\u003cp\u003eAnd for those who book Le Sirenuse* with Live Life Travel (3 nights or more) in a Junior Suite or Suite, will receive a complimentary evening sunset cruise with bubbly during your stay. One of our favorite things to do, so an incredible deal.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of the Best Positano Excursion\u003cbr/\u003e\n\u003c/strong\u003eFull Day Private Yacht Charter (and regardless of the wait time, the Blue Grotto is a MUST SEE)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRAVELLO \u003c/strong\u003eis set 365 meters above the Sea by Italy’s Amalfi Coast and home to iconic cliffside gardens, unbeatable views along with a quaint and historic Italian village.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of the Best Ravello Hotels\u003cbr/\u003e\n\u003c/strong\u003e\u003cstrong\u003eBelmond Hotel Caruso\u003c/strong\u003e* was formerly an 11th-century palace. Our absolute favorite part of this hotel is the (almost unbelievable) infinity pool that boasts some of the best views in the world. You will also enjoy complimentary boat rides as part of your stay here. This pool is UNREAL!\u003c/p\u003e\u003cp\u003eThe truly something unique and special here for honeymooners is the “Infinity Dream Dinner,” which is a private candlelight dinner under the stars while floating on the hotel’s infinity pool, all with a private butler.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePalazzo Avino*\u003c/strong\u003e was built in what was once a 12\u003csup\u003eth\u003c/sup\u003e century private villa for an Italian noble family, then opened as a hotel in 1997. What makes this resort unique and a favorite of ours is their ‘Clubhouse by the Sea,’ which is located in Marmorata, a short 15-minute drive from Ravello (via complimentary shuttle starting at 930am daily). All hotel guests can enjoy the beach platforms directly on the sea along with a pool, restaurant and lounge chair service. Open May through October. Best of both worlds.\u003c/p\u003e\u003cp\u003eAs for excursions in Ravello, there is really no reason to leave the sanctuaries that are those two hotels. They are destinations in and of themselves. Of course, go into Ravello town and possibly do a walking tour, enjoy the shops and restaurants, but other than that, enjoy the view!\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTAORMINA, SICILY \u003c/strong\u003eis a hilltop town on the east coast of Sicily. Sicily deserves a dedicated trip to see the entire island (we consider it one of the world’s best kept secrets), but if you want just a small taste (and you do), we recommend Taormina. Enjoy some best cannoli’s (we love Roberto’s) and cuisine of your life while strolling along the Corso Umberto.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of the Best Taormina Hotel\u003c/strong\u003e – \u003cstrong\u003eBelmond Grand Hotel Timeo*\u003cbr/\u003e\n\u003c/strong\u003eThe first hotel to be built in the city; you will enjoy views of the coast along with the beautiful Mount Etna. It is a Sicilian hideaway in the heart of town that fuels the imagination. Our favorite and most unique part of this hotel is its central location to town and the Greek Theatre (a must see). This resort also offers complimentary shuttle service to its sister hotel’s private beach at the Belmond Villa Sant’Andrea, the other “best” hotel in Taormina. You truly cannot go wrong with this choice since you get them both.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBest of the Best Taormina Excursion – Mount Etna\u003cbr/\u003e\n\u003c/strong\u003ePlan for a full day guided tour of this incredible volcano. Venture to the summit, enjoy wine tasting (fun fact: some of the best wine is produced in volcanic soil). Pack a warm jacket, it’s cold up there, but you will literally feel like you are on another planet, it is one of the best experiences we can recommend. Definitely do the helicopter transfers if you can to get the absolute best views as well as maximizing your time on Etna.\u003c/p\u003e\u003cp\u003e*Virtuoso property – All Virtuoso properties booked through Live Life Travel will receive VIP amenities that are not available online; contact for specifics\u003c/p\u003e\u003cp\u003eTo start planning your honeymoon today, email \u003ca href=\"mailto:anne@livelifetravel.world\"\u003eanne@livelifetravel.world\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2019-02-05T02:10:27Z",
  "modifiedTime": "2019-02-08T18:12:51Z"
}
