{
  "id": "413ca633-b231-4cf3-aed9-679cffd147e3",
  "title": "This Is the Most Detailed Map of Antarctica Ever Made",
  "link": "https://www.atlasobscura.com/articles/antarctica-without-ice-map",
  "description": "If you had to, how would you remove 6.5 million cubic miles of ice from Antarctica? In truth, you have two options: On one hand, you could dramatically accelerate the warming of the world to turn Earth’s southernmost continent into a parched realm. On the other, you could spend several decades zipping across it with planes, Ski-Doos, and people armed with some extremely cool pieces of technology. Fortunately, when a group of scientists set out to answer this question, they chose the second option—in part to understand what might happen in the event that climate change leads to the first one. In March, an international team of scientists led by the British Antarctic Survey published the highest-resolution map of the geologic underworld of Antarctica ever made. It may be familiar to us as a frozen landscape, but that ice wasn’t always around. In fact, the ice is the relatively new frosting atop an ancient rocky foundation that’s been sitting there for hundreds of millions, if not billions, of years. Now anyone can peek at it, thanks to technology that saw right through all that ice. The map reveals Antarctica’s bedrock with a startling clarity. Deep, scar-like canyons meander around colossal mountain ranges. Some low-lying patches sit so far down that they’re actually below the present-day sea level. The ice atop one particular crevasse is almost three miles thick—that's 15 times the height of the Shard in London, one of Europe’s tallest skyscrapers. But this is about more than making a visually striking map. Plenty of Antarctica’s ice is melting thanks to humanity’s unyielding predilection for fossil fuels. Knowing where the ice is thin and vulnerable, and being able to see where its meltwater will flow into the ocean, clues glaciologists and climate scientists into how Earth’s largest collection of (melting) ice will change sea levels across the world. Before I became a science journalist, I was a volcanologist, so I’m used to seeing maps that illuminate the mysterious, abyssal parts of the planet. I’ve glimpsed at depictions of Earth’s labyrinthine crust filled with reservoirs of incandescent magma; I’ve seen illustrations of colossal plumes of rock flowing and rising through the strange mantle below. These aren’t just vague sketches, but increasingly detailed paintings. They come about not through the power of imagination, but the power of geophysics. Using things like seismic waves—which pass through and bounce about in solid rock—scientists can get a sense of what’s going on where we can’t see it, down deep below Earth’s surface. The deeper you go, the lower the resolution gets. The seismic waves that bounce back contain information about their journeys, but much of that is open to interpretation. So when I see something like the British Antarctic Survey’s new map of the Antarctic bedrock, I can’t help but feel gleeful—as it happens, it’s a lot easier to peer through ice than it is to see through rock. That’s not to say that creating this Antarctic map was easy. Far from it. A clue can be found in its name, “Bedmap3,” which signifies that it’s the third version of this map. The first version, created in the early 2000s, was made using half a decade of surveys that looked at the thickness of Antarctica’s ice. The second iteration, published a decade later, used a suite of more modern surveying methods to improve the original’s resolution and depth. And now, in 2025, we have the third version, which uses even more refined techniques to add plenty of three-dimensional information atop the previous one. The researchers behind Bedmap3 have almost lost count of all the different methods scientists have used to measure the shape of the Antarctic ice, and to peer through it. To map out the ice’s surface features, scientists have used planes and satellites to fire lasers at the ice, then waited to see how long it takes for those lasers to return to the source. That can be used to determine a distance. Do that enough times, and you can make a very precise topographic map of the gelid continent. This has been complemented by something called optical imaging analysis—a fancy way of saying a scientist manually interprets satellite photographs to plot out the ice’s peaks and troughs. Most of the fresh data that went into making Bedmap3 comes courtesy of ice-penetrating radar, which does exactly what you think it does: it fires radio waves through the ice, which hit the rocky foundations before bouncing back to receivers at the surface. This reveals the silhouette of the geologic land hidden below, as well as the thickness of the ice. This technique, also known as radio echo sounding (RES), was mainly conducted using planes. But additional RES surveying was carried out using motorized vehicles like snowmobiles and, reportedly, some dog-pulled sleds. But other instruments were also deployed, including ones designed to measure the local gravity fields. This method, known as gravimetry, can reveal if there is a concentration of mass below your feet (say, from a mountain, which creates more of a gravitational pull) or a lack of mass (from a valley, for example). During some of the recent fieldwork, explosives were also used. Tiny detonations atop the ice generated seismic waves, like artificial earthquakes; those waves ricocheted through the ice, hit the bedrock, and eventually pinged back toward detectors on the surface. Scientists used this data to create a seismic map of the ice and of the roof of the underlying bedrock, like how geophysicists use (both natural and artificial) earthquakes to peep inside Earth’s geologic innards. Altogether, the team collected a staggering 82 million individual points of data, revealing the benighted depths below that colossal sheet of ice in remarkable detail—from the South Pole to East Antarctica, the arched, jagged Antarctic Peninsula, and along the gnarly Transantarctic Mountains. The map lets us perceive the continent as it was about 35 million years ago. Back then, it would have been free of ice sheets and instead speckled with patches of tundra and swaths of lush coniferous forests. Now all that land is covered by 6.5 million cubic miles of ice. If all that ice were to melt today, it would raise the global sea level by almost 200 feet—an apocalyptic scenario that would see a plethora of islands, as well as countless coastal (or low-lying) cities across the world vanish beneath the waves. Cairo, New York City, Buenos Aires, London, Venice, Hong Kong, and Sydney would all become real-life versions of Atlantis. Fortunately, that’s not going to happen all at once, but much of this ice is melting under the weight of anthropogenic climate change. Bedmap3 also reveals that parts of Antarctica are more severely imperiled than previously thought. For example, scientists have spied several rocky channels underneath the edges of the continent—these inlets permit warm water from the ocean to flow into chunks of thawing ice that sit inconveniently below sea level. Climate change is, of course, bad news for the planet. Although scientists have a solid idea of how it will develop in the near future, fine-tuning their calculations is of vital importance. Sophisticated computer models designed to work out how all of Earth’s systems—the atmosphere, the oceans, the continents, the biosphere, humanity, and so on—are connected need to be fed the very best data on each individual system to be as accurate as possible. Bedmap3 is key to understanding how one system, the most elephantine piece of ice on the planet, is reacting and contributing to the warming world. It just so happens that this map is also an aesthetic marvel, a painterly vision of a long-lost version of Earth that no human has ever seen. It was created by science, sure. But the end result is a little magical too. Robin George Andrews is a doctor of volcanoes, an award-winning freelance science journalist, and the author of two books: Super Volcanoes: What They Reveal About Earth and the Worlds Beyond (2021) and How to Kill an Asteroid: The Absurd True Story of the Scientists Defending the Planet (2024).",
  "author": "Robin George Andrews",
  "published": "Wed, 02 Apr 2025 19:01:00 -0400",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": null,
  "byline": "by Robin George Andrews April 2, 2025",
  "length": 8550,
  "excerpt": "Scientists compiled decades of data to reveal the continent hiding beneath millions of miles of ice.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "If you had to, how would you remove 6.5 million cubic miles of ice from Antarctica? In truth, you have two options: On one hand, you could dramatically accelerate the warming of the world to turn Earth’s southernmost continent into a parched realm. On the other, you could spend several decades zipping across it with planes, Ski-Doos, and people armed with some extremely cool pieces of technology. Fortunately, when a group of scientists set out to answer this question, they chose the second option—in part to understand what might happen in the event that climate change leads to the first one. In March, an international team of scientists led by the British Antarctic Survey published the highest-resolution map of the geologic underworld of Antarctica ever made. It may be familiar to us as a frozen landscape, but that ice wasn’t always around. In fact, the ice is the relatively new frosting atop an ancient rocky foundation that’s been sitting there for hundreds of millions, if not billions, of years. Now anyone can peek at it, thanks to technology that saw right through all that ice. The map reveals Antarctica’s bedrock with a startling clarity. Deep, scar-like canyons meander around colossal mountain ranges. Some low-lying patches sit so far down that they’re actually below the present-day sea level. The ice atop one particular crevasse is almost three miles thick—that’s 15 times the height of the Shard in London, one of Europe’s tallest skyscrapers. Bedmap3 offers a glimpse at what the Antarctic continent looked like last time it was ice-free—about 35 million years ago. Pritchard, H., et al (2025) / British Antarctic Survey But this is about more than making a visually striking map. Plenty of Antarctica’s ice is melting thanks to humanity’s unyielding predilection for fossil fuels. Knowing where the ice is thin and vulnerable, and being able to see where its meltwater will flow into the ocean, clues glaciologists and climate scientists into how Earth’s largest collection of (melting) ice will change sea levels across the world. Before I became a science journalist, I was a volcanologist, so I’m used to seeing maps that illuminate the mysterious, abyssal parts of the planet. I’ve glimpsed at depictions of Earth’s labyrinthine crust filled with reservoirs of incandescent magma; I’ve seen illustrations of colossal plumes of rock flowing and rising through the strange mantle below. These aren’t just vague sketches, but increasingly detailed paintings. They come about not through the power of imagination, but the power of geophysics. Using things like seismic waves—which pass through and bounce about in solid rock—scientists can get a sense of what’s going on where we can’t see it, down deep below Earth’s surface. The deeper you go, the lower the resolution gets. The seismic waves that bounce back contain information about their journeys, but much of that is open to interpretation. So when I see something like the British Antarctic Survey’s new map of the Antarctic bedrock, I can’t help but feel gleeful—as it happens, it’s a lot easier to peer through ice than it is to see through rock. That’s not to say that creating this Antarctic map was easy. Far from it. A clue can be found in its name, “Bedmap3,” which signifies that it’s the third version of this map. The first version, created in the early 2000s, was made using half a decade of surveys that looked at the thickness of Antarctica’s ice. The second iteration, published a decade later, used a suite of more modern surveying methods to improve the original’s resolution and depth. And now, in 2025, we have the third version, which uses even more refined techniques to add plenty of three-dimensional information atop the previous one. The researchers behind Bedmap3 have almost lost count of all the different methods scientists have used to measure the shape of the Antarctic ice, and to peer through it. To map out the ice’s surface features, scientists have used planes and satellites to fire lasers at the ice, then waited to see how long it takes for those lasers to return to the source. That can be used to determine a distance. Do that enough times, and you can make a very precise topographic map of the gelid continent. This has been complemented by something called optical imaging analysis—a fancy way of saying a scientist manually interprets satellite photographs to plot out the ice’s peaks and troughs. A British Antarctic Survey Twin Otter plane conducting ice-penetrating surveys of Antarctica. Courtesy of British Antarctic Survey Most of the fresh data that went into making Bedmap3 comes courtesy of ice-penetrating radar, which does exactly what you think it does: it fires radio waves through the ice, which hit the rocky foundations before bouncing back to receivers at the surface. This reveals the silhouette of the geologic land hidden below, as well as the thickness of the ice. This technique, also known as radio echo sounding (RES), was mainly conducted using planes. But additional RES surveying was carried out using motorized vehicles like snowmobiles and, reportedly, some dog-pulled sleds. But other instruments were also deployed, including ones designed to measure the local gravity fields. This method, known as gravimetry, can reveal if there is a concentration of mass below your feet (say, from a mountain, which creates more of a gravitational pull) or a lack of mass (from a valley, for example). During some of the recent fieldwork, explosives were also used. Tiny detonations atop the ice generated seismic waves, like artificial earthquakes; those waves ricocheted through the ice, hit the bedrock, and eventually pinged back toward detectors on the surface. Scientists used this data to create a seismic map of the ice and of the roof of the underlying bedrock, like how geophysicists use (both natural and artificial) earthquakes to peep inside Earth’s geologic innards. Altogether, the team collected a staggering 82 million individual points of data, revealing the benighted depths below that colossal sheet of ice in remarkable detail—from the South Pole to East Antarctica, the arched, jagged Antarctic Peninsula, and along the gnarly Transantarctic Mountains. The map lets us perceive the continent as it was about 35 million years ago. Back then, it would have been free of ice sheets and instead speckled with patches of tundra and swaths of lush coniferous forests. Now all that land is covered by 6.5 million cubic miles of ice. The edge of an ice shelf in Adelaide Island, off the Antarctic Peninsula. Maria-Jose Vinas / NASA / Public Domain If all that ice were to melt today, it would raise the global sea level by almost 200 feet—an apocalyptic scenario that would see a plethora of islands, as well as countless coastal (or low-lying) cities across the world vanish beneath the waves. Cairo, New York City, Buenos Aires, London, Venice, Hong Kong, and Sydney would all become real-life versions of Atlantis. Fortunately, that’s not going to happen all at once, but much of this ice is melting under the weight of anthropogenic climate change. Bedmap3 also reveals that parts of Antarctica are more severely imperiled than previously thought. For example, scientists have spied several rocky channels underneath the edges of the continent—these inlets permit warm water from the ocean to flow into chunks of thawing ice that sit inconveniently below sea level. Climate change is, of course, bad news for the planet. Although scientists have a solid idea of how it will develop in the near future, fine-tuning their calculations is of vital importance. Sophisticated computer models designed to work out how all of Earth’s systems—the atmosphere, the oceans, the continents, the biosphere, humanity, and so on—are connected need to be fed the very best data on each individual system to be as accurate as possible. Bedmap3 is key to understanding how one system, the most elephantine piece of ice on the planet, is reacting and contributing to the warming world. It just so happens that this map is also an aesthetic marvel, a painterly vision of a long-lost version of Earth that no human has ever seen. It was created by science, sure. But the end result is a little magical too. Robin George Andrews is a doctor of volcanoes, an award-winning freelance science journalist, and the author of two books: Super Volcanoes: What They Reveal About Earth and the Worlds Beyond (2021) and How to Kill an Asteroid: The Absurd True Story of the Scientists Defending the Planet (2024).",
  "image": "https://img.atlasobscura.com/ctDegOdc7yNnYusekRWpVwzj4XNcwZ5fODz72lq-AUs/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9lN2U5OWNjNC0z/MmQyLTRmYTgtYmJl/Ni02NmEzMTM1MWM4/N2NhM2M4N2M0MGEy/MWViM2E4MTdfQW50/YXJjdGljYSBCZWRt/YXAzX0ZpZzdfY3Jv/cHBlZC5qcGc.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-body\"\u003e\n\n            \u003cfigure\u003e\u003ca title=\"Good News From Planet Earth\" href=\"https://www.atlasobscura.com/categories/good-news-from-planet-earth\"\u003e\u003cimg src=\"https://img.atlasobscura.com/rUMMedUXvv1PtTDrrC3d5OMHAlORmFxZYzHJ0YxDu-o/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9lNzNiMDg4Mi03/Mzk4LTRmMjMtYjIy/My0wMDg1N2QyZDhm/N2UxMGY5NWQ4N2Y0/ODY5ZGM4YTZfZWFy/dGguanBn.jpg\" alt=\"\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-105180\" loading=\"lazy\"/\u003e\u003c/a\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eIf you had to, how \u003c/span\u003ewould you remove 6.5 million cubic miles of ice from \u003ca href=\"https://www.atlasobscura.com/things-to-do/antarctica\"\u003eAntarctica\u003c/a\u003e? In truth, you have two options: On one hand, you could dramatically accelerate the warming of the world to turn Earth’s southernmost continent into a parched realm. On the other, you could spend several decades zipping across it with planes, Ski-Doos, and people armed with some extremely cool pieces of technology. Fortunately, when a group of scientists set out to answer this question, they chose the second option—in part to understand what might happen in the event that climate change leads to the first one.\u003c/p\u003e\n\u003cp\u003eIn March, an international team of scientists led by the British Antarctic Survey \u003ca href=\"https://www.bas.ac.uk/media-post/new-map-of-landscape-beneath-antarctica-unveiled/\"\u003e\u003cspan\u003epublished\u003c/span\u003e the highest-resolution map of the geologic underworld of Antarctica\u003c/a\u003e ever made. It may be familiar to us as a frozen landscape, but that ice wasn\u003cspan\u003e’\u003c/span\u003et always around. In fact, the ice is the relatively new frosting atop an ancient rocky foundation that\u003cspan\u003e’\u003c/span\u003es been sitting there for hundreds of millions, if not billions, of years. Now anyone can peek at it, thanks to technology that saw right through all that ice.\u003c/p\u003e\n\u003cp\u003eThe map reveals Antarctica\u003cspan\u003e’\u003c/span\u003es bedrock with a startling clarity. Deep, scar-like canyons meander around colossal mountain ranges. Some low-lying patches sit so far down that they\u003cspan\u003e’\u003c/span\u003ere actually below the present-day sea level. The ice atop one particular crevasse is almost three miles thick—that’s 15 times the height of the Shard in \u003ca href=\"https://www.atlasobscura.com/things-to-do/london-england\"\u003eLondon\u003c/a\u003e, one of Europe\u003cspan\u003e’\u003c/span\u003es tallest skyscrapers.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://images.atlasobscura.com/uploads/assets/afc352fc-ef16-4411-a17f-e8fcfbcad11922f6bd311065e36b3b_Antarctica%20without%20ice_Bedmap3.webp\" alt=\"Bedmap3 offers a glimpse at what the Antarctic continent looked like last time it was ice-free—about 35 million years ago.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-105192\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eBedmap3 offers a glimpse at what the Antarctic continent looked like last time it was ice-free—about 35 million years ago. \u003cspan\u003ePritchard, H., et al (2025) / British Antarctic Survey\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eBut this is about more than making a visually striking map. Plenty of Antarctica\u003cspan\u003e’\u003c/span\u003es ice is melting thanks to humanity\u003cspan\u003e’\u003c/span\u003es unyielding predilection for fossil fuels. Knowing where the ice is thin and vulnerable, and being able to see where its meltwater will flow into the ocean, clues glaciologists and climate scientists into how Earth\u003cspan\u003e’\u003c/span\u003es largest collection of (melting) ice will change sea levels across the world.\u003c/p\u003e\n\u003cp\u003eBefore I became a science journalist, I was a volcanologist, so I\u003cspan\u003e’\u003c/span\u003em used to seeing maps that illuminate the mysterious, abyssal parts of the planet. I\u003cspan\u003e’\u003c/span\u003eve glimpsed at depictions of \u003ca href=\"https://www.atlasobscura.com/articles/new-discoveries-underwater-volcanoes\"\u003eEarth’s labyrinthine crust filled with reservoirs of incandescent magma\u003c/a\u003e; I\u003cspan\u003e’\u003c/span\u003eve seen illustrations of colossal plumes of rock flowing and rising through the strange mantle below. These aren\u003cspan\u003e’\u003c/span\u003et just vague sketches, but increasingly detailed paintings. They come about not through the power of imagination, but the power of geophysics. Using things like seismic waves—which pass through and bounce about in solid rock—scientists can get a sense of what\u003cspan\u003e’\u003c/span\u003es going on where we can’t see it, down deep below Earth\u003cspan\u003e’\u003c/span\u003es surface.\u003c/p\u003e\n\u003cp\u003eThe deeper you go, the lower the resolution gets. The seismic waves that bounce back contain information about their journeys, but much of that is open to interpretation. So when I see something like the British Antarctic Survey\u003cspan\u003e’\u003c/span\u003es new map of the Antarctic bedrock, I can\u003cspan\u003e’\u003c/span\u003et help but feel gleeful—as it happens, it\u003cspan\u003e’\u003c/span\u003es a lot easier to peer through ice than it is to see through rock.\u003c/p\u003e\n\u003cp\u003eThat\u003cspan\u003e’\u003c/span\u003es not to say that creating this Antarctic map was easy. Far from it. A clue can be found in its name, \u003cspan\u003e“\u003c/span\u003eBedmap3,” which signifies that it\u003cspan\u003e’\u003c/span\u003es the third version of this map. The \u003ca href=\"https://agupubs.onlinelibrary.wiley.com/doi/pdf/10.1029/2000JB900449\"\u003e\u003cspan\u003efirst version\u003c/span\u003e\u003c/a\u003e, created in the early 2000s, was made using half a decade of surveys that looked at the thickness of Antarctica\u003cspan\u003e’\u003c/span\u003es ice. The \u003ca href=\"https://tc.copernicus.org/articles/7/375/2013/tc-7-375-2013.pdf\"\u003e\u003cspan\u003esecond\u003c/span\u003e iteration\u003c/a\u003e, published a decade later, used a suite of more modern surveying methods to improve the original\u003cspan\u003e’\u003c/span\u003es resolution and depth. And now, in 2025, we have the \u003ca href=\"https://www.bas.ac.uk/project/bedmap3/\"\u003e\u003cspan\u003ethird version\u003c/span\u003e\u003c/a\u003e, which uses even more refined techniques to add plenty of three-dimensional information atop the previous one.\u003c/p\u003e\n\u003cp\u003eThe researchers behind Bedmap3 have almost lost count of all the different methods scientists have used to measure the shape of the Antarctic ice, and to peer through it. To map out the ice\u003cspan\u003e’\u003c/span\u003es surface features, scientists have used planes and satellites to \u003ca href=\"https://attic.gsfc.nasa.gov/glas/\"\u003efire \u003cspan\u003elasers\u003c/span\u003e at the ice\u003c/a\u003e, then waited to see how long it takes for those lasers to return to the source. That can be used to determine a distance. Do that enough times, and you can make a very precise topographic map of the gelid continent. This has been complemented by something called optical imaging analysis—a fancy way of saying a scientist manually interprets satellite photographs to plot out the ice\u003cspan\u003e’\u003c/span\u003es peaks and troughs.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/CBfO-hSEEbppQy6oxmrbUTJeQ5MIfZwTBf1pxe_KG4E/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy8wODk0ZjAwZTFh/ZjFiOWY2NjhfdHdp/biBvdHRlci5qcGc.jpg\" alt=\"A British Antarctic Survey Twin Otter plane conducting ice-penetrating surveys of Antarctica.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-105182\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eA British Antarctic Survey Twin Otter plane conducting ice-penetrating surveys of Antarctica. \u003cspan\u003eCourtesy of British Antarctic Survey\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eMost of the fresh data that went into making Bedmap3 comes courtesy of ice-penetrating radar, which does exactly what you think it does: it fires radio waves through the ice, which hit the rocky foundations before bouncing back to receivers at the surface. This reveals the silhouette of the geologic land hidden below, as well as the thickness of the ice. This technique, also known as \u003ca href=\"https://www.antarcticglaciers.org/glaciers-and-climate/observing-and-monitoring-glaciers-and-ice-sheets/mapping-the-glacier-bed/\"\u003e\u003cspan\u003eradio echo sounding\u003c/span\u003e\u003c/a\u003e (RES), was mainly conducted using planes. But additional RES surveying was carried out using motorized vehicles like snowmobiles and, reportedly, some \u003ca href=\"https://www.bas.ac.uk/media-post/new-map-of-landscape-beneath-antarctica-unveiled/\"\u003e\u003cspan\u003edog-pulled sleds\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eBut other instruments were also deployed, including ones designed to measure the local gravity fields. This method, known as gravimetry, can reveal if there is a concentration of mass below your feet (say, from a mountain, which creates more of a gravitational pull) or a lack of mass (from a valley, for example). During some of the recent fieldwork, explosives were also used. Tiny detonations atop the ice generated seismic waves, like artificial earthquakes; those waves ricocheted through the ice, hit the bedrock, and eventually pinged back toward detectors on the surface. Scientists used this data to create a seismic map of the ice and of the roof of the underlying bedrock, like how geophysicists use (both natural and artificial) earthquakes to peep inside Earth\u003cspan\u003e’\u003c/span\u003es geologic innards.\u003c/p\u003e\n\u003cp\u003eAltogether, the team collected a staggering 82 million individual points of data, revealing the benighted depths below that colossal sheet of ice in remarkable detail—from the South Pole to East Antarctica, the arched, jagged Antarctic Peninsula, and along the gnarly \u003ca href=\"https://www.atlasobscura.com/articles/antarctica-photos-transantarctic-mountains\"\u003eTransantarctic Mountains\u003c/a\u003e. The map lets us perceive the continent as it was \u003ca href=\"https://www.livescience.com/planet-earth/antarctica/when-was-the-last-time-antarctica-was-ice-free\"\u003e\u003cspan\u003eabout 35 million years ago\u003c/span\u003e\u003c/a\u003e. Back then, it would have been free of ice sheets and instead speckled with patches of tundra and swaths of lush coniferous forests. Now all that land is covered by 6.5 million cubic miles of ice.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/1ViVoAHW9ZXm1W_j_ZsXcx2O72BNTzk1P4AZGvcoq-U/rt:fill/w:1200/el:1/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy8zNWIwYjA4MC0z/ZGMyLTRhOWItOWMy/Yi1hYWRiODg2N2E5/YjRmMmJjY2YxZjBl/MjhmYjJkZjFfR1NG/Q18yMDE3MTIwOF9B/cmNoaXZlX2UwMDE2/MDktb3JpZy5qcGc.jpg\" alt=\"The edge of an ice shelf in Adelaide Island, off the Antarctic Peninsula.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-105196\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThe edge of an ice shelf in Adelaide Island, off the Antarctic Peninsula. \u003cspan\u003eMaria-Jose Vinas / NASA / Public Domain\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eIf all that ice were to melt today, it would raise the global sea level by almost 200 feet—an \u003ca href=\"https://www.nationalgeographic.com/magazine/article/rising-seas-ice-melt-new-shoreline-maps\"\u003e\u003cspan\u003eapocalyptic scenario\u003c/span\u003e\u003c/a\u003e that would see a plethora of islands, as well as countless coastal (or low-lying) cities across the world vanish beneath the waves. Cairo, New York City, Buenos Aires, London, Venice, Hong Kong, and Sydney would all become real-life versions of Atlantis. Fortunately, that\u003cspan\u003e’\u003c/span\u003es not going to happen all at once, but much of this ice is melting under the weight of anthropogenic climate change. Bedmap3 also reveals that parts of Antarctica are more severely imperiled than previously thought. For example, scientists have spied several rocky channels underneath the edges of the continent—these inlets permit warm water from the ocean to flow into chunks of thawing ice that sit inconveniently below sea level.\u003c/p\u003e\n\u003cp\u003eClimate change is, of course, bad news for the planet. Although scientists have a solid idea of how it will develop in the near future, fine-tuning their calculations is of vital importance. Sophisticated computer models designed to work out how all of Earth\u003cspan\u003e’\u003c/span\u003es systems—the atmosphere, the oceans, the continents, the biosphere, humanity, and so on—are connected need to be fed the very best data on each individual system to be as accurate as possible. Bedmap3 is key to understanding how one system, the most elephantine piece of ice on the planet, is reacting and contributing to the warming world.\u003c/p\u003e\n\u003cp\u003eIt just so happens that this map is also an aesthetic marvel, a painterly vision of a long-lost version of Earth that no human has ever seen. It was created by science, sure. But the end result is a little magical too.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRobin George Andrews is a doctor of volcanoes, an award-winning freelance science journalist, and the author of two books: \u003ca href=\"https://robingeorgeandrews.com/super-volcanoes-book\"\u003eSuper Volcanoes: What They Reveal About Earth and \u003c/a\u003e\u003ca href=\"https://robingeorgeandrews.com/super-volcanoes-book\"\u003ethe Worlds Beyond\u003c/a\u003e (2021) and \u003ca href=\"https://robingeorgeandrews.com/how-to-kill-an-asteroid\"\u003eHow to Kill an Asteroid: The Absurd True Story of the Scientists Defending the Planet\u003c/a\u003e (2024).\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n          \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-02T19:01:00-04:00",
  "modifiedTime": "2025-04-02T19:08:16-04:00"
}
