{
  "id": "57982d92-ec3a-4990-9fed-ebfacec7d275",
  "title": "Come See Me on Book Tour!",
  "link": "https://www.nomadicmatt.com/travel-blogs/book-tour-2025/",
  "description": "I’m going on a book tour! My next book, How to Travel the World on $75 a Day, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! This is my first book tour in six years and I’m very excited to... The post Come See Me on Book Tour! appeared first on Nomadic Matt's Travel Site.",
  "author": "Matthew Kepnes",
  "published": "Tue, 25 Feb 2025 12:59:49 +0000",
  "source": "https://www.nomadicmatt.com/travel-blog/feed/",
  "categories": [
    "Random Musings"
  ],
  "byline": "Matthew Kepnes",
  "length": 4293,
  "excerpt": "I’m going on a book tour! My next book, How to Travel the World on $75 a Day, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! This is my first book tour in six years and I’m very excited to...",
  "siteName": "Nomadic Matt's Travel Site",
  "favicon": "",
  "text": "I’m going on a book tour! My next book, How to Travel the World on $75 a Day, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! This is my first book tour in six years and I’m very excited to get out there and talk about how travel has changed as well as hang out with readers of this site! The last edition of my book came out in 2017 and, since then, a lot has changed. COVID forever changed the travel industry. A lot of companies/hotels/hostels closed during the pandemic while old methods of saving money became obsolete and new methods came into being. And, since 2017, prices have gone up. A lot. Not only because of natural inflation but because of the post-COVID inflation boom. (As you’ve probably noticed, it’s not as cheap to travel as it was back in 2017!) Since travel has changed so much, I wanted the new book to reflect the current conditions we travelers face when it comes to planning a trip, saving money, and navigating regions around the world. The book is focused on long-term travelers, but it’s also just for anyone who just wants to save money when they travel. The tips and tricks can be applied to any trip of any length. So, come meet me on book tour and learn how to travel smarter for less this year! Here are my tour dates and how to sign up: March 26th: New York City – The Strand, 7pm. Sign up here! March 28th: Chicago – Barbara’s, 6pm. Sign up here! April 1st: Austin – Location and time TBD. April 3rd: San Diego – Warwick’s, 7:30pm. Sign up here! April 8th: San Francisco – Book Passage, 5:30pm. Sign up here! April 10th: Los Angeles – Location and time TBD. April 16th: Portland – Powell’s, 7pm. Sign up here! Note: I’m working on adding a few more locations to the tour! I’ll add new destinations as they come. You’ll be able to get the book at any tour stop but, if I’m not coming to your city and you still want the book, you can order the books from these fine establishments: Amazon Bookshop.org Barnes \u0026 Noble *** If you live in any of the cities above, I hope you’ll make out out to an event! And, if you’re not in any of those cities, please consider pre-ordering a copy. Pre-orders determine the print run of the book and how many copies local bookstores buy. The stronger the pre-sale orders, the more likely they are to stock the book so please order the book in advance! I’m really excited about this new edition of the book and I can’t wait to talk about it with you! Book Your Trip: Logistical Tips and Tricks Book Your Flight Find a cheap flight by using Skyscanner. It’s my favorite search engine because it searches websites and airlines around the globe so you always know no stone is being left unturned. Book Your Accommodation You can book your hostel with Hostelworld. If you want to stay somewhere other than a hostel, use Booking.com as it consistently returns the cheapest rates for guesthouses and hotels. Don’t Forget Travel Insurance Travel insurance will protect you against illness, injury, theft, and cancellations. It’s comprehensive protection in case anything goes wrong. I never go on a trip without it as I’ve had to use it many times in the past. My favorite companies that offer the best service and value are: SafetyWing (best for budget travelers) World Nomads (best for mid-range travelers) InsureMyTrip (for those 70 and over) Medjet (for additional evacuation coverage) Want to Travel for Free? Travel credit cards allow you to earn points that can be redeemed for free flights and accommodation — all without any extra spending. Check out my guide to picking the right card and my current favorites to get started and see the latest best deals. Need a Rental Car? Discover Cars is a budget-friendly international car rental website. No matter where you’re headed, they’ll be able to find the best — and cheapest — rental for your trip! Need Help Finding Activities for Your Trip? Get Your Guide is a huge online marketplace where you can find cool walking tours, fun excursions, skip-the-line tickets, private guides, and more. Ready to Book Your Trip? Check out my resource page for the best companies to use when you travel. I list all the ones I use when I travel. They are the best in class and you can’t go wrong using them on your trip.",
  "image": "https://www.nomadicmatt.com/wp-content/uploads/2025/02/tourposttitle.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-276770\"\u003e\n\t\u003cdiv\u003e\n\t\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media.nomadicmatt.com/2025/tourposttitle.jpeg\" width=\"675\" height=\"395\" alt=\" Nomadic Matt\u0026#39;s new budget travel book in front of a book shelf\"/\u003e\u003cbr/\u003e\nI’m going on a book tour! My next book, \u003cem\u003e\u003ca href=\"https://www.nomadicmatt.com/how-to-travel-the-world/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eHow to Travel the World on $75 a Day\u003c/a\u003e\u003c/em\u003e, is coming out on March 25th and I’m going on a book tour to talk about it and the current state of travel! \u003c/p\u003e\n\u003cp\u003eThis is my first book tour in six years and I’m very excited to get out there and talk about how travel has changed as well as hang out with readers of this site!\u003c/p\u003e\n\u003cp\u003eThe last edition of my book came out in 2017 and, since then, a lot has changed. COVID forever changed the travel industry. A lot of companies/hotels/hostels closed during the pandemic while old methods of saving money became obsolete and new methods came into being.\u003c/p\u003e\n\u003cp\u003eAnd, since 2017, prices have gone up. A lot. Not only because of natural inflation but because of the post-COVID inflation boom. (As you’ve probably noticed, it’s not as cheap to travel as it was back in 2017!)\u003c/p\u003e\n\u003cp\u003eSince travel has changed so much, I wanted the new book to reflect the current conditions we travelers face when it comes to planning a trip, saving money, and navigating regions around the world. The book is focused on long-term travelers, but it’s also just for anyone who just wants to save money when they travel. The tips and tricks can be applied to any trip of any length. \u003c/p\u003e\n\u003cp\u003eSo, come meet me on book tour and learn how to travel smarter for less this year!\u003c/p\u003e\n\u003cp\u003eHere are my tour dates and how to sign up:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMarch 26th: New York City\u003c/strong\u003e – The Strand, 7pm. \u003ca href=\"https://www.eventbrite.com/e/matt-kepnes-how-to-travel-the-world-on-75-a-day-tickets-1205211793919?aff=oddtdtcreator\" target=\"_blank\"\u003eSign up here!\u003c/a\u003e\u003cbr/\u003e\n\u003cstrong\u003eMarch 28th: Chicago\u003c/strong\u003e – Barbara’s, 6pm. \u003ca href=\"https://barbarasbookstores.com/event/matt-kepnes/\" target=\"_blank\"\u003eSign up here!\u003c/a\u003e\u003cbr/\u003e\n\u003cstrong\u003eApril 1st: Austin\u003c/strong\u003e – Location and time TBD.\u003cbr/\u003e\n\u003cstrong\u003eApril 3rd: San Diego\u003c/strong\u003e – Warwick’s, 7:30pm. \u003ca href=\"https://www.warwicks.com/event/kepnes-2025\" target=\"_blank\"\u003eSign up here!\u003c/a\u003e\u003cbr/\u003e\n\u003cstrong\u003eApril 8th: San Francisco\u003c/strong\u003e – Book Passage, 5:30pm. \u003ca href=\"https://www.bookpassage.com/event/matt-kepnes-how-travel-world-75-day-ferry-building-store\" target=\"_blank\"\u003eSign up here!\u003c/a\u003e\u003cbr/\u003e\n\u003cstrong\u003eApril 10th: Los Angeles\u003c/strong\u003e – Location and time TBD.\u003cbr/\u003e\n\u003cstrong\u003eApril 16th: Portland\u003c/strong\u003e – Powell’s, 7pm. \u003ca href=\"https://www.powells.com/book/how-to-travel-the-world-on-75-a-day-9781637746646/1-1\" target=\"_blank\"\u003eSign up here!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e I’m working on adding a few more locations to the tour! I’ll add new destinations as they come.\u003c/p\u003e\n\u003cp\u003eYou’ll be able to get the book at any tour stop but, if I’m not coming to your city and you still want the book, you can order the books from these fine establishments:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3WkxjRh\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eAmazon\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://bookshop.org/a/12235/9781637746646\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eBookshop.org\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.barnesandnoble.com/w/how-to-travel-the-world-on-75-a-day-matt-kepnes/1146021378\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eBarnes \u0026amp; Noble\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ccenter\u003e***\u003c/center\u003e\n\u003cp\u003eIf you live in any of the cities above, I hope you’ll make out out to an event! And, if you’re not in any of those cities, please consider pre-ordering a copy. Pre-orders determine the print run of the book and how many copies local bookstores buy. The stronger the pre-sale orders, the more likely they are to stock the book so please order the book in advance! \u003c/p\u003e\n\u003cp\u003eI’m really excited about this new edition of the book and I can’t wait to talk about it with you!\u003c/p\u003e\n\u003cdiv\u003e\n\u003ch4\u003eBook Your Trip: Logistical Tips and Tricks\u003c/h4\u003e\n\u003cp\u003e\u003cstrong\u003eBook Your Flight\u003c/strong\u003e\u003cbr/\u003e\nFind a cheap flight by using \u003ca href=\"https://skyscanner.pxf.io/c/214481/1027991/13416?subId1=%26currency%3DUSD\u0026amp;associateid=AFF_TRA_19354_00001\u0026amp;u=https%3A%2F%2Fwww.skyscanner.com%2F\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSkyscanner\u003c/a\u003e. It’s my favorite search engine because it searches websites and airlines around the globe so you always know no stone is being left unturned. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBook Your Accommodation\u003c/strong\u003e\u003cbr/\u003e\nYou can book your hostel with \u003ca href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eHostelworld\u003c/a\u003e. If you want to stay somewhere other than a hostel, use \u003ca href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eBooking.com\u003c/a\u003e as it consistently returns the cheapest rates for guesthouses and hotels. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDon’t Forget Travel Insurance\u003c/strong\u003e\u003cbr/\u003e\nTravel insurance will protect you against illness, injury, theft, and cancellations. It’s comprehensive protection in case anything goes wrong. I never go on a trip without it as I’ve had to use it many times in the past. My favorite companies that offer the best service and value are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://safetywing.com/nomad-insurance/?referenceID=24768462\u0026amp;campaign=footer-blue-box\u0026amp;utm_source=24768462\u0026amp;utm_medium=Ambassador\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSafetyWing\u003c/a\u003e (best for budget travelers)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.tkqlhce.com/click-3032045-15403748\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eWorld Nomads\u003c/a\u003e (best for mid-range travelers)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://insuremytripus.pxf.io/q4vRWg\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eInsureMyTrip\u003c/a\u003e (for those 70 and over)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://medjetassist.com/nomadicmatt\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eMedjet\u003c/a\u003e (for additional evacuation coverage)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWant to Travel for Free?\u003c/strong\u003e\u003cbr/\u003e\nTravel credit cards allow you to earn points that can be redeemed for free flights and accommodation — all without any extra spending. Check out \u003ca href=\"https://www.nomadicmatt.com/travel-tips/picking-a-travel-credit-card/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003emy guide to picking the right card and my current favorites\u003c/a\u003e to get started and see the latest best deals.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeed a Rental Car?\u003c/strong\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.discovercars.com/canada?a_aid=nomadicmatt\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eDiscover Cars\u003c/a\u003e is a budget-friendly international car rental website. No matter where you’re headed, they’ll be able to find the best — and cheapest — rental for your trip!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeed Help Finding Activities for Your Trip?\u003c/strong\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.getyourguide.com/?partner_id=LLKQJ38\u0026amp;utm_medium=online_publisher\u0026amp;placement=content-top\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eGet Your Guide\u003c/a\u003e is a huge online marketplace where you can find cool walking tours, fun excursions, skip-the-line tickets, private guides, and more. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReady to Book Your Trip?\u003c/strong\u003e\u003cbr/\u003e\nCheck out my \u003ca href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eresource page\u003c/a\u003e for the best companies to use when you travel. I list all the ones I use when I travel. They are the best in class and you can’t go wrong using them on your trip.\n\u003c/p\u003e\u003c/div\u003e\n\n\n\u003c/div\u003e\n\u003c/article\u003e\n\n\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003c/main\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-25T12:59:49Z",
  "modifiedTime": "2025-02-27T14:58:30Z"
}
