{
  "id": "70504851-65cd-45de-a1c0-35c8aeea5a94",
  "title": "Ghost Lore Museum in Jiufen, Taiwan",
  "link": "https://www.atlasobscura.com/places/ghost-lore-museum",
  "description": "The Ghost Lore Museum in Jiufen, Taiwan, explores Taiwan’s rich traditions of ghost stories, superstitions, and afterlife beliefs. Located in Jiufen—a mountain town famous for its mist-shrouded scenery, narrow alleyways, and vibrant tea houses—the museum immerses visitors in the spiritual and supernatural aspects of Taiwanese culture. While the museum only includes a couple of rooms, it is full of items and statues that showcase the diverse types of spirits and ghosts prominent in Taiwanese and East Asian folklore. It features iconic spirits like the gui (ghosts of those who suffered an unjust or tragic death) and jiangshi (the “hopping” vampires of Chinese myth). Explanatory panels accompany life-sized models, artifacts, and illustrations, offering a glimpse into the roles these spirits play in Taiwanese belief systems and rituals. Hidden inside a cabinet, a grotesque Krasue—a Southeast Asian demon with the internal organs exposed and connected to a flying female head—welcomes the visitor by repeating what they said while opening the door. One of the highlights is the depiction of the Hungry Ghost Festival, an important event in Taiwan and other East Asian countries, when it’s believed that the gates of the underworld open, allowing spirits to visit the living. This exhibit showcases offerings, lanterns, and other ceremonial objects used to appease wandering souls, along with life-sized models that recreate festival scenes. The museum displays a collection of traditional talismans, amulets, and symbols that people use to ward off evil spirits or attract good luck, especially related to Taoism. Visitors can learn about the symbolism behind each item and how they’re used in rituals to protect against misfortune or mischief from vengeful spirits, including a sword made of coins used by Taoist exorcists. The place is built as an open photo booth, where visitors can take pictures while using the items around, lying inside coffins, or joining a set of heads inside jars.",
  "author": "",
  "published": "Fri, 13 Dec 2024 14:00:00 -0500",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": [
    "ghosts",
    "museums and collections",
    "museums"
  ],
  "byline": "",
  "length": 2071,
  "excerpt": "A museum about rituals, ghosts, and demons from around Asia, set in the middle of the peaceful Jiufen.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "The Ghost Lore Museum in Jiufen, Taiwan, explores Taiwan’s rich traditions of ghost stories, superstitions, and afterlife beliefs. Located in Jiufen—a mountain town famous for its mist-shrouded scenery, narrow alleyways, and vibrant tea houses—the museum immerses visitors in the spiritual and supernatural aspects of Taiwanese culture. While the museum only includes a couple of rooms, it is full of items and statues that showcase the diverse types of spirits and ghosts prominent in Taiwanese and East Asian folklore. It features iconic spirits like the gui (ghosts of those who suffered an unjust or tragic death) and jiangshi (the “hopping” vampires of Chinese myth). Explanatory panels accompany life-sized models, artifacts, and illustrations, offering a glimpse into the roles these spirits play in Taiwanese belief systems and rituals. Hidden inside a cabinet, a grotesque Krasue—a Southeast Asian demon with the internal organs exposed and connected to a flying female head—welcomes the visitor by repeating what they said while opening the door. One of the highlights is the depiction of the Hungry Ghost Festival, an important event in Taiwan and other East Asian countries, when it’s believed that the gates of the underworld open, allowing spirits to visit the living. This exhibit showcases offerings, lanterns, and other ceremonial objects used to appease wandering souls, along with life-sized models that recreate festival scenes. The museum displays a collection of traditional talismans, amulets, and symbols that people use to ward off evil spirits or attract good luck, especially related to Taoism. Visitors can learn about the symbolism behind each item and how they’re used in rituals to protect against misfortune or mischief from vengeful spirits, including a sword made of coins used by Taoist exorcists. The place is built as an open photo booth, where visitors can take pictures while using the items around, lying inside coffins, or joining a set of heads inside jars.",
  "image": "https://img.atlasobscura.com/Ve-q9eASXm84-nwn_XhkYj9o3V5U0QA4IobqTvqhuAQ/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL3BsYWNl/X2ltYWdlcy8wNmEw/NGEyNi1kMDlmLTRh/NjctODMwNy1iMTMy/ZDZiNTZhZTA2NTc0/ZGNiY2NkODI0Mzg1/NTFfMjAyMjEyMTZf/MTM1OTU2LmpwZw.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"place-body\"\u003e\n                  \u003cp\u003e\u003cspan\u003e\u003cspan\u003eThe \u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\u003cspan\u003eGhost Lore Museum\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\u003cspan\u003e in\u003c/span\u003e\u003c/span\u003e\u003cspan\u003e Jiufen, Taiwan, explores Taiwan’s rich traditions of ghost stories, superstitions, and afterlife beliefs. Located in Jiufen—a mountain town famous for its mist-shrouded scenery, narrow alleyways, and vibrant tea houses—the museum immerses visitors in the spiritual and supernatural aspects of Taiwanese culture.\u003c/span\u003e\u003c/p\u003e\n                  \u003cp\u003e\u003cspan\u003eWhile the museum only includes a couple of rooms, it is full of items and statues that showcase the diverse types of spirits and ghosts prominent in Taiwanese and East Asian folklore. It features iconic spirits like the \u003c/span\u003e\u003cem\u003e\u003cspan\u003egui \u003c/span\u003e\u003c/em\u003e\u003cspan\u003e(ghosts of those who suffered an unjust or tragic death) and \u003c/span\u003e\u003cem\u003e\u003cspan\u003ejiangshi \u003c/span\u003e\u003c/em\u003e\u003cspan\u003e(the “hopping” vampires of Chinese myth). Explanatory panels accompany life-sized models, artifacts, and illustrations, offering a glimpse into the roles these spirits play in Taiwanese belief systems and rituals. Hidden inside a cabinet, a grotesque \u003c/span\u003e\u003cem\u003e\u003cspan\u003eKrasue—\u003c/span\u003e\u003c/em\u003e\u003cspan\u003ea Southeast Asian demon with the internal organs exposed and connected to a flying female head—welcomes the visitor by repeating what they said while opening the door.\u003c/span\u003e\u003c/p\u003e\n                  \u003cp\u003e\u003cspan\u003eOne of the highlights is the depiction of the Hungry Ghost Festival, an important event in Taiwan and other East Asian countries, when it’s believed that the gates of the underworld open, allowing spirits to visit the living. This exhibit showcases offerings, lanterns, and other ceremonial objects used to appease wandering souls, along with life-sized models that recreate festival scenes.\u003c/span\u003e\u003c/p\u003e\n                  \u003cp\u003e\u003cspan\u003eThe museum displays a collection of traditional talismans, amulets, and symbols that people use to ward off evil spirits or attract good luck, especially related to Taoism. Visitors can learn about the symbolism behind each item and how they’re used in rituals to protect against misfortune or mischief from vengeful spirits, including a sword made of coins used by Taoist exorcists.\u003c/span\u003e\u003c/p\u003e\n                  \u003cp\u003e\u003cspan\u003eThe place is built as an open photo booth, where visitors can take pictures while using the items around, lying inside coffins, or joining a set of heads inside jars.\u003c/span\u003e\u003c/p\u003e\n              \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-13T14:00:00-05:00",
  "modifiedTime": null
}
