{
  "id": "77f0ff6e-cde6-4cd3-a94c-c08b1d508e6c",
  "title": "This Obscure Heirloom Pumpkin Makes a Fantastic Pie",
  "link": "https://www.atlasobscura.com/articles/thanksgiving-pumpkin-pie-recipe-historical",
  "description": "I just wrapped up my first year of gardening in the Mojave Desert, specifically in the Las Vegas Valley. I watched as plants sizzled in the sun after one missed watering, and most of my vegetables simply gave up on life as temperatures topped 115 degrees in May. But one plant I put into the ground, as a curious experiment, was a surprising success: the Long Island cheese pumpkin. And it turns out, adaptable heirlooms like this squash might be the key to not just gardening in the desert, but adapting the food production system to climate change. To learn more about this pumpkin’s potential in harsh environments, I reached out to another gardener striving to grow food in the desert, Nisha Maxwell of Mantis Planting. Nisha moved to Joshua Tree in 2016, “so I've been living here for eight years and killing plants for eight years,” she tells me over the phone. Nisha became fascinated with the challenges of desert planting. She became a landscape and permaculture designer, and eventually founded a curated seed company that not only provides desert-adapted seeds, but offers the instruction gardeners need to help these plants thrive. Her selected seeds love the heat of the day, don't mind cold desert nights, and can survive even in extreme low humidity. And most are heirloom plants. “Heirloom varieties adapt and adapt and adapt,” she says. Among the seeds Nisha sells are Long Island cheese pumpkins. They get their name not because of any resemblance to cheese in flavor, but because the flat, pale pumpkin looks like a wheel of cheese. They’ve also been called Cinderella Pumpkins, because it looks like you could hollow them out and ride in them to a ball. “Decoratively, I think they are the most beautiful pumpkins for sure,” Nisha effuses. “I'm a graphic designer as well and sometimes I choose plants just for the aesthetics.” While the cheese pumpkin’s skin is similar to the color of a butternut squash, the flesh inside is intensely hued, a bright orange. The contrast reminds me of the famous Dickinson Pumpkin, the heirloom variety that’s used in Libby’s canned pumpkin. Dickinsons are similarly pale on the exterior and bright orange in the middle, as well as low in water and high in sugar, desirable qualities for pie pumpkins. The biggest difference between the two is also what killed commercial production of the cheese pumpkin: The Libby’s pumpkins are round or ovoid, which means they roll along conveyor belts in processing plants easily. The flat cheese pumpkin does not. Cheese pumpkins, Dickinson pumpkins, and butternut squash are all members of the Cucurbita moschata species, some of the oldest squashes to be domesticated for food. These squash varieties have been living and traveling with humans for so long, we no longer know their exact origin. They came somewhere from Central America, or Northern South America, and are known to be more tolerant of heat, disease, and pests than other squash species. According to the Long Island Cheese Pumpkin Project, members of Cucurbita moschata came north through Indigenous trade routes and thrived pre-European contact. In the 1500s, cheese pumpkins were being grown in the gardens of Spanish colonials, and, according to the official Smithsonian Gardens blog, were grown all along the Atlantic seaboard by the end of the 18th century. By the mid-19th century, dozens of varieties of cheese pumpkins were grown across the United States. It went by many names: Cheese, Cinderella, Kentucky Field, and Buff Pie were all varieties of the same ancestral pumpkin. “[It's] the only true article, in my opinion, for making that most delicious of ‘yankee notions’—pumpkin pie.” Cucurbita moschata pumpkins are also known to have smoother flesh than other squash species—as opposed to stringy flesh—which makes them ideal for pumpkin pie. In 1855, a writer in Michigan Farmer reported that the cheese pumpkin “is the only true article, in my opinion, for making that most delicious of ‘yankee notions’—pumpkin pie—and I am not alone in my opinions . . . These pumpkins are very easily raised; they will grow on almost any soil if properly tended . . . I have raised these pumpkins for a number of years and can recommend them to be some pumpkins.” The last line is a pun: “Some pumpkins!” was a mid-19th century expression that was the opposite of “small potatoes.” Perhaps, in modern slang, akin to “Sick!” Although cheese pumpkins were grown all over the country, at the 26th Annual Fair of the American Institute, in October 1852, a farm in Gowanus, Long Island (today Brooklyn), was awarded the prize for the best cheese pumpkins in the country. But because the pumpkins didn’t work as well on an industrial scale, by the late 20th century, they were being grown only in small quantities as a decorative pumpkin. A Long Island seed saver and botany professor named Ken Ettlinger noticed the shift and spent one fall buying cheese pumpkins from farm stands and seed saving. He worked with a Maryland farmer who planted a field of Ettlinger’s cheese pumpkin seeds, allowing the varieties to cross-pollinate. The result was the variety that is today known as the Long Island cheese pumpkin. The pumpkins take about 100 days to mature; they want eight or more hours of full sun and, with plenty of water, they’re happy in temperatures well over 100 degrees. I found hand-pollinating produces more fruit, and Nisha advises they are “heavy feeders,” meaning growers should make sure they’re supplying them with plenty of nitrogen, potassium and phosphate. To get nutrients like these, Nisha adds chicken manure, coffee grounds, and banana peels to her compost. And cheese pumpkins are beneficial to desert gardens because the shade provided by its leaves keeps moisture in the soil. “It’s very much a good living mulch,” Nisha says. Cheese pumpkins are also easy to seed save. Due to phenotypic plasticity—the ability of a plant to change as a result of environmental factors—after a few cycles of growing and seed saving, your pumpkins will be even better adapted to your climate and soil. And once picked, the pumpkins store well, and even taste sweeter over time. Choosing to grow plants like the Long Island cheese pumpkin is also key to adapting to a future with climate change. “The way I think about heirlooms, especially desert heirlooms … those are the real survivors,” Nisha tells me. “Their seeds need to be incredibly impenetrable and able to survive for like 10 years without a rain. I think of heirlooms as the most resilient seeds in the history of domestication.” “And I think that people in other areas are going to need heirloom seeds from hot places,” Nisha adds. “And a little bit of vice versa, if we wind up with a more humid climate in the desert, some of our plants are not gonna like that. So we need these ones that we know can survive across climates.” But Nisha feels that food and a solution for climate change aren't the only reasons to plant heirlooms like Long Island cheese pumpkins. “Conservation is kind of the same as art collecting,” she says. “There's something really exciting about all of the different things that humans have bred and created … It’s partly an emotional choice. It’s like saving pottery or paintings, but from a culinary perspective and a gardening perspective.” Since my Long Island cheese pumpkin delivered a perfect pumpkin to me in early October, I decided to consult some cookbooks from the height of its popularity in the mid-19th century to come up with a pumpkin pie recipe. But Nisha warns the pumpkins can end up more savory when grown in the desert: Even though she was drawn to them for pies, she often uses her pumpkins for curry. To find out what recipe would suit yours best, just taste the roast pumpkin before you bake with it. Despite a brutal Mojave summer, my pumpkin was sweet and milky. When I baked it, the scent of caramelized sugar wafted out of the oven; my home smelled like the holidays. When pureed and baked into a pie, it had a fresh pumpkin flavor that paired particularly well with ginger. But with all the time and effort it took to process the pumpkin into pie, was it really better than just cracking open a can of pumpkin? I thought so, but maybe I was just perceiving it that way because food tastes better with a story. So I fed a slice to a friend without context. She immediately declared it “Delicious!” and said it tasted exactly like her grandmother’s pumpkin pie. So perhaps there is something added by using this gorgeous heirloom pumpkin.",
  "author": "Sarah Lohman",
  "published": "Fri, 22 Nov 2024 15:33:00 -0500",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": null,
  "byline": "by Sarah Lohman November 22, 2024",
  "length": 10223,
  "excerpt": "Never a commercial success, the Long Island cheese pumpkin deserves a place in your Thanksgiving dessert.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "Jump to recipe I just wrapped up my first year of gardening in the Mojave Desert, specifically in the Las Vegas Valley. I watched as plants sizzled in the sun after one missed watering, and most of my vegetables simply gave up on life as temperatures topped 115 degrees in May. But one plant I put into the ground, as a curious experiment, was a surprising success: the Long Island cheese pumpkin. And it turns out, adaptable heirlooms like this squash might be the key to not just gardening in the desert, but adapting the food production system to climate change. To learn more about this pumpkin’s potential in harsh environments, I reached out to another gardener striving to grow food in the desert, Nisha Maxwell of Mantis Planting. Nisha moved to Joshua Tree in 2016, “so I’ve been living here for eight years and killing plants for eight years,” she tells me over the phone. Nisha became fascinated with the challenges of desert planting. She became a landscape and permaculture designer, and eventually founded a curated seed company that not only provides desert-adapted seeds, but offers the instruction gardeners need to help these plants thrive. Her selected seeds love the heat of the day, don’t mind cold desert nights, and can survive even in extreme low humidity. And most are heirloom plants. “Heirloom varieties adapt and adapt and adapt,” she says. Among the seeds Nisha sells are Long Island cheese pumpkins. They get their name not because of any resemblance to cheese in flavor, but because the flat, pale pumpkin looks like a wheel of cheese. They’ve also been called Cinderella Pumpkins, because it looks like you could hollow them out and ride in them to a ball. “Decoratively, I think they are the most beautiful pumpkins for sure,” Nisha effuses. “I’m a graphic designer as well and sometimes I choose plants just for the aesthetics.” The pale, flat-bottomed pumpkin gets its name because it resembles a wheel of cheese. Sarah Lohman for Gastro Obscura While the cheese pumpkin’s skin is similar to the color of a butternut squash, the flesh inside is intensely hued, a bright orange. The contrast reminds me of the famous Dickinson Pumpkin, the heirloom variety that’s used in Libby’s canned pumpkin. Dickinsons are similarly pale on the exterior and bright orange in the middle, as well as low in water and high in sugar, desirable qualities for pie pumpkins. The biggest difference between the two is also what killed commercial production of the cheese pumpkin: The Libby’s pumpkins are round or ovoid, which means they roll along conveyor belts in processing plants easily. The flat cheese pumpkin does not. Cheese pumpkins, Dickinson pumpkins, and butternut squash are all members of the Cucurbita moschata species, some of the oldest squashes to be domesticated for food. These squash varieties have been living and traveling with humans for so long, we no longer know their exact origin. They came somewhere from Central America, or Northern South America, and are known to be more tolerant of heat, disease, and pests than other squash species. According to the Long Island Cheese Pumpkin Project, members of Cucurbita moschata came north through Indigenous trade routes and thrived pre-European contact. In the 1500s, cheese pumpkins were being grown in the gardens of Spanish colonials, and, according to the official Smithsonian Gardens blog, were grown all along the Atlantic seaboard by the end of the 18th century. By the mid-19th century, dozens of varieties of cheese pumpkins were grown across the United States. It went by many names: Cheese, Cinderella, Kentucky Field, and Buff Pie were all varieties of the same ancestral pumpkin. Cucurbita moschata pumpkins are also known to have smoother flesh than other squash species—as opposed to stringy flesh—which makes them ideal for pumpkin pie. In 1855, a writer in Michigan Farmer reported that the cheese pumpkin “is the only true article, in my opinion, for making that most delicious of ‘yankee notions’—pumpkin pie—and I am not alone in my opinions … These pumpkins are very easily raised; they will grow on almost any soil if properly tended … I have raised these pumpkins for a number of years and can recommend them to be some pumpkins.” The last line is a pun: “Some pumpkins!” was a mid-19th century expression that was the opposite of “small potatoes.” Perhaps, in modern slang, akin to “Sick!” Although cheese pumpkins were grown all over the country, at the 26th Annual Fair of the American Institute, in October 1852, a farm in Gowanus, Long Island (today Brooklyn), was awarded the prize for the best cheese pumpkins in the country. But because the pumpkins didn’t work as well on an industrial scale, by the late 20th century, they were being grown only in small quantities as a decorative pumpkin. A Long Island seed saver and botany professor named Ken Ettlinger noticed the shift and spent one fall buying cheese pumpkins from farm stands and seed saving. He worked with a Maryland farmer who planted a field of Ettlinger’s cheese pumpkin seeds, allowing the varieties to cross-pollinate. The result was the variety that is today known as the Long Island cheese pumpkin. The flesh of the Long Island cheese pumpkin is bright orange and smooth. Sarah Lohman for Gastro Obscura The pumpkins take about 100 days to mature; they want eight or more hours of full sun and, with plenty of water, they’re happy in temperatures well over 100 degrees. I found hand-pollinating produces more fruit, and Nisha advises they are “heavy feeders,” meaning growers should make sure they’re supplying them with plenty of nitrogen, potassium and phosphate. To get nutrients like these, Nisha adds chicken manure, coffee grounds, and banana peels to her compost. And cheese pumpkins are beneficial to desert gardens because the shade provided by its leaves keeps moisture in the soil. “It’s very much a good living mulch,” Nisha says. Cheese pumpkins are also easy to seed save. Due to phenotypic plasticity—the ability of a plant to change as a result of environmental factors—after a few cycles of growing and seed saving, your pumpkins will be even better adapted to your climate and soil. And once picked, the pumpkins store well, and even taste sweeter over time. Choosing to grow plants like the Long Island cheese pumpkin is also key to adapting to a future with climate change. “The way I think about heirlooms, especially desert heirlooms … those are the real survivors,” Nisha tells me. “Their seeds need to be incredibly impenetrable and able to survive for like 10 years without a rain. I think of heirlooms as the most resilient seeds in the history of domestication.” “And I think that people in other areas are going to need heirloom seeds from hot places,” Nisha adds. “And a little bit of vice versa, if we wind up with a more humid climate in the desert, some of our plants are not gonna like that. So we need these ones that we know can survive across climates.” But Nisha feels that food and a solution for climate change aren’t the only reasons to plant heirlooms like Long Island cheese pumpkins. “Conservation is kind of the same as art collecting,” she says. “There’s something really exciting about all of the different things that humans have bred and created … It’s partly an emotional choice. It’s like saving pottery or paintings, but from a culinary perspective and a gardening perspective.” The pumpkin makes for a silky-smooth pie. Sam O’Brien for Gastro Obscura Since my Long Island cheese pumpkin delivered a perfect pumpkin to me in early October, I decided to consult some cookbooks from the height of its popularity in the mid-19th century to come up with a pumpkin pie recipe. But Nisha warns the pumpkins can end up more savory when grown in the desert: Even though she was drawn to them for pies, she often uses her pumpkins for curry. To find out what recipe would suit yours best, just taste the roast pumpkin before you bake with it. Despite a brutal Mojave summer, my pumpkin was sweet and milky. When I baked it, the scent of caramelized sugar wafted out of the oven; my home smelled like the holidays. When pureed and baked into a pie, it had a fresh pumpkin flavor that paired particularly well with ginger. But with all the time and effort it took to process the pumpkin into pie, was it really better than just cracking open a can of pumpkin? I thought so, but maybe I was just perceiving it that way because food tastes better with a story. So I fed a slice to a friend without context. She immediately declared it “Delicious!” and said it tasted exactly like her grandmother’s pumpkin pie. So perhaps there is something added by using this gorgeous heirloom pumpkin. Long Island Cheese Pumpkin Pie Adapted from \"Miss Beecher’s Domestic Receipt Book,\" 1846, and \"American Cookery,\" 1796 Make two pumpkin pies or one deep-dish pumpkin pie. Ingredients 2 cups pumpkin 1 1/4 cups brown sugar or maple sugar 1/2 teaspoon of salt 2 teaspoons ginger 1 teaspoon cinnamon 1 teaspoon nutmeg 1 teaspoon mace  2 cups heavy whipping cream 3 eggs 1 or 2 pie crusts Instructions Prepare the pumpkin: With a sharp chef’s knife—or sometimes a hatchet is easier—cut the pumpkin into quarters. On a lined, rimmed baking sheet, bake at 400 degrees for 30–35 minutes, until tender when pierced with a fork. Allow to cool, then peel flesh from the skin. Preheat the oven to 375°F.  Blend together all the ingredients with an immersion blender, blender, or food processor until smooth. Pour into two pie crusts (or one if making a deep-dish pie). Bake for 55–65 minutes, rotating halfway through. The pie should be firm at the edges with a wobble in the middle. Gastro Obscura covers the world’s most wondrous food and drink. Sign up for our regular newsletter.",
  "image": "https://img.atlasobscura.com/-UwOxFXokYKxlB68PZybpnjx0KCS7Rw5paBMM8gcbGM/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy85ZWQ2MWIxODdj/YTIwYTM5ZWZfc2xp/Y2VkbG9uZ2lzbGFu/ZHB1bXBraW5waWUu/anBn.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cul\u003e\n              \u003cli\u003e\u003ca href=\"#recipes\"\u003eJump to recipe\u003c/a\u003e\u003c/li\u003e\n            \u003c/ul\u003e\n          \u003csection id=\"article-body\"\u003e\n\n            \u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/CLJCF5J1aVeqpd7ZhvXxkYUhtxvqFx7fLBwWt-6HTVQ/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9iZWUzOGY0MS1i/N2E1LTRjN2ItOTQx/Yi1hN2UxNzNkOWZi/YzBjNGUyZTI5OWJj/OTBhZDEzZjJfZW5k/YW5nZXJlZGVhdHNi/YWRnZS5qcGc.jpg\" alt=\"\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-103916\" loading=\"lazy\"/\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eI just wrapped up my \u003c/span\u003efirst year of gardening in the Mojave Desert, specifically in the \u003ca href=\"https://www.atlasobscura.com/things-to-do/las-vegas-nevada\"\u003eLas Vegas\u003c/a\u003e Valley. I watched as plants sizzled in the sun after one missed watering, and most of my vegetables simply gave up on life as temperatures topped 115 degrees in May. But one plant I put into the ground, as a curious experiment, was a surprising success: the Long Island cheese pumpkin. And it turns out, adaptable heirlooms like this squash might be the key to not just gardening in the desert, but adapting the food production system to climate change.\u003c/p\u003e\n\u003cp\u003eTo learn more about this pumpkin’s potential in harsh environments, I reached out to another gardener striving to grow food in the desert, Nisha Maxwell of \u003ca href=\"https://www.mantisplanting.com/\"\u003eMantis Planting\u003c/a\u003e. Nisha moved to \u003ca href=\"https://www.atlasobscura.com/things-to-do/joshua-tree-california\"\u003eJoshua Tree\u003c/a\u003e in 2016, “so I’ve been living here for eight years and killing plants for eight years,” she tells me over the phone.\u003c/p\u003e\n\u003cp\u003eNisha became fascinated with the challenges of desert planting. She became a landscape and permaculture designer, and eventually founded a curated seed company that not only provides desert-adapted seeds, but offers the instruction gardeners need to help these plants thrive. Her selected seeds love the heat of the day, don’t mind cold desert nights, and can survive even in extreme low humidity. And most are heirloom plants. “Heirloom varieties adapt and adapt and adapt,” she says.\u003c/p\u003e\n\u003cp\u003eAmong the seeds Nisha sells are Long Island cheese pumpkins. They get their name not because of any resemblance to cheese in flavor, but because the flat, pale pumpkin looks like a wheel of cheese. They’ve also been called Cinderella Pumpkins, because it looks like you could hollow them out and ride in them to a ball.\u003c/p\u003e\n\u003cp\u003e“Decoratively, I think they are the most beautiful pumpkins for sure,” Nisha effuses. “I’m a graphic designer as well and sometimes I choose plants just for the aesthetics.”\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/HfTubG8bw2Uf_5ApJMXhgYOL21c46ee1QWdPHWKHyTA/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9jZTA5YmRiOTYw/ODViMWM3MjhfSU1H/XzQyNDUuSlBH.jpg\" alt=\"The pale, flat-bottomed pumpkin gets its name because it resembles a wheel of cheese.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-103987\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThe pale, flat-bottomed pumpkin gets its name because it resembles a wheel of cheese. \u003cspan\u003eSarah Lohman for Gastro Obscura\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eWhile the cheese pumpkin’s skin is similar to the color of a butternut squash, the flesh inside is intensely hued, a bright orange. The contrast reminds me of the famous Dickinson Pumpkin, the heirloom variety that’s used in Libby’s canned pumpkin. Dickinsons are similarly pale on the exterior and bright orange in the middle, as well as low in water and high in sugar, desirable qualities for pie pumpkins. The biggest difference between the two is also what killed commercial production of the cheese pumpkin: The Libby’s pumpkins are round or ovoid, which means they roll along conveyor belts in processing plants easily. The flat cheese pumpkin does not.\u003c/p\u003e\n\u003cp\u003eCheese pumpkins, Dickinson pumpkins, and butternut squash are all members of the \u003cem\u003eCucurbita moschata\u003c/em\u003e species, some of the oldest squashes to be domesticated for food. These squash varieties have been living and traveling with humans for so long, we no longer know their exact origin. They came somewhere from Central America, or Northern South America, and are known to be more tolerant of heat, disease, and pests than other squash species.\u003c/p\u003e\n\u003cp\u003eAccording to the\u003ca href=\"https://www.lirsc.org/about-the-project\"\u003e Long Island Cheese Pumpkin Project\u003c/a\u003e, members of \u003cem\u003eCucurbita moschata\u003c/em\u003e came north through Indigenous trade routes and thrived pre-European contact. In the 1500s, cheese pumpkins were being grown in the gardens of Spanish colonials, and, according to the official \u003ca href=\"https://smithsoniangardens.wordpress.com/2014/09/03/the-long-island-cheese-pumpkin/\"\u003eSmithsonian Gardens blog\u003c/a\u003e, were grown all along the Atlantic seaboard by the end of the 18th century. By the mid-19th century, dozens of varieties of cheese pumpkins were grown across the United States. It went by many names: Cheese, Cinderella, Kentucky Field, and Buff Pie were all varieties of the same ancestral pumpkin.\u003c/p\u003e\n\u003cfigure\u003e\n\n\u003c/figure\u003e\n\u003cp\u003e\u003cem\u003eCucurbita moschata \u003c/em\u003epumpkins are also known to have smoother flesh than other squash species—as opposed to stringy flesh—which makes them ideal for pumpkin pie. In 1855, a writer in \u003ca href=\"https://www.google.com/books/edition/Michigan_Farmer/PN_hAAAAMAAJ?hl=en\u0026amp;gbpv=1\u0026amp;dq=%22cheese+pumpkin%22\u0026amp;pg=PA76\u0026amp;printsec=frontcover\"\u003e\u003cem\u003eMichigan Farmer\u003c/em\u003e\u003c/a\u003e reported that the cheese pumpkin “is the only true article, in my opinion, for making that most delicious of ‘yankee notions’—pumpkin pie—and I am not alone in my opinions … These pumpkins are very easily raised; they will grow on almost any soil if properly tended … I have raised these pumpkins for a number of years and can recommend them to be some pumpkins.” The last line is a pun: “Some pumpkins!” was a mid-19th century expression that was the opposite of “small potatoes.” Perhaps, in modern slang, akin to “Sick!”\u003c/p\u003e\n\u003cp\u003eAlthough cheese pumpkins were grown all over the country, at the 26th Annual Fair of the American Institute, in October 1852, a farm in Gowanus, Long Island (today Brooklyn), was awarded the prize for the best cheese pumpkins in the country. But because the pumpkins didn’t work as well on an industrial scale, by the late 20th century, they were being grown only in small quantities as a decorative pumpkin. A Long Island seed saver and botany professor named \u003ca href=\"https://www.edibleeastend.com/2018/10/15/long-island-cheese-pumpkin-traditional-pumpkin-pie-missing/\"\u003eKen Ettlinger\u003c/a\u003e noticed the shift and spent one fall buying cheese pumpkins from farm stands and seed saving. He worked with a Maryland farmer who planted a field of Ettlinger’s cheese pumpkin seeds, allowing the varieties to cross-pollinate. The result was the variety that is today known as the Long Island cheese pumpkin.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/ZhnK1RluHHHaIu9p74JdSCgLL0R7zc8IMbTyTNd2Kp0/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9jZTA5YmRiOTYw/ODViMWM3MjhfSU1H/XzQyODQuSlBH.jpg\" alt=\"The flesh of the Long Island cheese pumpkin is bright orange and smooth.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-103988\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThe flesh of the Long Island cheese pumpkin is bright orange and smooth. \u003cspan\u003eSarah Lohman for Gastro Obscura\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThe pumpkins take about 100 days to mature; they want eight or more hours of full sun and, with plenty of water, they’re happy in temperatures well over 100 degrees. I found hand-pollinating produces more fruit, and Nisha advises they are “heavy feeders,” meaning growers should make sure they’re supplying them with plenty of nitrogen, potassium and phosphate. To get nutrients like these, Nisha adds chicken manure, coffee grounds, and banana peels to her compost. And cheese pumpkins are beneficial to desert gardens because the shade provided by its leaves keeps moisture in the soil. “It’s very much a good living mulch,” Nisha says.\u003c/p\u003e\n\u003cp\u003eCheese pumpkins are also easy to seed save. Due to phenotypic plasticity—the ability of a plant to change as a result of environmental factors—after a few cycles of growing and seed saving, your pumpkins will be even better adapted to your climate and soil. And once picked, the pumpkins store well, and even taste sweeter over time.\u003c/p\u003e\n\u003cp\u003eChoosing to grow plants like the Long Island cheese pumpkin is also key to adapting to a future with climate change. “The way I think about heirlooms, especially desert heirlooms … those are the real survivors,” Nisha tells me. “Their seeds need to be incredibly impenetrable and able to survive for like 10 years without a rain. I think of heirlooms as the most resilient seeds in the history of domestication.”\u003c/p\u003e\n\u003cp\u003e“And I think that people in other areas are going to need heirloom seeds from hot places,” Nisha adds. “And a little bit of vice versa, if we wind up with a more humid climate in the desert, some of our plants are not gonna like that. So we need these ones that we know can survive across climates.”\u003c/p\u003e\n\u003cp\u003eBut Nisha feels that food and a solution for climate change aren’t the only reasons to plant heirlooms like Long Island cheese pumpkins. “Conservation is kind of the same as art collecting,” she says. “There’s something really exciting about all of the different things that humans have bred and created … It’s partly an emotional choice. It’s like saving pottery or paintings, but from a culinary perspective and a gardening perspective.”\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/nTQ0t38irrhBJ6bn3YyWFT3cJxL3neLx3LI_GMm-nwE/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy9iYWI0MmI2YS1j/ZmNiLTRkMmQtYWZh/ZS1kNTAzN2NhYWM3/ZWFiYWQwYjFjZWZj/MmM1NzcxMTdfSU1H/XzM5NTMuanBn.jpg\" alt=\"The pumpkin makes for a silky-smooth pie. \" width=\"auto\" data-kind=\"article-image\" id=\"article-image-103989\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eThe pumpkin makes for a silky-smooth pie.  \u003cspan\u003eSam O’Brien for Gastro Obscura\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eSince my Long Island cheese pumpkin delivered a perfect pumpkin to me in early October, I decided to consult some cookbooks from the height of its popularity in the mid-19th century to come up with a pumpkin pie recipe. But Nisha warns the pumpkins can end up more savory when grown in the desert: Even though she was drawn to them for pies, she often uses her pumpkins for curry. To find out what recipe would suit yours best, just taste the roast pumpkin before you bake with it. Despite a brutal Mojave summer, my pumpkin was sweet and milky. When I baked it, the scent of caramelized sugar wafted out of the oven; my home smelled like the holidays.\u003c/p\u003e\n\u003cp\u003eWhen pureed and baked into a pie, it had a fresh pumpkin flavor that paired particularly well with ginger. But with all the time and effort it took to process the pumpkin into pie, was it really better than just cracking open a can of pumpkin? I thought so, but maybe I was just perceiving it that way because food tastes better with a story. So I fed a slice to a friend without context. She immediately declared it “Delicious!” and said it tasted exactly like her grandmother’s pumpkin pie. So perhaps there is something added by using this gorgeous heirloom pumpkin.\u003c/p\u003e\n\n              \n              \u003cdiv id=\"recipes\"\u003e\n  \u003ch2\u003eLong Island Cheese Pumpkin Pie\u003c/h2\u003e\n   \n  \u003cdiv\u003e\n      \u003cp\u003eAdapted from \u0026#34;Miss Beecher’s Domestic Receipt Book,\u0026#34; 1846, and \u0026#34;American Cookery,\u0026#34; 1796\u003c/p\u003e\n    \u003cdiv\u003e\n      \u003cul\u003e\n   \n        \u003cli\u003eMake two pumpkin pies or one deep-dish pumpkin pie.\u003c/li\u003e\n      \u003c/ul\u003e\n    \u003c/div\u003e\n\n    \u003cdiv\u003e\n      \u003ch4\u003e\u003cstrong\u003eIngredients\u003c/strong\u003e\u003c/h4\u003e\n      \u003cul\u003e\n        \u003cli\u003e\u003cem\u003e2 cups pumpkin\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1 1/4 cups brown sugar or maple sugar\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1/2 teaspoon of salt\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e2 teaspoons ginger\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1 teaspoon cinnamon\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1 teaspoon nutmeg\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1 teaspoon mace \u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e2 cups heavy whipping cream\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e3 eggs\u003c/em\u003e\u003c/li\u003e\n        \u003cli\u003e\u003cem\u003e1 or 2 pie crusts\u003c/em\u003e\u003c/li\u003e\n      \u003c/ul\u003e\n    \u003c/div\u003e\n  \u003c/div\u003e\n\n  \u003cdiv\u003e\n    \u003ch4\u003e\u003cstrong\u003eInstructions\u003c/strong\u003e\u003c/h4\u003e\n    \u003col\u003e\n      \u003cli\u003e\n        Prepare the pumpkin: With a sharp chef’s knife—or sometimes a hatchet is easier—cut the pumpkin into quarters. On a lined, rimmed baking sheet, bake at 400 degrees for 30–35 minutes, until tender when pierced with a fork. Allow to cool, then peel flesh from the skin. \u003cbr/\u003e\n      \u003c/li\u003e\n      \u003cli\u003e\n        Preheat the oven to 375°F.  Blend together all the ingredients with an immersion blender, blender, or food processor until smooth. \u003cbr/\u003e\n      \u003c/li\u003e\n      \u003cli\u003e\n        Pour into two pie crusts (or one if making a deep-dish pie). \u003cbr/\u003e\n      \u003c/li\u003e\n      \u003cli\u003e\n        Bake for 55–65 minutes, rotating halfway through. The pie should be firm at the edges with a wobble in the middle.      \u003c/li\u003e\n    \u003c/ol\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\n              \u003cp\u003e\n                \u003cem\u003e\n                  Gastro Obscura covers the world’s most wondrous food and drink.\n                  \u003cbr/\u003e\n                  \u003ca href=\"https://www.atlasobscura.com/newsletters/gastro-obscura\"\u003eSign up for our regular newsletter\u003c/a\u003e.\n                \u003c/em\u003e\n              \u003c/p\u003e\n\n\n\n          \u003c/section\u003e\n\n          \n\n\n\n            \n\n            \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-11-22T15:33:00-05:00",
  "modifiedTime": "2024-11-22T16:49:23-05:00"
}
