{
  "id": "7ba682f0-e624-4279-b45c-22260f89627d",
  "title": "What I Pack for My Travels: Your Guide to Packing",
  "link": "https://www.nomadicmatt.com/travel-blogs/packing/",
  "description": "Over the years, what I carry in my bag has changed a lot. Most of that change has to do with the fact that I now carry a lot of gear related to blogging, but it also reflects the fact that I’ve learned a lot about packing since I first hit the road in 2006. And trust me, there is a lot to learn! The post What I Pack for My Travels: Your Guide to Packing appeared first on Nomadic Matt's Travel Site.",
  "author": "Matthew Kepnes",
  "published": "Mon, 17 Mar 2025 11:00:39 +0000",
  "source": "https://www.nomadicmatt.com/travel-blog/feed/",
  "categories": [
    "Travel Gear",
    "backpacking",
    "gear",
    "packing"
  ],
  "byline": "Matthew Kepnes",
  "length": 6816,
  "excerpt": "What should you pack on your trip? Well, there is no one right answer but this list will give you a good place to start.",
  "siteName": "Nomadic Matt's Travel Site",
  "favicon": "",
  "text": "What I carry in my bag has changed a lot over the years. Most of that change has to do with the fact that I now carry a lot of gear related to blogging, but it also reflects that I’ve learned a lot about packing since I first hit the road in 2006. I’ve learned different packing techniques through the years. I’ve traveled with big duffel bags, 60L packs, 30L packs, carry-ons, and everything in between. I’ve done it all and in all seasons. And, today, I want to share that knowledge with you so you can be a better packer because a lot of people always want to know what they should pack for their trip. The answer? As little as possible. Packing light is a cliché, yet one that has a lot of truth to it. The more I travel, the more I realize I don’t need a lot of stuff. Everything I need now fits into one backpack (for more recommendations from my years of testing backpacks, click here for my top travel backpacks. I like to write down everything I think I’ll need before I go — and then cut it in half. I always ask myself, “Will I use this enough to justify the weight?” Most of the time the answer is no. I take only the essentials, and if I really need something I didn’t bring, I buy it on the road. It’s not that hard to find medicine, clothes, or an umbrella overseas. I also try to stick to the same climate during my trips to avoid having to carry lots of different kinds of clothes. I don’t want to be lugging sweaters around Thailand! However, plans can change, and if that happens, I’ll buy a light jacket or a sweater. I’ll keep it until it is a burden and then give it away. Also, you can do laundry overseas so I like to carry enough clothes for 7-10 days, do laundry, then repeat. There’s no need to bring a lot of stuff when you can just wash what you have. As for the long answer to what you should pack? Well, below is my suggested packing list — but you should tailor this to your needs. (Note: This focuses on travel to a non-winter climate. If you’re heading somewhere cold, you’ll need to adjust accordingly.) 1. Gear Laptop Smartphone Universal power adapter/converter External battery/portable charger Kindle (if you’re an avid reader and don’t want to lug around books) Camera (if you want more than just smartphone photos) For more gear recommendations, check out this post on the best travel gear. 2. Clothes 5 t-shirts 1 long-sleeved shirt 1 pair of jeans (heavy and not easily dried, but I wear them a lot — a good alternative is khaki) 1 pair of shorts 7 pairs of underwear 1 bathing suit 1 pair of flip-flops 1 pair of sneakers 8 pairs of socks (I always lose my socks so I take extra! I have no idea where they go?) 1 pair of dress shoes (This is destination dependent. I do this more in Australia and Europe and less so everywhere else.) 1 dress shirt (for going to a respectable place in the evening) Note: I’m a big fan of Unbound Merino for clothes. You can see a review here. 3. Toiletries 1 toothbrush 1 tube of toothpaste 1 package of dental floss Deodorant 1 razor 1 small bottle of shampoo 1 small bottle of shower gel 1 towel (always pack a towel!) 4. Small Medical Kit Band-Aids Hydrocortisone cream Antibacterial cream Eye drops Tylenol Hand sanitizer For more on first aid kits, check out this detailed post on how to make one for any destination. 5. Miscellaneous A key or combination lock (everyone should have one!) Headlamp (trust me, it comes in handy) Ziplock bags LifeStraw (water filter) Packing cubes   Special tip: Buy a small backpack so you won’t be tempted to overpack. We subconsciously like to fill empty space, so if you have a big bag, you’re more likely to overpack just so you don’t waste space. By getting a smaller backpack, you’ll be forced to take only the essentials — a mind trick that works very well! *** I’ve found that this list leaves me wanting for nothing. I’m sure many of you will read this and say, “But what about X?” or “You really don’t need Y.” Well, that works for you, and this list works for me. Tailor your list to suit your travels. I write this post not because I think there is one perfect way to pack but to answer the recurring question about what I pack and why. This is my list and suits my “chase the summer, live in hostels” lifestyle. But the real point I want to emphasize is that you really don’t need a lot when you travel. You never need as much as you think.   Next Steps Are you female traveler? Click here for a packing list for female travelers! Looking for a backpack? Click here to figure out how to pick the best backpack! Want more gear information? Click here for more tips on what travel gear to bring! How to Travel the World on $75 a DayMy New York Times best-selling book to travel will teach you how to master the art of travel so that you’ll get off save money, always find deals, and have a deeper travel experience. It’s your A to Z planning guide that the BBC called the “bible for budget travelers.” Click here to learn more and start reading it today! Book Your Trip: Logistical Tips and Tricks Book Your Flight Find a cheap flight by using Skyscanner. It’s my favorite search engine because it searches websites and airlines around the globe so you always know no stone is being left unturned. Book Your Accommodation You can book your hostel with Hostelworld. If you want to stay somewhere other than a hostel, use Booking.com as it consistently returns the cheapest rates for guesthouses and hotels. Don’t Forget Travel Insurance Travel insurance will protect you against illness, injury, theft, and cancellations. It’s comprehensive protection in case anything goes wrong. I never go on a trip without it as I’ve had to use it many times in the past. My favorite companies that offer the best service and value are: SafetyWing (best for budget travelers) World Nomads (best for mid-range travelers) InsureMyTrip (for those 70 and over) Medjet (for additional evacuation coverage) Want to Travel for Free? Travel credit cards allow you to earn points that can be redeemed for free flights and accommodation — all without any extra spending. Check out my guide to picking the right card and my current favorites to get started and see the latest best deals. Need a Rental Car? Discover Cars is a budget-friendly international car rental website. No matter where you’re headed, they’ll be able to find the best — and cheapest — rental for your trip! Need Help Finding Activities for Your Trip? Get Your Guide is a huge online marketplace where you can find cool walking tours, fun excursions, skip-the-line tickets, private guides, and more. Ready to Book Your Trip? Check out my resource page for the best companies to use when you travel. I list all the ones I use when I travel. They are the best in class and you can’t go wrong using them on your trip.",
  "image": "https://www.nomadicmatt.com/wp-content/uploads/2012/12/whatipack001.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\t\t\u003cmain id=\"main\" role=\"main\"\u003e\n\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003carticle id=\"post-16372\"\u003e\n\t\u003cdiv\u003e\n\t\u003cp\u003e\u003cimg width=\"810\" height=\"450\" decoding=\"async\" src=\"https://media.nomadicmatt.com/altpackingmatt_001.jpg\" alt=\"Some of the things Nomadic Matt packs on his travels\"/\u003e\u003c/p\u003e\n\u003cp\u003eWhat I carry in my bag has changed a lot over the years. Most of that change has to do with the fact that I now carry a lot of gear related to blogging, but it also reflects that I’ve learned a lot about packing since I first hit the road in 2006. \u003c/p\u003e\n\u003cp\u003eI’ve learned different packing techniques through the years. I’ve traveled with big duffel bags, 60L packs, 30L packs, carry-ons, and everything in between. I’ve done it all and in all seasons.\u003c/p\u003e\n\u003cp\u003eAnd, today, I want to share that knowledge with you so you can be a better packer because a lot of people always want to know what they should pack for their trip. \u003c/p\u003e\n\u003cp\u003eThe answer?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs little as possible.\u003c/strong\u003e \u003c/p\u003e\n\u003cp\u003ePacking light is a cliché, yet one that has a lot of truth to it. The more I travel, the more I realize I don’t need a lot of stuff. Everything I need now fits into \u003ca href=\"https://www.avantlink.com/click.php?tool_type=cl\u0026amp;merchant_id=e295c418-295a-447c-b265-734e25f82503\u0026amp;website_id=1e623eb9-55a4-4927-9712-0e0ea5344d22\u0026amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F216571%2Frei-co-op-flash-55-pack-mens\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eone backpack\u003c/a\u003e (for more recommendations from my years of testing backpacks, \u003ca href=\"https://www.nomadicmatt.com/travel-blogs/best-travel-backpacks/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eclick here for my top travel backpacks\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI like to write down everything I think I’ll need before I go — and then cut it in half. I always ask myself, “Will I use this enough to justify the weight?” \u003c/p\u003e\n\u003cp\u003eMost of the time the answer is no. \u003c/p\u003e\n\u003cp\u003eI take only the essentials, and if I really need something I didn’t bring, I buy it on the road. It’s not that hard to find medicine, clothes, or an umbrella overseas. \u003c/p\u003e\n\u003cp\u003eI also try to stick to the same climate during my trips to avoid having to carry lots of different kinds of clothes. I don’t want to be lugging sweaters around \u003ca href=\"https://www.nomadicmatt.com/travel-guides/thailand-travel-tips/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eThailand\u003c/a\u003e! However, plans can change, and if that happens, I’ll buy a light jacket or a sweater. I’ll keep it until it is a burden and then give it away. \u003c/p\u003e\n\u003cp\u003eAlso, you \u003cem\u003ecan\u003c/em\u003e do laundry overseas so I like to carry enough clothes for 7-10 days, do laundry, then repeat. There’s no need to bring a lot of stuff when you can just wash what you have. \u003c/p\u003e\n\u003cp\u003eAs for the \u003cem\u003elong\u003c/em\u003e answer to what you should pack? Well, below is my suggested packing list — but you should tailor this to your needs. \u003c/p\u003e\n\u003cp\u003e(\u003cstrong\u003eNote:\u003c/strong\u003e This focuses on travel to a non-winter climate. If you’re heading somewhere cold, you’ll need to adjust accordingly.)\u003c/p\u003e\n\n\n\u003ch3\u003e\u003cspan id=\"1-gear\"\u003e1. Gear\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3q7nVPt\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eLaptop\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3lcnsYy\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eSmartphone\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/2DbA7Yb\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eUniversal power adapter/converter\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3n6XKYj\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eExternal battery/portable charger\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/2JiJn2K\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eKindle\u003c/a\u003e (if you’re an avid reader and don’t want to lug around books)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3zPpGr1\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eCamera\u003c/a\u003e (if you want more than just smartphone photos)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor more gear recommendations, check out \u003ca href=\"https://www.nomadicmatt.com/travel-blogs/best-travel-gear/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ethis post on the best travel gear.\u003c/a\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan id=\"2-clothes\"\u003e2. Clothes\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://shareasale.com/r.cfm?b=2045947\u0026amp;u=1442001\u0026amp;m=125871\u0026amp;urllink=\u0026amp;afftrack=travel-blogs%2Fbest-travel-gear_amcid-oOUNQ6AJEJMb3mmIQbboJ\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003e5 t-shirts\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://shareasale.com/r.cfm?b=2045947\u0026amp;u=1442001\u0026amp;m=125871\u0026amp;urllink=\u0026amp;afftrack=travel-blogs%2Fbest-travel-gear_amcid-oOUNQ6AJEJMb3mmIQbboJ\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003e1 long-sleeved shirt\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e1 pair of jeans (heavy and not easily dried, but I wear them a lot — a good alternative is khaki)\u003c/li\u003e\n\u003cli\u003e1 pair of shorts\u003c/li\u003e\n\u003cli\u003e7 pairs of underwear\u003c/li\u003e\n\u003cli\u003e1 bathing suit\u003c/li\u003e\n\u003cli\u003e1 pair of flip-flops\u003c/li\u003e\n\u003cli\u003e1 pair of sneakers\u003c/li\u003e\n\u003cli\u003e8 pairs of socks (I always lose my socks so I take extra! I have no idea where they go?)\u003c/li\u003e\n\u003cli\u003e1 pair of dress shoes (This is destination dependent. I do this more in \u003ca href=\"https://www.nomadicmatt.com/travel-guides/australia-travel-tips/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eAustralia\u003c/a\u003e and \u003ca href=\"https://www.nomadicmatt.com/travel-guides/europe-travel-tips/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eEurope\u003c/a\u003e and less so everywhere else.)\u003c/li\u003e\n\u003cli\u003e1 dress shirt (for going to a respectable place in the evening)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e I’m a big fan of Unbound Merino for clothes. \u003ca href=\"https://www.nomadicmatt.com/travel-blogs/best-travel-clothes/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eYou can see a review here\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003e\u003cspan id=\"3-toiletries\"\u003e3. Toiletries\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e1 toothbrush\u003c/li\u003e\n\u003cli\u003e1 tube of toothpaste\u003c/li\u003e\n\u003cli\u003e1 package of dental floss\u003c/li\u003e\n\u003cli\u003eDeodorant\u003c/li\u003e\n\u003cli\u003e1 razor\u003c/li\u003e\n\u003cli\u003e1 small bottle of shampoo\u003c/li\u003e\n\u003cli\u003e1 small bottle of shower gel\u003c/li\u003e\n\u003cli\u003e1 towel (always pack a towel!)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003e\u003cspan id=\"4-small-medical-kit\"\u003e4. Small Medical Kit\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eBand-Aids\u003c/li\u003e\n\u003cli\u003eHydrocortisone cream\u003c/li\u003e\n\u003cli\u003eAntibacterial cream\u003c/li\u003e\n\u003cli\u003eEye drops\u003c/li\u003e\n\u003cli\u003eTylenol\u003c/li\u003e\n\u003cli\u003eHand sanitizer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor more on first aid kits, \u003ca href=\"https://www.nomadicmatt.com/travel-blogs/first-aid-kit/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003echeck out this detailed post on how to make one for any destination\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003e\u003cspan id=\"5-miscellaneous\"\u003e5. Miscellaneous\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/2OHM1hR\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eA key or combination lock\u003c/a\u003e (everyone should have one!)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3aRbqRC\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eHeadlamp\u003c/a\u003e (trust me, it comes in handy)\u003c/li\u003e\n\u003cli\u003eZiplock bags\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://lifestraw.xyibsh.net/B0AY14\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eLifeStraw\u003c/a\u003e (water filter)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://amzn.to/3NISjf3\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003ePacking cubes\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \u003cbr/\u003e\n\u003cem\u003eSpecial tip: \u003ca href=\"https://www.nomadicmatt.com/travel-tips/choosing-the-right-backpack/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eBuy a small backpack\u003c/a\u003e so you won’t be tempted to overpack. We subconsciously like to fill empty space, so if you have a big bag, you’re more likely to overpack just so you don’t waste space. By getting a smaller backpack, you’ll be forced to take only the essentials — a mind trick that works very well!\u003c/em\u003e\u003c/p\u003e\n\u003ccenter\u003e***\u003c/center\u003e\n\u003cp\u003eI’ve found that this list leaves me wanting for nothing. I’m sure many of you will read this and say, “But what about X?” or “You really don’t need Y.” Well, that works for you, and this list works for me. Tailor your list to suit your travels.\u003c/p\u003e\n\u003cp\u003eI write this post not because I think there is one perfect way to pack but to answer the recurring question about what I pack and why. This is my list and suits my “chase the summer, live in hostels” lifestyle.\u003c/p\u003e\n\u003cp\u003eBut the real point I want to emphasize is that you really don’t need a lot when you travel. You never need as much as you think.\u003cbr/\u003e\n \u003c/p\u003e\n\u003ch3\u003e\u003cspan id=\"next-steps\"\u003eNext Steps\u003c/span\u003e\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eAre you female traveler? \u003c/strong\u003e\u003ca href=\"https://www.nomadicmatt.com/travel-blogs/solo-female-travel-packing-guide/\"\u003eClick here for a packing list for female travelers!\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eLooking for a backpack?\u003c/strong\u003e \u003ca href=\"https://www.nomadicmatt.com/travel-tips/choosing-the-right-backpack/\"\u003eClick here to figure out how to pick the best backpack!\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eWant more gear information?\u003c/strong\u003e \u003ca href=\"https://www.nomadicmatt.com/gear-insurance-tech/\"\u003eClick here for more tips on what travel gear to bring!\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cdiv\u003e\u003ch3\u003e\u003cspan id=\"how-to-travel-the-world-on-75-a-day\"\u003e\u003cspan\u003eHow to Travel the World on $75 a Day\u003c/span\u003e\u003c/span\u003e\u003c/h3\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"220\" height=\"330\" decoding=\"async\" src=\"https://media.nomadicmatt.com/bookimages/HowtoTraveltheWorldon75aDay.jpg\" alt=\"How to Travel the World on $75 a Day\" data-old-src=\"data:image/svg+xml,%3Csvg%20xmlns=\u0026#39;http://www.w3.org/2000/svg\u0026#39;%20viewBox=\u0026#39;0%200%20220%20330\u0026#39;%3E%3C/svg%3E\" data-lazy-src=\"https://media.nomadicmatt.com/bookimages/HowtoTraveltheWorldon75aDay.jpg\"/\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eMy \u003cem\u003eNew York Times\u003c/em\u003e best-selling book to travel will teach you how to master the art of travel so that you’ll get off save money, always find deals, and have a deeper travel experience. It’s your A to Z planning guide that the BBC called the “bible for budget travelers.”\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nomadicmatt.com/how-to-travel-the-world/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eClick here to learn more and start reading it today!\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\n\u003cdiv\u003e\n\u003ch4\u003eBook Your Trip: Logistical Tips and Tricks\u003c/h4\u003e\n\u003cp\u003e\u003cstrong\u003eBook Your Flight\u003c/strong\u003e\u003cbr/\u003e\nFind a cheap flight by using \u003ca href=\"https://skyscanner.pxf.io/c/214481/1027991/13416?subId1=%26currency%3DUSD\u0026amp;associateid=AFF_TRA_19354_00001\u0026amp;u=https%3A%2F%2Fwww.skyscanner.com%2F\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSkyscanner\u003c/a\u003e. It’s my favorite search engine because it searches websites and airlines around the globe so you always know no stone is being left unturned. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBook Your Accommodation\u003c/strong\u003e\u003cbr/\u003e\nYou can book your hostel with \u003ca href=\"https://prf.hn/click/camref:1101lHtj\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eHostelworld\u003c/a\u003e. If you want to stay somewhere other than a hostel, use \u003ca href=\"https://www.booking.com/index.html?aid=362916\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eBooking.com\u003c/a\u003e as it consistently returns the cheapest rates for guesthouses and hotels. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDon’t Forget Travel Insurance\u003c/strong\u003e\u003cbr/\u003e\nTravel insurance will protect you against illness, injury, theft, and cancellations. It’s comprehensive protection in case anything goes wrong. I never go on a trip without it as I’ve had to use it many times in the past. My favorite companies that offer the best service and value are:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://safetywing.com/nomad-insurance/?referenceID=24768462\u0026amp;campaign=footer-blue-box\u0026amp;utm_source=24768462\u0026amp;utm_medium=Ambassador\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eSafetyWing\u003c/a\u003e (best for budget travelers)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.tkqlhce.com/click-3032045-15403748\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eWorld Nomads\u003c/a\u003e (best for mid-range travelers)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://insuremytripus.pxf.io/q4vRWg\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eInsureMyTrip\u003c/a\u003e (for those 70 and over)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://medjetassist.com/nomadicmatt\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eMedjet\u003c/a\u003e (for additional evacuation coverage)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWant to Travel for Free?\u003c/strong\u003e\u003cbr/\u003e\nTravel credit cards allow you to earn points that can be redeemed for free flights and accommodation — all without any extra spending. Check out \u003ca href=\"https://www.nomadicmatt.com/travel-tips/picking-a-travel-credit-card/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003emy guide to picking the right card and my current favorites\u003c/a\u003e to get started and see the latest best deals.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeed a Rental Car?\u003c/strong\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.discovercars.com/canada?a_aid=nomadicmatt\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eDiscover Cars\u003c/a\u003e is a budget-friendly international car rental website. No matter where you’re headed, they’ll be able to find the best — and cheapest — rental for your trip!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeed Help Finding Activities for Your Trip?\u003c/strong\u003e\u003cbr/\u003e\n\u003ca href=\"https://www.getyourguide.com/?partner_id=LLKQJ38\u0026amp;utm_medium=online_publisher\u0026amp;placement=content-top\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"\u003eGet Your Guide\u003c/a\u003e is a huge online marketplace where you can find cool walking tours, fun excursions, skip-the-line tickets, private guides, and more. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReady to Book Your Trip?\u003c/strong\u003e\u003cbr/\u003e\nCheck out my \u003ca href=\"https://www.nomadicmatt.com/travel-resources/\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eresource page\u003c/a\u003e for the best companies to use when you travel. I list all the ones I use when I travel. They are the best in class and you can’t go wrong using them on your trip.\n\u003c/p\u003e\u003c/div\u003e\n\n\u003c/div\u003e\n\u003c/article\u003e\n\n\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003c/main\u003e\n\t\t\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-17T11:00:39Z",
  "modifiedTime": "2025-03-17T12:57:51Z"
}
