{
  "id": "9c424530-1608-4593-8677-8d2b8df1ee6f",
  "title": "Forget the stereotypes, Benidorm is the complete package",
  "link": "https://www.theguardian.com/travel/2025/jun/25/benidorm-spain-auhentic-side-of-the-resort",
  "description": "The resort was ahead of its time – built to handle industrial numbers of tourists while not displacing residents. And beyond the full English breakfasts and pub crawls, there’s an authentic Spanish side to itLast year, Benidorm welcomed close to 3 million visitors. Despite its reputation as a British holiday mecca – nearly 900,000 UK travellers visited the city in 2024 – it was actually Spanish nationals who made up the largest share, with more than one million domestic visitors flocking to the Costa Blanca resort, according to Benidorm city council. I have a feeling that these visitors did not come for the stereotype of full English breakfasts and pub crawls, but for something often overlooked by international tourists: the authentic, everyday rhythm of Spanish coastal life.In a country where tourism makes up about 15% of GDP but has also spurred a housing shortage and countermovements, Benidorm offers a contrast to cities like Barcelona and Madrid, where tourism pressures are acute. The city’s mid-20th-century reinvention as a purpose-built resort might once have been controversial, but today it looks surprisingly sustainable in the context of a national housing emergency. Continue reading...",
  "author": "Leah Pattem",
  "published": "Wed, 25 Jun 2025 06:00:36 GMT",
  "source": "https://www.theguardian.com/uk/travel/rss",
  "categories": [
    "Spain holidays",
    "Beach holidays",
    "Europe holidays",
    "City breaks",
    "Short breaks",
    "Cultural trips",
    "Food and drink",
    "Travel"
  ],
  "byline": "Leah Pattem",
  "length": 7566,
  "excerpt": "The resort was ahead of its time – built to handle industrial numbers of tourists while not displacing residents. And beyond the full English breakfasts and pub crawls, there’s an authentic Spanish side to it",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "Last year, Benidorm welcomed close to 3 million visitors. Despite its reputation as a British holiday mecca – nearly 900,000 UK travellers visited the city in 2024 – it was actually Spanish nationals who made up the largest share, with more than one million domestic visitors flocking to the Costa Blanca resort, according to Benidorm city council. I have a feeling that these visitors did not come for the stereotype of full English breakfasts and pub crawls, but for something often overlooked by international tourists: the authentic, everyday rhythm of Spanish coastal life.Map for BenidormIn a country where tourism makes up about 15% of GDP but has also spurred a housing shortage and countermovements, Benidorm offers a contrast to cities like Barcelona and Madrid, where tourism pressures are acute. The city’s mid-20th-century reinvention as a purpose-built resort might once have been controversial, but today it looks surprisingly sustainable in the context of a national housing emergency.Benidorm was designed and built to handle industrial numbers of visitors – including me. My first visit was in the early 1990s, aged eight, on a classic package holiday with my family. I vividly remember staying up late to play billiards with a rotating cast of kids, and language barriers didn’t matter. Their mothers – and what felt like every other señora in our 20-storey hotel – took turns pinching my cheeks.The coastal city has long accommodated large numbers of domestic and international travellers without displacing residents at the same rate as elsewhere. Unlike the “live like a local” model that has backfired in Spain’s big cities – such that more and more apartments once meant for residents are now exclusively for tourist use, especially in Madrid, where I’ve lived for 12 years – Benidorm has absorbed demand with ease while still offering an authentic Spanish experience. I’m here to explore exactly that.Before the sun has fully risen, I walk to Poniente beach, the quieter, more local stretch just west of the old town. It is already full of life. A dozen elderly señores are taking a refreshing, pre-breakfast dip and a group of señoras are easing into the day with a free session of group yoga. As the weather heats up, the Spanish crowd moves away from the main beach to the nearby Cala Almadraba or, further along, to Cala del Tío Ximo. In these two secluded coves beyond the headland, pine trees frame crystal-clear shallows. Even in peak season, these smaller spots remain largely undiscovered by foreign visitors.Cala Almadraba. Photograph: AlamyBy the time the sun is at its highest, many Spaniards are already retreating to long lunches of local cuisine. At La Fava, I find a serene space where chef Fran Burgos serves elegant dishes rooted in Alicante’s coastal traditions – such as grilled aubergine with honeycomb, parmesan soup and seasonal fish – in a tranquil, whitewashed interior. For a classic Iberian diner, Casa Toni boasts Andalusian tiles and legs of jamón hanging above the bar. For paella, a must in the Valencia region, refined seafood restaurant Ducado has an array of rice dishes.There’s room too for cross-cultural comforts. Ray’s 1, a longstanding British chippy run by a mother and daughter team (both called Teresa), earned a new Spanish fanbase when I wrote about it for Spain’s leading national newspaper, El País. Since then, Teresa senior tells me, they’ve had a regular flow of Spanish customers. Nearby, on my way to the ajuntament (town hall), I spot a queue outside Bar El Puente, a chicken rotisserie run by the same family since 1968 and attracting a mostly Spanish clientele.Local social documentary photographer María Moldes captures the city’s idiosyncrasies through saturated, surreal portraits of Spanish sunbathers. Photograph: María MoldesAnyone who has visited Benidorm will be familiar with Calle Santo Domingo, a pedestrianised alley in the old town. Here, a global clientele are drawn to the bustling Basque pintxo bars, especially in the evening. But farther inland lies a no-frills and more authentically Spanish tapas destination, just off Avenida Ruzafa. I squeeze into Taperia La Mina, where a bottle of house wine and six tapas costs €11. Restaurant Aitona and El Rincón de La Croqueta offer an equally simple experience. For a slightly quieter but still lively meal, La Mejillonera is known for its large plates of juicy orange mussels, and is worth the wait for a table.But beyond sun, sea and food, Benidorm is a real Spanish city with real stories. For example, Marina Sanchis opened Casa Cremà, a pottery workshop for locals and visitors alike, having returned to her home town after being forced out of Madrid by soaring rents, and has turned her creative retreat into a thriving community space. She tells me Benidorm has given her something she’d lost in the capital: space, time, and a connection to community.Many more Spanish artists have been inspired by the coastal metropolis, and their work has featured in the free and often overlooked Museo Boca del Calvari in the old town. María Moldes, who exhibited there a few years ago, is a local social documentary photographer whose photos of Benidorm echo the works of the late Carlos Pérez Siquier. Both photographers capture Spain’s idiosyncrasies through saturated, surreal portraits of Spanish sunbathers. Despite being taken decades apart, their images are almost indistinguishable.La Fava restaurantEven online, Benidorm has become something of a Spanish cult favourite. Erik Harley, a satirical influencer from Barcelona, tells me that Benidorm is his favourite place in the universe and he will soon be launching new tours of the city’s most iconic skyscrapers. And then there’s Mulero Ok, as he’s known here, a smartly dressed pensioner whose niche is playing Spanish pop music on his speaker and filming passersby dancing alongside his decorated, slow-gliding mobility scooter.Among Spanish youth, the city’s cultural relevance is also on the rise. Benidorm Fest is Spain’s official competition to choose its Eurovision entry. Unlike the UK’s often half-hearted approach to the contest, Spain makes a big deal of the selection process and I regularly hear Melody’s Esa Diva, which was chosen as Spain’s entry this year, playing on the radio and in bars. Still only in its third year, the festival has become a defining highlight of the city’s cultural calendar, earning Benidorm a new identity as the country’s unofficial capital of pop.Beyond the bustle of Benidorm, the nearby area is home to several charming villages that make for a perfect day trip, such as the colourful coastal town of La Vila Joiosa, a short tram ride away. Inland, the ancient hilltop village of El Castell de Guadalest is home to no fewer than eight eclectic museums and boasts stunning views of the Guadalest reservoir – one of Benidorm’s main sources of fresh water.Benidorm wears its tourist-resort reputation with pride, but it offers far more than the stereotypes suggest. As a Brit abroad occasionally longing for home, I’m not going to deny that the British stereotype of Benidorm has its appeal for me. But I’m also here for what has become even more familiar to me: Spanish culture, local gastronomy and a deeper sense of place – the side of Benidorm that is enjoyed by more than 1 million domestic visitors each year.In a country grappling with overtourism, Benidorm’s purpose-built design shouldn’t be dismissed as inauthentic. It’s a uniquely Spanish solution to a modern global challenge – and a city with space for everyone.",
  "image": "https://i.guim.co.uk/img/media/393aad9f5ac51b022f7c81184b3762f5088124a7/960_0_4800_3840/master/4800.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=e1d625345c2e764fc59fb92f2d9ad6c1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eL\u003c/span\u003east year, Benidorm welcomed close to 3 million visitors. Despite its reputation as a British holiday mecca – nearly 900,000 UK travellers visited the city in 2024 – it was actually Spanish nationals who made up the largest share, with more than one million domestic visitors flocking to the Costa Blanca resort, according to\u003ca href=\"https://infogram.com/anual-2024-1hnp27enyre3n4g\" data-link-name=\"in body link\"\u003e Benidorm city council\u003c/a\u003e. I have a feeling that these visitors did not come for the stereotype of full English breakfasts and pub crawls, but for something often overlooked by international tourists: the authentic, everyday rhythm of Spanish coastal life.\u003c/p\u003e\u003cgu-island name=\"InteractiveBlockComponent\" priority=\"critical\" deferuntil=\"idle\" props=\"{\u0026#34;url\u0026#34;:\u0026#34;https://interactive.guim.co.uk/uploader/embed/2025/06/embed-32-zip/giv-32554Yf2MJQSLQrmn/\u0026#34;,\u0026#34;scriptUrl\u0026#34;:\u0026#34;https://interactive.guim.co.uk/embed/iframe-wrapper/0.1/boot.js\u0026#34;,\u0026#34;alt\u0026#34;:\u0026#34;Map for Benidorm\u0026#34;,\u0026#34;format\u0026#34;:{\u0026#34;design\u0026#34;:10,\u0026#34;display\u0026#34;:2,\u0026#34;theme\u0026#34;:4},\u0026#34;elementId\u0026#34;:\u0026#34;ebcc08a5-9853-4fb2-bd0d-2cf07d4f8e39\u0026#34;,\u0026#34;isMainMedia\u0026#34;:false}\"\u003e\u003cfigure id=\"ebcc08a5-9853-4fb2-bd0d-2cf07d4f8e39\" data-alt=\"Map for Benidorm\" data-testid=\"interactive-element-Map%20for%20Benidorm\" data-spacefinder-role=\"inline\"\u003e\u003ca data-name=\"placeholder\" href=\"https://interactive.guim.co.uk/uploader/embed/2025/06/embed-32-zip/giv-32554Yf2MJQSLQrmn/\"\u003eMap for Benidorm\u003c/a\u003e\u003c/figure\u003e\u003c/gu-island\u003e\u003cp\u003eIn a country where tourism makes up about \u003ca href=\"https://wttc.org/news/spain-tourism-sector-could-exceed-260-billion-euros-by-2025\" data-link-name=\"in body link\"\u003e15% of GDP\u003c/a\u003e but has also spurred a\u003ca href=\"https://www.theguardian.com/world/2025/jan/20/a-vicious-circle-how-the-roof-blew-off-spains-housing-crisis#:~:text=The%20statistics%20that%20explain%20Spain\u0026#39;s,an%20EU%20average%20of%2027%25.\" data-link-name=\"in body link\"\u003e housing shortage and countermovements\u003c/a\u003e, Benidorm offers a contrast to cities like Barcelona and Madrid, where tourism pressures are acute. The city’s mid-20th-century reinvention as a purpose-built resort might once have been controversial, but today it looks surprisingly sustainable in the context of a national housing emergency.\u003c/p\u003e\u003cp\u003eBenidorm was designed and built to handle industrial numbers of visitors – including me. My first visit was in the early 1990s, aged eight, on a classic package holiday with my family. I vividly remember staying up late to play billiards with a rotating cast of kids, and language barriers didn’t matter. Their mothers – and what felt like every other señora in our 20-storey hotel – took turns pinching my cheeks.\u003c/p\u003e\u003cp\u003eThe coastal city has long accommodated large numbers of domestic and international travellers without displacing residents at the same rate as elsewhere. Unlike the “live like a local” model that has backfired in Spain’s big cities – such that more and more apartments once meant for residents are now exclusively for tourist use, especially in Madrid, where I’ve lived for 12 years – Benidorm has absorbed demand with ease while still offering an authentic Spanish experience. I’m here to explore exactly that.\u003c/p\u003e\u003cp\u003eBefore the sun has fully risen, I walk to Poniente beach, the quieter, more local stretch just west of the old town. It is already full of life. A dozen elderly señores are taking a refreshing, pre-breakfast dip and a group of señoras are easing into the day with a free session of group yoga. As the weather heats up, the Spanish crowd moves away from the main beach to the nearby Cala Almadraba or, further along, to Cala del Tío Ximo. In these two secluded coves beyond the headland, pine trees frame crystal-clear shallows. Even in peak season, these smaller spots remain largely undiscovered by foreign visitors.\u003c/p\u003e\u003cfigure id=\"24834281-fa1c-47c0-b318-0b662aed9197\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Cala Almadraba.\" src=\"https://i.guim.co.uk/img/media/19ee9ee74b56f1a60108855296aa53344319a8a0/0_0_1825_1369/master/1825.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.81095890410955\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eCala Almadraba.\u003c/span\u003e Photograph: Alamy\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBy the time the sun is at its highest, many Spaniards are already retreating to long lunches of local cuisine. At\u003ca href=\"https://lafavabenidorm.com/es\" data-link-name=\"in body link\"\u003e La Fava\u003c/a\u003e, I find a serene space where chef Fran Burgos serves elegant dishes rooted in Alicante’s coastal traditions – such as grilled aubergine with honeycomb, parmesan soup and seasonal fish – in a tranquil, whitewashed interior. For a classic Iberian diner, \u003ca href=\"https://casatonibenidorm.es/\" data-link-name=\"in body link\"\u003eCasa Toni\u003c/a\u003e boasts Andalusian tiles and legs of \u003cem\u003ejamón\u003c/em\u003e hanging above the bar. For paella, a must in the Valencia region, refined seafood restaurant \u003ca href=\"https://ducadorestaurante.com/\" data-link-name=\"in body link\"\u003eDucado\u003c/a\u003e has an array of rice dishes.\u003c/p\u003e\u003cp\u003eThere’s room too for cross-cultural comforts. Ray’s 1, a longstanding British chippy run by a mother and daughter team (both called Teresa), earned a new Spanish fanbase when I wrote about it for Spain’s leading national newspaper,\u003ca href=\"https://elpais.com/gastronomia/restaurantes/2024-03-21/rays-chippy-el-restaurante-de-fish-and-chips-mas-antiguo-de-benidorm.html\" data-link-name=\"in body link\"\u003e El País\u003c/a\u003e. Since then, Teresa senior tells me, they’ve had a regular flow of Spanish customers. Nearby, on my way to the \u003cem\u003eajuntament\u003c/em\u003e (town hall), I spot a queue outside \u003ca href=\"https://maps.app.goo.gl/xKN9yCyPT39qHMhw7\" data-link-name=\"in body link\"\u003eBar El Puente\u003c/a\u003e, a chicken rotisserie run by the same family since 1968 and attracting a mostly Spanish clientele.\u003c/p\u003e\u003cfigure id=\"0d40446f-15c4-4f69-9572-efb9841964f2\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Local social documentary photographe María Moldes captures the city’s idiosyncrasies through saturated, surreal portraits of Spanish sunbathers\" src=\"https://i.guim.co.uk/img/media/b6c2f0ac825f688eacfdc2d129e1fd55aa0a73b4/0_0_3240_3236/master/3240.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"444.45061728395063\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eLocal social documentary photographer María Moldes captures the city’s idiosyncrasies through saturated, surreal portraits of Spanish sunbathers.\u003c/span\u003e Photograph: María Moldes\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eAnyone who has visited Benidorm will be familiar with Calle Santo Domingo, a pedestrianised alley in the old town. Here, a global clientele are drawn to the bustling Basque \u003cem\u003epintxo\u003c/em\u003e bars, especially in the evening. But farther inland lies a no-frills and more authentically Spanish tapas destination, just off Avenida Ruzafa. I squeeze into \u003ca href=\"https://maps.app.goo.gl/7YrcGP7fhttH3S1p9\" data-link-name=\"in body link\"\u003eTaperia La Mina\u003c/a\u003e, where a bottle of house wine and six tapas costs €11. \u003ca href=\"https://maps.app.goo.gl/eMW2RbHqmeGznMPRA\" data-link-name=\"in body link\"\u003eRestaurant Aitona\u003c/a\u003e and \u003ca href=\"https://maps.app.goo.gl/HQExm2EA3uFdqFKa7\" data-link-name=\"in body link\"\u003eEl Rincón de La Croqueta\u003c/a\u003e offer an equally simple experience. For a slightly quieter but still lively meal, \u003ca href=\"https://maps.app.goo.gl/ivm9dksLn81UEkBF9\" data-link-name=\"in body link\"\u003eLa Mejillonera\u003c/a\u003e is known for its large plates of juicy orange mussels, and is worth the wait for a table.\u003c/p\u003e\u003cp\u003eBut beyond sun, sea and food, Benidorm is a real Spanish city with real stories. For example, Marina Sanchis opened \u003ca href=\"https://marinasanchis.es/casa-crema/\" data-link-name=\"in body link\"\u003eCasa Cremà\u003c/a\u003e, a pottery workshop for locals and visitors alike, having returned to her home town after being forced out of Madrid by soaring rents, and has turned her creative retreat into a thriving community space. She tells me Benidorm has given her something she’d lost in the capital: space, time, and a connection to community.\u003c/p\u003e\u003cp\u003eMany more Spanish artists have been inspired by the coastal metropolis, and their work has featured in the free and often overlooked \u003ca href=\"https://maps.app.goo.gl/Y6Rqa9XLTzdY3PUc8\" data-link-name=\"in body link\"\u003eMuseo Boca del Calvari\u003c/a\u003e in the old town. \u003ca href=\"https://mariamoldes.com/\" data-link-name=\"in body link\"\u003eMaría Moldes\u003c/a\u003e, who exhibited there a few years ago, is a local social documentary photographer whose photos of Benidorm echo the works of the late\u003ca href=\"https://fotocolectania.org/uploads/4aqu3uqu4yzume9u2ypyzy6y4uga2arunysypazega4yjy3ubupadyzy9e5e5u7e8a6ygemaserasanyby9yvu3ahudeze6ymy2e1477677635.pdf\" data-link-name=\"in body link\"\u003e Carlos Pérez Siquier\u003c/a\u003e. Both photographers capture Spain’s idiosyncrasies through saturated, surreal portraits of Spanish sunbathers. Despite being taken decades apart, their images are almost indistinguishable.\u003c/p\u003e\u003cfigure id=\"433daaac-c47d-4f77-a8bb-70d423e9978c\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"La Fava restaurant Benidorm\" src=\"https://i.guim.co.uk/img/media/7f93138de56fe864fcde9728c863591328a7d198/0_0_5712_4284/master/5712.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.75\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eLa Fava restaurant\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eEven online, Benidorm has become something of a Spanish cult favourite. \u003ca href=\"https://www.instagram.com/reel/Co189fwjJD9/\" data-link-name=\"in body link\"\u003eErik Harley\u003c/a\u003e, a satirical influencer from Barcelona, tells me that Benidorm is his favourite place in the universe and he will soon be launching new tours of the city’s most iconic skyscrapers. And then there’s Mulero Ok, as he’s known here, a smartly dressed pensioner whose niche is playing Spanish pop music on his speaker and \u003ca href=\"https://www.youtube.com/channel/UCfXqCqBgd9T67toedKJINTg/videos\" data-link-name=\"in body link\"\u003efilming passersby dancing\u003c/a\u003e alongside his decorated, slow-gliding mobility scooter.\u003c/p\u003e\u003cp\u003eAmong Spanish youth, the city’s cultural relevance is also on the rise. \u003ca href=\"https://www.instagram.com/benidormfest_rtve/?hl=en\" data-link-name=\"in body link\"\u003eBenidorm Fest\u003c/a\u003e is Spain’s official competition to choose its Eurovision entry. Unlike the UK’s often half-hearted approach to the contest, Spain makes a big deal of the selection process and I regularly hear Melody’s \u003ca href=\"https://www.google.com/search?q=Melody%E2%80%99s+Esa+Diva\u0026amp;oq=Melody%E2%80%99s+Esa+Diva\u0026amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIJCAEQABgNGIAEMgkIAhAAGA0YgAQyCQgDEAAYDRiABDIJCAQQABgNGIAEMgwIBRAAGA0YiwMYgAQyDAgGEAAYDRiLAxiABDIMCAcQABgNGIsDGIAEMgwICBAAGA0YiwMYgAQyDAgJEAAYDRiLAxiABNIBBzIxNmoxajeoAgCwAgA\u0026amp;sourceid=chrome\u0026amp;ie=UTF-8#fpstate=ive\u0026amp;vld=cid:fc89c516,vid:IEKSa9FVLqA,st:0\" data-link-name=\"in body link\"\u003eEsa Diva\u003c/a\u003e, which was chosen as Spain’s entry this year, playing on the radio and in bars. Still only in its third year, the festival has become a defining highlight of the city’s cultural calendar, earning Benidorm a new identity as the country’s unofficial capital of pop.\u003c/p\u003e\u003cp\u003eBeyond the bustle of Benidorm, the nearby area is home to several charming villages that make for a perfect day trip, such as the colourful coastal town of La Vila Joiosa, a short tram ride away. Inland, the ancient hilltop village of El Castell de Guadalest is home to no fewer than \u003ca href=\"https://guadalest.es/guadalest/museo-casa-orduna/\" data-link-name=\"in body link\"\u003eeight eclectic museums\u003c/a\u003e and boasts stunning views of the Guadalest reservoir – one of Benidorm’s main sources of fresh water.\u003c/p\u003e\u003cp\u003eBenidorm wears its tourist-resort reputation with pride, but it offers far more than the stereotypes suggest. As a Brit abroad occasionally longing for home, I’m not going to deny that the British stereotype of Benidorm has its appeal for me. But I’m also here for what has become even more familiar to me: Spanish culture, local gastronomy and a deeper sense of place – the side of Benidorm that is enjoyed by more than 1 million domestic visitors each year.\u003c/p\u003e\u003cp\u003eIn a country grappling with overtourism, Benidorm’s purpose-built design shouldn’t be dismissed as inauthentic. It’s a uniquely Spanish solution to a modern global challenge – and a city with space for everyone.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-25T06:00:36Z",
  "modifiedTime": "2025-06-25T14:29:13Z"
}
