{
  "id": "a5146a70-0111-4e39-a360-615da7771be1",
  "title": "The Ancient Greek Guide to Succeeding at Dinner Parties",
  "link": "https://www.atlasobscura.com/articles/podcast-ancient-greek-dinner-parties",
  "description": "Listen and subscribe on Apple Podcasts, Spotify, and all major podcast apps. Andrew Coletti: Imagine that you have just been invited to a dinner party in third century Rome. Dylan Thuras: Yes. Andrew: This is going to be a very fancy kind of affair. It’s going to be some high-profile guests, and you want to make sure that you’re going to make a good impression. Dylan: Okay. Andrew: So, you’re going to need a few things. You can figure out your outfit, of course. Dylan: Toga. I’m assuming Toga. Andrew: Toga, definitely, as long as you’re a Roman citizen. You’ve got to bring your spoon and napkin, because you have to bring those to an ancient Roman dinner party. Dylan: These are expected of you, that you come with your own silverware. Andrew: Yes, because they’ll be eating out of communal dishes in the center of the table. And there’s just one thing that you have to maybe do some extra preparation, which is the conversation. Dylan: This is a high-society affair. These people are well-traveled. They’re well-read. Let’s say, like, I’m kind of outclassed here. Like, I was invited because I’m, like, the cousin of somebody, and they felt like they had to invite me. How do I get ready for this? How can I actually prepare to not look like a doof? Andrew: Well, that’s when you can breathe a sigh of relief and relax, and you can go to your library. Because you’ve just remembered that you own a copy of a work of literature called Deipnosophistae. Dylan: Of course I do. Deipnosophistae. How could I have forgotten? Well, that’s good. I can’t wait to crack open this book and figure out how it’s going to help me survive. I’m Dylan Thuras. Andrew: And I’m Andrew Coletti. Dylan: And this is Atlas Obscura. Today we are going to be talking about Deipnosophistae and how this book is really the answer to all of my ancient Roman dinner party social problems. This is an edited transcript of the Atlas Obscura Podcast: a celebration of the world’s strange, incredible, and wondrous places. Find the show on Apple Podcasts, Spotify, and all major podcast apps. Dylan Thuras: So you are an editorial fellow at Atlas. You’ve done a ton of writing for Gastro Obscura. And you’ve written a lot specifically about ancient food history. It’s kind of your beat. You are our ancient food history correspondent. And this is also a personal interest of yours. I heard that you recently taught an ancient Roman cooking class. Andrew: Yes. This was at an education venue in Brooklyn called the Brooklyn Brainery. This one that we just did recently was a hands-on cooking class, which was really fun. It was focused on simple Roman recipes, like what everyday people were eating. So we made an herb and cheese spread. We made a beverage using vinegar and honey. Dylan: How do you come up with these menus? How do you choose what you want to serve? Andrew: For this one, I wanted to focus on the food of everyday people. Because a lot of times, Romans and other historical cooking sources, they tend to be very biased towards the food of the elite because that was the stuff that gets written down and written about more. But there are a few examples of those simpler recipes. And I also try to choose things that I think people will actually enjoy eating, too. And if you see it through the lens of their food, it helps you really see ancient people as just living, normal, everyday people. The book that we’re talking about, it’s such an important source of information about ancient Greek and Roman food that if you start researching this topic, eventually you’re just going to run into it. Dylan: Yeah, so this obviously is like an important text. What does the name mean? Andrew: The whole book is written in Greek. So Deipnosophistae in Greek can be translated as “the philosophers at dinner” or like, “the wise people at dinner.” One scholar that I spoke with had a kind of funny translation. He translated it as “banquet wits,” and he said he likes this because it sounds a little bit like “twits.” And there is like a bit of irreverence or humor in the text itself. So, he thought that that was a funny way of translating it. Dylan: Yeah, I mean it shows you something about the culture, that there was so much kind of fine dining and social maneuvering happening in this space that someone would go to the trouble of producing a text, which was actually quite a lot of trouble back then, to be like, here’s kind of what you need to know. Andrew: It’s a very rambling book. The format is hard to pin down. The framing device is that it’s a bunch of people talking at a dinner party. So it’s kind of structured that as the courses of the dinner are coming out, they see a dish and it inspires them to talk about that ingredient. Like the food itself is inspiring what they’re talking about. And they’re telling stories and they’re quoting a lot from other authors. That’s what makes it such an interesting and important text is because it preserves the words of all of these earlier writers. And in some cases, you have writers whose work doesn’t survive in its entirety, but the little piece of it that’s quoted in Deipnosophistae is what we have that survives. Dylan: It’s like super meta because it’s like in the format of a dinner party conversation, but is also like a great quotes book so that you can reference it for your future dinner. So, Deipnosophistae contains these quotes, it contains these kind of philosophical tidbits, but it also seems like it also has real recipes in here. Andrew: Well, one of the most significant things is it contains the oldest recorded known recipe in Greek. During this time, especially the Greek cities in what is now Sicily, were known for kind of fancy haute cuisine. And so the recipe that we have in Deipnosophistae is for a grilled fish. It’s a type of fish called ribbon fish, and it’s topped with grated cheese and olive oil. Dylan: That sounds nice. That sounds delicious. Andrew: Yeah, I’ve tried it. Dylan: Oh, how was it? Andrew: I enjoyed it. I know it’s sometimes today, it's taboo to put cheese and fish together. Dylan: I don’t know, it seems okay. I’m Midwestern though, I’ll put cheese on literally anything. Andrew: Even in the ancient world, apparently there were some authors that disagreed with this. Even in ancient times, it was controversial. Dylan: I see, I see. What else is in this book? Andrew: Another really cool milestone that’s kind of preserved in Deipnosophistae is talking about those same cities from Sicily, like the city of Sybaris. They mentioned that master chefs in Sybaris could own a one-year patent on their recipes so that nobody would be allowed to make them except the creator. This is actually considered our earliest known evidence of patent law for intellectual property. Dylan: That’s amazing, because there isn’t actually patent law for recipes now. I like the idea of it being a one-year patent on a recipe because it’s kind of like, okay, you get a year to be a really hot star chef, and then everybody gets to take a crack at doing the thing. I kind of feel like that would be a good thing to bring back. So, this book’s fascinating because it’s so many things. In a way, it just reminds me of what I sometimes call a tidbits book, which collects a lot of little stories or a lot of quotes or just this and that. It reminds me of the books that people sometimes put on the back of a toilet, like the Uncle John’s Bathroom Reader kind of thing. The thing that you pick up and you sort of browse through it, it’s not really meant to be necessarily read in a go. You kind of open to some pages and go like, ah, interesting, very enlightening, and then you close it and you put it back on the back of the toilet. Andrew: There’s a couple of different interpretations as to why the book was actually written. Dylan: I assume it was to help me succeed at this dinner party, but apparently maybe something else. Andrew: Yeah, that’s for sure one interpretation. So the idea that Deipnosophistae is this manual on how to impress people and seem educated at a dinner party, that idea comes from Adam Cody, who is a professor of humanities at the Virginia Military Institute. His idea was that the structure is designed to help you remember a good quote or tidbit to share during different courses or when different things come out. So, if you’re thinking about, I want a good literary quote about oysters, where in the banquet do they serve oysters? Well, it’s usually an appetizer, so I look in the beginning of the book, and it’s like an indexing system for the book. Dylan: Right. A way of mapping what topics are right for what portion of the evening. Andrew: He compares it to, if you’ve heard of the mind palace memory technique, that is something that actually also comes from ancient Greece. It’s the idea that you visualize a physical space as a way of helping memorize and recall information. Dylan: Oh, right. That’s cool. I like that interpretation. That seems good. Andrew: Well, the other scholar that I spoke with was Douglas Olson, who is a classics professor at the University of Minnesota. He thinks of it more as an informational magazine that just has many articles and many points of view that maybe the purpose is just to highlight and preserve the best of Greek literature and the best of Greek culture. Because, it’s being written in the Roman Empire, but by a Greek who is writing in Greek and quoting from really old Greek literature. And it’s taking pride in the past accomplishments of the Greeks at a time when Greece is no longer a major power and Rome is very much the main power of the Mediterranean. But, collecting the best of what it means to be Greek. Dylan: There is something very interesting about writing a book that theoretically is about succeeding at a Roman dinner party and having it all be Greek literature quotes from a different era and empire. Do we know anything about the author? Andrew: We don’t know a ton about him. His name is Athenaeus of Naucratis. We know he was a Greek from Egypt and that maybe he was actually consulting stuff from the Library of Alexandria in order to write this. Dylan: You know, it’s interesting. There’s some kind of progressive, modern ideas in this book. What did other people think of the stuff that Athenaeus was writing about? Andrew: It’s quite interesting, because Athenaeus kind of subtly responds to and disagrees with what Plato said about food. Plato was actually very dismissive of cooking. Like, he didn’t think of cooking as a high art form. Just like, oh, it’s just something you have to do like in order to live, you have to eat. He didn’t really see the artistry of it. Dylan: Plato strikes me as someone who is like not taking a shower or eat. Like he was just living in his mind palace and not really into the, you know, realities of daily life. But Athenaeus felt, seems like he felt differently. Andrew: Oh, yes. But also, there’s this one interesting story in which cooking is celebrated as an art. That’s one of the most famous stories in Deipnosophistae. And so, what happens basically, is this king tells his chef when they’re far away from the ocean that he has a craving for fish and he challenges him to create a substitute for fish. Actually, I can read the quotation. Dylan: Yes, please do. Andrew: “The chef, he took a fresh turnip and cut it in slices thin and long, shaping it just like an anchovy. Then he parboiled it, poured oil upon it, sprinkled salt to taste, spread on the top exactly 40 seeds of black poppy, and satisfied the king’s desire in faraway Scythia. And when King Nicomedes had tasted the turnip, he sang the praises to his friends and he said, ‘The cook and the poet are just alike. The art of each lies in his mind.’” Dylan: That’s cool. It kind of sounds like it would be pretty good, actually. Andrew: When I was doing food history videos in the past, I actually made, I tried to recreate this. I did not count out exactly 40 poppy seeds, but other than that— Dylan: Close enough. Andrew: But I actually kind of could see how it works, because I took these little pieces of turnip and fried them and they got crispy and kind of savory. And I was like, I could see how it maybe resembles a small fried fish. Dylan: We talked at the start of this about the way in which food can connect you to these people of the past and sort of take them out of being these like imaginary fictional characters who are very different from you and just remind you like, these people are just living. They’re just kind of doing the same stuff we’re doing for the most part. If you could go to any ancient dinner party, what dinner party would you go to? Because I know there are some, some of them are recorded and quite famous. Do you ever think about your perfect Roman dinner party? Andrew: Well, actually I do have an answer for that. Dylan: I thought you might. Andrew: Yeah, I guess this is something I’ve—without realizing that I’ve thought about. There’s a lot of stories about the dinners and banquets of the Roman emperor Elagabalus who was legendarily super decadent. One of the ones that I always found interesting was that Elagabalus supposedly had these themed dinners where all the food was one specific color. So like, a blue dinner party or a white dinner party. And I’ve always been fascinated by that. I like a good theme when it comes to a dinner party. Dylan: Wait, which color would you go to? Now you got to be even more specific. Andrew: We have a surviving recipe that is associated with Elagabalus that’s for a chicken dish that’s very white. It’s in a creamy white sauce. And I think I always liked to think that maybe that was from the white party. So perhaps I would go to that one. Dylan: That seems like a good party. And you of all people, you more than anyone I know would actually be prepared to fit in, make small talk and, and make a good showing of yourself. I think book or no book, I would be in a lot of trouble. That was Andrew Coletti. He wrote a great article about Deipnosophistae, which also has in it a modern version of the oldest recorded Greek recipe: this recipe for grilled fish with cheese. Listen, live life on the edge, baby. Go try some fish cheese. You can check it out and try it for yourself. There is a link in the episode description. Listen and subscribe on Apple Podcasts, Spotify, and all major podcast apps. This episode was produced by Johanna Mayer. Our podcast is a co-production of Atlas Obscura and Stitcher Studios. The people who make our show include Doug Baldinger, Chris Naka, Kameel Stanley, Manolo Morales, Amanda McGowan, Alexa Lim, Casey Holford, and Luz Fleming. Our theme music is by Sam Tindall.",
  "author": "The Podcast Team",
  "published": "Wed, 25 Jun 2025 09:30:00 -0400",
  "source": "https://www.atlasobscura.com/feeds/latest",
  "categories": null,
  "byline": "by The Podcast Team June 25, 2025",
  "length": 14747,
  "excerpt": "Want to be a hit at a third-century Roman dinner party? Look no further than ‘Deipnosophistae’ by Athenaeus of Naucratis.",
  "siteName": "Atlas Obscura",
  "favicon": "https://img.atlasobscura.com/9GticEl966ZTAOEQ-dcQskOD50V9_Gt6QboGVSgUHbI/q:81/sm:1/scp:1/aHR0cHM6Ly9zMy5h/bWF6b25hd3MuY29t/L2F0bGFzLWRldi9t/aXNjL2ljb25zL2Zh/dmljb24tMzJ4MzIu/cG5n",
  "text": "Andrew Coletti: Imagine that you have just been invited to a dinner party in third century Rome. Dylan Thuras: Yes. Andrew: This is going to be a very fancy kind of affair. It’s going to be some high-profile guests, and you want to make sure that you’re going to make a good impression. Dylan: Okay. Andrew: So, you’re going to need a few things. You can figure out your outfit, of course. Dylan: Toga. I’m assuming Toga. Andrew: Toga, definitely, as long as you’re a Roman citizen. You’ve got to bring your spoon and napkin, because you have to bring those to an ancient Roman dinner party. Dylan: These are expected of you, that you come with your own silverware. Andrew: Yes, because they’ll be eating out of communal dishes in the center of the table. And there’s just one thing that you have to maybe do some extra preparation, which is the conversation. Dylan: This is a high-society affair. These people are well-traveled. They’re well-read. Let’s say, like, I’m kind of outclassed here. Like, I was invited because I’m, like, the cousin of somebody, and they felt like they had to invite me. How do I get ready for this? How can I actually prepare to not look like a doof? Andrew: Well, that’s when you can breathe a sigh of relief and relax, and you can go to your library. Because you’ve just remembered that you own a copy of a work of literature called Deipnosophistae. Dylan: Of course I do. Deipnosophistae. How could I have forgotten? Well, that’s good. I can’t wait to crack open this book and figure out how it’s going to help me survive. I’m Dylan Thuras. Andrew: And I’m Andrew Coletti. Dylan: And this is Atlas Obscura. Today we are going to be talking about Deipnosophistae and how this book is really the answer to all of my ancient Roman dinner party social problems. This is an edited transcript of the Atlas Obscura Podcast: a celebration of the world’s strange, incredible, and wondrous places. Find the show on Apple Podcasts, Spotify, and all major podcast apps. Athenaeus described various kinds of Greek drinking vessels, like the deep, rounded skyphos and wide, flat kylix. Jastrow / Public domain Dylan Thuras: So you are an editorial fellow at Atlas. You’ve done a ton of writing for Gastro Obscura. And you’ve written a lot specifically about ancient food history. It’s kind of your beat. You are our ancient food history correspondent. And this is also a personal interest of yours. I heard that you recently taught an ancient Roman cooking class. Andrew: Yes. This was at an education venue in Brooklyn called the Brooklyn Brainery. This one that we just did recently was a hands-on cooking class, which was really fun. It was focused on simple Roman recipes, like what everyday people were eating. So we made an herb and cheese spread. We made a beverage using vinegar and honey. Dylan: How do you come up with these menus? How do you choose what you want to serve? Andrew: For this one, I wanted to focus on the food of everyday people. Because a lot of times, Romans and other historical cooking sources, they tend to be very biased towards the food of the elite because that was the stuff that gets written down and written about more. But there are a few examples of those simpler recipes. And I also try to choose things that I think people will actually enjoy eating, too. And if you see it through the lens of their food, it helps you really see ancient people as just living, normal, everyday people. The book that we’re talking about, it’s such an important source of information about ancient Greek and Roman food that if you start researching this topic, eventually you’re just going to run into it. Dylan: Yeah, so this obviously is like an important text. What does the name mean? Andrew: The whole book is written in Greek. So Deipnosophistae in Greek can be translated as “the philosophers at dinner” or like, “the wise people at dinner.” One scholar that I spoke with had a kind of funny translation. He translated it as “banquet wits,” and he said he likes this because it sounds a little bit like “twits.” And there is like a bit of irreverence or humor in the text itself. So, he thought that that was a funny way of translating it. Dylan: Yeah, I mean it shows you something about the culture, that there was so much kind of fine dining and social maneuvering happening in this space that someone would go to the trouble of producing a text, which was actually quite a lot of trouble back then, to be like, here’s kind of what you need to know. Andrew: It’s a very rambling book. The format is hard to pin down. The framing device is that it’s a bunch of people talking at a dinner party. So it’s kind of structured that as the courses of the dinner are coming out, they see a dish and it inspires them to talk about that ingredient. Like the food itself is inspiring what they’re talking about. And they’re telling stories and they’re quoting a lot from other authors. That’s what makes it such an interesting and important text is because it preserves the words of all of these earlier writers. And in some cases, you have writers whose work doesn’t survive in its entirety, but the little piece of it that’s quoted in Deipnosophistae is what we have that survives. Dylan: It’s like super meta because it’s like in the format of a dinner party conversation, but is also like a great quotes book so that you can reference it for your future dinner. So, Deipnosophistae contains these quotes, it contains these kind of philosophical tidbits, but it also seems like it also has real recipes in here. Andrew: Well, one of the most significant things is it contains the oldest recorded known recipe in Greek. During this time, especially the Greek cities in what is now Sicily, were known for kind of fancy haute cuisine. And so the recipe that we have in Deipnosophistae is for a grilled fish. It’s a type of fish called ribbon fish, and it’s topped with grated cheese and olive oil. Dylan: That sounds nice. That sounds delicious. Andrew: Yeah, I’ve tried it. Dylan: Oh, how was it? Andrew: I enjoyed it. I know it’s sometimes today, it’s taboo to put cheese and fish together. Dylan: I don’t know, it seems okay. I’m Midwestern though, I’ll put cheese on literally anything. Andrew: Even in the ancient world, apparently there were some authors that disagreed with this. Even in ancient times, it was controversial. Dylan: I see, I see. What else is in this book? Andrew: Another really cool milestone that’s kind of preserved in Deipnosophistae is talking about those same cities from Sicily, like the city of Sybaris. They mentioned that master chefs in Sybaris could own a one-year patent on their recipes so that nobody would be allowed to make them except the creator. This is actually considered our earliest known evidence of patent law for intellectual property. Dylan: That’s amazing, because there isn’t actually patent law for recipes now. I like the idea of it being a one-year patent on a recipe because it’s kind of like, okay, you get a year to be a really hot star chef, and then everybody gets to take a crack at doing the thing. I kind of feel like that would be a good thing to bring back. So, this book’s fascinating because it’s so many things. In a way, it just reminds me of what I sometimes call a tidbits book, which collects a lot of little stories or a lot of quotes or just this and that. It reminds me of the books that people sometimes put on the back of a toilet, like the Uncle John’s Bathroom Reader kind of thing. The thing that you pick up and you sort of browse through it, it’s not really meant to be necessarily read in a go. You kind of open to some pages and go like, ah, interesting, very enlightening, and then you close it and you put it back on the back of the toilet. Andrew: There’s a couple of different interpretations as to why the book was actually written. Dylan: I assume it was to help me succeed at this dinner party, but apparently maybe something else. Andrew: Yeah, that’s for sure one interpretation. So the idea that Deipnosophistae is this manual on how to impress people and seem educated at a dinner party, that idea comes from Adam Cody, who is a professor of humanities at the Virginia Military Institute. His idea was that the structure is designed to help you remember a good quote or tidbit to share during different courses or when different things come out. So, if you’re thinking about, I want a good literary quote about oysters, where in the banquet do they serve oysters? Well, it’s usually an appetizer, so I look in the beginning of the book, and it’s like an indexing system for the book. Dylan: Right. A way of mapping what topics are right for what portion of the evening. Andrew: He compares it to, if you’ve heard of the mind palace memory technique, that is something that actually also comes from ancient Greece. It’s the idea that you visualize a physical space as a way of helping memorize and recall information. Dylan: Oh, right. That’s cool. I like that interpretation. That seems good. Andrew: Well, the other scholar that I spoke with was Douglas Olson, who is a classics professor at the University of Minnesota. He thinks of it more as an informational magazine that just has many articles and many points of view that maybe the purpose is just to highlight and preserve the best of Greek literature and the best of Greek culture. Because, it’s being written in the Roman Empire, but by a Greek who is writing in Greek and quoting from really old Greek literature. And it’s taking pride in the past accomplishments of the Greeks at a time when Greece is no longer a major power and Rome is very much the main power of the Mediterranean. But, collecting the best of what it means to be Greek. Dylan: There is something very interesting about writing a book that theoretically is about succeeding at a Roman dinner party and having it all be Greek literature quotes from a different era and empire. Do we know anything about the author? Andrew: We don’t know a ton about him. His name is Athenaeus of Naucratis. We know he was a Greek from Egypt and that maybe he was actually consulting stuff from the Library of Alexandria in order to write this. Dylan: You know, it’s interesting. There’s some kind of progressive, modern ideas in this book. What did other people think of the stuff that Athenaeus was writing about? Andrew: It’s quite interesting, because Athenaeus kind of subtly responds to and disagrees with what Plato said about food. Plato was actually very dismissive of cooking. Like, he didn’t think of cooking as a high art form. Just like, oh, it’s just something you have to do like in order to live, you have to eat. He didn’t really see the artistry of it. Dylan: Plato strikes me as someone who is like not taking a shower or eat. Like he was just living in his mind palace and not really into the, you know, realities of daily life. But Athenaeus felt, seems like he felt differently. Andrew: Oh, yes. But also, there’s this one interesting story in which cooking is celebrated as an art. That’s one of the most famous stories in Deipnosophistae. And so, what happens basically, is this king tells his chef when they’re far away from the ocean that he has a craving for fish and he challenges him to create a substitute for fish. Actually, I can read the quotation. Dylan: Yes, please do. Andrew: “The chef, he took a fresh turnip and cut it in slices thin and long, shaping it just like an anchovy. Then he parboiled it, poured oil upon it, sprinkled salt to taste, spread on the top exactly 40 seeds of black poppy, and satisfied the king’s desire in faraway Scythia. And when King Nicomedes had tasted the turnip, he sang the praises to his friends and he said, ‘The cook and the poet are just alike. The art of each lies in his mind.’” Dylan: That’s cool. It kind of sounds like it would be pretty good, actually. Andrew: When I was doing food history videos in the past, I actually made, I tried to recreate this. I did not count out exactly 40 poppy seeds, but other than that— Dylan: Close enough. Andrew: But I actually kind of could see how it works, because I took these little pieces of turnip and fried them and they got crispy and kind of savory. And I was like, I could see how it maybe resembles a small fried fish. Dylan: We talked at the start of this about the way in which food can connect you to these people of the past and sort of take them out of being these like imaginary fictional characters who are very different from you and just remind you like, these people are just living. They’re just kind of doing the same stuff we’re doing for the most part. If you could go to any ancient dinner party, what dinner party would you go to? Because I know there are some, some of them are recorded and quite famous. Do you ever think about your perfect Roman dinner party? Andrew: Well, actually I do have an answer for that. Dylan: I thought you might. Andrew: Yeah, I guess this is something I’ve—without realizing that I’ve thought about. There’s a lot of stories about the dinners and banquets of the Roman emperor Elagabalus who was legendarily super decadent. One of the ones that I always found interesting was that Elagabalus supposedly had these themed dinners where all the food was one specific color. So like, a blue dinner party or a white dinner party. And I’ve always been fascinated by that. I like a good theme when it comes to a dinner party. Dylan: Wait, which color would you go to? Now you got to be even more specific. Andrew: We have a surviving recipe that is associated with Elagabalus that’s for a chicken dish that’s very white. It’s in a creamy white sauce. And I think I always liked to think that maybe that was from the white party. So perhaps I would go to that one. Dylan: That seems like a good party. And you of all people, you more than anyone I know would actually be prepared to fit in, make small talk and, and make a good showing of yourself. I think book or no book, I would be in a lot of trouble. That was Andrew Coletti. He wrote a great article about Deipnosophistae, which also has in it a modern version of the oldest recorded Greek recipe: this recipe for grilled fish with cheese. Listen, live life on the edge, baby. Go try some fish cheese. You can check it out and try it for yourself. There is a link in the episode description. Listen and subscribe on Apple Podcasts, Spotify, and all major podcast apps. This episode was produced by Johanna Mayer. Our podcast is a co-production of Atlas Obscura and Stitcher Studios. The people who make our show include Doug Baldinger, Chris Naka, Kameel Stanley, Manolo Morales, Amanda McGowan, Alexa Lim, Casey Holford, and Luz Fleming. Our theme music is by Sam Tindall.",
  "image": "https://img.atlasobscura.com/QG-IaiYdfG4wzabzPhf4S4OHihqvqqxf7paHFWL6m00/rt:fit/w:600/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy8yOTczODc4Zi1k/MDg0LTQwMzMtYTdk/ZS0xZWE4MDJiMjRl/NDE0NmQ5ZTBlZjMy/NGNkZjk3OGZfZDIy/MTY1MWQtOGViNy00/ZGEzLTg5YmQtODJk/YzkwZGFiMmY0Zjc0/NzVjOTg4YTNlZDc2/Y2ZmX0JhbnF1ZXRl/cnNfQ2FnZV9Mb3V2/cmVfRzEzMy5qcGc.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-body\"\u003e\n\n            \n\u003chr/\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan\u003e\u003cspan\u003eAndrew Coletti: \u003c/span\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/strong\u003e\u003cspan\u003e\u003cspan\u003eImagine that you \u003c/span\u003e\u003c/span\u003ehave just been invited to a dinner party in third century Rome.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan Thuras:\u003c/strong\u003e Yes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eThis is going to be a very fancy kind of affair. It’s going to be some high-profile guests, and you want to make sure that you’re going to make a good impression.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e Okay.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eSo, you’re going to need a few things. You can figure out your outfit, of course.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e Toga. I’m assuming Toga.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eToga, definitely, as long as you’re a Roman citizen. You’ve got to bring your spoon and napkin, because you have to bring those to an ancient Roman dinner party.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e These are expected of you, that you come with your own silverware.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eYes, because they’ll be eating out of communal dishes in the center of the table. And there’s just one thing that you have to maybe do some extra preparation, which is the conversation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e This is a high-society affair. These people are well-traveled. They’re well-read. Let’s say, like, I’m kind of outclassed here. Like, I was invited because I’m, like, the cousin of somebody, and they felt like they had to invite me. How do I get ready for this? How can I actually prepare to not look like a doof?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eWell, that’s when you can breathe a sigh of relief and relax, and you can go to your library. Because you’ve just remembered that you own a copy of a work of literature called \u003cem\u003eDeipnosophistae\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eOf course I do. \u003cem\u003eDeipnosophistae\u003c/em\u003e. How could I have forgotten? Well, that’s good. I can’t wait to crack open this book and figure out how it’s going to help me survive. I’m Dylan Thuras.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eAnd I’m Andrew Coletti.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eAnd this is Atlas Obscura. Today we are going to be talking about \u003cem\u003eDeipnosophistae\u003c/em\u003e and how this book is really the answer to all of my ancient Roman dinner party social problems.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis is an edited transcript of the \u003c/em\u003e\u003ca href=\"https://www.atlasobscura.com/podcast\"\u003e\u003cem\u003eAtlas Obscura Podcast\u003c/em\u003e\u003c/a\u003e\u003cem\u003e: a celebration of the world’s strange, incredible, and wondrous places. Find the show on \u003c/em\u003e\u003ca href=\"https://go.skimresources.com/?id=89027X1542228\u0026amp;isjs=1\u0026amp;jv=15.7.1\u0026amp;sref=https%3A%2F%2Fwww.atlasobscura.com%2Farticles%2Fpodcast-montezuma-well\u0026amp;url=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fthe-atlas-obscura-podcast%2Fid1555769970\u0026amp;xs=1\u0026amp;xtz=300\u0026amp;xuuid=f238828fc9c8f1386593b6f8b1d81e7b\u0026amp;xjsf=other_click__contextmenu%20%5B2%5D\"\u003e\u003cem\u003eApple Podcasts\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, \u003c/em\u003e\u003ca href=\"https://open.spotify.com/show/0s0c4Z99PwbW8efTmHckyT\"\u003e\u003cem\u003eSpotify\u003c/em\u003e\u003c/a\u003e\u003cem\u003e, and all major podcast apps.\u003c/em\u003e\u003c/p\u003e\n\u003cfigure\u003e\u003cimg src=\"https://img.atlasobscura.com/kdlaKTQTg7TzMb0MzOYurHs_17ouEdOzRe5_MY8Ybhc/rs:fill:12000:12000/q:81/sm:1/scp:1/ar:1/aHR0cHM6Ly9hdGxh/cy1kZXYuczMuYW1h/em9uYXdzLmNvbS91/cGxvYWRzL2Fzc2V0/cy8yOTczODc4Zi1k/MDg0LTQwMzMtYTdk/ZS0xZWE4MDJiMjRl/NDE0NmQ5ZTBlZjMy/NGNkZjk3OGZfZDIy/MTY1MWQtOGViNy00/ZGEzLTg5YmQtODJk/YzkwZGFiMmY0Zjc0/NzVjOTg4YTNlZDc2/Y2ZmX0JhbnF1ZXRl/cnNfQ2FnZV9Mb3V2/cmVfRzEzMy5qcGc.jpg\" alt=\"Athenaeus described various kinds of Greek drinking vessels, like the deep, rounded \u0026lt;em\u0026gt;skyphos\u0026lt;/em\u0026gt; and wide, flat \u0026lt;em\u0026gt;kylix\u0026lt;/em\u0026gt;.\" width=\"auto\" data-kind=\"article-image\" id=\"article-image-105602\" loading=\"lazy\"/\u003e\u003cfigcaption\u003eAthenaeus described various kinds of Greek drinking vessels, like the deep, rounded \u003cem\u003eskyphos\u003c/em\u003e and wide, flat \u003cem\u003ekylix\u003c/em\u003e. \u003ca target=\"_blank\" href=\"https://commons.wikimedia.org/wiki/File:Banqueters_Cage_Louvre_G133.jpg\"\u003eJastrow / Public domain\u003c/a\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cstrong\u003eDylan Thuras: \u003c/strong\u003eSo you are an editorial fellow at Atlas. You’ve done a ton of writing for Gastro Obscura. And you’ve written a lot specifically about ancient food history. It’s kind of your beat. You are our ancient food history correspondent. And this is also a personal interest of yours. I heard that you recently taught an ancient Roman cooking class.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Yes. This was at an education venue in Brooklyn called the Brooklyn Brainery. This one that we just did recently was a hands-on cooking class, which was really fun. It was focused on simple Roman recipes, like what everyday people were eating. So we made an herb and cheese spread. We made a beverage using vinegar and honey.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e How do you come up with these menus? How do you choose what you want to serve?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eFor this one, I wanted to focus on the food of everyday people. Because a lot of times, Romans and other historical cooking sources, they tend to be very biased towards the food of the elite because that was the stuff that gets written down and written about more. But there are a few examples of those simpler recipes. And I also try to choose things that I think people will actually enjoy eating, too. And if you see it through the lens of their food, it helps you really see ancient people as just living, normal, everyday people. The book that we’re talking about, it’s such an important source of information about ancient Greek and Roman food that if you start researching this topic, eventually you’re just going to run into it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eYeah, so this obviously is like an important text. What does the name mean?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e The whole book is written in Greek. So \u003cem\u003eDeipnosophistae\u003c/em\u003e in Greek can be translated as “the philosophers at dinner” or like, “the wise people at dinner.” One scholar that I spoke with had a kind of funny translation. He translated it as “banquet wits,” and he said he likes this because it sounds a little bit like “twits.” And there is like a bit of irreverence or humor in the text itself. So, he thought that that was a funny way of translating it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eYeah, I mean it shows you something about the culture, that there was so much kind of fine dining and social maneuvering happening in this space that someone would go to the trouble of producing a text, which was actually quite a lot of trouble back then, to be like, here’s kind of what you need to know.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e It’s a very rambling book. The format is hard to pin down. The framing device is that it’s a bunch of people talking at a dinner party. So it’s kind of structured that as the courses of the dinner are coming out, they see a dish and it inspires them to talk about that ingredient. Like the food itself is inspiring what they’re talking about. And they’re telling stories and they’re quoting a lot from other authors. That’s what makes it such an interesting and important text is because it preserves the words of all of these earlier writers. And in some cases, you have writers whose work doesn’t survive in its entirety, but the little piece of it that’s quoted in \u003cem\u003eDeipnosophistae\u003c/em\u003e is what we have that survives.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e It’s like super meta because it’s like in the format of a dinner party conversation, but is also like a great quotes book so that you can reference it for your future dinner. So, \u003cem\u003eDeipnosophistae\u003c/em\u003e contains these quotes, it contains these kind of philosophical tidbits, but it also seems like it also has real recipes in here.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eWell, one of the most significant things is it contains the oldest recorded known recipe in Greek. During this time, especially the Greek cities in what is now Sicily, were known for kind of fancy haute cuisine. And so the recipe that we have in \u003cem\u003eDeipnosophistae\u003c/em\u003e is for a grilled fish. It’s a type of fish called ribbon fish, and it’s topped with grated cheese and olive oil.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e That sounds nice. That sounds delicious.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Yeah, I’ve tried it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eOh, how was it?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e I enjoyed it. I know it’s sometimes today, it’s taboo to put cheese and fish together.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e I don’t know, it seems okay. I’m Midwestern though, I’ll put cheese on literally anything.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Even in the ancient world, apparently there were some authors that disagreed with this. Even in ancient times, it was controversial.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eI see, I see. What else is in this book?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Another really cool milestone that’s kind of preserved in \u003cem\u003eDeipnosophistae\u003c/em\u003e is talking about those same cities from Sicily, like the city of Sybaris. They mentioned that master chefs in Sybaris could own a one-year patent on their recipes so that nobody would be allowed to make them except the creator. This is actually considered our earliest known evidence of patent law for intellectual property.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eThat’s amazing, because there isn’t actually patent law for recipes now. I like the idea of it being a one-year patent on a recipe because it’s kind of like, okay, you get a year to be a really hot star chef, and then everybody gets to take a crack at doing the thing. I kind of feel like that would be a good thing to bring back. So, this book’s fascinating because it’s so many things. In a way, it just reminds me of what I sometimes call a tidbits book, which collects a lot of little stories or a lot of quotes or just this and that. It reminds me of the books that people sometimes put on the back of a toilet, like the \u003cem\u003eUncle John’s Bathroom Reader\u003c/em\u003e kind of thing. The thing that you pick up and you sort of browse through it, it’s not really meant to be necessarily read in a go. You kind of open to some pages and go like, ah, interesting, very enlightening, and then you close it and you put it back on the back of the toilet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eThere’s a couple of different interpretations as to why the book was actually written.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e I assume it was to help me succeed at this dinner party, but apparently maybe something else.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Yeah, that’s for sure one interpretation. So the idea that \u003cem\u003eDeipnosophistae\u003c/em\u003e is this manual on how to impress people and seem educated at a dinner party, that idea comes from Adam Cody, who is a professor of humanities at the Virginia Military Institute. His idea was that the structure is designed to help you remember a good quote or tidbit to share during different courses or when different things come out. So, if you’re thinking about, I want a good literary quote about oysters, where in the banquet do they serve oysters? Well, it’s usually an appetizer, so I look in the beginning of the book, and it’s like an indexing system for the book.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eRight. A way of mapping what topics are right for what portion of the evening.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eHe compares it to, if you’ve heard of the mind palace memory technique, that is something that actually also comes from ancient Greece. It’s the idea that you visualize a physical space as a way of helping memorize and recall information.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e Oh, right. That’s cool. I like that interpretation. That seems good.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Well, the other scholar that I spoke with was Douglas Olson, who is a classics professor at the University of Minnesota. He thinks of it more as an informational magazine that just has many articles and many points of view that maybe the purpose is just to highlight and preserve the best of Greek literature and the best of Greek culture. Because, it’s being written in the Roman Empire, but by a Greek who is writing in Greek and quoting from really old Greek literature. And it’s taking pride in the past accomplishments of the Greeks at a time when Greece is no longer a major power and Rome is very much the main power of the Mediterranean. But, collecting the best of what it means to be Greek.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eThere is something very interesting about writing a book that theoretically is about succeeding at a Roman dinner party and having it all be Greek literature quotes from a different era and empire. Do we know anything about the author?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e We don’t know a ton about him. His name is Athenaeus of Naucratis. We know he was a Greek from Egypt and that maybe he was actually consulting stuff from the Library of Alexandria in order to write this.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e You know, it’s interesting. There’s some kind of progressive, modern ideas in this book. What did other people think of the stuff that Athenaeus was writing about?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e It’s quite interesting, because Athenaeus kind of subtly responds to and disagrees with what Plato said about food. Plato was actually very dismissive of cooking. Like, he didn’t think of cooking as a high art form. Just like, oh, it’s just something you have to do like in order to live, you have to eat. He didn’t really see the artistry of it.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e Plato strikes me as someone who is like not taking a shower or eat. Like he was just living in his mind palace and not really into the, you know, realities of daily life. But Athenaeus felt, seems like he felt differently.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Oh, yes. But also, there’s this one interesting story in which cooking is celebrated as an art. That’s one of the most famous stories in \u003cem\u003eDeipnosophistae\u003c/em\u003e. And so, what happens basically, is this king tells his chef when they’re far away from the ocean that he has a craving for fish and he challenges him to create a substitute for fish. Actually, I can read the quotation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eYes, please do.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003e“The chef, he took a fresh turnip and cut it in slices thin and long, shaping it just like an anchovy. Then he parboiled it, poured oil upon it, sprinkled salt to taste, spread on the top exactly 40 seeds of black poppy, and satisfied the king’s desire in faraway Scythia. And when King Nicomedes had tasted the turnip, he sang the praises to his friends and he said, ‘The cook and the poet are just alike. The art of each lies in his mind.’”\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eThat’s cool. It kind of sounds like it would be pretty good, actually.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e When I was doing food history videos in the past, I actually made, I tried to recreate this. I did not count out exactly 40 poppy seeds, but other than that—\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan:\u003c/strong\u003e Close enough.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eBut I actually kind of could see how it works, because I took these little pieces of turnip and fried them and they got crispy and kind of savory. And I was like, I could see how it maybe resembles a small fried fish.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eWe talked at the start of this about the way in which food can connect you to these people of the past and sort of take them out of being these like imaginary fictional characters who are very different from you and just remind you like, these people are just living. They’re just kind of doing the same stuff we’re doing for the most part. If you could go to any ancient dinner party, what dinner party would you go to? Because I know there are some, some of them are recorded and quite famous. Do you ever think about your perfect Roman dinner party?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e Well, actually I do have an answer for that.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eI thought you might.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew: \u003c/strong\u003eYeah, I guess this is something I’ve—without realizing that I’ve thought about. There’s a lot of stories about the dinners and banquets of the Roman emperor Elagabalus who was legendarily super decadent. One of the ones that I always found interesting was that Elagabalus supposedly had these themed dinners where all the food was one specific color. So like, a blue dinner party or a white dinner party. And I’ve always been fascinated by that. I like a good theme when it comes to a dinner party.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eWait, which color would you go to? Now you got to be even more specific.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAndrew:\u003c/strong\u003e We have a surviving recipe that is associated with Elagabalus that’s for a chicken dish that’s very white. It’s in a creamy white sauce. And I think I always liked to think that maybe that was from the white party. So perhaps I would go to that one.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDylan: \u003c/strong\u003eThat seems like a good party. And you of all people, you more than anyone I know would actually be prepared to fit in, make small talk and, and make a good showing of yourself. I think book or no book, I would be in a lot of trouble. That was Andrew Coletti. He wrote a great \u003ca href=\"https://www.atlasobscura.com/articles/eat-like-a-greek-philosopher-oldest-fish-recipe\"\u003earticle about \u003cem\u003eDeipnosophistae\u003c/em\u003e\u003c/a\u003e, which also has in it a modern version of the oldest recorded Greek recipe: this recipe for grilled fish with cheese. Listen, live life on the edge, baby. Go try some fish cheese. You can check it out and try it for yourself. There is a link in the episode description.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003eListen and subscribe on \u003ca href=\"https://podcasts.apple.com/us/podcast/the-atlas-obscura-podcast/id1555769970\"\u003eApple Podcasts\u003c/a\u003e, \u003ca href=\"https://open.spotify.com/show/0s0c4Z99PwbW8efTmHckyT\"\u003eSpotify\u003c/a\u003e, and all major podcast apps.\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis episode was produced by Johanna Mayer. Our podcast is a co-production of Atlas Obscura and Stitcher Studios. The people who make our show include Doug Baldinger, Chris Naka, Kameel Stanley, Manolo Morales, Amanda McGowan, Alexa Lim, Casey Holford, and Luz Fleming. \u003c/em\u003e\u003cem\u003eOur theme music is by Sam Tindall.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n          \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2025-06-25T09:30:00-04:00",
  "modifiedTime": "2025-06-25T09:32:59-04:00"
}
