{
  "id": "00234dab-62ab-4319-bc32-0c6b4ade3f62",
  "title": "Refinery29 Loves: Everything To See \u0026 Shop In January",
  "link": "https://www.refinery29.com/en-us/fashion-beauty-news-january?utm_source=feed\u0026utm_medium=rss",
  "description": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find the best things to shop and see in fashion and beauty right now.Stepping into a new year can often feel like you’re a bear who’s woken up halfway through hibernation. Thankfully, 2025 has plenty of glamorous occasions to keep us entertained as we shake off the shock, dust off our laptops, and jump back into the grind. The Golden Globes kicked off awards season with a long list of fashion and beauty knockout moments. Our favorites of the night were Ayo Edebiri’s ‘90s Julia Roberts-inspired gray Loewe suit, Zendaya’s burnt orange satin Louis Vuitton gown, and Kylie Jenner’s direct homage to Elizabeth Hurley’s backless Versace number, which really got the people talking. While our gaze is fixed on the red carpet for more amazing looks as the season ramps up, we’re also keeping an eye on the exciting launches happening in the fashion and beauty space this month. From a new Fenty Skin cleanser to a Louis Vuitton collaboration, click through to see all the new goodies heading your way this January.H\u0026M Studio’s Pre-Spring CapsuleDesigned with transitional dressing and warmer days in mind, H\u0026M Studio’s Pre-Spring Capsule collection features tailored wardrobe essentials with flowing fabrics and voluminous silhouettes — think a long collarless coat, an oversized leather jacket, a sleek black trench made with a windbreaker-type fabric, a wrap-around miniskirt and more. Pieces are available in a black and midnight blue color palette, while a yellow and purple crocus — one of the first blooms of spring — print is also available on a pair of leggings and handkerchief-hem maxi dress. Shop at hm.com on January 30Marine Serre x RepettoBalletcore is lingering for a little bit longer, thanks to the  Marine Serre x Repetto collaboration. The partnership between the two French brands infuses the former’s modern aesthetics with the latter’s classic dance style. (Repetto was founded in 1947 as a ballet shoe company.) The result is two shoe styles: the leather Lilouh flat, embossed with Serre’s signature crescent moon on the toe, and the Camille ballerina, which features a 1-inch block heel and is available in denim, black, white, and fire red moon prints. “As a child, I was captivated by the elegant style of Repetto ballerinas,” Serre said, in a press release. “On top of that, they were crafted near my home in Saint Médard d’Excideuil. For my sister and I, it was magical to visit this factory, which introduced us to the world of craftsmanship.”Shop now at repetto.com Repetto x Marine Serre Lilouh Ballet Flats, $, available at RepettoLouis Vuitton x Murakami Re-Edition CollectionWith Zendaya fronting the campaign, Louis Vuitton is straight out of the gate with the collaboration of the year. Twenty years after its first collection with Japanese artist Takashi Murakami, the French luxury house is back with an internet-breaking re-edition. Leaning into Y2K nostalgia in all the right ways (Paris and Britney were both OG fans), the assortment includes the iconic bright monogrammed Speedy Bandoulière 25 bag, slingback mules, patterned silk scarves, and even a skateboard complete with the Superflat Panda — because why not? Shop at Louis Vuitton nowLouis Vuitton x Takashi Murakami Speedy Bandoulière 25, $, available at Louis VuittonConverse Valentine’s Day Collection + Alex Cosani CampaignConverse is celebrating the season of love with Alex Consani. The model stars in the footwear brand’s Valentine’s Day campaign, called “Love Me, Love Me Not,” highlighting the edgy and feminine sides of self-love. It introduces its themed collection, which includes a pair of Chuck 70 high-tops covered in rosettes, black leather Chuck 70 De Luxe platform heels with a heart-studded strap, pink low-tops, patent leather Mary Janes, rose-adorned apparel, and more.  Shop now at converse.com Converse Chuck 70 Valentine's Day, $, available at ConverseConverse Chuck 70 De Luxe Heel Platform Valentine's Day, $, available at ConverseJ.Crew Teams Up With AraksBefore launching her luxury intimates line Araks, Araks Yeramyan was a member of J.Crew’s design team. Now, the two have reunited with a limited-edition collection of lingerie and loungewear. The Araks x J.Crew capsule features a range of underwear and sleepwear featuring bold colors and elegant design details — think ice blue cotton-silk embroidered pajamas, berry-tinted bralettes, and a color-blocked slip dress with scalloped trims. “The pieces are both effortless and considered, chic without trying too hard,” Yeramyan said of the collab. “These are the clothes you’ll reach for without thinking, yet always feel good in. They carry a quiet confidence, the kind of ease that makes them as much a gift to yourself as anyone else.” Shop now at J.Crew Araks x J.Crew Midi Slip Dress, $, available at J.CrewAraks x J.Crew Beatrice Bralette, $, available at J.CrewPHLUR Golden Rule EDPPHLUR, the brand behind the viral Missing Person fragrance, is back with a new hypnotic scent. Enter: Golden Rule. Encased in a shimmering gold bottle, the brand describes the eau de parfum as “sensual,” combining notes of juicy mandarin and pink pepper with smooth coconut milk, vanilla cream, and orange flower. Warm and feminine, the fragrance is perfect for imbuing a sprinkle of summer into cold winter nights.Shop now at PhlurPhlur Golden Rule Eau de Parfum, $, available at PhlurRixo x Stripe \u0026 StareRixo is known for its playful prints and feminine silhouettes; Stripe \u0026 Stare is recognized for its ultra-comfortable and consciously-made underwear. The only question we have is: How has it taken this long for the two London-based brands to join forces? The Rixo x Stripe \u0026 Stare features must-have essentials (different cuts of underwear, camisoles, bodysuits, and even baby tees) in covetable and cutesy patterns — such as heart- and leopard-prints and florals — and a pair of briefs with the phrase “forget me not” etched across them. Pieces are available in US sizes 2 to 22, and made with 95-percent biodegradable fabric.  Shop at Rixo and Stripe \u0026 Stare on January 16 Fenty Skin Cherry Dub CleanserWhile we start yet another year screaming “Where is the album?!” to the sky, Rihanna remains booked and busy, launching a new lightweight gel cleanser. The product is all about harnessing the Barbados cherry, which is rich in vitamin C. Here the brightening ingredient is combined with niacinamide to improve skin texture and aloe juice for soothing inflammation. Shop now at Fenty BeautyFenty Beauty Cherry Dub Pore Purify'r Gel Cleanser, $, available at Fenty BeautyLoewe x OnSwiss running shoe brand On is one of the fastest growing brands on the market, working with megawatt talent like Zendaya and collaborating with buzzy designers like Jonathan Anderson through Loewe. Having previously reimagined the original Cloudtilt silhouette, Loewe is now revamping the Cloudtilt 2.0 in four accent colorways: all white, fiery orange, khaki, and royal blue. With a sole made of ultra-light EVA foam, these shoes are as comfortable as they are coveted.Shop now at LoeweLoewe x On Cloudtilt 2.0 Sneaker, $, available at LoeweSleeper 10th Anniversary CollectionThe Ukrainian sleepwear experts celebrate its 10th anniversary by launching its very first jersey products as part of the pre-spring 2025 collection. Sitting firmly in the elevated loungewear category, the drop features long-sleeve stretch tees adorned with detachable white feather cuffs, ribbed cotton capri leggings, comfy sweatshirts, short-sleeve T-shirts, and wide-leg joggers alongside a host of more “classic” Sleeper styles, including pink asymmetric dresses and lavender gingham pajamas. Shop now at SleeperSleeper Long Sleeve Stretch-Cotton Jersey T-Shirt with Detachab, $, available at SleeperSol de Janeiro Beija Flor Elasti-Body OilEver since Jodie Turner-Smith preached the benefits of body oil in her epic shower routine, we’ve been on the hunt for a new one to try. Brazilian Bum Bum Cream creators Sol de Janeiro are stepping up to the plate this month with the launch of a lightweight body oil scented with pink dragon fruit and hibiscus. Cacay oil is said to boost collagen and elastin production, while squalane plumps and amaranthus flower seed extract moisturize deeply. Be sure to apply to damp skin for maximum hydration.Shop now at SephoraSol de Janeiro Beija Flor Body Oil, $, available at SephoraLevi's x UNDERCOVERIn honor of its 35th anniversary, Japanese luxury streetwear brand Undercover has once again teamed up with Levi’s. The second collaboration between the two brands fuses their rich heritages. The nine-piece collection includes pieces like a denim trucker jacket with detachable zip detailing (a reference to Undercover’s fall/winter 1998 collection), a pair of 501 jeans with an embroidered zigzag pattern, and apparel with archival Undercover graphics. Red Hot Chili Peppers bassist Flea stars in the campaign to promote the new drop. Shop at Levi’s on January 18 Jenny Bird Love CollectionValentine’s Day is just around the corner, meaning we’re allowed to continue buying gifts for others (and ourselves). Toronto-based jewelry designer Jenny Bird is keeping things classic with an array of heart-shaped accessories including a padlock heart pendant necklace, heart button studs, and a gold ring adorned with a dangling heart charm. Our favorites have to be the subtle heart puff earrings, which appear sculptural from the front and more abstract from the side view — perfect for the lovergirls who like to keep things on the down-low. Shop at Jenny BirdXO, Kitty x Good Light CosmeticsFor the rom-com lovers among us, the return of To All The Boys spinoff XO, Kitty is a welcome distraction from the miserable January weather. Not only is the show coming back to Netflix for a second season (with Peter Kavinsky in tow), it’s also teaming up with Korean beauty brand Good Light to launch a limited-edition lip bundle. The kit’s main gem is the Multi-Peptide Lip Nectar, a non-sticky lip hydrator with ingredients including lychee, vitamin C, glycerin, and yuzu seed peptide. There’s even a collectable keychain included in the backpack-inspired packaging.Shop from 16th January at ULTA Beauty.Like what you see? How about some more R29 goodness, right here?These Are The Biggest Denim Trends For 2025These 8 Color Trends Will Dominate Fashion In 2025The 8 Shoe Trends You'll See Everywhere In 2025",
  "author": "Alicia Lansom",
  "published": "Mon, 27 Jan 2025 20:15:55 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Alicia Lansom",
  "length": 8606,
  "excerpt": "Welcome to Refinery29 Loves, the monthly news bulletin where you’ll find the best things to shop and see in fashion and beauty right now.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "1 of 14H\u0026M Studio’s Pre-Spring CapsuleDesigned with transitional dressing and warmer days in mind, H\u0026M Studio’s Pre-Spring Capsule collection features tailored wardrobe essentials with flowing fabrics and voluminous silhouettes — think a long collarless coat, an oversized leather jacket, a sleek black trench made with a windbreaker-type fabric, a wrap-around miniskirt and more. Pieces are available in a black and midnight blue color palette, while a yellow and purple crocus — one of the first blooms of spring — print is also available on a pair of leggings and handkerchief-hem maxi dress. Shop at hm.com on January 302 of 14Marine Serre x RepettoBalletcore is lingering for a little bit longer, thanks to the  Marine Serre x Repetto collaboration. The partnership between the two French brands infuses the former’s modern aesthetics with the latter’s classic dance style. (Repetto was founded in 1947 as a ballet shoe company.) The result is two shoe styles: the leather Lilouh flat, embossed with Serre’s signature crescent moon on the toe, and the Camille ballerina, which features a 1-inch block heel and is available in denim, black, white, and fire red moon prints. “As a child, I was captivated by the elegant style of Repetto ballerinas,” Serre said, in a press release. “On top of that, they were crafted near my home in Saint Médard d’Excideuil. For my sister and I, it was magical to visit this factory, which introduced us to the world of craftsmanship.”Shop now at repetto.com AdvertisementADVERTISEMENT3 of 14Louis Vuitton x Murakami Re-Edition CollectionWith Zendaya fronting the campaign, Louis Vuitton is straight out of the gate with the collaboration of the year. Twenty years after its first collection with Japanese artist Takashi Murakami, the French luxury house is back with an internet-breaking re-edition. Leaning into Y2K nostalgia in all the right ways (Paris and Britney were both OG fans), the assortment includes the iconic bright monogrammed Speedy Bandoulière 25 bag, slingback mules, patterned silk scarves, and even a skateboard complete with the Superflat Panda — because why not? Shop at Louis Vuitton now4 of 14Converse Valentine’s Day Collection + Alex Cosani CampaignConverse is celebrating the season of love with Alex Consani. The model stars in the footwear brand’s Valentine’s Day campaign, called “Love Me, Love Me Not,” highlighting the edgy and feminine sides of self-love. It introduces its themed collection, which includes a pair of Chuck 70 high-tops covered in rosettes, black leather Chuck 70 De Luxe platform heels with a heart-studded strap, pink low-tops, patent leather Mary Janes, rose-adorned apparel, and more.  Shop now at converse.com 5 of 14J.Crew Teams Up With AraksBefore launching her luxury intimates line Araks, Araks Yeramyan was a member of J.Crew’s design team. Now, the two have reunited with a limited-edition collection of lingerie and loungewear. The Araks x J.Crew capsule features a range of underwear and sleepwear featuring bold colors and elegant design details — think ice blue cotton-silk embroidered pajamas, berry-tinted bralettes, and a color-blocked slip dress with scalloped trims. “The pieces are both effortless and considered, chic without trying too hard,” Yeramyan said of the collab. “These are the clothes you’ll reach for without thinking, yet always feel good in. They carry a quiet confidence, the kind of ease that makes them as much a gift to yourself as anyone else.” Shop now at J.Crew 6 of 14PHLUR Golden Rule EDPPHLUR, the brand behind the viral Missing Person fragrance, is back with a new hypnotic scent. Enter: Golden Rule. Encased in a shimmering gold bottle, the brand describes the eau de parfum as “sensual,” combining notes of juicy mandarin and pink pepper with smooth coconut milk, vanilla cream, and orange flower. Warm and feminine, the fragrance is perfect for imbuing a sprinkle of summer into cold winter nights.Shop now at Phlur7 of 14Rixo x Stripe \u0026 StareRixo is known for its playful prints and feminine silhouettes; Stripe \u0026 Stare is recognized for its ultra-comfortable and consciously-made underwear. The only question we have is: How has it taken this long for the two London-based brands to join forces? The Rixo x Stripe \u0026 Stare features must-have essentials (different cuts of underwear, camisoles, bodysuits, and even baby tees) in covetable and cutesy patterns — such as heart- and leopard-prints and florals — and a pair of briefs with the phrase “forget me not” etched across them. Pieces are available in US sizes 2 to 22, and made with 95-percent biodegradable fabric.  Shop at Rixo and Stripe \u0026 Stare on January 16 AdvertisementADVERTISEMENT8 of 14Fenty Skin Cherry Dub CleanserWhile we start yet another year screaming “Where is the album?!” to the sky, Rihanna remains booked and busy, launching a new lightweight gel cleanser. The product is all about harnessing the Barbados cherry, which is rich in vitamin C. Here the brightening ingredient is combined with niacinamide to improve skin texture and aloe juice for soothing inflammation. Shop now at Fenty Beauty9 of 14Loewe x OnSwiss running shoe brand On is one of the fastest growing brands on the market, working with megawatt talent like Zendaya and collaborating with buzzy designers like Jonathan Anderson through Loewe. Having previously reimagined the original Cloudtilt silhouette, Loewe is now revamping the Cloudtilt 2.0 in four accent colorways: all white, fiery orange, khaki, and royal blue. With a sole made of ultra-light EVA foam, these shoes are as comfortable as they are coveted.Shop now at Loewe10 of 14Sleeper 10th Anniversary CollectionThe Ukrainian sleepwear experts celebrate its 10th anniversary by launching its very first jersey products as part of the pre-spring 2025 collection. Sitting firmly in the elevated loungewear category, the drop features long-sleeve stretch tees adorned with detachable white feather cuffs, ribbed cotton capri leggings, comfy sweatshirts, short-sleeve T-shirts, and wide-leg joggers alongside a host of more “classic” Sleeper styles, including pink asymmetric dresses and lavender gingham pajamas. Shop now at Sleeper11 of 14Sol de Janeiro Beija Flor Elasti-Body OilEver since Jodie Turner-Smith preached the benefits of body oil in her epic shower routine, we’ve been on the hunt for a new one to try. Brazilian Bum Bum Cream creators Sol de Janeiro are stepping up to the plate this month with the launch of a lightweight body oil scented with pink dragon fruit and hibiscus. Cacay oil is said to boost collagen and elastin production, while squalane plumps and amaranthus flower seed extract moisturize deeply. Be sure to apply to damp skin for maximum hydration.Shop now at Sephora12 of 14Levi's x UNDERCOVERIn honor of its 35th anniversary, Japanese luxury streetwear brand Undercover has once again teamed up with Levi’s. The second collaboration between the two brands fuses their rich heritages. The nine-piece collection includes pieces like a denim trucker jacket with detachable zip detailing (a reference to Undercover’s fall/winter 1998 collection), a pair of 501 jeans with an embroidered zigzag pattern, and apparel with archival Undercover graphics. Red Hot Chili Peppers bassist Flea stars in the campaign to promote the new drop. Shop at Levi’s on January 18 13 of 14Jenny Bird Love CollectionValentine’s Day is just around the corner, meaning we’re allowed to continue buying gifts for others (and ourselves). Toronto-based jewelry designer Jenny Bird is keeping things classic with an array of heart-shaped accessories including a padlock heart pendant necklace, heart button studs, and a gold ring adorned with a dangling heart charm. Our favorites have to be the subtle heart puff earrings, which appear sculptural from the front and more abstract from the side view — perfect for the lovergirls who like to keep things on the down-low. Shop at Jenny Bird14 of 14XO, Kitty x Good Light CosmeticsFor the rom-com lovers among us, the return of To All The Boys spinoff XO, Kitty is a welcome distraction from the miserable January weather. Not only is the show coming back to Netflix for a second season (with Peter Kavinsky in tow), it’s also teaming up with Korean beauty brand Good Light to launch a limited-edition lip bundle. The kit’s main gem is the Multi-Peptide Lip Nectar, a non-sticky lip hydrator with ingredients including lychee, vitamin C, glycerin, and yuzu seed peptide. There’s even a collectable keychain included in the backpack-inspired packaging.Shop from 16th January at ULTA Beauty.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11839535.png?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e1 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003e\u003ch2\u003eH\u0026amp;M Studio’s Pre-Spring Capsule\u003c/h2\u003e\u003c/strong\u003e\u003cbr/\u003eDesigned with transitional dressing and warmer days in mind, \u003ca href=\"https://www.refinery29.com/en-us/hm-studio-collection-autumn-winter-2024\"\u003eH\u0026amp;M Studio\u003c/a\u003e’s Pre-Spring Capsule collection features tailored \u003ca href=\"https://www.refinery29.com/en-us/how-to-wear-wardrobe-staples-fashion-director-tips\"\u003ewardrobe essentials\u003c/a\u003e with flowing fabrics and voluminous silhouettes — think a long collarless coat, an oversized leather jacket, a sleek black trench made with a windbreaker-type fabric, a wrap-around miniskirt and more. Pieces are available in a black and midnight blue color palette, while a yellow and purple crocus — one of the first blooms of spring — print is also available on a pair of leggings and handkerchief-hem maxi dress. \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop at \u003c/em\u003e\u003ca href=\"http://hm.com\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003ehm.com\u003c/em\u003e\u003c/a\u003e\u003cem\u003e on January 30\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e2 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://repetto.com/en/pages/repetto-x-marine-serre\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cstrong\u003e\u003ch2\u003eMarine Serre x Repetto\u003c/h2\u003e\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003e\u003ca href=\"https://www.refinery29.com/en-us/balletcore-fashion-trend\"\u003eBalletcore\u003c/a\u003e is lingering for a little bit longer, thanks to the  Marine Serre x Repetto collaboration. The partnership between the two French brands infuses the former’s modern aesthetics with the latter’s classic dance style. (Repetto was founded in 1947 as a ballet shoe company.) The result is two shoe styles: the leather Lilouh flat, embossed with Serre’s signature crescent moon on the toe, and the \u003ca href=\"https://repetto.com/en/products/camille-moon-marine-serre-swan-beige-and-black-v4235v-1474\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eCamille ballerina\u003c/a\u003e, which features a 1-inch block heel and is available in denim, black, white, and fire red moon prints. “As a child, I was captivated by the elegant style of Repetto ballerinas,” Serre said, in a press release. “On top of that, they were crafted near my home in Saint Médard d’Excideuil. For my sister and I, it was magical to visit this factory, which introduced us to the world of craftsmanship.”\u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003c/em\u003e\u003ca href=\"https://repetto.com/en/pages/repetto-x-marine-serre\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003erepetto.com\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e3 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://us.louisvuitton.com/eng-us/new/for-women/louis-vuitton-x-murakami/_/N-t2xost9\" target=\"_blank\"\u003eLouis Vuitton x Murakami Re-Edition Collection\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eWith Zendaya fronting the campaign, Louis Vuitton is straight out of the gate with the collaboration of the year. Twenty years after its first collection with Japanese artist Takashi Murakami, the French luxury house is back with an internet-breaking re-edition. Leaning into Y2K nostalgia in all the right ways (Paris and Britney were both OG fans), the assortment includes the iconic bright monogrammed Speedy Bandoulière 25 bag, slingback mules, patterned silk scarves, and even a skateboard complete with the Superflat Panda — because why not? \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop at \u003ca rel=\"noreferrer noopener\" aria-label=\"Louis Vuitton (opens in a new tab)\" href=\"https://uk.louisvuitton.com/eng-gb/products/lv-x-tm-speedy-bandouliere-25-bag-nvprod5940158v/M13085\" target=\"_blank\"\u003eLouis Vuitton\u003c/a\u003e now\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e4 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.converse.com/shop/valentines-day-collection\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cstrong\u003e\u003ch2\u003eConverse Valentine’s Day Collection + Alex Cosani Campaign\u003c/h2\u003e\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003eConverse is celebrating the season of love with \u003ca href=\"https://www.instagram.com/alexconsani/?hl=en\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eAlex Consani\u003c/a\u003e. The model stars in the footwear brand’s Valentine’s Day campaign, called “Love Me, Love Me Not,” highlighting the edgy and feminine sides of self-love. It introduces its themed collection, which includes a pair of Chuck 70 high-tops covered in rosettes, black leather Chuck 70 De Luxe platform heels with a heart-studded strap, pink low-tops, patent leather Mary Janes, rose-adorned apparel, and more. \u003c/p\u003e\u003cp\u003e \u003cem\u003eShop now at \u003c/em\u003e\u003ca href=\"https://www.converse.com/shop/valentines-day-collection\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003econverse.com\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e5 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.jcrew.com/feature/araks-x-jcrew\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cstrong\u003e\u003ch2\u003eJ.Crew Teams Up With Araks\u003c/h2\u003e\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003eBefore launching her luxury intimates line Araks, Araks Yeramyan was a member of \u003ca href=\"https://www.refinery29.com/en-us/christopher-john-rogers-jcrew-collaboration\"\u003eJ.Crew\u003c/a\u003e’s design team. Now, the two have reunited with a limited-edition collection of lingerie and loungewear. The Araks x J.Crew capsule features a range of underwear and sleepwear featuring \u003ca href=\"https://www.refinery29.com/en-us/fashion-color-trends-2025\"\u003ebold colors\u003c/a\u003e and elegant design details — think ice blue cotton-silk embroidered pajamas, berry-tinted bralettes, and a color-blocked slip dress with scalloped trims. “The pieces are both effortless and considered, chic without trying too hard,” Yeramyan \u003ca href=\"https://www.jcrew.com/feature/araks-x-jcrew\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003esaid of the collab\u003c/a\u003e. “These are the clothes you’ll reach for without thinking, yet always feel good in. They carry a quiet confidence, the kind of ease that makes them as much a gift to yourself as anyone else.” \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003c/em\u003e\u003ca href=\"https://www.jcrew.com/feature/araks-x-jcrew\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eJ.Crew\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e6 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://phlur.com/pages/golden-rule\" target=\"_blank\"\u003ePHLUR Golden Rule EDP\u003c/a\u003e\u003c/h2\u003e\u003cp\u003ePHLUR, the brand behind the viral Missing Person fragrance, is back with a new hypnotic scent. Enter: Golden Rule. Encased in a shimmering gold bottle, the brand describes the eau de parfum as “sensual,” combining notes of juicy mandarin and pink pepper with smooth coconut milk, vanilla cream, and orange flower. Warm and feminine, the fragrance is perfect for imbuing a sprinkle of summer into cold winter nights.\u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://phlur.com/pages/golden-rule\" target=\"_blank\"\u003ePhlur\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e7 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://rixolondon.com/en-us/pages/stripe-and-stare-sign-up\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cstrong\u003e\u003ch2\u003eRixo x Stripe \u0026amp; Stare\u003c/h2\u003e\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003eRixo is known for its playful prints and feminine silhouettes; Stripe \u0026amp; Stare is recognized for its ultra-comfortable and consciously-made underwear. The only question we have is: How has it taken \u003cem\u003ethis \u003c/em\u003elong for the two London-based brands to join forces? The Rixo x Stripe \u0026amp; Stare features must-have essentials (different cuts of underwear, camisoles, bodysuits, and even baby tees) in covetable and cutesy patterns — such as heart- and leopard-prints and florals — and a pair of briefs with the phrase “forget me not” etched across them. Pieces are available in US sizes 2 to 22, and made with 95-percent biodegradable fabric.  \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop at \u003c/em\u003e\u003ca href=\"https://rixolondon.com/en-us/pages/stripe-and-stare-sign-up\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eRixo\u003c/em\u003e\u003c/a\u003e\u003cem\u003e and \u003c/em\u003e\u003ca href=\"https://stripeandstare.com/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eStripe \u0026amp; Stare\u003c/em\u003e\u003c/a\u003e\u003cem\u003e on January 16 \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e8 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://fentybeauty.com/products/cherry-dub-pore-purifyr-gel-cleanser-with-niacinamide-aloe-juice?variant=43097737527341\" target=\"_blank\"\u003eFenty Skin Cherry Dub Cleanser\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eWhile we start yet another year screaming “Where is the album?!” to the sky, Rihanna remains booked and busy, launching a new lightweight gel cleanser. The product is all about harnessing the Barbados cherry, which is rich in vitamin C. Here the brightening ingredient is combined with niacinamide to improve skin texture and aloe juice for soothing inflammation. \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003ca href=\"https://fentybeauty.com/products/cherry-dub-pore-purifyr-gel-cleanser-with-niacinamide-aloe-juice?variant=43097737527341\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\"\u003eFenty Beauty\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e9 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003cstrong\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.loewe.com/usa/en/loewe-x-on/women\" target=\"_blank\"\u003eLoewe x On\u003c/a\u003e\u003c/strong\u003e\u003c/h2\u003e\u003cp\u003eSwiss \u003ca href=\"https://www.refinery29.com/en-us/on-running-shoes-styling\"\u003erunning shoe brand On\u003c/a\u003e is one of the fastest growing brands on the market, working with megawatt talent like Zendaya and collaborating with buzzy designers like Jonathan Anderson through Loewe. Having previously reimagined the original Cloudtilt silhouette, Loewe is now revamping the Cloudtilt 2.0 in four accent colorways: all white, fiery orange, khaki, and royal blue. With a sole made of ultra-light EVA foam, these shoes are as comfortable as they are coveted.\u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.loewe.com/usa/en/loewe-x-on/women\" target=\"_blank\"\u003eLoewe\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e10 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://the-sleeper.com/\" target=\"_blank\"\u003eSleeper 10th Anniversary Collection\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eThe Ukrainian sleepwear experts celebrate its 10th anniversary by launching its very first jersey products as part of the pre-spring 2025 collection. Sitting firmly in the elevated loungewear category, the drop features long-sleeve stretch tees adorned with detachable white feather cuffs, ribbed cotton capri leggings, comfy sweatshirts, short-sleeve T-shirts, and wide-leg joggers alongside a host of more “classic” Sleeper styles, including pink asymmetric dresses and lavender gingham pajamas. \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://the-sleeper.com/\" target=\"_blank\"\u003eSleeper\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e11 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.sephora.com/ca/en/product/beija-flor-tm-body-oil-P514923\" target=\"_blank\"\u003eSol de Janeiro Beija Flor Elasti-Body Oil\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eEver since Jodie Turner-Smith preached the benefits of body oil in her epic shower routine, we’ve been on the hunt for a new one to try. Brazilian Bum Bum Cream creators Sol de Janeiro are stepping up to the plate this month with the launch of a lightweight body oil scented with pink dragon fruit and hibiscus. Cacay oil is said to boost collagen and elastin production, while squalane plumps and amaranthus flower seed extract moisturize deeply. Be sure to apply to damp skin for maximum hydration.\u003c/p\u003e\u003cp\u003e\u003cem\u003eShop now at \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://www.sephora.com/ca/en/product/beija-flor-tm-body-oil-P514923\" target=\"_blank\"\u003eSephora\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e12 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.levi.com/US/en_US/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cstrong\u003e\u003ch2\u003eLevi\u0026#39;s x UNDERCOVER\u003c/h2\u003e\u003c/strong\u003e\u003c/a\u003e\u003cbr/\u003eIn honor of its 35th anniversary, Japanese luxury streetwear brand Undercover has once again teamed up with Levi’s. The second collaboration between the two brands fuses their rich heritages. The nine-piece collection includes pieces like a \u003ca href=\"https://www.refinery29.com/en-us/denim-trends-2025\"\u003edenim\u003c/a\u003e trucker jacket with detachable zip detailing (a reference to Undercover’s fall/winter 1998 collection), a pair of 501 jeans with an embroidered zigzag pattern, and apparel with archival Undercover graphics. Red Hot Chili Peppers bassist Flea stars in the campaign to promote the new drop. \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop at \u003c/em\u003e\u003ca href=\"https://www.levi.com/US/en_US/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003e\u003cem\u003eLevi’s\u003c/em\u003e\u003c/a\u003e\u003cem\u003e on January 18 \u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e13 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://jenny-bird.com/collections/love-collection\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eJenny Bird Love Collection\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eValentine’s Day is just around the corner, meaning we’re allowed to continue buying gifts for others (and ourselves). Toronto-based jewelry designer Jenny Bird is keeping things classic with an array of \u003ca href=\"https://www.refinery29.com/en-us/heart-shaped-earrings\"\u003eheart-shaped accessories\u003c/a\u003e including a padlock heart pendant necklace, heart button studs, and a gold ring adorned with a dangling heart charm. Our favorites have to be the subtle heart puff earrings, which appear sculptural from the front and more abstract from the side view — perfect for the lovergirls who like to keep things on the down-low. \u003c/p\u003e\u003cp\u003e\u003cem\u003eShop at \u003ca href=\"https://jenny-bird.com/collections/love-collection\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eJenny Bird\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e14 of 14\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003cem\u003eXO, Kitty\u003c/em\u003e x Good Light Cosmetics\u003c/h2\u003e\u003cp\u003eFor the rom-com lovers among us, the return of \u003cem\u003eTo All The Boys\u003c/em\u003e spinoff \u003cem\u003eXO, Kitty\u003c/em\u003e is a welcome distraction from the miserable January weather. Not only is the show coming back to Netflix for a \u003ca href=\"https://www.refinery29.com/en-us/2025/01/11836048/best-new-streaming-movies-tv-shows-january-2025\"\u003esecond season\u003c/a\u003e (with Peter Kavinsky in tow), it’s also teaming up with Korean beauty brand Good Light to launch a limited-edition lip bundle. The kit’s main gem is the Multi-Peptide Lip Nectar, a non-sticky lip hydrator with ingredients including lychee, vitamin C, glycerin, and yuzu seed peptide. There’s even a collectable keychain included in the backpack-inspired packaging.\u003c/p\u003e\u003cp\u003e\u003cem\u003eShop from 16th January at \u003ca rel=\"noreferrer noopener\" aria-label=\"Beauty Bay (opens in a new tab)\" href=\"https://www.beautybay.com/?\" target=\"_blank\"\u003eULTA Beauty.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-01-27T20:15:55Z",
  "modifiedTime": null
}
