{
  "id": "3578cce4-5f0f-4257-913b-e31e95b156cf",
  "title": "From Light Layers to Spring Dresses, Anthropologie Has All The New Season Staples",
  "link": "https://www.refinery29.com/en-us/new-anthropologie-arrivals?utm_source=feed\u0026utm_medium=rss",
  "description": "Spring is almost here, ushering in a sense of newness and excitement for the year to come — aka the perfect time to build up your 2025 wardrobe with seasonally fit finds. If you ask us, there’s no better destination for ticking off all our sartorial check-boxes than reader-favorite retailer, Anthropologie. From light layers and transitional jackets for park picnics to spring dresses you’ll live in all season long, the retailer’s latest arrivals have your warm-weather needs covered.Amongst the new drop, you’ll also find dream denim for all body types (petite, tall, and plus sizes), vacation-ready accessories, and versatile loungewear — think ultra lightweight lounge sets and linen pieces that won’t have you sweating, from now until the end of summer. It’s a cornucopia of choice that has us constantly clicking 'add to cart'. Read on to shop our favorite new arrivals. All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.By Anthropologie Sleeveless V-Neck Lace Slip Midi DressGet us to the South of Italy, stat! (Or at least, the park on a sunny day…). With its vintage slip-inspired cut, lace edging, and romantic floral print, this dress is made for sunset drinks, al fresco dining, and soaking up the returning sun.By Anthropologie Sleeveless V-Neck Lace Slip Midi Dress, $, available at AnthropologieThe Somerset Shorts: Solid Linen EditionAs it slowly heats up, you’ll find us living in breathable linen pieces — whether that’s working from home, heading out for brunch, or just running errands, they keep us looking and feeling fresh.Anthropologie The Somerset Shorts: Solid Linen Edition, $, available at AnthropologieFarmers Market Raffia ToteMeet your dream new bag. As the name suggests, it’s perfect for carting your fresh produce home from the farmers’ market or packing for weekends away at the coast. (Method dressing, if you will).By Anthropologie Farmers Market Raffia Tote, $, available at AnthropologieBy Anthropologie Sleeveless Sweetheart Gingham Midi DressIt’s not enough to pack every weekend with picnic plans, we want to dress like it too. The trick to styling gingham print? Either embrace the maximalist, twee vibe and pair it with equally themed rattan accessories (your very own basket bag, à la Jane Birkin), or break up the pattern with solid pieces and trusty denim. By Anthropologie Sleeveless Sweetheart Gingham Midi Dress, $, available at AnthropologieThe Colette Cropped High-Rise Wide-Leg Jeans by MaeveThis is one of Anthro’s most popular denim styles; a wide-leg cut that doesn’t swallow petite frames or cut off long legs, is available in plus sizes up to 26 W and adaptive sizes, and is made of sturdy, thick denim that feels supportive but also super comfortable. So, it’s hardly surprising that it’s been refreshed for spring in a light, vintage-inspired wash.Maeve The Colette Cropped High-Rise Wide-Leg Jeans, $, available at AnthropologiePilcro Faux-Leather Collar Barn JacketBarn jackets continue to reign as the ultimate transitional layer, offering just the right amount of warmth and protection from April showers and brisk winds, but not too heavy for warming temperatures.Pilcro Faux-Leather Collar Barn Jacket, $, available at AnthropologieMixed Metal Hoop EarringsChunky mixed-metal hoops have been the earring trend du jour for a while now, with big brand names like Missoma and Mejuri leading the charge. Rather than shelling out a small fortune, you can snap up this style for less than $40 at Anthropologie.By Anthropologie Mixed Metal Hoop Earrings, $, available at AnthropologieThe Tobie Button-Front Pleated Shirt Dress by ExquiseFor the last few years, Anthro’s Somerset Dress has dominated attention, but now there’s a new midi here to steal the spotlight. The Tobie has the similar hourglass silhouette that we know and love, but with an extra flattering fit. Added is the shirting-inspired collared neckline, full skirt, and flared sleeves; plus an array of summery striped prints, making this an instant classic. (There’s also a mini version, too, if you want to get your legs out, and a blouse edition.)Exquise The Tobie Button-Front Pleated Shirt Dress, $, available at AnthropologieBHLDN Selma Halter-Neck Satin Maxi DressSpring and summer wedding invitations flooding in? Worry not, this simple, slinky dress — available in an array of seasonal brights like baby pink, butter yellow, and sky blue — is here to save the day.BHLDN Selma Halter-Neck Satin Maxi Dress, $, available at AnthropologieMatisse Eloise Woven Ballet FlatsLoved the breathability of last year’s mesh ballet flat trend, but need a little more structure to your footwear? These are the shoes for you.Matisse Eloise Woven Ballet Flats, $, available at AnthropologieDaily Practice by Anthropologie Full Twist PantsWorkout gear needn’t be boring and basic. Case in point, these whimsical, bow-detailed pants, made out of a lightweight nylon material. They’re easy to dress down for the gym, or up with ballet flats and a pretty blouse for a cool sporty-meets-feminine vibe. Daily Practice by Anthropologie Full Twist Pants, $, available at AnthropologieThe Brigitte Satchel by Melie BiancoWoven bags are officially back for yet another summer of beating out every other handbag style, this time in colorful leather rather than the traditional wicker or raffia. We love this knotted strap design which also incorporates the curved silhouette trend.Melie Bianco The Brigitte Satchel, $, available at AnthropologieMaeve Smocked Muscle TopUpgrade your usual jeans-and-a-tee ‘fits with this cool ruched number that hugs and highlights your curves.Maeve Smocked Muscle Top, $, available at AnthropologiePilcro Zip-Front Wide-Leg OverallsWe love overalls for quick, easy, all-in-one dressing, not to mention they’re the comfiest items in our wardrobe.Pilcro Zip-Front Wide-Leg Overalls, $, available at AnthropologieThe Tilda Knee-Length Slip SkirtMaybe we’ve just been rewatching too much Sex and the City recently, but to us, nothing beats a silky slip skirt, tiny tee, and strappy heels for spring date nights. By Anthropologie The Tilda Knee-Length Slip Skirt, $, available at AnthropologieLike what you see? How about some more R29 goodness, right here?19 Spring Outfit Ideas To Welcome Warmer Weather11 Free People Spring Items Editors Are Carting Up31 Slip Dresses From Low-Key To Dressy",
  "author": "Esther Newman",
  "published": "Thu, 06 Mar 2025 14:29:55 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Esther Newman",
  "length": 4117,
  "excerpt": "From light layers and transitional jackets to romantic dresses, we found the best new arrivals for spring from Anthropologie's new arrivals section. Shop now.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Anthropologie.Spring is almost here, ushering in a sense of newness and excitement for the year to come — aka the perfect time to build up your 2025 wardrobe with seasonally fit finds. If you ask us, there’s no better destination for ticking off all our sartorial check-boxes than reader-favorite retailer, Anthropologie. From light layers and transitional jackets for park picnics to spring dresses you’ll live in all season long, the retailer’s latest arrivals have your warm-weather needs covered.Amongst the new drop, you’ll also find dream denim for all body types (petite, tall, and plus sizes), vacation-ready accessories, and versatile loungewear — think ultra lightweight lounge sets and linen pieces that won’t have you sweating, from now until the end of summer. It’s a cornucopia of choice that has us constantly clicking 'add to cart'. Read on to shop our favorite new arrivals. AdvertisementADVERTISEMENTAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.1 of 15By Anthropologie Sleeveless V-Neck Lace Slip Midi DressGet us to the South of Italy, stat! (Or at least, the park on a sunny day…). With its vintage slip-inspired cut, lace edging, and romantic floral print, this dress is made for sunset drinks, al fresco dining, and soaking up the returning sun.2 of 15The Somerset Shorts: Solid Linen EditionAs it slowly heats up, you’ll find us living in breathable linen pieces — whether that’s working from home, heading out for brunch, or just running errands, they keep us looking and feeling fresh.AdvertisementADVERTISEMENT3 of 15Farmers Market Raffia ToteMeet your dream new bag. As the name suggests, it’s perfect for carting your fresh produce home from the farmers’ market or packing for weekends away at the coast. (Method dressing, if you will).5 of 15The Colette Cropped High-Rise Wide-Leg Jeans by MaeveThis is one of Anthro’s most popular denim styles; a wide-leg cut that doesn’t swallow petite frames or cut off long legs, is available in plus sizes up to 26 W and adaptive sizes, and is made of sturdy, thick denim that feels supportive but also super comfortable. So, it’s hardly surprising that it’s been refreshed for spring in a light, vintage-inspired wash.AdvertisementADVERTISEMENT8 of 15The Tobie Button-Front Pleated Shirt Dress by ExquiseFor the last few years, Anthro’s Somerset Dress has dominated attention, but now there’s a new midi here to steal the spotlight. The Tobie has the similar hourglass silhouette that we know and love, but with an extra flattering fit. Added is the shirting-inspired collared neckline, full skirt, and flared sleeves; plus an array of summery striped prints, making this an instant classic. (There’s also a mini version, too, if you want to get your legs out, and a blouse edition.)9 of 15BHLDN Selma Halter-Neck Satin Maxi DressSpring and summer wedding invitations flooding in? Worry not, this simple, slinky dress — available in an array of seasonal brights like baby pink, butter yellow, and sky blue — is here to save the day.11 of 15Daily Practice by Anthropologie Full Twist PantsWorkout gear needn’t be boring and basic. Case in point, these whimsical, bow-detailed pants, made out of a lightweight nylon material. They’re easy to dress down for the gym, or up with ballet flats and a pretty blouse for a cool sporty-meets-feminine vibe. 12 of 15The Brigitte Satchel by Melie BiancoWoven bags are officially back for yet another summer of beating out every other handbag style, this time in colorful leather rather than the traditional wicker or raffia. We love this knotted strap design which also incorporates the curved silhouette trend.AdvertisementADVERTISEMENT13 of 15Maeve Smocked Muscle TopUpgrade your usual jeans-and-a-tee ‘fits with this cool ruched number that hugs and highlights your curves.15 of 15The Tilda Knee-Length Slip SkirtMaybe we’ve just been rewatching too much Sex and the City recently, but to us, nothing beats a silky slip skirt, tiny tee, and strappy heels for spring date nights. AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11862948.jpg?crop=2000%2C1050%2Cx0%2Cy103",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Anthropologie.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003eSpring is almost here, ushering in a sense of newness and excitement for the year to come — aka the perfect time to build up your \u003ca href=\"https://www.refinery29.com/en-us/spring-2025-fashion-trends\"\u003e2025 wardrobe\u003c/a\u003e with seasonally fit finds. If you ask us, there’s no better destination for ticking off all our sartorial check-boxes than reader-favorite retailer, \u003ca href=\"https://www.anthropologie.com/?ref=logo\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eAnthropologie\u003c/a\u003e. From \u003ca href=\"https://www.refinery29.com/en-us/spring-outfit-ideas-2025\"\u003elight layers\u003c/a\u003e and \u003ca href=\"https://www.refinery29.com/en-us/coat-jacket-trends-spring-2024\"\u003etransitional jackets\u003c/a\u003e for park picnics to \u003ca href=\"https://www.refinery29.com/en-us/spring-wedding-guest-dresses\"\u003espring dresses\u003c/a\u003e you’ll live in all season long, the retailer’s latest arrivals have your warm-weather needs covered.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAmongst the new drop, you’ll also find \u003ca href=\"https://www.refinery29.com/en-us/best-jeans-for-women\"\u003edream denim\u003c/a\u003e for all body types (\u003ca href=\"https://www.refinery29.com/en-us/best-jeans-for-petite-women\"\u003epetite\u003c/a\u003e, tall, and \u003ca href=\"https://www.refinery29.com/en-us/best-plus-size-denim-jeans-women\"\u003eplus\u003c/a\u003e sizes), vacation-ready accessories, and \u003ca href=\"https://www.refinery29.com/en-us/best-matching-sweatsuits-womens\"\u003eversatile loungewear\u003c/a\u003e — think ultra lightweight lounge sets and linen pieces that won’t have you sweating, from now until the end of summer. It’s a cornucopia of choice that has us constantly clicking \u0026#39;add to cart\u0026#39;. Read on to shop our favorite new arrivals. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e1 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/by-anthropologie-sleeveless-v-neck-lace-slip-midi-dress?color=015\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"By Anthropologie Sleeveless V-Neck Lace Slip Midi Dress (opens in a new tab)\"\u003eBy Anthropologie Sleeveless V-Neck Lace Slip Midi Dress\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eGet us to the South of Italy, stat! (Or at least, the park on a sunny day…). With its vintage slip-inspired cut, lace edging, and romantic floral print, this dress is made for sunset drinks, al fresco dining, and soaking up the returning sun.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e2 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/the-somerset-shorts-solid-linen-edition?color=065\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Somerset Shorts: Solid Linen Edition (opens in a new tab)\"\u003eThe Somerset Shorts: Solid Linen Edition\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eAs it slowly heats up, you’ll find us living in breathable linen pieces — whether that’s working from home, heading out for brunch, or just running errands, they keep us looking and feeling fresh.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e3 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/farmers-market-raffia-tote?category=dress-journal-assortment\u0026amp;color=041\u0026amp;type=STANDARD\u0026amp;size=One+Size\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Farmers Market Raffia Tote (opens in a new tab)\"\u003eFarmers Market Raffia Tote\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eMeet your dream new bag. As the name suggests, it’s perfect for carting your fresh produce home from the farmers’ market or packing for weekends away at the coast. (Method dressing, if you will).\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e5 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/the-colette-cropped-high-rise-wide-leg-jeans-by-maeve?category=SEARCHRESULTS\u0026amp;color=000\u0026amp;searchparams=q=the%2520colette%2520cropped%26sayt=true\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Colette Cropped High-Rise Wide-Leg Jeans by Maeve (opens in a new tab)\"\u003eThe Colette Cropped High-Rise Wide-Leg Jeans by Maeve\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eThis is one of Anthro’s most popular denim styles; a wide-leg cut that doesn’t swallow petite frames or cut off long legs, is available in plus sizes up to 26 W and adaptive sizes, and is made of sturdy, thick denim that feels supportive but also super comfortable. So, it’s hardly surprising that it’s been refreshed for spring in a light, vintage-inspired wash.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e8 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca rel=\"noreferrer noopener\" aria-label=\"The Tobie Button-Front Pleated Shirt Dress by Exquise (opens in a new tab)\" href=\"https://www.anthropologie.com/shop/the-tobie-button-front-pleated-shirt-dress-by-exquise?category=dress-journal-assortment\u0026amp;color=059\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\"\u003eThe Tobie Button-Front Pleated Shirt Dress by Exquise\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eFor the last few years,  \u003ca href=\"https://www.refinery29.com/en-gb/anthropologie-somerset-maxi-dress-review\"\u003eAnthro’s Somerset Dress\u003c/a\u003e has dominated attention, but now there’s a new midi here to steal the spotlight. The Tobie has the similar hourglass silhouette that we know and love, but with an extra flattering fit. Added is the shirting-inspired collared neckline, full skirt, and flared sleeves; plus an array of summery striped prints, making this an instant classic. (There’s also a \u003ca href=\"https://www.anthropologie.com/shop/the-tobie-button-front-pleated-shirt-dress-by-exquise-mini-edition?category=dress-journal-assortment\u0026amp;color=237\u0026amp;type=STANDARD\u0026amp;quantity=1\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003emini version\u003c/a\u003e, too, if you want to get your legs out, and a \u003ca href=\"https://www.anthropologie.com/shop/the-tobie-pleated-blouse-by-exquise-short-sleeve-edition?category=new-clothes\u0026amp;color=015\u0026amp;type=STANDARD\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eblouse edition\u003c/a\u003e.)\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e9 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/bhldn-selma-halter-neck-satin-maxi-dress?category=new-clothes\u0026amp;color=066\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"BHLDN Selma Halter-Neck Satin Maxi Dress (opens in a new tab)\"\u003eBHLDN Selma Halter-Neck Satin Maxi Dress\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eSpring and summer wedding invitations flooding in? Worry not, this simple, slinky dress — available in an array of seasonal brights like baby pink, butter yellow, and sky blue — is here to save the day.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e11 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/daily-practice-by-anthropologie-full-twist-pants?category=new-clothes\u0026amp;color=055\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Daily Practice by Anthropologie Full Twist Pants (opens in a new tab)\"\u003eDaily Practice by Anthropologie Full Twist Pants\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eWorkout gear needn’t be boring and basic. Case in point, these whimsical, bow-detailed pants, made out of a lightweight nylon material. They’re easy to dress down for the gym, or up with ballet flats and a pretty blouse for a cool sporty-meets-feminine vibe. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e12 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/the-brigitte-satchel-by-melie-bianco?category=new-shoes-accessories\u0026amp;color=224\u0026amp;type=STANDARD\u0026amp;size=One+Size\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Brigitte Satchel by Melie Bianco (opens in a new tab)\"\u003eThe Brigitte Satchel by Melie Bianco\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eWoven bags are officially back for yet another summer of beating out every other handbag style, this time in colorful leather rather than the traditional wicker or raffia. We love this knotted strap design which also incorporates the \u003ca href=\"https://www.refinery29.com/en-us/crossbody-purses\"\u003ecurved silhouette\u003c/a\u003e trend.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e13 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/maeve-smocked-muscle-top?category=new-clothes\u0026amp;color=060\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Maeve Smocked Muscle Top (opens in a new tab)\"\u003eMaeve Smocked Muscle Top\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eUpgrade your usual jeans-and-a-tee ‘fits with this cool ruched number that hugs and highlights your curves.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e15 of 15\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://www.anthropologie.com/shop/the-tilda-knee-length-slip-skirt2?category=new-clothes\u0026amp;color=059\u0026amp;type=STANDARD\u0026amp;quantity=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Tilda Knee-Length Slip Skirt\\n (opens in a new tab)\"\u003eThe Tilda Knee-Length Slip Skirt\u003cbr/\u003e\u003c/a\u003e\u003c/h2\u003e\u003cp\u003eMaybe we’ve just been rewatching too much \u003cem\u003eSex and the City \u003c/em\u003erecently, but to us, nothing beats a silky slip skirt, tiny tee, and strappy heels for spring date nights. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-06T14:29:55Z",
  "modifiedTime": null
}
