{
  "id": "5a6724cb-ad47-43ea-a022-91d24d8698db",
  "title": "Head rush: cutting-edge tips and treatments in our good hair guide",
  "link": "https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide",
  "description": "Hot stylists, smart gadgets and miraculous serums… Here’s everything you need to make every day a good hair dayThere is something about hair that sparks conversations (and questions! So many questions!) often riddled with frustration. It is a reminder that our hair isn’t simply this thing that sprouts from our scalps. It is much more complex than that. It’s about the right products, people and places that help you achieve something that makes you feel amazing. Which we all want. Post summer, when we see our hair in a different (autumnal) light, makes us consider what we can do to make it thicker, shiner, stronger, fuller, healthier… And sometimes we simply want hair that looks less basic. The industry understands this all too well, which is why so many brands launch a ton of product and treatments at this time.We have sifted through many of their offerings and pulled together a hair special to tackle not every single question, but some of the key ones around hair that I hear time and time again. Why is the Dyson so expensive? How do I combat hair loss? What shampoos will give me thicker hair? Do supplements actually work? Who on social media might just inspire me to have a new style or simply embrace the one I already have? I can’t promise you we have all the answers you want, but hopefully it’s an inspiring start. Continue reading...",
  "author": "Funmi Fetto",
  "published": "Sun, 06 Oct 2024 15:00:02 GMT",
  "source": "https://www.theguardian.com/fashion/rss",
  "categories": [
    "Women's hair",
    "Beauty",
    "Fashion",
    "Life and style"
  ],
  "byline": "Funmi Fetto",
  "length": 15866,
  "excerpt": "Hot stylists, smart gadgets and miraculous serums… Here’s everything you need to make every day a good hair day",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "There is something about hair that sparks conversations (and questions! So many questions!) often riddled with frustration. It is a reminder that our hair isn’t simply this thing that sprouts from our scalps. It is much more complex than that. It’s about the right products, people and places that help you achieve something that makes you feel amazing. Which we all want. Post summer, when we see our hair in a different (autumnal) light, makes us consider what we can do to make it thicker, shiner, stronger, fuller, healthier… And sometimes we simply want hair that looks less basic. The industry understands this all too well, which is why so many brands launch a ton of product and treatments at this time.We have sifted through many of their offerings and pulled together a hair special to tackle not every single question, but some of the key ones around hair that I hear time and time again. Why is the Dyson so expensive? How do I combat hair loss? What shampoos will give me thicker hair? Do supplements actually work? Who on social media might just inspire me to have a new style or simply embrace the one I already have? I can’t promise you we have all the answers you want, but hopefully it’s an inspiring start.Let it shine: frazzled, dull, lacklustre? These smart products will helpBriogeo Yuzu + Plum Oil Sleek Stick, £20, cultbeauty.co.uk Most styling products – particularly those that help achieve a super-shiny look – are not as focused on hair health as they should be. Briogeo’s Yuzu + Plum Oil Sleek Stick includes nourishing and protective antioxidants and vitamins, so you can achieve that slick ponytail without compromising the health of the hair.Grown Alchemist Hydra-Restore Shampoo and Conditioner, £24 each, grownalchemist.com If you find your hair is still frazzled from the heat of your summer holidays, look no further than Grown Alchemist. Its new Hydra-Restore will gently exfoliate your scalp and give your hair a powerful injection of moisture.Leonor Greyl Energisant range, from £34.50, feelunique.com If your hair looks limp and lacklustre, try the new Energisant range, which includes shampoo, conditioner and treatment serum, from this sustainable, luxe Parisian haircare brand. Combining ingredients such as moringa seed, Indian plum and almond protein, it strengthens hair at the follicle (thereby reducing hair thinning) and adds body to the hair without weighing it down.Josh Wood Colour Miracle hair Oil, £15, joshwoodcolour.com Great colour comes down to incredible expertise and good aftercare. Hairstylist Josh Wood – the globally renowned, expert colourist delivers both. His latest launch is a versatile oil that manages frizz and also works as a pre-shampoo or overnight treatment and detangler. However you use it, you can expect shinier and softer locks that look amazing long after you’ve had your colour done.Colour Wow Dream Filter, £26, uk.colourwowhair.com Dull, brittle and breakage-prone hair are just some of the disadvantages of living in a hard water area. Colour Wow’s Dream Filter removes the buildup of the minerals in hard water, which leaves hair looking dull and makes it difficult for moisture to penetrate strands.Living Proof Perfect Hair Day High Shine Gloss, £30, livingproof.com An excellent new launch from one of the industry’s best haircare brands, High Shine Gloss does exactly what it says on the tin. Using a light-enhancing technology, it gives your hair the best shine ever. And unlike most hair glosses, it is lightweight and silicone free, so leaves no residue.‘Start with it on the long side’: Tom Smith on how to adapt to a new fringeFringe benefits: could you change things up with a new crop? Photograph: Jonathan Storey/Getty ImagesA great place to start is to gather up to three photos of fringe styles you like – ideally hair types and face shapes that resemble your own. Show these to your stylist and ask their advice on how to adapt the style to suit you best. Ask about what maintenance is required to have it looking like your photos and how often it will need to be trimmed (I have some clients who pop in for a fringe ‘dust’ every three weeks). Feel free to ask your stylist to cut your fringe on the longer side first, so you can assess and check how your hair naturally settles (this is something I’m in the habit of doing anyway) then, if required, slowly trim it shorter. Ask your stylist to show you an easy way to reset your fringe each morning. Something to note: fringes do typically require some form of tending to every day, so if your daily hair routine is currently minimal, having a fringe cut in may change that. Tom Smith is artist in residence at Billi Currie, an artist at Olaplex and colour director at EvoFor coils and curls: Nià the Light (@niathelight); Michelle Sultan (@hairbymichellesultan); Charlotte Mensah (@charlottemensah)For grey hair: JoAni Johnson (@joanijohnson6000); Linda Rodin (@lindaandwinks); Caroline Labouchere (@carolinelabouchere)For celebrity: Chris Appleton (@chrisappleton1); George Northwood (@george northwood); Larry King (@larrykinghair)For fashion: Jawara (@jawaraw); Sam McKnight (@sammcknight1); Cyndia Harvey (@CyndiaHarvey); Duffy (@duffy_duffy)For Korean hair care: Park Jun Beauty Lab (@parkjunbeautylab)For colour: Josh Wood (@joshwood); Nicola Clarke(@nicolaclarkecolour); Bleach London (@bleachlondon)For wigs: Tokyo Stylez (@tokyostylez); Kim Kimble (@kimblehaircare); Haus of Shee (@hausofshee)Get out of jail free: heat damages hair, so aim for a dryer that is light, powerful, quiet and works to maintain your hair health. Photograph: Pol Kurucz/B\u0026A RepsDyson Supersonic Nural, £399, dyson.co.uk There has long been hype around Dyson. Hairstylists around the world swear by the brand. However, the smart gadgets do come at a price. So the question is: why? Perhaps we need to change our perspective on what Dyson creates. They consider everything from the way the product is shaped to fit your hand, to the weight and then, of course, how it works. The Supersonic Nural hairdryer – their smartest hairdryer yet, is launched this month. It is no ordinary dryer. It has a scalp protector-meets-hair-health sensor that is automatically reduced to 55C – the optimum temperature for scalp comfort and drying speed. It prioritises safety and has a motion sensor that automatically deactivates heat, while decreasing airflow and noise when you are in between styling. It considers everything: the ease and efficiency of the process; the finished results and the health of your hair. So is it worth it? Well, when you consider all the above, yes.GHD Chronos, £289, ghdhair.com Hair straightening is widely considered to be terrible for hair health – particularly if you fry your hair on a regular basis. But choosing the right flat iron limits the damage. The Chronos features cutting-edge ceramic heat technology that ensures the heat distribution across your hair is even. It does this by keeping the plates at a temperature that is high enough to give you a smooth, sleek finish, but not so high that you end up with crispy hair.BaByliss Air Power Pro, £150, boots.com A hairdryer that makes a lot of noise is pleasant to no one. Hence this excellent dryer by BaByliss is a godsend. Lightweight, powerful, performance driven… it has four temperature settings, three airflow settings, two styling concentrator nozzles and a wet-to-dry styling combination for all hair types and textures. It’s also one of the quietest.Hershesons The Wand, £120, hershesons.com Unless your hair is naturally poker straight, it should be able to hold a curl – with the right tools, expertise and styling products. Hershesons, the chic London hair salon headed up by A-list hairstylist Luke Hersheson, has channelled his years of experience into a product line, the most recent of which is the Wand. Super lightweight with a ceramic-coated barrel, which minimises heat damage, it has been created to work at just the right temperature to ensure your curls last and last and last, regardless of your hair type.Manta Detangling Brush, £30, mantahair.com A hairbrush is undoubtedly an anomaly in the world of tech-driven hair tools. And while the thought of a manual hair tool immediately reads like “a lot of work”, Manta makes the detangling process a breeze. Tim Mannington, a hairdresser with more than 25 years in the business, created Manta after his wife lost her hair through cancer. As she recovered and her hair began to grow back, she needed a brush that was effective yet gentle and minimised breakage. There are now numerous options for every hair type – even for babies.Shark SmoothStyle Hot Brush \u0026 Smoothing Comb, £79.99, sharkclean.co.uk This heated brush and comb gets the thumbs up for a few reasons. It is an all-in-one tool that works on both wet and dry hair. It styles, shapes and smooths with minimal heat damage. You can use it on any texture – straight, wavy or curly. In a time where high-priced hair tools have become the norm, having something that does all the above and is still under £100? That’s a win.Less can be more: how to cope with hair loss and what you can do to prevent thinningGood to go: hormone changes, poor diet, age and stress can all cause hair loss Photograph: Pol Kurucz/B\u0026A RepsThe signs of hair loss are easy to spot: a thinner ponytail, more of your scalp showing when you part your hair, shorter hairs – particularly along your hairline – and, of course, increased shedding. Reasons include age, stress, change in hormones, deficiencies in diet, hairstyles that pull too tight (the latter is easy to treat – simply start wearing your hair in a different style). The others, however, are more complex and might need medical attention. That aside, there are things you can certainly do for starters: take regular high-quality hair supplements that incorporate hair- and scalp-strengthening vitamins. This will boost growth and minimise shedding. Use hair products that not only boost scalp health, target hair density and minimise hair loss. Living Proof’s Scalp Care Density Serum is a leave-in treatment infused with pea sprout and amaranth peptides to improve the appearance of thickness and density, but also reduces hair fallout rate. The Genesis haircare line by Kerastase is developed specifically to treat hair thinning (it also offers a hair-diagnostics service and in-salon treatments specifically to deal with this). Davines has a full range of products dedicated to treating hair loss. Typebea, a brand launched by beauty entrepreneur Anna Lahey and singer Rita Ora, has taken a different route from the usual celebrity brands to focus on products concerned with hair growth and hair thinning, while Nioxin offers shampoos and hair serums that will increase the appearance of thicker hair in eight weeks. Still, if you are really concerned about hair loss, it is worth seeing a trichologist. Phillip Kingsley – whose density line is clinically proven to slow hair loss and give you thicker, fuller hair – is still one of the best in the business.Daily helpers: boost growth and pump up the volume with these supplementsWhether you are looking for supplements to encourage growth, attain more volume, or strengthen your hair, there is a supplement on the market that speaks to your needs. But do they work? Well, yes and no. The key to hair supplements, or any supplement, is to choose good quality(not ones that have numerous bulking agents) and to be consistent in taking them. That said, diet is key. Naturopath Rita Arora once told me: “You can’t put crap in your body and still expect supplements to work.” Here are five to consider…Viviscal Hair Growth Supplements, from £37, viviscal.co.uk Female hair follicles start to shrink from our mid-40s, so this hair growth supplement – from the OG of hair supplements – includes ingredients such as AminoMar, a rich marine protein complex, to promote the growth and repair of hair cells.Vida Glow Hairology Capsules, £45, uk.hairology.com Hair thinning and hair loss – be it through age or use of chemical/heat treatments – is addressed by Vida Glow’s Hairology through this once-a-day capsule. The results of the trials are impressive – 34% reduction in hair loss in a month.The Nue Co Growth Phase, £65, uk.thenueco.com Balancing nutritional deficiencies, supporting hormonal health, calming stress and protecting against free radicals for longer, thicker, fuller hair is the mission of this supplement. The blend of vitamins, proteins and adaptogens will reduce hair loss and thinning in 90 days.Philip Kingsley Density Hair Complex, £33, philipkingsley.co.uk Philip Kingsley (the man was one of the world’s leading trichologists) knows a thing or two about hair. Its holistic approach to haircare means it understood the importance of hair and scalp health decades before it became trendy. Which is why all of its supplements include an essential blend of amino acids to ensure the maintenance of healthy hair.Ouai Thick and Full Supplements, £28, cultbeauty.co.uk One of the downsides with many supplements is the taste. Ouai – the brand founded by celebrity hair stylist Jen Atkin – has hair supplements that are formulated with a super-hydrating multivitamin complex to support hair strength – with no unpleasant aftertaste.‘A sharp bob suits anyone’: It’s chic and versatile, but needs maintenanceSnap to it: Anna Wintour. Photograph: Tristan Fewings/Getty ImagesThe chin-grazing cut is back. For the super-sharp bob, think fashion doyenne Anna Wintour, sans fringe, think Jessica Biel, more loose and liberated, think Ayo Edebiri. The undone, textured bob that made Alexa Chung the poster girl of the noughties is still going strong, too. There is the 50s Hollywood Baroque Bob, as seen on the likes of Zendaya. The versatility of the bob, explains Brixton Cowie, creative director at Neil Moodie Studio, is what makes it forever popular. ‘Its length can be adjusted to suit the wearer’s face and hair texture.’ But there is the issue of maintenance. According to Jay Birmingham, celebrity hairstylist and Tresemmé’s brand ambassador: ‘Most bobs require daily styling to stay looking chic.’ A textured bob can be more forgiving as it can be grown out into a ‘lob’ – a long bob. Your tool kit? Texturising spray, a diffuser for that ‘dried naturally’ style and, says Birmingham, a good hair oil, such as Lamellar Shine Oil from Tresemmé.Leave it to the experts: salon hair treatments that are both innovative and helpfulJo Hansford’s Metal Detox, johansford.com Chlorine in swimming pools, residue from the pipes of a soft water system, or hard water from your taps, can all leave traces of metal in your hair. This causes brittleness and dulls colour. Yes, you can now tackle it with an off-the-shelf product (see Colour Wow Dream Filter) but, for a professional approach, head to the Jo Hansford salon (below). Its Metal Detox treatment will neutralise and remove the metals and then protect the hair to prevent new particles from entering. (And you can keep up the good work at home with the Jo Hansford’s Metal Detox product line)Olaplex Bond Shaper Curl Rebuilding Treatment Pro Service, olaplex.com This curl-restoring salon service is a new treatment that restores coils to their never-before-seen glory. Using its now famous bond-building innovation, the professional treatment contains a blend of 23 amino acids and coconut-avocado milk to improve curl retention, control frizz, reduce breakage and increase overall strength. The results are outstanding.K18 Repair Service, K18hair.com For anyone that has experienced hair damage from heat styling, chemical processing or colour, this treatment from K18 is a must. It fortifies the hair leaving it smoother, bouncier and silkier. The results – which can be seen in less than 5 minutes – are accumulative – it will not disappear with your next shampoo.",
  "image": "https://i.guim.co.uk/img/media/0a58e34ab3894df8d63c78ac66cb12cc7a630438/0_1574_5608_3362/master/5608.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=5b4b68cf96b2dc8adf1ba3a1dd87040b",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003eT\u003c/span\u003ehere is something about hair that sparks conversations (and questions! So many questions!) often riddled with frustration. It is a reminder that our hair isn’t simply this thing that sprouts from our scalps. It is much more complex than that. It’s about the right products, people and places that help you achieve something that makes you feel amazing. Which we all want. Post summer, when we see our hair in a different (autumnal) light, makes us consider what we can do to make it thicker, shiner, stronger, fuller, healthier… And sometimes we simply want hair that looks less basic. The industry understands this all too well, which is why so many brands launch a ton of product and treatments at this time.\u003c/p\u003e\u003cfigure id=\"disclaimer\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.DisclaimerBlockElement\"\u003e\u003cspan\u003e\u003c/span\u003e\u003c/figure\u003e\u003cp\u003eWe have sifted through many of their offerings and pulled together a hair special to tackle not every single question, but some of the key ones around hair that I hear time and time again. Why is the Dyson so expensive? How do I combat hair loss? What shampoos will give me thicker hair? Do supplements actually work? Who on social media might just inspire me to have a new style or simply embrace the one I already have? I can’t promise you we have all the answers you want, but hopefully it’s an inspiring start.\u003c/p\u003e\u003ch2 id=\"let-it-shine-frazzled-dull-lacklustre-these-smart-products-will-help\"\u003eLet it shine: frazzled, dull, lacklustre? These smart products will help\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eBriogeo Yuzu + Plum Oil Sleek Stick, £20, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fcultbeauty.co.uk%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003ecultbeauty.co.uk\u003c/a\u003e\u003c/strong\u003e Most styling products – particularly those that help achieve a super-shiny look – are not as focused on hair health as they should be. Briogeo’s Yuzu + Plum Oil Sleek Stick includes nourishing and protective antioxidants and vitamins, so you can achieve that slick ponytail without compromising the health of the hair.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGrown Alchemist Hydra-Restore Shampoo and Conditioner, £24 each, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fgrownalchemist.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003egrownalchemist.com\u003c/a\u003e \u003c/strong\u003eIf you find your hair is still frazzled from the heat of your summer holidays, look no further than Grown Alchemist. Its new Hydra-Restore will gently exfoliate your scalp and give your hair a powerful injection of moisture.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLeonor Greyl Energisant range, from £34.50, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Ffeelunique.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003efeelunique.com\u003c/a\u003e \u003c/strong\u003eIf your hair looks limp and lacklustre, try the new Energisant range, which includes shampoo, conditioner and treatment serum, from this sustainable, luxe Parisian haircare brand. Combining ingredients such as moringa seed, Indian plum and almond protein, it strengthens hair at the follicle (thereby reducing hair thinning) and adds body to the hair without weighing it down.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eJosh Wood Colour Miracle hair Oil, £15, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fjoshwoodcolour.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003ejoshwoodcolour.com\u003c/a\u003e \u003c/strong\u003eGreat colour comes down to incredible expertise and good aftercare. Hairstylist Josh Wood – the globally renowned, expert colourist delivers both. His latest launch is a versatile oil that manages frizz and also works as a pre-shampoo or overnight treatment and detangler. However you use it, you can expect shinier and softer locks that look amazing long after you’ve had your colour done.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eColour Wow Dream Filter, £26, \u003ca href=\"http://uk.colourwowhair.com/\" data-link-name=\"in body link\"\u003euk.colourwowhair.com\u003c/a\u003e\u003c/strong\u003e Dull, brittle and breakage-prone hair are just some of the disadvantages of living in a hard water area. Colour Wow’s Dream Filter removes the buildup of the minerals in hard water, which leaves hair looking dull and makes it difficult for moisture to penetrate strands.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLiving Proof Perfect Hair Day High Shine Gloss, £30, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Flivingproof.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003elivingproof.com\u003c/a\u003e \u003c/strong\u003eAn excellent new launch from one of the industry’s best haircare brands, High Shine Gloss does exactly what it says on the tin. Using a light-enhancing technology, it gives your hair the best shine ever. And unlike most hair glosses, it is lightweight and silicone free, so leaves no residue.\u003c/p\u003e\u003ch2 id=\"start-with-it-on-the-long-side-tom-smith-on-how-to-adapt-to-a-new-fringe\"\u003e‘Start with it on the long side’: Tom Smith on how to adapt to a new fringe\u003c/h2\u003e\u003cfigure id=\"f9ac5dab-62b1-4d0c-9734-d64d609c04ad\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"woman with pink fringe\" src=\"https://i.guim.co.uk/img/media/1bd718efdd2f62b8957ce4a1b65d4ab99bafcc18/0_1238_3780_2267/master/3780.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" width=\"445\" height=\"266.88227513227514\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eFringe benefits: could you change things up with a new crop?\u003c/span\u003e Photograph: Jonathan Storey/Getty Images\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eA great place to start is to gather up to three photos of fringe styles you like – ideally hair types and face shapes that resemble your own. Show these to your stylist and ask their advice on how to adapt the style to suit you best. Ask about what maintenance is required to have it looking like your photos and how often it will need to be trimmed (I have some clients who pop in for a fringe ‘dust’ every three weeks). Feel free to ask your stylist to cut your fringe on the longer side first, so you can assess and check how your hair naturally settles (this is something I’m in the habit of doing anyway) then, if required, slowly trim it shorter. Ask your stylist to show you an easy way to reset your fringe each morning. Something to note: fringes do typically require some form of tending to every day, so if your daily hair routine is currently minimal, having a fringe cut in may change that. \u003cem\u003eTom Smith is artist in residence at Billi Currie, an artist at Olaplex and colour director at Evo\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor coils and curls: \u003c/strong\u003eNià the Light (\u003ca href=\"https://www.instagram.com/niathelight/?hl=en\" data-link-name=\"in body link\"\u003e@niathelight\u003c/a\u003e); Michelle Sultan (@\u003ca href=\"https://www.instagram.com/hairbymichellesultan/?hl=en\" data-link-name=\"in body link\"\u003ehairbymichellesultan); Charlotte Mensah\u003c/a\u003e (\u003ca href=\"https://www.instagram.com/charlottemensah/?hl=en\" data-link-name=\"in body link\"\u003e@charlottemensah\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor grey hair: \u003c/strong\u003eJoAni Johnson (\u003ca href=\"https://www.instagram.com/joanijohnson6000/?hl=en\" data-link-name=\"in body link\"\u003e@joanijohnson6000); \u003c/a\u003eLinda Rodin (\u003ca href=\"https://www.instagram.com/lindaandwinks/?hl=en\" data-link-name=\"in body link\"\u003e@lindaandwinks\u003c/a\u003e); Caroline Labouchere (\u003ca href=\"https://www.instagram.com/carolinelabouchere/\" data-link-name=\"in body link\"\u003e@carolinelabouchere\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor celebrity: \u003c/strong\u003eChris Appleton (\u003ca href=\"https://www.instagram.com/chrisappleton1/?hl=en\" data-link-name=\"in body link\"\u003e@chrisappleton\u003c/a\u003e1); George Northwood (\u003ca href=\"https://www.instagram.com/georgenorthwood/?hl=en\" data-link-name=\"in body link\"\u003e@george northwood\u003c/a\u003e); Larry King (\u003ca href=\"https://www.instagram.com/larrykinghair/?hl=en\" data-link-name=\"in body link\"\u003e@larrykinghair)\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor fashion: \u003c/strong\u003eJawara (\u003ca href=\"https://www.instagram.com/jawaraw/?hl=en\" data-link-name=\"in body link\"\u003e@jawaraw)\u003c/a\u003e; Sam McKnight (\u003ca href=\"https://www.instagram.com/sammcknight1/?hl=en\" data-link-name=\"in body link\"\u003e@sammcknight1\u003c/a\u003e); Cyndia\u003cstrong\u003e \u003c/strong\u003eHarvey (\u003ca href=\"https://www.instagram.com/CyndiaHarvey/\" data-link-name=\"in body link\"\u003e@CyndiaHarvey\u003c/a\u003e); Duffy (\u003ca href=\"https://www.instagram.com/duffy_duffy/?hl=en\" data-link-name=\"in body link\"\u003e@duffy_duffy\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor Korean hair care:\u003c/strong\u003e Park Jun Beauty Lab (\u003ca href=\"https://www.instagram.com/parkjunbeautylab/\" data-link-name=\"in body link\"\u003e@parkjunbeautylab\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor colour: \u003c/strong\u003eJosh Wood (\u003ca href=\"https://www.instagram.com/joshwood/?hl=en\" data-link-name=\"in body link\"\u003e@joshwood\u003c/a\u003e); Nicola Clarke(\u003ca href=\"https://www.instagram.com/nicolaclarkecolour/?hl=en\" data-link-name=\"in body link\"\u003e@nicolaclarkecolour\u003c/a\u003e); Bleach London (\u003ca href=\"https://www.instagram.com/bleachlondon/?hl=en\" data-link-name=\"in body link\"\u003e@bleachlondon\u003c/a\u003e)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFor wigs: \u003c/strong\u003eTokyo Stylez (\u003ca href=\"https://www.instagram.com/tokyostylez/?hl=en-gb\" data-link-name=\"in body link\"\u003e@tokyostylez\u003c/a\u003e); Kim Kimble (\u003ca href=\"https://www.instagram.com/kimblehaircare/?hl=en\" data-link-name=\"in body link\"\u003e@kimblehaircare\u003c/a\u003e); Haus of Shee (\u003ca href=\"https://www.instagram.com/hausofshee/?hl=en\" data-link-name=\"in body link\"\u003e@hausofshee\u003c/a\u003e)\u003c/p\u003e\u003cfigure id=\"993a7930-6355-4a4c-b2b4-1ed7c444ba69\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Get out of jail free: heat damages hair, so aim for a dryer that is light, powerful, quiet and works to maintain your hair health.\" src=\"https://i.guim.co.uk/img/media/f61db165fccf80f5e61497e510478eb5f122570d/0_0_5476_6796/master/5476.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" width=\"445\" height=\"552.2680788897005\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eGet out of jail free: heat damages hair, so aim for a dryer that is light, powerful, quiet and works to maintain your hair health.\u003c/span\u003e Photograph: Pol Kurucz/B\u0026amp;A Reps\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eDyson Supersonic Nural, £399, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=https%3A%2F%2Fwww.dyson.co.uk%2Fen\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003edyson.co.uk\u003c/a\u003e\u003c/strong\u003e There has long been hype around Dyson. Hairstylists around the world swear by the brand. However, the smart gadgets do come at a price. So the question is: why? Perhaps we need to change our perspective on what Dyson creates. They consider everything from the way the product is shaped to fit your hand, to the weight and then, of course, how it works. The Supersonic Nural hairdryer – their smartest hairdryer yet, is launched this month. It is no ordinary dryer. It has a scalp protector-meets-hair-health sensor that is automatically reduced to 55C – the optimum temperature for scalp comfort and drying speed. It prioritises safety and has a motion sensor that automatically deactivates heat, while decreasing airflow and noise when you are in between styling. It considers everything: the ease and efficiency of the process; the finished results and the health of your hair. So is it worth it? Well, when you consider all the above, yes.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eGHD Chronos, £289, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fghdhair.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003eghdhair.com\u003c/a\u003e \u003c/strong\u003eHair straightening is widely considered to be terrible for hair health – particularly if you fry your hair on a regular basis. But choosing the right flat iron limits the damage. The Chronos features cutting-edge ceramic heat technology that ensures the heat distribution across your hair is even. It does this by keeping the plates at a temperature that is high enough to give you a smooth, sleek finish, but not so high that you end up with crispy hair.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBaByliss Air Power Pro, £150, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fboots.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003eboots.com\u003c/a\u003e \u003c/strong\u003eA hairdryer that makes a lot of noise is pleasant to no one. Hence this excellent dryer by BaByliss is a godsend. Lightweight, powerful, performance driven… it has four temperature settings, three airflow settings, two styling concentrator nozzles and a wet-to-dry styling combination for all hair types and textures. It’s also one of the quietest.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHershesons The Wand, £120, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fhershesons.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003ehershesons.com\u003c/a\u003e\u003c/strong\u003e Unless your hair is naturally poker straight, it should be able to hold a curl – with the right tools, expertise and styling products. Hershesons, the chic London hair salon headed up by A-list hairstylist Luke Hersheson, has channelled his years of experience into a product line, the most recent of which is the Wand. Super lightweight with a ceramic-coated barrel, which minimises heat damage, it has been created to work at just the right temperature to ensure your curls last and last and last, regardless of your hair type.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eManta Detangling Brush, £30, \u003ca href=\"http://mantahair.com/\" data-link-name=\"in body link\"\u003emantahair.com\u003c/a\u003e\u003c/strong\u003e A hairbrush is undoubtedly an anomaly in the world of tech-driven hair tools. And while the thought of a manual hair tool immediately reads like “a lot of work”, Manta makes the detangling process a breeze. Tim Mannington, a hairdresser with more than 25 years in the business, created Manta after his wife lost her hair through cancer. As she recovered and her hair began to grow back, she needed a brush that was effective yet gentle and minimised breakage. There are now numerous options for every hair type – even for babies.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eShark SmoothStyle Hot Brush \u0026amp; Smoothing Comb, £79.99, \u003ca href=\"http://sharkclean.co.uk/\" data-link-name=\"in body link\"\u003esharkclean.co.uk\u003c/a\u003e\u003c/strong\u003e This heated brush and comb gets the thumbs up for a few reasons. It is an all-in-one tool that works on both wet and dry hair. It styles, shapes and smooths with minimal heat damage. You can use it on any texture – straight, wavy or curly. In a time where high-priced hair tools have become the norm, having something that does all the above and is still under £100? That’s a win.\u003c/p\u003e\u003ch2 id=\"less-can-be-more-how-to-cope-with-hair-loss-and-what-you-can-do-to-prevent-thinning\"\u003eLess can be more: how to cope with hair loss and what you can do to prevent thinning\u003c/h2\u003e\u003cfigure id=\"d9bcdfe4-8345-41ed-9952-cacb7b1adcef\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Good to go: hormone changes, poor diet, age and stress can all cause hair loss\" src=\"https://i.guim.co.uk/img/media/6bf37acf62886ce1e98175be4c7f52001ae603d6/749_1401_3290_1973/master/3290.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" width=\"445\" height=\"266.8647416413374\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eGood to go: hormone changes, poor diet, age and stress can all cause hair loss\u003c/span\u003e Photograph: Pol Kurucz/B\u0026amp;A Reps\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe signs of hair loss are easy to spot: a thinner ponytail, more of your scalp showing when you part your hair, shorter hairs – particularly along your hairline – and, of course, increased shedding. Reasons include age, stress, change in hormones, deficiencies in diet, hairstyles that pull too tight (the latter is easy to treat – simply start wearing your hair in a different style). The others, however, are more complex and might need medical attention. That aside, there are things you can certainly do for starters: take regular high-quality hair supplements that incorporate hair- and scalp-strengthening vitamins. This will boost growth and minimise shedding. Use hair products that not only boost scalp health, target hair density and minimise hair loss. \u003cstrong\u003eLiving Proof’s Scalp Care Density Serum\u003c/strong\u003e is a leave-in treatment infused with pea sprout and amaranth peptides to improve the appearance of thickness and density, but also reduces hair fallout rate. The \u003cstrong\u003eGenesis \u003c/strong\u003ehaircare line by \u003cstrong\u003eKerastase \u003c/strong\u003eis developed specifically to treat hair thinning (it also offers a hair-diagnostics service and in-salon treatments specifically to deal with this). \u003cstrong\u003eDavines\u003c/strong\u003e has a full range of products dedicated to treating hair loss. \u003cstrong\u003eTypebea\u003c/strong\u003e, a brand launched by beauty entrepreneur Anna Lahey and singer Rita Ora, has taken a different route from the usual celebrity brands to focus on products concerned with hair growth and hair thinning, while \u003cstrong\u003eNioxin\u003c/strong\u003e offers shampoos and hair serums that will increase the appearance of thicker hair in eight weeks. Still, if you are really concerned about hair loss, it is worth seeing a trichologist. \u003cstrong\u003ePhillip Kingsley\u003c/strong\u003e – whose density line is clinically proven to slow hair loss and give you thicker, fuller hair – is still one of the best in the business.\u003c/p\u003e\u003ch2 id=\"daily-helpers-boost-growth-and-pump-up-the-volume-with-these-supplements\"\u003eDaily helpers: boost growth and pump up the volume with these supplements\u003c/h2\u003e\u003cp\u003eWhether you are looking for supplements to encourage growth, attain more volume, or strengthen your hair, there is a supplement on the market that speaks to your needs. But do they work? Well, yes and no. The key to hair supplements, or any supplement, is to choose good quality(not ones that have numerous bulking agents) and to be consistent in taking them. That said, diet is key. Naturopath Rita Arora once told me: “You can’t put crap in your body and still expect supplements to work.” Here are five to consider…\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eViviscal Hair Growth Supplements, from £37, \u003ca href=\"http://viviscal.co.uk/\" data-link-name=\"in body link\"\u003eviviscal.co.uk\u003c/a\u003e \u003c/strong\u003eFemale hair follicles start to shrink from our mid-40s, so this hair growth supplement – from the OG of hair supplements – includes ingredients such as AminoMar, a rich marine protein complex, to promote the growth and repair of hair cells.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eVida Glow Hairology Capsules, £45, \u003ca href=\"http://uk.hairology.com/\" data-link-name=\"in body link\"\u003euk.hairology.com\u003c/a\u003e \u003c/strong\u003eHair thinning and hair loss – be it through age or use of chemical/heat treatments – is addressed by Vida Glow’s Hairology through this once-a-day capsule. The results of the trials are impressive – 34% reduction in hair loss in a month.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Nue Co Growth Phase, £65, \u003ca href=\"https://uk.thenueco.com/\" data-link-name=\"in body link\"\u003euk.thenueco.com\u003c/a\u003e\u003c/strong\u003e Balancing nutritional deficiencies, supporting hormonal health, calming stress and protecting against free radicals for longer, thicker, fuller hair is the mission of this supplement. The blend of vitamins, proteins and adaptogens will reduce hair loss and thinning in 90 days.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003ePhilip Kingsley Density Hair Complex, £33, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fphilipkingsley.co.uk%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003ephilipkingsley.co.uk\u003c/a\u003e \u003c/strong\u003ePhilip Kingsley (the man was one of the world’s leading trichologists) knows a thing or two about hair. Its holistic approach to haircare means it understood the importance of hair and scalp health decades before it became trendy. Which is why all of its supplements include an essential blend of amino acids to ensure the maintenance of healthy hair.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOuai Thick and Full Supplements, £28, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Fcultbeauty.co.uk%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003ecultbeauty.co.uk\u003c/a\u003e \u003c/strong\u003eOne of the downsides with many supplements is the taste. Ouai – the brand founded by celebrity hair stylist Jen Atkin – has hair supplements that are formulated with a super-hydrating multivitamin complex to support hair strength – with no unpleasant aftertaste.\u003c/p\u003e\u003ch2 id=\"a-sharp-bob-suits-anyone-its-chic-and-versatile-but-needs-maintenance\"\u003e‘A sharp bob suits anyone’: It’s chic and versatile, but needs maintenance\u003c/h2\u003e\u003cfigure id=\"2dcabbb7-e604-46ee-9bc6-ae9769a20c37\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-5\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"“In Vogue: The 1990s” UK Premiere – ArrivalsLONDON, ENGLAND - SEPTEMBER 16: Anna Wintour attends the UK Premiere of “In Vogue: The 1990s” on September 16, 2024 in London, England. (Photo by Tristan Fewings/Getty Images)\" src=\"https://i.guim.co.uk/img/media/224660a8431291819eeff8af135bca3e3a94a234/0_47_7199_4319/master/7199.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\" width=\"445\" height=\"266.97527434365884\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eSnap to it: Anna Wintour.\u003c/span\u003e Photograph: Tristan Fewings/Getty Images\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe chin-grazing cut is back. For the super-sharp bob, think fashion doyenne Anna Wintour, sans fringe, think Jessica Biel, more loose and liberated, think Ayo Edebiri. The undone, textured bob that made Alexa Chung the poster girl of the noughties is still going strong, too. There is the 50s Hollywood Baroque Bob, as seen on the likes of Zendaya. The versatility of the bob, explains Brixton Cowie, creative director at Neil Moodie Studio, is what makes it forever popular. ‘Its length can be adjusted to suit the wearer’s face and hair texture.’ But there is the issue of maintenance. According to Jay Birmingham, celebrity hairstylist and Tresemmé’s brand ambassador: ‘Most bobs require daily styling to stay looking chic.’ A textured bob can be more forgiving as it can be grown out into a ‘lob’ – a long bob. Your tool kit? Texturising spray, a diffuser for that ‘dried naturally’ style and, says Birmingham, a good hair oil, such as Lamellar Shine Oil from Tresemmé.\u003c/p\u003e\u003ch2 id=\"leave-it-to-the-experts-salon-hair-treatments-that-are-both-innovative-and-helpful\"\u003eLeave it to the experts: salon hair treatments that are both innovative and helpful\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003eJo Hansford’s Metal Detox, \u003ca href=\"http://johansford.com/\" data-link-name=\"in body link\"\u003ejohansford.com\u003c/a\u003e \u003c/strong\u003eChlorine in swimming pools, residue from the pipes of a soft water system, or hard water from your taps, can all leave traces of metal in your hair. This causes brittleness and dulls colour. Yes, you can now tackle it with an off-the-shelf product (see Colour Wow Dream Filter) but, for a professional approach, head to the Jo Hansford salon (below). Its Metal Detox treatment will neutralise and remove the metals and then protect the hair to prevent new particles from entering. (And you can keep up the good work at home with the Jo Hansford’s Metal Detox product line)\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eOlaplex Bond Shaper Curl Rebuilding Treatment Pro Service, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=http%3A%2F%2Folaplex.com%2F\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003eolaplex.com\u003c/a\u003e \u003c/strong\u003eThis curl-restoring salon service is a new treatment that restores coils to their never-before-seen glory. Using its now famous bond-building innovation, the professional treatment contains a blend of 23 amino acids and coconut-avocado milk to improve curl retention, control frizz, reduce breakage and increase overall strength. The results are outstanding.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eK18 Repair Service, \u003ca href=\"https://go.skimresources.com/?id=114047X1572903\u0026amp;url=https%3A%2F%2Fwww.k18hair.com%2F%3Fsrsltid%3DAfmBOopqS9IceTfwc2EJjPileD4mx4woVOYwP6G-9ekpWjuXCZW0TqxD\u0026amp;sref=https://www.theguardian.com/fashion/2024/oct/06/head-rush-cutting-edge-tips-and-treatments-in-our-good-hair-guide\" data-link-name=\"in body link\"\u003eK18hair.com\u003c/a\u003e\u003c/strong\u003e For anyone that has experienced hair damage from heat styling, chemical processing or colour, this treatment from K18 is a must. It fortifies the hair leaving it smoother, bouncier and silkier. The results – which can be seen in less than 5 minutes – are accumulative – it will not disappear with your next shampoo.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2024-10-06T15:00:02Z",
  "modifiedTime": "2024-10-08T15:26:25Z"
}
