{
  "id": "aecbd5d7-bc4b-4f12-b0fd-4b3b5f582eab",
  "title": "Gigi Hadid and I Are Both Fans of These Cozy UGG Slippers - and They're Back in Stock",
  "link": "https://www.popsugar.com/fashion/ugg-tasman-slippers-review-49308616",
  "description": "If celebrity street style is any sort of indicator on what's cool and trendy in the world of fashion, then UGG platform slippers might be the most popular style this season. The cozy shoes certainly aren't new to mainstream fashion, but with celebrities like Blake Lively, Gigi Hadid, and Hailey Bieber constantly donning the slippers - whether it be while trotting around New York or in between red carpet events and Pilates classes - the comfy shoes have definitely ascended into a new realm of popularity (and I'm not the least bit mad about it). In fact, I've been so mesmerized by the overwhelming love that celebrities have for the UGG Tasman Slippers ($110) in particular, I decided to purchase a pair for myself and lucked out that they just happened to be in stock (the slippers are seemingly always sold out). Could I get away with wearing them to the grocery store? Are they durable enough to hold up on my evening walks? Do they truly look good on everyone, or are they just cute on Hadid? (This is actually a recurring thought in my day-to-day life.) These were just a few of the questions I sought to answer when testing out UGG's bestselling slippers. Now that they're back in stock (and likely only for a limited time), ahead, I break down my full experience with the shoe - including how they fit, where they're available to shop, and whether they're truly worth the splurge (spoiler alert: they totally are). What I Like About These UGG Slippers The obvious appeal of these shoes is just how comfy they are - and yes, they're as irresistibly soft and cushiony as you'd imagine. The style boasts a durable leather composition that's sturdy but not too firm to the point where it feels uncomfortable to wear them. Dyed sheep fur lines the inside of the style, and while it certainly creates a cozier feel, I appreciate that the material isn't too thick or overbearing to the point that my feet start to feel sweaty. Unlike other everyday slippers, this style has a rubber sole base that's thick and designed to last, so I don't have to worry about whether it can withstand being worn on surfaces like concrete, tile, or grass - it holds up well and has just enough of a platform that the slipper's material doesn't dirty when being worn beyond my apartment. I love that these shoes seamlessly blend comfort with functionality and the fact that they're versatile enough to be worn in a number of environments, such as running errands, grabbing brunch, going to and from the gym, or even just around my home. What's Worth Noting I've had these slippers for almost eight months now, so I've had plenty of time to break them in. Because I work from home and generally only wear them inside or whenever I need to run a quick errand outside of my apartment, I'm not wearing them super extensively, which is why I've been pretty surprised by how worn down the inside of the shoe feels, particularly around the toe area. I've definitely noticed a change in the cushioning of the shoe, as the inside lining feels more worn down (almost like it's disintegrating or caving into itself), and several knots have even started forming toward the upper sole of the slipper, making it feel bumpy when I walk. It's difficult to pinpoint the exact cause of this, especially considering I've owned a handful of UGG boots in the past and never had any issue with them before. Perhaps this is simply the nature of what happens when you wear a pair of slippers as frequently as I do - things do eventually have to wear down, after all. However, it's worth noting that if you want these slippers to be a mainstay in your closet, you'll likely have to factor in buying a new pair every year - at least if you plan on wearing them as regularly as I do. Who Are These UGG Slippers Best For? If you want a pair of shoes you can comfortably wear around the house, out to run errands, or even for a quick walk through the neighborhood, these UGG slippers are a worthwhile investment. I appreciate their versatility and the fact that besides being a great everyday shoe, they're also incredibly comfortable and easy to slip into - even if I'm in a rush or literally running out the door. Additional Details These everyday slippers are crafted in a dyed sheep fur material and feature a rubbed sole base that's designed to be worn outdoors. The shoes are available to shop in a handful of colors, including chestnut brown (my coloring of choice), dark gray, samba red, burnt olive, and more. The UGG slippers come in US women's sizes 5 through 11. Where Are These UGG Slippers Available to Shop? The UGG Tasman Slippers are available to shop at Amazon, Anthropologie, and Zappos. Rating: Kyley Warren is an award-winning writer, editor, and affiliate strategist with more than four years of experience in the publishing space. She currently works as an assistant editor on PS Shopping and is an expert on all things related to shopping and fashion. She previously worked with Entertainment Tonight as a style commerce writer, and her byline has appeared in publications globally.",
  "author": "Kyley Warren",
  "published": "Fri, 27 Sep 2024 09:35:03 -0700",
  "source": "https://www.popsugar.com/fashion/feed",
  "categories": [
    "Product Reviews",
    "Fall Fashion",
    "Fashion Shopping",
    "UGG",
    "Slippers"
  ],
  "byline": "Kyley Warren",
  "length": 5386,
  "excerpt": "Shop the slippers that are loved by celebrities and PS editors alike.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "Skip to main contentPS Photography | Kyley WarrenPS Photography | Kyley WarrenWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.If celebrity street style is any sort of indicator on what's cool and trendy in the world of fashion, then UGG platform slippers might be the most popular style this season. The cozy shoes certainly aren't new to mainstream fashion, but with celebrities like Blake Lively, Gigi Hadid, and Hailey Bieber constantly donning the slippers — whether it be while trotting around New York or in between red carpet events and Pilates classes — the comfy shoes have definitely ascended into a new realm of popularity (and I'm not the least bit mad about it). In fact, I've been so mesmerized by the overwhelming love that celebrities have for the UGG Tasman Slippers ($110) in particular, I decided to purchase a pair for myself and lucked out that they just happened to be in stock (the slippers are seemingly always sold out). Could I get away with wearing them to the grocery store? Are they durable enough to hold up on my evening walks? Do they truly look good on everyone, or are they just cute on Hadid? (This is actually a recurring thought in my day-to-day life.) These were just a few of the questions I sought to answer when testing out UGG's bestselling slippers. Now that they're back in stock (and likely only for a limited time), ahead, I break down my full experience with the shoe — including how they fit, where they're available to shop, and whether they're truly worth the splurge (spoiler alert: they totally are). What I Like About These UGG SlippersThe obvious appeal of these shoes is just how comfy they are — and yes, they're as irresistibly soft and cushiony as you'd imagine. The style boasts a durable leather composition that's sturdy but not too firm to the point where it feels uncomfortable to wear them. Dyed sheep fur lines the inside of the style, and while it certainly creates a cozier feel, I appreciate that the material isn't too thick or overbearing to the point that my feet start to feel sweaty. Unlike other everyday slippers, this style has a rubber sole base that's thick and designed to last, so I don't have to worry about whether it can withstand being worn on surfaces like concrete, tile, or grass — it holds up well and has just enough of a platform that the slipper's material doesn't dirty when being worn beyond my apartment. I love that these shoes seamlessly blend comfort with functionality and the fact that they're versatile enough to be worn in a number of environments, such as running errands, grabbing brunch, going to and from the gym, or even just around my home. PS Photography | Kyley WarrenWhat's Worth NotingI've had these slippers for almost eight months now, so I've had plenty of time to break them in. Because I work from home and generally only wear them inside or whenever I need to run a quick errand outside of my apartment, I'm not wearing them super extensively, which is why I've been pretty surprised by how worn down the inside of the shoe feels, particularly around the toe area. I've definitely noticed a change in the cushioning of the shoe, as the inside lining feels more worn down (almost like it's disintegrating or caving into itself), and several knots have even started forming toward the upper sole of the slipper, making it feel bumpy when I walk. It's difficult to pinpoint the exact cause of this, especially considering I've owned a handful of UGG boots in the past and never had any issue with them before. Perhaps this is simply the nature of what happens when you wear a pair of slippers as frequently as I do — things do eventually have to wear down, after all. However, it's worth noting that if you want these slippers to be a mainstay in your closet, you'll likely have to factor in buying a new pair every year — at least if you plan on wearing them as regularly as I do. Who Are These UGG Slippers Best For?If you want a pair of shoes you can comfortably wear around the house, out to run errands, or even for a quick walk through the neighborhood, these UGG slippers are a worthwhile investment. I appreciate their versatility and the fact that besides being a great everyday shoe, they're also incredibly comfortable and easy to slip into — even if I'm in a rush or literally running out the door. Additional Details These everyday slippers are crafted in a dyed sheep fur material and feature a rubbed sole base that's designed to be worn outdoors. The shoes are available to shop in a handful of colors, including chestnut brown (my coloring of choice), dark gray, samba red, burnt olive, and more. The UGG slippers come in US women's sizes 5 through 11. Where Are These UGG Slippers Available to Shop?The UGG Tasman Slippers are available to shop at Amazon, Anthropologie, and Zappos. Rating:★★★★☆Kyley Warren is an award-winning writer, editor, and affiliate strategist with more than four years of experience in the publishing space. She currently works as an assistant editor on PS Shopping and is an expert on all things related to shopping and fashion. She previously worked with Entertainment Tonight as a style commerce writer, and her byline has appeared in publications globally.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/9tU2bgJz79x9usB-eEQl-2OXLWI=/0x0:1198x629/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2023/11/07/050/n/1922564/12587d83654ad257d86844.84892110_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"__next\"\u003e\u003cp\u003e\u003ca href=\"#main-content\" aria-label=\"Skip to main content\"\u003eSkip to main content\u003c/a\u003e\u003c/p\u003e\u003cheader id=\"main-header\"\u003e\u003c/header\u003e\u003cdiv id=\"main-content\" data-pinnacle-page-type=\"article\"\u003e\u003carticle data-article-index=\"0\" data-article-nid=\"5342571\"\u003e\u003cdiv width=\"1\"\u003e\u003cdiv data-element-type=\"ParagraphMainImage\" data-element-index=\"0\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/7v9BKhy9jZ5M6xClV14heJcR0hg=/fit-in/792x1056/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_HUEOid_059fdb8add5a7592_IMG_9589_1_.JPG\" width=\"792\" height=\"1056\" fetchpriority=\"high\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/7v9BKhy9jZ5M6xClV14heJcR0hg=/fit-in/792x1056/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_HUEOid_059fdb8add5a7592_IMG_9589_1_.JPG 1000w, https://media1.popsugar-assets.com/files/thumbor/t1hys6g6qmWKo6S81MjRtHqRtjA=/fit-in/1584x2112/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_HUEOid_059fdb8add5a7592_IMG_9589_1_.JPG 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Kyley Warren\u003c/span\u003e\u003c/figcaption\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Kyley Warren\u003c/span\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eIf \u003ca href=\"https://www.popsugar.com/fashion/Kylie-Jenner-Style-44625326\"\u003ecelebrity street style\u003c/a\u003e is any sort of indicator on what\u0026#39;s cool and trendy in the world of fashion, then \u003ca href=\"https://www.popsugar.com/fashion/best-ugg-slippers-for-women-47353423\"\u003eUGG platform slippers\u003c/a\u003e might be the most popular style this season. The cozy shoes certainly aren\u0026#39;t new to mainstream fashion, but with celebrities like Blake Lively, Gigi Hadid, and Hailey Bieber constantly donning the slippers — whether it be while trotting around New York or in between red carpet events and Pilates classes — the \u003ca href=\"https://www.popsugar.com/fashion/most-stylish-and-comfortable-walking-shoes-48244830\"\u003ecomfy shoes\u003c/a\u003e have definitely ascended into a new realm of popularity (and I\u0026#39;m not the least bit mad about it).\n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eIn fact, I\u0026#39;ve been so mesmerized by the overwhelming love that celebrities have for the \u003ca href=\"https://www.amazon.com/UGG-Womens-Tasman-Slipper-Chestnut/dp/B000KK62PC?tag=popsugarshopx-20\u0026amp;asc_source=dlvr.it\u0026amp;asc_campaign=feed\u0026amp;asc_refurl=https://www.popsugar.com/fashion/ugg-tasman-slippers-review-49308616\u0026amp;ascsubtag=___psv__p_49308616__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eUGG Tasman Slippers\u003c/a\u003e ($110) in particular, I decided to purchase a pair for myself and lucked out that they just happened to be in stock (the slippers are seemingly always sold out). Could I get away with wearing them to the grocery store? Are they durable enough to hold up on my evening walks? Do they truly look good on everyone, or are they just cute on Hadid? (This is actually a recurring thought in my day-to-day life.) These were just a few of the questions I sought to answer when testing out UGG\u0026#39;s bestselling slippers. Now that they\u0026#39;re back in stock (and likely only for a limited time), ahead, I break down my full experience with the shoe — including how they fit, where they\u0026#39;re available to shop, and whether they\u0026#39;re truly worth the splurge (spoiler alert: they totally are).\n\u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat I Like About These UGG Slippers\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThe obvious appeal of these shoes is just how comfy they are — and yes, they\u0026#39;re as irresistibly soft and cushiony as you\u0026#39;d imagine. The style boasts a durable leather composition that\u0026#39;s sturdy but not too firm to the point where it feels uncomfortable to wear them. Dyed sheep fur lines the inside of the style, and while it certainly creates a cozier feel, I appreciate that the material isn\u0026#39;t too thick or overbearing to the point that my feet start to feel sweaty. Unlike other everyday slippers, this style has a rubber sole base that\u0026#39;s thick and designed to last, so I don\u0026#39;t have to worry about whether it can withstand being worn on surfaces like concrete, tile, or grass — it holds up well and has just enough of a platform that the slipper\u0026#39;s material doesn\u0026#39;t dirty when being worn beyond my apartment. I love that these shoes seamlessly blend comfort with functionality and the fact that they\u0026#39;re versatile enough to be worn in a number of environments, such as running errands, grabbing brunch, going to and from the gym, or even just around my home.\n\u003c/p\u003e\u003c/div\u003e\u003cfigure data-element-type=\"ParagraphImage\" data-element-index=\"4\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/kSM6PA3V0S-wxXlehWgczjw8zuQ=/fit-in/792x1056/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_CKCTFZ_c333712bb9fe9931_IMG_9563_1_.JPG\" width=\"792\" height=\"1056\" srcset=\"https://media1.popsugar-assets.com/files/thumbor/kSM6PA3V0S-wxXlehWgczjw8zuQ=/fit-in/792x1056/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_CKCTFZ_c333712bb9fe9931_IMG_9563_1_.JPG 1000w, https://media1.popsugar-assets.com/files/thumbor/xZDlQhn422NNGjlwqvChOKMSFOs=/fit-in/1584x2112/filters:format_auto():upscale()/2023/11/07/047/n/1922564/tmp_CKCTFZ_c333712bb9fe9931_IMG_9563_1_.JPG 2000w\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cspan\u003ePS Photography | Kyley Warren\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\" data-element-has-beginning-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat\u0026#39;s Worth Noting\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eI\u0026#39;ve had these slippers for almost eight months now, so I\u0026#39;ve had plenty of time to break them in. Because I work from home and generally only wear them inside or whenever I need to run a quick errand outside of my apartment, I\u0026#39;m not wearing them \u003cem\u003esuper\u003c/em\u003e extensively, which is why I\u0026#39;ve been pretty surprised by how worn down the inside of the shoe feels, particularly around the toe area. I\u0026#39;ve definitely noticed a change in the cushioning of the shoe, as the inside lining feels more worn down (almost like it\u0026#39;s disintegrating or caving into itself), and several knots have even started forming toward the upper sole of the slipper, making it feel bumpy when I walk. It\u0026#39;s difficult to pinpoint the exact cause of this, especially considering I\u0026#39;ve owned a handful of UGG boots in the past and never had any issue with them before. Perhaps this is simply the nature of what happens when you wear a pair of slippers as frequently as I do — things do eventually have to wear down, after all. However, it\u0026#39;s worth noting that if you want these slippers to be a mainstay in your closet, you\u0026#39;ll likely have to factor in buying a new pair every year — at least if you plan on wearing them as regularly as I do. \u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWho Are These UGG Slippers Best For?\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eIf you want a pair of shoes you can comfortably wear around the house, out to run errands, or even for a quick walk through the neighborhood, these UGG slippers are a worthwhile investment. I appreciate their versatility and the fact that besides being a great everyday shoe, they\u0026#39;re also incredibly comfortable and easy to slip into — even if I\u0026#39;m in a rush or literally running out the door. \u003c/p\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eAdditional Details\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-element-index=\"5\" data-element-has-ending-title=\"false\"\u003e\u003cul\u003e \u003cli\u003eThese everyday slippers are crafted in a dyed sheep fur material and feature a rubbed sole base that\u0026#39;s designed to be worn outdoors.\u003c/li\u003e \u003cli\u003eThe shoes are available to shop in a handful of colors, including chestnut brown (my coloring of choice), dark gray, samba red, burnt olive, and more.\u003c/li\u003e \u003cli\u003eThe UGG slippers come in US women\u0026#39;s sizes 5 through 11.\u003c/li\u003e \u003c/ul\u003e\u003c/div\u003e\u003cp data-element-index=\"6\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhere Are These UGG Slippers Available to Shop?\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"7\"\u003eThe UGG Tasman Slippers are available to shop at Amazon, \u003ca href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM\u0026amp;mid=39789\u0026amp;murl=https%3A%2F%2Fwww.anthropologie.com%2Fshop%2Fugg-tasman-slippers5%3Fcolor%3D025%26type%3DSTANDARD%26quantity%3D1\u0026amp;u1=___psv__p_49308616__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eAnthropologie\u003c/a\u003e, and \u003ca href=\"https://www.anrdoezrs.net/links/100626255/type/dlg/sid/___psv__p_49308616__t_w_/https://www.zappos.com/p/ugg-tasman-chestnut/product/7205120/color/278?\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eZappos\u003c/a\u003e. \u003c/p\u003e\u003cp data-element-index=\"8\"\u003e\u003cstrong\u003eRating:\u003c/strong\u003e\u003c/p\u003e\u003cp data-element-index=\"9\"\u003e★★★★☆\u003c/p\u003e\u003cp data-element-index=\"11\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/kyley-warren\"\u003eKyley Warren\u003c/a\u003e is an award-winning writer, editor, and affiliate strategist with more than four years of experience in the publishing space. She currently works as an assistant editor on PS Shopping and is an expert on all things related to shopping and fashion. She previously worked with Entertainment Tonight as a style commerce writer, and her byline has appeared in publications globally.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.amazon.com/UGG-Womens-Tasman-Slipper-Chestnut/dp/B000KK62PC?tag=popsugarshopx-20\u0026amp;asc_source=dlvr.it\u0026amp;asc_campaign=feed\u0026amp;asc_refurl=https://www.popsugar.com/fashion/ugg-tasman-slippers-review-49308616\u0026amp;ascsubtag=___psv__p_49308616__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\" aria-label=\"\" data-vars-action=\"product image\" data-vars-retailer=\"amazon.com\" data-vars-price=\"$110\" data-vars-href=\"https://www.amazon.com/UGG-Womens-Tasman-Slipper-Chestnut/dp/B000KK62PC\"\u003e\u003cpicture data-testid=\"picture-tag\"\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/Idb1SBSe3BIUL9GZg70Dd4EGJW8=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/31/903/n/1922564/7295e3106541665b4b3ee2.89756148_Screen_Shot_.png\" media=\"(min-width: 1024px)\" data-size=\"desktop\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/Idb1SBSe3BIUL9GZg70Dd4EGJW8=/fit-in/516x516/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/31/903/n/1922564/7295e3106541665b4b3ee2.89756148_Screen_Shot_.png\" media=\"(min-width: 768px) and (max-width: 1023px)\" data-size=\"tablet\" width=\"258\" height=\"258\"/\u003e\u003csource srcset=\"https://media1.popsugar-assets.com/files/thumbor/HbqDrqTyFMM2Eu6EhkYa2V0JhTg=/fit-in/700x700/filters:format_auto():extract_cover():upscale():fill(ffffff)/2023/10/31/903/n/1922564/7295e3106541665b4b3ee2.89756148_Screen_Shot_.png\" media=\"(max-width: 767px)\" data-size=\"mobile\" width=\"350\" height=\"350\"/\u003e\u003cimg src=\"https://media1.popsugar-assets.com/files/thumbor/72T7hLfG08e1_MqbVt0Ix7mzp6w=/fit-in/350x350/filters:format_auto():quality(70):extract_cover():upscale():fill(ffffff)/2023/10/31/903/n/1922564/7295e3106541665b4b3ee2.89756148_Screen_Shot_.png\" alt=\"Main Image\" width=\"350\" height=\"350\"/\u003e\u003c/picture\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2023-11-08T01:05:03Z",
  "modifiedTime": "2024-09-27T16:35:03Z"
}
