{
  "id": "ebbf5974-d540-432f-9ffe-1f79a8585784",
  "title": "Zara Just Dropped A New Studio Collection — \u0026 It’s Big On Western Vibes",
  "link": "https://www.refinery29.com/en-us/zara-studio-collection-spring-summer-2025?utm_source=feed\u0026utm_medium=rss",
  "description": ".disclaimer{width:90%;margin-bottom:1rem}.disclaimer__lines{width:100%;margin:0 auto;border-bottom:1px solid #999;padding:0;max-width:150px}.disclaimer__copy{width:100%;max-width:355px;font-family:Brown Regular,sans-serif;font-size:.9rem;font-weight:300;line-height:1.3em;color:#333;padding:0 0 .4rem;margin:1rem auto;text-align:center} All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Calling all Western fashion lovers: Zara’s latest Studio collection drop for spring/summer 2025 is full of boho-inspired styles that’ll have you dreaming of a trip to the desert. Photographed by Steven Meisel, the “On The Road” campaign captures the “spirit of joyful adventure,” according to a press release, meant to mirror the inspiration for the collection: “rugged beauty and the American Southwest landscape.” The assortment immediately transports us to a carefree Colorado state of mind — or to a desert festival like Coachella with its studded shorts, fluttery-sleeve dresses, and tie-front vests, adorned with patchwork lace, paisley prints, and snakeskin. But the accessories are the real star of the show: gladiator sandals, layered necklaces, and fringe belts with a vintage flair are the perfect finishing touch to your outdoor concert look. (It’s never too early to start planning for the Cowboy Carter tour.)Below, shop the sought-after Zara Studio collection, which ranges between a $30 pair of panties and a $500 suede dress coat, now.  DashDividers_1_500x100 Zara SS25 Studio Collection Dresses The boho-inspired dresses predominantly come in maxi silhouettes — think flowy button-down frocks and spring-ready slips that are appropriate for al fresco dinners and casual weddings alike. There are also some fluttery minis in the mix that would complement any vacation wardrobe.  DashDividers_1_500x100 Zara SS25 Studio Collection Matching Sets Whether you’re looking for a modest matching blouse and maxi skirt, a skin-baring criss-crossed bralette and mini short set, or an elevated duster coat and trouser duo, this collection has effortlessly chic separates for everywhere from the office to the festival. DashDividers_1_500x100  Zara SS25 Studio Collection Shoes \u0026 Bags Style your look from head to toe with Zara Studio’s lineup of handbags, shoes, and accessories. Look out for spacious work-appropriate totes and on-trend fringe styles. To really lean into the laidback look, try a lace-up sandal or a studded slingback. DashDividers_1_500x100 Zara SS25 Studio Collection Jewelry \u0026 Accessories Top off your outfit with chunky mixed-metal pieces that’ll jingle and jangle with every move. (Think door-knocker earrings, layered chain necklaces, and charm rings.) There are even body-chains that you can style under bralettes and vests for a sparkly surprise or over dresses and blouses for a statement.  Shop full Zara Studio collection Like what you see? How about some more R29 goodness, right here?Everyone Will Be Wearing These Zara PiecesPlus Review: Anthropologie x Universal StandardAlex Consani's An Office Siren In Aritzia Campaign",
  "author": "Victoria Montalti",
  "published": "Thu, 20 Mar 2025 11:01:29 +0000",
  "source": "https://www.refinery29.com/fashion/rss.xml",
  "categories": null,
  "byline": "Victoria Montalti",
  "length": 1105,
  "excerpt": "Zara’s Studio collection just dropped, and it’s full of Western vibes and festival-ready staples. Shop the limited-edition drop now.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Calling all Western fashion lovers: Zara’s latest Studio collection drop for spring/summer 2025 is full of boho-inspired styles that’ll have you dreaming of a trip to the desert. Photographed by Steven Meisel, the \"On The Road\" campaign captures the “spirit of joyful adventure,” according to a press release, meant to mirror the inspiration for the collection: “rugged beauty and the American Southwest landscape.” The assortment immediately transports us to a carefree Colorado state of mind — or to a desert festival like Coachella with its studded shorts, fluttery-sleeve dresses, and tie-front vests, adorned with patchwork lace, paisley prints, and snakeskin. But the accessories are the real star of the show: gladiator sandals, layered necklaces, and fringe belts with a vintage flair are the perfect finishing touch to your outdoor concert look. (It’s never too early to start planning for the Cowboy Carter tour.)Below, shop the sought-after Zara Studio collection, which ranges between a $30 pair of panties and a $500 suede dress coat, now. AdvertisementADVERTISEMENTAdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11869182.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eCalling all \u003ca href=\"https://www.refinery29.com/en-us/western-trend-cowboy-boots-hat-outfits\"\u003eWestern fashion\u003c/a\u003e lovers: Zara’s latest \u003ca href=\"https://www.refinery29.com/en-us/zara-studio-collection-spring-summer-2024\"\u003eStudio collection\u003c/a\u003e drop for spring/summer 2025 is full of boho-inspired styles that’ll have you dreaming of a trip to the desert. \u003c/p\u003e\u003cp\u003ePhotographed by Steven Meisel, the \u003ca rel=\"noreferrer noopener\" aria-label=\"\u0026#34;On The Road\u0026#34; campaign (opens in a new tab)\" href=\"https://www.zara.com/us/en/woman-new-in-l1180.html\" target=\"_blank\"\u003e\u0026#34;On The Road\u0026#34; campaign\u003c/a\u003e captures the “spirit of joyful adventure,” according to a press release, meant to mirror the inspiration for the collection: “rugged beauty and the American Southwest landscape.” \u003c/p\u003e\u003cp\u003eThe assortment immediately transports us to a carefree Colorado state of mind — or to a \u003ca href=\"https://www.refinery29.com/en-us/festival-outfit-ideas-summer-style\"\u003edesert festival\u003c/a\u003e like Coachella with its studded shorts, fluttery-sleeve dresses, and \u003ca href=\"https://www.refinery29.com/en-us/jacket-coat-trends-spring-2025\"\u003etie-front vests\u003c/a\u003e, adorned with patchwork lace, paisley prints, and snakeskin. But the accessories are the real star of the show: gladiator sandals, layered necklaces, and fringe belts with a vintage flair are the perfect finishing touch to your outdoor concert look. (It’s never too early to start planning for the \u003ca href=\"https://www.refinery29.com/en-us/beyonce-cowboy-carter-tour-outfits\"\u003e\u003cem\u003eCowboy Carter\u003c/em\u003e tour\u003c/a\u003e.)\u003c/p\u003e\u003cp\u003eBelow, shop the \u003ca rel=\"noreferrer noopener\" aria-label=\"sought-after Zara Studio collection (opens in a new tab)\" href=\"https://www.zara.com/us/en/woman-studio-collection-l1664.html?v1=2419974\u0026amp;regionGroupId=41\" target=\"_blank\"\u003esought-after Zara Studio collection\u003c/a\u003e, which ranges between a $30 pair of panties and a $500 suede dress coat, now. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-20T11:01:29Z",
  "modifiedTime": null
}
