{
  "id": "04738942-39a5-47e4-ae55-661fd0cd6614",
  "title": "Superman’s Jor-El Actor Revealed for DCU Movie",
  "link": "https://www.comingsoon.net/movies/news/1947130-superman-jor-el-actor-revealed-for-dcu-movie",
  "description": "A new report from a noted leaker has opened up about a major cameo in James Gunn’s upcoming Superman movie, the actor playing Jor-El. Who is playing Jor-El in Superman? According to noted insider and leaker ViewerAnon, Bradley Cooper is playing the role of Jor-El in the upcoming movie. The leaker notes that the actor […] The post Superman’s Jor-El Actor Revealed for DCU Movie appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Anthony Nash",
  "published": "Sat, 29 Mar 2025 00:33:13 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Movies",
    "Bradley Cooper",
    "DC",
    "DC Studios",
    "DCU",
    "James Gunn",
    "Movie News",
    "Superman",
    "Warner Bros.",
    "Warner Bros. Discovery"
  ],
  "byline": "Anthony Nash",
  "length": 2446,
  "excerpt": "A new report from a noted leaker has opened up about a major cameo in James Gunn's upcoming Superman movie, the actor playing Jor-El.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "A new report from a noted leaker has opened up about a major cameo in James Gunn’s upcoming Superman movie, the actor playing Jor-El. Who is playing Jor-El in Superman? According to noted insider and leaker ViewerAnon, Bradley Cooper is playing the role of Jor-El in the upcoming movie. The leaker notes that the actor appears “in the first couple of minutes” of the movie, and is not a “big spoiler,” so it sounds like perhaps Cooper’s role is more of a cameo than anything else. Well, I guess I’m the one who put this out there. But I have to stop trying to ‘prove myself’ when someone calls me a liar.He appears in the first couple minutes of the movie so I promise this is not a big spoiler. https://t.co/xbFnvQSRAH— ViewerAnon (@ViewerAnon) March 28, 2025 Cooper and Gunn are no stranger to working together, as Cooper has starred in Gunn’s Guardians of the Galaxy franchise as Rocket Raccoon in the MCU over the years. No official report on whether or not Cooper will appear in the movie or overarching DCU in a larger capacity was made available. “Superman tells the story of Superman’s journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent of Smallville, Kansas,” reads the movie’s official synopsis. “He is the embodiment of truth, justice, and the American way, guided by human kindness in a world that sees kindness as old-fashioned.” Along with David Corenswet and Rachel Brosnahan, Superman stars Isabela Merced as Hawkgirl, Edi Gathegi as Mister Terrific, Nathan Fillion as Guy Gardner, Anthony Carrigan as Metamorpho, María Gabriela de Faría as The Engineer, Sara Sampaio as Eve Teschmacher, Skyler Gisondo as Jimmy Olsen, Nicholas Hoult as Lex Luthor, Terence Rosemore as Otis, Wendell Pierce as Perry White, Pruitt Taylor Vince as Jonathan Kent, Neva Howell as Martha Kent, Beck Bennett as Steve Lombard, Mikaela Hoover as Cat Grant, and Christopher McDonald as Ron Troupe. The DC Universe’s first phase, called Chapter One: Gods and Monsters, debuted with Creature Commandos in late 2024. Superman will be the first movie in James Gunn’s universe, which will feature a multitude of different movies and television shows. A few of the announced projects include a Batman and Robin-focused movie called The Brave and the Bold, a Supergirl movie titled Supergirl: Woman of Tomorrow, a Swamp Thing movie, Clayface, an animated movie called Dynamic Duo, and multiple TV shows.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/03/jor-el-superman.png?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eA new report from a noted leaker has opened up about a major cameo in James Gunn’s upcoming \u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/superman\"\u003eSuperman\u003c/a\u003e movie\u003c/strong\u003e, the actor playing Jor-El. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-playing-jor-el-in-superman\"\u003eWho is playing Jor-El in Superman? \u003c/h2\u003e\n\n\n\n\u003cp\u003eAccording to noted insider and leaker ViewerAnon, Bradley Cooper is playing the role of Jor-El in the upcoming movie. The leaker notes that the actor appears “in the first couple of minutes” of the movie, and is not a “big spoiler,” so it sounds like perhaps Cooper’s role is more of a cameo than anything else. \u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\u003cdiv lang=\"en\" dir=\"ltr\"\u003e\u003cp\u003eWell, I guess I’m the one who put this out there. But I have to stop trying to ‘prove myself’ when someone calls me a liar.\u003c/p\u003e\u003cp\u003eHe appears in the first couple minutes of the movie so I promise this is not a big spoiler. \u003ca href=\"https://t.co/xbFnvQSRAH\"\u003ehttps://t.co/xbFnvQSRAH\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e— ViewerAnon (@ViewerAnon) \u003ca href=\"https://twitter.com/ViewerAnon/status/1905723756020125711?ref_src=twsrc%5Etfw\"\u003eMarch 28, 2025\u003c/a\u003e\u003c/blockquote\u003e \n\n\n\n\u003cp\u003eCooper and \u003ca href=\"http://comingsoon.net/tag/james-gunn\"\u003eGunn\u003c/a\u003e are no stranger to working together, as Cooper has starred in Gunn’s \u003ca href=\"http://comingsoon.net/tag/guardians-of-the-galaxy\"\u003eGuardians of the Galaxy\u003c/a\u003e franchise as Rocket Raccoon in the MCU over the years. No official report on whether or not Cooper will appear in the movie or overarching DCU in a larger capacity was made available. \u003c/p\u003e\n\n\n\n\u003cp\u003e“Superman tells the story of Superman’s journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent of Smallville, Kansas,” reads the movie’s official synopsis. “He is the embodiment of truth, justice, and the American way, guided by human kindness in a world that sees kindness as old-fashioned.”\u003ca href=\"https://www.comingsoon.net/author/spencer-legacy\"\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAlong with David Corenswet and Rachel Brosnahan, Superman stars Isabela Merced as Hawkgirl, Edi Gathegi as Mister Terrific, Nathan Fillion as Guy Gardner, Anthony Carrigan as Metamorpho, María Gabriela de Faría as The Engineer, Sara Sampaio as Eve Teschmacher, Skyler Gisondo as Jimmy Olsen, Nicholas Hoult as Lex Luthor, Terence Rosemore as Otis, Wendell Pierce as Perry White, Pruitt Taylor Vince as Jonathan Kent, Neva Howell as Martha Kent, Beck Bennett as Steve Lombard, Mikaela Hoover as Cat Grant, and Christopher McDonald as Ron Troupe.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe DC Universe’s first phase, called Chapter One: Gods and Monsters, debuted with \u003ca href=\"https://www.comingsoon.net/tag/creature-commandos\"\u003eCreature Commandos\u003c/a\u003e in late 2024. Superman will be the first movie in James Gunn’s universe, which will feature a multitude of different movies and television shows. A few of the announced projects include a Batman and Robin-focused movie called The Brave and the Bold, a Supergirl movie titled Supergirl: Woman of Tomorrow, a Swamp Thing movie, \u003ca href=\"https://www.comingsoon.net/movies/news/1893617-clayface-dynamic-duo-release-dates-dcu\"\u003eClayface\u003c/a\u003e, an animated movie called \u003ca href=\"https://www.comingsoon.net/movies/news/1893617-clayface-dynamic-duo-release-dates-dcu\"\u003eDynamic Duo\u003c/a\u003e, and \u003ca href=\"https://www.comingsoon.net/movies/news/1264404-upcoming-dcu-slate-james-gunn\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emultiple TV shows\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-29T00:33:13Z",
  "modifiedTime": "2025-03-29T00:33:37Z"
}
