{
  "id": "04c2a105-e619-4dee-a59c-0744fc71dd38",
  "title": "One Of Netflix's Best Shows May Return, But Not In The Form You'd Expect",
  "link": "https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/",
  "description": "Fans of Netflix's Mindhunter have been desperate for closure following the series' cancellation, and there are rumblings that it might finally happen.",
  "author": "Jeremy Mathai",
  "published": "Wed, 18 Jun 2025 22:11:47 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Movie News",
    "TV News",
    "Drama Movies",
    "Thriller Movies",
    "Drama Shows",
    "Thriller Shows"
  ],
  "byline": "Jeremy Mathai",
  "length": 4378,
  "excerpt": "Fans of Netflix's Mindhunter have been desperate for closure following the series' cancellation, and there are rumblings that it might finally happen.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Patrick Harbron/Netflix Welcome, one and all, to our latest meeting of the \"Netflix's 'Mindhunter' Obsessives Anonymous\" club. It's been quite some time since we last gathered together, desperately keeping that little spark of hope alive that the powers that be would come to their senses and finally do the right thing. That, of course, would be to give the official green light to another season of streaming's best and most undeservedly canceled shows of the last decade or so. \"Mindhunter\" season 3 has quickly joined the ranks of \"GTA VI\" and \"The Winds of Winter\" as pop-culture sensations that everyone has been asking for ... but seem perpetually destined to never actually come to fruition. Is there still a chance for more \"Mindhunter\" in some capacity, at least? I can already feel the internet collectively clenching its you-know-what at the very idea of being disappointed again, but this particular smoke might have some fire to it. Maybe. Almost six years after we last saw FBI agents Holden Ford (Jonathan Groff), Bill Tench (Holt McCallany), and Dr. Wendy Carr (Anna Torv) tracking down serial killers and interviewing them to get into the minds of genuine sociopaths still on the loose, we've finally received our most promising tease yet. In an interview with Comic Book Resources, McCallany was making the press rounds for his upcoming Netflix series \"The Waterfront\" (from original \"Scream\" writer Kevin Williamson) and once again addressed the speculation that can't quite go away. According to the actor, however, there has been some movement on a \"Mindhunter\" continuation ... but as a pair of full-fledged movies, rather than another season. As he explained: \"So look, you know, I had a meeting with David Fincher in his office a few months ago, and he said to me that there is a chance that it may come back as three two-hour movies, but I think it's just a chance. I know there are writers that are working, but you know, David has to be happy with scripts.\" Mindhunter could return as three Netflix movies ... but it's not guaranteed Netflix I know, I know. Fool me once, shame on you. Fool me twice, shame on me. Fool me three times ... well, maybe it's time to stop letting Lucy yank that football out from under us at the last moment and just go home for the day. Nonetheless, we members of the \"Mindhunter\" Truthers Collective (I expect all of your unpaid dues by the end of the month) are clearly gluttons for punishment. Yet despite every sign indicating that the series was done for good — including from its own main creative force, David Fincher himself — this is one rumor that refuses to die. Our latest crackpot conspiracy theory comes courtesy of one of the big stars from the show, Holt McCallany, and his own conversations with Fincher. The actor went on to confirm that the potential \"Mindhunter\" movies would be made for Netflix and that all the pieces are in place to pull this off ... theoretically, at least. Ultimately, it all comes down to whether the notoriously hard-to-please Fincher will sign off on it. As he explained: \"So I think that in terms of dates and logistics, it could all be worked out, but it has to do with David really having the time and the inclination and being happy with the material. And that's a big question mark.\" You're telling me. Fincher has seemed eager over the years to revisit \"Mindhunter\" and bring it to a satisfying conclusion. Season 2 didn't necessarily end on a cliffhanger, but it's clear there's much more to the stories of Holden Ford, Bill Tench, and Wendy Carr — not to mention the various serial killer cases to deal with leading up to more recent decades. Like \"Peaky Blinders,\" could a movie (or three) really be the best way to continue this series and bring it across the finish line? It appears to be a long shot, though maybe not quite as much as it was before. Both seasons of \"Mindhunter\" are currently streaming on Netflix.",
  "image": "https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/l-intro-1750284486.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/\" data-post-title=\"One Of Netflix\u0026#39;s Best Shows May Return, But Not In The Form You\u0026#39;d Expect\" data-slide-num=\"0\" data-post-id=\"1890170\"\u003e\n                                             \u003cpicture id=\"p8689f7829794081126132ce28815df6e\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/intro-1750284486.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/intro-1750284486.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/intro-1750284486.jpg\" data-slide-url=\"https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/\" data-post-id=\"1890170\" data-slide-num=\"0\" data-slide-title=\"One Of Netflix\u0026#39;s Best Shows May Return, But Not In The Form You\u0026#39;d Expect: \" width=\"780\" height=\"438\" alt=\"Jonathan Groff as Holden Ford and Holt McCallany as Bill Tench seated in an interrogation room in Mindhunter\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003ePatrick Harbron/Netflix\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eWelcome, one and all, to our latest meeting of the \u0026#34;Netflix\u0026#39;s \u0026#39;Mindhunter\u0026#39; Obsessives Anonymous\u0026#34; club. It\u0026#39;s been quite some time since we last gathered together, desperately keeping that little spark of hope alive that the powers that be would come to their senses and finally do the right thing. That, of course, would be to give the official green light to \u003ca href=\"https://www.slashfilm.com/1835855/why-mindhunter-season-3-canceled-netflix/\" target=\"_blank\"\u003eanother season of streaming\u0026#39;s best and most undeservedly canceled shows of the last decade or so\u003c/a\u003e. \u0026#34;Mindhunter\u0026#34; season 3 has quickly joined the ranks of \u0026#34;GTA VI\u0026#34; and \u0026#34;The Winds of Winter\u0026#34; as pop-culture sensations that everyone has been asking for ... but seem perpetually destined to never actually come to fruition.\u003c/p\u003e\n\u003cp\u003eIs there still a chance for more \u0026#34;Mindhunter\u0026#34; in \u003cem\u003esome\u003c/em\u003e capacity, at least? I can already feel the internet collectively clenching its you-know-what at the very idea of being disappointed again, but this particular smoke might have some fire to it. Maybe. Almost six years after we last saw FBI agents Holden Ford (Jonathan Groff), Bill Tench (Holt McCallany), and Dr. Wendy Carr (Anna Torv) tracking down serial killers and interviewing them to get into the minds of genuine sociopaths still on the loose, we\u0026#39;ve finally received our most promising tease yet. In an interview with \u003ca href=\"https://www.cbr.com/mindhunter-star-possible-return-6-years-later/\" target=\"_blank\"\u003eComic Book Resources\u003c/a\u003e, McCallany was making the press rounds for his upcoming Netflix series \u0026#34;The Waterfront\u0026#34; (from original \u0026#34;Scream\u0026#34; writer Kevin Williamson) and once again addressed the speculation that can\u0026#39;t quite go away. According to the actor, however, there has been some movement on a \u0026#34;Mindhunter\u0026#34; continuation ... but as a pair of full-fledged movies, rather than another season. As he explained:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;So look, you know, I had a meeting with David Fincher in his office a few months ago, and he said to me that there is a chance that it may come back as three two-hour movies, but I think it\u0026#39;s just a chance. I know there are writers that are working, but you know, David has to be happy with scripts.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eMindhunter could return as three Netflix movies ... but it\u0026#39;s not guaranteed\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/\" data-post-title=\"One Of Netflix\u0026#39;s Best Shows May Return, But Not In The Form You\u0026#39;d Expect\" data-slide-num=\"1\" data-post-id=\"1890170\"\u003e\n                                             \u003cpicture id=\"pae8f67a3c17102f7b3c19b1560af68b0\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/mindhunter-could-return-as-two-netflix-movies-but-its-not-guaranteed-1750284486.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/mindhunter-could-return-as-two-netflix-movies-but-its-not-guaranteed-1750284486.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/one-of-netflixs-best-shows-may-return-but-not-in-the-form-youd-expect/mindhunter-could-return-as-two-netflix-movies-but-its-not-guaranteed-1750284486.jpg\" data-slide-url=\"https://www.slashfilm.com/1890170/netflix-best-show-mindhunter-movies/\" data-post-id=\"1890170\" data-slide-num=\"1\" data-slide-title=\"One Of Netflix\u0026#39;s Best Shows May Return, But Not In The Form You\u0026#39;d Expect: Mindhunter could return as three Netflix movies ... but it\u0026#39;s not guaranteed\" width=\"780\" height=\"438\" alt=\"Jonathan Groff as Holden Ford and Holt McCallany as Bill Tench seated in an interrogation room in Mindhunter\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eNetflix\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eI know, I know. Fool me once, shame on you. Fool me twice, shame on me. Fool me three times ... well, maybe it\u0026#39;s time to stop letting Lucy yank that football out from under us at the last moment and just go home for the day. Nonetheless, we members of the \u0026#34;Mindhunter\u0026#34; Truthers Collective (I expect all of your unpaid dues by the end of the month) are clearly gluttons for punishment. Yet despite every sign indicating that the series was done for good — \u003ca href=\"https://www.slashfilm.com/577960/david-fincher-mindhunter-future/\" target=\"_blank\"\u003eincluding from its own main creative force, David Fincher himself\u003c/a\u003e — this is one rumor that refuses to die.\u003c/p\u003e\n\u003cp\u003eOur latest crackpot conspiracy theory comes courtesy of one of the big stars from the show, Holt McCallany, and his own conversations with Fincher. The actor went on to confirm that the potential \u0026#34;Mindhunter\u0026#34; movies would be made for Netflix and that all the pieces are in place to pull this off ... theoretically, at least. Ultimately, it all comes down to whether the notoriously hard-to-please Fincher will sign off on it. As he explained:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#34;So I think that in terms of dates and logistics, it could all be worked out, but it has to do with David really having the time and the inclination and being happy with the material. And that\u0026#39;s a big question mark.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eYou\u0026#39;re telling me. Fincher has seemed eager over the years to revisit \u0026#34;Mindhunter\u0026#34; and bring it to a satisfying conclusion. Season 2 didn\u0026#39;t necessarily end on a cliffhanger, but it\u0026#39;s clear there\u0026#39;s much more to the stories of Holden Ford, Bill Tench, and Wendy Carr — not to mention the various serial killer cases to deal with leading up to more recent decades. \u003ca href=\"https://www.slashfilm.com/1805500/peaky-blinders-movie-update-theatrical-release/\" target=\"_blank\"\u003eLike \u0026#34;Peaky Blinders,\u0026#34;\u003c/a\u003e could a movie (or three) really be the best way to continue this series and bring it across the finish line? It appears to be a long shot, though maybe not quite as much as it was before. Both seasons of \u0026#34;Mindhunter\u0026#34; are currently streaming on Netflix.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-18T22:11:47Z",
  "modifiedTime": "2025-06-18T22:11:47Z"
}
