{
  "id": "11433874-faa6-40d1-8eb5-7f67ba1bf235",
  "title": "LALIFF Announces 2025 Award Winners, Distributes Over $60,000 to Emerging U.S. Latino Talent (EXCLUSIVE)",
  "link": "https://variety.com/2025/film/awards/laliff-2025-award-winners-1236415334/",
  "description": "The Latino Film Institute (LFI) announced the 2025 award winners of the Los Angeles Latino International Film Festival (LALIFF) on Saturday, honoring excellence across U.S. Latino film, animation and episodic storytelling. The accolades were revealed during a closing night cocktail reception held at The Kookaburra Lounge in Ovation Hollywood, wrapping the five-day festival that spotlighted […]",
  "author": "Clayton Davis",
  "published": "Sun, 01 Jun 2025 22:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Awards",
    "News",
    "LALIFF",
    "Los Angeles Latino International Film Festival"
  ],
  "byline": "Clayton Davis",
  "length": 3808,
  "excerpt": "The 2025 Los Angeles Latino International Film Festival awarded over $60,000 to emerging U.S. Latino talent in film, animation and TV.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "The Latino Film Institute (LFI) announced the 2025 award winners of the Los Angeles Latino International Film Festival (LALIFF) on Saturday, honoring excellence across U.S. Latino film, animation and episodic storytelling. The accolades were revealed during a closing night cocktail reception held at The Kookaburra Lounge in Ovation Hollywood, wrapping the five-day festival that spotlighted over 90 films, including 18 world premieres. LALIFF 2025 opened with the documentary “ASCO: Without Permission” and closed with the narrative feature “Serious People.” In addition to its professional programming, nearly 300 student films were showcased through the Youth Cinema Project. As part of its continued efforts to elevate Latino storytellers, the festival introduced the Adelante Award, recognizing trailblazers in Latino education and mentorship. Raul Maldonado, superintendent of the Palmdale School District, was the inaugural recipient for his work supporting future filmmakers. Popular on Variety Los Angeles muralist and cultural icon Robert Vargas created a live painting during opening night, celebrating the city’s Latino heritage. Vargas, whose work includes “Shohei Ohtani / LA Rising” and the massive mural “Angelus,” added an artistic flourish that underscored the festival’s commitment to community and identity. “This year’s festival has been a testament to the vibrant creativity and storytelling prowess within our community,” said Axel Caballero, CEO of the Latino Film Institute. “The diverse array of films and the passionate voices behind them not only entertained but also sparked meaningful conversations.” Now in its 24th year, LALIFF continues to serve as a premiere platform for showcasing Latino creative voices. The 2025 festival featured screenings at the TCL Chinese Theatres, the Egyptian Theatre Hollywood and Regal L.A. Live, along with musical performances, comedy showcases and an expanded Industry Forum with networking events and masterclasses. The full list of winners are below. LALIFF 2025 Award Winners: LFI 2025 Spark Animation FellowshipSponsored by the Netflix Fund for Creative EquityFive U.S.-based Latino animators received $30,000 each to support their original animated short films: Angel Ruvalcaba, “¿Necesitas Ayuda?” Angela Sánchez, “Spin Cycle” Chevez Sanchez, “The Resilient Coquí” Guillermo Casarin, “The Mariachi Mask” Sandra Powers, “Bestias De La Muerte” LFI Works in ProgressSponsored by Amazon MGM StudiosTwo filmmakers were awarded $20,000 each for post-production support: “Cancúncito,” written and directed by Carlos Alejandro Marulanda and Isael Gutierrez Best U.S. Episodic ShortPresented by Disney Entertainment Winner: “Born 2 Lose,” directed by Carlos Cardona — $4,000 cash prizeJury members included executives from National Geographic, Onyx Collective, Hulu, FX and Disney Branded Television. Best U.S. Latino Animated Short FilmPresented by the Latino Film Institute Winner: “No Vacancy,” directed by Miguel Rodrick — $4,000 cash prize Special Jury Mention: “As If the Earth Had Swallowed Them Up,” directed by Natalia LeónThe jury featured creatives from Taller del Chucho, Sony Pictures Animation and leading storyboard artists. Best U.S. Latino Live Action ShortPresented by Comcast NBCUniversal Telemundo Winner: “Beyond (Más Allá),” directed by Bettina López Mendoza — $4,000 cash prize Best U.S. Latina Director of a Live Action ShortPresented by Comcast NBCUniversal Telemundo Winner: “There’s a Devil Inside Me,” directed by Karina Lomelin Ripper — $4,000 cash prize Achievement in Original Music Driven Film Winner: “Brownsville Bred,” directed by Elaine del Valle",
  "image": "https://variety.com/wp-content/uploads/2025/06/no-vacancy.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe Latino Film Institute (LFI) announced the 2025 award winners of the \u003ca href=\"https://variety.com/t/los-angeles-latino-international-film-festival/\" id=\"auto-tag_los-angeles-latino-international-film-festival\" data-tag=\"los-angeles-latino-international-film-festival\"\u003eLos Angeles Latino International Film Festival\u003c/a\u003e (\u003ca href=\"https://variety.com/t/laliff/\" id=\"auto-tag_laliff\" data-tag=\"laliff\"\u003eLALIFF\u003c/a\u003e) on Saturday, honoring excellence across U.S. Latino film, animation and episodic storytelling. The accolades were revealed during a closing night cocktail reception held at The Kookaburra Lounge in Ovation Hollywood, wrapping the five-day festival that spotlighted over 90 films, including 18 world premieres.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tLALIFF 2025 opened with the documentary “ASCO: Without Permission” and closed with the narrative feature “Serious People.” In addition to its professional programming, nearly 300 student films were showcased through the Youth Cinema Project.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tAs part of its continued efforts to elevate Latino storytellers, the festival introduced the Adelante Award, recognizing trailblazers in Latino education and mentorship. Raul Maldonado, superintendent of the Palmdale School District, was the inaugural recipient for his work supporting future filmmakers.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tLos Angeles muralist and cultural icon Robert Vargas created a live painting during opening night, celebrating the city’s Latino heritage. Vargas, whose work includes “Shohei Ohtani / LA Rising” and the massive mural “Angelus,” added an artistic flourish that underscored the festival’s commitment to community and identity.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“This year’s festival has been a testament to the vibrant creativity and storytelling prowess within our community,” said Axel Caballero, CEO of the Latino Film Institute. “The diverse array of films and the passionate voices behind them not only entertained but also sparked meaningful conversations.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tNow in its 24th year, LALIFF continues to serve as a premiere platform for showcasing Latino creative voices. The 2025 festival featured screenings at the TCL Chinese Theatres, the Egyptian Theatre Hollywood and Regal L.A. Live, along with musical performances, comedy showcases and an expanded Industry Forum with networking events and masterclasses.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe full list of winners are below.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eLALIFF 2025 Award Winners:\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eLFI 2025 Spark Animation Fellowship\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eSponsored by the Netflix Fund for Creative Equity\u003c/em\u003e\u003cbr/\u003eFive U.S.-based Latino animators received $30,000 each to support their original animated short films:\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eAngel Ruvalcaba, “¿Necesitas Ayuda?”\u003c/li\u003e\n\n\n\n\u003cli\u003eAngela Sánchez, “Spin Cycle”\u003c/li\u003e\n\n\n\n\u003cli\u003eChevez Sanchez, “The Resilient Coquí”\u003c/li\u003e\n\n\n\n\u003cli\u003eGuillermo Casarin, “The Mariachi Mask”\u003c/li\u003e\n\n\n\n\u003cli\u003eSandra Powers, “Bestias De La Muerte”\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eLFI Works in Progress\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003eSponsored by Amazon MGM Studios\u003c/em\u003e\u003cbr/\u003eTwo filmmakers were awarded $20,000 each for post-production support:\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003e“Cancúncito,” written and directed by Carlos Alejandro Marulanda and Isael Gutierrez\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBest U.S. Episodic Short\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003ePresented by Disney Entertainment\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eWinner: “Born 2 Lose,” directed by Carlos Cardona — $4,000 cash prize\u003cbr/\u003eJury members included executives from National Geographic, Onyx Collective, Hulu, FX and Disney Branded Television.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBest U.S. Latino Animated Short Film\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003ePresented by the Latino Film Institute\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eWinner: “No Vacancy,” directed by Miguel Rodrick — $4,000 cash prize\u003c/li\u003e\n\n\n\n\u003cli\u003eSpecial Jury Mention: “As If the Earth Had Swallowed Them Up,” directed by Natalia León\u003cbr/\u003eThe jury featured creatives from Taller del Chucho, Sony Pictures Animation and leading storyboard artists.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBest U.S. Latino Live Action Short\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003ePresented by Comcast NBCUniversal Telemundo\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eWinner: “Beyond (Más Allá),” directed by Bettina López Mendoza — $4,000 cash prize\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eBest U.S. Latina Director of a Live Action Short\u003c/strong\u003e\u003cbr/\u003e\u003cem\u003ePresented by Comcast NBCUniversal Telemundo\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eWinner: “There’s a Devil Inside Me,” directed by Karina Lomelin Ripper — $4,000 cash prize\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003eAchievement in Original Music Driven Film\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eWinner: “Brownsville Bred,” directed by Elaine del Valle\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-01T22:00:00Z",
  "modifiedTime": "2025-06-01T21:57:27Z"
}
