{
  "id": "120eaef4-0367-4a39-abfe-5d1c83862eff",
  "title": "Teaser Trailer for Norwegian Thriller 'Armand' Starring Renate Reinsve",
  "link": "https://www.firstshowing.net/2024/teaser-trailer-for-norwegian-thriller-armand-starring-renate-reinsve/",
  "description": "\"Are you okay, Elisabeth?\" IFC Films has revealed a teaser trailer for Armand, a Norwegian film marking the feature directorial debut of Norwegian filmmaker Halfdan Ullmann Tøndel - who just so happens to be Ingmar Bergman's grandson. This film initially premiered at the 2024 Cannes Film Festival, and it played at tons of other festivals including Vancouver, Edinburgh, Woodstock, and Montclair. The film is set to hit US theaters in February 2025, just after the Oscar nominations (on January 17th), submitted by Norway for this year. If you're in NYC, you can catch it during its one week awards run later November. It \"sheds light on a complex theme from constantly new perspectives, surprising and touching its audience with creative portrayals of the main characters’ emotional journeys.\" Elisabeth is summoned to a parent-teacher meeting on short notice. Her son is accused of something, but what that \"something\" is, remains unclear. Soon, the principal, nurse, and more parents join a meeting that quickly spirals out of control. The film stars Renate Reinsve, Ellen Dorrit Petersen, Thea Lambrechts Vaulen, Endre Hellestveit, Øystein Røger, \u0026 Vera Veljovic. Sounds similar to Germany's The Teachers' Lounge. If anyone is intrigued keep an eye out. Here's […]",
  "author": "Alex Billington",
  "published": "Thu, 07 Nov 2024 22:23:42 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Foreign Films",
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2571,
  "excerpt": "\"Are you okay, Elisabeth?\" IFC Films has revealed a teaser trailer for Armand, a Norwegian film marking the feature directorial debut of Norwegian filmmaker Halfdan Ullmann Tøndel - who just so happens to be Ingmar Bergman's grandson. This film initially premiered at the 2024 Cannes Film Festival, and it played at tons of other festivals",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by November 7, 2024Source: YouTube \"Are you okay, Elisabeth?\" IFC Films has revealed a teaser trailer for Armand, a Norwegian film marking the feature directorial debut of Norwegian filmmaker Halfdan Ullmann Tøndel - who just so happens to be Ingmar Bergman's grandson. This film initially premiered at the 2024 Cannes Film Festival, and it played at tons of other festivals including Vancouver, Edinburgh, Woodstock, and Montclair. The film is set to hit US theaters in February 2025, just after the Oscar nominations (on January 17th), submitted by Norway for this year. If you're in NYC, you can catch it during its one week awards run later November. It \"sheds light on a complex theme from constantly new perspectives, surprising and touching its audience with creative portrayals of the main characters’ emotional journeys.\" Elisabeth is summoned to a parent-teacher meeting on short notice. Her son is accused of something, but what that \"something\" is, remains unclear. Soon, the principal, nurse, and more parents join a meeting that quickly spirals out of control. The film stars Renate Reinsve, Ellen Dorrit Petersen, Thea Lambrechts Vaulen, Endre Hellestveit, Øystein Røger, \u0026 Vera Veljovic. Sounds similar to Germany's The Teachers' Lounge. If anyone is intrigued keep an eye out. Here's the first teaser trailer for Halfdan Ullmann Tøndel's film Armand, direct from IFC's YouTube: When defamed actress Elisabeth (Renate Reinsve) is abruptly called into a parent-teacher meeting after hours, she's presented with scathing allegations that trigger a tangled web of accusations between parents and faculty. As Elisabeth struggles to uncover the truth amid the empty school rooms and dark corridors, a chaotic fight for redemption arises where desire, madness and obsession prevail. Armand is directed by Norwegian filmmaker Halfdan Ullmann Tøndel, the grandson of Liv Ullmann and Ingmar Bergman, now making his feature directorial debut after directing a few other short films previously. It's produced by Andrea Berentsen Ottmar. This first premiered at the 2024 Cannes Film Festival playing in the Un Certain Regard section. The film opened first in Norway back in September this year. IFC Films will debut Tøndel's Armand film in select US theaters starting February 7th, 2025 early next year. It will also have an awards run in NYC only starting November 29th, 2024 this fall for just one week. Anyone interested in this one? Find more posts: Foreign Films, Indies, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/ArmandPostermainNorfilmbigTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eNovember 7, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=NV-zCjL9PKY\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/teaser-trailer-for-norwegian-thriller-armand-starring-renate-reinsve/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmandPostermainNorfilmbigTsr1.jpg?quality=95\" alt=\"Armand Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Are you okay, Elisabeth?\u0026#34;\u003c/em\u003e IFC Films has revealed a teaser trailer for \u003cstrong\u003e\u003cem\u003eArmand\u003c/em\u003e\u003c/strong\u003e, a Norwegian film marking the feature directorial debut of Norwegian filmmaker Halfdan Ullmann Tøndel - who just so happens to be Ingmar Bergman\u0026#39;s grandson. This film initially premiered at the 2024 Cannes Film Festival, and it played at tons of other festivals including Vancouver, Edinburgh, Woodstock, and Montclair. The film is set to hit US theaters in \u003ca href=\"https://www.firstshowing.net/schedule2025/#feb\"\u003e\u003cstrong\u003eFebruary 2025\u003c/strong\u003e\u003c/a\u003e, just after the Oscar nominations (on January 17th), submitted by Norway for this year. If you\u0026#39;re in NYC, you can catch it during its one week awards run later November. It \u0026#34;sheds light on a complex theme from constantly new perspectives, surprising and touching its audience with creative portrayals of the main characters’ emotional journeys.\u0026#34; Elisabeth is summoned to a parent-teacher meeting on short notice. Her son is accused of something, but what that \u0026#34;something\u0026#34; is, remains unclear. Soon, the principal, nurse, and more parents join a meeting that quickly spirals out of control. The film stars \u003cstrong\u003eRenate Reinsve\u003c/strong\u003e, \u003cstrong\u003eEllen Dorrit Petersen\u003c/strong\u003e, \u003cstrong\u003eThea Lambrechts Vaulen\u003c/strong\u003e, \u003cstrong\u003eEndre Hellestveit\u003c/strong\u003e, \u003cstrong\u003eØystein Røger\u003c/strong\u003e, \u0026amp; \u003cstrong\u003eVera Veljovic\u003c/strong\u003e. Sounds similar to Germany\u0026#39;s \u003ca href=\"https://www.firstshowing.net/2023/us-trailer-for-german-film-the-teachers-lounge/\" title=\"New US Trailer for German Film \u0026#39;The Teachers\u0026#39; Lounge\u0026#39; - A Must See\"\u003e\u003cem\u003eThe Teachers\u0026#39; Lounge\u003c/em\u003e\u003c/a\u003e. If anyone is intrigued keep an eye out.\u003cspan id=\"more-717446\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the first teaser trailer for Halfdan Ullmann Tøndel\u0026#39;s film \u003cstrong\u003e\u003cem\u003eArmand\u003c/em\u003e\u003c/strong\u003e, direct from IFC\u0026#39;s \u003ca href=\"https://www.youtube.com/watch?v=NV-zCjL9PKY\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmandPostermainNorfilmbig591.jpg?width=599\" alt=\"Armand Film Teaser\" width=\"599\" height=\"873\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/ArmandPostermainNorfilmbig592.jpg?width=599\" alt=\"Armand Film Teaser\" width=\"599\" height=\"882\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhen defamed actress Elisabeth (Renate Reinsve) is abruptly called into a parent-teacher meeting after hours, she\u0026#39;s presented with scathing allegations that trigger a tangled web of accusations between parents and faculty. As Elisabeth struggles to uncover the truth amid the empty school rooms and dark corridors, a chaotic fight for redemption arises where desire, madness and obsession prevail.\u003c/em\u003e \u003cem\u003eArmand\u003c/em\u003e is directed by Norwegian filmmaker \u003ca href=\"https://www.imdb.com/name/nm6014531/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eHalfdan Ullmann Tøndel\u003c/strong\u003e\u003c/a\u003e, the grandson of Liv Ullmann and Ingmar Bergman, now making his feature directorial debut after directing a few other short films previously. It\u0026#39;s produced by Andrea Berentsen Ottmar. This first premiered at the 2024 Cannes Film Festival playing in the Un Certain Regard section. The film opened first in Norway back in September this year. IFC Films will debut Tøndel\u0026#39;s \u003cem\u003eArmand\u003c/em\u003e film in select US theaters starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#feb\"\u003e\u003cstrong\u003eFebruary 7th, 2025\u003c/strong\u003e\u003c/a\u003e early next year. It will also have an awards run in NYC only starting \u003ca href=\"https://www.firstshowing.net/schedule2024/#sep\"\u003e\u003cstrong\u003eNovember 29th, 2024\u003c/strong\u003e\u003c/a\u003e this fall for just one week. \u003cem\u003eAnyone interested in this one?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/foreign-films/\" rel=\"category tag\"\u003eForeign Films\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-07T17:23:42-05:00",
  "modifiedTime": null
}
