{
  "id": "124a69dc-610a-472b-93a8-646c5921b9a8",
  "title": "Robert Eggers Is Set To Write And Write The Sequel To Labyrinth",
  "link": "https://bleedingcool.com/movies/robert-eggers-is-set-to-write-and-write-the-sequel-to-labyrinth/",
  "description": "Today, it was announced that Robert Eggers has signed on to direct and write a sequel to the Jim Henson 1986 classic Labyrinth.",
  "author": "Kaitlyn Booth",
  "published": "Thu, 23 Jan 2025 17:47:06 -0600",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Movies",
    "Sony",
    "Labyrinth",
    "robert eggers"
  ],
  "byline": "Kaitlyn Booth",
  "length": 3482,
  "excerpt": "Well, this news is a bit all over the place. Yesterday, it was confirmed that director Robert Eggers would be reteaming with Focus Features to try and make the goth horror Christmas Day lightning strike again with Werwulf. All that sounded interesting enough and pretty much on track with what we have expected from Eggers so []",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Movies, Sony | Tagged: Labyrinth, robert eggersToday, it was announced that Robert Eggers has signed on to direct and write a sequel to the Jim Henson 1986 classic Labyrinth.Article Summary Robert Eggers will direct and write a sequel to Jim Henson's 1986 classic film, Labyrinth. Eggers collaborates with Sj贸n on the script, with production by Chris and Eleanor Columbus and Lisa Henson. The sequel has been in development hell for nearly a decade with previous directors attached. Despite its initial lukewarm reception, Labyrinth became a cult classic with a dedicated fanbase. Well, this news is a bit all over the place. Yesterday, it was confirmed that director Robert Eggers would be reteaming with Focus Features to try and make the goth horror Christmas Day lightning strike again withWerwulf. All that sounded interesting enough and pretty much on track with what we have expected from Eggers so far in his career. Today's announcement is the polar opposite of that. After two different directors and stumbling around the circles of development hell for eight years, Deadline has announced that Eggers has signed to direct the sequel to Labyrinth.He is also writing the script with Sj贸n, whom he also worked with onThe Northman, and he is reteaming with forWerwulf as well. Chris and Eleanor Columbus will produce alongside Lisa Henson, with Brian Henson executive producing, and we don't have any plot details aside from sources saying, \"The film is a sequel to, rather than a remake of, Jim Henson's 1986 classic.\" Robert Eggers arrives for \"The Northman\" Hollywood Premiere on April 18, 2022 in Hollywood, CA. Editorial credit: DFree / Shutterstock.com The sequel toLabyrinthis another one of those sequel concepts that has been floating around Hollywood for a while now. The first film, released by TriStar in 1986, was not exactly a hit at the box office, grossing $34 million on a budget of $25 million. However, it became a cult classic that managed to find an audience on home release that has kept it alive and going ever since. People still host screenings of this film to this day, and people still cosplay and dress up as these characters. It's beloved by a certain generation of people, which is why this proposed sequel is probably going to piss them off. The first version of aLabyrinth sequel was first really floated around in 2016, so we're looking at yet another decade-long development cycle; unlike other films that have had development cycles that long, this one had a bunch of false starts that probably set some people back a pretty penny. Since 2016, both Fede lvarez and Scott Derrickson were each, at one point, signed on to direct the project from a script reportedly by Nicole Perlman. The final version of the Derrickson film seemed to fall apart in late 2023 after three years of trying to get it off the ground. All of this work means Sony is heading into this film in the red, more than likely, which is never a good way to start. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member.  Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/01/shutterstock_2151361383-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2154330\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/sony/\" rel=\"category\"\u003eSony\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/labyrinth/\" rel=\"tag\"\u003eLabyrinth\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/robert-eggers/\" rel=\"tag\"\u003erobert eggers\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eToday, it was announced that Robert Eggers has signed on to direct and write a sequel to the Jim Henson 1986 classic Labyrinth.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eRobert Eggers will direct and write a sequel to Jim Henson\u0026#39;s 1986 classic film, Labyrinth.\u003c/li\u003e\n\u003cli\u003eEggers collaborates with Sj贸n on the script, with production by Chris and Eleanor Columbus and Lisa Henson.\u003c/li\u003e\n\u003cli\u003eThe sequel has been in development hell for nearly a decade with previous directors attached.\u003c/li\u003e\n\u003cli\u003eDespite its initial lukewarm reception, Labyrinth became a cult classic with a dedicated fanbase.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003eWell, this news is a bit all over the place. Yesterday, it was confirmed that director \u003cstrong\u003eRobert Eggers\u003c/strong\u003e \u003ca href=\"https://bleedingcool.com/movies/robert-eggers-next-film-is-titled-werwulf-is-dated-christmas-2026/\"\u003ewould be reteaming\u003c/a\u003e with Focus Features to try and make the goth horror Christmas Day lightning strike again with\u003cem\u003eWerwulf\u003c/em\u003e. All that sounded interesting enough and pretty much on track with what we have expected from Eggers so far in his career. Today\u0026#39;s announcement is the polar opposite of that. After two different directors and stumbling around the circles of development hell for eight years, \u003ca href=\"https://deadline.com/2025/01/robert-eggers-labyrinth-sequel-sony-1236265010/\"\u003eDeadline\u003c/a\u003e has announced that Eggers has signed to direct the sequel to \u003cem\u003eLabyrinth.\u003c/em\u003eHe is also writing the script with \u003cstrong\u003eSj贸n,\u003c/strong\u003e whom he also worked with on\u003cem\u003eThe Northman,\u003c/em\u003e and he is reteaming with for\u003cem\u003eWerwulf\u003c/em\u003e as well. \u003cstrong\u003eChris and Eleanor Columbus\u003c/strong\u003e will produce alongside \u003cstrong\u003eLisa Henson, \u003c/strong\u003ewith \u003cstrong\u003eBrian Henson\u003c/strong\u003e executive producing, and we don\u0026#39;t have any plot details aside from sources saying, \u0026#34;The film is a sequel to, rather than a remake of, Jim Henson\u0026#39;s 1986 classic.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"attachment_2153583\" aria-describedby=\"caption-attachment-2153583\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/01/shutterstock_2151361383.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/01/shutterstock_2151361383.jpg\" alt=\"Auto Draft\" width=\"600\" height=\"338\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:338/q:75/https://bleedingcool.com/wp-content/uploads/2025/01/shutterstock_2151361383.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20338%22%20width%3D%22600%22%20height%3D%22338%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2153583\"\u003eRobert Eggers arrives for \u0026#34;The Northman\u0026#34; Hollywood Premiere on April 18, 2022 in Hollywood, CA. Editorial credit: DFree / Shutterstock.com\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThe sequel to\u003cem\u003eLabyrinth\u003c/em\u003eis another one of those sequel concepts that has been floating around Hollywood for a while now. The first film, released by TriStar in 1986, was not exactly a hit at the box office, grossing $34 million on a budget of $25 million. However, it became a cult classic that managed to find an audience on home release that has kept it alive and going ever since. People still host screenings of this film to this day, and people still cosplay and dress up as these characters. It\u0026#39;s beloved by a certain generation of people, which is why this proposed sequel is probably going to piss them off.\u003c/p\u003e\n\u003cp\u003eThe first version of a\u003cem\u003eLabyrinth\u003c/em\u003e sequel was first really floated around in 2016, so we\u0026#39;re looking at yet another decade-long development cycle; unlike other films that have had development cycles that long, this one had a bunch of false starts that probably set some people back a pretty penny. Since 2016, both \u003cstrong\u003eFede lvarez \u003c/strong\u003eand \u003cstrong\u003eScott Derrickson\u003c/strong\u003e were each, at one point, signed on to direct the project from a script reportedly by \u003cstrong\u003eNicole Perlman\u003c/strong\u003e. The final version of the Derrickson film seemed to fall apart in late 2023 after three years of trying to get it off the ground. All of this work means Sony is heading into this film in the red, more than likely, which is never a good way to start.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Frobert-eggers-is-set-to-write-and-write-the-sequel-to-labyrinth%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Frobert-eggers-is-set-to-write-and-write-the-sequel-to-labyrinth%2F\u0026amp;text=Robert+Eggers+Is+Set+To+Write+And+Write+The+Sequel+To+Labyrinth\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Frobert-eggers-is-set-to-write-and-write-the-sequel-to-labyrinth%2F\u0026amp;description=Robert+Eggers+Is+Set+To+Write+And+Write+The+Sequel+To+Labyrinth\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Frobert-eggers-is-set-to-write-and-write-the-sequel-to-labyrinth%2F\u0026amp;title=Robert+Eggers+Is+Set+To+Write+And+Write+The+Sequel+To+Labyrinth\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member.  Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-23T17:47:06-06:00",
  "modifiedTime": "2025-01-23T17:47:06-06:00"
}
