{
  "id": "1e19c855-7b60-4bd0-aa38-0b450b973b4a",
  "title": "How Old Are Amy \u0026 Sheldon's Kids In The Young Sheldon Finale?",
  "link": "https://www.slashfilm.com/1811309/amy-farrah-fowler-sheldon-cooper-kids-age-young-sheldon-finale/",
  "description": "In the Young Sheldon finale, adult Sheldon Cooper and his wife Amy appear, mentioning two children. Now we know much time has passed since The Big Bang Theory.",
  "author": "Nina Starner",
  "published": "Sat, 15 Mar 2025 22:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Shows",
    "Drama Shows"
  ],
  "byline": "Nina Starner",
  "length": 4220,
  "excerpt": "In the Young Sheldon finale, adult Sheldon Cooper and his wife Amy appear, mentioning two children. Now we know much time has passed since The Big Bang Theory.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "CBS In the series finale of \"Young Sheldon\" — which aired on CBS in May 2024 — Jim Parsons reappears in person to play Sheldon Cooper, but old. Old Sheldon, if you will. This was a welcome surprise for fans of \"The Big Bang Theory,\" the show that spawned \"Young Sheldon,\" a prequel where Sheldon Cooper is played by Iain Armitage growing up in the fictional town of East Medford, Texas. The younger Sheldon goes through a lot, and at the end of the series, he faces his toughest challenge yet when his father George Cooper Sr. (Lance Barber) passes away. During the series finale, Sheldon thinks about losing his father ... and remarks that he also has children, putting all of this into perspective. \"For a long time I focused on my father's shortcomings,\" he says in the show's last episode. \"Now that I'm his age and have kids of my own, I realize he was just a person doing the best he could, and he did a lot. I didn't say it at his funeral but I can say it now. I loved my father, I will miss him forever.\" Wait — Sheldon and his wife Amy Farrah Fowler (Mayim Bialik) have kids?! Not only do we learn that they have a son and a daughter, but we also learn that the son's name is Leonard and he plays hockey (much to Sheldon's chagrin). The couple also have a daughter, and while we don't learn her name in this episode, titled \"Memoir,\" Sheldon apparently takes acting classes with her. So how old are these kids now? \"We don't say, but their kids in our minds are probably 11 or 12,\" showrunner and creator Steve Molaro, who also worked on \"The Big Bang Theory,\" told Glamour in an interview after the series concluded. \"So we're probably maybe five or six-ish years in the future from now. But it's unspecified.\" Jim Parsons actually almost didn't appear in the Young Sheldon finale at all CBS This moment with Sheldon and Amy in the \"Young Sheldon\" finale where they talk about their own children is, pretty much, a perfect way to end the prequel series ... and according to Jim Parsons, it almost didn't even come to pass. In an interview with People Magazine in the wake of the finale, Parsons said that he was extremely apprehensive about returning to play Sheldon again, not wanting to overstay his welcome and unsure of whether or not he wanted to play Sheldon Cooper again (aside from the voiceover he provided for the series). \"I felt a slight hesitancy when they first asked, just as I thought, I don't really want to go revisit the character,\" Parsons admitted to the outlet. \"But the way that they wrote it in was I thought so beautiful that it ended up being like this little extra coda or whatever to my experience with the character. It was this gift of a second layer of losing it out in a way that I had never seen coming, and it was a real treat.\" With all that in mind, it's lovely that Parsons decided to return, and according to Steve Molaro and his fellow showrunner Steve Holland, it was phenomenal for the creative team as well. \"It was wonderful,\" Molaro said in the aforementioned Glamour interview when asked what it was like to welcome Parsons and Mayim Bialik back to their roles. \"We interact with Jim all the time because he's the narrator on our show...but to see him as Sheldon on the set with Mayim, it was emotional and surreal and exciting. It was the best day.\" \"They're such good actors and so smart to watch, so to see the choices they're making at each moment was really fun to watch,\" Holland added. \"There's a physicality to Sheldon, in the way Jim has always performed, and it's different than only having him do the voiceovers. Seeing him there in person really brings the character back.\" \"Young Sheldon,\" including the finale where we see Amy and Sheldon return and talk about their unseen children, is streaming on Max and Netflix now.",
  "image": "https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/l-intro-1741980460.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1811309/amy-farrah-fowler-sheldon-cooper-kids-age-young-sheldon-finale/\" data-post-title=\"How Old Are Amy \u0026amp; Sheldon\u0026#39;s Kids In The Young Sheldon Finale?\" data-slide-num=\"0\" data-post-id=\"1811309\"\u003e\n                                             \u003cpicture id=\"p8c387cd2e26fbdb97aec5c1d76b57604\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/intro-1741980460.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/intro-1741980460.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/intro-1741980460.jpg\" data-slide-url=\"https://www.slashfilm.com/1811309/amy-farrah-fowler-sheldon-cooper-kids-age-young-sheldon-finale/\" data-post-id=\"1811309\" data-slide-num=\"0\" data-slide-title=\"How Old Are Amy \u0026amp; Sheldon\u0026#39;s Kids In The Young Sheldon Finale?: \" width=\"780\" height=\"438\" alt=\"Amy and Sheldon looking at a computer in Sheldon\u0026#39;s office onYoung Sheldon\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eIn the series finale of \u0026#34;Young Sheldon\u0026#34; — which aired on CBS in May 2024 — Jim Parsons reappears in person to play Sheldon Cooper, but old. Old Sheldon, if you will. This was a welcome surprise for fans of \u003ca href=\"https://www.slashfilm.com/1794444/watch-young-sheldon-before-the-big-bang-theory/\" target=\"_blank\"\u003e\u0026#34;The Big Bang Theory,\u0026#34; the show that spawned \u0026#34;Young Sheldon,\u0026#34;\u003c/a\u003e a prequel where Sheldon Cooper is played by Iain Armitage growing up in the fictional town of East Medford, Texas. The younger Sheldon goes through a lot, and at the end of the series, he faces his toughest challenge yet when \u003ca href=\"https://www.slashfilm.com/1760403/why-george-cooper-young-sheldon-funeral-episode-re-edited/\" target=\"_blank\"\u003ehis father George Cooper Sr. (Lance Barber) passes away.\u003c/a\u003e During the series finale, Sheldon thinks about losing his father ... and remarks that he also has children, putting all of this into perspective. \u0026#34;For a long time I focused on my father\u0026#39;s shortcomings,\u0026#34; he says in the show\u0026#39;s last episode. \u0026#34;Now that I\u0026#39;m his age and have kids of my own, I realize he was just a person doing the best he could, and he did a lot. I didn\u0026#39;t say it at his funeral but I can say it now. I loved my father, I will miss him forever.\u0026#34;\u003c/p\u003e\n\n\u003cp\u003eWait — Sheldon and his wife Amy Farrah Fowler (Mayim Bialik) have kids?! Not only do we learn that they have a son \u003cem\u003eand\u003c/em\u003e a daughter, but we also learn that the son\u0026#39;s name is Leonard and he plays hockey (much to Sheldon\u0026#39;s chagrin). The couple also have a daughter, and while we don\u0026#39;t learn her name in this episode, titled \u0026#34;Memoir,\u0026#34; Sheldon apparently takes acting classes with her. So how old are these kids now?\u003c/p\u003e\n\u003cp\u003e\u0026#34;We don\u0026#39;t say, but their kids in our minds are probably 11 or 12,\u0026#34; showrunner and creator Steve Molaro, who also worked on \u0026#34;The Big Bang Theory,\u0026#34; told \u003ca href=\"https://www.glamour.com/story/young-sheldon-finale-episode\" target=\"_blank\"\u003eGlamour\u003c/a\u003e in an interview after the series concluded. \u0026#34;So we\u0026#39;re probably maybe five or six-ish years in the future from now. But it\u0026#39;s unspecified.\u0026#34;\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eJim Parsons actually almost didn\u0026#39;t appear in the Young Sheldon finale at all\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1811309/amy-farrah-fowler-sheldon-cooper-kids-age-young-sheldon-finale/\" data-post-title=\"How Old Are Amy \u0026amp; Sheldon\u0026#39;s Kids In The Young Sheldon Finale?\" data-slide-num=\"1\" data-post-id=\"1811309\"\u003e\n                                             \u003cpicture id=\"p9f6c49852abc2c78df8bcf52b5645484\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/jim-parsons-actually-almost-didnt-appear-in-the-young-sheldon-finale-at-all-1741980461.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/jim-parsons-actually-almost-didnt-appear-in-the-young-sheldon-finale-at-all-1741980461.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/how-old-are-amy-sheldons-kids-in-the-young-sheldon-finale/jim-parsons-actually-almost-didnt-appear-in-the-young-sheldon-finale-at-all-1741980461.jpg\" data-slide-url=\"https://www.slashfilm.com/1811309/amy-farrah-fowler-sheldon-cooper-kids-age-young-sheldon-finale/\" data-post-id=\"1811309\" data-slide-num=\"1\" data-slide-title=\"How Old Are Amy \u0026amp; Sheldon\u0026#39;s Kids In The Young Sheldon Finale?: Jim Parsons actually almost didn\u0026#39;t appear in the Young Sheldon finale at all\" width=\"780\" height=\"438\" alt=\"Amy and Sheldon talking in his office on Young Sheldon\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eCBS\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp id=\"mntl-sc-block_12-0\"\u003eThis moment with Sheldon and Amy in the \u0026#34;Young Sheldon\u0026#34; finale where they talk about their own children is, pretty much, a perfect way to end the prequel series ... and according to Jim Parsons, it almost didn\u0026#39;t even come to pass. In an interview with \u003ca href=\"https://people.com/jim-parsons-reprising-big-bang-theory-role-is-a-gift-exclusive-8647240\" target=\"_blank\"\u003ePeople Magazine\u003c/a\u003e in the wake of the finale, \u003ca href=\"https://www.slashfilm.com/1711247/jim-parsons-the-big-bang-theory-star-almost-rejected-young-sheldon/\" target=\"_blank\"\u003eParsons said that he was extremely apprehensive about returning to play Sheldon again\u003c/a\u003e, not wanting to overstay his welcome and unsure of whether or not he wanted to play Sheldon Cooper again (aside from the voiceover he provided for the series).\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_12-0\"\u003e\u0026#34;I felt a slight hesitancy when they first asked, just as I thought, I don\u0026#39;t really want to go revisit the character,\u0026#34; Parsons admitted to the outlet. \u0026#34;But the way that they wrote it in was I thought so beautiful that it ended up being like this little extra coda or whatever to my experience with the character. It was this gift of a second layer of losing it out in a way that I had never seen coming, and it was a real treat.\u0026#34;\u003c/p\u003e\n\u003cp id=\"mntl-sc-block_18-0\"\u003eWith all that in mind, it\u0026#39;s lovely that Parsons decided to return, and according to Steve Molaro and his fellow showrunner Steve Holland, it was phenomenal for the creative team as well. \u0026#34;It was wonderful,\u0026#34; Molaro said in the aforementioned Glamour interview when asked what it was like to welcome Parsons and Mayim Bialik back to their roles. \u0026#34;We interact with Jim all the time because he\u0026#39;s the narrator on our show...but to see him as Sheldon on the set with Mayim, it was emotional and surreal and exciting. It was the best day.\u0026#34;\u003c/p\u003e\n\n\u003cp id=\"mntl-sc-block_18-0\"\u003e\u0026#34;They\u0026#39;re such good actors and so smart to watch, so to see the choices they\u0026#39;re making at each moment was really fun to watch,\u0026#34; Holland added. \u0026#34;There\u0026#39;s a physicality to Sheldon, in the way Jim has always performed, and it\u0026#39;s different than only having him do the voiceovers. Seeing him there in person really brings the character back.\u0026#34;\u003c/p\u003e\n\u003cp id=\"mntl-sc-block_18-0\"\u003e\u0026#34;Young Sheldon,\u0026#34; including the finale where we see Amy and Sheldon return and talk about their unseen children, is streaming on Max and Netflix now.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-15T22:45:00Z",
  "modifiedTime": "2025-03-15T22:45:00Z"
}
