{
  "id": "1f1be527-062a-478a-b812-5642133eecec",
  "title": "Actor and Disability Rights Activist Liz Carr Speaks Out Against Legalizing Assisted Death in the US, ‘They Think It’s Better to Be Dead Than to Be Disabled’",
  "link": "https://variety.com/2024/politics/news/liz-carr-assisted-death-in-the-us-1236176544/",
  "description": "Liz Carr, known for starring in the third season of the fantasy comedy “Good Omens” and playing a forensic scientist in the crime drama “Silent Witness,” supports the U.S. government’s refusal to outright legalize euthanasia in the nation. The actress and disability rights activist argued how these programs may have cultural implications on the lives […]",
  "author": "Emiliana Betancourt",
  "published": "Sun, 13 Oct 2024 22:53:06 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Politics",
    "Assisted Death",
    "Euthanasia",
    "Liz Carr"
  ],
  "byline": "Emiliana Betancourt",
  "length": 3916,
  "excerpt": "Liz Carr speaks out against the battle to legalize assisted death in the US.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Liz Carr, known for starring in the third season of the fantasy comedy “Good Omens” and playing a forensic scientist in the crime drama “Silent Witness,” supports the U.S. government’s refusal to outright legalize euthanasia in the nation. The actress and disability rights activist argued how these programs may have cultural implications on the lives of people with disabilities. Arguing, “For somebody who loses their job or a loved one and is left feeling suicidal, others will rally around and support them with suicide prevention help,” she said to Daily Mail, “But as soon as that’s a disabled or ill person, people think it’s fine for them to have a medically-assisted death. They think it’s better to be dead than to be disabled.” Legalizing such an option, she believes, might encourage disabled people to end their lives prematurely with the belief they must “stop being a burden” to those around them. The implications behind this assisted medical service might push the wrong idea onto people, she claims. Popular on Variety Carr was diagnosed at the age of seven with a rare genetic disorder in her muscles and joints called arthrogryposis multiplex congenita. Since gaining a position in the limelight, she has become an advocate for others like her, going against assisted death for over a decade. Last month, she screened her documentary “Better Off Dead?” in front of the U.S. Congress, co-sponsored by the Disability Rights Education and Defense Fund, the Patients’ Rights Action Fund, and Not Dead Yet. “As long as we’re unequal, and certain groups are devalued, no safeguard will protect us,” says Carr. So far in the U.S., 10 states and Washington, D.C., have made assisted suicide legal: California, Colorado, Oregon, Vermont, New Mexico, Maine, New Jersey, and Hawaii. The requirements are for patients to be over the age of 18, within six months of death, and to complete an assessment of their decision-making to ensure it was well thought out. This year, about 19 bills were introduced to state legislatures; no new states managed to legalize the procedure. The last state to do so was New Mexico in 2021. However, in 2023, Vermont amended its assisted dying law to remove the residency requirement, meaning that now people may travel into the state and get the procedure done without being a resident of the state. The case is a controversial one, with many activists like Carr fighting against it with stories like that of Canadian army veteran and former Paralympian Christine Gauthier, who was offered assisted death when she complained to her government that the wheelchair lift installation in her home was taking too long. Religious groups in the U.S. also rally against the law on moral grounds. Others plead for the option to prevent patients with long-term terminal illnesses from suffering all the way through to their deaths in a severely torturous manner. An example is the heartbreaking case of Ayla Eilert, who died in April 2022 after a seven-month-long arduous battle with cancer that left her in agony and pleading for the option of a doctor-assisted death that was not available in her home state of New York. The current standstill in legislation and recent trends regarding the subject might highlight where the issue might lie, at least for now. John Carney, governor of Delaware, vetoed a bill allowing assisted dying just last month, stating, “I am fundamentally and morally opposed to state law enabling someone, even under tragic and painful circumstances, to take their own life.” “This tells me that people are really thinking,” says Carr, “They don’t want to make whole groups of people feel afraid, especially those who already feel very vulnerable.” The conversation continues to pick up steam as more bills regarding the subject become discussed in states such as Illinois and Minnesota.",
  "image": "https://variety.com/wp-content/uploads/2024/10/liz-carr.webp?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://variety.com/t/liz-carr/\" id=\"auto-tag_liz-carr\" data-tag=\"liz-carr\"\u003eLiz Carr\u003c/a\u003e, known for starring in the third season of the fantasy comedy “Good Omens” and playing a forensic scientist in the crime drama “Silent Witness,” supports the U.S. government’s refusal to outright legalize \u003ca href=\"https://variety.com/t/euthanasia/\" id=\"auto-tag_euthanasia\" data-tag=\"euthanasia\"\u003eeuthanasia\u003c/a\u003e in the nation.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe actress and disability rights activist argued how these programs may have cultural implications on the lives of people with disabilities. Arguing, “For somebody who loses their job or a loved one and is left feeling suicidal, others will rally around and support them with suicide prevention help,” she said to\u003ca href=\"https://www.dailymail.co.uk/news/article-13933029/liz-carr-america-assisted-dying-disabled.html\" data-type=\"link\" data-id=\"https://www.dailymail.co.uk/news/article-13933029/liz-carr-america-assisted-dying-disabled.html\" rel=\"nofollow\" target=\"_blank\"\u003e Daily Mail\u003c/a\u003e, “But as soon as that’s a disabled or ill person, people think it’s fine for them to have a medically-\u003ca href=\"https://variety.com/t/assisted-death/\" id=\"auto-tag_assisted-death\" data-tag=\"assisted-death\"\u003eassisted death\u003c/a\u003e. They think it’s better to be dead than to be disabled.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tLegalizing such an option, she believes, might encourage disabled people to end their lives prematurely with the belief they must “stop being a burden” to those around them. The implications behind this assisted medical service might push the wrong idea onto people, she claims.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tCarr was diagnosed at the age of seven with a rare genetic disorder in her muscles and joints called arthrogryposis multiplex congenita. Since gaining a position in the limelight, she has become an advocate for others like her, going against assisted death for over a decade. Last month, she screened her documentary “Better Off Dead?” in front of the U.S. Congress, co-sponsored by the \u003ca rel=\"nofollow\" href=\"https://dredf.org/\" target=\"_blank\"\u003eDisability Rights Education and Defense Fund\u003c/a\u003e, the\u003ca rel=\"nofollow\" href=\"https://patientsrightsaction.org/\" target=\"_blank\"\u003e Patients’ Rights Action Fund\u003c/a\u003e, and \u003ca rel=\"nofollow\" href=\"https://notdeadyet.org/\" target=\"_blank\"\u003eNot Dead Yet\u003c/a\u003e. “As long as we’re unequal, and certain groups are devalued, no safeguard will protect us,” says Carr.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSo far in the U.S., 10 states and Washington, D.C., have made assisted suicide legal: California, Colorado, Oregon, Vermont, New Mexico, Maine, New Jersey, and Hawaii. The requirements are for patients to be over the age of 18, within six months of death, and to complete an assessment of their decision-making to ensure it was well thought out. This year, about 19 bills were introduced to state legislatures; no new states managed to legalize the procedure. The last state to do so was \u003ca rel=\"nofollow\" href=\"https://www.cnn.com/2014/11/26/us/physician-assisted-suicide-fast-facts/index.html\" target=\"_blank\"\u003eNew Mexico\u003c/a\u003e in 2021. However, in 2023, Vermont amended its assisted dying law to \u003ca rel=\"nofollow\" href=\"https://legislature.vermont.gov/Documents/2024/Docs/ACTS/ACT010/ACT010%20As%20Enacted.pdf\" target=\"_blank\"\u003eremove the residency requirement\u003c/a\u003e, meaning that now people may travel into the state and get the procedure done without being a resident of the state.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe case is a controversial one, with many activists like Carr fighting against it with stories like that of Canadian army veteran and former Paralympian \u003ca href=\"https://globalnews.ca/video/9323192/former-paralympian-says-veterans-affairs-department-offered-her-assisted-death/\" rel=\"nofollow\" target=\"_blank\"\u003eChristine Gauthier\u003c/a\u003e, who was offered assisted death when she complained to her government that the wheelchair lift installation in her home was taking too long. Religious groups in the U.S. also rally against the law on moral grounds. Others plead for the option to prevent patients with long-term terminal illnesses from suffering all the way through to their deaths in a severely torturous manner.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAn example is the heartbreaking case of \u003ca href=\"https://www.silive.com/news/2024/04/24-year-old-died-suffering-her-parents-want-new-yorkers-to-have-the-choice-of-life-ending-medication.html\" rel=\"nofollow\" target=\"_blank\"\u003eAyla Eilert\u003c/a\u003e, who died in April 2022 after a seven-month-long arduous battle with cancer that left her in agony and pleading for the option of a doctor-assisted death that was not available in her home state of New York.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe current standstill in legislation and recent trends regarding the subject might highlight where the issue might lie, at least for now. John Carney, governor of Delaware, vetoed a bill allowing assisted dying just last month, stating, “I am fundamentally and morally opposed to state law enabling someone, even under tragic and painful circumstances, to take their own life.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“This tells me that people are really thinking,” says Carr, “They don’t want to make whole groups of people feel afraid, especially those who already feel very vulnerable.” The conversation continues to pick up steam as\u003ca rel=\"nofollow\" href=\"https://www.silive.com/news/2024/04/24-year-old-died-suffering-her-parents-want-new-yorkers-to-have-the-choice-of-life-ending-medication.html\" target=\"_blank\"\u003e more bills\u003c/a\u003e regarding the subject become discussed in states such as Illinois and Minnesota.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-13T22:53:06Z",
  "modifiedTime": "2024-10-13T22:53:14Z"
}
