{
  "id": "2684f46a-9dc5-4bc6-848c-100ad61b6612",
  "title": "Jennifer Lopez’s ‘Kiss of the Spider Woman’ Nears Sale to Roadside Attractions, Lionsgate",
  "link": "https://variety.com/2025/film/news/jennifer-lopez-kiss-of-the-spider-woman-roadside-lionsgate-1236284889/",
  "description": "“Kiss of the Spider Woman,” a musical remake from director Bill Condon and star Jennifer Lopez, is finally close to finding a buyer after its buzzy Sundance Film Festival premiere in January. Roadside Attractions, Lionsgate and independent studio LD Entertainment are circling domestic rights, though a deal has yet to close. It’s unclear how the trio will work together […]",
  "author": "Rebecca Rubin",
  "published": "Mon, 24 Mar 2025 00:33:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Kiss Of The Spider Woman",
    "Sundance Film Festival"
  ],
  "byline": "Rebecca Rubin",
  "length": 2563,
  "excerpt": "\"Kiss of the Spider Woman,\" a remake from director Bill Condon and star Jennifer Lopez, has sold following its Sundance Film Festival premiere.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "“Kiss of the Spider Woman,” a musical remake from director Bill Condon and star Jennifer Lopez, is finally close to finding a buyer after its buzzy Sundance Film Festival premiere in January. Roadside Attractions, Lionsgate and independent studio LD Entertainment are circling domestic rights, though a deal has yet to close. It’s unclear how the trio will work together to roll out the film. “Kiss of the Spider Woman” was independently financed in the high $30 million range. Terms of the potential sale were not disclosed. This adaptation of Manuel Puig’s novel was one of higher profile projects to debut at Sundance. Set in an Argentinian prison in 1981, the film centers on queer window dresser Luis Molina (Tonatiuh) who is serving time for having sex with a man. To escape the horrors of his imprisonment, he dreams up vivid stories about the cinematic exploits of his favorite on screen diva, an actress name Ingrid Luna (Lopez), including her role of the spider woman, who kills her pray with a kiss. Molina’s life is upended after forming an unlikely bond with his new cellmate (Diego Luna). Popular on Variety It’s the second film version of “Kiss of the Spider Woman” following the acclaimed 1985 feature from director Héctor Babenco, which won an Oscar for William Hurt’s portrayal of Molina. John Kander and Fred Ebb’s stage version opened on Broadway in 1993 and won seven Tony Awards, including best musical and best performances by Chita Rivera, Brent Carver and Anthony Crivello. At the premiere, Lopez, outfitted in a sparkling, webbed-up gown, fought back tears as “Kiss of the Spider Woman” was greeted with a standing ovation. “I’ve been waiting for this moment my whole life,” she told the audience at Park City’s Eccles Theatre. Condon has become a preeminent filmmaker for movie musicals, having worked on “Chicago,” “Dreamgirls,” Disney’s “Beauty and the Beast” remake and “The Greatest Showman.” He first attended Sundance with 1998’s period drama “Gods and Monsters,” starring Ian McKellen and Brendan Fraser. “I came here 27 years ago. ‘Kiss of the Spider Woman’ is a movie I started thinking about all those years ago,” Condon said at the premiere. “It’s a movie I’ve wanted to make my entire life.” In Variety’s review, chief film critic Peter Debruge praised Lopez’s performance but declared that “it’s relative newcomer Tonatiuh who walks away with the show, finding both strength and vulnerability in a character who seems less frivolous with each passing scene.”",
  "image": "https://variety.com/wp-content/uploads/2024/12/Kiss-of-the-Spider-Woman.jpeg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t“\u003ca href=\"https://variety.com/t/kiss-of-the-spider-woman/\" id=\"auto-tag_kiss-of-the-spider-woman\" data-tag=\"kiss-of-the-spider-woman\"\u003eKiss of the Spider Woman\u003c/a\u003e,” a musical remake from director Bill Condon and star Jennifer Lopez, is finally close to finding a buyer after its buzzy \u003ca href=\"https://variety.com/t/sundance-film-festival/\" id=\"auto-tag_sundance-film-festival\" data-tag=\"sundance-film-festival\"\u003eSundance Film Festival\u003c/a\u003e premiere in January.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tRoadside Attractions, Lionsgate and independent studio LD Entertainment are circling domestic rights, though a deal has yet to close. It’s unclear how the trio will work together to roll out the film. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Kiss of the Spider Woman” was independently financed in the \u003ca data-id=\"https://variety.com/2025/film/news/sundance-film-sales-indie-market-efm-1236300799/\" data-type=\"link\" href=\"https://variety.com/2025/film/news/sundance-film-sales-indie-market-efm-1236300799/\"\u003ehigh $30 million range\u003c/a\u003e. Terms of the potential sale were not disclosed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThis adaptation of Manuel Puig’s novel was one of higher profile projects to debut at Sundance. Set in an Argentinian prison in 1981, the film centers on queer window dresser Luis Molina (Tonatiuh) who is serving time for having sex with a man. To escape the horrors of his imprisonment, he dreams up vivid stories about the cinematic exploits of his favorite on screen diva, an actress name Ingrid Luna (Lopez), including her role of the spider woman, who kills her pray with a kiss. Molina’s life is upended after forming an unlikely bond with his new cellmate (Diego Luna).\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tIt’s the second film version of “Kiss of the Spider Woman” following the acclaimed 1985 feature from director Héctor Babenco, which won an Oscar for William Hurt’s portrayal of Molina. John Kander and Fred Ebb’s stage version opened on Broadway in 1993 and won seven Tony Awards, including best musical and best performances by Chita Rivera, Brent Carver and Anthony Crivello.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAt the premiere, Lopez, outfitted in a sparkling, webbed-up gown, fought back tears as “Kiss of the Spider Woman” was greeted with a standing ovation. “I’ve been waiting for this moment my whole life,” she \u003ca data-id=\"https://variety.com/2025/film/news/jennifer-lopez-kiss-of-the-spider-woman-sundance-premiere-standing-ovation-1236286690/\" data-type=\"link\" href=\"https://variety.com/2025/film/news/jennifer-lopez-kiss-of-the-spider-woman-sundance-premiere-standing-ovation-1236286690/\"\u003etold the audience at Park City’s Eccles Theatre\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCondon has become a preeminent filmmaker for movie musicals, having worked on “Chicago,” “Dreamgirls,” Disney’s “Beauty and the Beast” remake and “The Greatest Showman.” He first attended Sundance with 1998’s period drama “Gods and Monsters,” starring Ian McKellen and Brendan Fraser.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I came here 27 years ago. ‘Kiss of the Spider Woman’ is a movie I started thinking about all those years ago,” Condon said at the premiere. “It’s a movie I’ve wanted to make my entire life.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn \u003ca data-id=\"https://variety.com/2025/film/reviews/kiss-of-the-spider-woman-review-jennifer-lopez-1236286799/\" data-type=\"link\" href=\"https://variety.com/2025/film/reviews/kiss-of-the-spider-woman-review-jennifer-lopez-1236286799/\"\u003e\u003cem\u003eVariety’s\u003c/em\u003e review\u003c/a\u003e, chief film critic Peter Debruge praised Lopez’s performance but declared that “it’s relative newcomer Tonatiuh who walks away with the show, finding both strength and vulnerability in a character who seems less frivolous with each passing scene.” \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-24T00:33:00Z",
  "modifiedTime": "2025-03-24T01:00:42Z"
}
