{
  "id": "29ef2540-fb4c-4bab-ae4a-c506a908396f",
  "title": "Annecy: Cartoon Network Studios’ Biggest Icons Look Back on 25 Years of Animation",
  "link": "https://www.indiewire.com/features/animation/cartoon-network-25-years-rebecca-sugar-pendleton-ward-1235132383/",
  "description": "Genndy Tartakovsky, Craig McCracken, J.G. Quintel, Rebecca Sugar, Pendleton Ward, and Adam Muto talk about their experiences with the iconic animation studio for its 25th anniversary at Annecy.",
  "author": "Sarah Shachat",
  "published": "Fri, 13 Jun 2025 22:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Animation",
    "Features",
    "Annecy Animation Festival",
    "Cartoon Network",
    "TV"
  ],
  "byline": "Rafael Motamayor",
  "length": 8489,
  "excerpt": "Genndy Tartakovsky, Craig McCracken, J.G. Quintel, Rebecca Sugar, Pendleton Ward, and Adam Muto talk about their work for CN's 25th anniversary.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "The ’90s and early ’00s were a new golden era for TV animation, a time when shows could come not from executives and board rooms, but from people with a unique creative vision. Nickelodeon exploded unto the scene with “Doug,” “Rugrats,” and “The Ren \u0026 Stimpy Show” before Cartoon Network responded a few years later with their first original cartoons starting with “Dexter’s Laboratory.”  That show helped establish Cartoon Network as an incubator of talent and ideas, an incubator that would later become a studio when Cartoon Network Studios was properly founded as a separate entity from Hanna-Barbera and Warner Bros. Animation 25 years ago. Continuing the spirit of experimentation and creatively driven projects from the early days of the network, the studio’s first show was unlike anything else at the time, a genre-bending action show with little dialogue, born out of complaints from its creator, Genndy Tartakovsky. “I had been complaining about action shows since I was a kid,” Tartakovsky told IndieWire during a candid discussion with other Cartoon Network creators Craig McCracken (“The Powerpuff Girls”), Rebecca Sugar (“Steven Universe”), Pendleton Ward (“Adventure Time”), Adam Muto “Adventure Time: Fionna and Cake”) and J.G. Quintel (“Regular Show”). “Both anime shows and also American shows would have 20 minutes of talking and then two minutes of great action. They didn’t give me enough, I wanted more. And I wanted a break from the dialogue of ‘Dexter’ and ‘Powerpuff’, so the driving factor was me wanting something different. And the result was ‘Samurai Jack.'” “It was just the spirit of Cartoon Network,” McCraken added. “I was asked what I wanted to do next after ‘Powerpuff,’ and it could be whatever I wanted. I just came up with what would be fun and different from what I had done before.”  The early days of Cartoon Network, back when the studio was just a division of Hanna-Barbera, were a boon for the animation medium. “Dexter’s Laboratory” started the careers of several animators who would go on to find success in their own shows, like “Fairly OddParents” creator Butch Hartman, and “Family Guy” creator Seth MacFarlane. For those who stayed behind at the studio, it created even more opportunities. “The more cartoons that get made, the more cartoons that get made,” McCracken said enthusiastically to smiles across the room. “If somebody else sells a show that works, Cartoon Network is going to want to make more shows with us.” “I was more competitive. It’s hard because we all nurtured and we all got better together, and if everyone starts to go elsewhere to become directors, then you have to replace them, and replenish your crew, which becomes harder. Then you become selfish, and you start going ‘No! Everybody stay down.” Tartakovsky said, to big laughs from the other animators. ‘Samurai Jack’©Cartoon Network/Courtesy Everett Collection Granted, the quick and early success of Cartoon Network was not without its problems. People would start working with the network, change the way they drew, then take the new art style and sell a show elsewhere with the CN style. “That happened, and that I didn’t like,” McCracken said. Even Cartoon Network, despite having no house style in the early days, started making shows that would look too similar to shows they had done in the past, almost establishing a formula. By 2008, Cartoon Network, despite its origins in embracing weirdness and originality, had changed strategies and decided to stay away from anything weird, as “Flapjack” creator Thurop Van Orman recalled to Buzzfeed back in 2014. Fewer shows got greenlit, and fewer still made an impact. For Craig McCracken, who had found big success and helped not only establish Cartoon Network as a house of originality, but was hugely influential in the very early days of the establishing of the studio itself (down to picking the studio’s headquarters with Tartakovsky), working in Cartoon Network development was “infuriating.”  “Nothing was getting made and everything was getting over-analyzed and talked about at meetings,” McCracken said. “I could just see this insane talent at the studio that they’re not letting do anything. They weren’t getting a chance, and there was a big wall they had to fight through. I wanted Cartridge Network to keep going, and I hated watching them fail. I felt like they were destroying this thing I helped build.” By the end of the 2000s, McCracken started working on The Cartoonstitute, essentially a spiritual successor to the “What a Cartoon!” shorts programme that birthed “Dexter’s Laboratory” a decade prior. Through that project, McCracken pushed for new, younger voices to pitch original shows, including a young J.G. Quintel, who eventually got “Regular Show” greenlit.  ‘Regular Show’©Cartoon Network/Courtesy Everett Collection “It was a very different show than what was on Cartoon Network at the time,” Quintel recalled. “My storyboards were more conversational and I can’ draw like Disney, but they made people laugh.” It was a transitional period for Cartoon Network, a time with a lot of pressure on creators to make hits, and nothing else. Pendleton Ward and Adam Muto recalled how torturous the early days of making “Adventure Time” were, despite how big the show was. Take the show’s approach to worldbuilding and serialization, which were happening at a time when serialization in cartoons was starting to become not just embraced, but encouraged. For the “Adventure Time” team, that serialization came not as a creative choice from the start, but as a response to relentless studio notes to have a “lesson of the day” in every episode. “We knew we couldn’t have Finn not remember what he learned the previous episode,” Muto said. Though there was much scrutiny in the beginning, Ward added that the network was ambivalent toward the show. “But after six or seven seasons, we started circling back around to some of the earlier ideas we had.” “It drives you crazy that you have to be terrorized for two seasons until finally successful, and then they start to let go,” Tartakovsky added. It shouldn’t be that way. By the time you guys came, everybody knew what they were doing, so there was less boldness, and that changed the dynamic. I wanted to be a bodyguard and fight for you, but I was getting beaten up, too.” ‘Adventure Time’©Cartoon Network/Courtesy Everett Collection Still, the new generation did bring back a sense of boldness, of creativity to Cartoon Network reminiscent of the earliest days, from the serialization of “Adventure Time,” the wild visuals of “Regular Show,” and the representation in “Steven Universe.” One thing that makes Cartoon Network Studios special is how much of a sense of legacy or progression there is in the history of the studio. You can trace a line from “Dexter” that goes all the way to “Steven Universe” and beyond. Not only in terms of the old guard influencing the new, but how much overlap was in animators — “Flapjack” creator Thurop Van Orman got his start as an intern on Tartakovsky’s “Powerpuff Girls” before creating his show, where both Ward worked before going on to create “Adventure Time,” then Rebecca Sugar got her start on that show before making “Steven Universe.”  That cartoon built on what came before, employing some of the serialization of “Adventure Time,” and making explicit the queerness that “Adventure Time” had to make implicit. “I had started to pitch Bubblegum and Marceline before I understood there were these walls and ceilings on how much we could actually show,” Sugar explained. “By my next thing, I was able to build on it a little bit at a time, pushing what I knew was possible to get it to the next thing.” It’s dark times for Cartoon Network, from the continuous attacks on animation across Warner Bros. Discovery to the shutting down of the Cartoon Network Studios’ Burbank building last year. Still, if there was one clear takeaway from both the 25th anniversary panel and the conversation with the creators is that new people with bold ideas will always come about; it’s up to the people in charge to give them a chance and let them do their thing. “The more successful you get, the bigger you get, and you start to get a formula,” Tartakovsky said. “But the key is to just leave them alone, leave the creators to do their thing. If it works, great. If it doesn’t, great. The secret of filmmaking is no one knows.”",
  "image": "https://www.indiewire.com/wp-content/uploads/2025/06/Featured-Image-Template-1.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003eThe ’90s and early ’00s were a new golden era for \u003ca href=\"https://www.indiewire.com/t/tv/\" id=\"auto-tag_tv\" data-tag=\"tv\"\u003eTV\u003c/a\u003e \u003ca href=\"https://www.indiewire.com/t/animation/\" id=\"auto-tag_animation\" data-tag=\"animation\"\u003eanimation\u003c/a\u003e, a time when shows could come not from executives and board rooms, but from people with a unique creative vision. Nickelodeon exploded unto the scene with “Doug,” “Rugrats,” and “The Ren \u0026amp; Stimpy Show” before \u003ca href=\"https://www.indiewire.com/t/cartoon-network/\" id=\"auto-tag_cartoon-network\" data-tag=\"cartoon-network\"\u003eCartoon Network\u003c/a\u003e responded a few years later with their first original cartoons starting with “Dexter’s Laboratory.” \u003c/p\u003e\n\n\n\n\u003cp\u003eThat show helped establish Cartoon Network as an incubator of talent and ideas, an incubator that would later become a studio when Cartoon Network Studios was properly founded as a separate entity from Hanna-Barbera and Warner Bros. Animation 25 years ago. Continuing the spirit of experimentation and creatively driven projects from the early days of the network, the studio’s first show was unlike anything else at the time, a genre-bending action show with little dialogue, born out of complaints from its creator, Genndy Tartakovsky.\n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235132392\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/general-news/adam-brody-blues-clues-audition-1235132392/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235132392\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"Adam Brody attends the 2025 Newport Beach TV Fest\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C28 50w, https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/06/2218985447.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235132418\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235132198\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/awards/consider-this/ron-howard-favorite-the-studio-scene-emmys-interview-1235132198/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235132198\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"THE STUDIO, Ron Howard, \u0026#39;The Note\u0026#39;, (Season 1, ep. 103, aired April 2, 2025). ph: ©Apple TV+ / Courtesy Everett Collection\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=74%2C40 74w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=50%2C27 50w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSTUD_G2027.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=46%2C25 46w\" sizes=\"auto, (max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235132472\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003e“I had been complaining about action shows since I was a kid,” Tartakovsky told IndieWire during a candid discussion with other Cartoon Network creators Craig McCracken (“The Powerpuff Girls”), Rebecca Sugar (“Steven Universe”), Pendleton Ward (“Adventure Time”), Adam Muto “Adventure Time: Fionna and Cake”) and J.G. Quintel (“Regular Show”). “Both anime shows and also American shows would have 20 minutes of talking and then two minutes of great action. They didn’t give me enough, I wanted more. And I wanted a break from the dialogue of ‘Dexter’ and ‘Powerpuff’, so the driving factor was me wanting something different. And the result was ‘Samurai Jack.\u0026#39;”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“It was just the spirit of Cartoon Network,” McCraken added. “I was asked what I wanted to do next after ‘Powerpuff,’ and it could be whatever I wanted. I just came up with what would be fun and different from what I had done before.” \u003c/p\u003e\n\n\n\n\u003cp\u003eThe early days of Cartoon Network, back when the studio was just a division of Hanna-Barbera, were a boon for the animation medium. “Dexter’s Laboratory” started the careers of several animators who would go on to find success in their own shows, like “Fairly OddParents” creator Butch Hartman, and “Family Guy” creator Seth MacFarlane. For those who stayed behind at the studio, it created even more opportunities. “The more cartoons that get made, the more cartoons that get made,” McCracken said enthusiastically to smiles across the room. “If somebody else sells a show that works, Cartoon Network is going to want to make more shows with us.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“I was more competitive. It’s hard because we all nurtured and we all got better together, and if everyone starts to go elsewhere to become directors, then you have to replace them, and replenish your crew, which becomes harder. Then you become selfish, and you start going ‘No! Everybody stay down.” Tartakovsky said, to big laughs from the other animators.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" height=\"815\" width=\"1024\" src=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?w=650\" alt=\"SAMURAI JACK, Samurai Jack, 2001-2004.\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg 2412w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=300,239 300w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1024,815 1024w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1536,1223 1536w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=2048,1630 2048w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=126,100 126w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=600,478 600w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=235,187 235w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1000,796 1000w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=314,250 314w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=244,194 244w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1160,923 1160w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=377,300 377w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=119,95 119w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=50,40 50w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1200,955 1200w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=46,37 46w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=283,225 283w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=565,450 565w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1131,900 1131w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=35,28 35w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=211,168 211w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=423,337 423w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=848,675 848w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=41,33 41w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=251,200 251w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=503,400 503w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1005,800 1005w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=31,25 31w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=188,150 188w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=754,600 754w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1884,1500 1884w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=150,119 150w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=110,88 110w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=285,227 285w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=302,240 302w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=320,255 320w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=603,480 603w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=640,509 640w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=800,637 800w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=965,768 965w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDSAJA_EC001.jpg?resize=1280,1019 1280w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003cfigcaption\u003e‘Samurai Jack’\u003ccite\u003e©Cartoon Network/Courtesy Everett Collection\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eGranted, the quick and early success of Cartoon Network was not without its problems. People would start working with the network, change the way they drew, then take the new art style and sell a show elsewhere with the CN style. “That happened, and that I didn’t like,” McCracken said. Even Cartoon Network, despite having no house style in the early days, started making shows that would look too similar to shows they had done in the past, almost establishing a formula.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eBy 2008, Cartoon Network, despite its origins in embracing weirdness and originality, had changed strategies and decided to stay away from anything weird, as “Flapjack” creator Thurop Van Orman recalled to \u003ca href=\"https://www.buzzfeed.com/arianelange/thurop-van-orman-flapjack-cartoons\" rel=\"nofollow\" target=\"_blank\"\u003eBuzzfeed\u003c/a\u003e back in 2014. Fewer shows got greenlit, and fewer still made an impact. For Craig McCracken, who had found big success and helped not only establish Cartoon Network as a house of originality, but was hugely influential in the very early days of the establishing of the studio itself (down to picking the studio’s headquarters with Tartakovsky), working in Cartoon Network development was “infuriating.” \u003c/p\u003e\n\n\n\n\u003cp\u003e“Nothing was getting made and everything was getting over-analyzed and talked about at meetings,” McCracken said. “I could just see this insane talent at the studio that they’re not letting do anything. They weren’t getting a chance, and there was a big wall they had to fight through. I wanted Cartridge Network to keep going, and I hated watching them fail. I felt like they were destroying this thing I helped build.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBy the end of the 2000s, McCracken started working on The Cartoonstitute, essentially a spiritual successor to the “What a Cartoon!” shorts programme that birthed “Dexter’s Laboratory” a decade prior. Through that project, McCracken pushed for new, younger voices to pitch original shows, including a young J.G. Quintel, who eventually got “Regular Show” greenlit. \n\n\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" height=\"576\" width=\"1024\" src=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?w=650\" alt=\"REGULAR SHOW, (from left): Rigby, Mordecai, (Season 6). photo: © Cartoon Network / Courtesy: Everett Collection\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg 1924w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=300,169 300w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1024,576 1024w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1536,865 1536w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=178,100 178w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=600,338 600w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=125,70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=660,370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1000,563 1000w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=444,250 444w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=244,137 244w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1160,653 1160w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=533,300 533w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=169,95 169w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=71,40 71w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=50,28 50w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1200,675 1200w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=298,168 298w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=44,25 44w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=266,150 266w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1066,600 1066w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=150,84 150w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=110,62 110w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=285,160 285w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=320,180 320w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=640,360 640w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=800,450 800w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDRESH_EC008.jpg?resize=1280,720 1280w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003cfigcaption\u003e‘Regular Show’\u003ccite\u003e©Cartoon Network/Courtesy Everett Collection\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e“It was a very different show than what was on Cartoon Network at the time,” Quintel recalled. “My storyboards were more conversational and I can’ draw like Disney, but they made people laugh.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIt was a transitional period for Cartoon Network, a time with a lot of pressure on creators to make hits, and nothing else. Pendleton Ward and Adam Muto recalled how torturous the early days of making “Adventure Time” were, despite how big the show was. Take the show’s approach to worldbuilding and serialization, which were happening at a time when serialization in cartoons was starting to become not just embraced, but encouraged. For the “Adventure Time” team, that serialization came not as a creative choice from the start, but as a response to relentless studio notes to have a “lesson of the day” in every episode. “We knew we couldn’t have Finn not remember what he learned the previous episode,” Muto said. Though there was much scrutiny in the beginning, Ward added that the network was ambivalent toward the show. “But after six or seven seasons, we started circling back around to some of the earlier ideas we had.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“It drives you crazy that you have to be terrorized for two seasons until finally successful, and then they start to let go,” Tartakovsky added. It shouldn’t be that way. By the time you guys came, everybody knew what they were doing, so there was less boldness, and that changed the dynamic. I wanted to be a bodyguard and fight for you, but I was getting beaten up, too.”\n\n\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" height=\"576\" width=\"1024\" src=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?w=650\" alt=\"ADVENTURE TIME (aka ADVENTURE TIME WITH FINN \u0026amp; JAKE), from top: Finn (the human), Jake (the dog), (Season 1), 2010-. © Cartoon Network / Courtesy: Everett Collection\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg 1920w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=300,169 300w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1024,576 1024w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1536,864 1536w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=178,100 178w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=600,338 600w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=125,70 125w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=660,370 660w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1000,563 1000w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=444,250 444w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=244,137 244w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1160,653 1160w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=533,300 533w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=169,95 169w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=71,40 71w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=50,28 50w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1200,675 1200w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=44,25 44w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=267,150 267w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1067,600 1067w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=150,84 150w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=110,62 110w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=285,160 285w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=320,180 320w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=640,360 640w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=800,450 800w, https://www.indiewire.com/wp-content/uploads/2025/06/TCDADTI_EC003.jpg?resize=1280,720 1280w\" sizes=\"auto, (max-width: 1024px) 100vw, 1024px\"/\u003e\u003cfigcaption\u003e‘Adventure Time’\u003ccite\u003e©Cartoon Network/Courtesy Everett Collection\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eStill, the new generation did bring back a sense of boldness, of creativity to Cartoon Network reminiscent of the earliest days, from the serialization of “Adventure Time,” the wild visuals of “Regular Show,” and the representation in “Steven Universe.” One thing that makes Cartoon Network Studios special is how much of a sense of legacy or progression there is in the history of the studio. You can trace a line from “Dexter” that goes all the way to “Steven Universe” and beyond. Not only in terms of the old guard influencing the new, but how much overlap was in animators — “Flapjack” creator Thurop Van Orman got his start as an intern on Tartakovsky’s “Powerpuff Girls” before creating his show, where both Ward worked before going on to create “Adventure Time,” then Rebecca Sugar got her start on that show before making “Steven Universe.” \u003c/p\u003e\n\n\n\n\u003cp\u003eThat cartoon built on what came before, employing some of the serialization of “Adventure Time,” and making explicit the queerness that “Adventure Time” had to make implicit. “I had started to pitch Bubblegum and Marceline before I understood there were these walls and ceilings on how much we could actually show,” Sugar explained. “By my next thing, I was able to build on it a little bit at a time, pushing what I knew was possible to get it to the next thing.”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s dark times for Cartoon Network, from the continuous attacks on animation across Warner Bros. Discovery to the shutting down of the Cartoon Network Studios’ Burbank building last year. Still, if there was one clear takeaway from both the 25th anniversary panel and the conversation with the creators is that new people with bold ideas will always come about; it’s up to the people in charge to give them a chance and let them do their thing.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The more successful you get, the bigger you get, and you start to get a formula,” Tartakovsky said. “But the key is to just leave them alone, leave the creators to do their thing. If it works, great. If it doesn’t, great. The secret of filmmaking is no one knows.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-13T22:00:00Z",
  "modifiedTime": "2025-06-13T22:00:00Z"
}
