{
  "id": "3663692b-8395-4adf-961f-079d66d131ae",
  "title": "Official Trailer for Psychological Thriller 'McVeigh' Starring Alfie Allen",
  "link": "https://www.firstshowing.net/2025/official-trailer-for-psychological-thriller-mcveigh-starring-alfie-allen/",
  "description": "\"A movie rooted in small-town American rage.\" Yep it definitely seems like it. Decal Releasing has unveiled an official trailer for a psychological thriller film titled McVeigh, yes indeed about the notorious domestic terrorist Timothy McVeigh. Not sure why we need this film right now? Or ever? McVeigh is directed by indie filmmaker Mike Ott, and it first premiered at the 2024 Tribeca Film Festival last year - it's next available to watch in March. A haunting psychological thriller based on one of America's most infamous figures. After the Waco siege, a chilling plan brews in the mind of army veteran Timothy McVeigh. What follows are the harrowing events leading up to the single deadliest act of domestic terrorism in U.S. history - the Oklahoma City federal building bombing in 1995. Starring Alfie Allen as Tim, Brett Gelman, Tracy Letts, Ashley Benson, and Anthony Carrigan. There was a movie just few years ago about the Unabomber titled Ted K. This looks especially unsettling but not sure that's the kind of feeling I want to have during a film nowadays. Here's the official trailer (+ poster) for Mike Ott's thriller film McVeigh, direct from YouTube: A haunting psychological thriller based on […]",
  "author": "Alex Billington",
  "published": "Wed, 12 Feb 2025 23:10:41 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2276,
  "excerpt": "\"A movie rooted in small-town American rage.\" Yep it definitely seems like it. Decal Releasing has unveiled an official trailer for a psychological thriller film titled McVeigh, yes indeed about the notorious domestic terrorist Timothy McVeigh. Not sure why we need this film right now? Or ever? McVeigh is directed by indie filmmaker Mike Ott,",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by February 12, 2025Source: YouTube \"A movie rooted in small-town American rage.\" Yep it definitely seems like it. Decal Releasing has unveiled an official trailer for a psychological thriller film titled McVeigh, yes indeed about the notorious domestic terrorist Timothy McVeigh. Not sure why we need this film right now? Or ever? McVeigh is directed by indie filmmaker Mike Ott, and it first premiered at the 2024 Tribeca Film Festival last year - it's next available to watch in March. A haunting psychological thriller based on one of America's most infamous figures. After the Waco siege, a chilling plan brews in the mind of army veteran Timothy McVeigh. What follows are the harrowing events leading up to the single deadliest act of domestic terrorism in U.S. history - the Oklahoma City federal building bombing in 1995. Starring Alfie Allen as Tim, Brett Gelman, Tracy Letts, Ashley Benson, and Anthony Carrigan. There was a movie just few years ago about the Unabomber titled Ted K. This looks especially unsettling but not sure that's the kind of feeling I want to have during a film nowadays. Here's the official trailer (+ poster) for Mike Ott's thriller film McVeigh, direct from YouTube: A haunting psychological thriller based on one of America's most infamous figures. After the Waco siege, a chilling plan brews in the mind of army veteran Timothy McVeigh (starring Alfie Allen). What follows are the harrowing real-life events of the deadliest act of domestic terrorism in American history. McVeigh is directed by American indie filmmaker Mike Ott, director of the other indie films Analog Days, Littlerock, Pearblossom Hwy, Lake Los Angeles, Actor Martinez, and California Dreams previously, plus short films and a few TV series recently. The screenplay is written by Mike Ott \u0026 Alex Gioulakis. It's produced by Miles Alva, Nicolaas Bertelsen, Ash Christian, Joe Pirro, Shaum S. Sengupta, Monte Zajice. This first premiered at the 2024 Tribeca Film Festival last year along with a few other fests. Decal Releasing debuts Ott's McVeigh film in select US theaters + on VOD starting March 21st, 2025 coming soon. Is anyone curious to watch? Find more posts in: Indies, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/McVeighFilmPostermain25bigTW1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eFebruary 12, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=2MYKHos_kTA\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/official-trailer-for-psychological-thriller-mcveigh-starring-alfie-allen/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/McVeighFilmPostermain25bigTsr1.jpg\" alt=\"McVeigh Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;A movie rooted in small-town American rage.\u0026#34;\u003c/em\u003e Yep it definitely seems like it. Decal Releasing has unveiled an official trailer for a psychological thriller film titled \u003cstrong\u003e\u003cem\u003eMcVeigh\u003c/em\u003e\u003c/strong\u003e, yes indeed about the notorious domestic terrorist Timothy McVeigh. Not sure why we need this film right now? Or ever? \u003cem\u003eMcVeigh\u003c/em\u003e is directed by indie filmmaker Mike Ott, and it first premiered at the 2024 Tribeca Film Festival last year - it\u0026#39;s next available to watch in March. A haunting psychological thriller based on one of America\u0026#39;s most infamous figures. After the Waco siege, a chilling plan brews in the mind of army veteran Timothy McVeigh. What follows are the harrowing events leading up to the single deadliest act of domestic terrorism in U.S. history - the Oklahoma City federal building bombing in 1995. Starring \u003cstrong\u003eAlfie Allen\u003c/strong\u003e as Tim, \u003cstrong\u003eBrett Gelman\u003c/strong\u003e, \u003cstrong\u003eTracy Letts\u003c/strong\u003e, \u003cstrong\u003eAshley Benson\u003c/strong\u003e, and \u003cstrong\u003eAnthony Carrigan\u003c/strong\u003e. There was a movie just few years ago about the Unabomber \u003ca href=\"https://www.firstshowing.net/2022/full-trailer-for-ted-k-film-starring-sharlto-copley-as-ted-kaczynski/\" title=\"Full Trailer for \u0026#39;Ted K\u0026#39; Film Starring Sharlto Copley as Ted Kaczynski\"\u003etitled \u003cem\u003eTed K\u003c/em\u003e\u003c/a\u003e. This looks especially unsettling but not sure that\u0026#39;s the kind of feeling I want to have during a film nowadays.\u003cspan id=\"more-727983\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the official trailer (+ poster) for Mike Ott\u0026#39;s thriller film \u003cstrong\u003e\u003cem\u003eMcVeigh\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=2MYKHos_kTA\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/McVeighFilmPostermain25big591.jpg\" alt=\"McVeigh Poster\" width=\"599\" height=\"887\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eA haunting psychological thriller based on one of America\u0026#39;s most infamous figures. After the Waco siege, a chilling plan brews in the mind of army veteran Timothy McVeigh (starring Alfie Allen). What follows are the harrowing real-life events of the deadliest act of domestic terrorism in American history.\u003c/em\u003e \u003cem\u003eMcVeigh\u003c/em\u003e is directed by American indie filmmaker \u003ca href=\"https://www.imdb.com/name/nm0653056/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eMike Ott\u003c/strong\u003e\u003c/a\u003e, director of the other indie films \u003cem\u003eAnalog Days, Littlerock, Pearblossom Hwy, Lake Los Angeles, Actor Martinez\u003c/em\u003e, and \u003cem\u003eCalifornia Dreams\u003c/em\u003e previously, plus short films and a few TV series recently. The screenplay is written by Mike Ott \u0026amp; Alex Gioulakis. It\u0026#39;s produced by Miles Alva, Nicolaas Bertelsen, Ash Christian, Joe Pirro, Shaum S. Sengupta, Monte Zajice. This first premiered at the 2024 Tribeca Film Festival last year along with a few other fests. Decal Releasing debuts Ott\u0026#39;s \u003cem\u003eMcVeigh\u003c/em\u003e film in select US theaters + on VOD starting \u003ca href=\"https://www.firstshowing.net/schedule2025/#mar\"\u003e\u003cstrong\u003eMarch 21st, 2025\u003c/strong\u003e\u003c/a\u003e coming soon. \u003cem\u003eIs anyone curious to watch?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-12T18:10:41-05:00",
  "modifiedTime": null
}
