{
  "id": "375f3626-6c52-4dfa-b376-bf3ea90b2f3f",
  "title": "‘Dead Lover’ Review: Macabre Attempt to Keep a Lost Romance Alive Is Both Entertaining and Inventive",
  "link": "https://variety.com/2025/film/reviews/dead-lover-review-1236294196/",
  "description": "When a film starts with a quote from Mary Shelley, it’s tempting to predict exactly where the story might be going. Sure enough, “Dead Lover” features the resurrection of a dead creature, and yet, writer-director Grace Glowicki keeps surprising the audience and gives much more than they expected. The characters she creates and the situations […]",
  "author": "Peter Debruge",
  "published": "Mon, 03 Feb 2025 01:00:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Reviews",
    "Dead Lover",
    "Grace Glowicki",
    "Sundance Film Festival"
  ],
  "byline": "Murtada Elfadl",
  "length": 3876,
  "excerpt": "Genre actor-director Grace Glowicki's horror comedy, about a gravedigger determined to revive a lost mate, should earn her many new fans.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "When a film starts with a quote from Mary Shelley, it’s tempting to predict exactly where the story might be going. Sure enough, “Dead Lover” features the resurrection of a dead creature, and yet, writer-director Grace Glowicki keeps surprising the audience and gives much more than they expected. The characters she creates and the situations she puts them in are bizarrely funny. The visual ingenuity in costumes, art direction and makeup proves “Dead Lover” a singular and strange vision. Premiering in Sundance’s Midnight section before going on to play Rotterdam and other festivals, the unique film should garner a small but fervent audience. Glowicki’s peculiar tale starts with the introduction of its main character, whom the filmmaker plays herself: a stinky gravedigger looking for love. She’s been around corpses for such a long time that she reeks of their smell and thus cannot find anyone who wants to be her mate. Then, at a graveside funeral, she finally meets her match (Ben Petrie), an aristocratic cad overcome with grief for losing his sister (Leah Doz). He not only can abide her smell but actually gets off on it. Before long, they become lovers who pledge eternal devotion, but then he gets shipwrecked, with only his severed finger delivered to the gravedigger as a final memento. Using the recipe for an old potion, she goes about reviving her lover from the only surviving relic. This is where the story takes another swerve. The finger proves inadequate, leaving the gravedigger lonely and unsatisfied. She needs a body, so she decides to use the body of her lover’s sister, making a nemesis of the sister’s grieving widower (Lowen Morrow) in the process. Popular on Variety On the margins of the story, there is a group of gossipy women who gather to knit and act as a comedic Greek chorus. As the gravedigger and the widower chase each other, they run into a few other eccentric characters: two lesbian nuns in lust cavorting in the woods, a lovelorn sailor and a whole town of pious weirdos determined to bring down the gravedigger for her many unholy sins. There’s such specificity in crafting all of these minor characters that they come to life even if their screen time is miniscule. “Dead Lover” revels in its macabre inventions. Shot entirely on a soundstage, it uses practical effects and visual illusion to create its ghostly world. There’s ingenuity in all creative aspects, from makeup to production design to sound and lighting. Everything is obviously artificial, but it fits the world that Glowicki constructed. That coupled with a droll script sets “Dead Lover” apart. There are only four actors in the ensemble, each of whom play multiple characters. By asking the actors to play both male and female characters, the film playfully pokes fun at gender and sexual norms. Desire is foremost on these characters’ minds. Everyone wants to sleep with someone, even if they have to re-create them from a severed finger. There’s sex and murder, plus much laughter, most of it is oddly specific to the world the filmmakers have made here. Glowicki makes for a striking vision with her tall frame and ghostlike face, using her wit and elastic facial expressions to create a memorable character. Matching her is Peterie, who emphasizes playfulness over nuanced characterization in several silly performances, which is the balance that “Dead Lover” calls for. Meanwhile, with his brooding sensuality, Morrow brilliantly sends up the prototype of the Shelley heartthrob. Only in the last stretch does “Dead Lover” lose its momentum, becoming repetitive. Until then, it proves entertaining and funny, showing off Glowicki as a singular talent. The film should find an audience with horror comedy fans, whose undying word of mouth should give the unusual film a long shelf life.",
  "image": "https://variety.com/wp-content/uploads/2025/02/Dead-Lover.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWhen a film starts with a quote from Mary Shelley, it’s tempting to predict exactly where the story might be going. Sure enough, “\u003ca href=\"https://variety.com/t/dead-lover/\" id=\"auto-tag_dead-lover\" data-tag=\"dead-lover\"\u003eDead Lover\u003c/a\u003e” features the resurrection of a dead creature, and yet, writer-director \u003ca href=\"https://variety.com/t/grace-glowicki/\" id=\"auto-tag_grace-glowicki\" data-tag=\"grace-glowicki\"\u003eGrace Glowicki\u003c/a\u003e keeps surprising the audience and gives much more than they expected. The characters she creates and the situations she puts them in are bizarrely funny. The visual ingenuity in costumes, art direction and makeup proves “Dead Lover” a singular and strange vision. Premiering in Sundance’s Midnight section before going on to play Rotterdam and other festivals, the unique film should garner a small but fervent audience.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGlowicki’s peculiar tale starts with the introduction of its main character, whom the filmmaker plays herself: a stinky gravedigger looking for love. She’s been around corpses for such a long time that she reeks of their smell and thus cannot find anyone who wants to be her mate. Then, at a graveside funeral, she finally meets her match (Ben Petrie), an aristocratic cad overcome with grief for losing his sister (Leah Doz). He not only can abide her smell but actually gets off on it. Before long, they become lovers who pledge eternal devotion, but then he gets shipwrecked, with only his severed finger delivered to the gravedigger as a final memento. Using the recipe for an old potion, she goes about reviving her lover from the only surviving relic.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tThis is where the story takes another swerve. The finger proves inadequate, leaving the gravedigger lonely and unsatisfied. She needs a body, so she decides to use the body of her lover’s sister, making a nemesis of the sister’s grieving widower (Lowen Morrow) in the process. \n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tOn the margins of the story, there is a group of gossipy women who gather to knit and act as a comedic Greek chorus. As the gravedigger and the widower chase each other, they run into a few other eccentric characters: two lesbian nuns in lust cavorting in the woods, a lovelorn sailor and a whole town of pious weirdos determined to bring down the gravedigger for her many unholy sins. There’s such specificity in crafting all of these minor characters that they come to life even if their screen time is miniscule.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Dead Lover” revels in its macabre inventions. Shot entirely on a soundstage, it uses practical effects and visual illusion to create its ghostly world. There’s ingenuity in all creative aspects, from makeup to production design to sound and lighting. Everything is obviously artificial, but it fits the world that Glowicki constructed. That coupled with a droll script sets “Dead Lover” apart.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThere are only four actors in the ensemble, each of whom play multiple characters. By asking the actors to play both male and female characters, the film playfully pokes fun at gender and sexual norms. Desire is foremost on these characters’ minds. Everyone wants to sleep with someone, even if they have to re-create them from a severed finger. There’s sex and murder, plus much laughter, most of it is oddly specific to the world the filmmakers have made here.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGlowicki makes for a striking vision with her tall frame and ghostlike face, using her wit and elastic facial expressions to create a memorable character. Matching her is Peterie, who emphasizes playfulness over nuanced characterization in several silly performances, which is the balance that “Dead Lover” calls for. Meanwhile, with his brooding sensuality, Morrow brilliantly sends up the prototype of the Shelley heartthrob.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOnly in the last stretch does “Dead Lover” lose its momentum, becoming repetitive. Until then, it proves entertaining and funny, showing off Glowicki as a singular talent. The film should find an audience with horror comedy fans, whose undying word of mouth should give the unusual film a long shelf life.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-03T01:00:00Z",
  "modifiedTime": "2025-02-03T00:44:23Z"
}
