{
  "id": "38b0af22-1745-462c-bd2a-e59e7cd7df31",
  "title": "Pro-Palestine Protesters Arrested At Gal Gadot’s ‘The Runner’ London Filming Location",
  "link": "https://deadline.com/2025/05/gal-gadot-protesters-arrested-the-runner-london-filming-1236412980/",
  "description": "Five protesters have been arrested after reportedly targeting the central London set of Gal Gadot‘s upcoming film The Runner. Metropolitan Police responded to the Westminster set on Wednesday, where three people were arrested for harassment, as well as wrongfully and unlawfully obstructing access to a workplace. Another two were arrested over previous protests. Sources tell […]",
  "author": "Glenn Garner",
  "published": "Thu, 29 May 2025 01:02:50 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Gal Gadot",
    "Israel Hamas War",
    "Palestine",
    "Protest",
    "The Runner"
  ],
  "byline": "Glenn Garner",
  "length": 1530,
  "excerpt": "Five protesters have been arrested after reportedly targeting the central London set of Gal Gadot's upcoming film 'The Runner'.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Five protesters have been arrested after reportedly targeting the central London set of Gal Gadot‘s upcoming film The Runner. Metropolitan Police responded to the Westminster set on Wednesday, where three people were arrested for harassment, as well as wrongfully and unlawfully obstructing access to a workplace. Another two were arrested over previous protests. Sources tell Deadline the protests have not impacted the production’s schedule. In a news release, police said the set was hit with demonstrations “solely because an actress involved in the production is Israeli.” Deadline has reached out to Gadot’s rep for comment. Watch on Deadline “While we absolutely acknowledge the importance of peaceful protest, we have a duty to intervene where it crosses the line into serious disruption or criminality,” said Superintendent Neil Holyoak in a statement. Directed by Kevin Macdonald from a script by Mark Gibson, Amazon MGM Studios’ The Runner stars Gadot as a high-powered attorney who must race through London, following the cryptic commands of a mysterious caller, as she fights against time to save her abducted son. Gadot, who was born in Israel and served in the IDF, has previously expressed her support for Israel, sparking pro-Palestine protests at her Hollywood Walk of Fame ceremony in March. Her and Snow White co-star Rachel Zegler‘s opposing public stances also recently plagued the release of the Disney live-action movie, to the tune of a $115 million loss.",
  "image": "https://deadline.com/wp-content/uploads/2024/11/GettyImages-1482566774-e1735550147215.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tFive protesters have been arrested after reportedly targeting the central London set of \u003ca href=\"https://deadline.com/tag/gal-gadot/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGal Gadot\u003c/a\u003e‘s upcoming film \u003cem\u003e\u003ca href=\"https://deadline.com/tag/the-runner/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Runner\u003c/a\u003e\u003c/em\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMetropolitan Police responded to the Westminster set on Wednesday, where three people were arrested for harassment, as well as wrongfully and unlawfully obstructing access to a workplace. Another two were arrested over previous protests. Sources tell Deadline the protests have not impacted the production’s schedule.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn a news release, police said the set was hit with demonstrations “solely because an actress involved in the production is Israeli.” Deadline has reached out to Gadot’s rep for comment.\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\t“While we absolutely acknowledge the importance of peaceful \u003ca href=\"https://deadline.com/tag/protest/\" id=\"auto-tag_protest\" data-tag=\"protest\"\u003eprotest\u003c/a\u003e, we have a duty to intervene where it crosses the line into serious disruption or criminality,” said Superintendent Neil Holyoak in a statement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDirected by Kevin Macdonald from a script by Mark Gibson, Amazon MGM Studios’ \u003cem\u003eThe Runner\u003c/em\u003e stars Gadot as a high-powered attorney who must race through London, following the cryptic commands of a mysterious caller, as she fights against time to save her abducted son.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tGadot, who was born in Israel and served in the IDF, has previously expressed her support for Israel, \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.latimes.com/entertainment-arts/story/2025-03-18/gal-gadot-walk-of-fame-pro-palestine-pro-israel-protesters-snow-white\"\u003esparking pro-Palestine protests\u003c/a\u003e at her Hollywood Walk of Fame ceremony in March. Her and \u003cem\u003eSnow White\u003c/em\u003e co-star \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/rachel-zegler/\"\u003eRachel Zegler\u003c/a\u003e‘s opposing public stances also recently plagued the release of the Disney live-action movie, to the tune of a \u003ca href=\"https://deadline.com/2025/03/snow-white-bombs-rachel-zegler-1236354912/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e$115 million loss\u003c/a\u003e.\u003cbr/\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-05-29T01:02:50Z",
  "modifiedTime": "2025-05-29T01:09:51Z"
}
