{
  "id": "3e4673f0-c0ab-4770-a377-4d1639cc1a8f",
  "title": "‘No Other Land’ Filmmakers Make Plea for U.S. Distribution: ‘Americans Have a Responsibility’",
  "link": "https://www.indiewire.com/news/general-news/no-other-land-filmmakers-make-plea-us-distribution-1235083872/",
  "description": "The Palestinian/Israeli collective documentary won Berlinale's Documentary Film Award following its premiere and has been shortlisted for the 97th Academy Awards, but does not have a major American distributor.",
  "author": "Harrison Richlin",
  "published": "Fri, 10 Jan 2025 00:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "General News",
    "News",
    "Documentary",
    "Film",
    "No Other Land"
  ],
  "byline": "Harrison Richlin",
  "length": 4514,
  "excerpt": "'No Other Land' filmmakers make plea for U.S. distribution, saying 'American have a responsibility' to watch and engage with what's going on.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "“It’s time to distribute ‘No Other Land.'” For anyone confused over the message being sent about Zionism in “The Brutalist,” the film‘s writer/director, Brady Corbet, made his stance clear last night while accepting the award for Best Film from the New York Film Critics Circle. After offering praise to his fellow filmmakers, including Best Director winner RaMell Ross, Jesse Eisenberg, and his “hero” Mike Leigh, Corbet closed his speech with the direct, concise plea above. Many are in agreement over this sentiment, particularly the filmmakers behind “No Other Land,” a Palestinian/Israeli collective made up of activists Hamdan Ballal, Yuval Abraham, Rachel Szor and Basel Adra. Speaking in a recent interview with Variety, Abraham and Adra detailed the difficult path they’ve found getting the film seen on a wide scale in America and how it’s become “completely political” despite their film just trying to show the reality of Israeli settlement and military occupation in the West Bank. Considering the resources and weapons the U.S. supplies the Israelis, Abraham and Adra believe its citizens have a vested interest in seeing how their money is being spent. Popular on IndieWire “I hope the movie gets nominated because it would bring more awareness,” said Adra of how an Oscar nomination might help the film. “I really advise everybody in the U.S. who has heard about ‘No Other Land’ to watch it. It’s important for people to watch it so they can understand what’s going on. And we hope people who do don’t just watch it to feel sad or sorry for us, but to join our struggle and our movement and take action. Especially in the U.S. which, as a country, is a main player in what’s going on. Americans have a responsibility, I believe, and I hope that they watch it and move in the right direction and take any action they can in order to help us change.” Though the film has international distribution in 24 countries — including the U.K. and France — no major U.S. distributor has stepped up to showcase “No Other Land.” Even so, the film will still be opening theatrically on January 31 thanks to Cinetic Media organizing bookings via Michael Tuckman Media. Though its criticism of the Israeli government and its policies are probably what have most distributors on edge, Abraham believes it’s important to be vocal and to start a dialogue, especially in a country like America where dissent is being stifled. “As an Israeli I think that’s a really good thing,” Abraham said of taking a stance, “because we need to be critical of these policies so they can change. But I think the conversation in the United States appears to be far less nuanced — there is much less space for this kind of criticism, even when it comes in the form of a film.” Abraham and Adra are glad they’ve been able to have the film seen at festivals all over the world, but most of the time, the audiences at these events are informed enough to support what the film is trying to accomplish. In not being able to have wide distribution in the U.S., the filmmakers are concerned “No Other Land” won’t have an opportunity to challenge audiences and reach people who deserve a deeper understanding of the conflict at play. “I’m not sure they are exactly the ones who attend the New York Film Festival,” said Abraham of the kind of people they’d like to get the film seen by. “But if you have a really big distributor then, of course, you get to people from varying political opinions and with varying degrees of knowledge about Israel and Palestine. And these are exactly the people to whom we want to show the film because that’s how we can prompt change.” In addition to winning the Berlinale’s Documentary Film Award following its premiere at the festival, “No Other Land” has also received Best Documentary Feature at the Gotham Awards, Best Non-Fiction Film from the New York Film Critics Circle, the Los Angeles Film Critics Association, and the National Society of Critics, as well as Best Feature Documentary, Best Director, and the Courage Under Fire Award at the IDA Awards, just to name a few of its growing list of accolades. It is also nominated at tonight’s Cinema Eye Honors in the categories of Outstanding Non-Fiction Feature, Outstanding Direction, Outstanding Debut, and Outstanding Production and will be receiving The Unforgettable Awards. “No Other Land” will be released theatrically January 31, with bookings by Cinetic Media via Michael Tuckman Media.",
  "image": "https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2188483210.jpg?w=350",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003e“It’s time to distribute ‘\u003ca href=\"https://www.indiewire.com/t/no-other-land/\" id=\"auto-tag_no-other-land\" data-tag=\"no-other-land\"\u003eNo Other Land\u003c/a\u003e.\u0026#39;”\u003c/p\u003e\n\n\n\n\u003cp\u003eFor anyone confused over the message being sent about Zionism in “The Brutalist,” the \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003efilm\u003c/a\u003e‘s writer/director, Brady Corbet, made his stance clear last night \u003ca href=\"https://x.com/nyfcc/status/1877431847044489389\" rel=\"nofollow\" target=\"_blank\"\u003ewhile accepting the award for Best Film\u003c/a\u003e from the \u003ca href=\"https://www.indiewire.com/awards/results/2024-new-york-film-critics-circle-awards-nyfcc-winners-list-1235071897/\"\u003eNew York Film Critics Circle\u003c/a\u003e. After offering praise to his fellow filmmakers, including Best Director winner RaMell Ross, Jesse Eisenberg, and his “hero” Mike Leigh, Corbet closed his speech with the direct, concise plea above.\u003c/p\u003e\n\n\n\n\u003cp\u003eMany are in agreement over this sentiment, particularly the filmmakers behind “No Other Land,” a Palestinian/Israeli collective made up of activists Hamdan Ballal, Yuval Abraham, Rachel Szor and Basel Adra. Speaking in a recent interview with \u003ca href=\"https://variety.com/2025/film/global/no-other-land-palestinian-israeli-directors-no-us-distribution-1236270651/\" target=\"_blank\"\u003eVariety\u003c/a\u003e, Abraham and Adra detailed the difficult path they’ve found getting the film seen on a wide scale in America and how it’s become “completely political” despite their film just trying to show the reality of Israeli settlement and military occupation in the West Bank. Considering the resources and weapons the U.S. supplies the Israelis, Abraham and Adra believe its citizens have a vested interest in seeing how their money is being spent.\n\n\u003c/p\u003e\n\u003cdiv data-pmc-adm-ad-id=\"1234633991\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on IndieWire\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235083819\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/general-news/sean-baker-mother-disapproved-anora-1235083819/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235083819\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"\u0026#39;Anora\u0026#39;\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=69%2C40 69w, https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/12/MikeyMadisonAnora1.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235074640\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235082918\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/awards/consider-this/the-last-showgirl-writer-kate-gersten-play-movie-interview-1235082918/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235082918\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"LOS ANGELES, CALIFORNIA - NOVEMBER 07: (L-R) Writer Kate Gersten, actresses Pamela Anderson and Brenda Song, and director Gia Coppola attend the Film Independent Special Screening of \u0026#34;The Last Showgirl\u0026#34; at The Landmark Westwood on November 07, 2024 in Los Angeles, California. (Photo by Amanda Edwards/Getty Images for Film Independent)\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2025/01/GettyImages-2183630585.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235082928\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003e“I hope the movie gets nominated because it would bring more awareness,” said Adra of how an Oscar nomination might help the film. “I really advise everybody in the U.S. who has heard about ‘No Other Land’ to watch it. It’s important for people to watch it so they can understand what’s going on. And we hope people who do don’t just watch it to feel sad or sorry for us, but to join our struggle and our movement and take action. Especially in the U.S. which, as a country, is a main player in what’s going on. Americans have a responsibility, I believe, and I hope that they watch it and move in the right direction and take any action they can in order to help us change.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThough the film has international distribution in 24 countries — including the U.K. and France — \u003ca href=\"https://www.indiewire.com/features/interviews/no-other-land-filmmakers-basel-adra-yuval-abraham-1235063416/\"\u003eno major U.S. distributor has stepped up to showcase “No Other Land.”\u003c/a\u003e Even so, the film will still be opening theatrically on January 31 thanks to Cinetic Media organizing bookings via Michael Tuckman Media. Though its criticism of the Israeli government and its policies are probably what have most distributors on edge, Abraham believes it’s important to be vocal and to start a dialogue, especially in a country like America where dissent is being stifled.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“As an Israeli I think that’s a really good thing,” Abraham said of taking a stance, “because we need to be critical of these policies so they can change. But I think the conversation in the United States appears to be far less nuanced — there is much less space for this kind of criticism, even when it comes in the form of a film.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAbraham and Adra are glad they’ve been able to have the film seen at festivals all over the world, but most of the time, the audiences at these events are informed enough to support what the film is trying to accomplish. In not being able to have wide distribution in the U.S., the filmmakers are concerned “No Other Land” won’t have an opportunity to challenge audiences and reach people who deserve a deeper understanding of the conflict at play. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I’m not sure they are exactly the ones who attend the New York Film Festival,” said Abraham of the kind of people they’d like to get the film seen by. “But if you have a really big distributor then, of course, you get to people from varying political opinions and with varying degrees of knowledge about Israel and Palestine. And these are exactly the people to whom we want to show the film because that’s how we can prompt change.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn addition to winning the Berlinale’s \u003ca href=\"https://www.indiewire.com/t/documentary/\" id=\"auto-tag_documentary\" data-tag=\"documentary\"\u003eDocumentary\u003c/a\u003e Film Award following its premiere at the festival, “No Other Land” has also received Best Documentary Feature at the Gotham Awards, Best Non-Fiction Film from the New York Film Critics Circle, the Los Angeles Film Critics Association, and the National Society of Critics, as well as Best Feature Documentary, Best Director, and the Courage Under Fire Award at the \u003ca href=\"https://www.indiewire.com/awards/industry/ida-awards-documentary-oscar-no-other-land-1235073105/\"\u003eIDA Awards\u003c/a\u003e, just to name a few of its growing list of accolades. It is also nominated at tonight’s Cinema Eye Honors in the categories of Outstanding Non-Fiction Feature, Outstanding Direction, Outstanding Debut, and Outstanding Production and will be receiving The Unforgettable Awards.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003e“No Other Land” will be released theatrically January 31, with bookings by Cinetic Media via Michael Tuckman Media.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-10T00:00:00Z",
  "modifiedTime": "2025-01-10T00:00:42Z"
}
