{
  "id": "3ebb8d76-1755-4020-ba2b-36a8567e5e4b",
  "title": "Ballerina Review: Ana de Armas Shines in Flawed but Wick-Worthy Entry",
  "link": "https://bleedingcool.com/movies/ballerina-review-ana-de-armas-shines-in-flawed-but-wick-worthy-entry/",
  "description": "Ballerina can't quite match the impossible standards of the films it shares a cinematic universe with and has a rocky first act, but once things get going, it really finds its footing.",
  "author": "Kaitlyn Booth",
  "published": "Wed, 04 Jun 2025 17:02:08 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Kaitlyn Booth",
    "Lionsgate",
    "Movies",
    "Review",
    "Ballerina"
  ],
  "byline": "Kaitlyn Booth",
  "length": 9188,
  "excerpt": "Ballerina can't elevate itself from \"pretty good\" to \"great\" the same way previous entries in the John Wick franchise have, but it's an enjoyable time at the movies with some fantastic action scenes and one badass leading lady. Director: Len Wiseman Summary: Set during the events of John Wick: Chapter 3—Parabellum, the film follows Eve […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Kaitlyn Booth, Lionsgate, Movies, Review | Tagged: BallerinaBallerina can't quite match the impossible standards of the films it shares a cinematic universe with and has a rocky first act, but once things get going, it really finds its footing.Article Summary Ballerina delivers impressive action scenes, led by Ana de Armas, despite a shaky first act. The film is set during John Wick: Chapter 3, diving deeper into the assassin world of the Ruska Roma. Ana de Armas brings grit and heart to her role, highlighting Eve's fresh and relentless approach to combat. While not reaching John Wick's heights, Ballerina carves out a solid space for future franchise spin-offs. Ballerina can't elevate itself from \"pretty good\" to \"great\" the same way previous entries in the John Wick franchise have, but it's an enjoyable time at the movies with some fantastic action scenes and one badass leading lady. Director: Len Wiseman Summary: Set during the events of John Wick: Chapter 3—Parabellum, the film follows Eve Macarro (Ana de Armas) as she begins her training in the assassin traditions of the Ruska Roma. © 2025 Lionsgate Ballerina Might Miss Greatness, But Pretty Damn Good Isn't Bad Either It was pretty apparent from the moment the first movie ended that there was something special about John Wick and it became even more apparent that it was not a one-off when the subsequent movies kept up the quality that the original brought to the table. Ever since, it has become apparent that everyone involved wanted this to become bigger than just a series of movies because the thing that makes the John Wick movies special isn't John himself, but the world around him, and that is something that can exist without Keanu Reeves. Or, at least, that is the theory. We haven't seen it play out successfully yet since the first spin-off show, The Continental, stumbled hard. Now we have the first spin-off movie, Ballerina, aiming to be the first big success story in terms of expanding this universe, as more movies and shows wait in the wings. It's unclear how much impact Ballerina's success or failure will have on these projects, but it's something everyone involved will take note of, that's for sure. And while Ballerina makes an extremely valiant effort to truly recapture everything special about the John Wick movies, it can't quite elevate itself beyond being pretty damn good. That might have something to do with the benchmark it is coming against. This isn't a movie coming in on its own terms, so you have to judge it against all four of the previous John Wick films, because they are connected. When you set the bar as high as these films have, it's hard for anyone to hit the mark, so you have to wonder if people would be kinder to Ballerina if it weren't trying to go up against some of the best action movies of the decade. Ballerina isn't trying to separate itself from the John Wick universe either, there are plenty of connections from characters to seeing scenes from the third film playing out from different POV's. It's trying to enter an established world while also adding some new elements, and that might be the first place where it really stumbles. One of the things that set the John Wick films apart was the worldbuilding and the way the movies used \"show, don't tell.\" For Ballerina, there is a lot of lore, backstory, history, and even time to cover, so the beginning of the movie is very exposition-heavy. This might be the most exposition-heavy first act this franchise has ever seen, and despite the opening action scene trying to mitigate it, it doesn't stop that first act from dragging on far too long and feeling so clunky in the process. Eve, played by Ana de Armas, is just starting off her career as an assassin, and that means a lot of training montages. There had to be other ways to show that Eve was beginning her journey without just showing her training. Both de Armas and the rest of the crew have spoken extensively about how they wanted to show, in every aspect of her character from her costume to the way she fought, that Eve was new at this and was getting her ass kicked. That is a better method of \"show, don't tell\" than watching her fail a training regime or being thrown around a mat.  A Clunky First Act Makes Way For A Much Stronger Back Half Once the movie is, more or less, done explaining itself and Eve is out on her own, things improve quite a bit. The film still requires a lot of people explaining things to Eve, and there are character moments that fall completely flat, but the breakneck pace the film sets once Eve is out on her own makes up for the sins of the first act. The fights in this movie are brutal, because Eve is getting her ass kicked, and she has to use weapons and objects you might not expect as weapons in extremely creative ways. From grenades to a flamethrower to ice skates, Ballerina makes sure to use everything to its fullest. The film is also lifted by a great performance from the leading lady. It's so clear that de Armas put everything she had into this role, and you really feel for her as the movie heads into the third act. She is getting beaten down physically and emotionally, but she keeps getting up and finds creative ways to make the people around her underestimate what she is capable of. The action scenes are a lot of fun, and the entire setup for the third act makes for some truly brutal fights. Then there is John Wick himself. Before they announced the fifth film, we guessed that Reeves would turn up in small roles in spin-off films and TV shows since he seemed kind of done with all of this, and that is what he does in Ballerina. This is Eve's movie, wholly and completely, but there is enough John, and he gets his own action scene, which shows a nice contrast between how Eve fights and how John fights. Director Len Wiseman is a good director, but it's clear he doesn't have the same eye for action as Chad Stahelski. Everything isn't as cinematic, or dynamic, or well-shot as you expect from a film in the John Wick universe. It's not bad, it's just not up to the impossible standards set up by the previous films. Stahelski only got involved later on in the production, so maybe his being there from the beginning will make a difference for any films or shows that he isn't personally directing. Ballerina can't quite match the impossible standards of the films it shares a cinematic universe with and a rocky first act, but once things get going, it really finds its footing.  There was something here that didn't quite come together both in terms of story and directing that keeps it from feeling like it can go toe to toe with the other films in this franchise, but this is the first attempt as a big-screen spin-off, so there is room to figure out how to elevate the next one. This new corner of the John Wick universe is open now and with all the time they took to explain it in this film, we can hope they decide to explore it again in another film, and maybe this one can focus more on character and elevating the entire production to the greatness it was just just missing this time around. Ballerina Review by Kaitlyn Booth 8/10 Ballerina can't elevate itself from \"pretty good\" to \"great\" the same way previous entries in the John Wick franchise have, but it's an enjoyable time at the movies with some fantastic action scenes and one badass leading lady. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.Latest by Kaitlyn Booth28 Years Later: New BTS Vignette, 4 Character Posters, And 3 HQ ImagesSony Pictures released a new 28 Years Later behind-the-scenes vignette, four new character posters, and three high-quality images.The Fantastic Four: First Steps – Tickets On Sale, TV Spot, PostersTickets for The Fantastic Four: First Steps officially went on sale today. We also got an extra-long TV spot and seven new posters.Wicked: For Good – New Poster Ahead Of The Trailer Release TonightUniversal dropped a new poster for Wicked: For Good ahead of tonight's first trailer release. The film will be released in theaters on November 21st.Jurassic World Rebirth: Filming In The Wild BTS FeaturetteUniversal released a new behind-the-scenes featurette for Jurassic World Rebirth, spotlighting how filming in the wild was so important.28 Years Later: Cillian Murphy Will Appear In The Bone Temple28 Years Later director Danny Boyle has confirmed that Cillian Murphy will appear in the next film, The Bone Temple, which will be directed by Nia DaCosta.Ballerina: Ana de Armas Shares Her Favorite Unconventional WeaponsEve has to improvise quite a bit in Ballerina, which means some unconventional weapons, and star Ana de Armas shared her favorites.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/05/BALLERINA_2025x3000_Online_1SHT_BACK_TATTOO_V5_rgb-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n\u003csection\u003e\u003carticle id=\"article\" data-post-id=\"2230914\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/bc-network/review/kaitlyn-booth/\" rel=\"category\"\u003eKaitlyn Booth\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/lionsgate/\" rel=\"category\"\u003eLionsgate\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/bc-network/review/\" rel=\"category\"\u003eReview\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/ballerina/\" rel=\"tag\"\u003eBallerina\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eBallerina can\u0026#39;t quite match the impossible standards of the films it shares a cinematic universe with and has a rocky first act, but once things get going, it really finds its footing.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eBallerina delivers impressive action scenes, led by Ana de Armas, despite a shaky first act.\u003c/li\u003e\n\u003cli\u003eThe film is set during John Wick: Chapter 3, diving deeper into the assassin world of the Ruska Roma.\u003c/li\u003e\n\u003cli\u003eAna de Armas brings grit and heart to her role, highlighting Eve\u0026#39;s fresh and relentless approach to combat.\u003c/li\u003e\n\u003cli\u003eWhile not reaching John Wick\u0026#39;s heights, Ballerina carves out a solid space for future franchise spin-offs.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/0FSwsrFpkbw?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/0FSwsrFpkbw/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/0FSwsrFpkbw?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBallerina\u003c/em\u003e can\u0026#39;t elevate itself from \u0026#34;pretty good\u0026#34; to \u0026#34;great\u0026#34; the same way previous entries in the John Wick franchise have, but it\u0026#39;s an enjoyable time at the movies with some fantastic action scenes and one badass leading lady.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDirector:\u003c/strong\u003e Len Wiseman\u003cbr/\u003e\n\u003cstrong\u003eSummary:\u003c/strong\u003e Set during the events of John Wick: Chapter 3—Parabellum, the film follows Eve Macarro (Ana de Armas) as she begins her training in the assassin traditions of the Ruska Roma.\u003c/p\u003e\n\u003cfigure id=\"attachment_2130096\" aria-describedby=\"caption-attachment-2130096\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/BALLERINA_2025x3000_Online_1SHT_BACK_TATTOO_V5_rgb.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:889/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/BALLERINA_2025x3000_Online_1SHT_BACK_TATTOO_V5_rgb.jpg\" alt=\"Ballerina Review: Ana de Armas Shines in Flawed but Wick-Worthy Entry\" width=\"600\" height=\"889\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:889/q:75/https://bleedingcool.com/wp-content/uploads/2024/12/BALLERINA_2025x3000_Online_1SHT_BACK_TATTOO_V5_rgb.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20889%22%20width%3D%22600%22%20height%3D%22889%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2130096\"\u003e© 2025 Lionsgate\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003e\u003cem\u003eBallerina\u003c/em\u003e Might Miss Greatness, But Pretty Damn Good Isn\u0026#39;t Bad Either\u003c/h2\u003e\n\u003cp\u003eIt was pretty apparent from the moment the first movie ended that there was something special about \u003cem\u003eJohn Wick\u003c/em\u003e and it became even more apparent that it was not a one-off when the subsequent movies kept up the quality that the original brought to the table. Ever since, it has become apparent that everyone involved wanted this to become bigger than just a series of movies because the thing that makes the John Wick movies special isn\u0026#39;t John himself, but the world around him, and that is something that can exist without \u003cstrong\u003eKeanu Reeves\u003c/strong\u003e. Or, at least, that is the theory. We haven\u0026#39;t seen it play out successfully yet since the first spin-off show, \u003cem\u003eThe Continental, \u003c/em\u003estumbled hard. Now we have the first spin-off movie, \u003cem\u003eBallerina\u003c/em\u003e, aiming to be the first big success story in terms of expanding this universe, as more movies and shows wait in the wings. It\u0026#39;s unclear how much impact \u003cem\u003eBallerina\u0026#39;s \u003c/em\u003esuccess or failure will have on these projects, but it\u0026#39;s something everyone involved will take note of, that\u0026#39;s for sure. And while \u003cem\u003eBallerina\u003c/em\u003e makes an extremely valiant effort to truly recapture everything special about the \u003cem\u003eJohn Wick\u003c/em\u003e movies, it can\u0026#39;t quite elevate itself beyond being pretty damn good.\u003c/p\u003e\n\u003cp\u003eThat might have something to do with the benchmark it is coming against. This isn\u0026#39;t a movie coming in on its own terms, so you have to judge it against all four of the previous John Wick films, because they are connected. When you set the bar as high as these films have, it\u0026#39;s hard for anyone to hit the mark, so you have to wonder if people would be kinder to \u003cem\u003eBallerina\u003c/em\u003e if it weren\u0026#39;t trying to go up against some of the best action movies of the decade. \u003cem\u003eBallerina\u003c/em\u003e isn\u0026#39;t trying to separate itself from the John Wick universe either, there are plenty of connections from characters to seeing scenes from the third film playing out from different POV\u0026#39;s. It\u0026#39;s trying to enter an established world while also adding some new elements, and that might be the first place where it really stumbles.\u003c/p\u003e\n\n\t\t\n\t\t\n\n\u003cp\u003e\u003cspan\u003eOne of the things that set the John Wick films apart was the worldbuilding and the way the movies used \u0026#34;show, don\u0026#39;t tell.\u0026#34; For \u003cem\u003eBallerina\u003c/em\u003e, there is a lot of lore, backstory, history, and even time to cover, so the beginning of the movie is very exposition-heavy. This might be the most exposition-heavy first act this franchise has ever seen, and despite the opening action scene trying to mitigate it, it doesn\u0026#39;t stop that first act from dragging on far too long and feeling so clunky in the process. Eve, played by \u003cstrong\u003eAna de Armas\u003c/strong\u003e, is just starting off her career as an assassin, and that means a lot of training montages. There had to be other ways to show that Eve was beginning her journey without just showing her training. \u003ca href=\"https://bleedingcool.com/movies/ballerina-ana-de-armas-on-eves-dirty-and-messy-fighting-style/\"\u003eBoth de Armas\u003c/a\u003e and the \u003ca href=\"https://www.youtube.com/watch?v=vVyyOcILgSs\"\u003erest of the crew\u003c/a\u003e have spoken extensively about how they wanted to show, in every aspect of her character from her costume to the way she fought, that Eve was new at this and was getting her ass kicked. That is a better method of \u0026#34;show, don\u0026#39;t tell\u0026#34; than watching her fail a training regime or being thrown around a mat. \u003c/span\u003e\u003c/p\u003e\n\u003ch2\u003eA Clunky First Act Makes Way For A Much Stronger Back Half\u003c/h2\u003e\n\u003cp\u003eOnce the movie is, more or less, done explaining itself and Eve is out on her own, things improve quite a bit. The film still requires a lot of people explaining things to Eve, and there are character moments that fall completely flat, but the breakneck pace the film sets once Eve is out on her own makes up for the sins of the first act. The fights in this movie are brutal, because Eve is getting her ass kicked, and she has to use weapons and objects you might not expect as weapons in extremely creative ways. From grenades to a flamethrower to ice skates, \u003cem\u003eBallerina\u003c/em\u003e makes sure to use everything to its fullest. The film is also lifted by a great performance from the leading lady. It\u0026#39;s so clear that de Armas put everything she had into this role, and you really feel for her as the movie heads into the third act. She is getting beaten down physically and emotionally, but she keeps getting up and finds creative ways to make the people around her underestimate what she is capable of.\u003c/p\u003e\n\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/79lljHgmut8?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/79lljHgmut8/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/79lljHgmut8?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThe action scenes are a lot of fun, and the entire setup for the third act makes for some truly brutal fights. Then there is John Wick himself. Before they announced the fifth film, we guessed that Reeves would turn up in small roles in spin-off films and TV shows since he seemed kind of done with all of this, and that is what he does in \u003cem\u003eBallerina\u003c/em\u003e. This is Eve\u0026#39;s movie, wholly and completely, but there is enough John, and he gets his own action scene, which shows a nice contrast between how Eve fights and how John fights. Director \u003cstrong\u003eLen Wiseman\u003c/strong\u003e is a good director, but it\u0026#39;s clear he doesn\u0026#39;t have the same eye for action as \u003cstrong\u003eChad Stahelski\u003c/strong\u003e. Everything isn\u0026#39;t as cinematic, or dynamic, or well-shot as you expect from a film in the John Wick universe. It\u0026#39;s not bad, it\u0026#39;s just not up to the impossible standards set up by the previous films. Stahelski only got involved later on in the production, so maybe his being there from the beginning will make a difference for any films or shows that he isn\u0026#39;t personally directing.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBallerina\u003c/em\u003e can\u0026#39;t quite match the impossible standards of the films it shares a cinematic universe with and a rocky first act, but once things get going, it really finds its footing.  There was something here that didn\u0026#39;t quite come together both in terms of story and directing that keeps it from feeling like it can go toe to toe with the other films in this franchise, but this is the first attempt as a big-screen spin-off, so there is room to figure out how to elevate the next one. This new corner of the John Wick universe is open now and with all the time they took to explain it in this film, we can hope they decide to explore it again in another film, and maybe this one can focus more on character and elevating the entire production to the greatness it was just just missing this time around.\u003c/p\u003e\n\u003cdiv id=\"review_box\" vocab=\"https://schema.org/\" typeof=\"Review\"\u003e\n  \u003cdiv property=\"itemReviewed\" typeof=\"Movie\"\u003e\n    \u003cp\u003e\u003cspan property=\"name\"\u003eBallerina\u003c/span\u003e\u003c/p\u003e\n    \u003chr/\u003e\n    \u003cp\u003e\u003cimg property=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:750/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/Gq3NfSsXwAAQc0C.jpeg\" alt=\"A dramatic promotional poster for \u0026#39;Ballerina,\u0026#39; featuring Ana de Armas in a dark outfit, holding a weapon emitting flames. The background is dark with fiery effects, and the title \u0026#39;Ballerina\u0026#39; is prominently displayed along with the release date.\" width=\"600\" height=\"750\"/\u003e\n    \u003c/p\u003e\n  \u003c/div\u003e\n  \u003cdiv id=\"review_data\"\u003e\n    \u003cp\u003eReview by \u003cspan property=\"name\"\u003eKaitlyn Booth\u003c/span\u003e\u003c/p\u003e\n    \u003chr/\u003e\n    \u003cp\u003e\u003cspan property=\"ratingValue\"\u003e8\u003c/span\u003e/\u003cspan property=\"bestRating\"\u003e10\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eBallerina can\u0026#39;t elevate itself from \u0026#34;pretty good\u0026#34; to \u0026#34;great\u0026#34; the same way previous entries in the John Wick franchise have, but it\u0026#39;s an enjoyable time at the movies with some fantastic action scenes and one badass leading lady.\u003c/p\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fballerina-review-ana-de-armas-shines-in-flawed-but-wick-worthy-entry%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fballerina-review-ana-de-armas-shines-in-flawed-but-wick-worthy-entry%2F\u0026amp;text=Ballerina+Review%3A+Ana+de+Armas+Shines+in+Flawed+but+Wick-Worthy+Entry\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fballerina-review-ana-de-armas-shines-in-flawed-but-wick-worthy-entry%2F\u0026amp;description=Ballerina+Review%3A+Ana+de+Armas+Shines+in+Flawed+but+Wick-Worthy+Entry\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fballerina-review-ana-de-armas-shines-in-flawed-but-wick-worthy-entry%2F\u0026amp;title=Ballerina+Review%3A+Ana+de+Armas+Shines+in+Flawed+but+Wick-Worthy+Entry\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003cdiv id=\"read_more\"\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/author/kbooth/\" rel=\"bookmark\"\u003eLatest by Kaitlyn Booth\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/28-years-later-new-bts-vignette-4-posters-and-3-hq-images/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF-10348_10341_r_2000x1333_thumbnail-350x350.jpg\" alt=\"Three characters wade through shallow water, using a rope for support. The scene conveys a sense of survival and struggle, with one individual appearing dirty and rugged, another in a wool coat, and a younger person holding a makeshift weapon.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF-10348_10341_r_2000x1333_thumbnail-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/28-years-later-new-bts-vignette-4-posters-and-3-hq-images/\"\u003e\u003ch3 rel=\"bookmark\"\u003e28 Years Later: New BTS Vignette, 4 Character Posters, And 3 HQ Images\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSony Pictures released a new 28 Years Later behind-the-scenes vignette, four new character posters, and three high-quality images.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-fantastic-four-first-steps-tickets-on-sale-tv-spot-posters/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/BMN-11897_R-350x350.jpg\" alt=\"A scene from \u0026#39;The Fantastic Four: First Steps\u0026#39; featuring two characters, Joseph Quinn as Johnny Storm and Pedro Pascal as Reed Richards, interacting in front of futuristic blue astronaut suits, emphasizing the Sci-Fi theme. The suits prominently display the number \u0026#39;4\u0026#39; symbol.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/BMN-11897_R-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-fantastic-four-first-steps-tickets-on-sale-tv-spot-posters/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Fantastic Four: First Steps – Tickets On Sale, TV Spot, Posters\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eTickets for The Fantastic Four: First Steps officially went on sale today. We also got an extra-long TV spot and seven new posters.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/wicked-for-good-new-poster-ahead-of-the-trailer-release-tonight/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/WK2_Adv1Sheet1_Cliff_RGB_1-1-350x350.jpg\" alt=\"An illustration promoting the musical \u0026#39;Wicked,\u0026#39; featuring two contrasting characters: a green-skinned witch holding a broomstick on the left side and a princess in a sparkling blue gown with a magic wand on the right. The text \u0026#39;YOU WILL BE CHANGED\u0026#39; appears above, with the title \u0026#39;WICKED FOR GOOD\u0026#39; prominently displayed at the bottom.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/WK2_Adv1Sheet1_Cliff_RGB_1-1-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/wicked-for-good-new-poster-ahead-of-the-trailer-release-tonight/\"\u003e\u003ch3 rel=\"bookmark\"\u003eWicked: For Good – New Poster Ahead Of The Trailer Release Tonight\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUniversal dropped a new poster for Wicked: For Good ahead of tonight\u0026#39;s first trailer release. The film will be released in theaters on November 21st.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-filming-in-the-wild-bts-featurette/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2583_D015_00048R-350x350.jpg\" alt=\"On the set of \u0026#39;Jurassic World Rebirth,\u0026#39; director Gareth Edwards appears engaged while surrounded by tall green grass and a crew. A camera on a crane is positioned above, capturing the action in a lush outdoor environment.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2583_D015_00048R-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/jurassic-world-rebirth-filming-in-the-wild-bts-featurette/\"\u003e\u003ch3 rel=\"bookmark\"\u003eJurassic World Rebirth: Filming In The Wild BTS Featurette\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eUniversal released a new behind-the-scenes featurette for Jurassic World Rebirth, spotlighting how filming in the wild was so important.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/28-years-later-cillian-murphy-will-appear-in-the-bone-temple/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/05/shutterstock_2427239293-350x350.jpg\" alt=\"28 Years Later: Sony Chairman Confirms Cillain Murphy\u0026#39;s Return\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/05/shutterstock_2427239293-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/28-years-later-cillian-murphy-will-appear-in-the-bone-temple/\"\u003e\u003ch3 rel=\"bookmark\"\u003e28 Years Later: Cillian Murphy Will Appear In The Bone Temple\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e28 Years Later director Danny Boyle has confirmed that Cillian Murphy will appear in the next film, The Bone Temple, which will be directed by Nia DaCosta.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/ballerina-ana-de-armas-shares-her-favorite-unconventional-weapons/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/12/BOLERO_Unit_221122_00428RC8_Crop2_rgb-350x350.jpg\" alt=\"Ballerina: Ana de Armas Shares Her Favorite Unconventional Weapons\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2024/12/BOLERO_Unit_221122_00428RC8_Crop2_rgb-350x350.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/ballerina-ana-de-armas-shares-her-favorite-unconventional-weapons/\"\u003e\u003ch3 rel=\"bookmark\"\u003eBallerina: Ana de Armas Shares Her Favorite Unconventional Weapons\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEve has to improvise quite a bit in Ballerina, which means some unconventional weapons, and star Ana de Armas shared her favorites.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-06-04T17:02:08-05:00",
  "modifiedTime": "2025-06-04T17:02:08-05:00"
}
