{
  "id": "441c5bf7-8362-444c-9739-0921cdddcc74",
  "title": "28 Years Later's Bonkers Ending Is Going To Leave Audiences Divided",
  "link": "https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/",
  "description": "28 Years Later is excellent...until the final scene gets in the way. Would the film have been better off without this moment?",
  "author": "Chris Evangelista",
  "published": "Thu, 19 Jun 2025 22:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Movie News",
    "Horror Movies"
  ],
  "byline": "Chris Evangelista",
  "length": 5777,
  "excerpt": "28 Years Later is excellent...until the final scene gets in the way. Would the film have been better off without this moment?",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Sony Pictures Releasing Major spoilers for \"28 Years Later\" follow. There's one key bit of information you need to know before you watch \"28 Years Later\": it's not a complete story. Okay, sure, the film does have it's own narrative arc, but this is meant to be the first of a whole new trilogy of films. The second, titled \"28 Years Later: The Bone Temple,\" is already shot and due out next year. But if you didn't know that, you might watch the ending of \"28 Years Later\" and be utterly perplexed. I'm almost positive some members of my press screening audience were oblivious to this information, as I heard many of them grumbling and voicing confusion after the film's big climactic moment. This is pretty frustrating overall, because as I said in my review, \"28 Years Later\" is pretty damn great. In fact, everything up until the ending works and works exceptionally well. And then, director Danny Boyle and writer Alex Garland tack on an utterly wacky final moment meant to set up the next movie. The tone of this scene doesn't match the rest of the movie at all, and it feels like we've accidentally started watching a completely different film.  In short, it does not work, and it's bound to confuse some people.  The 28 Years Later prologue sets up the film's weird ending, and the next movie to come Sony Pictures Releasing To be fair, the \"28 Years Later\" ending isn't completely out of left field. The seeds for the finale (and what comes next) are planted in the movie's very disturbing prologue. This moment jumps back to the beginning of the outbreak of the Rage virus we saw in the first film. We see a group of kids somewhere in the Scottish Highlands watching \"Teletubbies\" on TV in a house. Suddenly, chaos erupts as infected people burst in. The parents of the kids are quickly dispatched, as are the kids themselves. But one of them, a lad named Jimmy, escapes. He runs to a nearby church where he encounters his father, a priest. Rather than be afraid of the infected, this man of God sees the event as a holy, divine moment. He gives young Jimmy a cross and then allows a horde of infected ghouls to attack him. Jimmy watches in horror as his father changes into a monster. It's scary stuff! And then the film jumps forward ... 28 years later. After this intro, \"28 Years Later\" zeroes in on completely different characters. Our main focus is Spike (Alfie Williams), a 12-year-old who lives on a secluded island with his father Jamie (Aaron Taylor-Johnson) and his mother Isla (Jodie Comer). Great Britain has effectively been quarantined from the rest of the world, trapping the hordes of infected people (and those who aren't infected) inside, and Spike and his family live in peace, secluded from the mainland and its infected ghouls.  Jimmy returns in the final moments of 28 Years Later Sony Pictures Releasing Throughout the film, we get a reminder about Jimmy via some graffiti scrawled on a wall and his name carved into the chest of an infected person (confusingly enough, Cillian Murphy's character in the first film, \"28 Days Later,\" is also named Jim, but these are clearly not meant to be the same person). The implication is that Jimmy is out there, somewhere.  Isla is suffering from a mysterious illness, and Spike decides to take her on a dangerous journey through the infected mainland to find a doctor (Ralph Fiennes) to help cure her. Along the way, Spike and Isla rescue a baby birthed by an infected woman (the baby appears uninfected). Eventually, they find the doctor, who sadly tells them that Isla has cancer and she'll die soon — and she does, peacefully. After Isla's death, Spike drops the baby off back at his island community but opts to head out into the mainland on his own and explore. Boyle and Garland should have ended the film here. Instead, there's a truly wacky scene where Spike is rescued from a horde of infected by a gang of goofballs wearing brightly colored tracksuits (the colors of their clothes reflect the colors of the Teletubbies). This group does a bunch of backflips and parkour moves and kills the group of infected, and then the leader of the gang (played by \"Sinners\" vampire Jack O'Connell) introduces himself to Spike: his name is Jimmy! You know, like the kid at the beginning of the movie! Roll credits. O'Connell is clearly having fun in his brief scene, but his character feels so strange — and his strange attire, which seems to be a direct reference to notorious English TV personality Jimmy Savile, sticks out like a sore thumb. Will this make sense in the next movie? Probably. But here, it feels completely out of place and it hurts an otherwise strong film. It's another example of modern movies not understanding that they can tell one complete story without setting up a whole franchise. I'm interested to see where the story goes from here (it seems clear that even though Jimmy and his gang helped Spike, he's probably bad news), but \"28 Years Later\" did not need to end like this.",
  "image": "https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/l-intro-1750263989.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided\" data-slide-num=\"0\" data-post-id=\"1889785\"\u003e\n                                             \u003cpicture id=\"p3720b9da2483eeddad2e7345f5552426\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/intro-1750263989.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/intro-1750263989.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/intro-1750263989.jpg\" data-slide-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-id=\"1889785\" data-slide-num=\"0\" data-slide-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided: \" width=\"780\" height=\"438\" alt=\"Dr. Ian Kelson standing behind Isla in 28 Years Later\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures Releasing\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003e\u003cstrong\u003e\u003cem\u003eMajor spoilers for \u0026#34;28 Years Later\u0026#34; follow.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThere\u0026#39;s one key bit of information you need to know before you watch \u0026#34;28 Years Later\u0026#34;: it\u0026#39;s not a complete story. Okay, sure, the film does have it\u0026#39;s own narrative arc, but this is meant to be the first of a whole new trilogy of films. \u003ca href=\"https://www.slashfilm.com/1559695/28-years-later-horror-sequel-candyman-marvel-director-nia-dacosta/\" target=\"_blank\"\u003eThe second, titled \u0026#34;28 Years Later: The Bone Temple,\u0026#34; is already shot and due out next year\u003c/a\u003e. But if you didn\u0026#39;t know that, you might watch the ending of \u0026#34;28 Years Later\u0026#34; and be utterly perplexed. I\u0026#39;m almost positive some members of my press screening audience were oblivious to this information, as I heard many of them grumbling and voicing confusion after the film\u0026#39;s big climactic moment.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eThis is pretty frustrating overall, because as I said in my review, \u0026#34;28 Years Later\u0026#34; is pretty damn great. In fact, everything up until the ending works and works exceptionally well. And then, director Danny Boyle and writer Alex Garland tack on an utterly wacky final moment meant to set up the next movie. The tone of this scene doesn\u0026#39;t match the rest of the movie at all, and it feels like we\u0026#39;ve accidentally started watching a completely different film. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIn short, it does not work, and it\u0026#39;s bound to confuse some people. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eThe 28 Years Later prologue sets up the film\u0026#39;s weird ending, and the next movie to come\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided\" data-slide-num=\"1\" data-post-id=\"1889785\"\u003e\n                                             \u003cpicture id=\"p8cbe5b041e59537ce23539e280ddb16c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/the-28-years-later-prologue-sets-up-the-films-weird-ending-and-the-next-movie-to-come-1750263990.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/the-28-years-later-prologue-sets-up-the-films-weird-ending-and-the-next-movie-to-come-1750263990.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/the-28-years-later-prologue-sets-up-the-films-weird-ending-and-the-next-movie-to-come-1750263990.jpg\" data-slide-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-id=\"1889785\" data-slide-num=\"1\" data-slide-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided: The 28 Years Later prologue sets up the film\u0026#39;s weird ending, and the next movie to come\" width=\"780\" height=\"438\" alt=\"Blood splatters on a TV showing the Teletubbies\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures Releasing\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eTo be fair, the \u0026#34;28 Years Later\u0026#34; ending isn\u0026#39;t completely out of left field. The seeds for the finale (and what comes next) are planted in the movie\u0026#39;s very disturbing prologue. This moment jumps back to the beginning of the outbreak of the Rage virus we saw in the first film. We see a group of kids somewhere in the Scottish Highlands watching \u0026#34;Teletubbies\u0026#34; on TV in a house.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eSuddenly, chaos erupts as infected people burst in. The parents of the kids are quickly dispatched, as are the kids themselves. But one of them, a lad named Jimmy, escapes. He runs to a nearby church where he encounters his father, a priest. Rather than be afraid of the infected, this man of God sees the event as a holy, divine moment. He gives young Jimmy a cross and then allows a horde of infected ghouls to attack him. Jimmy watches in horror as his father changes into a monster. It\u0026#39;s scary stuff! And then the film jumps forward ... 28 years later.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAfter this intro, \u0026#34;28 Years Later\u0026#34; zeroes in on completely different characters. Our main focus is Spike (Alfie Williams), a 12-year-old who lives on a secluded island with his father Jamie (Aaron Taylor-Johnson) and his mother Isla (Jodie Comer). Great Britain has effectively been quarantined from the rest of the world, trapping the hordes of infected people (and those who aren\u0026#39;t infected) inside, and Spike and his family live in peace, secluded from the mainland and its infected ghouls. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eJimmy returns in the final moments of 28 Years Later\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided\" data-slide-num=\"2\" data-post-id=\"1889785\"\u003e\n                                             \u003cpicture id=\"pe796d40ae47747d75b558f3d1de5a0a5\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/jimmy-returns-in-the-final-moments-of-28-years-later-1750263990.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/jimmy-returns-in-the-final-moments-of-28-years-later-1750263990.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/28-years-laters-bonkers-ending-is-going-to-leave-audiences-baffled/jimmy-returns-in-the-final-moments-of-28-years-later-1750263990.jpg\" data-slide-url=\"https://www.slashfilm.com/1889785/28-years-later-ending-audiences-divided/\" data-post-id=\"1889785\" data-slide-num=\"2\" data-slide-title=\"28 Years Later\u0026#39;s Bonkers Ending Is Going To Leave Audiences Divided: Jimmy returns in the final moments of 28 Years Later\" width=\"780\" height=\"438\" alt=\"A skinny infected man in 28 Years Later\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures Releasing\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThroughout the film, we get a reminder about Jimmy via some graffiti scrawled on a wall and his name carved into the chest of an infected person (confusingly enough, Cillian Murphy\u0026#39;s character in the first film, \u0026#34;28 Days Later,\u0026#34; is \u003cem\u003ealso\u003c/em\u003e named Jim, but these are clearly not meant to be the same person). The implication is that Jimmy is out there, somewhere. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIsla is suffering from a mysterious illness, and Spike decides to take her on a dangerous journey through the infected mainland to find a doctor (Ralph Fiennes) to help cure her. Along the way, Spike and Isla rescue a baby birthed by an infected woman (the baby appears uninfected). Eventually, they find the doctor, who sadly tells them that Isla has cancer and she\u0026#39;ll die soon — and she does, peacefully.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eAfter Isla\u0026#39;s death, Spike drops the baby off back at his island community but opts to head out into the mainland on his own and explore. Boyle and Garland \u003cem\u003eshould\u003c/em\u003e have ended the film here. Instead, there\u0026#39;s a truly wacky scene where Spike is rescued from a horde of infected by a gang of goofballs wearing brightly colored tracksuits (the colors of their clothes reflect the colors of the Teletubbies). This group does a bunch of backflips and parkour moves and kills the group of infected, and then the leader of the gang (\u003ca href=\"https://www.slashfilm.com/1837151/who-plays-sinners-main-villain-remmick-jack-oconnell/\" target=\"_blank\"\u003eplayed by \u0026#34;Sinners\u0026#34; vampire Jack O\u0026#39;Connell\u003c/a\u003e) introduces himself to Spike: his name is Jimmy! You know, like the kid at the beginning of the movie! Roll credits.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eO\u0026#39;Connell is clearly having fun in his brief scene, but his character feels \u003cem\u003eso\u003c/em\u003e strange — and his strange attire, which seems to be a direct reference to notorious English TV personality Jimmy Savile, sticks out like a sore thumb. Will this make sense in the next movie? Probably. But here, it feels completely out of place and it hurts an otherwise strong film. It\u0026#39;s another example of modern movies not understanding that they can tell \u003cem\u003eone\u003c/em\u003e complete story without setting up a whole franchise. I\u0026#39;m interested to see where the story goes from here (it seems clear that even though Jimmy and his gang helped Spike, he\u0026#39;s \u003cem\u003eprobably\u003c/em\u003e bad news), but \u0026#34;28 Years Later\u0026#34; did not need to end like this.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-19T22:00:00Z",
  "modifiedTime": "2025-06-19T22:00:00Z"
}
