{
  "id": "46d6ac15-aa92-48a1-a55d-88720efaf3ed",
  "title": "Official Trailer for Extra Strange Coming-of-Age, Sex Comedy 'Hippo'",
  "link": "https://www.firstshowing.net/2024/official-trailer-for-extra-strange-coming-of-age-sex-comedy-hippo/",
  "description": "\"Let us bear humble witness.\" Kinematics has debuted a trailer for a weird little indie film called Hippo, a kooky creation from filmmaker Mark H. Rapaport as his feature debut. It premiered at last year's Fantasia Film Festival and it also played at the Calgary Underground Film Festival earlier this year. Hippo, a peculiar adolescent, and his Hungarian step-sister Buttercup struggle to come of age in late 90s America, under the roof of a mother who has been institutionalized at least once. Reviews describe the film as \"an avant-garde sex comedy that unleashes the quirks of Wes Anderson and Jim Jarmusch to their weirdest extents.\" Huh. Adding that it also \"doesn't hold back in exploring taboo subjects... yet offering riotous laughter through the characters' absurdity.\" The indie film stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts. This definitely won't be for everyone, but adventurous cinema nerds should check it out anyway. Here's the two official trailers (+ poster) for Mark H. Rapaport's film Hippo, direct from YouTube: Examines the coming-of-age of two step-siblings: Hippo, a video-game addicted teenager and Buttercup, a Hungarian Catholic immigrant with a love of classical music \u0026 Jesus. Like the Ancient Greek Aphrodite, Buttercup's […]",
  "author": "Alex Billington",
  "published": "Thu, 17 Oct 2024 20:18:16 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Indies",
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2059,
  "excerpt": "\"Let us bear humble witness.\" Kinematics has debuted a trailer for a weird little indie film called Hippo, a kooky creation from filmmaker Mark H. Rapaport as his feature debut. It premiered at last year's Fantasia Film Festival and it also played at the Calgary Underground Film Festival earlier this year. Hippo, a peculiar adolescent,",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by October 17, 2024Source: YouTube \"Let us bear humble witness.\" Kinematics has debuted a trailer for a weird little indie film called Hippo, a kooky creation from filmmaker Mark H. Rapaport as his feature debut. It premiered at last year's Fantasia Film Festival and it also played at the Calgary Underground Film Festival earlier this year. Hippo, a peculiar adolescent, and his Hungarian step-sister Buttercup struggle to come of age in late 90s America, under the roof of a mother who has been institutionalized at least once. Reviews describe the film as \"an avant-garde sex comedy that unleashes the quirks of Wes Anderson and Jim Jarmusch to their weirdest extents.\" Huh. Adding that it also \"doesn't hold back in exploring taboo subjects... yet offering riotous laughter through the characters' absurdity.\" The indie film stars Kimball Farley, Lilla Kizlinger, Eliza Roberts, and Eric Roberts. This definitely won't be for everyone, but adventurous cinema nerds should check it out anyway. Here's the two official trailers (+ poster) for Mark H. Rapaport's film Hippo, direct from YouTube: Examines the coming-of-age of two step-siblings: Hippo, a video-game addicted teenager and Buttercup, a Hungarian Catholic immigrant with a love of classical music \u0026 Jesus. Like the Ancient Greek Aphrodite, Buttercup's love is unrequited by a brother who prefers to indulge the art of war and chaos. The result is a hormone-fueled, tragicomic waking nightmare that must be seen to be believed. Hippo is directed by indie filmmaker Mark H. Rapaport, making his featrue directorial debut after a few shorts; he also founded the company Kinematics. The script is by Mark H. Rapaport \u0026 Kimball Farley. Produced by Anthony Argento, Siyu Lin, and Mark H. Rapaport. The film premiered at the 2023 Fantasia Film Festival last year. Rapaport's Hippo film will debut in select US theaters starting on November 12th, 2024 this fall. Is anyone curious? Find more posts: Indies, To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/HippoPostermainimagebigTW01.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\n\t\t\n\t\t\u003cdiv\u003e\n\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eOctober 17, 2024\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=fwRAVSXWk04\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2024/official-trailer-for-extra-strange-coming-of-age-sex-comedy-hippo/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/HippoPostermainimagebigTsr01.jpg\" alt=\"Hippo Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;Let us bear humble witness.\u0026#34;\u003c/em\u003e Kinematics has debuted a trailer for a weird little indie film called \u003cstrong\u003e\u003cem\u003eHippo\u003c/em\u003e\u003c/strong\u003e, a kooky creation from filmmaker Mark H. Rapaport as his feature debut. It premiered at last year\u0026#39;s Fantasia Film Festival and it also played at the Calgary Underground Film Festival earlier this year. Hippo, a peculiar adolescent, and his Hungarian step-sister Buttercup struggle to come of age in late 90s America, under the roof of a mother who has been institutionalized at least once. Reviews \u003ca href=\"https://movieweb.com/hippo-review-fantasia/\" rel=\"noopener nofollow\" target=\"_blank\"\u003edescribe\u003c/a\u003e the film as \u0026#34;an avant-garde sex comedy that unleashes the quirks of Wes Anderson and Jim Jarmusch to their weirdest extents.\u0026#34; Huh. Adding that it also \u0026#34;doesn\u0026#39;t hold back in exploring taboo subjects... yet offering riotous laughter through the characters\u0026#39; absurdity.\u0026#34; The indie film stars \u003cstrong\u003eKimball Farley\u003c/strong\u003e, \u003cstrong\u003eLilla Kizlinger\u003c/strong\u003e, \u003cstrong\u003eEliza Roberts\u003c/strong\u003e, and \u003cstrong\u003eEric Roberts\u003c/strong\u003e. This definitely won\u0026#39;t be for everyone, but adventurous cinema nerds should check it out anyway.\u003cspan id=\"more-714861\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the two official trailers (+ poster) for Mark H. Rapaport\u0026#39;s film \u003cstrong\u003e\u003cem\u003eHippo\u003c/em\u003e\u003c/strong\u003e, direct from \u003ca href=\"https://www.youtube.com/watch?v=fwRAVSXWk04\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/HippoPostermainimagebig59901.jpg?width=599\" alt=\"Hippo Poster\" width=\"599\" height=\"856\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eExamines the coming-of-age of two step-siblings: Hippo, a video-game addicted teenager and Buttercup, a Hungarian Catholic immigrant with a love of classical music \u0026amp; Jesus. Like the Ancient Greek Aphrodite, Buttercup\u0026#39;s love is unrequited by a brother who prefers to indulge the art of war and chaos. The result is a hormone-fueled, tragicomic waking nightmare that must be seen to be believed.\u003c/em\u003e \u003cem\u003eHippo\u003c/em\u003e is directed by indie filmmaker \u003ca href=\"https://www.imdb.com/name/nm5546430/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eMark H. Rapaport\u003c/strong\u003e\u003c/a\u003e, making his featrue directorial debut after a few shorts; he also founded the company Kinematics. The script is by Mark H. Rapaport \u0026amp; Kimball Farley. Produced by Anthony Argento, Siyu Lin, and Mark H. Rapaport. The film premiered at the 2023 Fantasia Film Festival last year. Rapaport\u0026#39;s \u003cem\u003eHippo\u003c/em\u003e film will debut in select US theaters starting on \u003ca href=\"https://www.firstshowing.net/schedule2024/#nov\"\u003e\u003cstrong\u003eNovember 12th, 2024\u003c/strong\u003e\u003c/a\u003e this fall. \u003cem\u003eIs anyone curious?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\n\t\n\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e\n      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-17T16:18:16-04:00",
  "modifiedTime": null
}
