{
  "id": "4b2fb01e-eaed-40ef-92b3-ac2de816acd3",
  "title": "Variety Announces FYC Fest: The Shortlist Lineup",
  "link": "https://variety.com/2025/biz/news/variety-fyc-fest-the-shortlist-lineup-1236264397/",
  "description": "Variety’s fourth annual FYC Fest: The Shortlist will return on Thursday, Jan. 9 featuring conversations with the top contending filmmakers and artisans that were shortlisted by the Academy in the categories of original song, score, visual effects, international feature film, live action short film and more. This year’s program includes seven conversations: Each conversation will […]",
  "author": "Wcinkala",
  "published": "Thu, 02 Jan 2025 23:40:44 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Variety FYC Fest"
  ],
  "byline": "William Earl",
  "length": 1909,
  "excerpt": "Variety’s FYC Fest: The Shortlist will return on Jan. 9, featuring conversations with the top contenders shortlisted by the Academy.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Variety’s fourth annual FYC Fest: The Shortlist will return on Thursday, Jan. 9 featuring conversations with the top contending filmmakers and artisans that were shortlisted by the Academy in the categories of original song, score, visual effects, international feature film, live action short film and more. This year’s program includes seven conversations: A “Gladiator II” Visual Effects panel featuring Mark Bakowski, visual effects supervisor; Pietro Ponti, ILM visual effects supervisor; Nikki Penny, VFX producer; and Neil Corbould, special effects supervisor A “Blitz” sound panel featuring James Harrison, supervising sound editor and re-recording mixer; Paul Cotterell, supervising sound editor and re-recording mixer; and John Casali, production sound mixer A “Vermiglio” international feature film conversation with Maura Delpero, director and producer A “Gladiator II” original score conversation with Harry Gregson-Williams, composer A “How to Make Millions Before Grandma Dies” international feature film conversation with Pat Boonnitipat, director A “Blitz” original song panel featuring Steve McQueen, writer, director, producer, songwriter; Nicholas Britell, songwriter; and Taura Stinson, songwriter A “Room Taken” live action short film panel TJ O’Grady-Peyton, director; Colmán Mac Cionnaith, producer; Gabriel Adewusi, lead actor; and Bríd Brennan, lead actor Each conversation will be moderated by a Variety editor. Conversations will begin at 9:30am PT on Jan. 9. Registration is free but required for access. Register today at variety.com/theshortlist. Conversations will be posted on Variety.com following the virtual event. Last year, featured participants included creators and artisans from “Killers of the Flower Moon,” “Saltburn,” “To Kill a Tiger,” “American Fiction,” “Last Song From Kabul,” and more. Popular on Variety",
  "image": "https://variety.com/wp-content/uploads/2025/01/FYC_FEST_THE_SHORTLIST_2025_EDITORIAL_ANNOUNCEMENT.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003cem\u003eVariety’s\u003c/em\u003e fourth annual FYC Fest: The Shortlist will return on Thursday, Jan. 9 featuring conversations with the top contending filmmakers and artisans that were shortlisted by the Academy in the categories of original song, score, visual effects, international feature film, live action short film and more.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThis year’s program includes seven conversations:\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\u003cul\u003e\n\u003cli\u003eA “Gladiator II” Visual Effects panel featuring Mark Bakowski, visual effects supervisor; Pietro Ponti, ILM visual effects supervisor; Nikki Penny, VFX producer; and Neil Corbould, special effects supervisor\u003c/li\u003e\n\n\n\n\u003cli\u003eA “Blitz” sound panel featuring James Harrison, supervising sound editor and re-recording mixer; Paul Cotterell, supervising sound editor and re-recording mixer; and John Casali, production sound mixer\u003c/li\u003e\n\n\n\n\u003cli\u003eA “Vermiglio” international feature film conversation with Maura Delpero, director and producer\u003c/li\u003e\n\n\n\n\u003cli\u003eA “Gladiator II” original score conversation with Harry Gregson-Williams, composer\u003c/li\u003e\n\n\n\n\u003cli\u003eA “How to Make Millions Before Grandma Dies” international feature film conversation with Pat Boonnitipat, director\u003c/li\u003e\n\n\n\n\u003cli\u003eA “Blitz” original song panel featuring Steve McQueen, writer, director, producer, songwriter; Nicholas Britell, songwriter; and Taura Stinson, songwriter\u003c/li\u003e\n\n\n\n\u003cli\u003eA “Room Taken” live action short film panel TJ O’Grady-Peyton, director; Colmán Mac Cionnaith, producer; Gabriel Adewusi, lead actor; and Bríd Brennan, lead actor\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tEach conversation will be moderated by a \u003cem\u003eVariety \u003c/em\u003eeditor. Conversations will begin at 9:30am PT on Jan. 9. Registration is free but required for access. Register today at variety.com/theshortlist. Conversations will be posted on Variety.com following the virtual event.\n\n\n\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tLast year, featured participants included creators and artisans from “Killers of the Flower Moon,” “Saltburn,” “To Kill a Tiger,” “American Fiction,” “Last Song From Kabul,” and more.\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-02T23:40:44Z",
  "modifiedTime": "2025-01-03T00:09:46Z"
}
