{
  "id": "5574d1ac-861e-44a2-9327-e9dc3dc1c033",
  "title": "Who Is Judith's Biological Father On The Walking Dead?",
  "link": "https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/",
  "description": "Judith Grimes is accepted by Rick Grimes as his daughter in The Walking Dead, but who is her biological father: Rick or Shane?",
  "author": "Michael Boyle",
  "published": "Tue, 06 May 2025 00:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows",
    "Horror Shows"
  ],
  "byline": "Michael Boyle",
  "length": 5669,
  "excerpt": "Judith Grimes is accepted by Rick Grimes as his daughter in The Walking Dead, but who is her biological father: Rick or Shane?",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "AMC Of all the characters to survive the entirety of \"The Walking Dead,\" Judith Grimes is the most surprising. Conceived sometime in season 1, fetus-Judith's hope of survival throughout season 2 relies entirely on her mother Lori (Sarah Wayne Callies) not dying from sheer clumsiness. There are plenty of close calls: at one point pregnant Lori steals a car without telling anyone, forgets to pay attention to the road while driving, and ends up flipping the car over in the middle of the night, with walkers nearby heading towards the noise. Some people just aren't meant to live in such difficult times.  Advertisement Luckily for Judith, Lori somehow lives long enough to give birth to her amidst a walker ambush at the prison in season 3. Baby Judith is then carried from place to place for the next five seasons by various people, including a child psychopath who nearly suffocates her to death in season 4. Although the people around baby Judith keep dropping like flies, she stays strong through it all. Then in season 9, after a surprise time jump, Judith is old enough to be a proper character with lines and a personality. Played by Cailey Fleming, 10-year-old Judith has all the toughness and courage that her father Rick was known for.  There's just one problem: is Rick Judith's father? Or could Judith's real father be that dastardly Shane Walsh (Jon Bernthal), who had a fling with Lori for a few weeks before she figured out she was pregnant? Mathematically it seems like Shane's the more likely parent, but fans can certainly make the case for Rick... Advertisement Realistically, Judith's father is probably Shane AMC The case for Shane being Judith's father is simple: Rick spent several weeks at the hospital in a coma. During those weeks the apocalypse happened, and at some point Lori and Shane started hooking up. The exact timeline is intentionally left fuzzy by the show, but the scenes we do get of Lori and Shane in the early episodes imply that they've been having unprotected sex on a regular basis.  Advertisement After Rick and Lori reunite, they have sex at least once before Lori finds out she's pregnant, but they quickly start having marital troubles as Rick finds out everything that's happened. To put it simply: there were many more opportunities for Shane to impregnate Lori than for Rick, although it is technically possible that it was Rick who did the deed.  Because DNA tests are hard to find in the apocalypse, both Lori and Rick seem content to just assume Rick's the father and not really dwell on it. Shane, however, fully believes the baby is his, and his possessiveness towards Lori and her unborn child is a big part of what turns him increasingly vindictive and unstable throughout \"The Walking Dead\" season 2. If Rick hadn't killed him in \"Better Angels,\" it's clear that Shane would've kept thinking of the baby as his own, and would've kept feuding with Rick because of this.  Advertisement After the time jump, fans were observing Judith closely for any signs of Shane-esque behavior. All she needed to do was rub the back of her head and the jig would be up, but instead she act more like how you'd expect the daughter of Rick Grimes to behave. Physically, she doesn't seem to share many similarities with either father. (Honestly, she doesn't even look much like Lori either.) It seems that when it comes to the question of Judith's biological father, the answer is entirely up to fans to decide.  But who does Rick think the father is? AMC A notable piece of evidence in the \"Shane's the father\" camp, and one I think fans put too much stock in, is a season 7 scene where Rick straight up says, \"I know Judith isn't mine. I know it. I love her, she's my daughter but she isn't mine. I had to accept that.\" Advertisement Some fans take this as confirmation of Judith's parenthood, but others interpret it as Rick simply explaining his decision-making process. He \"accepts\" that Judith is Shane's biological daughter so that he doesn't have to constant wonder what the truth is. If he can accept the worst-case scenario and still love Judith, then he knows his relationship with her will be fine no matter what. This ties into the argument Rick's making to Michonne throughout the scene: that they (the Alexandrians at war with Negan) need to accept the worst possible outcome of a situation from the start, so that it won't nag at them and cloud their judgment going forward. But even if you do take Rick's words at face value here, the takeaway for Judith is still the same. In all the ways that count, she's Rick's daughter. He's the one who raised her (for those first few years at least), and it's his and Michonne's values she grew up learning. Even if Judith got her DNA tested and found conclusive evidence that she wasn't Rick's daughter, hopefully she'd know not to pay it any mind.  Advertisement",
  "image": "https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/l-intro-1744062694.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?\" data-slide-num=\"0\" data-post-id=\"1829180\"\u003e\n                                             \u003cpicture id=\"p21c26125fa8ff404dbb8080589d0c805\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/intro-1744062694.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/intro-1744062694.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/intro-1744062694.jpg\" data-slide-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-id=\"1829180\" data-slide-num=\"0\" data-slide-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?: \" width=\"780\" height=\"438\" alt=\"The Walking Dead, kid Judith chilling outside\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAMC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp\u003eOf all the characters to survive the entirety of \u0026#34;The Walking Dead,\u0026#34; Judith Grimes is the most surprising. Conceived sometime in season 1, fetus-Judith\u0026#39;s hope of survival throughout season 2 relies entirely on her mother Lori (Sarah Wayne Callies) not dying from sheer clumsiness. There are plenty of close calls: at one point pregnant Lori steals a car without telling anyone, forgets to pay attention to the road while driving, and ends up flipping the car over in the middle of the night, with walkers nearby heading towards the noise. Some people just aren\u0026#39;t meant to live in such difficult times. \u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eLuckily for Judith, Lori somehow lives long enough to give birth to her amidst a walker ambush at the prison in season 3. Baby Judith is then carried from place to place for the next five seasons by various people, including a child psychopath who nearly suffocates her to death in season 4. Although \u003ca href=\"https://www.slashfilm.com/1146357/the-most-upsetting-deaths-in-the-walking-dead/\" target=\"_blank\"\u003ethe people around baby Judith keep dropping like flies\u003c/a\u003e, she stays strong through it all. Then in season 9, after a surprise time jump, Judith is old enough to be a proper character with lines and a personality. Played by Cailey Fleming, 10-year-old Judith has all the toughness and courage that her father Rick was known for. \u003c/p\u003e\n\u003cp\u003eThere\u0026#39;s just one problem: \u003cem\u003eis\u003c/em\u003e Rick Judith\u0026#39;s father? Or could Judith\u0026#39;s real father be that dastardly Shane Walsh (Jon Bernthal), who had a fling with Lori for a few weeks before she figured out she was pregnant? Mathematically it seems like Shane\u0026#39;s the more likely parent, but fans can certainly make the case for Rick...\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eRealistically, Judith\u0026#39;s father is probably Shane\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?\" data-slide-num=\"1\" data-post-id=\"1829180\"\u003e\n                                             \u003cpicture id=\"p8c501f29eb185466a4d532bc65661fc9\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/realistically-judiths-father-is-probably-shane-1744062695.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/realistically-judiths-father-is-probably-shane-1744062695.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/realistically-judiths-father-is-probably-shane-1744062695.jpg\" data-slide-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-id=\"1829180\" data-slide-num=\"1\" data-slide-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?: Realistically, Judith\u0026#39;s father is probably Shane\" width=\"780\" height=\"438\" alt=\"The Walking Dead, Shane arguing with Rick\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAMC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe case for Shane being Judith\u0026#39;s father is simple: Rick \u003ca href=\"https://www.slashfilm.com/1737277/the-walking-dead-how-long-rick-grimes-coma/\" target=\"_blank\"\u003espent several weeks at the hospital in a coma\u003c/a\u003e. During those weeks the apocalypse happened, and at some point Lori and Shane started hooking up. The exact timeline is intentionally left fuzzy by the show, but the scenes we do get of Lori and Shane in the early episodes imply that they\u0026#39;ve been having unprotected sex on a regular basis. \u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eAfter Rick and Lori reunite, they have sex at least once before Lori finds out she\u0026#39;s pregnant, but they quickly start having marital troubles as Rick finds out everything that\u0026#39;s happened. To put it simply: there were many more opportunities for Shane to impregnate Lori than for Rick, although it is technically possible that it was Rick who did the deed. \u003c/p\u003e\n\u003cp\u003eBecause DNA tests are hard to find in the apocalypse, both Lori and Rick seem content to just assume Rick\u0026#39;s the father and not really dwell on it. Shane, however, fully believes the baby is his, and his possessiveness towards Lori and her unborn child is a big part of what turns him increasingly vindictive and unstable throughout \u0026#34;The Walking Dead\u0026#34; season 2. If Rick hadn\u0026#39;t \u003ca href=\"https://www.slashfilm.com/1802925/jon-bernthal-shane-walsh-the-walking-dead-season-2-death-reason/\" target=\"_blank\"\u003ekilled him in \u0026#34;Better Angels,\u0026#34;\u003c/a\u003e it\u0026#39;s clear that Shane would\u0026#39;ve kept thinking of the baby as his own, and would\u0026#39;ve kept feuding with Rick because of this. \u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eAfter the time jump, fans were observing Judith closely for any signs of Shane-esque behavior. All she needed to do was \u003ca href=\"https://www.youtube.com/watch?v=Pkf_p1XUpr4\" target=\"_blank\"\u003erub the back of her head\u003c/a\u003e and the jig would be up, but instead she act more like how you\u0026#39;d expect the daughter of Rick Grimes to behave. Physically, she doesn\u0026#39;t seem to share many similarities with either father. (Honestly, she doesn\u0026#39;t even look much like Lori either.) It seems that when it comes to the question of Judith\u0026#39;s biological father, the answer is entirely up to fans to decide. \u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eBut who does Rick think the father is?\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?\" data-slide-num=\"2\" data-post-id=\"1829180\"\u003e\n                                             \u003cpicture id=\"pb0741556b3e7d105a9030ff6261c7324\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/but-who-does-rick-think-the-father-is-1744062696.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/but-who-does-rick-think-the-father-is-1744062696.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/who-is-judiths-biological-father-on-the-walking-dead/but-who-does-rick-think-the-father-is-1744062696.jpg\" data-slide-url=\"https://www.slashfilm.com/1829180/the-walking-dead-judith-grimes-biological-father/\" data-post-id=\"1829180\" data-slide-num=\"2\" data-slide-title=\"Who Is Judith\u0026#39;s Biological Father On The Walking Dead?: But who does Rick think the father is?\" width=\"780\" height=\"438\" alt=\"The Walking Dead, Rick saying Judith isn\u0026#39;t his biological daughter\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eAMC\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eA notable piece of evidence in the \u0026#34;Shane\u0026#39;s the father\u0026#34; camp, and one I think fans put too much stock in, is a season 7 scene where Rick straight up says, \u0026#34;I know Judith isn\u0026#39;t mine. I know it. I love her, she\u0026#39;s my daughter but she isn\u0026#39;t mine. I had to accept that.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp\u003eSome fans take this as confirmation of Judith\u0026#39;s parenthood, but others interpret it as Rick simply explaining his decision-making process. He \u0026#34;accepts\u0026#34; that Judith is Shane\u0026#39;s biological daughter so that he doesn\u0026#39;t have to constant wonder what the truth is. If he can accept the worst-case scenario and still love Judith, then he knows his relationship with her will be fine no matter what. This ties into the argument Rick\u0026#39;s making to Michonne throughout the scene: that they (the Alexandrians at war with Negan) need to accept the worst possible outcome of a situation from the start, so that it won\u0026#39;t nag at them and cloud their judgment going forward.\u003c/p\u003e\n\u003cp\u003eBut even if you do take Rick\u0026#39;s words at face value here, the takeaway for Judith is still the same. In all the ways that count, she\u0026#39;s Rick\u0026#39;s daughter. He\u0026#39;s the one who raised her (\u003ca href=\"https://www.slashfilm.com/558582/andrew-lincolin-leaving-the-walking-dead/\" target=\"_blank\"\u003efor those first few years at least\u003c/a\u003e), and it\u0026#39;s his and Michonne\u0026#39;s values she grew up learning. Even if Judith got her DNA tested and found conclusive evidence that she wasn\u0026#39;t Rick\u0026#39;s daughter, hopefully she\u0026#39;d know not to pay it any mind. \u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-06T00:00:00Z",
  "modifiedTime": "2025-05-06T00:00:00Z"
}
