{
  "id": "56565032-8ab9-43c9-8aba-ce34e097069b",
  "title": "Kevin James is a Mob Henchman in Action Comedy 'Guns Up' Trailer",
  "link": "https://www.firstshowing.net/2025/kevin-james-is-a-mob-henchman-in-action-comedy-guns-up-trailer/",
  "description": "\"What's this I hear about you wanting to quit the game?\" Empire Ent. has revealed an official trailer for an action comedy movie called Guns Up, the latest from director Edward Drake (of American Siege, Gasoline Alley, and the Detective Knight trilogy). This has no US release set yet - even with Kevin James. It looks like it's opening in European countries this summer before anywhere else, hence why this first trailer and other posters are already out. A family-man ex-cop now moonlighting as a henchman for the mob has one night to get his family out of the city – and keep his dark secret hidden from his kids – after a job goes wrong. Kevin James stars as Ray Hayes, who was working as a mob thug and now needs to get his family to safety. Here's a tidbit from IMDb trivia: \"Kevin James has stated that he got the inspiration for his performance by watching French bulldogs try to jump up on a couch. When they kept falling and were unable to get up, he immediately realized how to portray his sympathetic character in the film.\" Also starring Christina Ricci, Luis Guzmán, Francis Cronin, Kelly Landry, and […]",
  "author": "Alex Billington",
  "published": "Sun, 27 Apr 2025 19:28:41 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "To Watch",
    "Trailer"
  ],
  "byline": "Alex Billington",
  "length": 2461,
  "excerpt": "\"What's this I hear about you wanting to quit the game?\" Empire Ent. has revealed an official trailer for an action comedy movie called Guns Up, the latest from director Edward Drake (of American Siege, Gasoline Alley, and the Detective Knight trilogy). This has no US release set yet - even with Kevin James. It",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "TRAILERS by April 27, 2025Source: YouTube \"What's this I hear about you wanting to quit the game?\" Empire Ent. has revealed an official trailer for an action comedy movie called Guns Up, the latest from director Edward Drake (of American Siege, Gasoline Alley, and the Detective Knight trilogy). This has no US release set yet - even with Kevin James. It looks like it's opening in European countries this summer before anywhere else, hence why this first trailer and other posters are already out. A family-man ex-cop now moonlighting as a henchman for the mob has one night to get his family out of the city – and keep his dark secret hidden from his kids – after a job goes wrong. Kevin James stars as Ray Hayes, who was working as a mob thug and now needs to get his family to safety. Here's a tidbit from IMDb trivia: \"Kevin James has stated that he got the inspiration for his performance by watching French bulldogs try to jump up on a couch. When they kept falling and were unable to get up, he immediately realized how to portray his sympathetic character in the film.\" Also starring Christina Ricci, Luis Guzmán, Francis Cronin, Kelly Landry, and Rob Gough. Alas this doesn't look that much fun. Here's the first international trailer (+ posters) for Edward Drake's action movie Guns Up, from YouTube: Police officer Ray Hayes wants to provide his family with a better life than what a regular cop can afford. So he switches sides and begins working as a debt collector \u0026 thug for organized crime. He and his wife Audrey plan to use the money they earn to open their own diner . Five years later, this plan seems within reach, and Ray is planning his exit. After a new gangster boss, Lonny, takes over, Ray becomes a target of his own men after a job goes wrong. Ray and Audrey must protect their unsuspecting children from the mafia. Guns Up is written and directed by Australian filmmaker Edward Drake, director of the movies Animals, Broil, Cosmic Sin, Apex, American Siege, Gasoline Alley, and the Detective Knight trilogy of films with Bruce Willis as well. Produced by Jeffrey Greenstein, Jon Keeyes, Mandi Murro, J.J. Nugent, Tobias Weymar, \u0026 Edward Drake. This hasn't premiered at any fests or elsewhere, as far as we know. Drake's Guns Up film opens first in Germany \u0026 Spain this summer. No US release has been set yet - stay tuned. Anyone? Find more posts in: To Watch, Trailer prev next",
  "image": "https://media2.firstshowing.net/firstshowing/img16/Gunsup25PostermainbigTW01.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\t\t\u003ch2 id=\"pagetitle\"\u003e\u003ca href=\"https://www.firstshowing.net/category/trailers/\" title=\"Click for more trailers\"\u003eTRAILERS\u003c/a\u003e\n\t\t\u003c/h2\u003e\n\t\t\t\t\u003cdiv\u003e\n\t\t\t\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eApril 27, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.youtube.com/watch?v=-JyE2tuSt3M\" rel=\"noopener nofollow\" target=\"_blank\"\u003eYouTube\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/kevin-james-is-a-mob-henchman-in-action-comedy-guns-up-trailer/\"\u003e\u003cspan\u003e\u003c/span\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/Gunsup25PostermainbigTsr01.jpg\" alt=\"Guns Up Trailer\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u0026#34;What\u0026#39;s this I hear about you wanting to quit the game?\u0026#34;\u003c/em\u003e Empire Ent. has revealed an official trailer for an action comedy movie called \u003cstrong\u003e\u003cem\u003eGuns Up\u003c/em\u003e\u003c/strong\u003e, the latest from director Edward Drake (of \u003cem\u003eAmerican Siege\u003c/em\u003e, \u003cem\u003eGasoline Alley\u003c/em\u003e, and the \u003ca href=\"https://www.firstshowing.net/2022/official-trailer-for-thriller-detective-knight-rogue-with-bruce-willis/\"\u003e\u003cem\u003eDetective Knight\u003c/em\u003e\u003c/a\u003e trilogy). This has no US release set yet - even with Kevin James. It looks like it\u0026#39;s opening in European countries this summer before anywhere else, hence why this first trailer and other posters are already out. A family-man ex-cop now moonlighting as a henchman for the mob has one night to get his family out of the city – and keep his dark secret hidden from his kids – after a job goes wrong. \u003cstrong\u003eKevin James\u003c/strong\u003e stars as Ray Hayes, who was working as a mob thug and now needs to get his family to safety. Here\u0026#39;s a tidbit from \u003ca href=\"https://www.imdb.com/title/tt28026215/\" rel=\"noopener nofollow \" target=\"_blank\"\u003eIMDb\u003c/a\u003e trivia: \u0026#34;Kevin James has stated that he got the inspiration for his performance by watching French bulldogs try to jump up on a couch. When they kept falling and were unable to get up, he immediately realized how to portray his sympathetic character in the film.\u0026#34; Also starring \u003cstrong\u003eChristina Ricci\u003c/strong\u003e, \u003cstrong\u003eLuis Guzmán\u003c/strong\u003e, \u003cstrong\u003eFrancis Cronin\u003c/strong\u003e, \u003cstrong\u003eKelly Landry\u003c/strong\u003e, and \u003cstrong\u003eRob Gough\u003c/strong\u003e. Alas this doesn\u0026#39;t look that much fun.\u003cspan id=\"more-738056\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the first international trailer (+ posters) for Edward Drake\u0026#39;s action movie \u003cstrong\u003e\u003cem\u003eGuns Up\u003c/em\u003e\u003c/strong\u003e, from \u003ca href=\"https://www.youtube.com/watch?v=2S-zfIOrpUk\" rel=\"noopener\" target=\"_blank\"\u003eYouTube\u003c/a\u003e:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/Gunsup25Postermainbig59902.jpg\" alt=\"Guns Up Poster\" width=\"599\" height=\"846\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/Gunsup25Postermainbig59901.jpg\" alt=\"Guns Up Poster\" width=\"599\" height=\"863\" fetchpriority=\"high\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePolice officer Ray Hayes wants to provide his family with a better life than what a regular cop can afford. So he switches sides and begins working as a debt collector \u0026amp; thug for organized crime. He and his wife Audrey plan to use the money they earn to open their own diner . Five years later, this plan seems within reach, and Ray is planning his exit. After a new gangster boss, Lonny, takes over, Ray becomes a target of his own men after a job goes wrong. Ray and Audrey must protect their unsuspecting children from the mafia.\u003c/em\u003e \u003cem\u003eGuns Up\u003c/em\u003e is written and directed by Australian filmmaker \u003ca href=\"https://www.imdb.com/name/nm4864836/\" rel=\"noopener\" target=\"_blank\"\u003e\u003cstrong\u003eEdward Drake\u003c/strong\u003e\u003c/a\u003e, director of the movies \u003cem\u003eAnimals\u003c/em\u003e, \u003cem\u003eBroil\u003c/em\u003e, \u003cem\u003eCosmic Sin\u003c/em\u003e, \u003cem\u003eApex\u003c/em\u003e, \u003cem\u003eAmerican Siege\u003c/em\u003e, \u003cem\u003eGasoline Alley\u003c/em\u003e, and the \u003ca href=\"https://www.firstshowing.net/2022/official-trailer-for-thriller-detective-knight-rogue-with-bruce-willis/\"\u003e\u003cem\u003eDetective Knight\u003c/em\u003e\u003c/a\u003e trilogy of films with Bruce Willis as well. Produced by Jeffrey Greenstein, Jon Keeyes, Mandi Murro, J.J. Nugent, Tobias Weymar, \u0026amp; Edward Drake. This hasn\u0026#39;t premiered at any fests or elsewhere, as far as we know. Drake\u0026#39;s \u003cem\u003eGuns Up\u003c/em\u003e film opens first in Germany \u0026amp; Spain this summer. No US release has been set yet - stay tuned. \u003cem\u003eAnyone?\u003c/em\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/worthwatching/\" rel=\"category tag\"\u003eTo Watch\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/trailers/\" rel=\"category tag\"\u003eTrailer\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\n\t\u003cdiv id=\"rightbar\"\u003e\n\t\t\u003cul id=\"slnav\"\u003e\n\t\t\t\u003cli id=\"prev\"\u003e\u003ca href=\"#\"\u003eprev\u003c/a\u003e\u003c/li\u003e\n\t\t    \u003cli id=\"next\"\u003e\u003ca href=\"#\"\u003enext\u003c/a\u003e\u003c/li\u003e\n\t\t\u003c/ul\u003e\n\t\t\u003cul id=\"slides\"\u003e\n\n\t\t\u003c/ul\u003e\n\t\t\u003c/div\u003e      \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-27T15:28:41-04:00",
  "modifiedTime": null
}
