{
  "id": "67db72df-6af2-462a-a6dd-b372be625c8c",
  "title": "The Bones Writers' Room Followed A Unique Process At First",
  "link": "https://www.slashfilm.com/1872213/bones-writers-room-unique-process/",
  "description": "Bones is loosely based on the life and novels of Kathy Reichs, but having literary source material didn't make writing the show any easier.",
  "author": "Joe Roberts",
  "published": "Sun, 08 Jun 2025 00:20:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Shows"
  ],
  "byline": "Joe Roberts",
  "length": 5564,
  "excerpt": "Bones is loosely based on the life and novels of Kathy Reichs, but having literary source material didn't make writing the show any easier.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "20th Television When you've got 23 crime novels as source material, you might think that writing a show would be as easy as just copying the books as closely as possible. But \"Bones,\" which is based on forensic anthropologist Dr. Kathy Reichs' Temperance Brennan book series, is a lot more than a straightforward adaptation. The novel series began in 1997 with \"Deja Dead,\" and follows the career of forensic scientist Temperance \"Bones\" Brennan, whose namesake also leads the show. Temperance is, in turn, based on the life and experiences of Reichs (who had a sneaky cameo in \"Bones\" season 2), but the show itself deviates significantly from the books, introducing a whole new cast of characters and storylines.  \"Bones\" ran for a full 12 seasons from 2005 to 2017, with most episodes introducing new mysteries for Emily Deschanel's Temperance Brennan and David Boreanaz's FBI Special Agent Seeley Booth to solve — with help from the \"squinterns\" at the Jeffersonian Institute. As such, the show would have quickly run out of ideas had it simply adapted a book mystery per episode. Instead, the \"Bones\" writers had to come up with their own storylines based on Reichs' characters, and to do so, they used a process that differentiated their TV show from most others. Bones writers were on a tight schedule 20th Television \"Bones\" began in 2005 with a pilot that included scenes plucked from real life. The series was, after all, only loosely based on Dr. Kathy Reichs' book series, and needed to find inspiration elsewhere to flesh out its own take on the world of Temperance Brennan, whose backstory had to be told in just one single episode. In order to do so, the show's writers developed a unique way of crafting episodes. In the early days of \"Bones,\" show creator Hart Hanson spoke to UGO about the writing process on the show, revealing it to be slightly different from the typical writers' room approach. Asked if the writing stage was any different from other series, Hanson said, \"A little different. Instead of a room of all of the writers, we tend to break up into smaller groups and work out each outline.\" The creator went on to detail how the writers \"storyboard\" the show in this way, with small groups developing outlines of episodes before \"the writers go off to write the outline on their own and then get through to a first draft.\" He continued: \"Because of the speed with which we're moving, the writers aren't getting to do as many drafts as I'd like before I have to take it away. It's always tricky figuring out the show while you're on the move.\" Typically, a story would be broken by the writers' room as a whole before an episode is assigned to a specific writer to produce a first draft. This would then be brought back to the group, who would refine it, before further drafts are produced. On \"Bones,\" it seems Hanson wanted to do away with the initial stage of having all the writers contribute to the outline, instead leaving writers with the task of developing the outline and writing the first draft without input from the entire writing staff. Why Hart Hanson didn't just adapt the Temperance Brennan novels 20th Television Though \"Bones\" uses the Temperance Brennan character, the show itself is actually based mostly on Kathy Reichs herself. As Hart Hanson told ScriptMag, when he first began developing the show, it was based on a meeting with producer Barry Josephson, who had secured the rights to a documentary on Dr. Reichs. When Hanson came to develop \"Bones\" based on this meeting, he thought he only had the rights to Reichs' life story and not the books. As the creator explained it: \"I created the world of 'Bones' from that documentary. There's nothing from the original books in the show. In the books, Temperance Brennan is a 50-year-old, divorced, former alcoholic who has a grown daughter. She works in Montreal and North Carolina, in two forensic labs. But I didn't take any of that world.\" It was only after Reichs suggested using the Temperance Brennan name for the lead character that Hanson took something from the books. As such, making \"Bones\" a straightforward adaptation of the novels was never really on the cards, which meant Hanson and his writing staff were tasked with producing entirely original mysteries for Emily Deschanel and David Boreanaz's characters to solve, as well as creating a whole world of their own. When you have 22 episodes in a season, that's a heck of a lot of mystery-solving to come up with, and it seems Hanson and the writers simply had to use an unorthodox writing approach to keep up with the requirements of production. When \"Bones\" was affected by a writers' strike, that just made things even harder, resulting in a twist that remains controversial to this day.",
  "image": "https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/l-intro-1748480049.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First\" data-slide-num=\"0\" data-post-id=\"1872213\"\u003e\n                                             \u003cpicture id=\"p1c44e1264ae46cb345a844dbce9d0132\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/intro-1748480049.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/intro-1748480049.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/intro-1748480049.jpg\" data-slide-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-id=\"1872213\" data-slide-num=\"0\" data-slide-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First: \" width=\"780\" height=\"438\" alt=\"Emily Deschanel\u0026#39;s Temperance Brennan looks off to her right during a crime scene visit in Bones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003e20th Television\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eWhen you\u0026#39;ve got 23 crime novels as source material, you might think that writing a show would be as easy as just copying the books as closely as possible. But \u0026#34;Bones,\u0026#34; which is based on forensic anthropologist Dr. Kathy Reichs\u0026#39; Temperance Brennan book series, is a lot more than a straightforward adaptation. The novel series began in 1997 with \u0026#34;Deja Dead,\u0026#34; and follows the career of forensic scientist Temperance \u0026#34;Bones\u0026#34; Brennan, whose namesake also leads the show. Temperance is, in turn, based on the life and experiences of \u003ca href=\"https://www.slashfilm.com/1643939/bones-kathy-reichs-cameo/\" target=\"_blank\"\u003eReichs (who had a sneaky cameo in \u0026#34;Bones\u0026#34; season 2\u003c/a\u003e), but the show itself deviates significantly from the books, introducing a whole new cast of characters and storylines. \u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;Bones\u0026#34; ran for a full 12 seasons from 2005 to 2017, with most episodes introducing new mysteries for Emily Deschanel\u0026#39;s Temperance Brennan and David Boreanaz\u0026#39;s FBI Special Agent Seeley Booth to solve — with help from the \u0026#34;squinterns\u0026#34; at the Jeffersonian Institute. As such, the show would have quickly run out of ideas had it simply adapted a book mystery per episode. Instead, the \u0026#34;Bones\u0026#34; writers had to come up with their own storylines based on Reichs\u0026#39; characters, and to do so, they used a process that differentiated their TV show from most others.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eBones writers were on a tight schedule\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First\" data-slide-num=\"1\" data-post-id=\"1872213\"\u003e\n                                             \u003cpicture id=\"p72f14e208aecb28f961f469f731c176c\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/bones-writers-were-on-a-tight-schedule-1748479318.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/bones-writers-were-on-a-tight-schedule-1748479318.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/bones-writers-were-on-a-tight-schedule-1748479318.jpg\" data-slide-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-id=\"1872213\" data-slide-num=\"1\" data-slide-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First: Bones writers were on a tight schedule\" width=\"780\" height=\"438\" alt=\"Emily Deschanel\u0026#39;s Temperance Brennan investigates a body in the field alongside fellow forensic scientists in Bones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003e20th Television\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003e\u003ca href=\"https://www.slashfilm.com/1449678/bones-pilot-scene-real-life-story/\" target=\"_blank\"\u003e\u0026#34;Bones\u0026#34; began in 2005 with a pilot that included scenes plucked from real life\u003c/a\u003e. The series was, after all, only loosely based on Dr. Kathy Reichs\u0026#39; book series, and needed to find inspiration elsewhere to flesh out its own take on the world of \u003ca href=\"https://www.slashfilm.com/1619636/bones-brennan-backstory-plans/\" target=\"_blank\"\u003eTemperance Brennan, whose backstory had to be told in just one single episode\u003c/a\u003e. In order to do so, the show\u0026#39;s writers developed a unique way of crafting episodes.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIn the early days of \u0026#34;Bones,\u0026#34; show creator Hart Hanson spoke to \u003ca href=\"https://web.archive.org/web/20090316122511/http://www.ugo.com/channels/filmtv/features/falltv2005/bones-hanson.asp\" target=\"_blank\"\u003eUGO\u003c/a\u003e about the writing process on the show, revealing it to be slightly different from the typical writers\u0026#39; room approach. Asked if the writing stage was any different from other series, Hanson said\u003cstrong\u003e,\u003c/strong\u003e \u0026#34;A little different. Instead of a room of all of the writers, we tend to break up into smaller groups and work out each outline.\u0026#34; The creator went on to detail how the writers \u0026#34;storyboard\u0026#34; the show in this way, with small groups developing outlines of episodes before \u0026#34;the writers go off to write the outline on their own and then get through to a first draft.\u0026#34; He continued:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;Because of the speed with which we\u0026#39;re moving, the writers aren\u0026#39;t getting to do as many drafts as I\u0026#39;d like before I have to take it away. It\u0026#39;s always tricky figuring out the show while you\u0026#39;re on the move.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp dir=\"ltr\"\u003eTypically, a story would be broken by the writers\u0026#39; room as a whole before an episode is assigned to a specific writer to produce a first draft. This would then be brought back to the group, who would refine it, before further drafts are produced. On \u0026#34;Bones,\u0026#34; it seems Hanson wanted to do away with the initial stage of having all the writers contribute to the outline, instead leaving writers with the task of developing the outline and writing the first draft without input from the entire writing staff.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eWhy Hart Hanson didn\u0026#39;t just adapt the Temperance Brennan novels\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First\" data-slide-num=\"2\" data-post-id=\"1872213\"\u003e\n                                             \u003cpicture id=\"p8273e454edf35f185c4dc9b44da760dc\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/why-hart-hanson-didnt-just-adapt-the-temperance-brennan-novels-1748479318.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/why-hart-hanson-didnt-just-adapt-the-temperance-brennan-novels-1748479318.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-bones-writers-room-followed-a-unique-process-at-first/why-hart-hanson-didnt-just-adapt-the-temperance-brennan-novels-1748479318.jpg\" data-slide-url=\"https://www.slashfilm.com/1872213/bones-writers-room-unique-process/\" data-post-id=\"1872213\" data-slide-num=\"2\" data-slide-title=\"The Bones Writers\u0026#39; Room Followed A Unique Process At First: Why Hart Hanson didn\u0026#39;t just adapt the Temperance Brennan novels\" width=\"780\" height=\"438\" alt=\"David Boreanaz\u0026#39;s Seeley Booth leans across a table as he talks to Emily Deschanel\u0026#39;s Temperance Brennan in Bones\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003e20th Television\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThough \u0026#34;Bones\u0026#34; uses the Temperance Brennan character, the show itself is actually based mostly on Kathy Reichs herself. As Hart Hanson told \u003ca href=\"https://scriptmag.com/features/small-screen-bones\" target=\"_blank\"\u003eScriptMag\u003c/a\u003e, when he first began developing the show, it was based on a meeting with producer Barry Josephson, who had secured the rights to a documentary on Dr. Reichs. When Hanson came to develop \u0026#34;Bones\u0026#34; based on this meeting, he thought he only had the rights to Reichs\u0026#39; life story and not the books. As the creator explained it:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;I created the world of \u0026#39;Bones\u0026#39; from that documentary. There\u0026#39;s nothing from the original books in the show. In the books, Temperance Brennan is a 50-year-old, divorced, former alcoholic who has a grown daughter. She works in Montreal and North Carolina, in two forensic labs. But I didn\u0026#39;t take any of that world.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp dir=\"ltr\"\u003eIt was only after Reichs suggested using the Temperance Brennan name for the lead character that Hanson took something from the books. As such, making \u0026#34;Bones\u0026#34; a straightforward adaptation of the novels was never really on the cards, which meant Hanson and his writing staff were tasked with producing entirely original mysteries for Emily Deschanel and David Boreanaz\u0026#39;s characters to solve, as well as creating a whole world of their own. When you have 22 episodes in a season, that\u0026#39;s a heck of a lot of mystery-solving to come up with, and it seems Hanson and the writers simply had to use an unorthodox writing approach to keep up with the requirements of production. When \u003ca href=\"https://www.slashfilm.com/1793299/bones-controversial-zack-addy-twist-writers-strike/\" target=\"_blank\"\u003e\u0026#34;Bones\u0026#34; was affected by a writers\u0026#39; strike, that just made things even harder, resulting in a twist\u003c/a\u003e that remains controversial to this day.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-08T00:20:00Z",
  "modifiedTime": "2025-06-08T00:20:00Z"
}
