{
  "id": "6dcbc903-7d7d-4bd5-b6d5-a1ecdef4e245",
  "title": "The Main Reason To See Robert Zemeckis' New Movie Is The Same Thing That Holds It Back",
  "link": "https://www.slashfilm.com/1703775/main-reason-to-see-robert-zemeckis-here-same-thing-holds-it-back/",
  "description": "The visual conceit of Robert Zemeckis' latest movie is the primary reason to see it, but it's also the thing that hampers some of the film's power.",
  "author": "Ben Pearson",
  "published": "Fri, 01 Nov 2024 21:22:06 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Podcast",
    "Drama Movies"
  ],
  "byline": "Ben Pearson",
  "length": 4824,
  "excerpt": "The visual conceit of Robert Zemeckis' latest movie is the primary reason to see it, but it's also the thing that hampers some of the film's power.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Sony Pictures Robert Zemeckis' longtime obsession with technology and innovation continues in \"Here,\" a film that's unlike anything I've ever seen. The project is a \"Forrest Gump\" reunion, reteaming the director with writer Eric Roth and stars Tom Hanks and Robin Wright for another decades-spanning tale. But this time, the story doesn't just focus on one set of characters: The camera (mostly) doesn't move for the whole film, appearing as a fixed point in space that witnesses dinosaurs, the ensuing meteor that wipes them out, the ice age, regrowth, Indigenous characters, and finally, a house being built on this spot, with the unmoving camera now hovering unseen in a living room that will eventually depict multiple families moving in and out as they experience the ups and downs of life. The film is based on a comic that has the some conceit, but it's certainly a bold experiment for Zemeckis to try this as a movie, and I appreciate the fact that he took the swing, even if I don't think it fully connects. (You can read our review of \"Here\" right here.) Still, I find myself torn. I think part of the larger meaning here is that the fixed angle could be anywhere, and we could theoretically be seeing a whole host of other fascinating stories and interactions playing out across millennia from any number of different vantage points. The editing of the film leaves me with the feeling that Zemeckis and Roth, who co-wrote the screenplay, want us to bask in the wonder of the human experience in all its mundanity and ecstasy. There's something powerful about thinking back over the places you've lived and all the things that happened there, in that enclosed space, over years and sometimes decades. But the visual gimmick of the film, while seemingly being its entire reason for existing, is also so limiting that it hampers the full exploration of the highs and lows it's trying to capture. The limitations of Here's visual style begin to strain credulity Sony Pictures The movie largely focuses on one family — Paul Bettany and Kelly Reilly play Hanks's character's parents, and eventually the Hanks and Wright characters are living alongside the parents in this house — but it also jumps through time to depict scenes of several families who have lived there over the years. By keeping the camera in one place, the film is asking us to buy into the idea that practically every major event that befalls these families happen not just in this domicile, but in this specific room that we're peering into. That \"ask\" starts to become more ridiculous as the events pile up — sex, a wedding, a death, a funeral, the creation of an invention that will not be spoiled here — the list goes on. At a certain point, you start to wonder if anything notable has ever happened in any other room, but the film's gimmick won't allow us to find out. (The lone exception is a very brief stretch in which a mirror allows us to see a reverse shot into the room behind the camera, but that probably lasts for less than a minute of screen time.) The one time a character who has felt frustrated by the limitations of living in this house finally experiences a life-changing and cathartic moment, it happens off screen, and the catch-22 of this gimmick starts to feel almost cruel: The audience has felt all of their pent-up disappointment, but since the camera won't move, we're unable to experience that character's catharsis along with them, so we're stuck hearing about it during a phone conversation that takes place in the living room. The fixed camera, meant to create an emotional power from seeing the accumulation of events from the same perspective over time, becomes a weakness instead of a strength. Despite all of this, \"Here\" is a fascinating cinematic experiment that gives audiences plenty to chew on. It's certainly one of the better Zemeckis movies of the past 25 years (check out our written ranking of his filmography here, and an updated group list podcast episode here). We spoke about the movie in detail on today's episode of the /Film Daily podcast, which you can listen to below: You can subscribe to /Film Daily on Apple Podcasts, Overcast, Spotify, or wherever you get your podcasts, and send your feedback, questions, comments, concerns, and mailbag topics to us at bpearson@slashfilm.com. Please leave your name and general geographic location in case we mention your e-mail on the air.",
  "image": "https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/l-intro-1730491278.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n                        \n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1703775/main-reason-to-see-robert-zemeckis-here-same-thing-holds-it-back/\" data-post-title=\"The Main Reason To See Robert Zemeckis\u0026#39; New Movie Is The Same Thing That Holds It Back\" data-slide-num=\"0\" data-post-id=\"1703775\"\u003e\n                                             \u003cpicture id=\"p5931274351e750d3a3405158a138d829\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/intro-1730491278.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/intro-1730491278.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/intro-1730491278.jpg\" data-slide-url=\"https://www.slashfilm.com/1703775/main-reason-to-see-robert-zemeckis-here-same-thing-holds-it-back/\" data-post-id=\"1703775\" data-slide-num=\"0\" data-slide-title=\"The Main Reason To See Robert Zemeckis\u0026#39; New Movie Is The Same Thing That Holds It Back: \" width=\"780\" height=\"438\" alt=\"Margaret looking at a lit birthday cake, surrounded by friends in Here\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003ca href=\"https://www.slashfilm.com/577563/what-happened-to-robert-zemeckis/\" target=\"_blank\"\u003eRobert Zemeckis\u0026#39; longtime obsession with technology and innovation\u003c/a\u003e continues in \u0026#34;Here,\u0026#34; a film that\u0026#39;s unlike anything I\u0026#39;ve ever seen. The project is a \u0026#34;Forrest Gump\u0026#34; reunion, reteaming the director with writer Eric Roth and stars Tom Hanks and Robin Wright for another decades-spanning tale. But this time, the story doesn\u0026#39;t just focus on one set of characters: The camera (mostly) doesn\u0026#39;t move for the whole film, appearing as a fixed point in space that witnesses dinosaurs, the ensuing meteor that wipes them out, the ice age, regrowth, Indigenous characters, and finally, a house being built on this spot, with the unmoving camera now hovering unseen in a living room that will eventually depict multiple families moving in and out as they experience the ups and downs of life. The film is based on a comic that has the some conceit, but it\u0026#39;s certainly a bold experiment for Zemeckis to try this as a movie, and I appreciate the fact that he took the swing, even if I don\u0026#39;t think it fully connects. (\u003ca href=\"https://www.slashfilm.com/1700012/here-2024-movie-review/\" target=\"_blank\"\u003eYou can read our review of \u0026#34;Here\u0026#34; right here\u003c/a\u003e.)\u003c/p\u003e\n\n\u003cp\u003eStill, I find myself torn. I think part of the larger meaning here is that the fixed angle could be anywhere, and we could theoretically be seeing a whole host of other fascinating stories and interactions playing out across millennia from any number of different vantage points. The editing of the film leaves me with the feeling that Zemeckis and Roth, who co-wrote the screenplay, want us to bask in the wonder of the human experience in all its mundanity and ecstasy. There\u0026#39;s something powerful about thinking back over the places you\u0026#39;ve lived and all the things that happened there, in that enclosed space, over years and sometimes decades. But \u003cstrong\u003ethe visual gimmick of the film, while seemingly being its entire reason for existing, is also so limiting that it hampers the full exploration of the highs and lows it\u0026#39;s trying to capture\u003c/strong\u003e.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \u003ch2\u003eThe limitations of Here\u0026#39;s visual style begin to strain credulity\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1703775/main-reason-to-see-robert-zemeckis-here-same-thing-holds-it-back/\" data-post-title=\"The Main Reason To See Robert Zemeckis\u0026#39; New Movie Is The Same Thing That Holds It Back\" data-slide-num=\"1\" data-post-id=\"1703775\"\u003e\n                                             \u003cpicture id=\"p28d48ca2c466236d356e4ca4b7d954ff\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/test-1730491278.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/test-1730491278.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/the-main-reason-to-see-robert-zemeckis-new-movie-is-the-same-thing-that-holds-it-back/test-1730491278.jpg\" data-slide-url=\"https://www.slashfilm.com/1703775/main-reason-to-see-robert-zemeckis-here-same-thing-holds-it-back/\" data-post-id=\"1703775\" data-slide-num=\"1\" data-slide-title=\"The Main Reason To See Robert Zemeckis\u0026#39; New Movie Is The Same Thing That Holds It Back: The limitations of Here\u0026#39;s visual style begin to strain credulity\" width=\"780\" height=\"438\" alt=\"Richard and Margaret get married in their living room in Here\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003eThe movie largely focuses on one family — Paul Bettany and Kelly Reilly play Hanks\u0026#39;s character\u0026#39;s parents, and eventually the Hanks and Wright characters are living alongside the parents in this house — but it also jumps through time to depict scenes of several families who have lived there over the years. \u003cstrong\u003eBy keeping the camera in one place, the film is asking us to buy into the idea that practically every major event that befalls these families happen not just in this domicile, but in this specific room that we\u0026#39;re peering into\u003c/strong\u003e. That \u0026#34;ask\u0026#34; starts to become more ridiculous as the events pile up — sex, a wedding, a death, a funeral, the creation of an invention that will not be spoiled here — the list goes on. At a certain point, you start to wonder if anything notable has ever happened in any other room, but the film\u0026#39;s gimmick won\u0026#39;t allow us to find out. (The lone exception is a very brief stretch in which a mirror allows us to see a reverse shot into the room \u003cem\u003ebehind\u003c/em\u003e the camera, but that probably lasts for less than a minute of screen time.)\u003c/p\u003e\n\n\u003cp\u003eThe one time a character who has felt frustrated by the limitations of living in this house finally experiences a life-changing and cathartic moment, it happens off screen, and the catch-22 of this gimmick starts to feel almost cruel: The audience has felt all of their pent-up disappointment, but since the camera won\u0026#39;t move, we\u0026#39;re unable to experience that character\u0026#39;s catharsis along with them, so we\u0026#39;re stuck hearing about it during a phone conversation that takes place in the living room. The fixed camera, meant to create an emotional power from seeing the accumulation of events from the same perspective over time, becomes a weakness instead of a strength.\u003c/p\u003e\n\u003cp\u003eDespite all of this, \u0026#34;Here\u0026#34; is a fascinating cinematic experiment that gives audiences plenty to chew on. It\u0026#39;s certainly one of the better Zemeckis movies of the past 25 years (\u003ca href=\"https://www.slashfilm.com/540383/robert-zemeckis-films-ranked/\" target=\"_blank\"\u003echeck out our written ranking of his filmography here\u003c/a\u003e, and \u003ca href=\"https://open.spotify.com/episode/6kLJYQjPGESLzL6qsGCiIb\" target=\"_blank\"\u003ean updated group list podcast episode here\u003c/a\u003e). We spoke about the movie in detail on today\u0026#39;s episode of the /Film Daily podcast, which you can listen to below:\u003c/p\u003e\n\n\n\u003cp\u003eYou can subscribe to /Film Daily on \u003ca href=\"https://itunes.apple.com/us/podcast/film-daily/id1254073246?mt=2\" target=\"_blank\"\u003eApple Podcasts\u003c/a\u003e, \u003ca href=\"https://overcast.fm/itunes1254073246/film-daily\" target=\"_blank\"\u003eOvercast\u003c/a\u003e, \u003ca href=\"https://u922627.ct.sendgrid.net/wf/click?upn=TvhtDiauxJVhRdbUMx2NHL6ODzLmx4MtfKCdFx-2FSGFQNyT19gu7suETHskKPLeObN63kZLIJaqHCutUuD2JSOw-3D-3D_Mf-2FCkfRivOmMK7O7F0Y-2FexQfRdP6nJdv0CvMHIllgbkxYonk7OFRtOKgc2RI2FTZjosX7Gy5-2F0LZYTCm1KUveJQurOXZQv5Dj2WhJrhmTrs0v3SJiEiBpyb-2F1L8jvr-2B-2BkxkiGeoPD1UieLppbdRBRhz-2BVOyI6R94uU85wuTnw695jKUkbDYkfDzQF2AmxCxzLBCpnE6CnunSfOnUc5T4w6Rt0VfqnTdL8n5IRPTbqCQRp1Xk2jliYNZ7ZDeIS9PTLnYnsWPYrfKEGJy8pKEuEg-3D-3D\" target=\"_blank\"\u003eSpotify\u003c/a\u003e, or wherever you get your podcasts, and send your feedback, questions, comments, concerns, and mailbag topics to us at bpearson@slashfilm.com. Please leave your name and general geographic location in case we mention your e-mail on the air.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-01T21:22:06Z",
  "modifiedTime": "2024-11-01T21:22:06Z"
}
