{
  "id": "71e8f3cb-4c0d-4703-baf5-d831db9f6437",
  "title": "Who Is Penn Badgley’s Wife? Domino Kirke’s Job \u0026 Relationship History",
  "link": "https://www.comingsoon.net/guides/news/1960310-penn-badley-wife-domino-kirke-job-relationship-history",
  "description": "Discover the love story of Penn Badgley and his wife and explore her multifaceted career. Read more now! The post Who Is Penn Badgley’s Wife? Domino Kirke’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Vritti Johar",
  "published": "Tue, 22 Apr 2025 23:54:48 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Penn Badgley",
    "Pop Culture",
    "Pop Culture FAQ"
  ],
  "byline": "Vritti Johar",
  "length": 1953,
  "excerpt": "Find out more about Penn Badgley and his wife, their marriage in 2017, and the news of their upcoming twins.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Penn Badgley has sparked fresh interest in his personal life as fans revisit the actor’s long-standing relationship with his wife and their growing family. The You star, who quietly tied the knot in 2017 after several years of dating, recently revealed that he and his wife are expecting twins, further highlighting their enduring bond. Here’s a look at their marriage, her career path, and how their relationship has evolved over time. Who is Penn Badgley married to? Penn Badgley is married to Domino Kirke. The couple legally wed on February 27, 2017, in a small civil ceremony in Brooklyn, followed by a larger celebration in June at her mother’s home in New York. They met in 2014 and were first seen publicly in July of that year. Badgley credited their shared Baha’i faith as a key foundation in their relationship and readiness for marriage. What is Domino Kirke’s job? Domino Kirke is a doula, reiki practitioner, and co-founder of Carriage House Birth, an organization offering services for pregnant women. She is also an author and musician. She released the book Life After Birth in 2021 and has performed music with her band DOMINO. In 2017, she released an album titled Beyond Waves with producer Mark Ronson. Penn Badgley and Domino Kirke’s relationship history Badgley and Kirke began dating in 2014 after meeting in a New York meatball shop. At the time, Kirke offered him a place to stay while he was couch surfing, though he declined. They kept in touch and soon started dating. They married in 2017 with two separate ceremonies and welcomed their first child together in 2020. Kirke also has a son from a previous relationship. In February 2025, they announced they were expecting spontaneous twins. Throughout their relationship, they have appeared at events together, supported each other’s creative work, and discussed the influence of faith and family on their personal and professional lives.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/04/MixCollage-23-Apr-2025-09-52-AM-478.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003e\u003ca href=\"https://www.comingsoon.net/tag/penn-badgley\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003ePenn Badgley\u003c/strong\u003e\u003c/a\u003e has sparked fresh interest in his personal life as fans revisit the actor’s long-standing relationship with his \u003cstrong\u003ewife\u003c/strong\u003e and their growing family. The You star, who quietly tied the knot in 2017 after several years of dating, recently revealed that he and his wife are expecting twins, further highlighting their enduring bond.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s a look at their marriage, her career path, and how their relationship has evolved over time.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-penn-badgley-married-to\"\u003eWho is Penn Badgley married to?\u003c/h2\u003e\n\n\n\n\u003cp\u003ePenn Badgley is married to Domino Kirke. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe couple legally wed on February 27, 2017, in a small civil ceremony in Brooklyn, followed by a larger celebration in June at her mother’s home in New York. They met in 2014 and were first seen publicly in July of that year. Badgley credited their shared Baha’i faith as a key foundation in their relationship and readiness for marriage.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-domino-kirke-s-job\"\u003eWhat is Domino Kirke’s job?\u003c/h2\u003e\n\n\n\n\u003cp\u003eDomino Kirke is a doula, reiki practitioner, and co-founder of Carriage House Birth, an organization offering services for pregnant women. She is also an author and musician.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe released the book Life After Birth in 2021 and has performed music with her band DOMINO. In 2017, she released an album titled Beyond Waves with producer Mark Ronson.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-penn-badgley-and-domino-kirke-s-relationship-history\"\u003ePenn Badgley and Domino Kirke’s relationship history\u003c/h2\u003e\n\n\n\n\u003cp\u003eBadgley and Kirke began dating in 2014 after meeting in a New York meatball shop. \u003c/p\u003e\n\n\n\n\u003cp\u003eAt the time, Kirke offered him a place to stay while he was couch surfing, though he declined. They kept in touch and soon started dating. They married in 2017 with two separate ceremonies and welcomed their first child together in 2020. Kirke also has a son from a previous relationship. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn February 2025, they \u003ca href=\"https://www.instagram.com/p/DGnnBLlOh_p/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eannounced\u003c/a\u003e they were expecting spontaneous twins. Throughout their relationship, they have appeared at events together, supported each other’s creative work, and discussed the influence of faith and family on their personal and professional lives.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-22T23:54:48Z",
  "modifiedTime": "2025-04-22T23:55:16Z"
}
