{
  "id": "71e85801-13b5-4557-81cb-58c2ea37a0b5",
  "title": "Samuel L. Jackson: People Say ‘It’s an Honor to Be Nominated’ for Oscars, but ‘No It Ain’t. It’s an Honor to Win. Most People Forget’ About Noms",
  "link": "https://variety.com/2024/film/news/samuel-l-jackson-disses-oscar-nominations-doesnt-matter-1236224089/",
  "description": "Samuel L Jackson said in a video interview with AP Entertainment, while promoting his role in Netflix’s “The Piano Teacher,” that Oscar nominations aren’t too big of a deal for him. Shockingly, Jackson has only earned one Oscar nomination during his illustrious career — for “Pulp Fiction,” which he landed a best supporting actor nod […]",
  "author": "Zack Sharf",
  "published": "Wed, 27 Nov 2024 00:24:33 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Oscars",
    "Samuel L. Jackson"
  ],
  "byline": "Zack Sharf",
  "length": 2570,
  "excerpt": "Samuel L. Jackson says being nominated for an Oscar is not an honor. Only winning is.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Samuel L Jackson said in a video interview with AP Entertainment, while promoting his role in Netflix’s “The Piano Teacher,” that Oscar nominations aren’t too big of a deal for him. Shockingly, Jackson has only earned one Oscar nomination during his illustrious career — for “Pulp Fiction,” which he landed a best supporting actor nod for in 1995. Jackson was awarded an honorary Academy Award in 2021. “We’ve been in the business long enough to know that when folks go, ‘It’s just an honor to be nominated.’ No it ain’t. It’s an honor to win,” Jackson said with a laugh. “You get nominated and folks go, ‘Yeah I remember that.’ Or most people forget. Generally it’s a contest you didn’t volunteer to be in. I didn’t go in there so I could flex. ‘Let me do my scene, so you can remember who I was.'” “They nominate you and people go, ‘What is that movie you’re nominated for? What’s the name of that thing?’ And after it’s over and people have a hard time remembering who even won,” Jackson added. Popular on Variety Jackson told The Times in 2022 that he deserved to win the 1995 Oscar for best supporting actor over Martin Landau (“Ed Wood”). In an interview with Vulture last year, he added that he was robbed of a second chance to win an Oscar when he didn’t even get nominated for Joel Schumacher’s 1996 legal drama “A Time to Kill.” The Oscars and Jackson have not gone hand-and-hand, which is fine considering he’d rather make billion dollar-grossing Marvel movies than chase down Oscar-friendly roles. “I was never going to let the Oscars be a measure of my success or failure as an actor,” Jackson told the Times. “My yardstick of success is my happiness: Am I satisfied with what I’m doing? I’m not doing statue-chasing movies. You know [whispers]: ‘If you do this movie, you’ll win an Oscar.’ No, thanks. I’d rather be Nick Fury. Or having fun being Mace Windu with a lightsaber in my hand.” Jackson said he’s fine with giving up Oscar roles if it means making movies “that people just want to see so they can get out of themselves,” adding, “That’s the guy I chose to be and I’m fine with it. I’m satisfied because that’s who I am. I’m the guy who does the lines that people see on T-shirts. There’s actors who go their whole careers and no one can quote a line they’ve said in a movie. People go to watch my movies to see how crazy I’m going to be or see how many times I say motherfucker. Whatever gets them in the seats.” “The Piano Teacher,” Jackson’s latest movie, is now streaming on Netflix.",
  "image": "https://variety.com/wp-content/uploads/2024/11/GettyImages-2180610285.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tSamuel L Jackson said in \u003ca rel=\"nofollow\" href=\"https://x.com/APEntertainment/status/1861518480924672096\" target=\"_blank\"\u003ea video interview with AP Entertainment\u003c/a\u003e, while promoting his role in Netflix’s “The Piano Teacher,” that Oscar nominations aren’t too big of a deal for him. Shockingly, Jackson has only earned one Oscar nomination during his illustrious career — for “Pulp Fiction,” which he landed a best supporting actor nod for in 1995. Jackson was awarded an honorary Academy Award in 2021.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“We’ve been in the business long enough to know that when folks go, ‘It’s just an honor to be nominated.’ No it ain’t. It’s an honor to win,” Jackson said with a laugh. “You get nominated and folks go, ‘Yeah I remember that.’ Or most people forget. Generally it’s a contest you didn’t volunteer to be in. I didn’t go in there so I could flex. ‘Let me do my scene, so you can remember who I was.\u0026#39;”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\t“They nominate you and people go, ‘What is that movie you’re nominated for? What’s the name of that thing?’ And after it’s over and people have a hard time remembering who even won,” Jackson added.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tJackson told \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.thetimes.co.uk/article/a0b747ce-93d8-11ec-addf-533e9597e348?shareToken=dedb88950d5d30c04a50a3c922c25b1f\"\u003eThe Times\u003c/a\u003e in 2022 that he deserved to win the 1995 Oscar for best supporting actor over Martin Landau (“Ed Wood”). In an \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://www.vulture.com/article/samuel-l-jackson-in-conversation.html\"\u003einterview with Vulture\u003c/a\u003e last year, he added that he was robbed of a second chance to win an Oscar when he didn’t even get nominated for Joel Schumacher’s 1996 legal drama “A Time to Kill.” The \u003ca href=\"https://variety.com/t/oscars/\" id=\"auto-tag_oscars\" data-tag=\"oscars\"\u003eOscars\u003c/a\u003e and Jackson have not gone hand-and-hand, which is fine considering he’d rather make billion dollar-grossing Marvel movies than chase down Oscar-friendly roles.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I was never going to let the Oscars be a measure of my success or failure as an actor,” Jackson told the Times. “My yardstick of success is my happiness: Am I satisfied with what I’m doing? I’m not doing statue-chasing movies. You know [whispers]: ‘If you do this movie, you’ll win an Oscar.’ No, thanks. I’d rather be Nick Fury. Or having fun being Mace Windu with a lightsaber in my hand.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tJackson said he’s fine with giving up Oscar roles if it means making movies “that people just want to see so they can get out of themselves,” adding, “That’s the guy I chose to be and I’m fine with it. I’m satisfied because that’s who I am. I’m the guy who does the lines that people see on T-shirts. There’s actors who go their whole careers and no one can quote a line they’ve said in a movie. People go to watch my movies to see how crazy I’m going to be or see how many times I say motherfucker. Whatever gets them in the seats.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“The Piano Teacher,” Jackson’s latest movie, is now streaming on Netflix.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-27T00:24:33Z",
  "modifiedTime": "2024-11-27T00:51:44Z"
}
