{
  "id": "84a70ce5-0ea5-4778-aa48-bef802914949",
  "title": "‘We Bury the Dead’ Review: Daisy Ridley Leads an Australian Disaster Flick Stuck in Zombie Movie Purgatory",
  "link": "https://variety.com/2025/film/reviews/we-bury-the-dead-review-daisy-ridley-zombie-1236333871/",
  "description": "Zak Hilditch’s Australian disaster feature “We Bury the Dead” wrestles with how much it wants to be a zombie movie. It’s at its most interesting and exciting when it approaches the well-worn subgenre with brand-new spins, resulting in haunting scenes that open a cinematic window into the darkest, most mysterious parts of the human condition. […]",
  "author": "Siddhant Adlakha",
  "published": "Wed, 12 Mar 2025 00:45:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Reviews",
    "Daisy Ridley",
    "SXSW",
    "We Bury the Dead",
    "Zach Hilditch"
  ],
  "byline": "Siddhant Adlakha",
  "length": 4707,
  "excerpt": "Daisy Ridley leads 'We Bury the Dead,' a horror film that swerves back and forth between traditional and novel.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Zak Hilditch’s Australian disaster feature “We Bury the Dead” wrestles with how much it wants to be a zombie movie. It’s at its most interesting and exciting when it approaches the well-worn subgenre with brand-new spins, resulting in haunting scenes that open a cinematic window into the darkest, most mysterious parts of the human condition. Unfortunately, it keeps swerving back toward traditional horror territory at breakneck speed, resulting in a lopsided structure and half-baked philosophical musings clashing against riveting dramatic moments. Making use of its minimal budget, “We Bury the Dead” creates an immediate sense of scale and spectacle, starting with its central premise, in which the United States accidentally deploys an experimental weapon of mass destruction off Australia’s southern coast. The large-scale EMP has caused up to half a million people to drop dead by shutting down their brains — only for reasons unknown, some of them come“back online,” devoid of any personality, but with their base instincts intact. A complicated, army-led body retrieval mission ensues, for which an American woman, Ava Newman (Daisy Ridley), travels to Tasmania in the hopes of finding her visiting husband Mitch (Matt Whelan), or whatever version of him that may have survived. Paired up with brusque, wild-haired local Clay (Brenton Thwaites), Ava is responsible for collecting people’s week-old corpses from their homes and alerting nearby soldiers if any of them show signs of life. The first time she comes across one such body — a man standing completely still, whose vacant stare captures her gaze — the film dips its toe into intriguing territory. Rather than probing these people for signs of intelligence or memory, the Australian army simply dispenses with them with bureaucratic cruelty: via a bullet to the brain. However, with so little known about their condition (and thus, little known about the state in which she might find her husband), the eyes of “the zombies” become eerily alluring, as the camera remains transfixed by Ridley’s fear and curiosity. However, before the film can really approach this conundrum of where consciousness ends and death begins, the dead begin walking, and eventually biting, which marks a disappointing departure from the movie’s seemingly novel approach to the undead. However, even this traditional turn feels incomplete. As Ava absconds south with the help of the hedonistic Clay, past military checkpoints towards the resort where her husband was last seen, the unlikely duo avoid “walkers” who try to bite them, a trope of the genre that has lasted decades thanks to the implicit understanding that a zombie bite contains a virus, or some such microbe, that will in turn “zombify” a living person. “We Bury the Dead” has no such mechanism, and never portrays an example of the kind of carnage Ava and Clay might be trying to escape, so its horror elements usually fall flat. However, even in its most awkward turns, the movie finds moments of genuine pathos. At one point, the duo is joined by a lost soldier, Riley (Mark Coles Smith), a seemingly decent man overcome not just by grief, but by a lack of closure — the very thing Ava seeks. Smith turns in an incredibly twisted, emotionally wrenching performance, and watching Riley’s terrifying predicament up close instills a further sense of emotional mystery about what may lie at the end of Ava’s journey. Unfortunately, it’s only through reflections such as these, found in other people — both living and dead — that we get to know Ava at all. Picking through the debris of people’s domestic lives becomes an opportunity to reflect on the life she could have had (certainly more than the movie’s actual flashbacks do, which remain mostly vague about the drama plaguing her and Mitch). Ridley also struggles with her American accent at times, which isn’t a problem in and of itself — accents come in all shapes and sizes — but it results in her keeping most of her words, and thus her emotions, strangely withheld, as though all her efforts were going into sounding credible. She’s at her best when Ava isn’t speaking at all, allowing the character’s lingering desperation to emerge from behind her eyes. The movie’s strongest moments leave a mark, even though they’re few and far between, though stand out in large part due to Chris Clark’s echoing score, which practically functions like a voiceover track during silent moments. Its strengths also ensure that no matter how rote “We Bury the Dead” becomes, it remains at least watchable for most of its runtime, even as it ignores its most fascinating ideas in favor of safe, familiar ones.",
  "image": "https://variety.com/wp-content/uploads/2025/03/we-bury-the-dead.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tZak Hilditch’s Australian disaster feature “\u003ca href=\"https://variety.com/t/we-bury-the-dead/\" id=\"auto-tag_we-bury-the-dead\" data-tag=\"we-bury-the-dead\"\u003eWe Bury the Dead\u003c/a\u003e” wrestles with how much it wants to be a zombie movie. It’s at its most interesting and exciting when it approaches the well-worn subgenre with brand-new spins, resulting in haunting scenes that open a cinematic window into the darkest, most mysterious parts of the human condition. Unfortunately, it keeps swerving back toward traditional horror territory at breakneck speed, resulting in a lopsided structure and half-baked philosophical musings clashing against riveting dramatic moments.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMaking use of its minimal budget, “We Bury the Dead” creates an immediate sense of scale and spectacle, starting with its central premise, in which the United States accidentally deploys an experimental weapon of mass destruction off Australia’s southern coast. The large-scale EMP has caused up to half a million people to drop dead by shutting down their brains — only for reasons unknown, some of them come“back online,” devoid of any personality, but with their base instincts intact.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tA complicated, army-led body retrieval mission ensues, for which an American woman, Ava Newman (\u003ca href=\"https://variety.com/t/daisy-ridley/\" id=\"auto-tag_daisy-ridley\" data-tag=\"daisy-ridley\"\u003eDaisy Ridley\u003c/a\u003e), travels to Tasmania in the hopes of finding her visiting husband Mitch (Matt Whelan), or whatever version of him that may have survived. Paired up with brusque, wild-haired local Clay (Brenton Thwaites), Ava is responsible for collecting people’s week-old corpses from their homes and alerting nearby soldiers if any of them show signs of life.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe first time she comes across one such body — a man standing completely still, whose vacant stare captures her gaze — the film dips its toe into intriguing territory. Rather than probing these people for signs of intelligence or memory, the Australian army simply dispenses with them with bureaucratic cruelty: via a bullet to the brain. However, with so little known about their condition (and thus, little known about the state in which she might find her husband), the eyes of “the zombies” become eerily alluring, as the camera remains transfixed by Ridley’s fear and curiosity.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHowever, before the film can really approach this conundrum of where consciousness ends and death begins, the dead begin walking, and eventually biting, which marks a disappointing departure from the movie’s seemingly novel approach to the undead. However, even this traditional turn feels incomplete. As Ava absconds south with the help of the hedonistic Clay, past military checkpoints towards the resort where her husband was last seen, the unlikely duo avoid “walkers” who try to bite them, a trope of the genre that has lasted decades thanks to the implicit understanding that a zombie bite contains a virus, or some such microbe, that will in turn “zombify” a living person. “We Bury the Dead” has no such mechanism, and never portrays an example of the kind of carnage Ava and Clay might be trying to escape, so its horror elements usually fall flat.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tHowever, even in its most awkward turns, the movie finds moments of genuine pathos. At one point, the duo is joined by a lost soldier, Riley (Mark Coles Smith), a seemingly decent man overcome not just by grief, but by a lack of closure — the very thing Ava seeks. Smith turns in an incredibly twisted, emotionally wrenching performance, and watching Riley’s terrifying predicament up close instills a further sense of emotional mystery about what may lie at the end of Ava’s journey.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tUnfortunately, it’s only through reflections such as these, found in other people — both living and dead — that we get to know Ava at all. Picking through the debris of people’s domestic lives becomes an opportunity to reflect on the life she could have had (certainly more than the movie’s actual flashbacks do, which remain mostly vague about the drama plaguing her and Mitch). Ridley also struggles with her American accent at times, which isn’t a problem in and of itself — accents come in all shapes and sizes — but it results in her keeping most of her words, and thus her emotions, strangely withheld, as though all her efforts were going into sounding credible. She’s at her best when Ava isn’t speaking at all, allowing the character’s lingering desperation to emerge from behind her eyes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe movie’s strongest moments leave a mark, even though they’re few and far between, though stand out in large part due to Chris Clark’s echoing score, which practically functions like a voiceover track during silent moments. Its strengths also ensure that no matter how rote “We Bury the Dead” becomes, it remains at least watchable for most of its runtime, even as it ignores its most fascinating ideas in favor of safe, familiar ones.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-12T00:45:00Z",
  "modifiedTime": "2025-03-12T00:29:03Z"
}
