{
  "id": "8616024f-3fda-4f7a-8b88-a9bf21d888fd",
  "title": "It: Welcome to Derry Mini-Teaser Finds Time to Dial Up The Creepiness",
  "link": "https://bleedingcool.com/tv/it-welcome-to-derry-mini-teaser-finds-time-to-dial-up-the-creepiness/",
  "description": "A new mini-teaser for filmmakers Andy Muschietti \u0026 Barbara Muschietti and Jason Fuchs' It: Welcome to Derry dials up the creepiness factor.",
  "author": "Ray Flook",
  "published": "Sat, 24 May 2025 19:37:07 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "HBO",
    "Movies",
    "TV",
    "it: welcome to derry",
    "welcome to derry"
  ],
  "byline": "Ray Flook",
  "length": 5450,
  "excerpt": "Earlier this month, we were treated to our best look yet at filmmakers Andy Muschietti and Barbara Muschietti (It, It Chapter Two) and Jason Fuchs' (It Chapter Two, Wonder Woman) It: Welcome to Derry. Set in the world of Stephen King's It, the HBO series is based on the bestselling author's novel and expands the vision […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: HBO, Movies, TV | Tagged: it: welcome to derry, welcome to derryA new mini-teaser for filmmakers Andy Muschietti \u0026 Barbara Muschietti and Jason Fuchs' It: Welcome to Derry dials up the creepiness factor. Earlier this month, we were treated to our best look yet at filmmakers Andy Muschietti and Barbara Muschietti (It, It Chapter Two) and Jason Fuchs' (It Chapter Two, Wonder Woman) It: Welcome to Derry. Set in the world of Stephen King's It, the HBO series is based on the bestselling author's novel and expands the vision established by Andy Muschietti in the feature films It and It Chapter Two. Along with an official teaser (which we have waiting for you above), we were also treated to a new image gallery that included our first look at Bill Skarsgard's Pennywise. Earlier today, a mini-teaser was released for the prequel series that offers a few quick new looks while finding a way to dial up the creepiness factor in a short period of time. Image: HBO Here's a look at the mini-teaser for HBO's It: Welcome to Derry, set to hit screens this fall: Thanks to an interview with Radio TU earlier this year, Andy Muschietti offered some very interesting insights into how the series will be structured from a storytelling standpoint—the most detailed insights we've gotten so far—including how the series is set to be \"told backward,\" with three seasons envisioned. \"It's a story that's based on the interludes of the book. The interludes are basically chapters that reflect Mike Hanlon's research. They're fragments of his research. For 27 years, it's the guy trying to figure out what it is, what did it, who did it, who saw it, and all that stuff,\" Andy Muschietti shared during his interview (which you can check out below). \"So they talk about catastrophic events from the past, like the fire in the Black Spot…. the massacre of the Bradley Gang, a gang of bank robbers in the '30s… and the explosion of the Kitchener Ironworks. Every time [Pennywise] comes out of hibernation, there is a catastrophic event that happens at the beginning of that cycle.\" He added, \"There's a reason why the story is told backwards. So the first season is 1962, the second season is 1935, and the third season is 1908.\" It: Welcome to Derry No \"G-Rated Pennywise\": Skarsgard While promoting his hit film Nosferatu, Bill Skarsgard checked in with Josh Horowitz for Horowitz's Happy Sad Confused podcast – and that's when we were treated to some interesting insights into what led to his return to the role and what viewers can expect. With the conversation shifting to It: Welcome to Derry beginning at the 24:22 mark, Skarsgard shared with Horowitz that he felt that he had pretty much said what he needed to say about the character. Having filmed Nosferatu, Skarsgard viewed Nosferatu as \"the nail in the coffin on my monster rolls – pun intended.\" But his personal and professional bond with Andy Muschietti and Barbara Muschietti (\"they're very close friends, family\") would be the key to him considering another run as Pennywise. \"It was fun. I enjoyed it more than I thought I would, actually, and there's parts of it where we got to explore sides um of old Pennywise that we haven't seen, you know? And that's fun,\" Skarsgard shared about working on the spinoff series. \"I remembered how much I enjoy working with Andy and we do have a lot of fun together. I think there's some cool stuff in there that we haven't seen that I'm excited for you, the people, to watch and enjoy hopefully.\" In terms of the level of horror and intensity, Horowitz followed up by asking if he was able to \"go as far on television as you did in the films\" – with Skarsgard offering a very promising response. \"It's pretty hardcore, man. It's not the G-rated Pennywise. No, that would be a no; that would be a no,\" Skarsgard made clear, adding that it didn't take much for him to slip back into Pennywise's voice (\"Yeah, he's there. He's just waiting.\"). The streaming prequel series stars Taylour Paige (Beverly Hills Cop: Axel Foley), Jovan Adepo (Watchmen), Chris Chalk (Perry Mason), and James Remar (Oppenheimer). In addition, Alixandra Fuchs (Hatfields \u0026 McCoys), Kimberly Guerrero (The English), Dorian Grey (Star Trek: Discovery), Thomas Mitchell (Spiral), BJ Harrison (Family Law), Peter Outerbridge (Batwoman), Shane Marriott (Fargo), Chad Rook (Joe Pickett), Joshua Odjick (Little Bird) and Morningstar Angeline (Echo) have been tapped for recurring roles. In addition, Bill Skarsgard is reprising his role as the demonic clown Pennywise. HBO's It: Welcome to Derry is produced by HBO Max and Warner Bros. Television. Fuchs will write the teleplay for the first episode, based on a story by Andy Muschietti, Barbara Muschietti, and Fuchs. Fuchs and Brad Caleb Kane will serve as co-showrunners on the project. Andy Muschietti and Barbara Muschietti (through their Double Dream production company, which has an overall deal with Warner Bros Television), Fuchs, Kane, and Skarsgård are executive producers. Andy Muschietti will direct four episodes of the series, including the first one. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Ray FlookServing as Television Editor since 2018, Ray began five years earlier as a contributing writer/photographer before being brought onto the core BC team in 2017.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/05/it-welcome-to-derry_5-2-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2226738\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/tv/hbo/\" rel=\"category\"\u003eHBO\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tv/\" rel=\"category\"\u003eTV\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/it-welcome-to-derry/\" rel=\"tag\"\u003eit: welcome to derry\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/welcome-to-derry/\" rel=\"tag\"\u003ewelcome to derry\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eA new mini-teaser for filmmakers Andy Muschietti \u0026amp; Barbara Muschietti and Jason Fuchs\u0026#39; It: Welcome to Derry dials up the creepiness factor.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/6HG-wsRsg8s?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/6HG-wsRsg8s/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/6HG-wsRsg8s?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eEarlier this month, we were treated to our best look yet at filmmakers \u003cstrong\u003eAndy Muschietti\u003c/strong\u003e and \u003cstrong\u003eBarbara Muschietti\u003c/strong\u003e (\u003cem\u003eIt, It Chapter Two\u003c/em\u003e) and \u003cstrong\u003eJason Fuchs\u003c/strong\u003e\u0026#39; (\u003cem\u003eIt Chapter Two, Wonder Woman\u003c/em\u003e) \u003cem\u003eIt: Welcome to Derry\u003c/em\u003e. Set in the world of \u003cstrong\u003eStephen King\u003c/strong\u003e\u0026#39;s \u003cem\u003eIt\u003c/em\u003e, the HBO series is based on the bestselling author\u0026#39;s novel and expands the vision established by Andy Muschietti in the feature films \u003cem\u003eIt\u003c/em\u003e and \u003cem\u003eIt Chapter Two\u003c/em\u003e. Along with an official teaser (which we have waiting for you above), we were also treated to a new image gallery that included our first look at \u003cstrong\u003eBill Skarsgard\u003c/strong\u003e\u0026#39;s Pennywise. Earlier today, a mini-teaser was released for the prequel series that offers a few quick new looks while finding a way to dial up the creepiness factor in a short period of time.\u003c/p\u003e\n\u003cfigure id=\"attachment_2226756\" aria-describedby=\"caption-attachment-2226756\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/it-welcome-to-derry_5-2.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/it-welcome-to-derry_5-2.jpg\" alt=\"It: Welcome to Derry\" width=\"600\" height=\"400\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2025/05/it-welcome-to-derry_5-2.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20400%22%20width%3D%22600%22%20height%3D%22400%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2226756\"\u003eImage: HBO\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eHere\u0026#39;s a look at the mini-teaser for HBO\u0026#39;s It: Welcome to Derry, set to hit screens this fall:\u003c/p\u003e\n\n\n\u003cp\u003eThanks to an interview with \u003ca href=\"https://www.youtube.com/@RadioTU\"\u003eRadio TU\u003c/a\u003e earlier this year, Andy Muschietti offered some very interesting insights into how the series will be structured from a storytelling standpoint—the most detailed insights we\u0026#39;ve gotten so far—including how the series is set to be \u0026#34;told backward,\u0026#34; with three seasons envisioned. \u0026#34;It\u0026#39;s a story that\u0026#39;s based on the interludes of the book. The interludes are basically chapters that reflect Mike Hanlon\u0026#39;s research. They\u0026#39;re fragments of his research. For 27 years, it\u0026#39;s the guy trying to figure out what it is, what did it, who did it, who saw it, and all that stuff,\u0026#34; Andy Muschietti shared during his interview (which you can check out below).\u003c/p\u003e\n\u003cp\u003e\u0026#34;So they talk about catastrophic events from the past, like the fire in the Black Spot…. the massacre of the Bradley Gang, a gang of bank robbers in the \u0026#39;30s… and the explosion of the Kitchener Ironworks. Every time [Pennywise] comes out of hibernation, there is a catastrophic event that happens at the beginning of that cycle.\u0026#34; He added, \u0026#34;There\u0026#39;s a reason why the story is told backwards. So the first season is 1962, the second season is 1935, and the third season is 1908.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/Tugk5mzMHqM?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/Tugk5mzMHqM/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/Tugk5mzMHqM?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003ch2\u003eIt: Welcome to Derry No \u0026#34;G-Rated Pennywise\u0026#34;: Skarsgard\u003c/h2\u003e\n\u003cp\u003eWhile promoting his hit film Nosferatu, \u003cstrong\u003eBill Skarsgard\u003c/strong\u003e checked in with \u003cstrong\u003eJosh Horowitz\u003c/strong\u003e for Horowitz\u0026#39;s \u003cem\u003eHappy Sad Confused\u003c/em\u003e podcast – and that\u0026#39;s when we were treated to some interesting insights into what led to his return to the role and what viewers can expect. With the conversation shifting to \u003cem\u003eIt: Welcome to Derry\u003c/em\u003e beginning at the 24:22 mark, Skarsgard shared with Horowitz that he felt that he had pretty much said what he needed to say about the character. Having filmed Nosferatu, Skarsgard viewed Nosferatu as \u0026#34;the nail in the coffin on my monster rolls – pun intended.\u0026#34; But his personal and professional bond with Andy Muschietti and Barbara Muschietti (\u0026#34;they\u0026#39;re very close friends, family\u0026#34;) would be the key to him considering another run as Pennywise.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It was fun. I enjoyed it more than I thought I would, actually, and there\u0026#39;s parts of it where we got to explore sides um of old Pennywise that we haven\u0026#39;t seen, you know? And that\u0026#39;s fun,\u0026#34; Skarsgard shared about working on the spinoff series. \u0026#34;I remembered how much I enjoy working with Andy and we do have a lot of fun together. I think there\u0026#39;s some cool stuff in there that we haven\u0026#39;t seen that I\u0026#39;m excited for you, the people, to watch and enjoy hopefully.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn terms of the level of horror and intensity, Horowitz followed up by asking if he was able to \u0026#34;go as far on television as you did in the films\u0026#34; – with Skarsgard offering a very promising response. \u0026#34;It\u0026#39;s pretty hardcore, man. It\u0026#39;s not the G-rated Pennywise. No, that would be a no; that would be a no,\u0026#34; Skarsgard made clear, adding that it didn\u0026#39;t take much for him to slip back into Pennywise\u0026#39;s voice (\u0026#34;Yeah, he\u0026#39;s there. He\u0026#39;s just waiting.\u0026#34;).\u003c/p\u003e\n\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/rSURMzAAAGY?start=58\u0026amp;feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/rSURMzAAAGY/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/rSURMzAAAGY?start=58\u0026amp;feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThe streaming prequel series stars \u003cstrong\u003eTaylour Paige\u003c/strong\u003e (\u003cem\u003eBeverly Hills Cop: Axel Foley\u003c/em\u003e), \u003cstrong\u003eJovan Adepo\u003c/strong\u003e (\u003cem\u003eWatchmen\u003c/em\u003e), \u003cstrong\u003eChris Chalk\u003c/strong\u003e (\u003cem\u003ePerry Mason\u003c/em\u003e), and \u003cstrong\u003eJames Remar\u003c/strong\u003e (\u003cem\u003eOppenheimer\u003c/em\u003e). In addition, \u003cstrong\u003eAlixandra Fuchs\u003c/strong\u003e (\u003cem\u003eHatfields \u0026amp; McCoys\u003c/em\u003e), \u003cstrong\u003eKimberly Guerrero\u003c/strong\u003e (\u003cem\u003eThe English\u003c/em\u003e), \u003cstrong\u003eDorian Grey\u003c/strong\u003e (\u003cem\u003eStar Trek: Discovery)\u003c/em\u003e, \u003cstrong\u003eThomas Mitchell\u003c/strong\u003e (\u003cem\u003eSpiral\u003c/em\u003e), \u003cstrong\u003eBJ Harrison\u003c/strong\u003e (\u003cem\u003eFamily Law\u003c/em\u003e), \u003cstrong\u003ePeter Outerbridge\u003c/strong\u003e (\u003cem\u003eBatwoman)\u003c/em\u003e, \u003cstrong\u003eShane Marriott\u003c/strong\u003e (\u003cem\u003eFargo)\u003c/em\u003e,\u003cstrong\u003e Chad Rook\u003c/strong\u003e (\u003cem\u003eJoe Pickett\u003c/em\u003e), \u003cstrong\u003eJoshua Odjick\u003c/strong\u003e \u003cem\u003e(Little Bird)\u003c/em\u003e and \u003cstrong\u003eMorningstar Angeline \u003c/strong\u003e(\u003cem\u003eEcho)\u003c/em\u003e have been tapped for recurring roles. In addition, \u003cstrong\u003eBill Skarsgard\u003c/strong\u003e is reprising his role as the demonic clown Pennywise.\u003c/p\u003e\n\u003cp\u003eHBO\u0026#39;s \u003cem\u003eIt: Welcome to Derry\u003c/em\u003e is produced by HBO Max and Warner Bros. Television. Fuchs will write the teleplay for the first episode, based on a story by Andy Muschietti, Barbara Muschietti, and Fuchs. Fuchs and \u003cstrong\u003eBrad Caleb Kane\u003c/strong\u003e will serve as co-showrunners on the project. Andy Muschietti and Barbara Muschietti (through their Double Dream production company, which has an overall deal with Warner Bros Television), Fuchs, Kane, and Skarsgård are executive producers. Andy Muschietti will direct four episodes of the series, including the first \u003ca href=\"https://www.youtube.com/@hbomax\"\u003eone.\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fit-welcome-to-derry-mini-teaser-finds-time-to-dial-up-the-creepiness%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fit-welcome-to-derry-mini-teaser-finds-time-to-dial-up-the-creepiness%2F\u0026amp;text=It%3A+Welcome+to+Derry+Mini-Teaser+Finds+Time+to+Dial+Up+The+Creepiness\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fit-welcome-to-derry-mini-teaser-finds-time-to-dial-up-the-creepiness%2F\u0026amp;description=It%3A+Welcome+to+Derry+Mini-Teaser+Finds+Time+to+Dial+Up+The+Creepiness\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Ftv%2Fit-welcome-to-derry-mini-teaser-finds-time-to-dial-up-the-creepiness%2F\u0026amp;title=It%3A+Welcome+to+Derry+Mini-Teaser+Finds+Time+to+Dial+Up+The+Creepiness\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/a3529c51bc537c86cabf26ebb7f93e82?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Ray Flook\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/rflook/\"\u003eRay Flook\u003c/a\u003e\u003c/h2\u003eServing as Television Editor since 2018, Ray began five years earlier as a contributing writer/photographer before being brought onto the core BC team in 2017.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-24T19:37:07-05:00",
  "modifiedTime": "2025-05-24T19:37:07-05:00"
}
