{
  "id": "8691f16b-7613-4a2e-9911-9d27078cd4ca",
  "title": "How Joy Woods Became a ‘Gypsy’ Superfan",
  "link": "https://variety.com/2024/legit/podcasts/joy-woods-gypsy-broadway-audra-mcdonald-1236259216/",
  "description": "The actor Joy Woods never thought much about “Gypsy” — at least not until she was cast in the show opposite Audra McDonald in one of the buzziest Broadway revivals of the season. Listen to this week’s “Stagecraft” podcast below: “You see all the iterations of the show and you don’t see anybody that looks like you, […]",
  "author": "Gordon Cox",
  "published": "Tue, 24 Dec 2024 20:28:11 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "News",
    "Podcasts",
    "Audra Mcdonald",
    "Gypsy",
    "Joy Woods",
    "Stagecraft"
  ],
  "byline": "Gordon Cox",
  "length": 2728,
  "excerpt": "On the Stagecraft podcast, Joy Woods talks about how she became a superfan of \"Gypsy\" and what it's like to work opposite Audra McDonald.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "The actor Joy Woods never thought much about “Gypsy” — at least not until she was cast in the show opposite Audra McDonald in one of the buzziest Broadway revivals of the season. Listen to this week’s “Stagecraft” podcast below: “You see all the iterations of the show and you don’t see anybody that looks like you, and so I disregarded it as something that I will be so excited to see when it comes back, but I’ll never be a part of,” Woods said on the new episode of “Stagecraft,” Variety‘s theater podcast. But now, after working on the show in a new production that she wryly calls “#BlackGypsy”? “I’m a superfan now.” Popular on Variety Woods has been a fast-rising stage star ever since her New York debut (at 19 years old) in the current Off Broadway revival of “Little Shop of Horrors.” Now, after Broadway roles in “Six” and “The Notebook” — and a viral moment spawned by her performance of the song “My Days” from “The Notebook” — Woods is stepping up to her highest-profile gig yet in “Gypsy.” “The root of the story is people trying to make a living and make things work in a time where what they long for is dying,” she said of the legendary 1959 musical, about an ambitious stage mother, Rose (McDonald), trying to make her daughters into vaudeville stars just as vaudeville’s popularity has begun to fade. Woods plays Rose’s daughter Louise, the young woman who would go on to become the real-life burlesque star Gypsy Rose Lee. Woods described the story as “so much truth hitting you in the face over and over again.” It’s a production “told through an African American lens,” she added, but to her mind, many of the staging choices made to reflect those nuances are only recognized by Black audience members. “A lot of it is Easter-egged [for Black theatergoers], because so much of the experience is universal,” she explained. She’s especially pleased that the production “has brought in such a large wave of new audiences, between kids that have never known about ‘Gypsy’ plus another demographic of people that have never cared about ‘Gypsy’ because they never saw themselves in it before,” she said. “That’s important to think about.” Also on the new “Stagecraft,” Woods talked about the thrill of working closely with McDonald, one of Broadway’s most beloved and award-winning stars, as well as learning to enjoy a strip-tease and getting her six-second costume change just right. To hear the entire conversation, listen at the link above or download and subscribe to “Stagecraft” on podcast platforms including Apple Podcasts, Spotify and the Broadway Podcast Network. New episodes of “Stagecraft” are released every other week.",
  "image": "https://variety.com/wp-content/uploads/2024/12/GYPSY-Joy-Woods-Photo-by-Julieta-Cervantes-1.jpg?crop=0px%2C95px%2C1800px%2C1012px\u0026resize=1000%2C563",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe actor \u003ca href=\"https://variety.com/t/joy-woods/\" id=\"auto-tag_joy-woods\" data-tag=\"joy-woods\"\u003eJoy Woods\u003c/a\u003e never thought much about “\u003ca href=\"https://variety.com/t/gypsy/\" id=\"auto-tag_gypsy\" data-tag=\"gypsy\"\u003eGypsy\u003c/a\u003e” — at least not until she was cast in the show opposite \u003ca href=\"https://variety.com/t/audra-mcdonald/\" id=\"auto-tag_audra-mcdonald\" data-tag=\"audra-mcdonald\"\u003eAudra McDonald\u003c/a\u003e in \u003ca href=\"https://variety.com/2024/legit/reviews/gypsy-review-broadway-audra-mcdonald-1236255433/\"\u003eone of the buzziest Broadway revivals\u003c/a\u003e of the season.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cstrong\u003e\u003cem\u003eListen to this week’s “\u003ca href=\"https://variety.com/t/stagecraft/\"\u003eStagecraft\u003c/a\u003e” podcast below:\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t“You see all the iterations of the show and you don’t see anybody that looks like you, and so I disregarded it as something that I will be so excited to see when it comes back, but I’ll never be a part of,” Woods said on the new episode of “Stagecraft,” \u003cem\u003eVariety\u003c/em\u003e‘s theater podcast.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut now, after working on the show in a new production that she wryly calls “#BlackGypsy”? “I’m a superfan now.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tWoods has been a fast-rising stage star ever since her New York debut (at 19 years old) in the current Off Broadway revival of “Little Shop of Horrors.” Now, after Broadway roles in “Six” and “The Notebook” — and a viral moment spawned by her performance of the song “My Days” from “The Notebook” — Woods is stepping up to her highest-profile gig yet in “Gypsy.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t“The root of the story is people trying to make a living and make things work in a time where what they long for is dying,” she said of the legendary 1959 musical, about an ambitious stage mother, Rose (McDonald), trying to make her daughters into vaudeville stars just as vaudeville’s popularity has begun to fade. Woods plays Rose’s daughter Louise, the young woman who would go on to become the real-life burlesque star Gypsy Rose Lee.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWoods described the story as “so much truth hitting you in the face over and over again.” It’s a production “told through an African American lens,” she added, but to her mind, many of the staging choices made to reflect those nuances are only recognized by Black audience members. “A lot of it is Easter-egged [for Black theatergoers], because so much of the experience is universal,” she explained.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tShe’s especially pleased that the production “has brought in such a large wave of new audiences, between kids that have never known about ‘Gypsy’ plus another demographic of people that have never cared about ‘Gypsy’ because they never saw themselves in it before,” she said. “That’s important to think about.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAlso on the new “Stagecraft,” Woods talked about the thrill of working closely with McDonald, one of Broadway’s most beloved and award-winning stars, as well as learning to enjoy a strip-tease and getting her six-second costume change just right.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t\u003cem\u003e\u003cstrong\u003eTo hear the entire conversation, listen at the link above or download and subscribe to “Stagecraft” on podcast platforms including \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://podcasts.apple.com/us/podcast/stagecraft-with-gordon-cox/id1292716686?mt=2\"\u003eApple Podcasts\u003c/a\u003e, \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://open.spotify.com/show/1bPoJpNc5ITlMvouP2KmoC?si=jCaz0eFJTquY8E7jdE_KoQ\"\u003eSpotify\u003c/a\u003e and the \u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://broadwaypodcastnetwork.com/podcast/varietys-stagecraft/\"\u003eBroadway Podcast Network\u003c/a\u003e. \u003c/strong\u003e\u003c/em\u003e\u003cstrong\u003e\u003cem\u003eNew episodes of “Stagecraft” are released every other week.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-24T20:28:11Z",
  "modifiedTime": "2024-12-24T20:28:20Z"
}
