{
  "id": "894c609f-c949-49fd-8ede-141f43c064c9",
  "title": "‘Flophouse America’ Review: A Profoundly Realistic Portrait of a Preteen Living in Abject Poverty",
  "link": "https://variety.com/2025/film/reviews/flophouse-america-review-1236351878/",
  "description": "Director Monica Strømdahl’s “Flophouse America” provides a visceral documentation of poverty in America. Flophouses are cheap, run-down motels where many people are forced to live when they cannot afford better housing. For her feature documentary debut, Strømdahl spent many years touring such places in America and taking photos of their inhabitants. Then she met Mikal, […]",
  "author": "Peter Debruge",
  "published": "Sun, 30 Mar 2025 00:04:16 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Reviews",
    "CPH:DOX",
    "Flophouse America"
  ],
  "byline": "Murtada Elfadl",
  "length": 4358,
  "excerpt": "Norwegian filmmaker Monica Strømdahl’s debut documentary shows a side of America about which many remain unaware.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Director Monica Strømdahl’s “Flophouse America” provides a visceral documentation of poverty in America. Flophouses are cheap, run-down motels where many people are forced to live when they cannot afford better housing. For her feature documentary debut, Strømdahl spent many years touring such places in America and taking photos of their inhabitants. Then she met Mikal, whose story she tells in “Flophouse America,” and decided stills were not enough. Since he was underage while the footage was being shot, the filmmakers waited for him to become an adult to get his consent to share his story. The director’s insistence on no-frills digital photography adds to the grittiness of the images, rendering them profoundly real. As the film opens, a matter-of-fact, unemotional voice shares statistics about children living with poverty, parental abuse and alcoholism in the United States, as the numbers flash in simple white text on a black screen. Then a young man appears in front of a microphone, saying, “I am one of them.” Filmed over a three-year period starting when he was 11, Mikal is shown living in one room with his parents and a cat. They sleep on the bed, while he takes the couch, separated by a flimsy curtain. The bathroom doubles as a kitchen, the tub full of dirty dishes. Strømdahl’s camera captures the stifling proximity in which this family lives, the frame always close to the faces of the three protagonists and to the encroaching walls of the tiny space. Even the fur shed by the cat seems to take up too much space. Popular on Variety The film creates drama out of everyday casual events. Early on, a lot of fuss is made about the prospect of buying new shoes for Mikal. His mother, Tonya, keeps talking about a trip to the mall. She promises Mikal it’ll happen once his father, Jason, comes back from work. Mikal responds only monosyllabically, his disinterest showing his skepticism. Unsurprisingly, Jason shows up late, having instead spent the day drinking in a bar. The camera lingers on Mikal, capturing his disappointment, while making it abundantly clear the same situation has happened before and will continue to repeat itself. When Tonya and Jason start a loud fight, hurling insults at each other in front of Mikal, we feel the claustrophobia and Mikal’s inability to escape. These arguments are a constant in the film. Mikal, Tonya and Jason are vicious, screaming and hurling vile truths at one another. Mikal is failing in school. Tonya drinks too much and is blacked out most of the time. Jason goes to work and comes back exhausted to join Tonya’s drinking binges. Cigarette smoke fills the small space. None of them can make any move without the other two being aware of it, adding to the tension. At the center of the film is Mikal’s relationship with his mother, while Jason is more a peripheral figure, an ineffectual referee between two warring parties, managing to negotiate only temporary truces. When Mikal begs his parents to stop drinking because he might be losing his sanity, the lens palpably captures his pain. He expresses his frustrations very clearly to his parents, finding words beyond his young years. Strømdahl has astute framing, using natural light (coming from blinding fluorescent motel light bulbs) and static long shots that allow for the action to unfold without interruption. When tragedy strikes — and how could it not — the filmmaker remains discreetly and respectfully at a distance. While showing the pain, the camera felt probing and intrusive. When showing grief and loss, it opens up the small, stifling space. While we never hear or see Strømdahl, she is at once discreet and omnipresent. Some scenes are so raw, it’s hard to imagine a camera being present, let alone another person. Few conversations seem forced or false, including those where the adults try to literalize how they failed to accomplish the American dream. Though “Flophouse America” might be a hard sell outside the embracing environments of film festivals, it deserves a much wider audience. It’s an unvarnished and acutely realistic portrait of a topic which audiences, especially in the U.S., see much of. This is a film that shows what poverty can bring and that it lives in close proximity to many while most remain oblivious to it.",
  "image": "https://variety.com/wp-content/uploads/2025/03/Flophouse-America.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tDirector Monica Strømdahl’s “\u003ca href=\"https://variety.com/t/flophouse-america/\" id=\"auto-tag_flophouse-america\" data-tag=\"flophouse-america\"\u003eFlophouse America\u003c/a\u003e” provides a visceral documentation of poverty in America. Flophouses are cheap, run-down motels where many people are forced to live when they cannot afford better housing. For her feature documentary debut, Strømdahl spent many years touring such places in America and taking photos of their inhabitants. Then she met Mikal, whose story she tells in “Flophouse America,” and decided stills were not enough. Since he was underage while the footage was being shot, the filmmakers waited for him to become an adult to get his consent to share his story.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe director’s insistence on no-frills digital photography adds to the grittiness of the images, rendering them profoundly real. As the film opens, a matter-of-fact, unemotional voice shares statistics about children living with poverty, parental abuse and alcoholism in the United States, as the numbers flash in simple white text on a black screen. Then a young man appears in front of a microphone, saying, “I am one of them.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\u003cp\u003e\n\tFilmed over a three-year period starting when he was 11, Mikal is shown living in one room with his parents and a cat. They sleep on the bed, while he takes the couch, separated by a flimsy curtain. The bathroom doubles as a kitchen, the tub full of dirty dishes. Strømdahl’s camera captures the stifling proximity in which this family lives, the frame always close to the faces of the three protagonists and to the encroaching walls of the tiny space. Even the fur shed by the cat seems to take up too much space.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThe film creates drama out of everyday casual events. Early on, a lot of fuss is made about the prospect of buying new shoes for Mikal. His mother, Tonya, keeps talking about a trip to the mall. She promises Mikal it’ll happen once his father, Jason, comes back from work. Mikal responds only monosyllabically, his disinterest showing his skepticism. Unsurprisingly, Jason shows up late, having instead spent the day drinking in a bar. The camera lingers on Mikal, capturing his disappointment, while making it abundantly clear the same situation has happened before and will continue to repeat itself.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen Tonya and Jason start a loud fight, hurling insults at each other in front of Mikal, we feel the claustrophobia and Mikal’s inability to escape. These arguments are a constant in the film. Mikal, Tonya and Jason are vicious, screaming and hurling vile truths at one another. Mikal is failing in school. Tonya drinks too much and is blacked out most of the time. Jason goes to work and comes back exhausted to join Tonya’s drinking binges. Cigarette smoke fills the small space. None of them can make any move without the other two being aware of it, adding to the tension.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tAt the center of the film is Mikal’s relationship with his mother, while Jason is more a peripheral figure, an ineffectual referee between two warring parties, managing to negotiate only temporary truces. When Mikal begs his parents to stop drinking because he might be losing his sanity, the lens palpably captures his pain. He expresses his frustrations very clearly to his parents, finding words beyond his young years.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tStrømdahl has astute framing, using natural light (coming from blinding fluorescent motel light bulbs) and static long shots that allow for the action to unfold without interruption. When tragedy strikes — and how could it not — the filmmaker remains discreetly and respectfully at a distance. While showing the pain, the camera felt probing and intrusive. When showing grief and loss, it opens up the small, stifling space.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhile we never hear or see Strømdahl, she is at once discreet and omnipresent. Some scenes are so raw, it’s hard to imagine a camera being present, let alone another person. Few conversations seem forced or false, including those where the adults try to literalize how they failed to accomplish the American dream.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThough “Flophouse America” might be a hard sell outside the embracing environments of film festivals, it deserves a much wider audience. It’s an unvarnished and acutely realistic portrait of a topic which audiences, especially in the U.S., see much of. This is a film that shows what poverty can bring and that it lives in close proximity to many while most remain oblivious to it.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-30T00:04:16Z",
  "modifiedTime": "2025-03-30T00:04:27Z"
}
