{
  "id": "8b6bce73-5e28-452d-9031-f7c249a4cf8e",
  "title": "Sundance 2025 Awards: 'Seeds' \u0026 'Atropia' Grand Jury Prize Winners",
  "link": "https://www.firstshowing.net/2025/sundance-2025-awards-seeds-atropia-grand-jury-prize-winners/",
  "description": "The official awards for the 2025 Sundance Film Festival, held in Utah every January, were announced this morning with a small ceremony held in person in Utah. This always marks the end of the fest, with a few days of screenings left. The festival continued this week with at-home viewings in addition to all the in-person events. This year's line-up featured a grand total of 88 feature films, quite a few less than expected, with a number of indie gems in the selection. The main winners for 2025 include Atropia, taking home Grand Jury Prize; along with Brittany Shyne's Seeds winning the Grand Jury Prize for Documentary. The Audience Awards went to Twinless and (doc) Andre is an Idiot, entirely expected based on the effusive reactions to both. The winners this year are rather mild \u0026 unexciting, even though there are some amazing films at Sundance not many of them got any awards. As always, if any of these films interest you, we hope you note them down and catch up with them as soon as you can. All of the main 2025 winners listed below. Here's the full announcement of winners with synopsis next to each. The 2025 festival […]",
  "author": "Alex Billington",
  "published": "Fri, 31 Jan 2025 20:35:19 +0000",
  "source": "https://www.firstshowing.net/feed/",
  "categories": [
    "Awards",
    "Indies",
    "Movie News",
    "Sundance 25"
  ],
  "byline": "Alex Billington",
  "length": 12675,
  "excerpt": "The official awards for the 2025 Sundance Film Festival, held in Utah every January, were announced this morning with a small ceremony held in person in Utah. This always marks the end of the fest, with a few days of screenings left. The festival continued this week with at-home viewings in addition to all the",
  "siteName": "FirstShowing.net",
  "favicon": "https://www.firstshowing.net/favicon-32x32.png",
  "text": "Sundance 2025 Awards: 'Seeds' \u0026 'Atropia' Grand Jury Prize Winners by January 31, 2025Source: Sundance.org The official awards for the 2025 Sundance Film Festival, held in Utah every January, were announced this morning with a small ceremony held in person in Utah. This always marks the end of the fest, with a few days of screenings left. The festival continued this week with at-home viewings in addition to all the in-person events. This year's line-up featured a grand total of 88 feature films, quite a few less than expected, with a number of indie gems in the selection. The main winners for 2025 include Atropia, taking home Grand Jury Prize; along with Brittany Shyne's Seeds winning the Grand Jury Prize for Documentary. The Audience Awards went to Twinless and (doc) Andre is an Idiot, entirely expected based on the effusive reactions to both. The winners this year are rather mild \u0026 unexciting, even though there are some amazing films at Sundance not many of them got any awards. As always, if any of these films interest you, we hope you note them down and catch up with them as soon as you can. All of the main 2025 winners listed below. Here's the full announcement of winners with synopsis next to each. The 2025 festival is wrapping up soon. 2025 SUNDANCE FILM FESTIVAL JURY AWARDS: The U.S. Grand Jury Prize: Dramatic was presented to Atropia / U.S.A. (Director \u0026 Screenwriter: Hailey Gates, Producers: Naima Abed, Emilie Georges, Luca Guadagnino, Lana Kim, Jett Steiger) — When an aspiring actress in a military role-playing facility falls in love with a soldier cast as an insurgent, their unsimulated emotions threaten to derail the performance. Cast: Alia Shawkat, Callum Turner, Chloë Sevigny, Tim Heidecker, Jane Levy. The U.S. Grand Jury Prize: Documentary was presented to Seeds / U.S.A. (Director \u0026 Producer: Brittany Shyne, Producers: Danielle Varga, Sabrina Schmidt Gordon) — An exploration of Black generational farmers in the American South reveals the fragility of legacy and the significance of owning land. The World Cinema Grand Jury Prize: Dramatic was presented to Sabar Bonda (Cactus Pears) / India, U.K., Canada (Director \u0026 Screenwriter: Rohan Parashuram Kanawade, Producers: Neeraj Churi, Mohamed Khaki, Kaushik Ray, Hareesh Reddypalli, Naren Chandavarkar, Sidharth Meer) — Anand, a 30-something city dweller compelled to spend a 10-day mourning period for his father in the rugged countryside of western India, tenderly bonds with a local farmer struggling to stay unmarried. As the mourning ends, forcing his return, Anand must decide the fate of his relationship born under duress. Cast: Bhushaan Manoj, Suraaj Suman, Jayshri Jagtap. The World Cinema Grand Jury Prize: Documentary was presented to Cutting Through Rocks (اوزاک یوللار) / Iran, Germany, U.S.A., Netherlands, Qatar, Chile, Canada (Directors \u0026 Producers: Sara Khaki, Mohammadreza Eyni) — As the first elected councilwoman of her Iranian village, Sara Shahverdi aims to break long-held patriarchal traditions by training teenage girls to ride motorcycles and stopping child marriages. When accusations arise questioning Sara’s intentions to empower the girls, her identity is put in turmoil. The Directing Award: U.S. Dramatic was presented to Rashad Frett for Ricky / U.S.A. (Director, Screenwriter, \u0026 Producer: Rashad Frett, Screenwriter: Lin Que Ayoung, Producers: Pierre M. Coleman, Simon TaufiQue, Sterling Brim, DC Wade, Cary Joji Fukunaga, Josh Peters, Mark Steele) — Newly released after being locked up in his teens, 30-year-old Ricky navigates the challenging realities of life post-incarceration, and the complexity of gaining independence for the first time as an adult. Cast: Stephan James, Sheryl Lee Ralph, Titus Welliver, Maliq Johnson, Imani Lewis, Simbi Kali, Andrene Ward-Hammond. The Directing Award: U.S. Documentary was presented to Geeta Gandbhir for The Perfect Neighbor / U.S.A. (Director \u0026 Producer: Geeta Gandbhir, Producers: Nikon Kwantu, Alisa Payne, Sam Bisbee) — A seemingly minor neighborhood dispute in Florida escalates into deadly violence. Police bodycam footage and investigative interviews expose the consequences of Florida's \"stand your ground\" laws. The Directing Award: World Cinema Dramatic was presented to Alireza Khatami for The Things You Kill / Turkey, France, Poland, Canada (Director, Screenwriter, \u0026 Producer: Alireza Khatami, Producers: Elisa Sepulveda Ruddoff, Cyriac Auriol, Mariusz Włodarski, Michael Solomon) — Haunted by the suspicious death of his ailing mother, a university professor coerces his enigmatic gardener to execute a cold-blooded act of vengeance. Cast: Ekin Koç, Erkan Kolçak Köstendil, Hazar Ergüçlü, Ercan Kesal. World Premiere. The Directing Award: World Cinema Documentary was presented to Mstyslav Chernov for 2000 Meters to Andriivka / Ukraine (Director and Producer: Mstyslav Chernov, Producers: Michelle Mizner, Raney Aronson-Rath) — Amid the failing counteroffensive, a journalist follows a Ukrainian platoon on their mission to traverse one mile of heavily fortified forest and liberate a strategic village from Russian occupation. But the farther they advance through their destroyed homeland, the more they realize that this war may never end. The Waldo Salt Screenwriting Award: U.S. Dramatic was presented to Eva Victor for Sorry, Baby / U.S.A. (Director \u0026 Screenwriter: Eva Victor, Producers: Adele Romanski, Mark Ceryak, Barry Jenkins) — Something bad happened to Agnes. But life goes on... for everyone around her, at least. Cast: Eva Victor, Naomi Ackie, Lucas Hedges, John Carroll Lynch, Louis Cancelmi, Kelly McCormack. The Jonathan Oppenheim Editing Award: U.S. Documentary was presented to Parker Laramie for André is an Idiot / U.S.A. (Director: Anthony Benna, Producers: André Ricciardi, Tory Tunnell, Joshua Altman, Stelio Kitrilakis, Ben Cotner) — André, a brilliant idiot, is dying because he didn’t get a colonoscopy. His sobering diagnosis, complete irreverence, and insatiable curiosity, send him on an unexpected journey learning how to die happily and ridiculously without losing his sense of humor. A U.S. Dramatic Special Jury Award for Acting was presented to Dylan O'Brien for Twinless / U.S.A. (Director, Screenwriter, \u0026 Producer: James Sweeney, Producer: David Permut) — Two young men meet in a twin bereavement support group and form an unlikely bromance. Cast: Dylan O’Brien, James Sweeney, Lauren Graham, Aisling Franciosi, Tasha Smith, Chris Perfetti. A U.S. Dramatic Special Jury Award for Ensemble Cast was presented to Plainclothes / U.S.A. (Director \u0026 Screenwriter: Carmen Emmi, Producers: Colby Cote, Arthur Landon, Eric Podwall, Vanessa Pantley) — A promising undercover officer assigned to lure and arrest gay men defies orders when he falls in love with a target. Cast: Tom Blyth, Russell Tovey, Maria Dizzia, Christian Cooke, Gabe Fazio, Amy Forsyth. World Premiere. Available online for Public. A U.S. Documentary Special Jury Award for Archival Storytelling was presented to Selena y Los Dinos / U.S.A. (Director: Isabel Castro, Producers: Julie Goldman, Christopher Clements, J. Daniel Torres, David Blackman, Simran Singh) — Selena Quintanilla — the “Queen of Tejano Music” — and her family band, Selena y Los Dinos, rose from performing at quinceañeras to selling out stadium tours. The celebration of her life and legacy is chronicled through never-before-seen footage from the family's personal archive. A U.S. Documentary Special Jury Award was presented to Life After / U.S.A. (Director: Reid Davenport, Producer: Colleen Cassingham) — In 1983, a disabled Californian woman named Elizabeth Bouvia sought the “right to die,” igniting a national debate about autonomy, dignity, and the value of disabled lives. After years of courtroom trials, Bouvia disappeared from public view. Disabled director Reid Davenport narrates this investigation of what happened to Bouvia. The NEXT Innovator Award Presented by Adobe was awarded to Zodiac Killer Project / U.S.A., U.K. (Director \u0026 Producer: Charlie Shackleton, Producers: Catherine Bray, Anthony Ing) –– Against the backdrop of sunbaked parking lots, deserted courthouses, and empty suburban homes — the familiar spaces of true crime, stripped of all action and spectacle — a filmmaker describes his abandoned Zodiac Killer documentary and probes the inner workings of a genre at saturation point. A NEXT Special Jury Award for Ensemble Cast was presented to Mad Bills to Pay (or Destiny, dile que no soy malo) / U.S.A. (Director \u0026 Screenwriter: Joel Alfonso Vargas, Producer: Paolo Maria Pedullà) –– Rico’s summer is a mix of chasing girls and hustling homemade cocktails out of a cooler on Orchard Beach, the Bronx. But when Destiny, his teenage girlfriend, crashes at his place with his family, it’s only a matter of time before his carefree days come spiraling down. Cast: Juan Collado, Destiny Checo, Yohanna Florentino, Nathaly Navarro. 2025 SUNDANCE FILM FESTIVAL AUDIENCE AWARDS: The Audience Award: U.S. Dramatic, Presented by Acura was awarded to Twinless / U.S.A. (Director, Screenwriter, \u0026 Producer: James Sweeney, Producer: David Permut) — Two young men meet in a twin bereavement support group and form an unlikely bromance. Cast: Dylan O’Brien, James Sweeney, Lauren Graham, Aisling Franciosi, Tasha Smith, Chris Perfetti. The Audience Award: U.S. Documentary, Presented by Acura was awarded to André is an Idiot / U.S.A. (Director: Anthony Benna, Producers: André Ricciardi, Tory Tunnell, Joshua Altman, Stelio Kitrilakis, Ben Cotner) — André, a brilliant idiot, is dying because he didn’t get a colonoscopy. His sobering diagnosis, complete irreverence, and insatiable curiosity, send him on an unexpected journey learning how to die happily and ridiculously without losing his sense of humor. The Audience Award: World Cinema Dramatic, Presented by United Airlines was awarded to DJ Ahmet / North Macedonia, Czech Republic, Serbia, Croatia (Director \u0026 Screenwriter: Georgi M. Unkovski, Producers: Ivan Unkovski, Ivana Shekutkoska) — Ahmet, a 15-year-old boy from a remote Yuruk village in North Macedonia, finds refuge in music while navigating his father’s expectations, a conservative community, and his first experience with love — a girl already promised to someone else. Cast: Arif Jakup, Agush Agushev, Dora Akan Zlatanova, Aksel Mehmet, Selpin Kerim, Atila Klince. The Audience Award: World Cinema Documentary, Presented by United Airlines was awarded to Prime Minister / U.S.A. (Directors: Michelle Walshe, Lindsay Utz, Producers: Cass Avery, Leon Kirkbeck, Gigi Pritzker, Rachel Shane, Katie Peck) — A view inside the life of former New Zealand Prime Minister Jacinda Ardern, capturing her through five tumultuous years in power and beyond as she redefined leadership on the world stage. The Audience Award: NEXT, Presented by Adobe was awarded to East of Wall / U.S.A. (Director, Screenwriter, \u0026 Producer: Kate Beecroft, Producers: Lila Yacoub, Melanie Ramsayer, Shannon Moss) –– After the death of her husband, Tabatha — a young, tattooed, rebellious horse trainer — wrestles with financial insecurity and unresolved grief while providing refuge for a group of wayward teenagers on her broken-down ranch in the Badlands. Cast: Tabatha Zimiga, Porshia Zimiga, Scoot McNairy, Jennifer Ehle. Congrats to all of 2025's winners! Keep an eye on all these films, catch them when they show in your area or at another festival soon. My personal pick for Grand Jury Prize would've been either Omaha or Sorry, Baby - two of the very best films of the festival that innovative and provocative and unique. I watched Atropia and it's an interesting idea but not that good, losing steam pretty quickly after it starts. No one seems to know why they chose this? And in the documentary selection, The Perfect Neighbor, Andre is an idiot, and Life After are much better than Seeds. Very strange picks from the 2025 juries. I also think films like Folktales and Rebuilding and Train Dreams and The Wedding Banquet all deserved to win something - but strangely in the Premieres section they aren't allowed to get any awards. A number of these winners I didn't even have the chance to see anyway - hoping to catch up later with everything else. As usual, opinions on all of these 2025 films are entirely different! That's how cinema goes. That said, every last one is worth your time and attention to discover anyway – Sundance always brings great new filmmakers at the festival year after year. For more info, visit Sundance.org. Also see last year's winners here. Follow all our Sundance 2025 coverage. Find more posts in: Awards, Indies, Movie News, Sundance 25",
  "image": "https://media2.firstshowing.net/firstshowing/img16/Sundance25AwardsWinnersbigTW.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\u003ch2 id=\"post-726463\"\u003eSundance 2025 Awards: \u0026#39;Seeds\u0026#39; \u0026amp; \u0026#39;Atropia\u0026#39; Grand Jury Prize Winners\u003c/h2\u003e\n\t\t\t\u003cp\u003eby \t\t\u003cbr/\u003eJanuary 31, 2025\u003cbr/\u003e\u003cem\u003eSource:\u003c/em\u003e \u003ca href=\"https://www.sundance.org/blogs/2025-sundance-film-festival-award-winners-announced/\" rel=\"noopener nofollow\" target=\"_blank\"\u003eSundance.org\u003c/a\u003e\u003cbr/\u003e\u003c/p\u003e\n\t\t\u003cp\u003e\u003ca href=\"https://www.firstshowing.net/2025/sundance-2025-awards-seeds-atropia-grand-jury-prize-winners/\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://media2.firstshowing.net/firstshowing/img16/Sundance25AwardsWinnersbigTsr.jpg\" alt=\"Sundance 2025 Awards\" width=\"350\" height=\"168\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe official awards for the \u003cstrong\u003e2025 Sundance Film Festival\u003c/strong\u003e, held in Utah every January, were announced this morning with a small ceremony held in person in Utah. This always marks the end of the fest, with a few days of screenings left. The festival continued this week with at-home viewings in addition to all the in-person events. This year\u0026#39;s \u003ca href=\"https://www.firstshowing.net/2024/sundance-2025-official-selection-feature-films/\"\u003eline-up featured a grand total\u003c/a\u003e of 88 feature films, quite a few less than expected, with a number of indie gems in the selection. The main winners for 2025 include \u003cstrong\u003e\u003cem\u003eAtropia\u003c/em\u003e\u003c/strong\u003e, taking home Grand Jury Prize; along with Brittany Shyne\u0026#39;s \u003cstrong\u003e\u003cem\u003eSeeds\u003c/em\u003e\u003c/strong\u003e winning the Grand Jury Prize for Documentary. The Audience Awards went to \u003cstrong\u003e\u003cem\u003eTwinless\u003c/em\u003e\u003c/strong\u003e and (doc) \u003cstrong\u003e\u003cem\u003eAndre is an Idiot\u003c/em\u003e\u003c/strong\u003e, entirely expected based on the effusive reactions to both. The winners this year are rather mild \u0026amp; unexciting, even though there are some amazing films at Sundance not many of them got any awards. As always, if any of these films interest you, we hope you note them down and catch up with them as soon as you can. All of the main 2025 winners listed below.\u003cspan id=\"more-726463\"\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eHere\u0026#39;s the full announcement of winners with synopsis next to each. The \u003ca href=\"https://www.firstshowing.net/category/sundance25/\"\u003e2025 festival\u003c/a\u003e is wrapping up soon.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003e2025 SUNDANCE FILM FESTIVAL JURY AWARDS:\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eU.S. Grand Jury Prize: Dramatic\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eAtropia\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Screenwriter: Hailey Gates, Producers: Naima Abed, Emilie Georges, Luca Guadagnino, Lana Kim, Jett Steiger) — When an aspiring actress in a military role-playing facility falls in love with a soldier cast as an insurgent, their unsimulated emotions threaten to derail the performance. Cast: Alia Shawkat, Callum Turner, Chloë Sevigny, Tim Heidecker, Jane Levy.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eU.S. Grand Jury Prize: Documentary\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eSeeds\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Producer: Brittany Shyne, Producers: Danielle Varga, Sabrina Schmidt Gordon) — An exploration of Black generational farmers in the American South reveals the fragility of legacy and the significance of owning land.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eWorld Cinema Grand Jury Prize: Dramatic\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eSabar Bonda (Cactus Pears)\u003c/em\u003e\u003c/strong\u003e / India, U.K., Canada (Director \u0026amp; Screenwriter: Rohan Parashuram Kanawade, Producers: Neeraj Churi, Mohamed Khaki, Kaushik Ray, Hareesh Reddypalli, Naren Chandavarkar, Sidharth Meer) — Anand, a 30-something city dweller compelled to spend a 10-day mourning period for his father in the rugged countryside of western India, tenderly bonds with a local farmer struggling to stay unmarried. As the mourning ends, forcing his return, Anand must decide the fate of his relationship born under duress. Cast: Bhushaan Manoj, Suraaj Suman, Jayshri Jagtap.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eWorld Cinema Grand Jury Prize: Documentary\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eCutting Through Rocks (اوزاک یوللار)\u003c/em\u003e\u003c/strong\u003e / Iran, Germany, U.S.A., Netherlands, Qatar, Chile, Canada (Directors \u0026amp; Producers: Sara Khaki, Mohammadreza Eyni) — As the first elected councilwoman of her Iranian village, Sara Shahverdi aims to break long-held patriarchal traditions by training teenage girls to ride motorcycles and stopping child marriages. When accusations arise questioning Sara’s intentions to empower the girls, her identity is put in turmoil.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eDirecting Award: U.S. Dramatic\u003c/strong\u003e was presented to Rashad Frett for \u003cstrong\u003e\u003cem\u003eRicky\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director, Screenwriter, \u0026amp; Producer: Rashad Frett, Screenwriter: Lin Que Ayoung, Producers: Pierre M. Coleman, Simon TaufiQue, Sterling Brim, DC Wade, Cary Joji Fukunaga, Josh Peters, Mark Steele) — Newly released after being locked up in his teens, 30-year-old Ricky navigates the challenging realities of life post-incarceration, and the complexity of gaining independence for the first time as an adult. Cast: Stephan James, Sheryl Lee Ralph, Titus Welliver, Maliq Johnson, Imani Lewis, Simbi Kali, Andrene Ward-Hammond.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eDirecting Award: U.S. Documentary\u003c/strong\u003e was presented to Geeta Gandbhir for \u003cstrong\u003e\u003cem\u003eThe Perfect Neighbor\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Producer: Geeta Gandbhir, Producers: Nikon Kwantu, Alisa Payne, Sam Bisbee) — A seemingly minor neighborhood dispute in Florida escalates into deadly violence. Police bodycam footage and investigative interviews expose the consequences of Florida\u0026#39;s \u0026#34;stand your ground\u0026#34; laws.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eDirecting Award: World Cinema Dramatic\u003c/strong\u003e was presented to Alireza Khatami for \u003cstrong\u003e\u003cem\u003eThe Things You Kill\u003c/em\u003e\u003c/strong\u003e / Turkey, France, Poland, Canada (Director, Screenwriter, \u0026amp; Producer: Alireza Khatami, Producers: Elisa Sepulveda Ruddoff, Cyriac Auriol, Mariusz Włodarski, Michael Solomon) — Haunted by the suspicious death of his ailing mother, a university professor coerces his enigmatic gardener to execute a cold-blooded act of vengeance. Cast: Ekin Koç, Erkan Kolçak Köstendil, Hazar Ergüçlü, Ercan Kesal. World Premiere.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eDirecting Award: World Cinema Documentary\u003c/strong\u003e was presented to Mstyslav Chernov for \u003cstrong\u003e\u003cem\u003e2000 Meters to Andriivka\u003c/em\u003e\u003c/strong\u003e / Ukraine (Director and Producer: Mstyslav Chernov, Producers: Michelle Mizner, Raney Aronson-Rath) — Amid the failing counteroffensive, a journalist follows a Ukrainian platoon on their mission to traverse one mile of heavily fortified forest and liberate a strategic village from Russian occupation. But the farther they advance through their destroyed homeland, the more they realize that this war may never end.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eWaldo Salt Screenwriting Award: U.S. Dramatic\u003c/strong\u003e was presented to Eva Victor for \u003cstrong\u003e\u003cem\u003eSorry, Baby\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Screenwriter: Eva Victor, Producers: Adele Romanski, Mark Ceryak, Barry Jenkins) — Something bad happened to Agnes. But life goes on... for everyone around her, at least. Cast: Eva Victor, Naomi Ackie, Lucas Hedges, John Carroll Lynch, Louis Cancelmi, Kelly McCormack.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eJonathan Oppenheim Editing Award: U.S. Documentary\u003c/strong\u003e was presented to Parker Laramie for \u003cstrong\u003e\u003cem\u003eAndré is an Idiot\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director: Anthony Benna, Producers: André Ricciardi, Tory Tunnell, Joshua Altman, Stelio Kitrilakis, Ben Cotner) — André, a brilliant idiot, is dying because he didn’t get a colonoscopy. His sobering diagnosis, complete irreverence, and insatiable curiosity, send him on an unexpected journey learning how to die happily and ridiculously without losing his sense of humor.\u003c/p\u003e\n\u003cp\u003eA \u003cstrong\u003eU.S. Dramatic Special Jury Award\u003c/strong\u003e for Acting was presented to Dylan O\u0026#39;Brien for \u003cstrong\u003e\u003cem\u003eTwinless\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director, Screenwriter, \u0026amp; Producer: James Sweeney, Producer: David Permut) — Two young men meet in a twin bereavement support group and form an unlikely bromance. Cast: Dylan O’Brien, James Sweeney, Lauren Graham, Aisling Franciosi, Tasha Smith, Chris Perfetti.\u003c/p\u003e\n\u003cp\u003eA \u003cstrong\u003eU.S. Dramatic Special Jury Award for Ensemble Cast\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003ePlainclothes\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Screenwriter: Carmen Emmi, Producers: Colby Cote, Arthur Landon, Eric Podwall, Vanessa Pantley) — A promising undercover officer assigned to lure and arrest gay men defies orders when he falls in love with a target. Cast: Tom Blyth, Russell Tovey, Maria Dizzia, Christian Cooke, Gabe Fazio, Amy Forsyth. World Premiere. Available online for Public. \u003c/p\u003e\n\u003cp\u003eA \u003cstrong\u003eU.S. Documentary Special Jury Award for Archival Storytelling\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eSelena y Los Dinos\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director: Isabel Castro, Producers: Julie Goldman, Christopher Clements, J. Daniel Torres, David Blackman, Simran Singh) — Selena Quintanilla — the “Queen of Tejano Music” — and her family band, Selena y Los Dinos, rose from performing at quinceañeras to selling out stadium tours. The celebration of her life and legacy is chronicled through never-before-seen footage from the family\u0026#39;s personal archive.\u003c/p\u003e\n\u003cp\u003eA \u003cstrong\u003eU.S. Documentary Special Jury Award\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eLife After\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director: Reid Davenport, Producer: Colleen Cassingham) — In 1983, a disabled Californian woman named Elizabeth Bouvia sought the “right to die,” igniting a national debate about autonomy, dignity, and the value of disabled lives. After years of courtroom trials, Bouvia disappeared from public view. Disabled director Reid Davenport narrates this investigation of what happened to Bouvia.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eNEXT Innovator Award Presented\u003c/strong\u003e by Adobe was awarded to \u003cstrong\u003e\u003cem\u003eZodiac Killer Project\u003c/em\u003e\u003c/strong\u003e / U.S.A., U.K. (Director \u0026amp; Producer: Charlie Shackleton, Producers: Catherine Bray, Anthony Ing) –– Against the backdrop of sunbaked parking lots, deserted courthouses, and empty suburban homes — the familiar spaces of true crime, stripped of all action and spectacle — a filmmaker describes his abandoned Zodiac Killer documentary and probes the inner workings of a genre at saturation point.\u003c/p\u003e\n\u003cp\u003eA \u003cstrong\u003eNEXT Special Jury Award for Ensemble Cast\u003c/strong\u003e was presented to \u003cstrong\u003e\u003cem\u003eMad Bills to Pay (or Destiny, dile que no soy malo)\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director \u0026amp; Screenwriter: Joel Alfonso Vargas, Producer: Paolo Maria Pedullà) –– Rico’s summer is a mix of chasing girls and hustling homemade cocktails out of a cooler on Orchard Beach, the Bronx. But when Destiny, his teenage girlfriend, crashes at his place with his family, it’s only a matter of time before his carefree days come spiraling down. Cast: Juan Collado, Destiny Checo, Yohanna Florentino, Nathaly Navarro.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003e2025 SUNDANCE FILM FESTIVAL AUDIENCE AWARDS:\u003c/strong\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eAudience Award: U.S. Dramatic\u003c/strong\u003e, Presented by Acura was awarded to \u003cstrong\u003e\u003cem\u003eTwinless\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director, Screenwriter, \u0026amp; Producer: James Sweeney, Producer: David Permut) — Two young men meet in a twin bereavement support group and form an unlikely bromance. Cast: Dylan O’Brien, James Sweeney, Lauren Graham, Aisling Franciosi, Tasha Smith, Chris Perfetti.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eAudience Award: U.S. Documentary\u003c/strong\u003e, Presented by Acura was awarded to \u003cstrong\u003e\u003cem\u003eAndré is an Idiot\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director: Anthony Benna, Producers: André Ricciardi, Tory Tunnell, Joshua Altman, Stelio Kitrilakis, Ben Cotner) — André, a brilliant idiot, is dying because he didn’t get a colonoscopy. His sobering diagnosis, complete irreverence, and insatiable curiosity, send him on an unexpected journey learning how to die happily and ridiculously without losing his sense of humor.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eAudience Award: World Cinema Dramatic\u003c/strong\u003e, Presented by United Airlines was awarded to \u003cstrong\u003e\u003cem\u003eDJ Ahmet\u003c/em\u003e\u003c/strong\u003e / North Macedonia, Czech Republic, Serbia, Croatia (Director \u0026amp; Screenwriter: Georgi M. Unkovski, Producers: Ivan Unkovski, Ivana Shekutkoska) — Ahmet, a 15-year-old boy from a remote Yuruk village in North Macedonia, finds refuge in music while navigating his father’s expectations, a conservative community, and his first experience with love — a girl already promised to someone else. Cast: Arif Jakup, Agush Agushev, Dora Akan Zlatanova, Aksel Mehmet, Selpin Kerim, Atila Klince.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eAudience Award: World Cinema Documentary\u003c/strong\u003e, Presented by United Airlines was awarded to \u003cstrong\u003e\u003cem\u003ePrime Minister\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Directors: Michelle Walshe, Lindsay Utz, Producers: Cass Avery, Leon Kirkbeck, Gigi Pritzker, Rachel Shane, Katie Peck) — A view inside the life of former New Zealand Prime Minister Jacinda Ardern, capturing her through five tumultuous years in power and beyond as she redefined leadership on the world stage.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eAudience Award: NEXT\u003c/strong\u003e, Presented by Adobe was awarded to \u003cstrong\u003e\u003cem\u003eEast of Wall\u003c/em\u003e\u003c/strong\u003e / U.S.A. (Director, Screenwriter, \u0026amp; Producer: Kate Beecroft, Producers: Lila Yacoub, Melanie Ramsayer, Shannon Moss) –– After the death of her husband, Tabatha — a young, tattooed, rebellious horse trainer — wrestles with financial insecurity and unresolved grief while providing refuge for a group of wayward teenagers on her broken-down ranch in the Badlands. Cast: Tabatha Zimiga, Porshia Zimiga, Scoot McNairy, Jennifer Ehle.\u003c/p\u003e\n\u003cp\u003eCongrats to all of 2025\u0026#39;s winners! Keep an eye on all these films, catch them when they show in your area or at another festival soon. My personal pick for Grand Jury Prize would\u0026#39;ve been either \u003cem\u003eOmaha\u003c/em\u003e or \u003cem\u003eSorry, Baby\u003c/em\u003e - two of the very best films of the festival that innovative and provocative and unique. I watched \u003cem\u003eAtropia\u003c/em\u003e and it\u0026#39;s an interesting idea but not that good, losing steam pretty quickly after it starts. No one seems to know why they chose this? And in the documentary selection, \u003cem\u003eThe Perfect Neighbor\u003c/em\u003e, \u003cem\u003eAndre is an idiot\u003c/em\u003e, and \u003cem\u003eLife After\u003c/em\u003e are much better than \u003cem\u003eSeeds\u003c/em\u003e. Very strange picks from the 2025 juries. I also think films like \u003cem\u003eFolktales\u003c/em\u003e and \u003cem\u003eRebuilding\u003c/em\u003e and \u003cem\u003eTrain Dreams\u003c/em\u003e and \u003cem\u003eThe Wedding Banquet\u003c/em\u003e all deserved to win something - but strangely in the Premieres section they aren\u0026#39;t allowed to get any awards. A number of these winners I didn\u0026#39;t even have the chance to see anyway - hoping to catch up later with everything else. As usual, opinions on all of these 2025 films are entirely different! That\u0026#39;s how cinema goes. That said, every last one is worth your time and attention to discover anyway – Sundance always brings great new filmmakers at the festival year after year.\u003c/p\u003e\n\u003cp\u003eFor more info, visit \u003ca href=\"https://www.sundance.org/blogs/2025-sundance-film-festival-award-winners-announced/\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eSundance.org\u003c/a\u003e. Also see \u003ca href=\"https://www.firstshowing.net/2024/sundance-2024-awards-in-the-summers-porcelain-war-top-films/\" title=\"Sundance 2024 Awards: \u0026#39;In The Summers\u0026#39; \u0026amp; \u0026#39;Porcelain War\u0026#39; Top Films\"\u003elast year\u0026#39;s winners here\u003c/a\u003e. Follow all our \u003ca href=\"https://www.firstshowing.net/category/sundance25/\"\u003eSundance 2025 coverage\u003c/a\u003e.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFind more posts in:\u003c/strong\u003e \u003ca href=\"https://www.firstshowing.net/category/awards/\" rel=\"category tag\"\u003eAwards\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/indies/\" rel=\"category tag\"\u003eIndies\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/movie-news/\" rel=\"category tag\"\u003eMovie News\u003c/a\u003e, \u003ca href=\"https://www.firstshowing.net/category/sundance25/\" rel=\"category tag\"\u003eSundance 25\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\t\t\t\t\n\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "14 min read",
  "publishedTime": "2025-01-31T15:35:19-05:00",
  "modifiedTime": null
}
