{
  "id": "8f6b25ac-e5f4-47f9-a741-c81aa22617a5",
  "title": "Christopher McQuarrie Shares Updates On Upcoming Tom Cruise Collaborations, Says ‘Top Gun 3’ Is “Already In The Bag”",
  "link": "https://deadline.com/2025/05/christopher-mcquarrie-tom-cruise-top-gun-3-days-of-thunder-1236411223/",
  "description": "Goodness gracious — headway has been made on some upcoming collaborations between Tom Cruise and Christopher McQuarrie, the director shared. Among the films due to come is the sequel to 2022’s blockbuster Top Gun: Maverick, which the Mission: Impossible — The Final Reckoning helmer said is “already in the bag,” adding that he “already know[s]” […]",
  "author": "Natalie Oganesyan",
  "published": "Tue, 27 May 2025 00:05:05 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Christopher McQuarrie",
    "Days of Thunder",
    "Tom Cruise",
    "Top Gun 3"
  ],
  "byline": "Natalie Oganesyan",
  "length": 3196,
  "excerpt": "Headway has been made on some upcoming collaborations between Tom Cruise and Christopher McQuarrie, including 'Top Gun 3' and 'Days of Thunder.'",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Goodness gracious — headway has been made on some upcoming collaborations between Tom Cruise and Christopher McQuarrie, the director shared. Among the films due to come is the sequel to 2022’s blockbuster Top Gun: Maverick, which the Mission: Impossible — The Final Reckoning helmer said is “already in the bag,” adding that he “already know[s]” what the story is. “It wasn’t hard,” McQuarrie told Josh Horowitz of cracking the script in a new episode of his Happy Sad Confused podcast. “I thought it would be, and that’s a good place to go from is you walk into the room going, ‘Come on, what are we going to do?’ And [co-writer] Ehren Kruger pitched something and I went, ‘Mm, actually,’ and we had one conversation about it and the framework is there. So, no, it’s not hard to crack. The truth of the matter is, none of these are hard to crack.” McQuarrie continued, “It’s as you start to execute it, and as you start to interrogate it, as you start [to think] why these movies are made the way they are: It’s not the action, it’s not even the level of or intensity of or the scope and scale of the action [or] the engineering around the action, it’s none of those things — it’s the emotion.” When asked if he would step into a director role for the threequel (Joseph Kosinski helmed Maverick from a script co-written by McQuarrie, with the original directed by the late Tony Scott), he replied, “I have given that absolutely no thought, no thought whatsoever … However, I have done a lot of research into how to make a Tony Scott movie.” The Oscar-winning writer also provided updates on a potential Tropic Thunder spinoff for Cruise’s foul-mouthed studio executive character Les Grossman, an idea the dynamic duo has been floating around since 2022. “Everything is a priority, everything will — in one way or another — happen,” he explained. “It will not necessarily happen in the time or place you think it will. They’re all things we’re talking about, they’re all things we have ideas about, the conversations we have had about Les Grossman are so f—ing funny. We’re talking about it, man, we’re having very serious conversations about it and how best to do it and it ultimately comes down to what that character is.” McQuarrie added that, thus far, he and Cruise are in a brainstorming stage of sorts, saying they would often “play with scenes” in their downtime amid filming Final Reckoning. As for the Days of Thunder sequel, McQuarrie also stated, “[I] totally [knew] what the premise of the movie would be, in five seconds I knew … and I looked at the response to Top Gun: Maverick and immediately turned to Tom and said, ‘Days of Thunder.‘” McQuarrie echoed what Cruise himself shared earlier this month, when the four-time Oscar-nominated action star affirmed he’s in development on followups for both Maverick and his 1990 racing drama. “Yeah, we’re thinking and talking about many different stories and what could we do and what’s possible,” he teased on Australia’s Today. “It took me 35 years to figure out Top Gun: Maverick, so all of these things we’re working on, we’re discussing Days of Thunder and Top Gun: Maverick.”",
  "image": "https://deadline.com/wp-content/uploads/2025/05/tom.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tGoodness gracious — headway has been made on some upcoming collaborations between \u003ca href=\"https://deadline.com/tag/tom-cruise/\" id=\"auto-tag_tom-cruise\" data-tag=\"tom-cruise\"\u003eTom Cruise\u003c/a\u003e and \u003ca href=\"https://deadline.com/tag/christopher-mcquarrie/\" id=\"auto-tag_christopher-mcquarrie\" data-tag=\"christopher-mcquarrie\"\u003eChristopher McQuarrie\u003c/a\u003e, the director shared.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAmong the films due to come is the sequel to 2022’s blockbuster \u003cem\u003e\u003ca href=\"https://deadline.com/tag/top-gun-maverick\"\u003eTop Gun: Maverick\u003c/a\u003e\u003c/em\u003e, which the \u003cem\u003e\u003ca href=\"https://deadline.com/tag/mission-impossible-the-final-reckoning/\"\u003eMission: Impossible — The Final Reckoning\u003c/a\u003e \u003c/em\u003ehelmer said is “already in the bag,” adding that he “already know[s]” what the story is.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“It wasn’t hard,” McQuarrie told \u003ca rel=\"nofollow\" href=\"https://www.youtube.com/watch?v=KNmwfjEvXiw\u0026amp;t=3377s\" target=\"_blank\"\u003eJosh Horowitz of cracking the script in a new episode of his \u003cem\u003eHappy Sad Confused \u003c/em\u003epodcast\u003c/a\u003e. “I thought it would be, and that’s a good place to go from is you walk into the room going, ‘Come on, what are we going to do?’ And \u003ca href=\"https://deadline.com/2024/01/top-gun-3-tom-cruise-1235722328/\"\u003e[co-writer] Ehren Kruger\u003c/a\u003e pitched something and I went, ‘Mm, actually,’ and we had one conversation about it and the framework is there. So, no, it’s not hard to crack. The truth of the matter is, none of these are hard to crack.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tMcQuarrie continued, “It’s as you start to execute it, and as you start to interrogate it, as you start [to think] why these movies are made the way they are: It’s not the action, it’s not even the level of or intensity of or the scope and scale of the action [or] the engineering around the action, it’s none of those things — it’s the emotion.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tWhen asked if he would step into a director role for the threequel (Joseph Kosinski helmed \u003cem\u003eMaverick\u003c/em\u003e from a script co-written by McQuarrie, with the original directed by the late Tony Scott), he replied, “I have given that absolutely no thought, no thought whatsoever … However, I have done a lot of research into how to make a Tony Scott movie.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe Oscar-winning writer also provided updates on a potential \u003cem\u003eTropic Thunder \u003c/em\u003espinoff for Cruise’s foul-mouthed studio executive character Les Grossman, an idea the dynamic duo \u003ca href=\"https://deadline.com/2022/08/tom-cruise-christopher-mcquarrie-new-musical-and-action-thriller-les-grossman-speed-flying-mission-impossible-8-top-gun-maverick-1235087363/\"\u003ehas been floating around since 2022\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Everything is a priority, everything will — in one way or another — happen,” he explained. “It will not necessarily happen in the time or place you think it will. They’re all things we’re talking about, they’re all things we have ideas about, the conversations we have had about Les Grossman are so f—ing funny. We’re talking about it, man, we’re having very serious conversations about it and how best to do it and it ultimately comes down to what that character is.” McQuarrie added that, thus far, he and Cruise are in a brainstorming stage of sorts, saying they would often “play with scenes” in their downtime amid filming\u003cem\u003e Final Reckoning.\u003c/em\u003e\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tAs for the \u003cem\u003e\u003ca href=\"https://deadline.com/tag/days-of-thunder/\" id=\"auto-tag_days-of-thunder\" data-tag=\"days-of-thunder\"\u003eDays of Thunder\u003c/a\u003e \u003c/em\u003esequel, McQuarrie also stated, “[I] totally [knew] what the premise of the movie would be, in five seconds I knew … and I looked at the response to \u003cem\u003eTop Gun: Maverick\u003c/em\u003e and immediately turned to Tom and said, ‘\u003cem\u003eDays of Thunder.\u003c/em\u003e‘”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMcQuarrie echoed what Cruise himself shared \u003ca href=\"https://deadline.com/2025/05/tom-cruise-working-on-ideas-top-gun-3-days-of-thunder-2-1236403110/\"\u003eearlier this month\u003c/a\u003e, when the four-time Oscar-nominated action star affirmed he’s in development on followups for both \u003cem\u003eMaverick \u003c/em\u003eand his 1990 racing drama.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Yeah, we’re thinking and talking about many different stories and what could we do and what’s possible,” he teased on Australia’s \u003cem\u003e\u003ca rel=\"noreferrer noopener nofollow\" target=\"_blank\" href=\"https://youtu.be/EjhYuIIkBjA\"\u003eToday\u003c/a\u003e\u003c/em\u003e. “It took me 35 years to figure out \u003cem\u003eTop Gun: Maverick\u003c/em\u003e, so all of these things we’re working on, we’re discussing \u003cem\u003eDays of Thunder\u003c/em\u003e and \u003cem\u003eTop Gun: Maverick\u003c/em\u003e.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-27T00:05:05Z",
  "modifiedTime": "2025-05-27T00:05:07Z"
}
