{
  "id": "8ff1d94b-8277-4bdf-9143-d3b446a18cc9",
  "title": "The 15 Best Episodes of ‘What We Do in the Shadows’",
  "link": "https://www.indiewire.com/features/best-of/what-we-do-in-the-shadows-best-episodes-1235060664/",
  "description": "To celebrate the final season, look back at highlights from Seasons 1 through 5.",
  "author": "Proma Khosla",
  "published": "Tue, 29 Oct 2024 23:30:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Best Of",
    "Features",
    "Jemaine Clement",
    "Paul Simms",
    "TV",
    "What We Do in the Shadows"
  ],
  "byline": "Proma Khosla",
  "length": 16008,
  "excerpt": "To celebrate the final season of Jemaine Clement's 'What We Do in the Shadows' on FX, check out the 15 best episodes from Seasons 1 through 5.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "Picking the best episodes of FX’s “What We Do in the Shadows” is kind of like… well, like picking your favorite character on “What We Do in the Shadows.” Or your favorite guest star. Or your favorite aspect of the series created by Jemaine Clement and based on the film he made with Taika Waititi in 2014; it’s just wrong, impossible, unnatural — like vampires themselves, some might argue. For the IndieWire team, this masochistic exercise was born from our denial that the series from showrunner Paul Simms will end its run with Season 6, which premiered on October 21 with three episodes. Soon, fans will have seen every episode of the entire show, and that’s a milestone we dread even while feeling gratitude that “Shadows” gets to end on its own terms and a high note. To celebrate the finale episodes and the triumph of this series, we picked 15 of the best episodes from Seasons 1 through 5 (Season 6 will be included after it ends). 15. Season 1, Episode 10, “Ancestry” ‘What We Do in the Shadows’Russ Martin/FX When Guillermo (Harvey Guillén) sends the vampires’ DNA for testing, he also learns about his own Dutch roots and the Van Helsing bloodline. He and Colin Robinson (Mark Proksch) help Nandor contact direct descendant living nearby while Guillermo continues to fear the truth of his ancestry, which leads to her death from shock and to an excellent scene of the vampires trying to survive in church. Nadja (Natasia Demetriou) finds herself pining for her lover Gregor (Jake McDorman), who hears her singing and escapes a psychiatric facility to go be with her. When Gregor (“Jesk”) arrives at the mansion, Laszlo (Matt Berry) is furious, and makes a final stand for his love. —PK 14. Season 3, Episode 8, “The Wellness Center” Nandor (Kayvan Novak) falls into a bout of vampiric depression, and finds solace in a wellness center where vampires renounce their lifestyle and try to live as humans. The others reject this community (it’s a cult) but leave Nandor alone to spend his days jazzercising, ripping out his fangs, and learning the lyrics to “One Week” by the Barenaked Ladies (something only a human could do!), which accompanies a truly magnificent montage. The others let Nandor go without much fuss, but Guillermo can’t shake the concern for his old master and busts in to rescue him — leaving behind a carnage of vampiric casualties and coming home with a very brainwashed Nandor. “Wellness Center” is wildly enjoyable despite an unresolved cliffhanger ending, which speaks to just how solid everything else about it is and the fact that “Shadows” deserves a one-off sitcom romp as much as any traditional show. —PK 13. Season 1, Episode 8, “Citizenship” We can only hope that government workers are still so dead inside they cannot be hypnotized for selfish and/or nefarious ends. “Citizenship,” coming as it does at the end of the first season, showcases much of what the show’s figured out about itself with perfect handoffs between the two plots of Nandor applying for American Citizenship and Nadja teaching Jenna (Beanie Feldstein) about her newfound vampiric abilities, as well as some fun visual effects and mason jars filled with blood (more associated with the latter, thankfully). Feldstein had other social situations to figuratively murder after she left the series, but it’s great to watch her do some literal murder at a frat rager after discovering the strength in what so many awkward girls already know is true about themselves: they are invisible at parties. —SS 12. Season 4, Episode 3, “The Grand Opening” ‘What We Do in the Shadows’Russ Martin/FX Not knowing what will happen during any given episode of “What We Do in the Shadows” is one of its greatest charms, but the series can also excel when leaning into its favorite tropes. Here, in the third episode of Season 4, that means committing to the joke and introducing fresh rules to vampire lore. The former trait can be seen twice over: first, in opening Nadja’s vampire nightclub. What could’ve been one of the crew’s quickly discarded quips instead blossoms into a fully realized business endeavor that runs throughout Season 4. Seeing Nadja in boss mode is always a treat and forcing her to work with Guillermo (the accountant) and the Guide (Kristen Schaal) — who technically oversees the space — helps keep the scene hot.  But the second way “The Grand Opening” commits to the joke is by literally committing to a joke: specifically, a dick joke. Nandor wants to use one of the wishes granted by the Djinn (Anoop Desai) to get a bigger penis, but Guillermo wisely cautions him to phrase his wish with caution. Since the Djinn enjoys finding loopholes, a stray word here or there could have catastrophic drawbacks. So, acting exactly like any man presented with a similar opportunity would act, Nandor devotes himself entirely to finding the precise words needed to endow him with the world’s most perfect penis. Of course, he still comes up short, but the effort devoted to such a silly endeavor is so, so funny (in no small part because it’s also so very relatable). Finally, to save Nadja’s vampire nightclub — and marry her plot to Baby Colin’s — it’s revealed that vampires love child novelty acts. So when her first choice for entertainment falls through, it’s a tap-dancing Colin to the rescue! Wow, I guess you really can’t predict what will happen next. Bless this show. —BT 11. Season 2, Episode 4, “The Curse” Nandor checks his email for the first time in a decade to find a chain email claiming to be cursed. Terrified, he and Laszlo and Nadja try to come up with ten email addresses that they can forward the message to before Bloody Mary comes for them (remember what happened to Ariana??). The problem could have been easily solved by Guillermo, but he’s out for the evening with the group of vampire hunters he infiltrated and they surprise him with immediate plans for a hunt — at a house that sounds a lot like his master’s. The house turns out to be the wrong one, but still filled with vampires, forcing Guillermo to rely on his slaying skills and claiming the human life of Derek. —PK 10. Season 3, Episode 4 “The Casino” A weekend getaway to Atlantic City finds the vampires shirking their Vampiric Council duties in favor of Sean (Anthony Atamanuik) and Charmaine’s (Marissa Jaret Winokur) vow renewal and endless gambling, frivolity, and pretending to consume alcohol. The debauchery gets cut short when the vampires struggle to slumber and realize that housekeeping swept away their ancestral dirt. Guillermo flies to Europe to gather soil from all their home countries, while Laszlo wrestles with guilt over stealing Sean’s money for the plane tickets, Nadja tries to swindle men who she thinks are the original Rat Pack, and Nandor spirals into a “Big Bang Theory” rabbit hole (bazinga!). It’s always riotous to see the vampires in human settings when they aren’t hunting, and Novak, Berry, and Demetriou get to flex their physical comedy as the vampires’ power weakens. —PK 9. Season 4, Episode 8 – “Go Flip Yourself!” ‘What We Do in the Shadows’Russ Martin/FX Sometimes the obvious choices are also the right choices. “Go Flip Yourself” — which is presented as an episode of Laszlo’s favorite home improvement show, “Go Flip Yourself” — is an easy pick for a list like this. Its framing device distinguishes the Season 4 entry from other episodes. It’s a big swing, even in a series that’s always eager to get weird. And it’s got a big twist ending (with a celebrity guest), which only further elevates the entry in fans’ memories. All these things are true, and all these things are great, but the devil’s in the details: Remember how Nadja kills one of the co-hosts as soon as they enter the house? Or what about the spot-on intro, pre-commercial teases, and insanely bright lighting? And while this certainly qualifies as a departure episode, it still progresses the seasonal arcs involving Nandor’s marriage, the Djinn, and Baby Colin. “Go Flip Yourself” is great for all the most memorable reasons, but it’s also great for all the brilliant little flourishes “What We Do in the Shadows” so regularly deploys. An obvious inclusion, and a correct one. —BT 8. Season 5, Episode 6, “Urgent Care” The trick that “Urgent Care” pulls off is equating the danger of taking Guillermo, with his Van Helsing blood and quasi-vampire status, to a backdoor familiar’s clinic with the danger of putting Colin Robinson in the same car as Emmy-nominated actor and apparent accent connoisseur John Slattery. The revelation of Colin actually having interesting stories (and an ex-boyfriend in Davy CrocketT) feels about on-par with the horrifying clinic sets which look like they’ve sat at the bottom of a fish tank that hasn’t been cleaned in a couple hundreds years. The episode is pretty laser-focused on Nadja eventually finding out Guillermo’s secret and on Nandor and Colin failing to revitalize the energy vampire, but it’s also full of tiny, hilarious touches —  Lazlo’s automatic “To the laboratory!” or CG frogs flying at the camera — that only a show in the confident swing of its fifth season can pull off and that feel as comfortable as Guillermo’s broken foot was painful. —SS 7. Season 3, Episode 10, “The Portrait” ‘What We Do in the Shadows’Russ Martin/FX May we all be so lucky one day to be able to commission Donal Logue, actual vampire, to paint us something at least on par with the painting of the grip he worked with on “ER.” “The Portrait” is an absolutely beautiful study in simmering tension and toxic roommate resentment, everyone’s grief and desires beautifully confused and intermixed. That alone would make it worth watching. But for a series that will, in the end, always return to its core dynamic of the vampires we love in the household that’s falling apart? “The Portrait” is maybe the show’s the most convincing bluff that it was blowing itself up to create a new status quo — with Guillermo and Nadja shipping off to England to the Worldwide Vampiric Council, Nandor on NJ Transit, and Laszlo discovering the horrifying, baby version of Colin Robinson, the Season 3 finale feels like it opens up a brave new world of darkness. —SS 6. Season 2, Episode 5, “Colin’s Promotion” In the annals of IndieWire lore, there was a time when the staff was at war. What sparked the vicious, violent, and ultimately fatal debate was forging a list not that different than this, but one that carried a single, costly caveat: When ranking the year’s best TV episodes, we could only include one episode per series. So, which Season 2 episode of “What We Do in the Shadows” was best: “Colin’s Promotion” (the wrong choice) or “On the Run” (the clear victor)? Thankfully, this list carries no such arbitrary provision, so I can act like the bigger person and honor my fallen, foolish brethren by giving “Colin’s Promotion” its rightful due (so long as it’s clear that “On the Run” remains the superior entry). Written by Shana Gohd and directed by series creator Jemaine Clement, Season 2, Episode 5 sees the resident energy vampire frustrated by the drawbacks inherent to his powers. His need to feed on energy means he’s a literal drain on anyone around him, which makes it difficult to find a partner, even in the short-term. But when Colin earns an unexpected promotion at work, his new position alters his fortunes at home, as well.  A savvy marriage of the show’s absurd sensibilities with the corporate world’s absurd value judgements, “Colin’s Promotion” is a serious flex of creativity, comedy, and connection. It works on its own, and within the greater context of “What We Do in the Shadows,” making it an easy choice for one of the series’ best. One of. Not the best. But maybe closer than you think. —BT 5. Season 3, Episode 6, “The Escape” After Nadja forgets to tell Nandor to feed The Sire, the oldest vampire in the world escapes his Vampiric Council quarters and is loose upon the city. The others fear that any harm befalling the Sire will end the existence of all his vampiric descendants, a concern that leads to digging up the Baron’s (Doug Jones) charred corpse to test the theory and learning that he is, in fact, not dead. Instead of a terrifying bloodbath, the episode ends with laughter and misunderstanding, and a sweet and elegant solution for both the Baron and the Sire (New Jersey!), as well as great gags like the runner of no one being able to pronounce the Sire’s human name and Laszlo swallowing a harmonica. —PK 4. Season 2, Episode 2, “Ghosts” ‘What We Do in the Shadows’Russ Martin/FX Out of all the types of undead, vampires are usually the least worried about unfinished business from their mortal lives. But our vampires’ normal lack of self-examination just makes “Ghosts” that much funnier. Despite Lazlo’s scientific protestations, the vampires are forced to perform a seance to remove a ghost infestation, only to be haunted afterwards by their human selves and/or a serious lack of updog. It is also marks the triumphant introduction into the Vampire Residence of Dolly, Nadja’s human and extremely horny soul that comes to inhabit a doll. “Ghosts” gently expands the world of the show ever so slightly, with new details about our vampires — Nandor’s most fulfilling mortal relationship being with his horse, John, high up there on the list — that we perhaps didn’t know before but that feel like we should’ve known all along. —SS 3. Season 1, Episode 6, “Baron’s Night Out” The Baron Afanas insists on a “night on the town” to see more of the new world, while the Staten Island vampires plot to kill the great vampire who they consider an unwelcome houseguest. They visit a convenience store, drink the blood of drunk and drugged people, and in Nandor’s words “Now I’m a wizard!” The murder plan takes a backseat to stopping the Baron from exposing the vampires altogether, and then to a very human night of vulnerability and bonding (and a bite of pizza that causes the Baron to be “propelled around by his own vomit”). The premise allows Novak, Berry, and Demetriou to make their characters even sillier than normal, and gives Jones a wonderful sendoff (for the time being…). —PK 2. Season 2, Episode 6, “On the Run” Where were you when you first heard the name Jackie Daytona? It’s a testament to the brilliance of “What We Do in the Shadows” and to Berry’s performance, Stefani Robinson’s writing, and Yana Gorskaya’s directing that this episode stands out for that name when it has another big one in the mix: Mark Hamill. Hamill plays Jim the vampire, who is on the hunt for Laszlo and forces him into hiding as American everyman Jackie Daytona (an alias with absolutely zero disguise, except for a perfectly placed toothpick). Though he misses his old life, Laszlo quickly comes to care for the community that takes him in, even if he ultimately rains down hellfire and destruction. —PK 1. Season 5, Episode 3, “Pride Parade”  ‘What We Do in the Shadows’FX Laslo agrees to create the float for Sean’s Pride parade — part of their human neighbor’s bid to run for Staten Island comptroller — but has quite a lot on his plate already with the experiments on Guillermo. Nadja’s ghost reveals that she died a virgin, so she and Nadja swap bodies with The Guide’s help in order to secure the ghost some carnal pleasure (including a particularly fucked up attempt to seduce Colin Robinson, but he likes it that way). Jealous of all the time that Guillermo is spending with Laszlo (and hurt by the indifference his new friend, a bird that flew through the window), Nandor brags about his flying abilities and decides to fly to outer space, complete with a GoPro and magnificently dopey view of his face as he ascends. Everything converges by episode’s end and just in time for the parade, where Guillermo’s begrudging and then unbridled enjoyment speaks for us all. —PK",
  "image": "https://www.indiewire.com/wp-content/uploads/2023/08/What-We-Do-in-the-Shadows-Season-5-cast.jpg?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003ePicking the best episodes of FX’s “\u003ca href=\"https://www.indiewire.com/t/what-we-do-in-the-shadows/\" id=\"auto-tag_what-we-do-in-the-shadows\" data-tag=\"what-we-do-in-the-shadows\"\u003eWhat We Do in the Shadows\u003c/a\u003e” is kind of like… well, like picking your favorite character on “What We Do in the Shadows.” Or your favorite guest star. Or your favorite aspect of the series created by \u003ca href=\"https://www.indiewire.com/t/jemaine-clement/\" id=\"auto-tag_jemaine-clement\" data-tag=\"jemaine-clement\"\u003eJemaine Clement\u003c/a\u003e and based on the film he made with Taika Waititi in 2014; it’s just wrong, impossible, unnatural — like vampires themselves, some might argue.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor the IndieWire team, this masochistic exercise was born from our denial that the series from showrunner \u003ca href=\"https://www.indiewire.com/t/paul-simms/\" id=\"auto-tag_paul-simms\" data-tag=\"paul-simms\"\u003ePaul Simms\u003c/a\u003e will end its run with Season 6, which premiered on October 21 with three episodes. Soon, fans will have seen \u003cem\u003eevery \u003c/em\u003eepisode of the entire show, and that’s a milestone we dread even while feeling gratitude that “Shadows” gets to end on its own terms and a high note.\n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235059738\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/features/interviews/the-diplomat-everything-to-remember-season-1-1235059738/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235059738\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"The Diplomat. Keri Russell as Kate Wyler in episode 103 of The Diplomat. Cr. Alex Bailey/Netflix © 2023\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/10/DIPLOMAT_103_Unit_04034R.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235059768\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235060776\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/business/disney-netflix-content-spend-2024-1235060776/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235060776\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"AGATHA ALL ALONG (DISNEY), CHIMP CRAZY (MAX), MONSTER (EVERETT/NETFLIX)\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C169 300w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=178%2C100 178w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=244%2C137 244w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=169%2C95 169w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=71%2C40 71w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=267%2C150 267w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=534%2C300 534w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=150%2C84 150w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=110%2C62 110w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=285%2C160 285w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=320%2C180 320w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=640%2C360 640w, https://www.indiewire.com/wp-content/uploads/2024/10/tony2-2-e1730216149922.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=800%2C450 800w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235060861\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003eTo celebrate the finale episodes and the triumph of this series, we picked 15 of the best episodes from Seasons 1 through 5 (Season 6 will be included after it ends). \u003c/p\u003e\n\n\n\n\u003ch3 id=\"15-season-1-episode-10-ancestry\"\u003e15. Season 1, Episode 10, “Ancestry”\u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1080\" src=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?w=650\" alt=\"WHAT WE DO IN THE SHADOWS -- \u0026#34;Ancestry\u0026#34; -- Season 1, Episode 10 (Airs May 29, 10:00 pm e/p) Pictured: Harvey Guillen as Guillermo. CR: Russ Martin/FX\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg 1920w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=300,169 300w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1024,576 1024w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1536,864 1536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=178,100 178w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=600,338 600w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=125,70 125w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=660,370 660w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1000,563 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=244,137 244w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1160,653 1160w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=169,95 169w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=71,40 71w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1200,675 1200w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=267,150 267w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=533,300 533w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1067,600 1067w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=150,84 150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=110,62 110w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=285,160 285w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=320,180 320w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=640,360 640w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=800,450 800w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_110_0022r.jpg?resize=1280,720 1280w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eRuss Martin/FX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWhen Guillermo (Harvey Guillén) sends the vampires’ DNA for testing, he also learns about his own Dutch roots and the Van Helsing bloodline. He and Colin Robinson (Mark Proksch) help Nandor contact direct descendant living nearby while Guillermo continues to fear the truth of his ancestry, which leads to her death from shock and to an excellent scene of the vampires trying to survive in church. Nadja (Natasia Demetriou) finds herself pining for her lover Gregor (Jake McDorman), who hears her singing and escapes a psychiatric facility to go be with her. When Gregor (“Jesk”) arrives at the mansion, Laszlo (Matt Berry) is furious, and makes a final stand for his love. —\u003cem\u003ePK\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"14-season-3-episode-8-the-wellness-center\"\u003e14. Season 3, Episode 8, “The Wellness Center”\u003c/h3\u003e\n\n\n\n\u003cp\u003eNandor (Kayvan Novak) falls into a bout of vampiric depression, and finds solace in a wellness center where vampires renounce their lifestyle and try to live as humans. The others reject this community (it’s a cult) but leave Nandor alone to spend his days jazzercising, ripping out his fangs, and learning the lyrics to “One Week” by the Barenaked Ladies (something only a human could do!), which accompanies a truly magnificent montage. The others let Nandor go without much fuss, but Guillermo can’t shake the concern for his old master and busts in to rescue him — leaving behind a carnage of vampiric casualties and coming home with a very brainwashed Nandor. “Wellness Center” is wildly enjoyable despite an unresolved cliffhanger ending, which speaks to just how solid everything else about it is and the fact that “Shadows” deserves a one-off sitcom romp as much as any traditional show. —\u003cem\u003ePK\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"13-season-1-episode-8-citizenship\"\u003e13. Season 1, Episode 8, “Citizenship”\u003c/h3\u003e\n\n\n\n\u003cp\u003eWe can only hope that government workers are still so dead inside they cannot be hypnotized for selfish and/or nefarious ends. “Citizenship,” coming as it does at the end of the first season, showcases much of what the show’s figured out about itself with perfect handoffs between the two plots of Nandor applying for American Citizenship and Nadja teaching Jenna (Beanie Feldstein) about her newfound vampiric abilities, as well as some fun visual effects and mason jars filled with blood (more associated with the latter, thankfully). Feldstein had other social situations to figuratively murder after she left the series, but it’s great to watch her do some literal murder at a frat rager after discovering the strength in what so many awkward girls already know is true about themselves: they are invisible at parties. —\u003cem\u003eSS\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"12-season-4-episode-3-the-grand-opening\"\u003e12. Season 4, Episode 3, “The Grand Opening”\u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1207\" src=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?w=650\" alt=\"“WHAT WE DO IN THE SHADOWS” -- “The Grand Opening” --  Season 4, Episode 3 (Airs July 19) — Pictured: Natasia Demetriou as Nadja, Kristen Schaal as The Guide.  CR: Russ Martin: FX\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg 1920w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=300,189 300w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1024,644 1024w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1536,966 1536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=159,100 159w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=600,377 600w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=297,187 297w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1000,629 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=244,153 244w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=250,156 250w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1160,729 1160w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=151,95 151w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=64,40 64w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1200,754 1200w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=267,168 267w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=536,337 536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1074,675 1074w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=239,150 239w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=477,300 477w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=954,600 954w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=150,94 150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=110,69 110w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=285,179 285w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=320,201 320w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=640,402 640w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=800,503 800w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps403-0296r.jpg?resize=1280,805 1280w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eRuss Martin/FX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eNot knowing what will happen during any given episode of “What We Do in the Shadows” is one of its greatest charms, but the series can also excel when leaning into its favorite tropes. Here, in the third episode of Season 4, that means committing to the joke and introducing fresh rules to vampire lore. The former trait can be seen twice over: first, in opening Nadja’s vampire nightclub. What could’ve been one of the crew’s quickly discarded quips instead blossoms into a fully realized business endeavor that runs throughout Season 4. Seeing Nadja in boss mode is always a treat and forcing her to work with Guillermo (the accountant) and the Guide (Kristen Schaal) — who technically oversees the space — helps keep the scene hot. \n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eBut the second way “The Grand Opening” commits to the joke is by literally committing to a joke: specifically, a dick joke. Nandor wants to use one of the wishes granted by the Djinn (Anoop Desai) to get a bigger penis, but Guillermo wisely cautions him to phrase his wish with caution. Since the Djinn enjoys finding loopholes, a stray word here or there could have catastrophic drawbacks. So, acting exactly like any man presented with a similar opportunity would act, Nandor devotes himself entirely to finding the precise words needed to endow him with the world’s most perfect penis. Of course, he still comes up short, but the effort devoted to such a silly endeavor is so, so funny (in no small part because it’s also so very relatable). Finally, to save Nadja’s vampire nightclub — and marry her plot to Baby Colin’s — it’s revealed that vampires love child novelty acts. So when her first choice for entertainment falls through, it’s a tap-dancing Colin to the rescue! Wow, I guess you really can’t predict what will happen next. Bless this show. \u003cem\u003e—BT\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"11-season-2-episode-4-the-curse\"\u003e11. Season 2, Episode 4, “The Curse”\u003c/h3\u003e\n\n\n\n\u003cp\u003eNandor checks his email for the first time in a decade to find a chain email claiming to be cursed. Terrified, he and Laszlo and Nadja try to come up with ten email addresses that they can forward the message to before Bloody Mary comes for them (remember what happened to Ariana??). The problem could have been easily solved by Guillermo, but he’s out for the evening with the group of vampire hunters he infiltrated and they surprise him with immediate plans for a hunt — at a house that sounds a lot like his master’s. The house turns out to be the wrong one, but still filled with vampires, forcing Guillermo to rely on his slaying skills and claiming the human life of Derek. —\u003cem\u003ePK\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"10-season-3-episode-4-the-casino\"\u003e10. Season 3, Episode 4 “The Casino”\u003c/h3\u003e\n\n\n\n\u003cp\u003eA weekend getaway to Atlantic City finds the vampires shirking their Vampiric Council duties in favor of Sean (Anthony Atamanuik) and Charmaine’s (Marissa Jaret Winokur) vow renewal and endless gambling, frivolity, and pretending to consume alcohol. The debauchery gets cut short when the vampires struggle to slumber and realize that housekeeping swept away their ancestral dirt. Guillermo flies to Europe to gather soil from all their home countries, while Laszlo wrestles with guilt over stealing Sean’s money for the plane tickets, Nadja tries to swindle men who she thinks are the original Rat Pack, and Nandor spirals into a “Big Bang Theory” rabbit hole (bazinga!). It’s always riotous to see the vampires in human settings when they aren’t hunting, and Novak, Berry, and Demetriou get to flex their physical comedy as the vampires’ power weakens. —\u003cem\u003ePK\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"9-season-4-episode-8-go-flip-yourself\"\u003e9. Season 4, Episode 8 – “Go Flip Yourself!”\u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1866\" height=\"1154\" src=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?w=650\" alt=\"“WHAT WE DO IN THE SHADOWS”  -- ‘Go Flip Yourself” -- Season 4, Episode 8 (Airs August 23) — Pictured: Matt Berry as Laszlo.  CR: Russ Martin/FX.\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg 1866w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=300,186 300w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1024,633 1024w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1536,950 1536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=162,100 162w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=600,371 600w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1000,618 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=244,151 244w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=250,156 250w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1160,717 1160w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=154,95 154w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=65,40 65w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1200,742 1200w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=272,168 272w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=545,337 545w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1091,675 1091w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=243,150 243w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=485,300 485w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=970,600 970w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=150,93 150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=110,68 110w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=285,176 285w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=320,198 320w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=640,396 640w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=800,495 800w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD4-Eps407-0818R.jpg?resize=1280,792 1280w\" sizes=\"(max-width: 1866px) 100vw, 1866px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eRuss Martin/FX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eSometimes the obvious choices are also the right choices. “Go Flip Yourself” — which is presented as an episode of Laszlo’s favorite home improvement show, “Go Flip Yourself” — is an easy pick for a list like this. Its framing device distinguishes the Season 4 entry from other episodes. It’s a big swing, even in a series that’s always eager to get weird. And it’s got a big twist ending (with a celebrity guest), which only further elevates the entry in fans’ memories. All these things are true, and all these things are great, but the devil’s in the details: Remember how Nadja kills one of the co-hosts as soon as they enter the house? Or what about the spot-on intro, pre-commercial teases, and insanely bright lighting? And while this certainly qualifies as a departure episode, it still progresses the seasonal arcs involving Nandor’s marriage, the Djinn, and Baby Colin. “Go Flip Yourself” is great for all the most memorable reasons, but it’s also great for all the brilliant little flourishes “What We Do in the Shadows” so regularly deploys. An obvious inclusion, and a correct one. \u003cem\u003e—BT\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"8-season-5-episode-6-urgent-care\"\u003e8. Season 5, Episode 6, “Urgent Care”\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe trick that “Urgent Care” pulls off is equating the danger of taking Guillermo, with his Van Helsing blood and quasi-vampire status, to a backdoor familiar’s clinic with the danger of putting Colin Robinson in the same car as Emmy-nominated actor and apparent accent connoisseur John Slattery. The revelation of Colin actually having interesting stories (and an ex-boyfriend in Davy CrocketT) feels about on-par with the horrifying clinic sets which look like they’ve sat at the bottom of a fish tank that hasn’t been cleaned in a couple hundreds years. The episode is pretty laser-focused on Nadja eventually finding out Guillermo’s secret and on Nandor and Colin failing to revitalize the energy vampire, but it’s also full of tiny, hilarious touches —  Lazlo’s automatic “To the laboratory!” or CG frogs flying at the camera — that only a show in the confident swing of its fifth season can pull off and that feel as comfortable as Guillermo’s broken foot was painful. —\u003cem\u003eSS\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"7-season-3-episode-10-the-portrait\"\u003e7. Season 3, Episode 10, “The Portrait”\u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1118\" src=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?w=650\" alt=\"“WHAT WE DO IN THE SHADOWS” -- “The Portrait” --  Season 3, Episode 10 (Airs October 28) — Pictured: Harvey Guillén as Guillermo, Kayvan Novak as Nandor.  CR: Russ Martin/FX\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg 1920w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=300,175 300w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1024,596 1024w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1536,894 1536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=172,100 172w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=600,349 600w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1000,582 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=244,142 244w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1160,675 1160w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=163,95 163w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=69,40 69w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1200,699 1200w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=289,168 289w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=579,337 579w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1159,675 1159w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=258,150 258w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=515,300 515w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1030,600 1030w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=150,87 150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=110,64 110w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=285,166 285w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=320,186 320w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=640,373 640w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=800,466 800w, https://www.indiewire.com/wp-content/uploads/2024/10/WWD3-Eps310-0170r.jpg?resize=1280,745 1280w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eRuss Martin/FX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eMay we all be so lucky one day to be able to commission Donal Logue, actual vampire, to paint us something at least on par with the painting of the grip he worked with on “ER.” “The Portrait” is an absolutely beautiful study in simmering tension and toxic roommate resentment, everyone’s grief and desires beautifully confused and intermixed. That alone would make it worth watching. But for a series that will, in the end, always return to its core dynamic of the vampires we love in the household that’s falling apart? “The Portrait” is maybe the show’s the most convincing bluff that it was blowing itself up to create a new status quo — with Guillermo and Nadja shipping off to England to the Worldwide Vampiric Council, Nandor on NJ Transit, and Laszlo discovering the horrifying, baby version of Colin Robinson, the Season 3 finale feels like it opens up a brave new world of darkness. —\u003cem\u003eSS\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"6-season-2-episode-5-colin-s-promotion\"\u003e6. Season 2, Episode 5, “Colin’s Promotion”\u003c/h3\u003e\n\n\n\n\u003cp\u003eIn the annals of IndieWire lore, there was a time when the staff was at war. What sparked the vicious, violent, and ultimately fatal debate was forging a list not that different than this, but one that carried a single, costly caveat: When ranking the year’s best \u003ca href=\"https://www.indiewire.com/t/tv/\" id=\"auto-tag_tv\" data-tag=\"tv\"\u003eTV\u003c/a\u003e episodes, we could only include one episode per series. So, which Season 2 episode of “What We Do in the Shadows” was best: “Colin’s Promotion” (the wrong choice) or “On the Run” (the clear victor)?\u003c/p\u003e\n\n\n\n\u003cp\u003eThankfully, this list carries no such arbitrary provision, so I can act like the bigger person and honor my fallen, foolish brethren by giving “Colin’s Promotion” its rightful due (so long as it’s clear that “On the Run” remains the superior entry). Written by Shana Gohd and directed by series creator Jemaine Clement, Season 2, Episode 5 sees the resident energy vampire frustrated by the drawbacks inherent to his powers. His need to feed on energy means he’s a literal drain on anyone around him, which makes it difficult to find a partner, even in the short-term. But when Colin earns an unexpected promotion at work, his new position alters his fortunes at home, as well. \u003c/p\u003e\n\n\n\n\u003cp\u003eA savvy marriage of the show’s absurd sensibilities with the corporate world’s absurd value judgements, “Colin’s Promotion” is a serious flex of creativity, comedy, and connection. It works on its own, and within the greater context of “What We Do in the Shadows,” making it an easy choice for one of the series’ best. One of. Not \u003cem\u003ethe\u003c/em\u003e best. But maybe closer than you think. \u003cem\u003e—BT\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"5-season-3-episode-6-the-escape\"\u003e5. Season 3, Episode 6, “The Escape”\u003c/h3\u003e\n\n\n\n\u003cp\u003eAfter Nadja forgets to tell Nandor to feed The Sire, the oldest vampire in the world escapes his Vampiric Council quarters and is loose upon the city. The others fear that any harm befalling the Sire will end the existence of all his vampiric descendants, a concern that leads to digging up the Baron’s (Doug Jones) charred corpse to test the theory and learning that he is, in fact, not dead. Instead of a terrifying bloodbath, the episode ends with laughter and misunderstanding, and a sweet and elegant solution for both the Baron and the Sire (New Jersey!), as well as great gags like the runner of no one being able to pronounce the Sire’s human name and Laszlo swallowing a harmonica. —\u003cem\u003ePK\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"4-season-2-episode-2-ghosts\"\u003e4. Season 2, Episode 2, “Ghosts” \u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1127\" src=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?w=650\" alt=\"WHAT WE DO IN THE SHADOWS -- \u0026#34;Ghosts\u0026#34; -- Season 1, Episode 2 (Airs April 15) Pictured: Kayvan Novak as Nandor, Natasia Demetriou as Nadja. CR: Russ Martin/FX\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg 1920w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=300,176 300w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1024,601 1024w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1536,902 1536w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=170,100 170w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=600,352 600w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1000,587 1000w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=244,143 244w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1160,681 1160w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=162,95 162w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=68,40 68w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1200,704 1200w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=286,168 286w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=574,337 574w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1150,675 1150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=256,150 256w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=511,300 511w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1022,600 1022w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=150,88 150w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=110,65 110w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=285,167 285w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=320,188 320w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=640,376 640w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=800,470 800w, https://www.indiewire.com/wp-content/uploads/2024/10/WWDITS_203_0027R.jpg?resize=1280,751 1280w\" sizes=\"(max-width: 1920px) 100vw, 1920px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eRuss Martin/FX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eOut of all the types of undead, vampires are usually the least worried about unfinished business from their mortal lives. But our vampires’ normal lack of self-examination just makes “Ghosts” that much funnier. Despite Lazlo’s scientific protestations, the vampires are forced to perform a seance to remove a ghost infestation, only to be haunted afterwards by their human selves and/or a serious lack of updog. It is also marks the triumphant introduction into the Vampire Residence of Dolly, Nadja’s human and extremely horny soul that comes to inhabit a doll. “Ghosts” gently expands the world of the show ever so slightly, with new details about our vampires — Nandor’s most fulfilling mortal relationship being with his horse, John, high up there on the list — that we perhaps didn’t know before but that feel like we should’ve known all along. —\u003cem\u003eSS\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"3-season-1-episode-6-baron-s-night-out\"\u003e3. Season 1, Episode 6, “Baron’s Night Out”\u003c/h3\u003e\n\n\n\n\u003cp\u003eThe Baron Afanas insists on a “night on the town” to see more of the new world, while the Staten Island vampires plot to kill the great vampire who they consider an unwelcome houseguest. They visit a convenience store, drink the blood of drunk and drugged people, and in Nandor’s words “Now I’m a wizard!” The murder plan takes a backseat to stopping the Baron from exposing the vampires altogether, and then to a very human night of vulnerability and bonding (and a bite of pizza that causes the Baron to be “propelled around by his own vomit”). The premise allows Novak, Berry, and Demetriou to make their characters even sillier than normal, and gives Jones a wonderful sendoff (for the time being…). —\u003cem\u003ePK\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003ch3 id=\"2-season-2-episode-6-on-the-run\"\u003e2. Season 2, Episode 6, “On the Run”\u003c/h3\u003e\n\n\n\n\u003cp\u003eWhere were you when you first heard the name Jackie Daytona? It’s a testament to the brilliance of “What We Do in the Shadows” and to Berry’s performance, Stefani Robinson’s writing, and Yana Gorskaya’s directing that this episode stands out for that name when it has another big one in the mix: Mark Hamill. Hamill plays Jim the vampire, who is on the hunt for Laszlo and forces him into hiding as American everyman Jackie Daytona (an alias with absolutely zero disguise, except for a perfectly placed toothpick). Though he misses his old life, Laszlo quickly comes to care for the community that takes him in, even if he ultimately rains down hellfire and destruction. —\u003cem\u003ePK\u003c/em\u003e\n\n\u003c/p\u003e\n\n\n\n\u003ch3 id=\"1-season-5-episode-3-pride-parade\"\u003e1. Season 5, Episode 3, “Pride Parade” \u003c/h3\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"3000\" height=\"1948\" src=\"https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?w=650\" alt=\"“WHAT WE DO IN THE SHADOWS” -- “Pride Parade” --  Season 5, Episode 3 (Airs July 20) — Pictured:  Matt Berry as Laszlo.  CR: Russ Martin/FX\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg 3000w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=300,195 300w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1024,665 1024w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1536,997 1536w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=2048,1330 2048w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=154,100 154w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=600,390 600w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=288,187 288w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1000,649 1000w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=244,158 244w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1160,753 1160w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=146,95 146w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=62,40 62w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1200,779 1200w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=259,168 259w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=519,337 519w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1040,675 1040w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=231,150 231w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=462,300 462w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=924,600 924w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=150,97 150w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=110,71 110w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=285,185 285w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=320,208 320w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=640,416 640w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=800,519 800w, https://www.indiewire.com/wp-content/uploads/2024/08/WWD5-Eps503-0397r.jpg?resize=1280,831 1280w\" sizes=\"(max-width: 3000px) 100vw, 3000px\"/\u003e\u003cfigcaption\u003e‘What We Do in the Shadows’\u003ccite\u003eFX\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eLaslo agrees to create the float for Sean’s Pride parade — part of their human neighbor’s bid to run for Staten Island comptroller — but has quite a lot on his plate already with the experiments on Guillermo. Nadja’s ghost reveals that she died a virgin, so she and Nadja swap bodies with The Guide’s help in order to secure the ghost some carnal pleasure (including a particularly fucked up attempt to seduce Colin Robinson, but he likes it that way). Jealous of all the time that Guillermo is spending with Laszlo (and hurt by the indifference his new friend, a bird that flew through the window), Nandor brags about his flying abilities and decides to fly to outer space, complete with a GoPro and magnificently dopey view of his face as he ascends. Everything converges by episode’s end and just in time for the parade, where Guillermo’s begrudging and then unbridled enjoyment speaks for us all. —\u003cem\u003ePK\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2024-10-29T23:30:00Z",
  "modifiedTime": "2024-10-29T20:20:14Z"
}
