{
  "id": "9eca9917-e5bb-47b4-833b-049940474e45",
  "title": "Wendy Williams’ Guardian Sabrina Morrissey Faces Backlash After Breakfast Club Interview",
  "link": "https://www.comingsoon.net/guides/news/1906965-sabrina-morrissey-wendy-williams-guardian-faces-backlash-breakfast-club",
  "description": "Wendy Williams calls her conservatorship a prison, sparking #FreeWendy support. The post Wendy Williams’ Guardian Sabrina Morrissey Faces Backlash After Breakfast Club Interview appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Shazmeen Navrange",
  "published": "Sat, 18 Jan 2025 00:41:32 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Pop Culture",
    "Sabrina Morrissey",
    "Wendy Williams"
  ],
  "byline": "Shazmeen Navrange",
  "length": 2113,
  "excerpt": "Discover Wendy Williams' candid interview about her legal guardian, Sabrina Morrissey, and the challenges she faces under conservatorship.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Noted media personality Wendy Williams has broken her silence about her legal guardian, Sabrina Morrissey, in a recent Breakfast Club interview. Williams, placed under conservatorship due to her battle with frontotemporal dementia and aphasia, spoke about feeling confined in her care facility and lacking proper communication access. Her comments have sparked intense debate online, drawing widespread attention. Here are the details: Sabrina Morrissey faces backlash after Wendy Williams’ Breakfast Club interview Wendy Williams appeared on the Breakfast Club, discussing the challenges she faces under her conservatorship. For context, a conservatorship is a legal arrangement where a court appoints a guardian to make decisions for individuals unable to do so due to health or psychological issues. In the interview, Wendy Williams denied being “cognitively impaired.” She described her experience at the New York care facility as feeling like “prison” (via Variety). She revealed she has only $15 to her name. Her guardian, Morrissey, took away her previous phone. Now, she uses a cellphone that only allows outgoing calls, which leaves her feeling isolated. Williams became emotional as she shared her struggles, describing her conservatorship as deeply restrictive. Her niece, Alex Finnie, joined her during the interview, offering support as Williams recounted her experiences. Her emotional revelations have fueled public outcry, with fans rallying around her using the hashtag #FreeWendy. Fans took to social media, accusing Morrissey of mistreating Williams and effectively holding her captive. Many drew parallels between Williams’ situation and Britney Spears’ conservatorship, launching petitions and campaigns to advocate for her freedom. Supporters urge others to voice their concerns about the alleged mistreatment. They call for justice for Williams and hope for a resolution similar to Spears’ case. Messages of support flood social media platforms. The #FreeWendy movement gains global traction, amplifying calls for accountability and transparency in guardianship cases.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/MixCollage-18-Jan-2025-11-36-AM-2089.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNoted media personality \u003ca href=\"https://www.comingsoon.net/tag/wendy-williams\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eWendy Williams\u003c/strong\u003e\u003c/a\u003e has broken her silence about her legal guardian, \u003cstrong\u003eSabrina Morrissey\u003c/strong\u003e, in a recent \u003cstrong\u003eBreakfast Club interview\u003c/strong\u003e. Williams, placed under conservatorship due to her battle with frontotemporal dementia and aphasia, spoke about feeling confined in her care facility and lacking proper communication access. \u003c/p\u003e\n\n\n\n\u003cp\u003eHer comments have sparked intense debate online, drawing widespread attention. Here are the details:\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-sabrina-morrissey-faces-backlash-after-wendy-williams-breakfast-club-interview\"\u003eSabrina Morrissey faces backlash after Wendy Williams’ Breakfast Club interview\u003c/h2\u003e\n\n\n\n\u003cp\u003eWendy Williams appeared on the \u003ca href=\"https://www.youtube.com/watch?v=bQ03Qson7AI\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBreakfast Club\u003c/a\u003e, discussing the challenges she faces under her conservatorship. For context, a conservatorship is a legal arrangement where a court appoints a guardian to make decisions for individuals unable to do so due to health or psychological issues.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the interview, Wendy Williams denied being “cognitively impaired.” She described her experience at the New York care facility as feeling like “prison” (via \u003ca href=\"https://variety.com/2025/tv/global/wendy-williams-speaks-out-guardianship-like-in-prison-1236275608/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eVariety\u003c/a\u003e). She revealed she has only $15 to her name. Her guardian, Morrissey, took away her previous phone. Now, she uses a cellphone that only allows outgoing calls, which leaves her feeling isolated.\u003c/p\u003e\n\n\n\n\u003cp\u003eWilliams became emotional as she shared her struggles, describing her conservatorship as deeply restrictive. Her niece, Alex Finnie, joined her during the interview, offering support as Williams recounted her experiences. Her emotional revelations have fueled public outcry, with fans rallying around her using the hashtag #FreeWendy.\u003c/p\u003e\n\n\n\n\u003cp\u003eFans took to social media, accusing Morrissey of mistreating Williams and effectively holding her captive. Many drew parallels between Williams’ situation and Britney Spears’ conservatorship, launching petitions and campaigns to advocate for her freedom.\u003c/p\u003e\n\n\n\n\u003cp\u003eSupporters urge others to voice their concerns about the alleged mistreatment. They call for justice for Williams and hope for a resolution similar to Spears’ case. Messages of support flood social media platforms. The #FreeWendy movement gains global traction, amplifying calls for accountability and transparency in guardianship cases.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-18T00:41:32Z",
  "modifiedTime": "2025-01-18T00:41:47Z"
}
