{
  "id": "aef5e142-56e7-43fa-bf66-25f3e3f23fd6",
  "title": "Sunrise On The Reaping: Glenn Close And Billy Porter Join The Cast",
  "link": "https://bleedingcool.com/movies/sunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast/",
  "description": "Glenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.",
  "author": "Kaitlyn Booth",
  "published": "Mon, 16 Jun 2025 17:52:03 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Lionsgate",
    "Movies",
    "the hunger games: sunrise on"
  ],
  "byline": "Kaitlyn Booth",
  "length": 7411,
  "excerpt": "It seems The Hunger Games: Sunrise on the Reaping casting wasn't quite done yet, and they're coming out swinging with some big names. Over the last month or so, Lionsgate has been slowly announcing the cast for the next Hunger Games film, and it was a mixture of new faces, some up-and-comers, and some veteran actors […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Lionsgate, Movies | Tagged: the hunger games: sunrise onGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.Article Summary Glenn Close and Billy Porter join The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift. Lionsgate unveils casting news with producer Nina Jacobson praising Close and Porter's unique talents. Close will play District 12's eccentric escort, while Porter takes on the role of her estranged designer husband. The film dives into Panem’s history, set 24 years before the original saga, and releases November 20, 2026. It seems The Hunger Games: Sunrise on the Reaping casting wasn't quite done yet, and they're coming out swinging with some big names. Over the last month or so, Lionsgate has been slowly announcing the cast for the next Hunger Games film, and it was a mixture of new faces, some up-and-comers, and some veteran actors with a ton of experience behind them. These next two additions are absolutely the latter, and you already know they will have a ball in this film. According to a press release sent out by Lionsgate, Glenn Close has been cast as Drusilla Sickle, the escort to the District 12 Tributes, while Billy Porter has been cast as Magno Stift, her estranged husband and the Tributes' uninspired designer. Producer Nina Jacobson said in the press release, \"Glenn Close is a dream Drusilla. She brings so much of her intellect and imagination to each role, creating characters who are unforgettable and iconic. I think Glenn and Francis will have a ball bringing Drusilla from the page to the screen.\" Regarding Porter, Jacobson added, \"Billy is one of those rare performers who can dazzle and devastate in equal measure on stage and screen. He made an indelible impression on me when we worked together on Pose, both as an actor and a human being. Casting this show has felt like winning the lottery every time one of our idols said yes to us. To be able to announce Glenn Close and Billy Porter together is an embarrassment of riches that we can all celebrate.\" Have we reached the end of the line for Sunrise on the Reaping casting? L-R: Glenn Close Photo Credit: Andy Anderson | Billy Porter Photo Credit: Afshin Feiz (via Lionsgate PR) The Hunger Games: Sunrise on the Reaping Book Summary Summary: \"Sunrise on the Reaping will revisit the world of Panem twenty-four years before the events of The Hunger Games, starting on the morning of the reaping of the Fiftieth Hunger Games, also known as the Second Quarter Quell. As the day dawns on the fiftieth annual Hunger Games, fear grips the districts of Panem. This year, in honor of the Quarter Quell, twice as many tributes will be taken from their homes. Back in District 12, Haymitch Abernathy is trying not to think too hard about his chances. All he cares about is making it through the day and being with the girl he loves. When Haymitch's name is called, he can feel all his dreams break. He's torn from his family and his love, shuttled to the Capitol with the three other District 12 tributes: a young friend who's nearly a sister to him, a compulsive oddsmaker, and the most stuck-up girl in town. As the Games begin, Haymitch understands he's been set up to fail. But there's something in him that wants to fight . . . and have that fight reverberate far beyond the deadly arena.\" The film adaptation of The Hunger Games: Sunrise on the Reaping will be released on November 20, 2026. Francis Lawrence will direct from a screenplay adaptation by Billy Ray. Color Force's Nina Jacobson and Brad Simpson will produce. Cameron MacConomy will executive produce. The cast so far includes Joseph Zada as Haymitch Abernathy, Whitney Peak as Haymitch's girlfriend, Lenore Dove Baird, Mckenna Grace as Maysilee Donner, Haymitch's fellow District 12 Tribute, Jesse Plemons as a young Plutarch Heavensbee, Kelvin Harrison Jr. as Beetee, Maya Hawke as Wiress, Lili Taylor as Mags Flanagan, Ben Wang as Wyatt Callow, Ralph Fiennes as President Snow, Elle Fanning as Effie Trinket, Iona Bell as Lou Lou, Molly McCann as Louella, and Kieran Culkin as Caesar Flickerman. While The Ballad of Songbirds \u0026 Snakes' success will likely shut up anyone who does the whole \"who asked for this\" dance, this is your reminder that Rachel Zegler very much asked for Sunrise on the Reaping to exist. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.Latest by Kaitlyn BoothSunrise On The Reaping: Glenn Close And Billy Porter Join The CastGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.A Big Bold Beautiful Journey: New Poster, 1 BTS Image, And 4 HQ ImagesSony Pictures released a new poster, a behind-the-scenes image, and four high-quality images for the upcoming film, A Big Bold Beautiful Journey.The Naked Gun: Chair Puns \u0026 Spirit Halloween Jokes In The New TrailerThe official trailer for the remake of The Naked Gun is here and it features a chair pun, a play on words featuring \"manslaughter,\" and a Spirit Halloween joke.The Naked Gun: New Poster Released, Official Trailer Drops TomorrowParamount Pictures dropped a new poster for the upcoming remake of The Naked Gun. The official trailer will be released tomorrow.The Batman Part II: James Gunn Says He'll See The Script \"Shortly\"Director and writer Matt Reeves hasn't turned in the script for The Batman Part II yet, but James Gunn says they should be seeing it \"shortly.\"LAIKA's ParaNorman Is Returning To Theaters This OctoberLAIKA's 2012 underrated masterpiece, ParaNorman, will be remastered and released in theaters this October by Fathom Entertainment.Latest in MoviesSunrise On The Reaping: Glenn Close And Billy Porter Join The CastGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.A Big Bold Beautiful Journey: New Poster, 1 BTS Image, And 4 HQ ImagesSony Pictures released a new poster, a behind-the-scenes image, and four high-quality images for the upcoming film, A Big Bold Beautiful Journey.The Naked Gun: Chair Puns \u0026 Spirit Halloween Jokes In The New TrailerThe official trailer for the remake of The Naked Gun is here and it features a chair pun, a play on words featuring \"manslaughter,\" and a Spirit Halloween joke.Alien: Earth Key Art Poster Sees Our Planet Going Through Some ChangesArriving August 12th, check out the newest key art poster released by FX Networks for Noah Hawley's Sydney Chandler-starring Alien: Earth.How To Train Your Dragon Packs Theaters For Father's DayHow To Train Your Dragon opened well above tracking and dethroned Disney's Lilo \u0026 Stitch on top of the box office.James Gunn on What DC Studios Learned From Marvel Studios RollbackJames Gunn on Marvel Studios growing and then rolling back the number of MCU films and series, and what DC Studios learned from that.",
  "image": "https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n\u003csection\u003e\u003carticle id=\"article\" data-post-id=\"2238041\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/lionsgate/\" rel=\"category\"\u003eLionsgate\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/the-hunger-games-sunrise-on/\" rel=\"tag\"\u003ethe hunger games: sunrise on\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eGlenn Close and Billy Porter join The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift.\u003c/li\u003e\n\u003cli\u003eLionsgate unveils casting news with producer Nina Jacobson praising Close and Porter\u0026#39;s unique talents.\u003c/li\u003e\n\u003cli\u003eClose will play District 12\u0026#39;s eccentric escort, while Porter takes on the role of her estranged designer husband.\u003c/li\u003e\n\u003cli\u003eThe film dives into Panem’s history, set 24 years before the original saga, and releases November 20, 2026.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"560\" height=\"315\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/Giio1WAh-Bc?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/Giio1WAh-Bc/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/Giio1WAh-Bc\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eIt seems \u003cem\u003eThe Hunger Games: Sunrise on the Reaping\u003c/em\u003e casting wasn\u0026#39;t quite done yet, and they\u0026#39;re coming out swinging with some big names. Over the last month or so, Lionsgate has been slowly announcing the cast for the next Hunger Games film, and it was a mixture of new faces, some up-and-comers, and some veteran actors with a ton of experience behind them. These next two additions are absolutely the latter, and you already know they will have a ball in this film. \u003cspan\u003eAccording to a press release sent out by Lionsgate, \u003cstrong\u003eGlenn Close\u003c/strong\u003e \u003ca href=\"https://youtu.be/Giio1WAh-Bc\"\u003ehas been cast\u003c/a\u003e as Drusilla Sickle, the escort to the District 12 Tributes, while \u003cstrong\u003eBilly Porter\u003c/strong\u003e \u003ca href=\"https://youtu.be/_QqVmJDMwVk\"\u003ehas been cast\u003c/a\u003e as Magno Stift, her estranged husband and the Tributes\u0026#39; uninspired designer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eProducer \u003cstrong\u003eNina Jacobson\u003c/strong\u003e said in the press release, \u0026#34;Glenn Close is a dream Drusilla. She brings so much of her intellect and imagination to each role, creating characters who are unforgettable and iconic. I think Glenn and Francis will have a ball bringing Drusilla from the page to the screen.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ciframe width=\"560\" height=\"315\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/_QqVmJDMwVk?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/_QqVmJDMwVk/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/_QqVmJDMwVk\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eRegarding Porter, Jacobson added, \u0026#34;Billy is one of those rare performers who can dazzle and devastate in equal measure on stage and screen. He made an indelible impression on me when we worked together on Pose, both as an actor and a human being. Casting this show has felt like winning the lottery every time one of our idols said yes to us. To be able to announce Glenn Close and Billy Porter together is an embarrassment of riches that we can all celebrate.\u0026#34;\u003c/p\u003e\n\u003cp\u003eHave we reached the end of the line for \u003cem\u003eSunrise on the Reaping\u003c/em\u003e casting?\u003c/p\u003e\n\u003cfigure id=\"attachment_2238042\" aria-describedby=\"caption-attachment-2238042\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" alt=\"A split image features Glenn Close, a white woman with short, wavy gray hair and striking green eyes, wearing a white blouse, and Billy Porter, a Black man dressed in black with a large hat and a statement necklace, posing on a stool against a dark background.\" width=\"600\" height=\"400\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:400/q:75/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20400%22%20width%3D%22600%22%20height%3D%22400%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-2238042\"\u003eL-R: Glenn Close Photo Credit: Andy Anderson | Billy Porter Photo Credit: Afshin Feiz (via Lionsgate PR)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003ch2\u003eThe Hunger Games: Sunrise on the Reaping Book Summary\u003c/h2\u003e\n\u003cp\u003eSummary: \u0026#34;\u003cem\u003eSunrise on the Reaping\u003c/em\u003e will revisit the world of Panem twenty-four years before the events of \u003cem\u003eThe Hunger Games\u003c/em\u003e, starting on the morning of the reaping of the Fiftieth Hunger Games, also known as the Second Quarter Quell.\u003c/p\u003e\n\u003cp\u003eAs the day dawns on the fiftieth annual \u003cem\u003eHunger Games\u003c/em\u003e, fear grips the districts of Panem. This year, in honor of the Quarter Quell, twice as many tributes will be taken from their homes. Back in District 12, Haymitch Abernathy is trying not to think too hard about his chances. All he cares about is making it through the day and being with the girl he loves. When Haymitch\u0026#39;s name is called, he can feel all his dreams break. He\u0026#39;s torn from his family and his love, shuttled to the Capitol with the three other District 12 tributes: a young friend who\u0026#39;s nearly a sister to him, a compulsive oddsmaker, and the most stuck-up girl in town. As the Games begin, Haymitch understands he\u0026#39;s been set up to fail. But there\u0026#39;s something in him that wants to fight . . . and have that fight reverberate far beyond the deadly arena.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe film adaptation of \u003cem\u003eThe Hunger Games: Sunrise on the Reaping\u003c/em\u003e will be released on November 20, 2026. Francis Lawrence will direct from a screenplay adaptation by \u003cstrong\u003eBilly Ray\u003c/strong\u003e. Color Force\u0026#39;s \u003cstrong\u003eNina Jacobson\u003c/strong\u003e and \u003cstrong\u003eBrad Simpson\u003c/strong\u003e will produce. \u003cstrong\u003eCameron MacConomy\u003c/strong\u003e will executive produce. The cast so far includes \u003cstrong\u003eJoseph Zada\u003c/strong\u003e as Haymitch Abernathy, \u003cstrong\u003eWhitney Peak\u003c/strong\u003e as Haymitch\u0026#39;s girlfriend, Lenore Dove Baird, \u003cstrong\u003eMckenna Grace\u003c/strong\u003e as Maysilee Donner, Haymitch\u0026#39;s fellow District 12 Tribute, \u003cstrong\u003eJesse Plemons\u003c/strong\u003e as a young Plutarch Heavensbee, \u003cstrong\u003eKelvin Harrison Jr.\u003c/strong\u003e as Beetee, \u003cstrong\u003eMaya Hawke\u003c/strong\u003e as Wiress, \u003cstrong\u003eLili Taylor\u003c/strong\u003e as Mags Flanagan, \u003cstrong\u003eBen Wang\u003c/strong\u003e as Wyatt Callow, \u003cstrong\u003eRalph Fiennes\u003c/strong\u003e as President Snow, \u003cstrong\u003eElle Fanning\u003c/strong\u003e as Effie Trinket, \u003cstrong\u003eIona Bell\u003c/strong\u003e as Lou Lou, \u003cstrong\u003eMolly McCann\u003c/strong\u003e as Louella, and \u003cstrong\u003eKieran Culkin\u003c/strong\u003e as Caesar Flickerman. While \u003cem\u003eThe Ballad of Songbirds \u0026amp; Snakes\u0026#39; success\u003c/em\u003e will likely shut up anyone who does the whole \u0026#34;who asked for this\u0026#34; dance, this is your reminder that \u003cstrong\u003eRachel Zegler\u003c/strong\u003e very much asked for \u003cem\u003eSunrise on the Reaping\u003c/em\u003e to exist.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fsunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fsunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast%2F\u0026amp;text=Sunrise+On+The+Reaping%3A+Glenn+Close+And+Billy+Porter+Join+The+Cast\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fsunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast%2F\u0026amp;description=Sunrise+On+The+Reaping%3A+Glenn+Close+And+Billy+Porter+Join+The+Cast\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fsunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast%2F\u0026amp;title=Sunrise+On+The+Reaping%3A+Glenn+Close+And+Billy+Porter+Join+The+Cast\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003cdiv id=\"read_more\"\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/author/kbooth/\" rel=\"bookmark\"\u003eLatest by Kaitlyn Booth\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/sunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" alt=\"A split image features Glenn Close, a white woman with short, wavy gray hair and striking green eyes, wearing a white blouse, and Billy Porter, a Black man dressed in black with a large hat and a statement necklace, posing on a stool against a dark background.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/sunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast/\"\u003e\u003ch3 rel=\"bookmark\"\u003eSunrise On The Reaping: Glenn Close And Billy Porter Join The Cast\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/a-big-bold-beautiful-journey-new-poster-1-bts-image-and-4-hq-images/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF_02636_02675_r_2000x1333_thumbnail.jpg\" alt=\"Three people engaged in conversation outdoors, surrounded by greenery; one person wears a red patterned top and brown knee-high boots, while another is in a navy jacket, and the third wears a black jacket. A black car is visible in the background.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF_02636_02675_r_2000x1333_thumbnail.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/a-big-bold-beautiful-journey-new-poster-1-bts-image-and-4-hq-images/\"\u003e\u003ch3 rel=\"bookmark\"\u003eA Big Bold Beautiful Journey: New Poster, 1 BTS Image, And 4 HQ Images\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSony Pictures released a new poster, a behind-the-scenes image, and four high-quality images for the upcoming film, A Big Bold Beautiful Journey.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-chair-puns-spirit-halloween-jokes-in-the-new-trailer/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_03135R3.jpg\" alt=\"A scene from The Naked Gun featuring two men, one holding a coffee cup and wearing a white shirt with a tie, and another in a gray suit with crossed arms, both appearing concerned. The background is dimly lit, hinting at a tense atmosphere.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_03135R3.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-chair-puns-spirit-halloween-jokes-in-the-new-trailer/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Naked Gun: Chair Puns \u0026amp; Spirit Halloween Jokes In The New Trailer\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe official trailer for the remake of The Naked Gun is here and it features a chair pun, a play on words featuring \u0026#34;manslaughter,\u0026#34; and a Spirit Halloween joke.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-new-poster-released-official-trailer-drops-tomorrow/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_05648R2.jpg\" alt=\"A scene from \u0026#39;The Naked Gun\u0026#39; featuring characters Beth and Frank, played by Pamela Anderson and Liam Neeson, in an intimate moment in a kitchen setting.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_05648R2.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-new-poster-released-official-trailer-drops-tomorrow/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Naked Gun: New Poster Released, Official Trailer Drops Tomorrow\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eParamount Pictures dropped a new poster for the upcoming remake of The Naked Gun. The official trailer will be released tomorrow.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-batman-part-ii-james-gunn-says-hell-see-the-script-shortly/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/matt-reeves.jpg\" alt=\"A man with a mustache speaks animatedly, wearing a brown jacket over a dark shirt, in a dimly lit setting with warm lighting. The background features a blurred view of books and instruments.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/matt-reeves.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-batman-part-ii-james-gunn-says-hell-see-the-script-shortly/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Batman Part II: James Gunn Says He\u0026#39;ll See The Script \u0026#34;Shortly\u0026#34;\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eDirector and writer Matt Reeves hasn\u0026#39;t turned in the script for The Batman Part II yet, but James Gunn says they should be seeing it \u0026#34;shortly.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/laikas-paranorman-is-returning-to-theaters-this-october/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/PAR_Teaser_2674x3960px_72dpi_RGB.jpg\" alt=\"A colorful, stylized illustration of a boy with a shocked expression, featuring various text and imagery related to \u0026#39;ParaNorman\u0026#39; and Halloween. The artwork highlights the film\u0026#39;s remastered 3D release in theaters.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/PAR_Teaser_2674x3960px_72dpi_RGB.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/laikas-paranorman-is-returning-to-theaters-this-october/\"\u003e\u003ch3 rel=\"bookmark\"\u003eLAIKA\u0026#39;s ParaNorman Is Returning To Theaters This October\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLAIKA\u0026#39;s 2012 underrated masterpiece, ParaNorman, will be remastered and released in theaters this October by Fathom Entertainment.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2\u003e\u003ca href=\"https://bleedingcool.com/movies/\" rel=\"bookmark\"\u003eLatest in Movies\u003c/a\u003e\u003c/h2\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/sunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" alt=\"A split image features Glenn Close, a white woman with short, wavy gray hair and striking green eyes, wearing a white blouse, and Billy Porter, a Black man dressed in black with a large hat and a statement necklace, posing on a stool against a dark background.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/glenn-close-billy-porter.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/sunrise-on-the-reaping-glenn-close-and-billy-porter-join-the-cast/\"\u003e\u003ch3 rel=\"bookmark\"\u003eSunrise On The Reaping: Glenn Close And Billy Porter Join The Cast\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eGlenn Close and Billy Porter have joined the cast of The Hunger Games: Sunrise on the Reaping as Drusilla Sickle and Magno Stift, respectively.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/a-big-bold-beautiful-journey-new-poster-1-bts-image-and-4-hq-images/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF_02636_02675_r_2000x1333_thumbnail.jpg\" alt=\"Three people engaged in conversation outdoors, surrounded by greenery; one person wears a red patterned top and brown knee-high boots, while another is in a navy jacket, and the third wears a black jacket. A black car is visible in the background.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/DF_02636_02675_r_2000x1333_thumbnail.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/a-big-bold-beautiful-journey-new-poster-1-bts-image-and-4-hq-images/\"\u003e\u003ch3 rel=\"bookmark\"\u003eA Big Bold Beautiful Journey: New Poster, 1 BTS Image, And 4 HQ Images\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSony Pictures released a new poster, a behind-the-scenes image, and four high-quality images for the upcoming film, A Big Bold Beautiful Journey.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-chair-puns-spirit-halloween-jokes-in-the-new-trailer/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_03135R3.jpg\" alt=\"A scene from The Naked Gun featuring two men, one holding a coffee cup and wearing a white shirt with a tie, and another in a gray suit with crossed arms, both appearing concerned. The background is dimly lit, hinting at a tense atmosphere.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/NAK_03135R3.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/the-naked-gun-chair-puns-spirit-halloween-jokes-in-the-new-trailer/\"\u003e\u003ch3 rel=\"bookmark\"\u003eThe Naked Gun: Chair Puns \u0026amp; Spirit Halloween Jokes In The New Trailer\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe official trailer for the remake of The Naked Gun is here and it features a chair pun, a play on words featuring \u0026#34;manslaughter,\u0026#34; and a Spirit Halloween joke.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/alien-earth-key-art-poster-sees-our-planet-going-through-some-changes/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/img_20250616_124153_100-1.jpg\" alt=\"Alien: Earth\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/img_20250616_124153_100-1.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/alien-earth-key-art-poster-sees-our-planet-going-through-some-changes/\"\u003e\u003ch3 rel=\"bookmark\"\u003eAlien: Earth Key Art Poster Sees Our Planet Going Through Some Changes\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eArriving August 12th, check out the newest key art poster released by FX Networks for Noah Hawley\u0026#39;s Sydney Chandler-starring Alien: Earth.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/how-to-train-your-dragon-packs-theaters-for-fathers-day-weekend-box-office/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2569_TD_1040_comp_ldn_v0478_grade.1040-2000x1125-6d9b425.jpg\" alt=\"A character from \u0026#39;How To Train Your Dragon\u0026#39; is riding on the back of a large, black dragon soaring above clouds and a coastline, capturing a sense of adventure and freedom.\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/05/2569_TD_1040_comp_ldn_v0478_grade.1040-2000x1125-6d9b425.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/movies/how-to-train-your-dragon-packs-theaters-for-fathers-day-weekend-box-office/\"\u003e\u003ch3 rel=\"bookmark\"\u003eHow To Train Your Dragon Packs Theaters For Father\u0026#39;s Day\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eHow To Train Your Dragon opened well above tracking and dethroned Disney\u0026#39;s Lilo \u0026amp; Stitch on top of the box office.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003carticle\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/james-gunn-on-what-dc-studios-learned-from-marvel-studios-rollback/\"\u003e\u003cimg itemprop=\"image\" src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/MixCollage-16-Jun-2025-10-18-AM-2261.jpg\" alt=\"DC Studios\" width=\"225\" height=\"225\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:350/h:350/q:75/rt:fill/g:ce/https://bleedingcool.com/wp-content/uploads/2025/06/MixCollage-16-Jun-2025-10-18-AM-2261.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20225%20225%22%20width%3D%22225%22%20height%3D%22225%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://bleedingcool.com/tv/james-gunn-on-what-dc-studios-learned-from-marvel-studios-rollback/\"\u003e\u003ch3 rel=\"bookmark\"\u003eJames Gunn on What DC Studios Learned From Marvel Studios Rollback\u003c/h3\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eJames Gunn on Marvel Studios growing and then rolling back the number of MCU films and series, and what DC Studios learned from that.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-16T17:52:03-05:00",
  "modifiedTime": "2025-06-16T17:52:03-05:00"
}
