{
  "id": "b058ff94-8049-4488-af3f-ccb5296354c6",
  "title": "Sydney Sweeney Circling Legendary’s ‘Gundam’",
  "link": "https://deadline.com/2025/03/sydney-sweeney-gundam-movie-legendary-1236355385/",
  "description": "Sydney Sweeney is in final negotiations to star in the live-action Gundam movie coming together at Legendary, sources have confirmed to Deadline. Details as to the part Sweeney is playing are under wraps for now, as is the film’s plot. Reps for Legendary declined to comment. As we were first to tell you last fall, Sweet […]",
  "author": "matthewgrobar",
  "published": "Tue, 01 Apr 2025 00:54:58 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Gundam",
    "Legendary",
    "Sydney Sweeney"
  ],
  "byline": "Matt Grobar",
  "length": 1687,
  "excerpt": "Sydney Sweeney is circling the 'Gundam' movie in development at Legendary, sources have confirmed to Deadline.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Sydney Sweeney is in final negotiations to star in the live-action Gundam movie coming together at Legendary, sources have confirmed to Deadline. Details as to the part Sweeney is playing are under wraps for now, as is the film’s plot. Reps for Legendary declined to comment. As we were first to tell you last fall, Sweet Tooth showrunner Jim Mickle is set to direct the new Gundam, co-developed between Legendary and franchise owner Bandai Namco Filmworks, from his own script. Mickle will also produce with his partner Linda Moran through their production company Nightshade. The pioneer of the sci-fi subgenre known as “mecha,” revolving around giant fighting robots, Gundam is a long-running multimedia franchise which kicked off with anime series Mobile Suit Gundam in 1979. Legendary Entertainment announced its development of a Gundam film in the spring of 2021, with Jordan Vogt-Roberts coming aboard as the initial director for the project following his work with the studio on its hit Montersverse installment Kong: Skull Island. Created by Yoshiyuki Tomino, the franchise generates over $600 million annually, including with the sale of plenty of merchandise. Mickle’s feature adaptation of Gundam will be the first in live-action. Sweeney is coming off of turns in the hit horror film Immaculate and the TIFF-premiering Ron Howard thriller Eden. Upcoming, she’ll be seen in Apple’s thriller Echo Valley, premiering June 13, as well as the untitled biopic on boxer Christy Martin, Euphoria Season 3, Lionsgate’s The Housemaid, Colman Domingo’s Scandalous! and more. The InSneider was first to the news of Sweeney’s Gundam negotiations.",
  "image": "https://deadline.com/wp-content/uploads/2025/01/Sydney-Sweeney.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\t\u003ca href=\"https://deadline.com/tag/sydney-sweeney/\" id=\"auto-tag_sydney-sweeney\" data-tag=\"sydney-sweeney\"\u003eSydney Sweeney\u003c/a\u003e is in final negotiations to star in the live-action \u003cem\u003e\u003ca href=\"https://deadline.com/tag/gundam/\" id=\"auto-tag_gundam\" data-tag=\"gundam\"\u003eGundam\u003c/a\u003e \u003c/em\u003emovie coming together at \u003ca href=\"https://deadline.com/tag/legendary/\" id=\"auto-tag_legendary\" data-tag=\"legendary\"\u003eLegendary\u003c/a\u003e, sources have confirmed to Deadline.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDetails as to the part Sweeney is playing are under wraps for now, as is the film’s plot. Reps for Legendary declined to comment. \u003c/p\u003e\n\n\n\n\n\n\n\n\n\u003cp\u003e\n\tAs we were first to tell you last fall, \u003cem\u003eSweet Tooth \u003c/em\u003eshowrunner Jim Mickle is set to direct the new \u003cem\u003eGundam\u003c/em\u003e, co-developed between Legendary and franchise owner Bandai Namco Filmworks, from his own script. Mickle will also produce with his partner Linda Moran through their production company Nightshade.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tThe pioneer of the sci-fi subgenre known as “mecha,” revolving around giant fighting robots, \u003cem\u003eGundam\u003c/em\u003e is a long-running multimedia franchise which kicked off with anime series \u003cem\u003eMobile Suit Gundam\u003c/em\u003e in 1979. Legendary Entertainment announced its development of a \u003cem\u003eGundam\u003c/em\u003e film in the spring of 2021, with Jordan Vogt-Roberts coming aboard as the initial director for the project following his work with the studio on its hit Montersverse installment \u003cem\u003eKong: Skull Island\u003c/em\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCreated by Yoshiyuki Tomino, the franchise generates over $600 million annually, including with the sale of plenty of merchandise. Mickle’s feature adaptation of \u003cem\u003eGundam\u003c/em\u003e will be the first in live-action.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSweeney is coming off of turns in the hit horror film \u003cem\u003eImmaculate \u003c/em\u003eand the TIFF-premiering Ron Howard thriller \u003cem\u003eEden\u003c/em\u003e. Upcoming, she’ll be seen in Apple’s thriller \u003cem\u003eEcho Valley\u003c/em\u003e, premiering June 13, as well as the untitled biopic on boxer Christy Martin, \u003cem\u003eEuphoria \u003c/em\u003eSeason 3, Lionsgate’s \u003cem\u003eThe Housemaid\u003c/em\u003e, Colman Domingo’s \u003cem\u003eScandalous! \u003c/em\u003eand more.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe InSneider was first to the news of Sweeney’s \u003cem\u003eGundam\u003c/em\u003e negotiations.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-04-01T00:54:58Z",
  "modifiedTime": "2025-04-01T01:14:52Z"
}
