{
  "id": "b08e58a0-2308-4c54-b3df-9bf08f2b8116",
  "title": "Can the ‘Sing Sing’ Pay Equity Model Help Solve Indie Film’s Woes?",
  "link": "https://www.indiewire.com/features/interviews/can-sing-sing-pay-equity-model-save-indie-film-interview-1235079671/",
  "description": "Understanding the \"Sing Sing\" model: Star Colman Domingo’s pay and equity stake equaled the PAs' — which might challenge outworn ways of doing business.",
  "author": "Chris O'Falt",
  "published": "Sat, 21 Dec 2024 01:00:00 +0000",
  "source": "https://www.indiewire.com/feed",
  "categories": [
    "Features",
    "Interviews | Celebrity Interviews \u0026 Insider Takes",
    "A24",
    "Colman Domingo",
    "Film",
    "Sing Sing"
  ],
  "byline": "Chris O'Falt",
  "length": 9663,
  "excerpt": "Understanding the Sing Sing model: Star Colman Domingo’s pay and equity stake equaled the PAs' — which might challenge outworn ways of doing business.",
  "siteName": "IndieWire",
  "favicon": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=192",
  "text": "“Sing Sing” is a scripted narrative feature based on the real-life Rehabilitation Through the Arts program at Sing Sing Maximum Security Prison. Starring Colman Domingo, the film tells the story of the incarcerated men who took part in the theater program, and the ensemble includes graduates, including Clarence “Divine Eye” Maclin, who brought their real-life experiences to the film. “The movie is built on these people sharing their stories and baring their souls,” said co-writer/producer Clint Bentley. “It only follows that they should have equity in the movie and have ownership over their own stories.” This philosophy toward storytelling, both in terms of who gets paid for it and owns a stake in it, is one Bentley and director Greg Kwedar wrestled with long before “Sing Sing.” It’s a philosophy they believe needs to be rooted in creating an “ownership mentality” for the entire cast and crew, who are often overworked on low-budget films and leave feeling exploited. The result was the creation of the unique pay and creative equity model used on “Sing Sing.” “The model on ‘Sing Sing’ was first pioneered with Clint’s film ‘Jockey,’ a structure built on parity and equity,” said Kwedar. “The simplest way to put it is that everyone in our film, from the star of the movie, through our production assistants, all the way through post, we all worked for the same rate.” “The Model,” as Kwedar and Bentley have come to call it, is actually not that simple, and that’s because the problems it is trying to address are both complex and ingrained in how indie films have been financed for decades. The Problems ‘Jockey’©Sony Pictures/Courtesy Everett Collection When Kwedar and Bentley went to make “Jockey” (2021), they encountered the same challenges being faced across the industry. From studio to independent projects, movies were bringing in less revenue, and the do-more-with-less mentality, which has always been an indie film ethos, was being stretched too far. “We were trying to bring those costs down on the actual production of ‘Jockey,’ so you can actually give the film a shot to make some money,” said Bentley. “But we didn’t want to do that just by making things cheaper and asking people to work for less.” Working on independent films has often been a labor of love, with long days and little pay, but with budgets shrinking, the doing-more-with-less mentality had crossed the line into being exploitative. “The other bigger thing that we were trying to solve was everyone kills themselves for an independent film,” said Kwedar. “But then if the film is a success, financially or otherwise, only a few people typically share in that success, and the rest of the people are thanked for their service and they move on to the next one where they kill themselves again.” Some principal crew and cast members on indie films, in exchange for accepting a lower than their normal rate, are able to negotiate a percentage of the backend if the film makes money. The problem is that, even for those with this creative equity, the points they received on the backend rarely get paid out. “The way that it’s typically structured is investors put up the money for a film and then they need to get paid back the budget of the film plus 20 percent before the film is considered in profit,” said Bentley. “There’s a lot that gets carved out [in marketing and distribution costs] before that money ever comes to give those investors their 120 percent back. We have so many friends on the crew side, who if they get equity on independent films, they think it’s worthless.” The Model: A Potential Solution Monique Walton, Greg Kwedar, Clint Bentley Clarence ‘Divine Eye’ Maclin, Colman Domingo on the set of ‘Sing Sing’Phyllis Kwedar To address these problems, the filmmakers created a new model for “Jockey,” which had three basic tenets that altered the business-as-usual approach of most indies. Pay Equity: When it comes to how the the cast is paid on lower-budget films, SAG-AFTRA has clearly established day and weekly rates that are based on where the film is shot and its budget. There is no equivalent with IATSE and other unions representing those who work behind the camera, which is why the crew on films like “Jockey” and “Sing Sing” are non-union. On “Jockey,” the rates established by SAG-AFTRA for the cast were applied to the entire crew, so everyone made the same amount. Who Gets Creative Equity: On a typical indie film, who on the creative side gets equity, and how much it is gets negotiated individually. Explained Bentley, “This person gets two points, this person gets three points, this person gets no points — it’s just all very vague and opaque, and so we wanted to standardize that in a way where there’s no negotiation back and forth, it’s just really transparent and everybody’s on the same page.” For both “Jockey” and “Sing Sing,” the film was broken up into different life cycles: development, pre-production, production, post-production, and promotion (doing publicity when the film is distributed). “We then assigned a point structure to each of those phases and established a minimum number of days that needed to be worked to get that point value,” said Kwedar. “And so it’s very straightforward. Somebody knew, ‘If I work this many number of days in this section, I’m gonna get this many points.’” And the point structure, based on time worked, applied equally to each member of the cast and crew — it didn’t matter if they were the set dresser, lead actor, director, or sound editor. Once the cast or crew member reached the minimum threshold of hours worked, their creative equity was based on the amount of time worked during that phase of the movie. First Dollar Payout: For that creative equity to have any value, Kwedar and Bentley knew they would need to take a sledgehammer to the industry standard in which investors were paid out 100 percent of their investment, plus 20 percent, before those with creative equity received a penny. “We created this split off the top where 60 percent went to investors, and 40 percent went to cast and crew (those with creative equity) from the outset,” said Bentley, “And once investors got 120 percent back, we then split it 50-50.” Kwedar believed this aspect of the model is important financially, but also marks a necessary shift in the mentality of the indie filmmaker. “An investor is taking a risk in financing, and there’s real value in that,” said Kwedar. “The movie wouldn’t happen without the investor, but the movie wouldn’t happen without the artist either. And so I think we need to finally recognize that we’re not sitting with our hat in our hand begging, that we’re actually offering something.” Greg Kwedar and Colman Domingo on the set of ‘Sing Sing’Phyllis Kwedar After having creative and financial success applying the model to “Jockey,” Kwedar and Clint Bentley decided to try it on a much bigger project. “‘Jockey’ was a 10-person crew with three main leads and was made for under a half-a-million dollars, and on ‘Sing Sing,’ we scaled up to a 50-person crew and 25-cast,” said Kwedar. That level of scaling up meant the filmmakers would need more institutional investors, rather than the private money they raised to make “Jockey,” along with big name stars – both of which would need to buy into a model that altered how and how much, they were paid out. “We encountered investors who passed on ‘Jockey’ because they weren’t interested in that model,” said Bentley. Four weeks before the start of production (timed to the one gap in Domingo’s acting schedule), the “Sing Sing” team met with Teddy Schwarzman and his Black Bear Pictures. Like the film’s star, the financiers were excited by the model and closed out their deal to invest just two weeks before the first day of production. It was an extremely close call and one that speaks to how the model limits the number of financial partners. But Kwedar argued the model also served as a filter to them finding the right partners. “I think there’s something to be said for defining your values, rather than just kind of inheriting the way things have been done before,” said Kwedar. “You kind of plant these flags on the ground, and people know what you stand for. And then I think that, in turn, attracts the people who are right for it and pushes away the ones who aren’t.” The Model’s Future Kwedar and Bentley have met with a number of indie filmmakers looking to replicate the way “Sing Sing” achieved pay equity, and the duo are getting ready to announce a new production company in which they will start to fund and support other indies looking to follow in their footsteps. Bentley, though, doesn’t believe there is a one-size-fits-all model that is applicable to all indie films, and even between “Jockey” and “Sing Sing,” they needed to make changes tailored to each film’s needs. He argued the takeaway from how they made “Sing Sing” should be more in its mentality than its financial structure. “Independent film should be a testing ground and a proving ground for new ideas. There should be some level of freedom that we should embrace in making independent film that’ll make the films more interesting and that will make better systems than the ones we’ve inherited,” said Bentley. “And so that’s the thing that we always try to talk about with younger filmmakers. It doesn’t have to be this model. Take this model, make it better. Take this model, throw it out. Do a completely different model, but just embrace the freedom to do it a better way.”",
  "image": "https://www.indiewire.com/wp-content/uploads/2024/12/Sing-Sing.png?w=650",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-alias=\"gutenberg-content__content\"\u003e\u003cp\u003e“\u003ca data-id=\"https://www.indiewire.com/criticism/movies/sing-sing-movie-review-colman-domingo-a24-1235024536/\" data-type=\"link\" href=\"https://www.indiewire.com/criticism/movies/sing-sing-movie-review-colman-domingo-a24-1235024536/\"\u003eSing Sing\u003c/a\u003e” is a scripted narrative feature based on the real-life Rehabilitation Through the Arts program at \u003ca href=\"https://www.indiewire.com/t/sing-sing/\" id=\"auto-tag_sing-sing\" data-tag=\"sing-sing\"\u003eSing Sing\u003c/a\u003e Maximum Security Prison. Starring \u003ca href=\"https://www.indiewire.com/news/general-news/colman-domingo-sing-sing-rehearsal-time-1235032315/\" data-type=\"link\" data-id=\"https://www.indiewire.com/news/general-news/colman-domingo-sing-sing-rehearsal-time-1235032315/\"\u003eColman Domingo\u003c/a\u003e, the \u003ca href=\"https://www.indiewire.com/t/film/\" id=\"auto-tag_film\" data-tag=\"film\"\u003efilm\u003c/a\u003e tells the story of the incarcerated men who took part in the theater program, and the ensemble includes graduates, including Clarence “Divine Eye” Maclin, who brought their real-life experiences to the film.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The movie is built on these people sharing their stories and baring their souls,” said co-writer/producer Clint Bentley. “It only follows that they should have equity in the movie and have ownership over their own stories.”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eThis philosophy toward storytelling, both in terms of who gets paid for it and owns a stake in it, is one Bentley and director \u003ca data-id=\"https://www.indiewire.com/video/sing-sing-oscar-contender-1235024695/\" data-type=\"link\" href=\"https://www.indiewire.com/video/sing-sing-oscar-contender-1235024695/\"\u003eGreg Kwedar\u003c/a\u003e wrestled with long before “Sing Sing.” It’s a philosophy they believe needs to be rooted in creating an “ownership mentality” for the entire cast and crew, who are often overworked on low-budget films and leave feeling exploited. The result was the creation of the unique pay and creative equity model used on “Sing Sing.”\n\n\u003c/p\u003e\u003cdiv data-alias=\"cards__inner\" data-component=\"cards-related-content\" data-collapse-to-xs=\"false\" data-layout=\"inline\" data-size=\"md\" data-spacing=\"s-3\" data-cards-spacing=\"s0\"\u003e \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235079315\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/news/box-office/pedro-almodovar-us-box-office-history-the-room-next-door-1235079315/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"0\" data-post-id=\"1235079315\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"Pedro Almodóvar\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2179606102.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235079917\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e  \u003cdiv data-alias=\"card__inner\" data-post-id=\"1235079614\" data-component=\"card\" data-has-background=\"false\" data-has-overlay=\"false\" data-layout-size=\"xs\" data-layout=\"sidebar\" data-main-alignment=\"s0\" data-main-spacing=\"s0\" data-media-position=\"\"\u003e\u003cfigure data-component=\"image\" data-alias=\"\" data-ratio=\"sixteenByNine\" data-round=\"false\"\u003e\u003ca href=\"https://www.indiewire.com/awards/consider-this/robert-eggers-interview-nosferatu-1235079614/\" title=\"\" target=\"_self\" rel=\"\" data-card-index=\"1\" data-post-id=\"1235079614\"\u003e\u003cp\u003e\u003cimg src=\"https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\" alt=\"Robert Eggers at the Berlin world premiere of \u0026#39;Nosferatu\u0026#39;\" height=\"168\" width=\"300\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=600%2C337 600w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=125%2C70 125w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=660%2C370 660w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=300%2C168 300w, https://www.indiewire.com/wp-content/uploads/2024/12/GettyImages-2187893526.jpg?w=300\u0026amp;h=168\u0026amp;crop=1\u0026amp;resize=1200%2C675 1200w\" sizes=\"(max-width: 300px) 100vw, 300px\" loading=\"lazy\" decoding=\"async\" fetchpriority=\"auto\" data-attachment-id=\"1235079888\" data-wp-size=\"nova_size__sixteenbynine_small_cropped\"/\u003e\u003c/p\u003e\u003c/a\u003e\u003c/figure\u003e\u003c/div\u003e \u003c/div\u003e\n\n\n\n\u003cp\u003e“The model on ‘Sing Sing’ was first pioneered with Clint’s film ‘\u003ca data-id=\"https://www.indiewire.com/criticism/movies/jockey-review-clifton-collins-jr-horse-racing-drama-1234612632/\" data-type=\"link\" href=\"https://www.indiewire.com/criticism/movies/jockey-review-clifton-collins-jr-horse-racing-drama-1234612632/\"\u003eJockey\u003c/a\u003e,’ a structure built on parity and equity,” said Kwedar. “The simplest way to put it is that everyone in our film, from the star of the movie, through our production assistants, all the way through post, we all worked for the same rate.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“The Model,” as Kwedar and Bentley have come to call it, is actually not that simple, and that’s because the problems it is trying to address are both complex and ingrained in how indie films have been financed for decades.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"the-problems\"\u003eThe Problems\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"3000\" height=\"1255\" src=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?w=650\" alt=\"JOCKEY, Clifton Collins Jr., 2021. ph: Adolpho Veloso / © Sony Pictures Classics / courtesy Everett Collection\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg 3000w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=300,126 300w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1024,428 1024w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1536,643 1536w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=2048,857 2048w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=239,100 239w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=600,251 600w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1000,418 1000w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=244,102 244w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1160,485 1160w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=227,95 227w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=96,40 96w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1200,502 1200w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=150,63 150w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=110,46 110w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=285,119 285w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=320,134 320w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=640,268 640w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=800,335 800w, https://www.indiewire.com/wp-content/uploads/2024/12/MCDJOCK_SP022.jpg?resize=1280,535 1280w\" sizes=\"(max-width: 3000px) 100vw, 3000px\"/\u003e\u003cfigcaption\u003e‘Jockey’\u003ccite\u003e©Sony Pictures/Courtesy Everett Collection\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eWhen Kwedar and Bentley went to make “Jockey” (2021), they encountered the same challenges being faced across the industry. From studio to independent projects, movies were bringing in less revenue, and the do-more-with-less mentality, which has always been an indie film ethos, was being stretched too far.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We were trying to bring those costs down on the actual production of ‘Jockey,’ so you can actually give the film a shot to make some money,” said Bentley. “But we didn’t want to do that just by making things cheaper and asking people to work for less.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWorking on independent films has often been a labor of love, with long days and little pay, but with budgets shrinking, the doing-more-with-less mentality had crossed the line into being exploitative.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“The other bigger thing that we were trying to solve was everyone kills themselves for an independent film,” said Kwedar. “But then if the film is a success, financially or otherwise, only a few people typically share in that success, and the rest of the people are thanked for their service and they move on to the next one where they kill themselves again.”\u003c/p\u003e\n\n\n\n\u003cp\u003eSome principal crew and cast members on indie films, in exchange for accepting a lower than their normal rate, are able to negotiate a percentage of the backend if the film makes money. The problem is that, even for those with this creative equity, the points they received on the backend rarely get paid out.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The way that it’s typically structured is investors put up the money for a film and then they need to get paid back the budget of the film plus 20 percent before the film is considered in profit,” said Bentley. “There’s a lot that gets carved out [in marketing and distribution costs] before that money ever comes to give those investors their 120 percent back. We have so many friends on the crew side, who if they get equity on independent films, they think it’s worthless.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"the-model-a-potential-solution\"\u003eThe Model: A Potential Solution\u003c/h2\u003e\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"4982\" height=\"3648\" src=\"https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?w=650\" alt=\"\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg 4982w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=300,220 300w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1024,750 1024w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1536,1125 1536w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=2048,1500 2048w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=137,100 137w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=600,439 600w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=255,187 255w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1000,732 1000w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=244,179 244w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1160,849 1160w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=130,95 130w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=55,40 55w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1200,879 1200w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=229,168 229w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=460,337 460w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=922,675 922w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=273,200 273w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=546,400 546w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1093,800 1093w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=205,150 205w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=410,300 410w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=819,600 819w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=150,110 150w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=110,81 110w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=285,209 285w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=320,234 320w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=640,469 640w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=800,586 800w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_Team_PhyllisKwedar_IMGL1151.jpeg?resize=1280,937 1280w\" sizes=\"(max-width: 4982px) 100vw, 4982px\"/\u003e\u003cfigcaption\u003eMonique Walton, Greg Kwedar, Clint Bentley Clarence ‘Divine Eye’ Maclin, \u003ca href=\"https://www.indiewire.com/t/colman-domingo/\" id=\"auto-tag_colman-domingo\" data-tag=\"colman-domingo\"\u003eColman Domingo\u003c/a\u003e on the set of ‘Sing Sing’\u003ccite\u003ePhyllis Kwedar\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eTo address these problems, the filmmakers created a new model for “Jockey,” which had three basic tenets that altered the business-as-usual approach of most indies.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePay Equity\u003c/strong\u003e: When it comes to how the the cast is paid on lower-budget films, SAG-AFTRA has clearly established day and weekly rates that are based on where the film is shot and its budget. There is no equivalent with IATSE and other unions representing those who work behind the camera, which is why the crew on films like “Jockey” and “Sing Sing” are non-union.\u003c/p\u003e\n\n\n\n\u003cp\u003eOn “Jockey,” the rates established by SAG-AFTRA for the cast were applied to the entire crew, so everyone made the same amount.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eWho Gets Creative Equity\u003c/strong\u003e: On a typical indie film, who on the creative side gets equity, and how much it is gets negotiated individually\u003c/span\u003e. Explained Bentley, “This person gets two points, this person gets three points, this person gets no points — it’s just all very vague and opaque, and so we wanted to standardize that in a way where there’s no negotiation back and forth, it’s just really transparent and everybody’s on the same page.”\u003c/p\u003e\n\n\n\n\u003cp\u003eFor both “Jockey” and “Sing Sing,” the film was broken up into different life cycles: development, pre-production, production, post-production, and promotion (doing publicity when the film is distributed).\u003c/p\u003e\n\n\n\n\u003cp\u003e“We then assigned a point structure to each of those phases and established a minimum number of days that needed to be worked to get that point value,” said Kwedar. “And so it’s very straightforward. Somebody knew, ‘If I work this many number of days in this section, I’m gonna get this many points.’”\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd the point structure, based on time worked, applied equally to each member of the cast and crew — it didn’t matter if they were the set dresser, lead actor, director, or sound editor. Once the cast or crew member reached the minimum threshold of hours worked, their creative equity was based on the amount of time worked during that phase of the movie.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eFirst Dollar Payout\u003c/strong\u003e: For that creative equity to have any value, Kwedar and Bentley knew they would need to take a sledgehammer to the industry standard in which investors were paid out 100 percent of their investment, plus 20 percent, before those with creative equity received a penny.\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“We created this split off the top where 60 percent went to investors, and 40 percent went to cast and crew (those with creative equity) from the outset,” said Bentley, “And once investors got 120 percent back, we then split it 50-50.”\u003c/p\u003e\n\n\n\n\u003cp\u003eKwedar believed this aspect of the model is important financially, but also marks a necessary shift in the mentality of the indie filmmaker.\u003c/p\u003e\n\n\n\n\u003cp\u003e“An investor is taking a risk in financing, and there’s real value in that,” said Kwedar. “The movie wouldn’t happen without the investor, but the movie wouldn’t happen without the artist either. And so I think we need to finally recognize that we’re not sitting with our hat in our hand begging, that we’re actually offering something.”\n\n\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"3701\" height=\"2467\" src=\"https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?w=650\" alt=\"\" srcset=\"https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg 3701w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=300,200 300w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1024,683 1024w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1536,1024 1536w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=2048,1365 2048w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=150,100 150w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=600,400 600w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=281,187 281w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1000,667 1000w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=244,163 244w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1160,773 1160w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=900,600 900w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=143,95 143w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=60,40 60w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1200,800 1200w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=252,168 252w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=506,337 506w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1013,675 1013w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=225,150 225w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=450,300 450w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=110,73 110w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=285,190 285w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=320,213 320w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=640,427 640w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=800,533 800w, https://www.indiewire.com/wp-content/uploads/2024/12/SingSing_ColmanDomingo_GregKwedar_PhyllisKwedar_IMGL0354_R2.jpg?resize=1280,853 1280w\" sizes=\"(max-width: 3701px) 100vw, 3701px\"/\u003e\u003cfigcaption\u003eGreg Kwedar and Colman Domingo on the set of ‘Sing Sing’\u003ccite\u003ePhyllis Kwedar\u003c/cite\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAfter having creative and financial success applying the model to “Jockey,” Kwedar and Clint Bentley decided to try it on a much bigger project.\u003c/p\u003e\n\n\n\n\u003cp\u003e“‘Jockey’ was a 10-person crew with three main leads and was made for under a half-a-million dollars, and on ‘Sing Sing,’ we scaled up to a 50-person crew and 25-cast,” said Kwedar.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat level of scaling up meant the filmmakers would need more institutional investors, rather than the private money they raised to make “Jockey,” along with big name stars – both of which would need to buy into a model that altered how and how much, they were paid out.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We encountered investors who passed on ‘Jockey’ because they weren’t interested in that model,” said Bentley.\u003c/p\u003e\n\n\n\n\u003cp\u003eFour weeks before the start of production (timed to the one gap in Domingo’s acting schedule), the “Sing Sing” team met with Teddy Schwarzman and his Black Bear Pictures. Like the film’s star, the financiers were excited by the model and closed out their deal to invest just two weeks before the first day of production. It was an extremely close call and one that speaks to how the model limits the number of financial partners. But Kwedar argued the model also served as a filter to them finding the right partners.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e“I think there’s something to be said for defining your values, rather than just kind of inheriting the way things have been done before,” said Kwedar. “You kind of plant these flags on the ground, and people know what you stand for. And then I think that, in turn, attracts the people who are right for it and pushes away the ones who aren’t.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"the-model-s-future\"\u003eThe Model’s Future\u003c/h2\u003e\n\n\n\n\u003cp\u003eKwedar and Bentley have met with a number of indie filmmakers looking to replicate the way “Sing Sing” achieved pay equity, and the duo are getting ready to announce a new production company in which they will start to fund and support other indies looking to follow in their footsteps.\u003c/p\u003e\n\n\n\n\u003cp\u003eBentley, though, doesn’t believe there is a one-size-fits-all model that is applicable to all indie films, and even between “Jockey” and “Sing Sing,” they needed to make changes tailored to each film’s needs. He argued the takeaway from how they made “Sing Sing” should be more in its mentality than its financial structure.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Independent film should be a testing ground and a proving ground for new ideas. There should be some level of freedom that we should embrace in making independent film that’ll make the films more interesting and that will make better systems than the ones we’ve inherited,” said Bentley. “And so that’s the thing that we always try to talk about with younger filmmakers. It doesn’t have to be this model. Take this model, make it better. Take this model, throw it out. Do a completely different model, but just embrace the freedom to do it a better way.” \u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-21T01:00:00Z",
  "modifiedTime": "2024-12-21T00:51:07Z"
}
