{
  "id": "b3d092fe-2b04-43e3-910b-2307a1c61d80",
  "title": "Life with Louie Is Still Larger Than Life 30 Years Later",
  "link": "https://www.comingsoon.net/tv/news/1895891-life-with-louie-larger-than-life-retrospective",
  "description": "There used to be this trend of having cartoons based on the lives of celebrities, from New Kids on the Block to The Gary Coleman Show, but some of the more memorable ones were centered around comedians, like Camp Candy or, in my opinion, one of the best in the genre, Life with Louie. It […] The post Life with Louie Is Still Larger Than Life 30 Years Later appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Stephen Wilds",
  "published": "Thu, 19 Dec 2024 22:29:00 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Family",
    "TV",
    "Life With Louie",
    "Louie Anderson",
    "TV Features"
  ],
  "byline": "Stephen Wilds",
  "length": 7675,
  "excerpt": "Louie Anderson may be gone, but his legacy lives on through this incredible show and Life with Louie deserves a physical release.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "There used to be this trend of having cartoons based on the lives of celebrities, from New Kids on the Block to The Gary Coleman Show, but some of the more memorable ones were centered around comedians, like Camp Candy or, in my opinion, one of the best in the genre, Life with Louie. It was common for these stars to sign off on the show but never appear on it or just have a short live-action segment to help push the story or say something inspirational (remember Hammerman?), but Louie Anderson appeared on camera for season one as well as voicing two of the main characters. His involvement was a huge reason the series holds up so well, being based on his childhood. But for as good of a show as it is, Life with Louie is simply not talked about enough. Anderson is mostly known as a comedian. I first saw him in the movie Coming to America, and others may recall him from Baskets or his time hosting Family Feud. For many, though, he is more recognizable by the voices he performed, and after years of perfecting those and the stories that went with them in his stand-up, he made a charming slice-of-life sitcom that aired on Fox Kids. This wasn’t the first time he had tried to get a show about his family on television, and he wasn’t enthusiastic about trying it as a cartoon at first, but it turned out to be the right path. There were a few changes; some names were altered to alleviate character confusion, and the show was set in Wisconsin, although Anderson grew up in Minnesota. It wasn’t completely accurate to his actual history, but these episodes still provided a huge catharsis for the comedian, and it shows.  The cartoon debuted its first two episodes in primetime in December of 1994 before moving to the Saturday morning lineup. It ran for three seasons, airing 39 episodes, and attracted a large audience that boasted a solid number of adult viewers as well. The show centers on young Louie Anderson, but really it’s about his familial relationships and the problems he faces growing up. These events are set in the 1960s, but it feels somewhat time agnostic, while some of the references come across as more ‘70s or ‘80s. Louie grew up poor, as the next to last of eleven total children, which couldn’t have been easy. We don’t see much of his siblings other than Tommy, the older ones are always heading out, shirking their responsibilities to the younger kids, or getting out of family functions through various means. Several of them have also moved away out of state, and when the family thinks Ora (Edie McClurg) is pregnant again there’s concern over cost and available room. The house is repeatedly falling apart, the car is constantly breaking down, and the parents always suggest alternatives to spending money or are trying to take advantage of coupons. The Anderson family is poor and struggling, but for the most part, they seem happy. This cartoon is full of rich characters. Louie is so incredibly likable; his dad is stubborn with a heart of gold, and the mother is immensely supportive and secretly good at everything her husband thinks he can do. So much of Anderson’s work has been a tribute to his parents, and this series is a shining example of that because Life with Louie is mainly about relationships with family, friends, and all of the obstacles they bring. Not a lot of children’s entertainment was highlighting this at the time, at least not on such a constant basis. I always loved the character of the dad, because he reminds me so much of my stepfather—former military, proud, doesn’t show his emotions. Sadly, I learned that in reality, Anderson and his father had a much rougher relationship, mostly due to alcohol, causing a lot of non-physical abuse, according to his book. Anderson knew that, but he also saw the good in his dad and wanted to show a more idyllic version of him, and there is something extremely touching about that. The majority of these episodes are excellent, and some manage to be subtle with their message, while others attempt to talk about things that are hard to deal with, like losing a family member (a prominently featured character). Sometimes, kids have to deal with adult themes. Louie is also infatuated with one of his close friends and is often bullied by Glen Glenn (Justin Shenkarow), who we realize is, in part, at least, taking out his aggression from shortcomings with his own family. Most of the episodes are self-contained, but some neat callbacks and elements are carried over through multiple episodes that keep being brought up, like the neighbor’s Christmas lights or how the school principal is always trying to make money and sell her books. One of the things brought up often is Louie’s weight; he’s constantly being picked on about it, but he also makes those jokes himself. Anderson knew that some people just saw him as a fat comic, but he liked to see it as being a comic who happened to be overweight. I’ve seen commenters express that they enjoyed having a chubby kid as the main character, holding Louie up as some positive representation. The show does have a couple of jokes or lines of dialogue that haven’t aged specifically well, but not to the level that it takes away from watching it. One episode is even about Louie learning to be a comedian and facing the truth that sometimes jokes are hurtful, and it’s okay to admit when something isn’t funny to everyone. We get some clever writing as well and some memorable gems for quotes. “I’m a method-napper, you know.” The presentation was fantastic and charming. A theme was introduced for seasons two and three, a catchy little song. There’s solid animation throughout most of the show, though some characters are a little extra fluid at times. Strangely, the adults are drawn with the appropriate number of fingers, while the kids only have eight, but it fits. I also love that whenever they watch television, it is usually a live-action clip. Anderson is great with his voices, as are most of the other actors – some of which will sound very familiar – but a few sound out of place. A couple of interesting names show up as guest stars as well.   Anderson said that the show was a lot of work, but it paid off, as Life with Louie was a surprise success that was nominated for many awards, won two Emmys, and the Humanitas Prize three times. It was apparently a huge hit in parts of Europe and Russia, showing throughout the ‘00s on Jetix. The series had plenty of merchandising, even if with smaller brands than other cartoons, Life with Louie made the rounds and even had its own SpaghettiOs deal. Sadly, the show never received a full official release in the U.S., and only a handful of 2-episode volumes were sold in the U.K. Anderson had been working to get Life with Louie out to the fans in full since 2006, but this never happened, and with his death in 2022, it looks even less likely. Disney owns the rights to the show now and could do everyone a solid by at least putting it up on streaming. It can be found easily on places like YouTube, but the quality for most of the episodes isn’t the best. Before he passed, Anderson was still working on getting it released on physical media and even discussed a potential reboot. He also revealed that back when the show was still in production, there were brief discussions about a potential crossover with Bobby’s World, and now I’m sad we never saw that. Anderson may be gone, but his legacy lives on through this incredible show. Louie taught me a lot, and if I can get just one more person to watch it, if they experience just a part of the joy I did seeing this, that still means something.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/12/Life-With-Louie-Retrospective.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eThere used to be this trend of having cartoons based on the lives of celebrities, from New Kids on the Block to The Gary Coleman Show, but some of the more memorable ones were centered around comedians, like Camp Candy or, in my opinion, one of the best in the genre, Life with Louie. It was common for these stars to sign off on the show but never appear on it or just have a short live-action segment to help push the story or say something inspirational (remember Hammerman?), but Louie Anderson appeared on camera for season one as well as voicing two of the main characters. His involvement was a huge reason the series holds up so well, being based on his childhood. But for as good of a show as it is, Life with Louie is simply not talked about enough.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnderson is mostly known as a comedian. I first saw him in the movie Coming to America, and others may recall him from Baskets or his time hosting Family Feud. For many, though, he is more recognizable by the voices he performed, and after years of perfecting those and the stories that went with them in his stand-up, he made a charming slice-of-life sitcom that aired on Fox Kids. This wasn’t the first time he had tried to get a show about his family on television, and he wasn’t enthusiastic about trying it as a cartoon at first, but it turned out to be the right path. There were a few changes; some names were altered to alleviate character confusion, and the show was set in Wisconsin, although Anderson grew up in Minnesota. It wasn’t completely accurate to his actual history, but these episodes still provided a huge catharsis for the comedian, and it shows. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"How Louie Anderson\u0026#39;s Parents Inspired \u0026#34;Life With Louie\u0026#34; | Late Night with Conan O’Brien\" width=\"720\" height=\"540\" src=\"https://www.youtube.com/embed/mkQXuQCc7p8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe cartoon \u003ca href=\"https://www.tvtango.com/listings/1994/12/18\"\u003edebuted its first two episodes in primetime\u003c/a\u003e in December of 1994 before moving to the Saturday morning lineup. It ran for three seasons, airing 39 episodes, and attracted a large audience that boasted a solid number of adult viewers as well. The show centers on young Louie Anderson, but really it’s about his familial relationships and the problems he faces growing up. These events are set in the 1960s, but it feels somewhat time agnostic, while some of the references come across as more ‘70s or ‘80s. Louie grew up poor, as the \u003ca href=\"https://www.youtube.com/watch?v=AGhRnK156jg\"\u003enext to last of eleven\u003c/a\u003e total children, which couldn’t have been easy. We don’t see much of his siblings other than Tommy, the older ones are always heading out, shirking their responsibilities to the younger kids, or getting out of family functions through various means. Several of them have also moved away out of state, and when the family thinks Ora (Edie McClurg) is pregnant again there’s concern over cost and available room. The house is repeatedly falling apart, the car is constantly breaking down, and the parents always suggest alternatives to spending money or are trying to take advantage of coupons. The Anderson family is poor and struggling, but for the most part, they seem happy.\u003c/p\u003e\n\n\n\n\u003cp\u003eThis cartoon is full of rich characters. Louie is so incredibly likable; his dad is stubborn with a heart of gold, and the mother is immensely supportive and secretly good at everything her husband thinks he can do. So much of Anderson’s work has been a tribute to his parents, and this series is a shining example of that because Life with Louie is mainly about relationships with family, friends, and all of the obstacles they bring. Not a lot of children’s entertainment was highlighting this at the time, at least not on such a constant basis. I always loved the character of the dad, because he reminds me so much of my stepfather—former military, proud, doesn’t show his emotions. Sadly, I learned that in reality, Anderson and his father had a much rougher relationship, mostly due to alcohol, causing a lot of non-physical abuse, \u003ca href=\"https://www.goodreads.com/book/show/1199961.Dear_Dad\"\u003eaccording to his book\u003c/a\u003e. Anderson knew that, but he also saw the good in his dad and wanted to show a more idyllic version of him, and there is something extremely touching about that.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Life With Louie   Intro\" width=\"720\" height=\"540\" src=\"https://www.youtube.com/embed/WGuS1bj9yhM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eThe majority of these episodes are excellent, and some manage to be subtle with their message, while others attempt to talk about things that are hard to deal with, like losing a family member (a prominently featured character). Sometimes, kids have to deal with adult themes. Louie is also infatuated with one of his close friends and is often bullied by Glen Glenn (Justin Shenkarow), who we realize is, in part, at least, taking out his aggression from shortcomings with his own family. Most of the episodes are self-contained, but some neat callbacks and elements are carried over through multiple episodes that keep being brought up, like the neighbor’s Christmas lights or how the school principal is always trying to make money and sell her books.\u003c/p\u003e\n\n\n\n\u003cp\u003eOne of the things brought up often is Louie’s weight; he’s constantly being picked on about it, but he also makes those jokes himself. Anderson knew that some people just saw him as a fat comic, but \u003ca href=\"https://www.startribune.com/review-hey-mom-by-louie-anderson-pays-tribute-to-mom-and-minnesota/478568713\"\u003ehe liked to see it as\u003c/a\u003e being a comic who happened to be overweight. I’ve seen commenters express that they enjoyed having a chubby kid as the main character, holding Louie up as some positive representation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe show does have a couple of jokes or lines of dialogue that haven’t aged specifically well, but not to the level that it takes away from watching it. One episode is even about Louie learning to be a comedian and facing the truth that sometimes jokes are hurtful, and it’s okay to admit when something isn’t funny to everyone. We get some clever writing as well and some memorable gems for quotes.\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“I’m a method-napper, you know.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eThe presentation was fantastic and charming. A theme was introduced for seasons two and three, a catchy little song. There’s solid animation throughout most of the show, though some characters are a little extra fluid at times. Strangely, the adults are drawn with the appropriate number of fingers, while the kids only have eight, but it fits. I also love that whenever they watch television, it is usually a live-action clip. Anderson is great with his voices, as are most of the other actors – some of which will sound very familiar – but a few sound out of place. A couple of interesting names show up as guest stars as well.  \u003c/p\u003e\n\n\n\n\u003cp\u003eAnderson said that the show was a lot of work, but it paid off, as Life with Louie was a surprise success that was nominated for many awards, won two Emmys, and the Humanitas Prize three times. It was apparently a huge hit in parts of Europe and Russia, showing throughout the ‘00s on Jetix. The series had plenty of merchandising, even if with smaller brands than other cartoons, Life with Louie made the rounds and even had \u003ca href=\"http://themarthareview.com/life-with-louie/\"\u003eits own SpaghettiOs\u003c/a\u003e deal.\u003c/p\u003e\n\n\n\n\u003cp\u003eSadly, the show never received a full official release in the U.S., and only a handful of 2-episode volumes were sold in the U.K. Anderson had been working to get Life with Louie out to the fans in full since 2006, but this never happened, and with his death in 2022, it looks even less likely. Disney \u003ca href=\"https://web.archive.org/web/20221226042740/https://streamclues.com/disney-and-missing-saban-entertainment-fox-kids-jetix-worldwide-library/\"\u003eowns the rights\u003c/a\u003e to the show now and could do everyone a solid by at least putting it up on streaming. It can be found easily on places like YouTube, but the quality for most of the episodes isn’t the best.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Louie Anderson talks \u0026#39;Life with Louie\u0026#39; Reboot, \u0026#39;Baskets,\u0026#39; \u0026amp; More\" width=\"720\" height=\"405\" src=\"https://www.youtube.com/embed/2Iunetc2ZbY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eBefore he passed, Anderson was still working on getting it released on physical media and even discussed a potential reboot. He also revealed that back when the show was still in production, there were brief discussions about a potential crossover with Bobby’s World, and now I’m sad we never saw that. Anderson may be gone, but his legacy lives on through this incredible show. Louie taught me a lot, and if I can get just one more person to watch it, if they experience just a part of the joy I did seeing this, that still means something.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-19T22:29:00Z",
  "modifiedTime": "2024-12-19T14:19:25Z"
}
