{
  "id": "b5d3a1b7-32dd-4cee-8f6d-17f9576834ad",
  "title": "Who Is Jason Segel’s Girlfriend? Kayla Radomski’s Job \u0026 Relationship History",
  "link": "https://www.comingsoon.net/guides/news/1864834-jason-segel-girlfriend-kayla-radomski-job-relationship-history",
  "description": "Fans have expressed curiosity about Jason Segel’s personal life, especially his girlfriend. The actor is arguably best known for portraying Marshall Eriksen in the sitcom How I Met Your Mother. Segel has also enjoyed a diverse career on the big screen, having appeared in numerous movies and the Apple TV+ comedy-drama series Shrinking, which he […] The post Who Is Jason Segel’s Girlfriend? Kayla Radomski’s Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Tamal Kundu",
  "published": "Thu, 17 Oct 2024 00:52:26 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "FAQ",
    "FAQ Pop Culture",
    "Jason Segel"
  ],
  "byline": "Tamal Kundu",
  "length": 3038,
  "excerpt": "Wondering who Shrinking and How I Met Your Mother star Jason Segel is dating? Here is everything you might want to know about Kayla Radomski.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Fans have expressed curiosity about Jason Segel’s personal life, especially his girlfriend. The actor is arguably best known for portraying Marshall Eriksen in the sitcom How I Met Your Mother. Segel has also enjoyed a diverse career on the big screen, having appeared in numerous movies and the Apple TV+ comedy-drama series Shrinking, which he co-created. Accordingly, people want to know about his romantic relationship. So, here are all the details of Jason Segel’s girlfriend, including her professional journey and their relationship timeline. Who is Jason Segel dating? Jason Segel is in a relationship with Kayla Radomski. Born on January 19, 1991, Radomski hails from Denver, Colorado. She was crowned Miss Pre-Teen Colorado in 1999. Moreover, Radomski has been passionate about the performing arts since a young age. While she is relatively private about her personal life, she and Segel are often seen supporting each other at public events. What is Kayla Radomski’s job? Jason Segel’s girlfriend is a professional dancer and actress. Kayla Radomski began dancing when she was only two years old. About five years later, she became a competitive dancer. Radomski reportedly has the distinction of being the youngest dancer ever featured in a Britney Spears Tour concert video. Throughout her career as a dancer, Radomski has worked with several well-known choreographers and even assisted a few of them. Additionally, she was a contestant in the fifth season of So You Think You Can Dance (US) in 2009 and finished the competition in fourth place. Kayla Radomski is also a former backup dancer for Taylor Swift. She joined the pop megastar on stage when she and Brendon Urie performed ME! at the 2019 Billboard Music Awards. Radomski even shared an Instagram photo with Swift before the performance. Moreover, Radomski has showcased her skills in movies like Once Upon a Time… in Hollywood, Footloose, and More Beautiful for Having Been Broken, to name a few. Jason Segel and Kayla Radomski’s relationship history Jason Segel and his girlfriend Kayla Radomski mostly prefer to keep their relationship away from the limelight. However, they seem to have been in a relationship at least since late 2023. Per Daily Mail, the two appeared together at Universal Studios Hollywood’s Halloween Horror Nights in October that year. In January 2024, Segel and Radomski also attended the 81st annual Golden Globe Awards, which became their first red-carpet appearance together. Just a few days later, the couple were spotted together at the 2024 Emmy Awards. (via People) In April this year, Segel and Radomski were also seen on a tropical vacation, according to People. Recently, they celebrated the global red-carpet premiere of Shrinking Season 2, with Radomski sharing photos with Segel on Instagram and appreciating his work. Jason Segel and Kayla Radomski don’t share much details of their relationship publicly. Although, it is evident that they constantly keep supporting each other’s professional and personal achievements.",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2024/10/MixCollage-17-Oct-2024-06-20-AM-6411.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eFans have expressed curiosity about \u003cstrong\u003e\u003ca href=\"https://www.comingsoon.net/tag/jason-segel\"\u003eJason Segel’s\u003c/a\u003e \u003c/strong\u003epersonal life, especially\u003cstrong\u003e his girlfriend. \u003c/strong\u003eThe actor is arguably best known for portraying Marshall Eriksen in the sitcom \u003ca href=\"https://www.comingsoon.net/tag/jason-segel\"\u003eHow I Met Your Mother\u003c/a\u003e. Segel has also enjoyed a diverse career on the big screen, having appeared in numerous movies and the Apple TV+ comedy-drama series \u003ca href=\"https://www.comingsoon.net/tag/Shrinking\"\u003eShrinking\u003c/a\u003e, which he co-created. Accordingly, people want to know about his romantic relationship.\u003c/p\u003e\n\u003cp\u003eSo, here are all the details of Jason Segel’s girlfriend, including her professional journey and their relationship timeline.\u003c/p\u003e\n\u003ch2 id=\"h-who-is-jason-segel-dating\"\u003eWho is Jason Segel dating? \u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eJason Segel is in a relationship with Kayla Radomski.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBorn on January 19, 1991, Radomski hails from Denver, Colorado. She was crowned Miss Pre-Teen Colorado in 1999. Moreover, Radomski has been passionate about the performing arts since a young age. While she is relatively private about her personal life, she and Segel are often seen supporting each other at public events.\u003c/p\u003e\n\u003ch2 id=\"h-what-is-kayla-radomski-s-job\"\u003eWhat is Kayla Radomski’s job? \u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eJason Segel’s girlfriend is a professional dancer and actress.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKayla Radomski began dancing when she was only two years old. About five years later, she became a competitive dancer. Radomski reportedly has the distinction of being the youngest dancer ever featured in a Britney Spears Tour concert video.\u003c/p\u003e\n\u003cp\u003eThroughout her career as a dancer, Radomski has worked with several well-known choreographers and even assisted a few of them. Additionally, she was a contestant in the fifth season of So You Think You Can Dance (US) in 2009 and finished the competition in fourth place.\u003c/p\u003e\n\u003cp\u003eKayla Radomski is also a former backup dancer for Taylor Swift. She joined the pop megastar on stage when she and Brendon Urie \u003ca href=\"https://www.youtube.com/watch?v=bqOfdv9i4sE\"\u003eperformed \u003c/a\u003eME! at the 2019 Billboard Music Awards. Radomski even shared an \u003ca href=\"https://www.instagram.com/p/Bw78RqxAS9G/\"\u003eInstagram photo\u003c/a\u003e with Swift before the performance. \u003c/p\u003e\n\u003cp\u003eMoreover, Radomski has showcased her skills in movies like Once Upon a Time… in Hollywood, Footloose, and More Beautiful for Having Been Broken, to name a few.\u003c/p\u003e\n\u003ch2 id=\"h-jason-segel-and-kayla-radomski-s-relationship-history\"\u003eJason Segel and Kayla Radomski’s relationship history\u003c/h2\u003e\n\u003cp\u003eJason Segel and his girlfriend Kayla Radomski mostly prefer to keep their relationship away from the limelight. However, they seem to have been in a relationship at least since late 2023. \u003c/p\u003e\n\u003cp\u003ePer \u003ca href=\"https://www.dailymail.co.uk/tvshowbiz/article-12681105/Jason-Segel-43-seen-TIME-new-girlfriend-Kayla-Randomski-32-appears-beam-joy-hold-hands-date-night.html\"\u003eDaily Mail\u003c/a\u003e, the two appeared together at Universal Studios Hollywood’s Halloween Horror Nights in October that year. In January 2024, Segel and Radomski also attended the 81st annual Golden Globe Awards, which became their first red-carpet appearance together. Just a few days later, the couple were spotted together at the 2024 Emmy Awards. (via \u003ca href=\"https://people.com/golden-globes-2024-jason-segel-kayla-radomski-red-carpet-couple-debut-8424048\"\u003ePeople\u003c/a\u003e) \u003c/p\u003e\n\u003cp\u003eIn April this year, Segel and Radomski were also seen on a tropical vacation, according to \u003ca href=\"https://people.com/jason-segel-and-girlfriend-kayla-radomski-show-some-skin-during-tropical-getaway-8623398\"\u003ePeople\u003c/a\u003e. Recently, they celebrated the global red-carpet premiere of Shrinking Season 2, with Radomski sharing \u003ca href=\"https://www.instagram.com/kaylaradomski4/p/DA8rnXnpv3x/?img_index=2\"\u003ephotos\u003c/a\u003e with Segel on Instagram and appreciating his work. \u003c/p\u003e\n\u003cp\u003eJason Segel and Kayla Radomski don’t share much details of their relationship publicly. Although, it is evident that they constantly keep supporting each other’s professional and personal achievements.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-17T00:52:26Z",
  "modifiedTime": "2024-10-17T00:52:45Z"
}
