{
  "id": "bbcb5e1c-a13f-4525-bb70-0748f7e663f4",
  "title": "Spooky Picks for Fright Night Flicks",
  "link": "https://www.aintitcool.com/hold-your-breath-die-alone-bhff-83594/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
  "description": "McEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH. Read the full article on AICN ‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.   DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:     If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.   I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles. Carrie-Anne Finish the article on AICN",
  "author": "McEric",
  "published": "Fri, 01 Nov 2024 00:45:00 +0000",
  "source": "https://www.aintitcool.com/node/feed/",
  "categories": null,
  "byline": "McEric",
  "length": 11294,
  "excerpt": "McEric highlights a few spooky films for your Halloween night, including DIE ALONE and HOLD YOUR BREATH.",
  "siteName": "Aint It Cool News",
  "favicon": "",
  "text": "‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE. DIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer: If you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances. I got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles. Carrie-Anne Moss: Hi, how are you? Eric McClanahan: I’m well. How are you? CAM: I’m good, thank you. EM: Thank you for joining me today to talk about the movie DIE ALONE. I watched it last night and it was really impressive. Lowell Dean has quite a script, quite a film he made here, and you have quite the role in it. Could you go ahead and give me a quick overview of what the film is and what attracted you to the project, specifically. CAM: Well, it’s very difficult to describe it without giving a lot of it away, so I should probably start with how I got involved in it; that’s maybe better to answer. So I received the script after my manager had read it and thought that I would really like it, and when I read it, I loved it right away. I instantly had this reaction like “I want to play her.” I talked with Lowell Dean; he had a very clear vision. I enjoyed talking with him a lot, then proceeded to be part of the process, which was difficult. It was hard to get made, as most movies are, and I just feel really grateful that we actually got it made. I think Lowell Dean is a fantastic director and writer and I’m really excited for him to have this out there so people can invest in him, perhaps, telling more stories. He’s so great. EM: Obviously there’s a clear post-pandemic theme that we’re seeing in the film, where we kind of discuss what we learned or didn’t learn from the pandemic when it happened. But there’s another theme within the film about togetherness, about taking care of the people that we care about. What is the thematic drive behind your portrayal of Mae? CAM: Well, actually, you should know that he wrote this way pre-pandemic though we shot it post-pandemic, so this is his imagination, pre- any of that. Yeah, for me the movie is about love and what would you do for love? That’s how I saw it. I’m not a real big zombie-genre movie person; sometimes when those elements are in the film I can’t see myself in the movie. In this movie I thought he struck a really good balance. Like I’ve seen the movie, too, and sometimes these kinds of movies are hard for me to watch but I really enjoyed it. I feel like it’s not a movie only for people that are into that genre, and I think I’m a pretty good gauge because I really don’t watch that. I can’t watch that genre. [laughs] It upsets me too much or I’m too sensitive or something for that, but I think the characters are really strong and the storytelling is really well done, and the actors are great. I think it turned out really great and I’m very proud of it. I’m very excited for Lowell. EM: There’s a lot of physicality to your performance in the film as the tough-as-nails Mae, but I was particularly curious about the bicycle scene, where you’re riding a bicycle through the countryside with Douglas on the back. Is that really you pedaling that bicycle or is that motion car? CAM: [laughs] Yes, that’s me. We did that for so long and it was so fun! It was so beautiful, if you look at that landscape, and I loved doing that. It was really fun. I think originally I remember them going “Do you think you can ride the bike?” And I was like “What? ‘Do I think I can ride the bike?’ Umm, yeah.”  EM: “It’s been a minute, but yeah.” CAM: No, it hasn’t even been a minute, but I thought it was funny. Like if it was a big stunt or something I could see, but who can’t ride a bike? Really? So that was fun. EM: Did you get to spend any time with Kimberly-Sue Murray to help develop her performance? CAM: No, though we got to know each other a little bit, and got to know each other during the shooting, and we talked a little bit but I was just like “You do your thing. I’m going to find my way and you find your way and Lowell’s going to be there making sure that certain moments work” but I didn’t feel the need to control any of that or be a part of that. That’s her gig, and she did such a great job, I think. EM: I think I have time for one more question, so as I was watching this film I saw some recurrent themes with some of your other works. Like we’ve got an apocalyptic theme (THE MATRIX), which you’ve covered. We’ve got the insomnia theme which you’ve covered in film (MEMENTO), and we’ve got the zombie theme which you’ve covered (FIDO). What is a genre or thematic story that you haven’t had a chance to explore yet that you’re looking forward to? CAM: Oh, I don’t know. I have no idea. There are so many, you know? There’s no limit on story, right? I never look for genre as much as I look for story, what’s the story about? So I don’t know. I mean, there’s a billion stories I’d love to be a part of. EM: I noted there was a lot of humor in the film. Did you enjoy the humor aspect of it? Mae has a great, dry wit. Tell me about approaching that. CAM: Yeah, he wrote that really well. I loved the humor. I was laughing out loud reading her, and that was a good sign, too. He wrote her funny in this dry way that I think I can do. ‘Cause I’m not like a bada-bing bada-bing like comedic person. Like I don’t have that, I can do things dry and straight, but I’m not a comedian. Wish I was but just not my thing. But I enjoyed her humor a lot.  EM: Well thank you so much for chatting with me today, and best of luck with the film. CAM: Thank you. Bye.  DIE ALONE, which is a bit of a misnomer because ultimately the film is about persevering for the ones you love, is available for purchase now at all major streaming outlets.  -- HOLD YOUR BREATH is the latest thriller offering from Hulu for their Huluween promotion, and this period thriller comes from frequent collaborators Karrie Crouse and Will Joines. The film stars Sarah Paulson (“American Horror Story”) and Ebon Moss-Bachrach (“The Bear,” FANTASTIC FOUR: FIRST STEPS) and takes place in the dust bowl of Oklahoma in the 1930s as westward expansion was still a dangerous endeavor. If the elements and drought weren’t enough, Paulson’s beleaguered mother also begins to believe that she and her daughters are being menaced by The Grey Man, a sinister creature that can fly apart like sand and possess the unwilling, turning them into murderers or worse. The film is atmospheric and tense as hell. The production built a house that they then purposely dilapidated to serve as the central set piece, and the work the three main actresses do within that small space is nothing short of astonishing. I felt myself frequently short of breath while watching this taut thriller.  I was able to speak with writer/co-director Karrie Crouse and co-director Will Joines about some of the technical aspects of the film, narrative choices, and the benefits of working with Sarah Paulson.  When asked how the idea to create such a specific thriller in the time and place chosen, Karrie Crouse credited the genesis of the script to the Ken Burns documentary on the Dust Bowl, as well as a love of Steinbeck and the personal experience of the ubiquity of sand after a trip to the beach, to tie the idea to modernity. WIll Joines elaborated on filming the movie in New Mexico, despite its Oklahoma setting, saying that “Oklahoma in 2022 does not look like Oklahoma in 1933. New Mexico, however, does.”  Though another actress was originally attached, Karrie was happy to receive Sarah Paulson after the former actress had to drop out. “I know you hear this a lot but now I cannot imagine the film with anybody but Sarah, and I think it wasn’t necessarily Sarah’s horror films that inspired us to cast her. It was just pure chops, grit, knowing that this character takes kind of an operatic arc, from someone who is quite successful at holding down their anxiety and keeping control to someone who is less and less able to hold that within herself. Sarah has this extraordinarily ability to play the struggle.” HOLD YOUR BREATH is streaming on Hulu now. BONUS CONTENT: I also got to see a few flicks at the Brooklyn Horror Film Festival that may or may not have found distribution at this point but keep these on your radar: PSYCHONAUT by Thijs Meuwese stars Julie Batelaan, Fiona Dourif, and Yasmine Blake, and finds a young woman entering her lover’s mind through a Star Trek-bed to try to unlock her “essential memory” to remap her brain after extreme trauma. While the horror elements of the story are minimal, the running through memories and the emotional journey within are rendered beautifully, and the film has a charming metaphysical wink halfway through that really elevates it over most of the other psychological thrillers of the current era. BLACK-EYED SUSAN is the latest film from provocateur Scooter McCrae (SHATTER DEAD, ST. FRANKENSTEIN), starring Damien Maffei, Yvonne Emilie Thälker, and Marc Romeo looking like a Black Mirror Jerry Seinfeld. The film follows a unlucky sap who gets the opportunity to test a new sex doll which bleeds, bruises, and learns to provoke and pleasure, named Susan. Unflinching in its dialogue, graphic nudity, and troubling subject matter, the film is meant to “challenge” the viewer and generate discourse. Lastly, THE LAST SACRIFICE is a documentary written and directed by Rupert Russell about the murder of Charles Walton in the Cotswolds region of England in 1945 and the hysteria, controversy, and ultimately film revolution it spurred. This brutal and ritualistic killing that baffled inspectors at the time and remains unsolved to this day gave birth to the “folk horror” revolution, spawning such films as THE WICKER MAN, MIDSOMMAR, MEN, and MANDY. A great watch with some surprises along the way, it’s essential viewing for folk horror enthusiasts. I hope these features help you celebrate the day and if no one’s said it to you yet, HAPPY HALLOWEEN. And, just to get in front of it, Happy Holidays! -McEric, aka Eric McClanahan-",
  "image": "https://media.aintitcool.com/media/_versions/article_images_2022/mceric/die_alone_huge.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003e‘Tis the season, for a few more hours, before Mariah Carey breaks through her ice-cocoon and heralds in the winter holidays. If you need a couple of thrillers to hold back the tide of the inevitable, I’ve got you covered with a couple of brand new features released this very month: HOLD YOUR BREATH and DIE ALONE.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eDIE ALONE stars Carrie-Anne Moss (THE MATRIX, “The Acolyte”), Frank Grillo (CAPTAIN AMERICA: THE WINTER SOLDIER, ONE DAY AS A LION), Douglas Smith (HBO’s “Big Love”), and Kimberly-Sue Murray (Netflix’s “V-Wars”). The film is written and directed by Lowell Dean (WOLFCOP, SUPERGRID) and released by Quiver Distribution. After an outbreak turns the majority of the population into plant-based zombies, a young man (Smith) with amnesia searches for his lost love and stumbles across a rugged survivalist (Moss). Check out the trailer:\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003ca href=\"https://www.youtube.com/watch?v=iRVgiO5Ei6k\"\u003e\u003cspan\u003e\u003ciframe src=\"https://www.youtube.com/embed/iRVgiO5Ei6k\" width=\"425\" height=\"350\" frameborder=\"0\"\u003e\u003c/iframe\u003e\u003cbr/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eIf you’re getting “The Last of Us” vibes, you’re on the right track. The film features some pretty great creature effects, apt desolation to sell the apocalypse, and a surprisingly original story. Moss is the star of the show, by far, and carries her scenes with a deadpan humor that keeps the heavy subject matter from swallowing the viewer in despair. The budget limitations are clear but the film that emerges is certainly a smart, fun ride that hits all the points of an apocalyptic thriller with a (predictable) plot twist and great performances.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eI got the chance to chat with Carrie-Anne Moss about the production of the film, her bicycle-riding skills, and dream roles.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg title=\"DIE ALONE poster\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/die_alone_medium.jpg\" alt=\"DIE ALONE poster\" width=\"300\" height=\"169\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCarrie-Anne Moss: Hi, how are you?\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEric McClanahan: I’m well. How are you?\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: I’m good, thank you.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: Thank you for joining me today to talk about the movie DIE ALONE. I watched it last night and it was really impressive. Lowell Dean has quite a script, quite a film he made here, and you have quite the role in it. Could you go ahead and give me a quick overview of what the film is and what attracted you to the project, specifically.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: Well, it’s very difficult to describe it without giving a lot of it away, so I should probably start with how I got involved in it; that’s maybe better to answer. So I received the script after my manager had read it and thought that I would really like it, and when I read it, I loved it right away. I instantly had this reaction like “I want to play her.” I talked with Lowell Dean; he had a very clear vision. I enjoyed talking with him a lot, then proceeded to be part of the process, which was difficult. It was hard to get made, as most movies are, and I just feel really grateful that we actually got it made. I think Lowell Dean is a fantastic director and writer and I’m really excited for him to have this out there so people can invest in him, perhaps, telling more stories. He’s so great.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: Obviously there’s a clear post-pandemic theme that we’re seeing in the film, where we kind of discuss what we learned or didn’t learn from the pandemic when it happened. But there’s another theme within the film about togetherness, about taking care of the people that we care about. What is the thematic drive behind your portrayal of Mae?\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: Well, actually, you should know that he wrote this way pre-pandemic though we shot it post-pandemic, so this is his imagination, pre- any of that. Yeah, for me the movie is about love and what would you do for love? That’s how I saw it. I’m not a real big zombie-genre movie person; sometimes when those elements are in the film I can’t see myself in the movie. In this movie I thought he struck a really good balance. Like I’ve seen the movie, too, and sometimes these kinds of movies are hard for me to watch but I really enjoyed it. I feel like it’s not a movie only for people that are into that genre, and I think I’m a pretty good gauge because I really don’t watch that. I can’t watch that genre. [laughs] It upsets me too much or I’m too sensitive or something for that, but I think the characters are really strong and the storytelling is really well done, and the actors are great. I think it turned out really great and I’m very proud of it. I’m very excited for Lowell.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: There’s a lot of physicality to your performance in the film as the tough-as-nails Mae, but I was particularly curious about the bicycle scene, where you’re riding a bicycle through the countryside with Douglas on the back. Is that really you pedaling that bicycle or is that motion car?\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: [laughs] Yes, that’s me. We did that for so long and it was so fun! It was so beautiful, if you look at that landscape, and I loved doing that. It was really fun. I think originally I remember them going “Do you think you can ride the bike?” And I was like “What? ‘Do I think I can ride the bike?’ Umm, yeah.” \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: “It’s been a minute, but yeah.”\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: No, it hasn’t even been a minute, but I thought it was funny. Like if it was a big stunt or something I could see, but who can’t ride a bike? Really? So that was fun.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: Did you get to spend any time with Kimberly-Sue Murray to help develop her performance?\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: No, though we got to know each other a little bit, and got to know each other during the shooting, and we talked a little bit but I was just like “You do your thing. I’m going to find my way and you find your way and Lowell’s going to be there making sure that certain moments work” but I didn’t feel the need to control any of that or be a part of that. That’s her gig, and she did such a great job, I think.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: I think I have time for one more question, so as I was watching this film I saw some recurrent themes with some of your other works. Like we’ve got an apocalyptic theme (THE MATRIX), which you’ve covered. We’ve got the insomnia theme which you’ve covered in film (MEMENTO), and we’ve got the zombie theme which you’ve covered (FIDO). What is a genre or thematic story that you haven’t had a chance to explore yet that you’re looking forward to?\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: Oh, I don’t know. I have no idea. There are so many, you know? There’s no limit on story, right? I never look for genre as much as I look for story, what’s the story about? So I don’t know. I mean, there’s a billion stories I’d love to be a part of.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: I noted there was a lot of humor in the film. Did you enjoy the humor aspect of it? Mae has a great, dry wit. Tell me about approaching that.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: Yeah, he wrote that really well. I loved the humor. I was laughing out loud reading her, and that was a good sign, too. He wrote her funny in this dry way that I think I can do. ‘Cause I’m not like a bada-bing bada-bing like comedic person. Like I don’t have that, I can do things dry and straight, but I’m not a comedian. Wish I was but just not my thing. But I enjoyed her humor a lot. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eEM: Well thank you so much for chatting with me today, and best of luck with the film.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eCAM: Thank you. Bye. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eDIE ALONE, which is a bit of a misnomer because ultimately the film is about persevering for the ones you love, is available for purchase now at all major streaming outlets. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003e--\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg title=\"HOLD YOUR BREATH poster\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/hold_your_breath_medium.jpg\" alt=\"HOLD YOUR BREATH poster\" width=\"300\" height=\"450\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eHOLD YOUR BREATH is the latest thriller offering from Hulu for their \u003c/span\u003e\u003cspan\u003eHuluween \u003c/span\u003e\u003cspan\u003epromotion, and this period thriller comes from frequent collaborators Karrie Crouse and Will Joines. The film stars Sarah Paulson (“American Horror Story”) and Ebon Moss-Bachrach (“The Bear,” FANTASTIC FOUR: FIRST STEPS) and takes place in the dust bowl of Oklahoma in the 1930s as westward expansion was still a dangerous endeavor. If the elements and drought weren’t enough, Paulson’s beleaguered mother also begins to believe that she and her daughters are being menaced by The Grey Man, a sinister creature that can fly apart like sand and possess the unwilling, turning them into murderers or worse.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eThe film is atmospheric and tense as hell. The production built a house that they then purposely dilapidated to serve as the central set piece, and the work the three main actresses do within that small space is nothing short of astonishing. I felt myself frequently short of breath while watching this taut thriller. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eI was able to speak with writer/co-director Karrie Crouse and co-director Will Joines about some of the technical aspects of the film, narrative choices, and the benefits of working with Sarah Paulson. \u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eWhen asked how the idea to create such a specific thriller in the time and place chosen, Karrie Crouse credited the genesis of the script to the Ken Burns documentary on the Dust Bowl, as well as a love of Steinbeck and the personal experience of the ubiquity of sand after a trip to the beach, to tie the idea to modernity. WIll Joines elaborated on filming the movie in New Mexico, despite its Oklahoma setting, saying that “Oklahoma in 2022 does not look like Oklahoma in 1933. New Mexico, however, does.” \u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eThough another actress was originally attached, Karrie was happy to receive Sarah Paulson after the former actress had to drop out. “I know you hear this a lot but now I cannot imagine the film with anybody but Sarah, and I think it wasn’t necessarily Sarah’s horror films that inspired us to cast her. It was just pure chops, grit, knowing that this character takes kind of an operatic arc, from someone who is quite successful at holding down their anxiety and keeping control to someone who is less and less able to hold that within herself. Sarah has this extraordinarily ability to play the struggle.”\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003ca href=\"https://www.youtube.com/watch?v=Pcpb-Zq4-dQ\"\u003e\u003cspan\u003e\u003ciframe src=\"https://www.youtube.com/embed/Pcpb-Zq4-dQ\" width=\"425\" height=\"350\" frameborder=\"0\"\u003e\u003c/iframe\u003e\u003cbr/\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eHOLD YOUR BREATH is streaming on Hulu now.\u003c/span\u003e\u003c/p\u003e\n\n\u003ch2 dir=\"ltr\"\u003e\u003cstrong\u003eBONUS CONTENT:\u003c/strong\u003e\u003c/h2\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eI also got to see a few flicks at the Brooklyn Horror Film Festival that may or may not have found distribution at this point but keep these on your radar:\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg title=\"PSYCHONAUT\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/psychonaut_medium.jpg\" alt=\"PSYCHONAUT\" width=\"300\" height=\"163\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003ePSYCHONAUT by Thijs Meuwese stars Julie Batelaan, Fiona Dourif, and Yasmine Blake, and finds a young woman entering her lover’s mind through a Star Trek-bed to try to unlock her “essential memory” to remap her brain after extreme trauma. While the horror elements of the story are minimal, the running through memories and the emotional journey within are rendered beautifully, and the film has a charming metaphysical wink halfway through that really elevates it over most of the other psychological thrillers of the current era.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg title=\"BLACK-EYED SUSAN\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/black_eyed_susan_medium.jpg\" alt=\"BLACK-EYED SUSAN\" width=\"300\" height=\"168\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eBLACK-EYED SUSAN is the latest film from provocateur Scooter McCrae (SHATTER DEAD, ST. FRANKENSTEIN), starring Damien Maffei, Yvonne Emilie Thälker, and Marc Romeo looking like a Black Mirror Jerry Seinfeld. The film follows a unlucky sap who gets the opportunity to test a new sex doll which bleeds, bruises, and learns to provoke and pleasure, named Susan. Unflinching in its dialogue, graphic nudity, and troubling subject matter, the film is meant to “challenge” the viewer and generate discourse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cimg title=\"THE LAST SACRIFICE\" src=\"https://media.aintitcool.com/media/_versions/article_images_2022/mceric/the_last_sacrifice_small.jpg\" alt=\"THE LAST SACRIFICE\" width=\"140\" height=\"208\"/\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eLastly, THE LAST SACRIFICE is a documentary written and directed by Rupert Russell about the murder of Charles Walton in the Cotswolds region of England in 1945 and the hysteria, controversy, and ultimately film revolution it spurred. This brutal and ritualistic killing that baffled inspectors at the time and remains unsolved to this day gave birth to the “folk horror” revolution, spawning such films as THE WICKER MAN, MIDSOMMAR, MEN, and MANDY. A great watch with some surprises along the way, it’s essential viewing for folk horror enthusiasts.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003eI hope these features help you celebrate the day and if no one’s said it to you yet, HAPPY HALLOWEEN. And, just to get in front of it, Happy Holidays!\u003c/span\u003e\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u003cspan\u003e-McEric, aka Eric McClanahan-\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e \u003cimg title=\"ME\" src=\"https://media.aintitcool.com/media/uploads/contributor_photos/mc-eric_medium.jpg\" alt=\"me\" width=\"300\" height=\"401\"/\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": null,
  "modifiedTime": null
}
