{
  "id": "bd5003e7-12a9-4984-b152-85eec109c803",
  "title": "Indian Action Film ‘Martin’ Scores International Distribution Deals for Indywood at Hong Kong FilMart (EXCLUSIVE)",
  "link": "https://variety.com/2025/film/news/martin-international-distribution-deals-1236340099/",
  "description": "Indian action thriller “Martin” has secured multiple international distribution deals, sales agent Indywood Distribution Network revealed at the Hong Kong FilMart. The film, which follows an Indian Revenue Service officer who loses his memory after a traumatic incident in Pakistan, has been acquired by Energia for Latin America, Capella Film for Russia, C2 Entertainments for […]",
  "author": "Naman Ramachandran",
  "published": "Wed, 19 Mar 2025 00:49:00 +0000",
  "source": "https://variety.com/feed/",
  "categories": [
    "Asia",
    "Global",
    "Markets \u0026 Festivals",
    "News",
    "Hong Kong Filmart",
    "Indywood",
    "Martin"
  ],
  "byline": "Naman Ramachandran",
  "length": 1922,
  "excerpt": "Indian action thriller 'Martin' has secured multiple international distribution deals, sales agent Indywood revealed at the Hong Kong FilMart.",
  "siteName": "Variety",
  "favicon": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128",
  "text": "Indian action thriller “Martin” has secured multiple international distribution deals, sales agent Indywood Distribution Network revealed at the Hong Kong FilMart. The film, which follows an Indian Revenue Service officer who loses his memory after a traumatic incident in Pakistan, has been acquired by Energia for Latin America, Capella Film for Russia, C2 Entertainments for the U.S. and Trinity Creative Partnership for the U.K. Directed by A.P. Arjun and produced by Uday K. Mehta, “Martin” stars Dhruva Sarja in the lead role, with supporting performances from Vaibhavi Shandilya, Anveshi Jain and Sukrutha Wagle. According to the official synopsis, the narrative follows protagonist Arjun, who “wakes up in a Pakistani prison with no recollection of his identity” and “embarks on a perilous journey to uncover his past.” As his memory gradually returns, he discovers he was on a mission to apprehend the titular Martin, described as “a notorious international crime boss known for eliminating adversaries with a signature shot to the left eye.” Popular on Variety Indywood also represents several other Indian titles including “Identity,” “Manjummel Boys,” “Maharaja,” “777 Charlie,” “The Goat Life,” “Ayalaan,” “Marco,” “Shakahari,” “Blink” and “Kamasutra.” Ahead of Berlin’s European Film Market in February, Indywood picked up international sales rights to “The Wrestler” (“Boli”), Bangladesh‘s submission for the 97th Academy Awards’ international feature film category and top prize-winner at the Busan International Film Festival. Indywood previously sold “Kamasutra” to Twin (Japan, all rights), A2 Filmes (Latin America TV/VOD), Filmbridge (Mongolia, all rights), Pioneer Film (Philippines, all rights) and RFT Films (U.K./Ireland, theatrical). The company maintains a strong presence across major markets including Cannes, Mipcom, Mip London and FilMart.",
  "image": "https://variety.com/wp-content/uploads/2025/03/Martin.jpg?w=1000\u0026h=563\u0026crop=1",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tIndian action thriller “\u003ca href=\"https://variety.com/t/martin/\" id=\"auto-tag_martin\" data-tag=\"martin\"\u003eMartin\u003c/a\u003e” has secured multiple international distribution deals, sales agent \u003ca href=\"https://variety.com/t/indywood/\" id=\"auto-tag_indywood\" data-tag=\"indywood\"\u003eIndywood\u003c/a\u003e Distribution Network revealed at the \u003ca href=\"https://variety.com/t/hong-kong-filmart/\" id=\"auto-tag_hong-kong-filmart\" data-tag=\"hong-kong-filmart\"\u003eHong Kong FilMart\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe film, which follows an Indian Revenue Service officer who loses his memory after a traumatic incident in Pakistan, has been acquired by Energia for Latin America, Capella Film for Russia, C2 Entertainments for the U.S. and Trinity Creative Partnership for the U.K.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tDirected by A.P. Arjun and produced by Uday K. Mehta, “Martin” stars Dhruva Sarja in the lead role, with supporting performances from Vaibhavi Shandilya, Anveshi Jain and Sukrutha Wagle.\n\n\n\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tAccording to the official synopsis, the narrative follows protagonist Arjun, who “wakes up in a Pakistani prison with no recollection of his identity” and “embarks on a perilous journey to uncover his past.” As his memory gradually returns, he discovers he was on a mission to apprehend the titular Martin, described as “a notorious international crime boss known for eliminating adversaries with a signature shot to the left eye.”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234758890\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tPopular on Variety\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tIndywood also represents several other Indian titles including “Identity,” “Manjummel Boys,” “Maharaja,” “777 Charlie,” “The Goat Life,” “Ayalaan,” “Marco,” “Shakahari,” “Blink” and “Kamasutra.” Ahead of Berlin’s European Film Market in February, Indywood picked up international sales rights to “\u003ca href=\"https://variety.com/t/the-wrestler/\"\u003eThe Wrestler\u003c/a\u003e” (“Boli”), \u003ca href=\"https://variety.com/t/bangladesh/\"\u003eBangladesh\u003c/a\u003e‘s submission for the 97th Academy Awards’ international feature film category and \u003ca href=\"https://variety.com/2023/film/news/busan-film-festival-new-currents-awards-1235754978/\"\u003etop prize-winner at the Busan International Film Festival.\u003c/a\u003e Indywood \u003ca href=\"https://variety.com/2024/film/markets-festivals/kamasutra-indywood-filmart-1235934852/\"\u003epreviously sold “Kamasutra”\u003c/a\u003e to Twin (Japan, all rights), A2 Filmes (Latin America TV/VOD), Filmbridge (Mongolia, all rights), Pioneer Film (Philippines, all rights) and RFT Films (U.K./Ireland, theatrical).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe company maintains a strong presence across major markets including Cannes, Mipcom, Mip London and FilMart.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-19T00:49:00Z",
  "modifiedTime": "2025-03-18T06:58:43Z"
}
