{
  "id": "c1200155-b572-4cab-b2a7-e669decc353b",
  "title": "From The Creator Of ‘The Jinx’ Comes Shocking Expose Of Alabama Prison Conditions: “The System Is Really In Free Fall” – Sundance",
  "link": "https://deadline.com/2025/01/the-alabama-solution-documentary-interview-directors-andrew-jarecki-charlotte-kaufman-1236274879/",
  "description": "The pulverized face of Steven Davis tells a terrifying story of conditions inside Alabama state prisons – his eyes swollen shut, his bruised flesh a deep purple. “They beat him so badly his head was misshapen,” his mother, Sandy Ray, said at the time. “He looked like an alien.” The “they” she referred to are […]",
  "author": "Matthew Carey",
  "published": "Sat, 01 Feb 2025 00:24:54 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "Documentary",
    "Festivals",
    "News",
    "Andrew Jarecki",
    "Charlotte Kaufman",
    "Sundance",
    "Sundance Film Festival",
    "The Alabama Solution",
    "The Jinx"
  ],
  "byline": "Matthew Carey",
  "length": 5779,
  "excerpt": "'The Jinx' director Andrew Jarecki exposes shocking conditions in Alabama's prisons in the Sundance premiere documentary 'The Alabama Solution.'",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "The pulverized face of Steven Davis tells a terrifying story of conditions inside Alabama state prisons – his eyes swollen shut, his bruised flesh a deep purple. “They beat him so badly his head was misshapen,” his mother, Sandy Ray, said at the time. “He looked like an alien.” The “they” she referred to are prison guards at the William E. Donaldson Correctional Facility in Jefferson County, AL. Guards claimed Davis came at them with makeshift weapons, but that account is very much called into question in the documentary The Alabama Solution, directed by Emmy winner Andrew Jarecki (The Jinx parts 1 and 2, Capturing the Friedmans) and Charlotte Kaufman (The Jinx part 2). The film, which is expected to air on HBO later this year, just premiered at the Sundance Film Festival. “The prisons have been allowed to run essentially unmonitored,” Jarecki tells Deadline. “You have a prison camp where there may be 1,400 [inmates] living, maybe the prison is already 180 or 200 percent over capacity, so it’s insanely overburdened. And then the fact that there’s so little oversight means that the men are in constant fear that they’re going to be abused in some form.” Watch on Deadline Jarecki continues, “There is no control over the behavior of guards or over the ability to provide any kind of basic level of humane treatment for people who are mentally ill or people who are troubled or just people who are vulnerable because it’s an environment where resources are so scarce.” L-R Co-producer Alex Duran, director Charlotte Kaufman, director Andrew Jarecki at the Deadline 2025 Sundance Film Festival Portrait Studio Michael Buckner for Deadline The documentary project began with an invitation to the filmmakers to attend an open-air barbecue and revival meeting held annually at some Alabama state prisons, including the Easterling Correctional Facility in Clio. Those festive events, which inmates are allowed to attend, show the prison system in a positive light, but while on the grounds of Easterling, Jarecki and Kaufman began to hear of a starkly different reality behind prison walls. “In the course of filming this revival meeting, men began taking us aside and sort of giving us a secret window into what was actually happening in the prisons, which was very shocking to us,” Jarecki recounts. “We knew that the prisons in Alabama were troubled, but we had no idea how serious the situation was until these men started reaching out to us.” Prisoners went further than just reaching out – they also provided videos surreptitiously recorded on contraband cell phones (ironically, the inference is that inmates obtain the phones from guards who run a black market trade in them). “The phenomena of these cell phones has opened up access and the opportunity not only for us to see in,” Kaufman observes, “but for them to communicate out in a very meaningful and historic way.” Melvin Ray and Robert Earl “Kinetik Justice” Council are among the incarcerated men who provided videos documenting living conditions in Alabama prisons. Their footage showed multiple prisoners in what appeared to be a drug-addled stupor, flooding in corridors, men sleeping on floors or in barracks conditions, and beatings routinely administered by guards. “People probably assume, ‘Well, a lot of the prisons in the country, they may not be like Hilton hotels… but there’s got to be some basic level of humane treatment,’” Jarecki notes. “[But] when you delve further and you discover that a system like Alabama is far from any minimal level of humane treatment, it’s pretty shocking. Nothing works. The system is really in free fall.” “When you consider that this is one of the top things [Alabama] is putting their money towards,” Kaufman says, “and then you compare that against how the facilities are run and the condition they’re in, it begs some questions.” In December 2020, the first Trump administration filed suit against the State of Alabama and the Alabama Department of Corrections, alleging “the conditions at Alabama’s prisons for men violate the Constitution because Alabama fails to provide adequate protection from prisoner-on-prisoner violence and prisoner-on-prisoner sexual abuse, fails to provide safe and sanitary conditions, and subjects prisoners to excessive force at the hands of prison staff.” The filmmakers interviewed Alabama’s attorney general Steve Marshall, and their documentary includes many clips of Republican Gov. Kay Ivey speaking to the federal lawsuit. Neither Marshall nor Ivey appeared willing to acknowledge problems in the state’s prison system. “There’s no question that the attitude of Alabama has been one of defiance since the beginning of the [Department of Justice] looking into the prison system,” Jarecki comments. “They’ve essentially said either that the DOJ didn’t need to be doing it, they had it under control, that the DOJ’s information was anecdotal… They continue to believe that they don’t want or need any outside assistance in solving the problem and they’re searching for or implementing a ‘solution,’ which is a homegrown solution. So, I guess that’s the question that that title [of the film] raises. Is there a solution that is real in the offing?” HBO has been home to Jarecki’s best known projects, Capturing the Friedmans (2023) and The Jinx (season 1 aired in 2015; season 2 aired last year). Jarecki expects The Alabama Solution to premiere sometime in 2025. “I think they’re trying to make that plan now, but it’ll be later this year,” Jarecki says of HBO. “I think they understand the urgency of getting the message out.”",
  "image": "https://deadline.com/wp-content/uploads/2025/01/The-Alabama-Solution.png?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe pulverized face of Steven Davis tells a terrifying story of conditions inside Alabama state prisons – his eyes swollen shut, his bruised flesh a deep purple.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“They beat him so badly his head was misshapen,” his mother, Sandy Ray, said at the time. “He looked like an alien.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe “they” she referred to are prison guards at the William E. Donaldson Correctional Facility in Jefferson County, AL. Guards claimed Davis came at them with makeshift weapons, but that account is very much called into question in the documentary \u003cem\u003e\u003ca href=\"https://deadline.com/tag/the-alabama-solution/\" id=\"auto-tag_the-alabama-solution\" data-tag=\"the-alabama-solution\"\u003eThe Alabama Solution\u003c/a\u003e\u003c/em\u003e, directed by Emmy winner \u003ca href=\"https://deadline.com/tag/andrew-jarecki/\" id=\"auto-tag_andrew-jarecki\" data-tag=\"andrew-jarecki\"\u003eAndrew Jarecki\u003c/a\u003e (\u003cem\u003e\u003ca href=\"https://deadline.com/tag/the-jinx/\" id=\"auto-tag_the-jinx\" data-tag=\"the-jinx\"\u003eThe Jinx\u003c/a\u003e\u003c/em\u003e parts 1 and 2, \u003cem\u003eCapturing the Friedmans\u003c/em\u003e) and \u003ca href=\"https://deadline.com/tag/charlotte-kaufman/\" id=\"auto-tag_charlotte-kaufman\" data-tag=\"charlotte-kaufman\"\u003eCharlotte Kaufman\u003c/a\u003e (\u003cem\u003eThe Jinx\u003c/em\u003e part 2). The film, which is expected to air on HBO later this year, just premiered at the \u003ca href=\"https://deadline.com/tag/sundance/\" id=\"auto-tag_sundance\" data-tag=\"sundance\"\u003eSundance\u003c/a\u003e Film Festival.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\t“The prisons have been allowed to run essentially unmonitored,” Jarecki tells Deadline. “You have a prison camp where there may be 1,400 [inmates] living, maybe the prison is already 180 or 200 percent over capacity, so it’s insanely overburdened. And then the fact that there’s so little oversight means that the men are in constant fear that they’re going to be abused in some form.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tJarecki continues, “There is no control over the behavior of guards or over the ability to provide any kind of basic level of humane treatment for people who are mentally ill or people who are troubled or just people who are vulnerable because it’s an environment where resources are so scarce.”\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?w=300\" alt=\"L-R Co-producer Alex Duran, director Charlotte Kaufman, director Andrew Jarecki at the Deadline 2025 Sundance Film Festival Portrait Studio\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg 11479w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=150,114 150w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=300,228 300w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1024,777 1024w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1536,1166 1536w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=2048,1554 2048w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=132,100 132w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=60,46 60w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=352,267 352w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=110,83 110w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=285,216 285w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=316,240 316w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=320,243 320w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=633,480 633w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=640,486 640w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=791,600 791w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=800,607 800w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1012,768 1012w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1280,971 1280w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"777\" width=\"1024\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg 11479w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=150,114 150w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=300,228 300w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1024,777 1024w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1536,1166 1536w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=2048,1554 2048w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=132,100 132w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=60,46 60w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=352,267 352w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=110,83 110w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=285,216 285w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=316,240 316w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=320,243 320w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=633,480 633w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=640,486 640w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=791,600 791w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=800,607 800w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1012,768 1012w, https://deadline.com/wp-content/uploads/2025/01/1-27-25_Sundance25_2175.jpg?resize=1280,971 1280w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\t\t\n\t\t\t\n\u003cfigcaption\u003e\n\t\n\t\t\t\t\t\u003cspan\u003eL-R Co-producer Alex Duran, director Charlotte Kaufman, director Andrew Jarecki at the Deadline 2025 \u003ca href=\"https://deadline.com/tag/sundance-film-festival/\" id=\"auto-tag_sundance-film-festival\" data-tag=\"sundance-film-festival\"\u003eSundance Film Festival\u003c/a\u003e Portrait Studio\u003c/span\u003e\n\t\t\n\t\t\t\t\t\t\t\t\t\u003ccite\u003eMichael Buckner for Deadline\u003c/cite\u003e\n\t\t\t\t\t\n\t\u003c/figcaption\u003e\n\n\t\t\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\tThe documentary project began with an invitation to the filmmakers to attend an open-air barbecue and revival meeting held annually at some Alabama state prisons, including the Easterling Correctional Facility in Clio. Those festive events, which inmates are allowed to attend, show the prison system in a positive light, but while on the grounds of Easterling, Jarecki and Kaufman began to hear of a starkly different reality behind prison walls.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“In the course of filming this revival meeting, men began taking us aside and sort of giving us a secret window into what was actually happening in the prisons, which was very shocking to us,” Jarecki recounts. “We knew that the prisons in Alabama were troubled, but we had no idea how serious the situation was until these men started reaching out to us.”\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tPrisoners went further than just reaching out – they also provided videos surreptitiously recorded on contraband cell phones (ironically, the inference is that inmates obtain the phones from guards who run a black market trade in them).\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“The phenomena of these cell phones has opened up access and the opportunity not only for us to see \u003cem\u003ein\u003c/em\u003e,” Kaufman observes, “but for them to communicate \u003cem\u003eout\u003c/em\u003e in a very meaningful and historic way.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tMelvin Ray and Robert Earl “Kinetik Justice” Council are among the incarcerated men who provided videos documenting living conditions in Alabama prisons. Their footage showed multiple prisoners in what appeared to be a drug-addled stupor, flooding in corridors, men sleeping on floors or in barracks conditions, and beatings routinely administered by guards.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“People probably assume, ‘Well, a lot of the prisons in the country, they may not be like Hilton hotels… but there’s got to be some basic level of humane treatment,’” Jarecki notes. “[But] when you delve further and you discover that a system like Alabama is far from any minimal level of humane treatment, it’s pretty shocking. Nothing works. The system is really in free fall.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“When you consider that this is one of the top things [Alabama] is putting their money towards,” Kaufman says, “and then you compare that against how the facilities are run and the condition they’re in, it begs some questions.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn December 2020, the first Trump administration filed suit against the State of Alabama and the Alabama Department of Corrections, alleging “the conditions at Alabama’s prisons for men violate the Constitution because Alabama fails to provide adequate protection from prisoner-on-prisoner violence and prisoner-on-prisoner sexual abuse, fails to provide safe and sanitary conditions, and subjects prisoners to excessive force at the hands of prison staff.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe filmmakers interviewed Alabama’s attorney general Steve Marshall, and their documentary includes many clips of Republican Gov. Kay Ivey speaking to the federal lawsuit. Neither Marshall nor Ivey appeared willing to acknowledge problems in the state’s prison system.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“There’s no question that the attitude of Alabama has been one of defiance since the beginning of the [Department of Justice] looking into the prison system,” Jarecki comments. “They’ve essentially said either that the DOJ didn’t need to be doing it, they had it under control, that the DOJ’s information was anecdotal… They continue to believe that they don’t want or need any outside assistance in solving the problem and they’re searching for or implementing a ‘solution,’ which is a homegrown solution. So, I guess that’s the question that that title [of the film] raises. Is there a solution that is real in the offing?”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tHBO has been home to Jarecki’s best known projects, \u003cem\u003eCapturing the Friedmans\u003c/em\u003e (2023) and \u003cem\u003eThe Jinx\u003c/em\u003e (season 1 aired in 2015; season 2 aired last year). Jarecki expects \u003cem\u003eThe Alabama Solution\u003c/em\u003e to premiere sometime in 2025. \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I think they’re trying to make that plan now, but it’ll be later this year,” Jarecki says of HBO. “I think they understand the urgency of getting the message out.”\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-01T00:24:54Z",
  "modifiedTime": "2025-02-01T00:25:02Z"
}
