{
  "id": "c490a8e8-2e50-4a66-9b09-6089557d565b",
  "title": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!",
  "link": "https://www.aintitcool.com/michaeljohnwarreninterview2024freediver-83598/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=coolnews",
  "description": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren! Read the full article on AICN Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Finish the article on AICN",
  "author": "Barbarella",
  "published": "Fri, 06 Dec 2024 12:45:00 +0000",
  "source": "https://www.aintitcool.com/node/feed/",
  "categories": null,
  "byline": "Barbarella",
  "length": 10857,
  "excerpt": "Barbarella Dives into Conversation with FREEDIVER Director Michael John Warren!",
  "siteName": "Aint It Cool News",
  "favicon": "",
  "text": "Hey friends! Barbarella here. Michael John Warren’s latest documentary Freediver is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death.  Although risk-free to myself, witnessing Alexey move gracefully deeper into peril in Freediver proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both! Whether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Michael’s film provides enough information about the physiology of freediving to get viewers into an appropriate headspace to be enthralled as they witness Alexey’s attempts to go deeper into the depths. Freediver also submerges viewers not just into the water to follow these attempts, but also into the lives impacted by Alexey’s pursuit of being the best. Through interviews with family, friends, and rival competitors, we not only become immersed in the graceful, risky world of freediving, but we also witness the relationships that shape the man behind the diver. I had an opportunity to speak with Michael John Warren about Freediver. Check it out! Barbara: So quick question, have you ever scuba-dived or free-dived?  Michael: I have scuba-dived, and it was a gnarly experience, which I probably don't have time to tell you now, and I think we've all actually free-dived. We just don't know it, right? It's really just holding your breath and going under water, but I have not free-dived in the way that is represented in this film.  Barbara: Few have. I found it pretty interesting the way you approached the physiology and all the problems that could happen. I got certified to scuba years ago, and it just made me remember how they tell you everything that could go wrong, and then they're like, “Okay, let's go get in the water,” and you're like, “I don't know if I want to do that now.”  Michael: Exactly.  Barbara: What informed your decision to construct it that way?  Michael: Well, I thought that was really important to understand the physical dangers. I hadn't seen freediving explained that way before. We didn't know there were other freediving films out there when we started this film, but when I saw the other freediver films coming out, I was like, “Well, they really left a lot out there for us to dig into.\" The side about what happens biologically and scientifically to the body when you do this was ground that I wanted to cover, even before I knew there were any other films out there, because I think it's fascinating what happens to the human body when you hold your breath, and you go down and all this pressure starts crushing you down.  People thought just a few decades ago, if you went half as far as Alexey goes in this film, your torso would crush, right? They still don't really know how far you can go before that happens, and part of what's crazy about the sport is they keep going a little deeper, a little bit deeper, a little bit deeper. Someday they might learn like, “Oh, that's it, we found the spot, and it's there.” Part of what Alexey is doing is pushing the human body way beyond what anyone thought was possible just a couple decades ago. I thought the scientific side of it was important to understand because I think it helps people understand that. Of course, there's a spiritual side to it, and there's this really beautiful story about this son and his mother and his own son and the decisions he's making to do what he does, but I wanted people to understand that this is life and death when he goes down there, because I thought that was part of my job as a storyteller is to make sure that the story has stakes. That's part of what we do when we tell stories, and there's not really bigger stakes than life and death, and so I wanted to make sure that was clear for people at the top of the film.  Barbara: Yeah, definitely. I felt very nervous watching him doing this.  Michael: Same, by the way, watching it live. I was like, “Oh gosh, here we go.”  Barbara: I can't even imagine. I have a question about the rivalry between him and William. What was that like behind the scenes?  Michael: I think it was exactly like it is in the film. They know each other; they talk to each other, but I don't know if they're going on a beach vacation together. You know what I mean? They're both very professional. They're both ready to have all those conversations about who's doing what and why and The film is about Alexey, but William Trubridge is to not be ignored; he is a really important figure in the sport. Of course, people talk about him and Alexey, and I wanted to make sure William got his voice heard in this film, as well, because first of all, I love the way he talks, right? He's just got a great vocabulary and a really great way of explaining things, but also it was important for him to explain why Alexey wasn't invited to Vertical Blue the year he wasn't invited. He’s a fascinating character, so of course I brought him in. Alexey wanted him in it, as well. They all wanted to be part of this film, and so the rivalry is what you saw. I'm always trying to tell the truth for representation. Of course, I'm storytelling. Of course I'm trying to make an exciting presentation for the audience, but I'm always trying to do that within the parameters of being truthful. I feel like both of them are pretty truthfully represented in the film.  Barbara: You go to a lot of beautiful locations for this. What was your favorite?  Michael: Yeah, good question. So we go to the Philippines, Honduras, Russia, Mauritius, which is an island 300 miles east of Madagascar, and we did some filming in LA and France. I think for me, the Philippines was a really special place. I've been there at least once or twice in my life, and it's a really dramatic place. Life is just sort of really in your face there. So that was a really incredible trip for us. But look, we also went to Nice, France, which is where all the billionaires have their yachts in the bays, and it was fun to see how the absurdly rich lived a for a week. And so France was really nice, really hard work, but the Philippines is really special. The whole trip was really great. I have an incredible crew who did this journey with me, and we're all pretty tight, and so we got to experience the world while making this film. And yeah, I mean, look, it's nice work if you can get it.  Barbara: Yeah, exactly. I also noticed you had a ton of producers on this. What is that like working with that many?  Michael: Everything I do is usually at a level where there's a lot of producers. I've been lucky enough to do this for a really long time. I'm lucky to do things that generally are at a pretty high level, so I'm quite used to having a lot of people talking to me, pulling me aside, putting me in a big room with a lot of people and saying things to me. It's just part of the job. I don't love that part of the job, frankly, as much as I love being out in the world and capturing the thing and being in the edit room and making it. But I have to say, I had really great partners. I had Skydance, which is a great company to work with, Picturestart, Boardwalk Pictures, which is a documentary company that does, in my opinion, basically the best docs in the world, and the good folks at Condé Nast and GQ. I had a lot of really strong support on this film. Of course, there's a lot of conflicting opinions in the room, but we're all grownups, and we're all professionals; we're always having conversations that might seem awkward, and they are awkward maybe, but that's part of what we do to make our art.  Barbara: How much time did it take to edit? Michael: That's a good question. I think we were probably editing maybe a little bit more than six months. We were editing while we were still filming, which is sort of commonplace these days, so I'd be out in some random country, and my editor would be sending me stuff, and I'd be talking to them on a Zoom. It was a really involved process. This is not an easy story to tell, and the trick with editing is no one notices good editing. That's part of the thing. It's like good service at a restaurant. You don't actually really know that they're all back there going like this (flails arms around), and then they walk out, and they're like (gestures calmly), “Here's your [order].” Editing is the same way where the better the editing is, the less you notice it. I feel like this film is a perfect example of that. Shout out to Mohamed El Manasterly, who cut this film for me. Yeah, I'm really proud of the final result.  Barbara: Was there anything that you captured that you wanted to put in the movie that maybe didn't make it in there?  Michael: Not much. This was a really challenging film to capture, and often when I'm making documentaries, I film a lot of material, and a lot of it doesn't ever go into the film. This film is pretty much like what we filmed is in the movie. First of all, he's doing world records; they're only going to happen once. That’s a central part of this film, and I really feel like all the best parts of what we captured are in this film. I feel like it really all got in there, which I think is sort of rare for documentarians, because we usually have a lot of great stuff that just doesn't make it because of the flow of the film, the pacing, the length, running time. But this film really feels like all the best stuff is in there, and I believe is all arranged in the perfect way for the audience to experience.  Check out the beautifully shot Freediver on Digital! I'm including the trailer here, but I warn you, it has some spoilers, so if you don't want to see them, only watch the first 45 seconds of the trailer, or better yet, just go watch the whole movie starting December 7, 2024.  Barbarella out!",
  "image": "https://media.aintitcool.com/media/_versions/article_images_2022/barbarella/freediver_1_huge.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\u003cp\u003e\u003cimg title=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" src=\"https://media.aintitcool.com/media/uploads/article_images_2022/barbarella/freediver_8.jpg\" alt=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" width=\"751\" height=\"396\"/\u003eHey friends! Barbarella here. Michael John Warren’s latest documentary \u003cstrong\u003e\u003cem\u003eFreediver\u003c/em\u003e\u003c/strong\u003e is available on Prime Video, or buy or rent on Digital starting December 7, 2024. The film plunges viewers into the world of competitive freediving as it chronicles Alexey Molchanov’s unprecedented attempt to set world records in multiple categories of the sport. Opening with some explanations about diving’s impact on the body, the film draws me back to memories of getting certified to scuba. Prior to those classes, the risks about which I knew were drowning, underwater predators (e.g. sharks), and the bends. Yet, those first days in the classroom, we learned a whole horde of other damaging or fatal consequences of diving that I had never previously considered. Once we were all sufficiently terrified of the consequences of our planned endeavor, it was time to don our gear and plunge into the depths. And we did, despite the inherent risks of injury and death. \u003c/p\u003e\n\u003cp\u003eAlthough risk-free to myself, witnessing Alexey move gracefully deeper into peril in \u003cem\u003e\u003cstrong\u003eFreediver\u003c/strong\u003e\u003c/em\u003e proves almost as nerve-wracking as my first open-water dive and leaves me pondering questions, like “How long could I hold my breath?” - the answer is not long at all - or “Would I ever consider free diving?” The answer is maybe, but absolutely not competitively. Those people are insane, superhuman, or both!\u003c/p\u003e\n\u003cp\u003eWhether they are insane or not, I spend much of the film in awe of these people who have trained their bodies to perform skills the human body was never meant to experience. Michael’s film provides enough information about the physiology of freediving to get viewers into an appropriate headspace to be enthralled as they witness Alexey’s attempts to go deeper into the depths. \u003cem\u003e\u003cstrong\u003eFreediver\u003c/strong\u003e\u003c/em\u003e also submerges viewers not just into the water to follow these attempts, but also into the lives impacted by Alexey’s pursuit of being the best. Through interviews with family, friends, and rival competitors, we not only become immersed in the graceful, risky world of freediving, but we also witness the relationships that shape the man behind the diver.\u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" src=\"https://media.aintitcool.com/media/uploads/article_images_2022/barbarella/freediver_13.jpg\" alt=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" width=\"751\" height=\"314\"/\u003e\u003c/p\u003e\n\u003cp\u003eI had an opportunity to speak with Michael John Warren about \u003cem\u003e\u003cstrong\u003eFreediver.\u003c/strong\u003e\u003c/em\u003e Check it out!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eSo quick question, have you ever scuba-dived or free-dived? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eI have scuba-dived, and it was a gnarly experience, which I probably don\u0026#39;t have time to tell you now, and I think we\u0026#39;ve all actually free-dived. We just don\u0026#39;t know it, right? It\u0026#39;s really just holding your breath and going under water, but I have not free-dived in the way that is represented in this film. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eFew have. I found it pretty interesting the way you approached the physiology and all the problems that could happen. I got certified to scuba years ago, and it just made me remember how they tell you everything that could go wrong, and then they\u0026#39;re like, “Okay, let\u0026#39;s go get in the water,” and you\u0026#39;re like, “I don\u0026#39;t know if I want to do that now.” \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eExactly. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eWhat informed your decision to construct it that way? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eWell, I thought that was really important to understand the physical dangers. I hadn\u0026#39;t seen freediving explained that way before. We didn\u0026#39;t know there were other freediving films out there when we started this film, but when I saw the other freediver films coming out, I was like, “Well, they really left a lot out there for us to dig into.\u0026#34; The side about what happens biologically and scientifically to the body when you do this was ground that I wanted to cover, even before I knew there were any other films out there, because I think it\u0026#39;s fascinating what happens to the human body when you hold your breath, and you go down and all this pressure starts crushing you down. \u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" src=\"https://media.aintitcool.com/media/uploads/article_images_2022/barbarella/freediver_4.jpg\" alt=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" width=\"751\" height=\"396\"/\u003ePeople thought just a few decades ago, if you went half as far as Alexey goes in this film, your torso would crush, right? They still don\u0026#39;t really know how far you can go before that happens, and part of what\u0026#39;s crazy about the sport is they keep going a little deeper, a little bit deeper, a little bit deeper. Someday they might learn like, “Oh, that\u0026#39;s it, we found the spot, and it\u0026#39;s there.” Part of what Alexey is doing is pushing the human body way beyond what anyone thought was possible just a couple decades ago. I thought the scientific side of it was important to understand because I think it helps people understand that. Of course, there\u0026#39;s a spiritual side to it, and there\u0026#39;s this really beautiful story about this son and his mother and his own son and the decisions he\u0026#39;s making to do what he does, but I wanted people to understand that this is life and death when he goes down there, because I thought that was part of my job as a storyteller is to make sure that the story has stakes. That\u0026#39;s part of what we do when we tell stories, and there\u0026#39;s not really bigger stakes than life and death, and so I wanted to make sure that was clear for people at the top of the film. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eYeah, definitely. I felt very nervous watching him doing this. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eSame, by the way, watching it live. I was like, “Oh gosh, here we go.” \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eI can\u0026#39;t even imagine. I have a question about the rivalry between him and William. What was that like behind the scenes? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eI think it was exactly like it is in the film. They know each other; they talk to each other, but I don\u0026#39;t know if they\u0026#39;re going on a beach vacation together. You know what I mean? They\u0026#39;re both very professional. They\u0026#39;re both ready to have all those conversations about who\u0026#39;s doing what and why and The film is about Alexey, but William Trubridge is to not be ignored; he is a really important figure in the sport. Of course, people talk about him and Alexey, and I wanted to make sure William got his voice heard in this film, as well, because first of all, I love the way he talks, right? He\u0026#39;s just got a great vocabulary and a really great way of explaining things, but also it was important for him to explain why Alexey wasn\u0026#39;t invited to Vertical Blue the year he wasn\u0026#39;t invited. He’s a fascinating character, so of course I brought him in. Alexey wanted him in it, as well. They all wanted to be part of this film, and so the rivalry is what you saw. I\u0026#39;m always trying to tell the truth for representation. Of course, I\u0026#39;m storytelling. Of course I\u0026#39;m trying to make an exciting presentation for the audience, but I\u0026#39;m always trying to do that within the parameters of being truthful. I feel like both of them are pretty truthfully represented in the film. \u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" src=\"https://media.aintitcool.com/media/uploads/article_images_2022/barbarella/freediver_11.jpg\" alt=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" width=\"751\" height=\"396\"/\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eYou go to a lot of beautiful locations for this. What was your favorite? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eYeah, good question. So we go to the Philippines, Honduras, Russia, Mauritius, which is an island 300 miles east of Madagascar, and we did some filming in LA and France. I think for me, the Philippines was a really special place. I\u0026#39;ve been there at least once or twice in my life, and it\u0026#39;s a really dramatic place. Life is just sort of really in your face there. So that was a really incredible trip for us. But look, we also went to Nice, France, which is where all the billionaires have their yachts in the bays, and it was fun to see how the absurdly rich lived a for a week. And so France was really nice, really hard work, but the Philippines is really special. The whole trip was really great. I have an incredible crew who did this journey with me, and we\u0026#39;re all pretty tight, and so we got to experience the world while making this film. And yeah, I mean, look, it\u0026#39;s nice work if you can get it. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eYeah, exactly. I also noticed you had a ton of producers on this. What is that like working with that many? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eEverything I do is usually at a level where there\u0026#39;s a lot of producers. I\u0026#39;ve been lucky enough to do this for a really long time. I\u0026#39;m lucky to do things that generally are at a pretty high level, so I\u0026#39;m quite used to having a lot of people talking to me, pulling me aside, putting me in a big room with a lot of people and saying things to me. It\u0026#39;s just part of the job. I don\u0026#39;t love that part of the job, frankly, as much as I love being out in the world and capturing the thing and being in the edit room and making it. But I have to say, I had really great partners. I had \u003cstrong\u003eSkydance\u003c/strong\u003e, which is a great company to work with, \u003cstrong\u003ePicturestart\u003c/strong\u003e, \u003cstrong\u003eBoardwalk Pictures\u003c/strong\u003e, which is a documentary company that does, in my opinion, basically the best docs in the world, and the good folks at \u003cstrong\u003eCondé Nast\u003c/strong\u003e and \u003cstrong\u003eGQ\u003c/strong\u003e. I had a lot of really strong support on this film. Of course, there\u0026#39;s a lot of conflicting opinions in the room, but we\u0026#39;re all grownups, and we\u0026#39;re all professionals; we\u0026#39;re always having conversations that might seem awkward, and they are awkward maybe, but that\u0026#39;s part of what we do to make our art. \u003c/p\u003e\n\u003cp\u003e\u003cimg title=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" src=\"https://media.aintitcool.com/media/uploads/article_images_2022/barbarella/freediver_10.jpg\" alt=\"Alexey Molchanov in the documentary/sports film FREEDIVER, a Paramount Pictures release. Photo courtesy of Paramount Pictures.\" width=\"751\" height=\"314\"/\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eHow much time did it take to edit?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eThat\u0026#39;s a good question. I think we were probably editing maybe a little bit more than six months. We were editing while we were still filming, which is sort of commonplace these days, so I\u0026#39;d be out in some random country, and my editor would be sending me stuff, and I\u0026#39;d be talking to them on a Zoom. It was a really involved process. This is not an easy story to tell, and the trick with editing is no one notices good editing. That\u0026#39;s part of the thing. It\u0026#39;s like good service at a restaurant. You don\u0026#39;t actually really know that they\u0026#39;re all back there going like this (\u003cem\u003eflails arms around\u003c/em\u003e), and then they walk out, and they\u0026#39;re like (\u003cem\u003egestures calml\u003c/em\u003ey), “Here\u0026#39;s your [order].”\u003cstrong\u003e\u003cem\u003e \u003c/em\u003e\u003c/strong\u003eEditing is the same way where the better the editing is, the less you notice it. I feel like this film is a perfect example of that. Shout out to Mohamed El Manasterly, who cut this film for me. Yeah, I\u0026#39;m really proud of the final result. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eBarbara: \u003c/em\u003e\u003c/strong\u003eWas there anything that you captured that you wanted to put in the movie that maybe didn\u0026#39;t make it in there? \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eMichael: \u003c/em\u003e\u003c/strong\u003eNot much. This was a really challenging film to capture, and often when I\u0026#39;m making documentaries, I film a lot of material, and a lot of it doesn\u0026#39;t ever go into the film. This film is pretty much like what we filmed is in the movie. First of all, he\u0026#39;s doing world records; they\u0026#39;re only going to happen once. That’s a central part of this film, and I really feel like all the best parts of what we captured are in this film. I feel like it really all got in there, which I think is sort of rare for documentarians, because we usually have a lot of great stuff that just doesn\u0026#39;t make it because of the flow of the film, the pacing, the length, running time. But this film really feels like all the best stuff is in there, and I believe is all arranged in the perfect way for the audience to experience. \u003c/p\u003e\n\u003cp\u003eCheck out the beautifully shot \u003cem\u003e\u003cstrong\u003eFreediver\u003c/strong\u003e\u003c/em\u003e on Digital! I\u0026#39;m including the trailer here, but I warn you, it has some spoilers, so if you don\u0026#39;t want to see them, only watch the first 45 seconds of the trailer, or better yet, just go watch the whole movie starting December 7, 2024. \u003c/p\u003e\n\u003cp\u003eBarbarella out!\u003c/p\u003e\n\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/TFoC6Y3-vP4?si=iEzv-bt5z0WwCAIw\" title=\"YouTube video player\" width=\"425\" height=\"350\" allowfullscreen=\"\" frameborder=\"0\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": null,
  "modifiedTime": null
}
