{
  "id": "c7deae8a-a2d0-4b0a-9b41-91130962c58b",
  "title": "Sydney Sweeney's Worst Movie, According To IMDb",
  "link": "https://www.slashfilm.com/1912107/sydney-sweneey-worst-movie-according-imdb/",
  "description": "If you look at ratings on IMDb, Sydney Sweeney's first movie is related to spiders ... but it's not the Marvel flop you're thinking of.",
  "author": "Andrew Gladman",
  "published": "Sun, 20 Jul 2025 00:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Movies",
    "Thriller Movies"
  ],
  "byline": "Andrew Gladman",
  "length": 3512,
  "excerpt": "If you look at ratings on IMDb, Sydney Sweeney's first movie is related to spiders ... but it's not the Marvel flop you're thinking of.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Millennium Films Star of \"Euphoria,\" \"The White Lotus,\" and \"The Handmaid's Tale,\" Sydney Sweeney has shot to fame in recent years and has been consistently impressing audiences. The in-demand actress started young, appearing on an episode of NBC's \"Heroes\" as a child in 2009 and making her film debut around the same time, in the independent horror \"ZMD: Zombies of Mass Destruction.\" From these early appearances as a child star, Sweeney has gone on to accrue a seriously impressive list of credits, appearing in the Netflix comedy-drama \"Everything Sucks!\" and Quentin Tarantino's \"Once Upon a Time... in Hollywood.\" While Sweeney herself has regularly proved popular with audiences — her casting is often a highlight of the movies and series with which she has been involved — not every project she has been a part of has enjoyed resounding success. On IMDb, Sweeney's lowest-rated film has scored just a 3.4 out of 10, though it's a role of hers that most fans probably missed. The movie in question is \"Spiders 3D,\" a low-budget sci-fi horror, released in 2013. The movie starred a teenage Sydney Sweeney as Emily Cole, the young daughter of the film's two protagonists, Jason (Patrick Muldoon) and Rachel Cole (Christa Campbell). \"Spiders 3D\" may have failed to impress audiences and critics, but it at least offers a healthy dose of goofy B-movie fun in a horror romp about giant spiders infesting New York City. If nothing else, the movie showcases Sweeney's impressive capabilities as an actress even at a young age. Sydney Sweeney has had plenty of bad luck with spiders on the big screen Sony Pictures \"Spiders 3D\" sees giant spiders arrive in New York after a subway tunnel is struck by debris from an old Soviet satellite, aboard which experiments were being conducted on the mutant arachnids. It was later revealed that these spiders were imbued with genes from an alien race, resulting in a species that could produce bulletproof silk for use by the military. It's hardly high-brow cinema. Still, some fans might be shocked that \"Spiders 3D\" is Sydney Sweeney's lowest-rated spider-themed movie on IMDb. In 2024, Sydney Sweeney had yet another encounter with superpowered spiders. This time, it was the spiders being researched by Cassandra Webb's mother in the Amazon, just before she died. \"Madame Web\" saw Sydney Sweeney take on the role of Julia Cornwall, a future Spider-Woman, who found herself under the protection of Dakota Johnson's Madame Web. The Sony-produced Marvel movie continued a negative streak that started with \"Morbius,\" flopping hard at the box office and even harder with critics, suggesting that perhaps Sony's efforts to produce a Spider-Man movie without Spider-Man had always been ill-fated. If all of that wasn't enough, Sweeney had yet another unfortunate spider encounter on the set of 2023's \"Anyone But You.\" While filming a scene with a huntsman spider, Sweeney was bitten for real in front of crew members who believed she was just acting. Perhaps Sweeney just needs to avoid any spider-adjacent roles in the future.",
  "image": "https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/l-intro-1752521271.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"wrapper\"\u003e\n        \n\u003cmain id=\"main\" role=\"main\" data-post-type=\"articles\"\u003e\n    \u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1912107/sydney-sweneey-worst-movie-according-imdb/\" data-post-title=\"Sydney Sweeney\u0026#39;s Worst Movie, According To IMDb\" data-slide-num=\"0\" data-post-id=\"1912107\"\u003e\n                                             \u003cpicture id=\"p383880e910e4acf9bccc2354e162c400\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/intro-1752521271.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/intro-1752521271.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/intro-1752521271.jpg\" data-slide-url=\"https://www.slashfilm.com/1912107/sydney-sweneey-worst-movie-according-imdb/\" data-post-id=\"1912107\" data-slide-num=\"0\" data-slide-title=\"Sydney Sweeney\u0026#39;s Worst Movie, According To IMDb: \" width=\"780\" height=\"438\" alt=\"The Cole family, including a young Sydney Sweeney as Emily, together in Spiders 3D.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMillennium Films\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eStar of \u0026#34;Euphoria,\u0026#34; \u0026#34;The White Lotus,\u0026#34; and \u0026#34;The Handmaid\u0026#39;s Tale,\u0026#34; \u003ca href=\"https://www.slashfilm.com/1807552/sydney-sweeney-best-movies-tv-shows-ranked/\" target=\"_blank\"\u003eSydney Sweeney has shot to fame\u003c/a\u003e in recent years and has been consistently impressing audiences. The in-demand actress started young, appearing on an episode of NBC\u0026#39;s \u0026#34;Heroes\u0026#34; as a child in 2009 and making her film debut around the same time, in the independent horror \u0026#34;ZMD: Zombies of Mass Destruction.\u0026#34; From these early appearances as a child star, Sweeney has gone on to accrue a seriously impressive list of credits, appearing in \u003ca href=\"https://www.slashfilm.com/1908006/sydney-sweeney-pre-euphoria-netflix-series-everything-sucks/\" target=\"_blank\"\u003ethe Netflix comedy-drama \u0026#34;Everything Sucks!\u0026#34;\u003c/a\u003e and Quentin Tarantino\u0026#39;s \u0026#34;Once Upon a Time... in Hollywood.\u0026#34;\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eWhile Sweeney herself has regularly proved popular with audiences — her casting is often a highlight of the movies and series with which she has been involved — not every project she has been a part of has enjoyed resounding success. On IMDb, Sweeney\u0026#39;s lowest-rated film has scored just a 3.4 out of 10, though it\u0026#39;s a role of hers that most fans probably missed. The movie in question is \u0026#34;Spiders 3D,\u0026#34; a low-budget sci-fi horror, released in 2013. The movie starred a teenage Sydney Sweeney as Emily Cole, the young daughter of the film\u0026#39;s two protagonists, Jason (Patrick Muldoon) and Rachel Cole (Christa Campbell).\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;Spiders 3D\u0026#34; may have failed to impress audiences and critics, but it at least offers a healthy dose of goofy B-movie fun in a horror romp about giant spiders infesting New York City. If nothing else, the movie \u003ca href=\"https://www.slashfilm.com/1688866/sydney-sweeney-unrecognizable-boxer-christy-martin-movie/\" target=\"_blank\"\u003eshowcases Sweeney\u0026#39;s impressive capabilities\u003c/a\u003e as an actress even at a young age.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eSydney Sweeney has had plenty of bad luck with spiders on the big screen\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1912107/sydney-sweneey-worst-movie-according-imdb/\" data-post-title=\"Sydney Sweeney\u0026#39;s Worst Movie, According To IMDb\" data-slide-num=\"1\" data-post-id=\"1912107\"\u003e\n                                             \u003cpicture id=\"p5f2f47b281bb0297b576677a68596e2a\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/sydney-sweeney-has-had-plenty-of-bad-luck-with-spiders-on-the-big-screen-1752521272.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/sydney-sweeney-has-had-plenty-of-bad-luck-with-spiders-on-the-big-screen-1752521272.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/sydney-sweeneys-worst-movie-according-to-imdb/sydney-sweeney-has-had-plenty-of-bad-luck-with-spiders-on-the-big-screen-1752521272.jpg\" data-slide-url=\"https://www.slashfilm.com/1912107/sydney-sweneey-worst-movie-according-imdb/\" data-post-id=\"1912107\" data-slide-num=\"1\" data-slide-title=\"Sydney Sweeney\u0026#39;s Worst Movie, According To IMDb: Sydney Sweeney has had plenty of bad luck with spiders on the big screen\" width=\"780\" height=\"438\" alt=\"Sydney Sweeney\u0026#39;s Julia Cornwall, aka Spider-Woman, hanging from a web in Madame Web.\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eSony Pictures\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003e\u0026#34;Spiders 3D\u0026#34; sees giant spiders arrive in New York after a subway tunnel is struck by debris from an old Soviet satellite, aboard which experiments were being conducted on the mutant arachnids. It was later revealed that these spiders were imbued with genes from an alien race, resulting in a species that could produce bulletproof silk for use by the military. It\u0026#39;s hardly high-brow cinema. Still, some fans might be shocked that \u0026#34;Spiders 3D\u0026#34; is Sydney Sweeney\u0026#39;s lowest-rated spider-themed movie on IMDb.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIn 2024, Sydney Sweeney had yet another encounter with superpowered spiders. This time, it was the spiders being researched by Cassandra Webb\u0026#39;s mother in the Amazon, just before she died. \u0026#34;Madame Web\u0026#34; saw Sydney Sweeney take on the role of Julia Cornwall, a future Spider-Woman, who found herself under the protection of \u003ca href=\"https://www.slashfilm.com/1517065/marvel-madame-webs-spider-powers-explained/\" target=\"_blank\"\u003eDakota Johnson\u0026#39;s Madame Web\u003c/a\u003e. The Sony-produced Marvel movie continued a \u003ca href=\"https://www.slashfilm.com/886943/morbius-proves-why-you-cant-force-a-cult-classic-into-existence/\" target=\"_blank\"\u003enegative streak that started with \u0026#34;Morbius,\u0026#34;\u003c/a\u003e flopping hard at the box office and even harder with critics, suggesting that perhaps Sony\u0026#39;s efforts to produce a Spider-Man movie without Spider-Man had always been ill-fated.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIf all of that wasn\u0026#39;t enough, Sweeney had yet another unfortunate spider encounter on \u003ca href=\"https://www.slashfilm.com/1476053/anyone-but-you-review/\" target=\"_blank\"\u003ethe set of 2023\u0026#39;s \u0026#34;Anyone But You.\u0026#34;\u003c/a\u003e While filming a scene with a huntsman spider, Sweeney was bitten for real in front of crew members who believed she was just acting. Perhaps Sweeney just needs to avoid any spider-adjacent roles in the future.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\n    \n    \u003c/main\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-20T00:45:00Z",
  "modifiedTime": "2025-07-20T00:45:00Z"
}
