{
  "id": "c96d8d78-cd42-479d-8e27-8a9487ca60ae",
  "title": "Ben Affleck Details His Complicated Feelings About His Superhero Era",
  "link": "https://bleedingcool.com/movies/ben-affleck-details-his-complicated-feelings-about-his-superhero-era/",
  "description": "Ben Affleck explains some of his complicated feelings regarding his time as Batman and in the DC Universe.",
  "author": "Kaitlyn Booth",
  "published": "Sat, 29 Mar 2025 18:34:07 -0500",
  "source": "https://www.bleedingcool.com/movies/feed/",
  "categories": [
    "Movies",
    "Warner Bros",
    "batman v superman",
    "ben affleck"
  ],
  "byline": "Kaitlyn Booth",
  "length": 6649,
  "excerpt": "There were a lot of reasons the Zack Snyder corner of the DC Universe fell apart. It was built on the broken foundation of Man of Steel, and once the ball was rolling, there was little time to correct the course if audiences didn't respond to any particular creative decision. There were delays, films getting announced, and […]",
  "siteName": "Bleeding Cool News",
  "favicon": "",
  "text": "Posted in: Movies, Warner Bros | Tagged: batman v superman, ben affleckBen Affleck explains some of his complicated feelings regarding his time as Batman and in the DC Universe.Article Summary Ben Affleck reveals his struggles with addiction and the challenges of playing Batman in the DC Universe. Affleck speaks candidly about his past failings during his superhero era. Despite hardships, Affleck enjoyed moments in the DCU and reflects positively on certain experiences. Affleck acknowledges the DC Universe's direction skewing too mature, impacting its broad appeal. There were a lot of reasons the Zack Snyder corner of the DC Universe fell apart. It was built on the broken foundation of Man of Steel, and once the ball was rolling, there was little time to correct the course if audiences didn't respond to any particular creative decision. There were delays, films getting announced, and then never spoken of again until the whole thing eventually ended at the end of 2023. There were some things that went wrong where you could have seen them coming, and one of the actors involved very much did, but we'll come back to that. Others were circumstances beyond anyone's control. Ben Affleck was maligned when he was first announced as the new Batman, but as always, his performance turned things around, and fans became obsessed with him. However, things were not going well for Affleck behind the scenes. He has spoken, much more openly in recent years, about his battle with addiction and alcohol, and it just so happened to overlap with his time as a superhero. Affleck did a very long and excellent interview at GQ, which you should go read in its entirety, but when asked about his time as Batman, it sounds like he's got some complicated feelings to say the least. \"There are a number of reasons why that was a really excruciating experience,\" Affleck explained. \"And they don't all have to do with the simple dynamic of, say, being in a superhero movie or whatever. I am not interested in going down that particular genre again, not because of that bad experience, but just: I've lost interest in what was of interest about it to me. But I certainly wouldn't want to replicate an experience like that. A lot of it was misalignment of agendas, understandings, expectations. And also by the way, I wasn't bringing anything particularly wonderful to that equation at the time, either. I had my own failings, significant failings, in that process and at that time.\" When asked to elaborate on what exactly those \"failings\" were, Affleck did not go easy on himself in any way. He took full accountability for any shortcomings of any kind he had during that time, and that is so awesome to see. It's such an important part of the healing journey when it comes to addiction. \"I mean, my failings as an actor, you can watch the various movies and judge,\" Affleck continued. \"But more of my failings of, in terms of why I had a bad experience, part of it is that what I was bringing to work every day was a lot of unhappiness. So I wasn't bringing a lot of positive energy to the equation. I didn't cause problems, but I came in and I did my job and I went home. But you've got to do a little bit better than that.\" Ben Affleck and Ezra Miller in Justice League (2017). Photo by Courtesy of Warner Bros. Picture – © 2017 Warner Bros. Entertainment Inc., Ratpac-Dune Entertainment LLC and Ratpac Entertainment, LLC However, if you read the text, Affleck also isn't being overly hard on himself either. It's a very healthy way to look at a very unhealthy time of your life. However, these failings, or how hard it was, didn't mean that Affleck didn't enjoy his time in DC Universe. Those are two very different things. When it was confirmed that Affleck would return for The Flash, I personally wondered if he'd be okay with putting on that suit again when he was playing Batman at such a low time. However, he explicitly names Flash as one of the moments he enjoyed, so it's good to hear he safely navigated another complicated angle on this entire thing. \"I had a really good time. I loved doing the Batman movie. I loved Batman v Superman. And I liked my brief stints on The Flash that I did and when I got to work with Viola Davis on Suicide Squad for a day or two. In terms of creatively, I really think that I like the idea and the ambition that I had for it, which was of the sort of older, broken, damaged Bruce Wayne. And it was something we really went for in the first movie.\" There were a lot of reasons the DC Universe failed, as previously stated, and one of them was the age group they were trying to court. We can argue that \"comics are for adults\" until we're blue in the face, but superhero movies like this should be family films, meaning anyone of any age gets something from them, not a \"kids\" or \"adult\" film specifically. It's not one or the other; it's supposed to be everyone. It was one of those things we all saw coming from nearly the beginning, and Affleck also realized it when his own kid was too scared to watch his superhero movies. \"But what happened was it started to skew too old for a big part of the audience,\" Affleck continued. \"Like even my own son at the time was too scared to watch the movie. And so when I saw that I was like, \"Oh shit, we have a problem.\" Then I think that's when you had a filmmaker that wanted to continue down that road and a studio that wanted to recapture all the younger audience at cross purposes. Then you have two entities, two people really wanting to do something different and that is a really bad recipe.\" Affleck is coming off a South by Southwest premiere with The Accountant 2, a movie that spent some time in development hell and is finally making its way to the big screen even as an Amazon MGM Studios film. Affleck has said a couple of times now that he's done with this corner of filmmaking, and it's really time for fans to respect his decision to walk away. We got the performances we got, and even if they are tainted a little, knowing that Affleck was not in a good place when filming those scenes, he struck a nerve with a particular set of fans, and that's great. Enjoyed this? Please share on social media! Stay up-to-date and support the site by following Bleeding Cool on Google News today! About Kaitlyn BoothKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.",
  "image": "https://bleedingcool.com/wp-content/uploads/2020/08/MV5BMjE4Mjg5NTY3MF5BMl5BanBnXkFtZTgwMTQ2NDAxNDM@._V1_SX1777_CR001777960_AL_-2000x1125.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"wrapper\"\u003e\u003carticle id=\"article\" data-post-id=\"2193264\" itemscope=\"\" itemtype=\"http://schema.org/Article\"\u003e\u003cp\u003ePosted in: \u003ca href=\"https://bleedingcool.com/movies/\" rel=\"category\"\u003eMovies\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/movies/warner-bros/\" rel=\"category\"\u003eWarner Bros\u003c/a\u003e | Tagged: \u003ca href=\"https://bleedingcool.com/tag/batman-v-superman/\" rel=\"tag\"\u003ebatman v superman\u003c/a\u003e, \u003ca href=\"https://bleedingcool.com/tag/ben-affleck/\" rel=\"tag\"\u003eben affleck\u003c/a\u003e\u003c/p\u003e\u003chr/\u003e\u003cp\u003eBen Affleck explains some of his complicated feelings regarding his time as Batman and in the DC Universe.\u003c/p\u003e\u003chr/\u003e\u003chr/\u003e\u003cdiv id=\"post_summary\"\u003e\u003ch2\u003eArticle Summary\u003c/h2\u003e\u003cul\u003e\n\u003cli\u003eBen Affleck reveals his struggles with addiction and the challenges of playing Batman in the DC Universe.\u003c/li\u003e\n\u003cli\u003eAffleck speaks candidly about his past failings during his superhero era.\u003c/li\u003e\n\u003cli\u003eDespite hardships, Affleck enjoyed moments in the DCU and reflects positively on certain experiences.\u003c/li\u003e\n\u003cli\u003eAffleck acknowledges the DC Universe\u0026#39;s direction skewing too mature, impacting its broad appeal.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003chr/\u003e\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/0WWzgGyAH6Y?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/0WWzgGyAH6Y/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/0WWzgGyAH6Y?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eThere were a lot of reasons the \u003cstrong\u003eZack Snyder\u003c/strong\u003e corner of the DC Universe fell apart. It was built on the broken foundation of \u003cem\u003eMan of Steel,\u003c/em\u003e and once the ball was rolling, there was little time to correct the course if audiences didn\u0026#39;t respond to any particular creative decision. There were delays, films getting announced, and then never spoken of again until the whole thing eventually ended at the end of 2023. There were some things that went wrong where you could have seen them coming, and one of the actors involved very much did, but we\u0026#39;ll come back to that. Others were circumstances beyond anyone\u0026#39;s control. \u003cstrong\u003eBen Affleck\u003c/strong\u003e was maligned when he was first announced as the new Batman, but as always, his performance turned things around, and fans became obsessed with him. However, things were not going well for Affleck behind the scenes. He has spoken, much more openly in recent years, about his battle with addiction and alcohol, and it just so happened to overlap with his time as a superhero. Affleck did a very long and excellent interview at \u003ca href=\"https://www.gq.com/story/inside-ben-afflecks-plan-to-remake-hollywood?utm_source=twitter\u0026amp;utm_medium=social\u0026amp;utm_campaign=dhtwitter\u0026amp;utm_content=null\"\u003eGQ\u003c/a\u003e, which you should go read in its entirety, but when asked about his time as Batman, it sounds like he\u0026#39;s got some complicated feelings to say the least.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There are a number of reasons why that was a really excruciating experience,\u0026#34; Affleck explained. \u0026#34;And they don\u0026#39;t all have to do with the simple dynamic of, say, being in a superhero movie or whatever. I am not interested in going down that particular genre again, not because of that bad experience, but just: I\u0026#39;ve lost interest in what was of interest about it to me. But I certainly wouldn\u0026#39;t want to replicate an experience like that. A lot of it was misalignment of agendas, understandings, expectations. And also by the way, I wasn\u0026#39;t bringing anything particularly wonderful to that equation at the time, either. I had my own failings, significant failings, in that process and at that time.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhen asked to elaborate on what exactly those \u0026#34;failings\u0026#34; were, Affleck did not go easy on himself in any way. He took full accountability for any shortcomings of any kind he had during that time, and that is so awesome to see. It\u0026#39;s such an important part of the healing journey when it comes to addiction.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I mean, my failings as an actor, you can watch the various movies and judge,\u0026#34; Affleck continued. \u0026#34;But more of my failings of, in terms of why I had a bad experience, part of it is that what I was bringing to work every day was a lot of unhappiness. So I wasn\u0026#39;t bringing a lot of positive energy to the equation. I didn\u0026#39;t cause problems, but I came in and I did my job and I went home. But you\u0026#39;ve got to do a little bit better than that.\u0026#34;\u003c/p\u003e\n\u003cfigure id=\"attachment_1254286\" aria-describedby=\"caption-attachment-1254286\"\u003e\u003ca href=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://bleedingcool.com/wp-content/uploads/2020/08/MV5BMjE4Mjg5NTY3MF5BMl5BanBnXkFtZTgwMTQ2NDAxNDM@._V1_SX1777_CR001777960_AL_.jpg\"\u003e\u003cimg src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:324/q:75/https://bleedingcool.com/wp-content/uploads/2020/08/MV5BMjE4Mjg5NTY3MF5BMl5BanBnXkFtZTgwMTQ2NDAxNDM@._V1_SX1777_CR001777960_AL_.jpg\" alt=\"Ben Affleck Set to Reprise the Role of Batman in The Flash\" width=\"600\" height=\"324\" data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:324/q:75/https://bleedingcool.com/wp-content/uploads/2020/08/MV5BMjE4Mjg5NTY3MF5BMl5BanBnXkFtZTgwMTQ2NDAxNDM@._V1_SX1777_CR001777960_AL_.jpg\" data-old-src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20600%20324%22%20width%3D%22600%22%20height%3D%22324%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\"/\u003e\u003c/a\u003e\u003cfigcaption id=\"caption-attachment-1254286\"\u003eBen Affleck and Ezra Miller in Justice League (2017). Photo by Courtesy of Warner Bros. Picture – © 2017 Warner Bros. Entertainment Inc., Ratpac-Dune Entertainment LLC and Ratpac Entertainment, LLC\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eHowever, if you read the text, Affleck also isn\u0026#39;t being overly hard on himself either. It\u0026#39;s a very healthy way to look at a very unhealthy time of your life. However, these failings, or how hard it was, didn\u0026#39;t mean that Affleck didn\u0026#39;t enjoy his time in DC Universe. Those are two very different things. When it was confirmed that Affleck would return for \u003cem\u003eThe Flash,\u003c/em\u003e I personally wondered if he\u0026#39;d be okay with putting on that suit again when he was playing Batman at such a low time. However, he explicitly names Flash as one of the moments he enjoyed, so it\u0026#39;s good to hear he safely navigated another complicated angle on this entire thing.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I had a really good time. I loved doing the Batman movie. I loved Batman v Superman. And I liked my brief stints on The Flash that I did and when I got to work with Viola Davis on Suicide Squad for a day or two. In terms of creatively, I really think that I like the idea and the ambition that I had for it, which was of the sort of older, broken, damaged Bruce Wayne. And it was something we really went for in the first movie.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThere were a lot of reasons the DC Universe failed, as previously stated, and one of them was the age group they were trying to court. We can argue that \u0026#34;comics are for adults\u0026#34; until we\u0026#39;re blue in the face, but superhero movies like this should be family films, meaning anyone of any age gets something from them, not a \u0026#34;kids\u0026#34; or \u0026#34;adult\u0026#34; film specifically. It\u0026#39;s not one or the other; it\u0026#39;s supposed to be everyone. It was one of those things we all saw coming from nearly the beginning, and Affleck also realized it when his own kid was too scared to watch his superhero movies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;But what happened was it started to skew too old for a big part of the audience,\u0026#34; Affleck continued. \u0026#34;Like even my own son at the time was too scared to watch the movie. And so when I saw that I was like, \u0026#34;Oh shit, we have a problem.\u0026#34; Then I think that\u0026#39;s when you had a filmmaker that wanted to continue down that road and a studio that wanted to recapture all the younger audience at cross purposes. Then you have two entities, two people really wanting to do something different and that is a really bad recipe.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ciframe width=\"1170\" height=\"658\" srcdoc=\"\u0026lt;style\u0026gt;*{padding:0;margin:0;overflow:hidden}html,body{height:100%}img,span{position:absolute;width:100%;top:0;bottom:0;margin:auto}span{height:1.5em;text-align:center;font:48px/1.5 sans-serif;color:white;text-shadow:0 0 0.5em black}\u0026lt;/style\u0026gt;\u0026lt;a href=https://www.youtube.com/embed/3wRCOqyDI6E?feature=oembed?autoplay=1\u0026gt;\u0026lt;img src=https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:auto/h:auto/q:75/https://img.youtube.com/vi/3wRCOqyDI6E/hqdefault.jpg loading=\u0026#34;lazy\u0026#34; alt=\u0026#34;Link to play video.\u0026#34;\u0026gt;\u0026lt;span\u0026gt;▶\u0026lt;/span\u0026gt;\u0026lt;/a\u0026gt;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture; fullscreen;\" loading=\"lazy\" src=\"https://www.youtube.com/embed/3wRCOqyDI6E?feature=oembed\" title=\"Youtube Video\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003eAffleck is coming off a \u003ca href=\"https://bleedingcool.com/movies/the-accountant-2-new-poster-and-details-about-the-sxsw-activation/\"\u003eSouth by Southwest premiere\u003c/a\u003e with \u003cem\u003eThe Accountant 2\u003c/em\u003e, a movie that spent some time in development hell and is finally making its way to the big screen even as an Amazon MGM Studios film. Affleck has said a couple of times now that he\u0026#39;s done with this corner of filmmaking, and it\u0026#39;s really time for fans to respect his decision to walk away. We got the performances we got, and even if they are tainted a little, knowing that Affleck was not in a good place when filming those scenes, he struck a nerve with a particular set of fans, and that\u0026#39;s great.\u003c/p\u003e\n\u003chr/\u003e\u003cdiv id=\"bc_sharing_is_caring\"\u003e\u003ccenter\u003e\u003cp\u003e\u003cstrong\u003eEnjoyed this? Please share on social media!\u003c/strong\u003e\u003c/p\u003e\u003ca href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fben-affleck-details-his-complicated-feelings-about-his-superhero-era%2F\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://twitter.com/share?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fben-affleck-details-his-complicated-feelings-about-his-superhero-era%2F\u0026amp;text=Ben+Affleck+Details+His+Complicated+Feelings+About+His+Superhero+Era\u0026amp;via=bleedingcool\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"http://pinterest.com/pin/create/button/?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fben-affleck-details-his-complicated-feelings-about-his-superhero-era%2F\u0026amp;description=Ben+Affleck+Details+His+Complicated+Feelings+About+His+Superhero+Era\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003ca href=\"https://reddit.com/submit?url=https%3A%2F%2Fbleedingcool.com%2Fmovies%2Fben-affleck-details-his-complicated-feelings-about-his-superhero-era%2F\u0026amp;title=Ben+Affleck+Details+His+Complicated+Feelings+About+His+Superhero+Era\" target=\"_blank\" onclick=\"open_social_link(this);return false;\"\u003e\u003c/a\u003e\u003c/center\u003e\u003c/div\u003e\n    \u003ca id=\"google_follow\" href=\"https://news.google.com/publications/CAAqBwgKMPHflgsw1IauAw?hl=en-US\u0026amp;gl=US\u0026amp;ceid=US:en\"\u003e\n        \u003cp\u003e\u003cimg width=\"100\" height=\"81\u0026#34;\" src=\"https://bleedingcool.com/Google_News_icon.png\"/\u003e\n        \u003c/p\u003e\n        \u003cp\u003e\n            Stay up-to-date and support the site by following Bleeding Cool on Google News today!\n        \u003c/p\u003e\n    \u003c/a\u003e\u003c/article\u003e\u003csection\u003e\u003ch2\u003e\u003cimg data-opt-src=\"https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:150/h:150/q:75/https://www.gravatar.com/avatar/c6bcaa58a7b5119a6d358a10f6547af6?s=150\" src=\"data:image/svg+xml,%3Csvg%20viewBox%3D%220%200%20150%20150%22%20width%3D%22150%22%20height%3D%22150%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%3E%3C%2Fsvg%3E\" width=\"150px\" height=\"150px\" alt=\"Kaitlyn Booth\"/\u003eAbout \u003ca href=\"https://bleedingcool.com/author/kbooth/\"\u003eKaitlyn Booth\u003c/a\u003e\u003c/h2\u003eKaitlyn is the Editor-in-Chief at Bleeding Cool. Film critic and pop culture writer since 2013. Ace. Leftist. Nerd. Feminist. Writer. Replicant Translator. Cinephillic Virtue Signaler. She/Her. UFCA/GALECA Member. 🍅 Approved. Follow her Threads, Instagram, and Twitter @katiesmovies.\u003c/section\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-03-29T18:34:07-05:00",
  "modifiedTime": "2025-03-29T18:34:07-05:00"
}
