{
  "id": "da34d260-7e11-47cc-ad1d-221246d5b98d",
  "title": "Red Ink At Landmark Theatres As Fortress Slams Charles Cohen For Transferring Personal Assets Amid Lawsuit",
  "link": "https://deadline.com/2024/10/landmark-theatres-charles-cohen-fortress-lawsuit-1236122005/",
  "description": "Landmark Theatres plunged in value from Covid, high interest rates and Hollywood strikes to the tune of hundreds of millions of dollars, according to a May deposition by Landmark owner Charles Cohen disclosed in ongoing litigation with lender Fortress Credit Corp. The deposition was filed by Fortress in New York State Supreme Court, where a […]",
  "author": "jillg366",
  "published": "Tue, 22 Oct 2024 00:09:36 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Charles Cohen",
    "Curzon Cinemas",
    "Fortress Credit Group",
    "Landmark Theaters",
    "Landmark Theatres"
  ],
  "byline": "Jill Goldsmith",
  "length": 4457,
  "excerpt": "Landmark Theatres plunged in value from Covid, high interest rates and Hollywood strikes, according to a deposition by Landmark owner Charles Cohen.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "Landmark Theatres plunged in value from Covid, high interest rates and Hollywood strikes to the tune of hundreds of millions of dollars, according to a May deposition by Landmark owner Charles Cohen disclosed in ongoing litigation with lender Fortress Credit Corp. The deposition was filed by Fortress in New York State Supreme Court, where a judge has ruled that Cohen defaulted on a loan and must auction off underlying properties including Landmark to pay it back. The judge also ruled in a separate but related case that Cohen is on the hook for a $187 million personal loan guarantee pending the results of the auction, which is set for November 8 unless the two sides agree to a settlement. The clock is ticking, but a person familiar with Cohen’s thinking says he believes a settlement may be possible. Asked for comment today, a rep reiterated that Landmark “is still committed to staying in business and is anticipating a positive solution.” Watch on Deadline In a flurry of filings over the past few days, Fortress attempted to illustrate through the deposition and other documents that the properties to be auctioned are in the red and so auction proceeds will almost certainly fall short of the amount owed by the New York real estate mogul. To make sure it recoups as much as possible, Fortress asked the judge to enjoin Cohen from moving his personal assets beyond the reach of the guarantee. Specifically, a new proposed order asks that Cohen “be restrained from making or suffering any sale, assignment, transfer, or interference with any property in which he has an interest until that judgment is satisfied.” “Since entry of the Summary Judgment Order, Fortress has learned of conduct by Cohen necessitating immediate relief,” the firm said. “Since May 2024, after this action was commenced, Cohen has transferred over $70 million in assets to new ownership structures that may shield the assets from Fortress. The most significant transfers – which occurred just days after both his deposition and the Court’s ruling in the related UCC sale litigation – include transferring a home in Greenwich, Connecticut, worth approximately $20 million according to Cohen, to an irrevocable trust in the name of his wife, Clodagh Cohen, and transferring at least four luxury boats worth over $50 million, again according to Cohen, to new entities controlled by a sole director who is an attorney in the Cayman Islands,” Fortress said. (UCC refers to New York real estate’s Uniform Commercial Code.) Cohen last week filed a notice of appeal on the $187 million loan guarantee and has six months to formally appeal but meanwhile the case can proceed. In the deposition, Cohen was asked about the properties underlying the loan (a design center, two hotels and an office tower along with the movie theaters) and did not disagree with statements that Landmark showed “a little more than negative $14 million net revenue” and Curzon “a net loss of a little less than 8 1/2 million.” All the underlying assets were “suffering,” he said. “Interest rates, interest costs were too high. There were a lot of other challenges.” For the movie theaters, it was “people not going … There was a strike in Hollywood, a writers’ strike, an actors’ strike, that turned off the production of film for six months. And these theaters continued to suffer for that reason. That’s just part of it.” The deposition continued: Q: So had the value of that collateral decreased? A: Absolutely. Q. Okay, do you know by how much? A. No. Q. Was it tens of millions of dollars? A: Absolutely. Q: Hundreds of millions of dollars?   A: In the case of Landmark, yes. Cohen acquired premiere U.S. arthouse chain Landmark from Mark Cuban and Todd Wagner in 2018 and British arthouse chain Curzon a year later in 2019. The timing was rough as Covid shuttered theaters for much of 2020. Exhibition suffered another major blow from Hollywood strikes last year. Amid the disruption, moviegoing has changed and is still finding a new normal with the focus on a combination of young audiences, creative marketing and upgraded theaters. In May of 2022, Landmark closed its flagship Westside LA location on Pico Boulevard, a huge loss for the arthouse crowd. Like Alamo and other smaller chains, Landmark began to mix its arthouse fare with wide releases.",
  "image": "https://deadline.com/wp-content/uploads/2024/08/Landmark-Theatres.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\n\t\u003ca href=\"https://deadline.com/tag/landmark-theatres/\" id=\"auto-tag_landmark-theatres\" data-tag=\"landmark-theatres\"\u003eLandmark Theatres\u003c/a\u003e plunged in value from Covid, high interest rates and Hollywood strikes to the tune of hundreds of millions of dollars, according to a May deposition by Landmark owner \u003ca href=\"https://deadline.com/tag/charles-cohen/\" id=\"auto-tag_charles-cohen\" data-tag=\"charles-cohen\"\u003eCharles Cohen\u003c/a\u003e disclosed in ongoing litigation with lender Fortress Credit Corp.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe deposition was filed by Fortress in New York State Supreme Court, where a judge has ruled that Cohen defaulted on a loan and must auction off underlying properties including Landmark to pay it back. The judge also ruled in a separate but related case that \u003ca href=\"https://deadline.com/2024/10/charles-cohen-loan-fortress-auction-assets-landmark-theatres-1236107478/\"\u003eCohen is on the hook for a $187 million personal loan guarantee\u003c/a\u003e pending the results of the auction, which is set for November 8 unless the two sides agree to a settlement. The clock is ticking, but a person familiar with Cohen’s thinking says he believes a settlement may be possible.\n\n\t\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\tAsked for comment today, a rep reiterated that Landmark “is still committed to staying in business and is anticipating a positive solution.”\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tIn a flurry of filings over the past few days, Fortress attempted to illustrate through the deposition and other documents that the properties to be auctioned are in the red and so auction proceeds will almost certainly fall short of the amount owed by the New York real estate mogul. To make sure it recoups as much as possible, Fortress asked the judge to enjoin Cohen from moving his personal assets beyond the reach of the guarantee.\n\n\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tSpecifically, a new proposed order asks that Cohen “be restrained from making or suffering any sale, assignment, transfer, or interference with any property in which he has an interest until that judgment is satisfied.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“Since entry of the Summary Judgment Order, Fortress has learned of conduct by Cohen necessitating immediate relief,” the firm said. “Since May 2024, after this action was commenced, Cohen has transferred over $70 million in assets to new ownership structures that may shield the assets from Fortress. The most significant transfers – which occurred just days after both his deposition and the Court’s ruling in the related UCC sale litigation – include transferring a home in Greenwich, Connecticut, worth approximately $20 million according to Cohen, to an irrevocable trust in the name of his wife, Clodagh Cohen, and transferring at least four luxury boats worth over $50 million, again according to Cohen, to new entities controlled by a sole director who is an attorney in the Cayman Islands,” Fortress said.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\t(UCC refers to New York real estate’s Uniform Commercial Code.)\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCohen \u003ca href=\"https://deadline.com/2024/10/charles-cohen-appeal-fortress-lawsuit-landmark-theaters-1236120235/\"\u003elast week filed a notice of appeal\u003c/a\u003e on the $187 million loan guarantee and has six months to formally appeal but meanwhile the case can proceed.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn the deposition, Cohen was asked about the properties underlying the loan (a design center, two hotels and an office tower along with the movie theaters) and did not disagree with statements that Landmark showed “a little more than negative $14 million net revenue” and Curzon “a net loss of a little less than 8 1/2 million.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAll the underlying assets were “suffering,” he said. “Interest rates, interest costs were too high. There were a lot of other challenges.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tFor the movie theaters, it was “people not going … There was a strike in Hollywood, a writers’ strike, an actors’ strike, that turned off the production of film for six months. And these theaters continued to suffer for that reason. That’s just part of it.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe deposition continued:\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tQ: So had the value of that collateral decreased?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA: Absolutely.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tQ. Okay, do you know by how much?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA. No.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tQ. Was it tens of millions of dollars?\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA: Absolutely.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tQ: Hundreds of millions of dollars?  \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tA: In the case of Landmark, yes.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCohen acquired premiere U.S. arthouse chain Landmark from Mark Cuban and Todd Wagner in 2018 and British arthouse chain Curzon a year later in 2019. The timing was rough as Covid shuttered theaters for much of 2020. Exhibition suffered another major blow from Hollywood strikes last year.  Amid the disruption, moviegoing has changed and is still finding a new normal with the focus on a combination of young audiences, creative marketing and upgraded theaters.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn May of 2022, Landmark closed its flagship Westside LA location on Pico Boulevard, a huge loss for the arthouse crowd. Like Alamo and other smaller chains, Landmark began to mix its arthouse fare with wide releases.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-22T00:09:36Z",
  "modifiedTime": "2024-10-22T00:09:45Z"
}
