{
  "id": "df4bb823-d9c8-41de-86b6-1aaaed501fa6",
  "title": "Barbarella Declares BRING HER BACK is an Intense Depiction of the Effects of Grief",
  "link": "https://www.aintitcool.com/bringherbackreview2025-83614/?utm_source=full-feed\u0026utm_medium=feed\u0026utm_term=reviews",
  "description": "Barbarella Declares BRING HER BACK is an Intense Depiction of the Effects of Grief Read the full article on AICN Hey, friends. Barbarella here still reeling from the incredibly intense Australian horror flick Bring Her Back, which comes out on May 30th. Not for the weak of heart, this follow-up from the minds behind Talk to Me grips one’s innards early on and doesn’t let go for the entire duration.  While themes of grief and the different ways individuals cope with loss may not be uncommon in cinema, Bring Her Back approaches the concept in a truly unique fashion through the individuals involved and the manner in which their stories are told.  Sora Wong debuts as the young Piper. Giving a powerhouse performance, she proves that a face doesn’t have to be recognizable to bring the awesomeness. While Piper may be the nucleus of the story, it’s not just her, but also those around her, who drive the points, like nails, into your soul.  I’ll start with Sally Hawkins, whom you may recognize from The Shape of Water. Her portrayal of the adoptive parent is nothing short of exceptional. Nuanced when necessary, flat out psycho when required, she navigates the extremes and subtleties like a master.  While I could ramble about Sally Hawkins more, let’s move on to Jonah Wren Phillips. He’s incredible as the creepy kid, but it’s in those moments where we glimpse his humanity that this young talent shines. I should warn you, though, if he’s onscreen, the odds of you feeling uncomfortable increase 85%. Owning the most disturbing scenes, he can be hard to watch at times. In fact, when Finish the article on AICN",
  "author": "Barbarella",
  "published": "Fri, 30 May 2025 01:49:00 +0000",
  "source": "https://www.aintitcool.com/node/feed/",
  "categories": null,
  "byline": "Barbarella",
  "length": 4267,
  "excerpt": "Barbarella Declares BRING HER BACK is an Intense Depiction of the Effects of Grief",
  "siteName": "Aint It Cool News",
  "favicon": "",
  "text": "Published at: May 29, 2025, 8:49 p.m. CST by Barbarella Hey, friends. Barbarella here still reeling from the incredibly intense Australian horror flick Bring Her Back, which comes out on May 30th. Not for the weak of heart, this follow-up from the minds behind Talk to Me grips one’s innards early on and doesn’t let go for the entire duration.  While themes of grief and the different ways individuals cope with loss may not be uncommon in cinema, Bring Her Back approaches the concept in a truly unique fashion through the individuals involved and the manner in which their stories are told.  Sora Wong debuts as the young Piper. Giving a powerhouse performance, she proves that a face doesn’t have to be recognizable to bring the awesomeness. While Piper may be the nucleus of the story, it’s not just her, but also those around her, who drive the points, like nails, into your soul.  I’ll start with Sally Hawkins, whom you may recognize from The Shape of Water. Her portrayal of the adoptive parent is nothing short of exceptional. Nuanced when necessary, flat out psycho when required, she navigates the extremes and subtleties like a master.  While I could ramble about Sally Hawkins more, let’s move on to Jonah Wren Phillips. He’s incredible as the creepy kid, but it’s in those moments where we glimpse his humanity that this young talent shines. I should warn you, though, if he’s onscreen, the odds of you feeling uncomfortable increase 85%. Owning the most disturbing scenes, he can be hard to watch at times. In fact, when he’s doing some of the things he’s doing, I squirm in my seat with my hands over my mouth, as if that’s going to protect me from seeing anything disturbing. If you’re squeamish, you will likely look away at least some of the time. I double-dog dare you to watch every uncomfortable second. The one person from whom it’s impossible to look away is Billy Barratt, who plays Piper’s protective brother. He proves phenomenal in that role, and I love everything about his performance.  He dominates the screen in every scene he’s in. After seeing this, I would cast him in anything, and I sincerely hope to see him in many more films. He's just increadible, and he carries the heart of this movie. I simply cannot imagine anyone else tackling the role with the same warmth and affect that he does. Regarding the story, when visually impaired Piper and her brother/care-giver Andy find themselves in the remote home of their new foster mother, they begin to realize something is off with their new family.  The movie opens with choppy video clips of some kind of ritual being performed, which rapidly sets the tone, yet it proves less compelling than another early scene which could’ve been a more dramatic way to alert viewers to how visceral Bring Her Back would be. In fact, I would’ve preferred not seeing any ritual-related footage until much later in the story, just to make everything a bit more mysterious initially. Still, I understand why the filmmakers chose to open with it, and I wouldn't say having it there had any kind of detrimental effect. I just tend to subscribe to the less-is-more approach at the onset of a film.  Written by Danny Philippou and Bill Hinzman, the story seems both obvious yet completely mysterious at the same time, which makes for a riveting viewing experience. It takes turns I wouldn't have expected, while at the same time, it does the most predictable things possible. I'm almost puzzled how halfway through the film, I am still trying to figure out what's up with this or that, while I'm 100% certain I know everything else that is going on.  Danny and Michael Philippou are some of the most interesting voices in horror cinema today. These Australian filmmakers elevate modern horror, as they take risks and don't shy away from the unanticipated. I cannot wait to see more from them. If you think you can handle some extremely uncomfortable scenes, I highly recommend you check out Bring Her Back. You won't see anything else like it this year. Here's a trailer for you. It will be in theaters on May 30, 2025. Seriously, check it out if you can tolerate some intense moments, because this film will absolutely leave a mark. It's one of the best and darkest horror films of the decade.",
  "image": "https://media.aintitcool.com/media/_versions/ee583d83-9a8c-f607-3204-ad450ca0ba71_huge.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003e\nPublished at: May 29, 2025, 8:49 p.m. CST by \u003ca href=\"https://twitter.com/barbara1112k\"\u003eBarbarella\u003c/a\u003e\n\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\u003cp\u003e\u003cimg title=\"Poster Bring Her Back\" src=\"https://media.aintitcool.com/media/uploads/ee583d83-9a8c-f607-3204-ad450ca0ba71.jpg\" alt=\"Poster Bring Her Back\" width=\"750\" height=\"1101\"/\u003e\u003c/p\u003e\n\u003cp\u003eHey, friends. Barbarella here still reeling from the incredibly intense Australian horror flick\u003cem\u003e\u003cstrong\u003e Bring Her Back, \u003c/strong\u003e\u003c/em\u003ewhich comes out on May 30th. Not for the weak of heart, this follow-up from the minds behind \u003cem\u003e\u003cstrong\u003eTalk to Me\u003c/strong\u003e \u003c/em\u003egrips one’s innards early on and doesn’t let go for the entire duration. \u003c/p\u003e\n\u003cp\u003eWhile themes of grief and the different ways individuals cope with loss may not be uncommon in cinema, \u003cem\u003e\u003cstrong\u003eBring Her Back\u003c/strong\u003e\u003c/em\u003e approaches the concept in a truly unique fashion through the individuals involved and the manner in which their stories are told. \u003c/p\u003e\n\u003cp\u003eSora Wong debuts as the young Piper. Giving a powerhouse performance, she proves that a face doesn’t have to be recognizable to bring the awesomeness. While Piper may be the nucleus of the story, it’s not just her, but also those around her, who drive the points, like nails, into your soul. \u003c/p\u003e\n\u003cp\u003eI’ll start with Sally Hawkins, whom you may recognize from \u003cem\u003e\u003cstrong\u003eThe Shape of Water.\u003c/strong\u003e\u003c/em\u003e Her portrayal of the adoptive parent is nothing short of exceptional. Nuanced when necessary, flat out psycho when required, she navigates the extremes and subtleties like a master. \u003c/p\u003e\n\u003cp\u003eWhile I could ramble about Sally Hawkins more, let’s move on to Jonah Wren Phillips. He’s incredible as the creepy kid, but it’s in those moments where we glimpse his humanity that this young talent shines. I should warn you, though, if he’s onscreen, the odds of you feeling uncomfortable increase 85%. Owning the most disturbing scenes, he can be hard to watch at times. In fact, when he’s doing some of the things he’s doing, I squirm in my seat with my hands over my mouth, as if that’s going to protect me from seeing anything disturbing. If you’re squeamish, you will likely look away at least some of the time. I double-dog dare you to watch every uncomfortable second.\u003c/p\u003e\n\u003cp\u003eThe one person from whom it’s impossible to look away is Billy Barratt, who plays Piper’s protective brother. He proves phenomenal in that role, and I love everything about his performance.  He dominates the screen in every scene he’s in. After seeing this, I would cast him in anything, and I sincerely hope to see him in many more films. He\u0026#39;s just increadible, and he carries the heart of this movie. I simply cannot imagine anyone else tackling the role with the same warmth and affect that he does.\u003c/p\u003e\n\u003cp\u003eRegarding the story, when visually impaired Piper and her brother/care-giver Andy find themselves in the remote home of their new foster mother, they begin to realize something is off with their new family. \u003c/p\u003e\n\u003cp\u003eThe movie opens with choppy video clips of some kind of ritual being performed, which rapidly sets the tone, yet it proves less compelling than another early scene which could’ve been a more dramatic way to alert viewers to how visceral \u003cem\u003e\u003cstrong\u003eBring Her Back\u003c/strong\u003e \u003c/em\u003ewould be. In fact, I would’ve preferred not seeing any ritual-related footage until much later in the story, just to make everything a bit more mysterious initially. Still, I understand why the filmmakers chose to open with it, and I wouldn\u0026#39;t say having it there had any kind of detrimental effect. I just tend to subscribe to the less-is-more approach at the onset of a film. \u003c/p\u003e\n\u003cp\u003eWritten by Danny Philippou and Bill Hinzman, the story seems both obvious yet completely mysterious at the same time, which makes for a riveting viewing experience. It takes turns I wouldn\u0026#39;t have expected, while at the same time, it does the most predictable things possible. I\u0026#39;m almost puzzled how halfway through the film, I am still trying to figure out what\u0026#39;s up with this or that, while I\u0026#39;m 100% certain I know everything else that is going on. \u003c/p\u003e\n\u003cp\u003eDanny and Michael Philippou are some of the most interesting voices in horror cinema today. These Australian filmmakers elevate modern horror, as they take risks and don\u0026#39;t shy away from the unanticipated. I cannot wait to see more from them. If you think you can handle some extremely uncomfortable scenes, I highly recommend you check out \u003cem\u003e\u003cstrong\u003eBring Her Back\u003c/strong\u003e\u003c/em\u003e. You won\u0026#39;t see anything else like it this year. Here\u0026#39;s a trailer for you. It will be in theaters on May 30, 2025. Seriously, check it out if you can tolerate some intense moments, because this film will absolutely leave a mark. It\u0026#39;s one of the best and darkest horror films of the decade. \u003c/p\u003e\n\u003cp\u003e\u003ciframe src=\"https://www.youtube.com/embed/1I15ttCedfY?si=ABQdN2WwnnkixrIb\" title=\"YouTube video player\" width=\"425\" height=\"350\" allowfullscreen=\"\" frameborder=\"0\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
