{
  "id": "e6064dad-1d1f-4443-9f21-481e9b3d3075",
  "title": "U.S. Bombs Three Nuclear Sites In Iran, Donald Trump Announces",
  "link": "https://deadline.com/2025/06/u-s-bombs-iran-trump-1236439242/",
  "description": "The United States has carried out three strikes on three nuclear facilities in Iran, joining Israel as it tries to halt Tehran’s ability to obtain an atomic weapon, President Donald Trump announced on Truth Social. The bombing has raised fears that the Iranian regime will retaliate with strikes on U.S. targets. “We have completed our […]",
  "author": "Ted Johnson",
  "published": "Sun, 22 Jun 2025 00:28:12 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Politics",
    "Donald Trump",
    "ElectionLine",
    "Iran",
    "Israel"
  ],
  "byline": "Ted Johnson, Dominic Patten",
  "length": 4924,
  "excerpt": "The United States has carried out three strikes on three nuclear facilities in Iran, joining Israel as it tries to halt Tehran’s ability to obtain an atomic weapon, President Donald Trump announced on Truth Social. The bombing has raised fears that the Iranian regime will retaliate with strikes on U.S. targets. “We have completed our […]",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "The United States has carried out three strikes on three nuclear facilities in Iran, joining Israel as it tries to halt Tehran’s ability to obtain an atomic weapon, President Donald Trump announced on Truth Social. The bombing has raised fears that the Iranian regime will retaliate with strikes on U.S. targets. “We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan. All planes are now outside of Iran air space,” Trump wrote. “A full payload of BOMBS was dropped on the primary site, Fordow. All planes are safely on their way home. Congratulations to our great American Warriors. There is not another military in the World that could have done this. NOW IS THE TIME FOR PEACE! Thank you for your attention to this matter.” Trump is due to speak at 10 p.m. ET/7 p.m. PT this evening. Watch on Deadline The news quickly dominated cable news, while broadcast networks broke in with special reports on the military strike. Anderson Cooper anchored on CNN form Tel Aviv, Bret Baier was anchoring for Fox News, with Sean Hannity coming on at 9 p.m. ET. MSNBC’s Ayman Mohyeldin shared the news at 7:53:02 p.m. ET, and Rachel Maddow coming on board at 9 p.m., and she will be joined by Nicolle Wallace and others. CNN’s Fred Pleitgen, who arrived in Tehran earlier this week, spoke by phone to Cooper, telling him that be believed that Iranian officials are “still trying to figure out what exactly is going on. It’s 4:30 in the morning, so we’re looking to hear more from them.” On Fox News, Hannity said that he spoke to Trump and said that “it appears the United States just completely obliterated Iran’s top secret nuclear facility with six huge bunker buster bombs.” He said that “two other major nuclear sites … were were wiped out with 30 tomahawk missiles launched by American submarines some 400 miles away.” Appearing on Iranian state TV, officials of the Islamic Republic said that the regime “didn’t suffer a major blow” because “the materials had already been taken out,”  according to the BBC. Overseas, with European diplomatic results already sidelined, usually quick to comment leaders like UK PM Keir Starmer and French president Emmanuel Macron were silent. Israeli officials have told the BBC that “they were fully informed” of the attack. Trump’s announcement came after he returned to the White House from his Bedminster, NJ, golf property earlier on Saturday, as had been scheduled, for a meeting with his national security staff. On Thursday, in a statement he gave to his press secretary, Trump indicated that a decision on bombing Iran would come within two weeks, which raised speculation that the president would try to resolve the situation through a diplomatic solution. But Steve Bannon, Trump’s former chief strategist, said on his podcast earlier on Saturday that “the party is on. So another big weekend in this unfolding aspect of this third world war. Anyone who is telling you the third world war is not here does not understand.” Israel launched air strikes on Iran earlier this month in an effort to hobble their nuclear program. But it was the United States that has had the weapons to penetrate the underground fortress where Iran was believed to be developing its nuclear capability. As cable news offer blanket coverage of the nuclear site bombings, pundits such as retired U.S. Army Brig, General Mark Kimmitt warned of the forms an Iranian response could take including domestically. However, the LAPD have not taken to the city to any higher level of readiness such as tactical alert, officials tell us. “Any decision like that will follow further assessment of the  situation,” a law enforcement source said to Deadline Saturday afternoon. “Following the President’s action in Iran, California’s State Threat Assessment Center is actively monitoring for any potential impacts in California,” Gov. Gavin Newsom posted online this evening. “While there are no specific or credible counter threats we are aware of at this time, we urge everyone to stay vigilant and report suspicious activity.”Sen. John Fetterman (D-PA) was among the lawmakers to quickly weigh in on the announcement. “As I’ve long maintained, this was the correct move by @POTUS. Iran is the world’s leading sponsor of terrorism and cannot have nuclear capabilities. I’m grateful for and salute the finest military in the world.” U.S. involvement in the Israel-Iran conflict has divided Trump’s MAGA movement. Tucker Carlson, one of the president’s strident supporters, has warned against it and the possibility of the U.S. getting into another quagmire as it did in Iraq. On his show this week, he had a biting interview with Sen. Ted Cruz (R-TX), who has supported U.S. support for Israel. More to come.",
  "image": "https://deadline.com/wp-content/uploads/2025/06/GettyImages-2219774898.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tThe United States has carried out three strikes on three nuclear facilities in \u003ca href=\"https://deadline.com/tag/iran/\" id=\"auto-tag_iran_1\" data-tag=\"iran\"\u003eIran\u003c/a\u003e, joining \u003ca href=\"https://deadline.com/tag/israel/\" id=\"auto-tag_israel_1\" data-tag=\"israel\"\u003eIsrael\u003c/a\u003e as it tries to halt Tehran’s ability to obtain an atomic weapon, President \u003ca href=\"https://deadline.com/tag/donald-trump/\" id=\"auto-tag_donald-trump_1\" data-tag=\"donald-trump\"\u003eDonald Trump\u003c/a\u003e announced on Truth Social.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tThe bombing has raised fears that the Iranian regime will retaliate with strikes on U.S. targets. \u003c/p\u003e\n\n\n\n\u003cdiv\u003e\n\t\n\n\u003cfigure\u003e\n\n\t\t\t\n\u003cdiv\u003e\n\t\n\t\t\t\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?w=300\" data-lazy-src=\"https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?w=300\" alt=\"\" data-lazy-srcset=\"https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg 2600w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=150,85 150w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=300,170 300w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1024,581 1024w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1536,871 1536w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=2048,1161 2048w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=176,100 176w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=125,70 125w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=600,338 600w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1280,726 1280w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1000,563 1000w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=681,383 681w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=450,253 450w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=200,112 200w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=270,152 270w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=60,34 60w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=352,200 352w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=110,62 110w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=285,162 285w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=320,181 320w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=640,363 640w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=800,454 800w\" data-lazy-sizes=\"(min-width: 87.5rem) 1000px, (min-width: 78.75rem) 681px, (min-width: 48rem) 450px, (max-width: 48rem) 250px\" height=\"170\" width=\"300\" decoding=\"\" srcset=\"https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg 2600w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=150,85 150w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=300,170 300w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1024,581 1024w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1536,871 1536w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=2048,1161 2048w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=176,100 176w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=125,70 125w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=600,338 600w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1280,726 1280w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=1000,563 1000w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=681,383 681w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=450,253 450w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=200,112 200w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=270,152 270w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=60,34 60w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=352,200 352w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=110,62 110w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=285,162 285w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=320,181 320w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=640,363 640w, https://deadline.com/wp-content/uploads/2025/06/20250621_172230_70fc6b.jpg?resize=800,454 800w\"/\u003e\n\t\t\t\n\t\t\t\u003c/p\u003e\n\t\n\t\u003c/div\u003e\n\t\n\t\n\u003c/figure\u003e\n\n\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t“We have completed our very successful attack on the three Nuclear sites in Iran, including Fordow, Natanz, and Esfahan. All planes are now outside of Iran air space,” Trump wrote. “A full payload of BOMBS was dropped on the primary site, Fordow. All planes are safely on their way home. Congratulations to our great American Warriors. There is not another military in the World that could have done this. NOW IS THE TIME FOR PEACE! Thank you for your attention to this matter.”\n\n\t\u003c/p\u003e\n\n\n\n\n\n\u003cp\u003e\n\tTrump is due to speak at 10 p.m. ET/7 p.m. PT this evening.\n\n\n\u003c/p\u003e\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\u003cp\u003e\n\tThe news quickly dominated cable news, while broadcast networks broke in with special reports on the military strike. Anderson Cooper anchored on CNN form Tel Aviv, Bret Baier was anchoring for Fox News, with Sean Hannity coming on at 9 p.m. ET. MSNBC’s Ayman Mohyeldin shared the news at 7:53:02 p.m. ET, and Rachel Maddow coming on board at 9 p.m., and she will be joined by Nicolle Wallace and others.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tCNN’s Fred Pleitgen, who arrived in Tehran earlier this week, spoke by phone to Cooper, telling him that be believed that Iranian officials are “still trying to figure out what exactly is going on. It’s 4:30 in the morning, so we’re looking to hear more from them.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tOn Fox News, Hannity said that he spoke to Trump and said that “it appears the United States just completely obliterated Iran’s top secret nuclear facility with six huge bunker buster bombs.” He said that “two other major nuclear sites … were were wiped out with 30 tomahawk missiles launched by American submarines some 400 miles away.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAppearing on Iranian state TV, officials of the Islamic Republic said that the regime “didn’t suffer a major blow” because “the materials had already been taken out,”  according to the BBC.\u003cbr/\u003e \u003cbr/\u003eOverseas, with European diplomatic results already sidelined, usually quick to comment leaders like UK PM Keir Starmer and French president Emmanuel Macron were silent. Israeli officials have told the BBC that “they were fully informed” of the attack.\n\n\t\u003c/p\u003e\n\n\n\n\n\u003cp\u003e\n\tTrump’s announcement came after he returned to the White House from his Bedminster, NJ, golf property earlier on Saturday, as had been scheduled, for a meeting with his national security staff. On Thursday, in a statement he gave to his press secretary, Trump indicated that a decision on bombing Iran would come within two weeks, which raised speculation that the president would try to resolve the situation through a diplomatic solution.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tBut Steve Bannon, Trump’s former chief strategist, said on his podcast earlier on Saturday that “the party is on. So another big weekend in this unfolding aspect of this third world war. Anyone who is telling you the third world war is not here does not understand.” \u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIsrael launched air strikes on Iran earlier this month in an effort to hobble their nuclear program. But it was the United States that has had the weapons to penetrate the underground fortress where Iran was believed to be developing its nuclear capability.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAs cable news offer blanket coverage of the nuclear site bombings, pundits such as retired U.S. Army Brig, General Mark Kimmitt warned of the forms an Iranian response could take including domestically. However, the LAPD have not taken to the city to any higher level of readiness such as tactical alert, officials tell us. “Any decision like that will follow further assessment of the  situation,” a law enforcement source said to Deadline Saturday afternoon.\u003c/p\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003e\n\t“Following the President’s action in Iran, California’s State Threat Assessment Center is actively monitoring for any potential impacts in California,” Gov. Gavin Newsom posted online this evening. “While there are no specific or credible counter threats we are aware of at this time, we urge everyone to stay vigilant and report suspicious activity.”\u003c/p\u003e\u003cp\u003eSen. John Fetterman (D-PA) was among the lawmakers to quickly weigh in on the announcement.\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\n\t“As I’ve long maintained, this was the correct move by \u003ca href=\"https://x.com/POTUS\" rel=\"nofollow\" target=\"_blank\"\u003e@POTUS\u003c/a\u003e. Iran is the world’s leading sponsor of terrorism and cannot have nuclear capabilities. I’m grateful for and salute the finest military in the world.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tU.S. involvement in the Israel-Iran conflict has divided Trump’s MAGA movement. Tucker Carlson, one of the president’s strident supporters, has warned against it and the possibility of the U.S. getting into another quagmire as it did in Iraq. On his show this week, he had a biting interview with Sen. Ted Cruz (R-TX), who has supported U.S. support for Israel.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t\u003cem\u003eMore to come.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-06-22T00:28:12Z",
  "modifiedTime": "2025-06-22T01:19:37Z"
}
