{
  "id": "f281c81f-b9fa-4915-bc90-469a0ec782a4",
  "title": "Why Zeph From Star Trek: Section 31 Looks So Familiar",
  "link": "https://www.slashfilm.com/1767727/star-trek-section-31-zeph-actor-robert-kazinsky/",
  "description": "Star Trek: Section 31 is full of standout actors you're most likely familiar with, including the man behind the hulking mech Zeph.",
  "author": "Jeremy Mathai",
  "published": "Mon, 27 Jan 2025 22:45:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Action \u0026 Adventure Movies",
    "Science Fiction Movies"
  ],
  "byline": "Jeremy Mathai",
  "length": 4595,
  "excerpt": "Star Trek: Section 31 is full of standout actors you're most likely familiar with, including the man behind the hulking mech Zeph.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Jan Thijs/Paramount+ Warning: This article contains minor spoilers for \"Star Trek: Section 31.\" The debut of \"Section 31\" marks the moment when \"Star Trek\" has officially gone where it never has before — the small screen. Wait, that didn't come out quite right. Obviously, every Trekkie knows that the sci-fi franchise has its roots in television, but there's something to be said for how this particular release changes the game for the first time in over 50 years. In an unprecedented move, a \"Trek\" film is going directly to streaming. Whether this opens up a whole new universe of possibilities for future projects or simply represents an unusual one-off situation remains to be seen. But, in many ways, \"Section 31\" is putting a whole new twist on this established property ... and that certainly applies to the cast as well. Compared to the traditional and downright respectable \"Trek\" titles up to this point (with, perhaps, a special exception made to the offbeat, irreverent, and sadly now-canceled animated series \"Lower Decks\"), \"Section 31\" splashes a little grey onto the otherwise black-and-white moralism of the series. That's courtesy of the renegade crew of Starfleet rejects, tasked with making contact with \"Star Trek: Discovery\" scene-stealer Philippa Georgiou (Michelle Yeoh) and recruiting her for another high-stakes mission. Rarely before (if ever) has there ever been this much action, curse words, and ruthless antiheroes all packed into a single \"Trek\" feature. Given all the new additions to the cast, however, fans may be wondering exactly why one in particular stands out as much as they do. No, we're not talking about \"Veep\" and \"The Afterparty\" star Sam Richardson, we mean the very familiar actor who plays the hulking mech Zeph: Rob Kazinsky. Many viewers have definitely seen him before, and his previous roles go a long way towards explaining why he was the perfect choice for this character. Rob Kazinsky is an action movie staple ... with a very particular set of skills Jan Thijs/Paramount+ When you need an A-lister to do a whole lot of running, you call Tom Cruise. When you're looking for an impossibly suave star to unload headshot after headshot at hordes of enemies, Keanu Reeves is your guy. But when you're in the market for the very specific niche of actors with experience suiting up in imposing mech suits, well, apparently there's nobody more suited (ha!) for the task than Rob Kazinsky. Before appearing as the wisecracking Zeph in \"Section 31,\" Kazinsky actually had experience showing off his skills as another formidable warrior who was practically more machine than man. Most audiences will likely recognize him as the Australian Jaegar pilot Chuck Hansen in Guillermo del Toro's monster-fighting mash \"Pacific Rim.\" Introduced as a quasi-antagonist for Charlie Hunnam's Raleigh Becket, Kazinsky's character ultimately filled a role that's eerily similar to the one Zeph has in \"Section 31.\" Chuck, a roguelike wild card who's extremely rough around the edges, is called upon to help save humanity by getting behind the controls of the kaiju-sized mechs that literally wrestle the invading monsters into submission. In \"Star Trek,\" Zeph is presented as a soldier cut from the very same cloth, although his loyalties are tested even further when it appears he could be the secret saboteur dogging the heroes' every step. That's not the only major franchise to previously make use of Kazinsky's talents, however. Although he once missed out on the opportunity of a lifetime when he parted ways with the production of \"The Hobbit: An Unexpected Journey\" (he was originally cast to play the dwarf Fili), the actor went on to appear in several episodes of the HBO series \"True Blood\" throughout season 6, the Duncan Jones \"Warcraft\" movie (where he portrayed the orc Orgrim Doomhammer), and even 2019's \"Captain Marvel,\" where he plays the obnoxious biker who tells Brie Larson's Carol Danvers to \"smile\" and subsequently gets his just desserts. Others may remember him from his rather brief supporting turn in Anthony and Joe Russo's \"The Gray Man.\" \"Star Trek: Section 31\" is currently streaming on Paramount+.",
  "image": "https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/l-intro-1737492166.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1767727/star-trek-section-31-zeph-actor-robert-kazinsky/\" data-post-title=\"Why Zeph From Star Trek: Section 31 Looks So Familiar\" data-slide-num=\"0\" data-post-id=\"1767727\"\u003e\n                                             \u003cpicture id=\"p381255378e0e9149cba2f2a73e79bba4\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/intro-1737492166.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/intro-1737492166.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/intro-1737492166.jpg\" data-slide-url=\"https://www.slashfilm.com/1767727/star-trek-section-31-zeph-actor-robert-kazinsky/\" data-post-id=\"1767727\" data-slide-num=\"0\" data-slide-title=\"Why Zeph From Star Trek: Section 31 Looks So Familiar: \" width=\"780\" height=\"438\" alt=\"Rob Kazinsky as Zeph wearing his mech suit and a smirk in Star Trek: Section 31\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eJan Thijs/Paramount+\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003cem\u003eWarning: This article contains \u003cstrong\u003eminor spoilers\u003c/strong\u003e for \u0026#34;Star Trek: Section 31.\u0026#34;\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe debut of \u0026#34;Section 31\u0026#34; marks the moment when \u0026#34;Star Trek\u0026#34; has officially gone where it never has before — the small screen. Wait, that didn\u0026#39;t come out quite right. Obviously, \u003ca href=\"https://www.slashfilm.com/971474/reasons-why-the-original-series-is-the-best-star-trek-show/\" target=\"_blank\"\u003eevery Trekkie knows that the sci-fi franchise has its roots in television\u003c/a\u003e, but there\u0026#39;s something to be said for how this particular release changes the game for the first time in over 50 years. In an unprecedented move, a \u0026#34;Trek\u0026#34; film is going directly to streaming. Whether this opens up a whole new universe of possibilities for future projects or simply represents an unusual one-off situation remains to be seen. But, in many ways, \u0026#34;Section 31\u0026#34; is putting a whole new twist on this established property ... and that certainly applies to the cast as well.\u003c/p\u003e\n\n\u003cp\u003eCompared to the traditional and downright respectable \u0026#34;Trek\u0026#34; titles up to this point (with, perhaps, a special exception made to \u003ca href=\"https://www.slashfilm.com/1741670/star-trek-lower-decks-season-5-ending-only-good-thing/\" target=\"_blank\"\u003ethe offbeat, irreverent, and sadly now-canceled animated series \u0026#34;Lower Decks\u0026#34;\u003c/a\u003e), \u0026#34;Section 31\u0026#34; splashes a little grey onto the otherwise black-and-white moralism of the series. That\u0026#39;s courtesy of the renegade crew of Starfleet rejects, tasked with making contact with \u0026#34;Star Trek: Discovery\u0026#34; scene-stealer Philippa Georgiou (Michelle Yeoh) and recruiting her for another high-stakes mission. Rarely before (if ever) has there ever been this much action, curse words, and ruthless antiheroes all packed into a single \u0026#34;Trek\u0026#34; feature.\u003c/p\u003e\n\u003cp\u003eGiven all the new additions to the cast, however, fans may be wondering exactly why one in particular stands out as much as they do. No, we\u0026#39;re not talking about \u0026#34;Veep\u0026#34; and \u0026#34;The Afterparty\u0026#34; star Sam Richardson, we mean the \u003cem\u003every\u003c/em\u003e familiar actor who plays the hulking mech Zeph: Rob Kazinsky. Many viewers have definitely seen him before, and his previous roles go a long way towards explaining why he was the perfect choice for this character.\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eRob Kazinsky is an action movie staple ... with a very particular set of skills\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1767727/star-trek-section-31-zeph-actor-robert-kazinsky/\" data-post-title=\"Why Zeph From Star Trek: Section 31 Looks So Familiar\" data-slide-num=\"1\" data-post-id=\"1767727\"\u003e\n                                             \u003cpicture id=\"p1357129cbf8471b6a6cd397b065fe241\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/rob-kazinsky-is-an-action-movie-staple-with-a-very-particular-set-of-skills-1737492168.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/rob-kazinsky-is-an-action-movie-staple-with-a-very-particular-set-of-skills-1737492168.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-zeph-from-star-trek-section-31-looks-so-familiar/rob-kazinsky-is-an-action-movie-staple-with-a-very-particular-set-of-skills-1737492168.jpg\" data-slide-url=\"https://www.slashfilm.com/1767727/star-trek-section-31-zeph-actor-robert-kazinsky/\" data-post-id=\"1767727\" data-slide-num=\"1\" data-slide-title=\"Why Zeph From Star Trek: Section 31 Looks So Familiar: Rob Kazinsky is an action movie staple ... with a very particular set of skills\" width=\"780\" height=\"438\" alt=\"Rob Kazinsky as Zeph and director Olatunde Osunsanmi in a behind-the-scenes picture from the set of Star Trek: Section 31\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eJan Thijs/Paramount+\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp\u003e\u003ca href=\"https://www.slashfilm.com/560021/tom-cruise-running-rotten-tomatoes-math/\" target=\"_blank\"\u003eWhen you need an A-lister to do a whole lot of running, you call Tom Cruise\u003c/a\u003e. When you\u0026#39;re looking for an impossibly suave star to unload headshot after headshot at hordes of enemies, Keanu Reeves is your guy. But when you\u0026#39;re in the market for the very specific niche of actors with experience suiting up in imposing mech suits, well, apparently there\u0026#39;s nobody more suited (ha!) for the task than Rob Kazinsky.\u003c/p\u003e\n\n\u003cp\u003eBefore appearing as the wisecracking Zeph in \u0026#34;Section 31,\u0026#34; Kazinsky actually had experience showing off his skills as \u003cem\u003eanother\u003c/em\u003e formidable warrior who was practically more machine than man. Most audiences will likely recognize him as the Australian Jaegar pilot Chuck Hansen in Guillermo del Toro\u0026#39;s monster-fighting mash \u0026#34;Pacific Rim.\u0026#34; Introduced as a quasi-antagonist for Charlie Hunnam\u0026#39;s Raleigh Becket, Kazinsky\u0026#39;s character ultimately filled a role that\u0026#39;s eerily similar to the one Zeph has in \u0026#34;Section 31.\u0026#34; Chuck, a roguelike wild card who\u0026#39;s extremely rough around the edges, is called upon to help save humanity by getting behind the controls of the kaiju-sized mechs that literally wrestle the invading monsters into submission. In \u0026#34;Star Trek,\u0026#34; Zeph is presented as a soldier cut from the very same cloth, although his loyalties are tested even further when it appears he could be the secret saboteur dogging the heroes\u0026#39; every step.\u003c/p\u003e\n\n\u003cp\u003eThat\u0026#39;s not the only major franchise to previously make use of Kazinsky\u0026#39;s talents, however. Although he once missed out on the opportunity of a lifetime when \u003ca href=\"https://www.slashfilm.com/515276/robert-kazinsky-leaves-hobbit/\" target=\"_blank\"\u003ehe parted ways with the production of \u0026#34;The Hobbit: An Unexpected Journey\u0026#34;\u003c/a\u003e (he was originally cast to play the dwarf Fili), the actor went on to appear in several episodes of the HBO series \u0026#34;True Blood\u0026#34; throughout season 6, the Duncan Jones \u0026#34;Warcraft\u0026#34; movie (where he portrayed the orc Orgrim Doomhammer), and even 2019\u0026#39;s \u0026#34;Captain Marvel,\u0026#34; where he plays \u003ca href=\"https://www.slashfilm.com/566670/captain-marvel-deleted-scene-smile/\" target=\"_blank\"\u003ethe obnoxious biker who tells Brie Larson\u0026#39;s Carol Danvers to \u0026#34;smile\u0026#34; and subsequently gets his just desserts\u003c/a\u003e. Others may remember him from his rather brief supporting turn in Anthony and Joe Russo\u0026#39;s \u0026#34;The Gray Man.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u0026#34;Star Trek: Section 31\u0026#34; is currently streaming on Paramount+.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-27T22:45:00Z",
  "modifiedTime": "2025-01-27T22:45:00Z"
}
