{
  "id": "f3d0e30b-dad6-405c-9586-f8fb7c8b0447",
  "title": "George Clooney Defends His Op-Ed Against Biden: “It Was A Civic Duty”",
  "link": "https://deadline.com/2025/04/george-clooney-defends-op-ed-against-biden-civic-duty-1236370436/",
  "description": "With Trump‘s first 100 days back in office, George Clooney has faced his share of criticism over his previous stand against Biden. After penning an op-ed calling for President Biden to step aside during the 2024 presidential election, endorsing Vice President Kamala Harris in his place, the 2x Oscar winner recently opened up about the […]",
  "author": "Glenn Garner",
  "published": "Wed, 16 Apr 2025 23:11:49 +0000",
  "source": "https://deadline.com/feed/",
  "categories": [
    "News",
    "Politics",
    "Donald Trump",
    "ElectionLine",
    "George Clooney",
    "Joe Biden",
    "Kamala Harris"
  ],
  "byline": "Glenn Garner",
  "length": 2020,
  "excerpt": "With Trump's first 100 days back in office, George Clooney has faced his share of criticism over his previous stand against Biden.",
  "siteName": "Deadline",
  "favicon": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=180",
  "text": "With Trump‘s first 100 days back in office, George Clooney has faced his share of criticism over his previous stand against Biden. After penning an op-ed calling for President Biden to step aside during the 2024 presidential election, endorsing Vice President Kamala Harris in his place, the 2x Oscar winner recently opened up about the ongoing backlash to his statement. “I don’t know if it was brave. It was a civic duty because I found that people on my side of the street — you know, I’m a Democrat in Kentucky so I get it — when I saw people on my side of the street not telling the truth I thought that was time to… some people [are mad], sure,” he explained on CNN. “That’s OK, you know, listen the idea of freedom of speech is you can’t demand freedom of speech and then say, ‘But don’t say bad things about me.'” Watch on Deadline Clooney continued, “That’s the deal, you have to take your stand if you believe in it. Take a stand, stand for it and then deal with the consequences. That’s the rules, so when people criticize me — they criticized me for my stance against the war 20 years ago, people picketed my movies and they put me on a deck of cards — I have to take that, that’s fair. I’m OK with that, I’m OK with criticism for where I stand. I defend their right to criticize me as much as I defend my right to criticize them.” In July, Clooney prefaced that “I believe in him” as he called for Biden to step aside in a New York Times essay, following a poor performance in his debate against Trump. “But the one battle he cannot win is the fight against time,” wrote Clooney. “None of us can. It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe big F-ing deal Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate.” After Biden dropped out of the race and endorsed Harris, Trump and running mate J.D. Vance won the 2024 presidential election.",
  "image": "https://deadline.com/wp-content/uploads/2024/07/George-Clooney-President-Joe-Biden-1.jpg?w=1024",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\n\tWith \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/trump/\"\u003eTrump\u003c/a\u003e‘s first 100 days back in office, \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/george-clooney/\"\u003eGeorge Clooney\u003c/a\u003e has faced his share of criticism over his previous stand against \u003ca href=\"https://deadline.com/tag/biden/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBiden\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAfter penning an op-ed \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2024/07/george-clooney-joe-biden-2024-election-1236005916/\"\u003ecalling for President Biden to step aside\u003c/a\u003e during the 2024 presidential election, endorsing Vice President \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/tag/kamala-harris/\"\u003eKamala Harris\u003c/a\u003e in his place, the 2x Oscar winner recently opened up about the ongoing backlash to his statement.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“I don’t know if it was brave. It was a civic duty because I found that people on my side of the street — you know, I’m a Democrat in Kentucky so I get it — when I saw people on my side of the street not telling the truth I thought that was time to… some people [are mad], sure,” he explained on \u003ca href=\"https://www.thedailybeast.com/george-clooney-defends-his-op-ed-knifing-joe-biden-as-a-civic-duty/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\"\u003eCNN\u003c/a\u003e. “That’s OK, you know, listen the idea of freedom of speech is you can’t demand freedom of speech and then say, ‘But don’t say bad things about me.\u0026#39;”\n\n\t\u003c/p\u003e\n\n\u003cdiv data-pmc-adm-ad-id=\"1234771711\"\u003e\n\t\t\t\u003ch3\u003e\n\t\t\tWatch on Deadline\t\t\u003c/h3\u003e\n\t\n\t\t\n\t\u003c/div\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\n\tClooney continued, “That’s the deal, you have to take your stand if you believe in it. Take a stand, stand for it and then deal with the consequences. That’s the rules, so when people criticize me — they criticized me for my stance against the war 20 years ago, people picketed my movies and they put me on a deck of cards — I have to take that, that’s fair. I’m OK with that, I’m OK with criticism for where I stand. I defend their right to criticize me as much as I defend my right to criticize them.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tIn July, Clooney prefaced that “I believe in him” as he \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://deadline.com/2024/07/george-clooney-joe-biden-2024-election-1236005916/\"\u003ecalled for Biden to step aside\u003c/a\u003e in a \u003cem\u003eNew York Times\u003c/em\u003e essay, following a poor performance in his debate against Trump.\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\t“But the one battle he cannot win is the fight against time,” wrote Clooney. “None of us can. It’s devastating to say it, but the \u003ca href=\"https://deadline.com/tag/joe-biden/\" id=\"auto-tag_joe-biden\" data-tag=\"joe-biden\"\u003eJoe Biden\u003c/a\u003e I was with three weeks ago at the fund-raiser was not the Joe big F-ing deal Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate.”\u003c/p\u003e\n\n\n\n\u003cp\u003e\n\tAfter Biden dropped out of the race and endorsed Harris, Trump and running mate J.D. Vance won the 2024 presidential election.\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-16T23:11:49Z",
  "modifiedTime": "2025-04-16T23:28:22Z"
}
