{
  "id": "f4e4aefb-d179-4e6b-ac4e-5d636c7493de",
  "title": "What Clint Eastwood Likes The Least About Making Movies",
  "link": "https://www.slashfilm.com/1865241/what-clint-eastwood-likes-least-making-movies/",
  "description": "Clint Eastwood has been directing movies for more than four decades, and there's one part of the process he doesn't really enjoy.",
  "author": "Quinn Bilodeau",
  "published": "Tue, 27 May 2025 00:00:00 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Drama Movies"
  ],
  "byline": "Quinn Bilodeau",
  "length": 3734,
  "excerpt": "Clint Eastwood has been directing movies for more than four decades, and there's one part of the process he doesn't really enjoy.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slashfilm-favicon.png",
  "text": "Warner Bros. In \"Bronco Billy,\" Clint Eastwood plays a contemporary cowboy showman living out his fantasies with an eclectic group of roadies who, despite all the snags they hit, wouldn't have it any other way. Do the show, pack it up, and move onto the next one. It's as much a film about Eastwood grappling with his screen image, as it is a fitting descriptor of his filmmaking habits. He has his routine, the people he trusts to get the job done, and the talent needed to pull it all off. Filmmaking is a whole different ball game than a roadside rodeo, but in both cases, Eastwood knows that the show can't go on without his crew or unchecked egos. Advertisement Eastwood is one of our greatest living Hollywood legends because he's always willing to wade in new waters, while rarely running into the same issues as most studio filmmakers do. You will never see a story from the industry trades about an Eastwood picture going over budget or over schedule. His style is built upon an economical manner of picture making, opting to often go with the first take as he favors spontaneity over Last year's \"Juror #2\" marked Eastwood 40th directorial effort in 53 years, which is staggering when you really think about it. Not every one of his films is a winner, but most of them demonstrate a sturdy hand behind the camera. Eastwood's a thoughtful, yet no frills visionary who knows what he wants and makes the best with what he's got. Trusting his team results in an environment where he can focus his efforts where they need to be. If there's an aspect of moviemaking Eastwood is not a fan of, however, it's finding locations to make the thing. Advertisement Eastwood is not a fan of location scouting Warner Bros. In an extensive interview conducted as a part of the Hollywood Masters series at Loyola Marymount University School of Film and TV, Eastwood talked about his favorite aspect of being a filmmaker is delving into the art of storytelling. In terms of his least favorite, Eastwood said he's not too keen on location scouting and would rather send his people over to case out the potential settings before he does (via The Hollywood Reporter): Advertisement \"I guess going around looking at locations and stuff, there's no gratification in that. But you know there's great interest because you want it to be right. The last film I did was a current film, 'American Sniper' and...But actually I had my associate go over to, Rob Lorenz, I had him go over to Morocco and he checked that out for the architecture of the villages. And then I did everything else over here. But I went over there when we filmed it.\" Eastwood, like most professionals, recognizes there's one aspect of his job that may not bring him immediate satisfaction, but recognizes its vital importance. He can't be everywhere at once, so having members of his crew report back to him with their findings and making an informed decision from that, sounds pretty reasonable. Sometimes you get lucky with your ideal location that matches the vision in your head of what it would look like. I can't envision Eastwood and his crew finding a better spot than Mono Lake, California to embody the isolationist hellscape of \"High Plains Drifter.\" Advertisement \"American Sniper\" is currently streaming on Netflix.",
  "image": "https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/l-intro-1747771783.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \n\n    \n                \u003cdiv\u003e\n                \n                                \n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1865241/what-clint-eastwood-likes-least-making-movies/\" data-post-title=\"What Clint Eastwood Likes The Least About Making Movies\" data-slide-num=\"0\" data-post-id=\"1865241\"\u003e\n                                             \u003cpicture id=\"p2a2262bd36476dc32effb9c29bb580ed\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/intro-1747771783.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/intro-1747771783.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/intro-1747771783.jpg\" data-slide-url=\"https://www.slashfilm.com/1865241/what-clint-eastwood-likes-least-making-movies/\" data-post-id=\"1865241\" data-slide-num=\"0\" data-slide-title=\"What Clint Eastwood Likes The Least About Making Movies: \" width=\"780\" height=\"438\" alt=\"Earl Stone looking worried in The Mule\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n                \n                \n\u003cp dir=\"ltr\"\u003eIn \u0026#34;Bronco Billy,\u0026#34; Clint Eastwood plays a contemporary cowboy showman living out his fantasies with an eclectic group of roadies who, despite all the snags they hit, wouldn\u0026#39;t have it any other way. Do the show, pack it up, and move onto the next one. It\u0026#39;s as much a film about Eastwood grappling with his screen image, as it is a fitting descriptor of his filmmaking habits. He has his routine, the people he trusts to get the job done, and the talent needed to pull it all off. Filmmaking is a whole different ball game than a roadside rodeo, but in both cases, \u003ca href=\"https://www.slashfilm.com/997073/why-clint-eastwood-cant-buy-into-the-idea-of-an-auteur-director/\" target=\"_blank\"\u003eEastwood knows that the show can\u0026#39;t go on without his crew or unchecked egos.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eEastwood is one of our greatest living Hollywood legends because he\u0026#39;s always willing to wade in new waters, while rarely running into the same issues as most studio filmmakers do. You will never see a story from the industry trades about an Eastwood picture going over budget or over schedule. \u003ca href=\"https://www.slashfilm.com/975697/why-clint-eastwood-always-tries-to-use-the-first-take-as-a-director/\" target=\"_blank\"\u003eHis style is built upon an economical manner of picture making, opting to often go with the first take\u003c/a\u003e as he favors spontaneity over\u003c/p\u003e\n\u003cp\u003eLast year\u0026#39;s \u0026#34;Juror #2\u0026#34; marked Eastwood 40th directorial effort in 53 years, which is staggering when you really think about it. Not every one of his films is a winner, but most of them demonstrate a sturdy hand behind the camera. \u003ca href=\"https://www.slashfilm.com/681475/the-best-clint-eastwood-directed-movies-ranked/\" target=\"_blank\"\u003eEastwood\u0026#39;s a thoughtful, yet no frills visionary who knows what he wants\u003c/a\u003e and makes the best with what he\u0026#39;s got. Trusting his team results in an environment where he can focus his efforts where they need to be. If there\u0026#39;s an aspect of moviemaking Eastwood is not a fan of, however, it\u0026#39;s finding locations to make the thing.\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n            \u003cdiv\u003e\n                \n                \u003ch2\u003eEastwood is not a fan of location scouting\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1865241/what-clint-eastwood-likes-least-making-movies/\" data-post-title=\"What Clint Eastwood Likes The Least About Making Movies\" data-slide-num=\"1\" data-post-id=\"1865241\"\u003e\n                                             \u003cpicture id=\"p7b60acc30b1b980d7790b9ac1c7b9dd3\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/eastwood-is-not-a-fan-of-location-scouting-1747771783.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/eastwood-is-not-a-fan-of-location-scouting-1747771783.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/what-clint-eastwood-likes-the-least-about-making-movies/eastwood-is-not-a-fan-of-location-scouting-1747771783.jpg\" data-slide-url=\"https://www.slashfilm.com/1865241/what-clint-eastwood-likes-least-making-movies/\" data-post-id=\"1865241\" data-slide-num=\"1\" data-slide-title=\"What Clint Eastwood Likes The Least About Making Movies: Eastwood is not a fan of location scouting\" width=\"780\" height=\"438\" alt=\"Earl Stone driving in The Mule\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eWarner Bros.\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eIn an extensive interview conducted as a part of the Hollywood Masters series at Loyola Marymount University School of Film and TV, Eastwood talked about his favorite aspect of being a filmmaker is delving into the art of storytelling. In terms of his least favorite, Eastwood said he\u0026#39;s not too keen on location scouting and would rather send his people over to case out the potential settings before he does (via \u003ca href=\"https://www.hollywoodreporter.com/movies/movie-news/clint-eastwood-describes-his-death-781618/\" target=\"_blank\"\u003eThe Hollywood Reporter\u003c/a\u003e):\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\"\u003e\u0026#34;I guess going around looking at locations and stuff, there\u0026#39;s no gratification in that. But you know there\u0026#39;s great interest because you want it to be right. The last film I did was a current film, \u0026#39;American Sniper\u0026#39; and...But actually I had my associate go over to, Rob Lorenz, I had him go over to Morocco and he checked that out for the architecture of the villages. And then I did everything else over here. But I went over there when we filmed it.\u0026#34;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp dir=\"ltr\"\u003eEastwood, like most professionals, recognizes there\u0026#39;s one aspect of his job that may not bring him immediate satisfaction, but recognizes its vital importance. He can\u0026#39;t be everywhere at once, so having members of his crew report back to him with their findings and making an informed decision from that, sounds pretty reasonable. Sometimes you get lucky with your ideal location that matches the vision in your head of what it would look like. I can\u0026#39;t envision Eastwood and his crew finding a better spot than Mono Lake, California to embody \u003ca href=\"https://www.slashfilm.com/1783552/high-plains-drifter-filming-locations-explained/\" target=\"_blank\"\u003ethe isolationist hellscape of \u0026#34;High Plains Drifter.\u003c/a\u003e\u0026#34;\u003c/p\u003e\n\u003cp\u003eAdvertisement\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003e\u0026#34;American Sniper\u0026#34; is currently streaming on Netflix.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-27T00:00:00Z",
  "modifiedTime": "2025-05-27T00:00:00Z"
}
