{
  "id": "f720311f-752d-4c3d-854e-26b1aacb9bc7",
  "title": "Who Is Steven Bartlett’s Girlfriend? Melanie Vaz Lopes’ Job \u0026 Relationship History",
  "link": "https://www.comingsoon.net/guides/news/1913742-steven-bartlett-girlfriend-melanie-vaz-lopes-job-relationship-history",
  "description": "Many fans are curious to know more about Steven Bartlett’s relationship with his girlfriend. Bartlett is a multimillionaire entrepreneur who is best known for hosting the popular podcast The Diary of a CEO. In 2024, the podcast made it to Spotify Wrapped’s Top 5 list of most popular podcasts in the world. He also appeared […] The post Who Is Steven Bartlett’s Girlfriend? Melanie Vaz Lopes’ Job \u0026 Relationship History appeared first on ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More.",
  "author": "Namrata Ghosh",
  "published": "Sat, 01 Feb 2025 20:00:00 +0000",
  "source": "https://www.comingsoon.net/feed",
  "categories": [
    "Guides",
    "Pop Culture",
    "Steven Bartlett"
  ],
  "byline": "Namrata Ghosh",
  "length": 2190,
  "excerpt": "Read on to find out all about Steven Bartlett's girlfriend Melanie Vaz Lopes, her profession, and more details about the couple.",
  "siteName": "ComingSoon.net - Movie Trailers, TV \u0026 Streaming News, and More",
  "favicon": "https://www.comingsoon.net/wp-content/uploads/sites/3/2022/12/cs_ico_144x144.png?w=144",
  "text": "Many fans are curious to know more about Steven Bartlett’s relationship with his girlfriend. Bartlett is a multimillionaire entrepreneur who is best known for hosting the popular podcast The Diary of a CEO. In 2024, the podcast made it to Spotify Wrapped’s Top 5 list of most popular podcasts in the world. He also appeared in the British reality show Dragons’ Den on BBC One. Here’s everything we know about Steven Bartlett’s girlfriend, her profession, and their relationship history. Who is Steven Bartlett’s girlfriend? Steven Bartlett is dating Melanie Vaz Lopes. The couple mostly keep their private lives away from the public eye. However, Bartlett has often mentioned his girlfriend in his popular podcast Diary of a CEO, where he gave his fans a sneak peek into their relationship. What is Melanie Vaz Lopes’ job? Melanie Vaz Lopes is an influencer and entrepreneur. Lopes is a native of Bordeaux, France, and is a successful fitness influencer with a special focus on breathwork and bodywork content. As a businesswoman, she has founded her own wellness brand named Bali Breathwork, which offers guidance on wellness and breathwork sessions. On the official website of the company, Lopes shares her journey to wellness and her three-year stay in Bali that inspired her to form the company. She writes that her “mission is to empower others to access their true potential and find their own unique path to healing and transformation.” Steven Bartlett and Melanie Vaz Lopes’ relationship history According to several reports, Steven Bartlett first met Melanie Vaz Lopes in 2016 via Instagram. However, just after a year of dating each other, the couple decided to call it quits. Giving the reason for the unfortunate breakup, Bartlett had revealed at the time that he was not ready for commitment amid his busy work schedule. He came to regret this decision six years later when he realized his love for Lopes. He flew to Bali to confess his feelings to her and the grand gesture ended with them getting back together in 2022. Following the reconciliation, the pair are still going strong and continue to enjoy a happy relationship. (via HELLO! Magazine)",
  "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2025/01/Steven-Bartlett-girlfriend-Melanie-Vaz-Lopes.jpg?resize=1200,630",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eMany fans are curious to know more about \u003cstrong\u003eSteven Bartlett’s\u003c/strong\u003e relationship with his girlfriend. Bartlett is a multimillionaire entrepreneur who is best known for hosting the popular podcast The Diary of a CEO. In 2024, the podcast made it to \u003ca href=\"https://www.comingsoon.net/tag/spotify\"\u003eSpotify\u003c/a\u003e Wrapped’s Top 5 list of most popular podcasts in the world. He also appeared in the British reality show Dragons’ Den on BBC One.\u003c/p\u003e\n\n\n\n\u003cp\u003eHere’s everything we know about Steven Bartlett’s girlfriend, her profession, and their relationship history.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-who-is-steven-bartlett-s-girlfriend\"\u003eWho is Steven Bartlett’s girlfriend?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eSteven Bartlett is dating Melanie Vaz Lopes.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eThe couple mostly keep their private lives away from the public eye. However, Bartlett has often mentioned his girlfriend in his popular podcast Diary of a CEO, where he gave his fans a sneak peek into their relationship. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-is-melanie-vaz-lopes-job\"\u003eWhat is Melanie Vaz Lopes’ job?\u003c/h2\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eMelanie Vaz Lopes is an influencer and entrepreneur.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLopes is a native of Bordeaux, France, and is a successful fitness influencer with a special focus on breathwork and bodywork content. As a businesswoman, she has founded her own wellness brand named \u003ca href=\"https://balibreathwork.com/#founder\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBali Breathwork\u003c/a\u003e, which offers guidance on wellness and breathwork sessions. On the official website of the company, Lopes shares her journey to wellness and her three-year stay in Bali that inspired her to form the company. She writes that her “mission is to empower others to access their true potential and find their own unique path to healing and transformation.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-steven-bartlett-and-melanie-vaz-lopes-relationship-history\"\u003eSteven Bartlett and Melanie Vaz Lopes’ relationship history\u003c/h2\u003e\n\n\n\n\u003cp\u003eAccording to several reports, Steven Bartlett first met Melanie Vaz Lopes in 2016 via Instagram. However, just after a year of dating each other, the couple decided to call it quits. Giving the reason for the unfortunate breakup, Bartlett had revealed at the time that he was not ready for commitment amid his busy work schedule. He came to regret this decision six years later when he realized his love for Lopes. He flew to Bali to confess his feelings to her and the grand gesture ended with them getting back together in 2022. Following the reconciliation, the pair are still going strong and continue to enjoy a happy relationship. (via \u003ca href=\"https://www.hellomagazine.com/film/20230302165782/dragons-den-steven-barlett-love-life-all-we-know/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHELLO! Magazine\u003c/a\u003e)\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-01T20:00:00Z",
  "modifiedTime": "2025-01-31T15:14:59Z"
}
