{
  "id": "f94fdfdb-c8e7-421c-a2a0-db7152d85f25",
  "title": "Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd",
  "link": "https://www.slashfilm.com/1763047/paul-rudd-cut-bridesmaids-role-explained/",
  "description": "No one writes a scene for Paul Rudd and thinks it will end up on the cutting room floor, but that's exactly what happened with Bridesmaids.",
  "author": "Jeremy Smith",
  "published": "Sat, 25 Jan 2025 22:45:46 +0000",
  "source": "https://feeds2.feedburner.com/slashfilm",
  "categories": [
    "Comedy Movies"
  ],
  "byline": "Jeremy Smith",
  "length": 4510,
  "excerpt": "No one writes a scene for Paul Rudd and thinks it will end up on the cutting room floor, but that's exactly what happened with Bridesmaids.",
  "siteName": "SlashFilm",
  "favicon": "https://www.slashfilm.com/img/slash-film-favicon-448x448.png",
  "text": "Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd Marvel Studios The Judd Apatow method of comedic filmmaking, where actors are encouraged to riff and/or repeat lines fed to them off-camera by the director, tends to lead to an embarrassment of riches in the editing room. What else would you expect when you've assembled so many remarkably funny people, many of whom cut their teeth in improv troupes? These people have been trained to keep a scene going with \"yes and\" inventiveness, and in our age of digital cinema, you can literally afford to let them run wild before moving on to the next setup. There are downsides to this approach (sometimes you'd just like to enjoy a witty, concisely written scene where you can't see the actors improv gears turning), but the biggest problem for directors working within this loose-limbed format is deciding what to cut. Knowing when and where to kill your darlings is what separates a comedy classic like \"The 40-Year-Old Virgin\" from a brutally bloated dramedy like \"This Is 40\" — and while I rarely prefer the extended cuts of even his good movies, I think Apatow does aspiring directors a service by showing what too much of a good thing looks like. If you're looking for a perfect case study of a beautiful darling judiciously killed, look no further than the deleted scenes from Paul Feig's \"Bridesmaids.\" Produced by Apatow and written by the genius duo of Annie Mumolo and Kristen Wiig (all hail \"Barb and Star Go to Vista Del Mar\"), the comedy about a single woman who goes hilariously haywire in the run-up to her best friend's wedding is loaded with uproarious set pieces. At a healthy 125 minutes, it's impossible to know what to cut; you might be tempted to trim some of the riffy scenes, but, as is not always the case in movies like this, they either move the plot forward or provide crucial character development. How good is \"Bridesmaids?\" It's one of the best comedies of the 2010s even though Feig cut out its funniest scene. Paul Feig simply couldn't find room for Paul Rudd in Bridesmaids Universal When Feig began shooting \"Bridesmaids,\" I sincerely doubt he looked over Mumolo and Wiig's script and flagged a blind date scene between Wiig and Paul Rudd as a moment destined for the cutting room floor. In retrospect, knowing nothing about the development of the screenplay, you can look at the film as constituted and wonder why they even bothered to shoot the sequence. Why would Wiig's Annie muck up her already complicated love life by going out with a complete stranger — especially when, from a narrative perspective, the audience has already identified Chris O'Dowd's kindly cop Nathan as the obvious Mr. Right? It doesn't make sense, and that's why the scene is gone. But when Feig told Entertainment Weekly, \"It was one of the funniest things I've ever been a witness to,\" he wasn't lying. As you can see on YouTube, the date starts with Wiig and Rudd getting dinner at a nice restaurant, where they hit it off famously. Rudd's a psychologist who treats people with hoarder tendencies, and seems genuinely into his job. Wiig seems to like him, and, because it's Rudd, we do, too. Then they go ice skating. While showing off for each other, Rudd takes a tumble and gets the tip of his finger slashed by a kid innocently doing laps around the arena. He immediately goes nuclear, accusing everyone of delighting in his pain. Eventually, he profanely berates the boy who injured him, which results in the child's father punching him out. This isn't a masterfully constructed screwball scene or anything, but it is screamingly funny. And it's right where it belongs: in a deleted scenes reel on the Blu-ray. And let's hope that the potential \"Bridesmaids\" sequel stays where it belongs as well: in Mumolo and Wiig's smartphone notes.",
  "image": "https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/l-intro-1736990214.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"content\"\u003e\n            \n\n            \u003carticle\u003e\n    \n    \n    \n                \u003cp\u003e\n                \u003ch2 id=\"title-gallery\" data-post-id=\"1763047\" data-author=\"Jeremy Smith\" data-category=\"comedy-movies\" data-content_type=\"Important Topic\" data-mod_date=\"2025-01-25\" data-layout=\"Infinite\" data-pub_date=\"2025-01-25\" data-day=\"Saturday\" data-dayhour=\"Saturday5PM\" data-hour=\"5PM\" data-num_slides=\"2\" data-num_words=\"643\"\u003eWhy Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd\u003c/h2\u003e\n            \u003c/p\u003e\n    \n                \u003cdiv\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1763047/paul-rudd-cut-bridesmaids-role-explained/\" data-post-title=\"Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd\" data-slide-num=\"0\" data-post-id=\"1763047\"\u003e\n                                             \u003cpicture id=\"pbc45c39e5d875e9d61e09049e8d8308a\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/intro-1736990214.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/intro-1736990214.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/intro-1736990214.jpg\" data-slide-url=\"https://www.slashfilm.com/1763047/paul-rudd-cut-bridesmaids-role-explained/\" data-post-id=\"1763047\" data-slide-num=\"0\" data-slide-title=\"Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd: \" width=\"780\" height=\"438\" alt=\"Paul Rudd is an arms-crossed force of nature as Scott Lang in Ant-Man\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eMarvel Studios\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n                \n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eThe Judd Apatow method of comedic filmmaking, where actors are encouraged to riff and/or repeat lines fed to them off-camera by the director, tends to lead to an embarrassment of riches in the editing room. What else would you expect when you\u0026#39;ve assembled so many remarkably funny people, many of whom cut their teeth in improv troupes? These people have been trained to keep a scene going with \u0026#34;yes and\u0026#34; inventiveness, and in our age of digital cinema, you can literally afford to let them run wild before moving on to the next setup.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eThere are downsides to this approach (sometimes you\u0026#39;d just like to enjoy a witty, concisely written scene where you can\u0026#39;t see the actors improv gears turning), but the biggest problem for directors working within this loose-limbed format is deciding what to cut. Knowing when and where to kill your darlings is what separates \u003ca href=\"https://www.slashfilm.com/1100374/how-a-scrapped-steve-carrell-sketch-idea-became-the-40-year-old-virgin/\" target=\"_blank\"\u003ea comedy classic like \u0026#34;The 40-Year-Old Virgin\u0026#34;\u003c/a\u003e from a brutally bloated dramedy like \u0026#34;This Is 40\u0026#34; — and while I rarely prefer the extended cuts of even his good movies, I think Apatow does aspiring directors a service by showing what too much of a good thing looks like.\u003c/p\u003e\n\u003cp dir=\"ltr\"\u003eIf you\u0026#39;re looking for a perfect case study of a beautiful darling judiciously killed, look no further than the deleted scenes from Paul Feig\u0026#39;s \u0026#34;Bridesmaids.\u0026#34; Produced by Apatow and written by the genius duo of Annie Mumolo and Kristen Wiig (\u003ca href=\"https://www.slashfilm.com/579458/the-quarantine-stream-barb-and-star-go-to-vista-del-mar/\" target=\"_blank\"\u003eall hail \u0026#34;Barb and Star Go to Vista Del Mar\u0026#34;\u003c/a\u003e), the comedy about a single woman who goes hilariously haywire in the run-up to her best friend\u0026#39;s wedding is loaded with uproarious set pieces. At a healthy 125 minutes, it\u0026#39;s impossible to know what to cut; you might be tempted to trim some of the riffy scenes, but, as is not always the case in movies like this, they either move the plot forward or provide crucial character development.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eHow good is \u0026#34;Bridesmaids?\u0026#34; It\u0026#39;s one of the best comedies of the 2010s even though Feig cut out its funniest scene.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n            \u003cdiv\u003e\n                \n                \u003ch2\u003ePaul Feig simply couldn\u0026#39;t find room for Paul Rudd in Bridesmaids\u003c/h2\u003e\n                                \u003cdiv data-post-url=\"https://www.slashfilm.com/1763047/paul-rudd-cut-bridesmaids-role-explained/\" data-post-title=\"Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd\" data-slide-num=\"1\" data-post-id=\"1763047\"\u003e\n                                             \u003cpicture id=\"pfc849c7226b4bd8fb49c940a11bbb479\"\u003e\n                                                    \u003csource media=\"(min-width: 429px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/paul-feig-simply-couldnt-find-room-for-paul-rudd-in-bridesmaids-1736990214.webp\" type=\"image/webp\"/\u003e\n                            \u003csource media=\"(max-width: 428px)\" srcset=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/paul-feig-simply-couldnt-find-room-for-paul-rudd-in-bridesmaids-1736990214.sm.webp\" type=\"image/webp\"/\u003e\n                        \u003cimg src=\"https://www.slashfilm.com/img/gallery/why-bridesmaids-cut-a-hilarious-ice-skating-scene-with-paul-rudd/paul-feig-simply-couldnt-find-room-for-paul-rudd-in-bridesmaids-1736990214.jpg\" data-slide-url=\"https://www.slashfilm.com/1763047/paul-rudd-cut-bridesmaids-role-explained/\" data-post-id=\"1763047\" data-slide-num=\"1\" data-slide-title=\"Why Bridesmaids Cut A Hilarious Ice Skating Scene With Paul Rudd: Paul Feig simply couldn\u0026#39;t find room for Paul Rudd in Bridesmaids\" width=\"780\" height=\"438\" alt=\"Kristen Wiig as Annie ice skates with Paul Rudd as a blind date in Bridesmaids\"/\u003e\n                    \u003c/picture\u003e\n                    \u003cp\u003e\u003cspan\u003eUniversal\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n\t\t\t\t            \u003cdiv\u003e\n                \n\u003cp dir=\"ltr\"\u003eWhen Feig began shooting \u0026#34;Bridesmaids,\u0026#34; I sincerely doubt he looked over Mumolo and Wiig\u0026#39;s script and flagged a blind date scene between Wiig and Paul Rudd as a moment destined for the cutting room floor. In retrospect, knowing nothing about the development of the screenplay, you can look at the film as constituted and wonder why they even bothered to shoot the sequence. Why would Wiig\u0026#39;s Annie muck up her already complicated love life by going out with a complete stranger — especially when, from a narrative perspective, the audience has already identified Chris O\u0026#39;Dowd\u0026#39;s kindly cop Nathan as the obvious Mr. Right?\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eIt doesn\u0026#39;t make sense, and that\u0026#39;s why the scene is gone. \u003ca href=\"https://ew.com/movies/2017/04/03/bridesmaids-paul-rudd-deleted-scene/\" target=\"_blank\"\u003eBut when Feig told Entertainment Weekly\u003c/a\u003e, \u0026#34;It was one of the funniest things I\u0026#39;ve ever been a witness to,\u0026#34; he wasn\u0026#39;t lying. \u003ca href=\"https://www.youtube.com/watch?v=8M5hTE61XLI\" target=\"_blank\"\u003eAs you can see on YouTube\u003c/a\u003e, the date starts with Wiig and Rudd getting dinner at a nice restaurant, where they hit it off famously. Rudd\u0026#39;s a psychologist who treats people with hoarder tendencies, and seems genuinely into his job. Wiig seems to like him, and, because it\u0026#39;s Rudd, we do, too. Then they go ice skating. While showing off for each other, Rudd takes a tumble and gets the tip of his finger slashed by a kid innocently doing laps around the arena. He immediately goes nuclear, accusing everyone of delighting in his pain. Eventually, he profanely berates the boy who injured him, which results in the child\u0026#39;s father punching him out. This isn\u0026#39;t a masterfully constructed screwball scene or anything, but it \u003cem\u003eis\u003c/em\u003e screamingly funny.\u003c/p\u003e\n\n\u003cp dir=\"ltr\"\u003eAnd it\u0026#39;s right where it belongs: in a deleted scenes reel on the Blu-ray. And let\u0026#39;s hope \u003ca href=\"https://www.slashfilm.com/574359/paul-feig-says-bridesmaids-sequel-unlikely/\" target=\"_blank\"\u003ethat the potential \u0026#34;Bridesmaids\u0026#34; sequel\u003c/a\u003e stays where it belongs as well: in Mumolo and Wiig\u0026#39;s smartphone notes.\u003c/p\u003e\n\n            \u003c/div\u003e\n            \u003c/div\u003e\n    \n\u003c/article\u003e                        \n            \n                            \n                           \n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-25T22:45:46Z",
  "modifiedTime": "2025-01-25T22:45:46Z"
}
