{
  "id": "69051700-5522-46be-adb3-1aa95c00a536",
  "title": "Atomic Design Certification Course",
  "link": "https://css-tricks.com/atomic-design-certification-course/",
  "description": "Brad Frost introduced the “Atomic Design” concept wayyyy back in 2013. He even wrote a book on it. And we all took notice, because that term has been part of our lexicon ever since. It’s a nice way … Atomic Design Certification Course originally published on CSS-Tricks, which is part of the DigitalOcean family. You should get the newsletter.",
  "author": "Geoff Graham",
  "published": "Thu, 24 Jul 2025 16:16:30 +0000",
  "source": "https://css-tricks.com/feed/",
  "categories": [
    "Links",
    "design systems",
    "education"
  ],
  "byline": "Geoff Graham",
  "length": 1951,
  "excerpt": "Brad Frost introduced the \"Atomic Design\" concept wayyyy back in 2013. He even wrote a book on it. And we all took notice, because that term has been part of",
  "siteName": "CSS-Tricks",
  "favicon": "https://i0.wp.com/css-tricks.com/wp-content/uploads/2021/07/star.png?fit=180%2C180\u0026ssl=1",
  "text": "Brad Frost introduced the “Atomic Design” concept wayyyy back in 2013. He even wrote a book on it. And we all took notice, because that term has been part of our lexicon ever since. It’s a nice way to divide web designs into separate layers of concern, leaning into biology terms to help scope their context by size: Atoms Molecules Organisms Templates Pages Atoms are part of molecules, which are part of organisms, which make up templates, which become full-blown pages. It’s composable design that’s centered on consistency, reusability, and maintainability. Beautiful. We’ve covered this a bunch over the years. Want to get fully versed in how it works? If so, you’re in luck because Brad and his brother, Ian, are in the process of publishing an entire online course about Atomic Design. It’s in presale for $50 (with discounts for teams). Normally, I like to jump into a course and check it out before sharing it. But this is Brad and all he does is wonderful things. For example: The guy arranged his very own concert! He inspires folks to live creatively and authentically with his Wake Up Excited! podcast. There’s another podcast where he encourages designers and developers to Open Up! about their careers and what drives them. I get to participate in that one! Dude is a solid drummer who records himself playing along to his favorite albums, completely unrehearsed. He’s got a crap ton of tracks he writes and records as well. Oh, and his newsletter is pretty awesome, too. And I’m sure I’m leaving out more things he has floating around the web, but you get the point: he’s incredibly knowledgeable on the topic, is a highly-effective educator and speaker, and most importantly, has an infectious positive posture about him. I know the Atomic Design course will be just as awesome. Preordered! Direct Link →",
  "image": "https://i0.wp.com/css-tricks.com/wp-content/uploads/2025/07/atomic-design-logo.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n          \n          \n\u003cp\u003eBrad Frost introduced the “Atomic Design” concept \u003ca href=\"https://bradfrost.com/blog/post/atomic-web-design/\" rel=\"noopener\"\u003ewayyyy back in 2013\u003c/a\u003e. He even \u003ca href=\"https://atomicdesign.bradfrost.com\" rel=\"noopener\"\u003ewrote a book on it\u003c/a\u003e. And we all took notice, because that term has been part of our lexicon ever since.\u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s a nice way to divide web designs into separate layers of concern, leaning into biology terms to help scope their context by size:\u003c/p\u003e\n\n\n\n\u003col\u003e\n\u003cli\u003eAtoms\u003c/li\u003e\n\n\n\n\u003cli\u003eMolecules\u003c/li\u003e\n\n\n\n\u003cli\u003eOrganisms\u003c/li\u003e\n\n\n\n\u003cli\u003eTemplates\u003c/li\u003e\n\n\n\n\u003cli\u003ePages\u003c/li\u003e\n\u003c/ol\u003e\n\n\n\n\u003cp\u003eAtoms are part of molecules, which are part of organisms, which make up templates, which become full-blown pages. It’s composable design that’s centered on consistency, reusability, and maintainability. \u003cem\u003eBeautiful.\u003c/em\u003e \u003ca href=\"https://css-tricks.com/?s=atomic\u0026amp;post_tag=atomic\"\u003eWe’ve covered this a bunch over the years.\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWant to get fully versed in how it works? If so, you’re in luck because Brad and his brother, Ian, are in the process of publishing \u003ca href=\"https://atomicdesigncourse.com\" rel=\"noopener\"\u003ean entire online course about Atomic Design\u003c/a\u003e. It’s in presale for $50 (with discounts for teams).\u003c/p\u003e\n\n\n\n\u003cp\u003eNormally, I like to jump into a course and check it out before sharing it. But this is Brad and all he does is wonderful things. For example:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eThe guy arranged \u003ca href=\"https://css-tricks.com/on-the-ground-at-frostapalooza/\"\u003ehis very own concert\u003c/a\u003e!\u003c/li\u003e\n\n\n\n\u003cli\u003eHe inspires folks to live creatively and authentically with his \u003cem\u003e\u003ca href=\"https://wakeupexcited.show\" rel=\"noopener\"\u003eWake Up Excited!\u003c/a\u003e\u003c/em\u003e podcast.\u003c/li\u003e\n\n\n\n\u003cli\u003eThere’s another podcast where he encourages designers and developers to \u003cem\u003e\u003ca href=\"https://smashingconf.com/open-up\" rel=\"noopener\"\u003eOpen Up!\u003c/a\u003e\u003c/em\u003e about their careers and what drives them. I get to participate in that one!\u003c/li\u003e\n\n\n\n\u003cli\u003eDude is a solid drummer \u003ca href=\"https://coldalbumdrumming.com\" rel=\"noopener\"\u003ewho records himself playing along to his favorite albums\u003c/a\u003e, completely unrehearsed.\u003c/li\u003e\n\n\n\n\u003cli\u003eHe’s got a \u003ca href=\"https://soundcloud.com/frostfrost-1\" rel=\"noopener\"\u003ecrap ton of tracks\u003c/a\u003e he writes and records as well.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eOh, and \u003ca href=\"https://bradfrost.com/newsletter/\" rel=\"noopener\"\u003ehis newsletter\u003c/a\u003e is pretty awesome, too. And I’m sure I’m leaving out more things he has floating around the web, but you get the point: he’s incredibly knowledgeable on the topic, is a highly-effective educator and speaker, and most importantly, has an infectious positive posture about him.\u003c/p\u003e\n\n\n\n\u003cp\u003eI know the Atomic Design course will be just as awesome. \u003cem\u003ePreordered!\u003c/em\u003e\u003c/p\u003e\n\n                      \u003cp\u003e     \n                              \u003ca href=\"https://atomicdesigncourse.com\"\u003e\n                  Direct Link →\n                \u003c/a\u003e\n              \n                          \u003c/p\u003e\n          \n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-07-24T10:16:30-06:00",
  "modifiedTime": "2025-07-24T10:16:32-06:00"
}
