{
  "id": "1b23322a-dd6d-4261-9448-abaf93175850",
  "title": "The split decision: IC or manager?",
  "link": "https://uxdesign.cc/the-split-decision-ic-or-manager-b3c8440b80a6?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Trip Carroll",
  "published": "Mon, 11 Nov 2024 22:14:04 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "careers",
    "product-design",
    "leadership",
    "design",
    "ux"
  ],
  "byline": "Trip Carroll",
  "length": 9918,
  "excerpt": "You are Jean-Claude Van Damme. You’re straddling two 18-wheelers careening through space while doing the splits. It’s very difficult, your groin hurts, and you could really use a strawberry Pop-tart……",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "A comic illustration of Jean-Claude Van Damme performing the splits between two eighteen wheelers careening down the highway, all while eating poptarts. Credit: Me.How to choose the right career path for you.You are Jean-Claude Van Damme. You’re straddling two 18-wheelers careening through space while doing the splits. It’s very difficult, your groin hurts, and you could really use a strawberry Pop-tart…Here’s the question that has brought on all the pain and Pop-tart cravings: “Do I continue the path of individual contributor or turn towards management?”As designers, this is a decision that we all need to face eventually. As soon as we become competent in our craft, we start to realize that we can’t straddle the gap forever.I’m still asking myself the questionWe all start our careers as ICs. But it’s around the time of Senior Designer that we’re confronted with the diverging path of IC and Manager. This is a challenging question, as both paths require totally different skillsets. I’ve often seen people move into management ill-equipped to teach, mentor, and lead their teams well. They were just good at design and wanted to move forward in their careers.I don’t want this to happen to you.Over the last three years, I have been managing a steadily growing team. I now have 5 designers and 3 engineers reporting to me. I’ve been learning a lot about what being a manager is (and what it isn’t). I’ve steadily been answering the questions that I’ve had about the transition from individual contributor to manager. And I’ve learned a lot about what it means to lead and influence others.Maybe you’re in a similar position I was, questioning what the next step in your career holds. Here are a few things that I’m learning:Let’s be thankfulDo you know how many people would have killed to be in our position 20 or 30 years ago? It’s only been relatively recently that growth in our careers as designers does not necessarily include management. Companies are realizing the importance of employing and incentivizing expert IC talent in their organization. That’s a really cool opportunity for us as UX designers.We don’t have to become managers to move forward in our careers. We can keep designing. We can keep doing the thing that we love.This was not always the case. I think it’s important that we take some time to appreciate it. We’re not in a rush, and we shouldn’t make any decisions too rashly.Leadership is not just for managersIn the book, The Servant, Hunter identifies two levers you can use as a manager to get people to do what you want: power and authority.Leadership: The skill of influencing people to work enthusiastically toward goals identified as being for the common good.Power: The ability to force or coerce someone to do your will, even if they would choose not to, because of your position or your might.Authority: The skill of getting people to willingly do your will because of your personal influence.He spends the book communicating that while using the lever of power may be necessary in some situations (firing a bad employee for instance), as leaders, we need to be practicing authority and influence in order to lead the people around us.When I read this for the first time, I found it incredibly empowering — I didn’t need a particular position to lead.If we’re to advance in our design careers, our craft, and our influence, whether we’re an individual contributor or manager, we still need to learn to lead other people well. Managers are not leaders. ICs are not leaders. Leaders are leaders. And the core of leadership is influence. That means that anyone, in any position can be a leader.Management is what you do; leadership is the person you are and the influence and impact you have upon the people you come into contact with. Management is not synonymous with leadership. Leadership is synonymous with influence…Everyone is a leader because everyone influences other people every day, for good or not so good, which is why you don’t have to be the boss to be a leader.James C Hunter, The ServantThis world needs better leaders. It needs people who can change the culture around them, people who know how to make work better (in a whole lot of different ways). We are surrounded by poor leaders, and if we’re not thoughtful and intentional with how we engage with our teams, we’ll become the part of the problem.The way that we grow in our careers as UX designers is by increasing our ability to solve complex problems, but our capacity to solve problems individually only gets us so far. It is our ability to lead and influence people around us that allows us to have a big impact.Leadership is a skill, and we can start developing it now.Let’s take a look at how leadership shows up (or doesn’t) in the two career paths that we have as UX designers.The Individual Contributor’s RoleThe Job: Solve problems.ICs make things. Their primary output is some kind of artifact. They have trained hands and minds to build things that assist in the software development process. And as more skills and experience are acquired, more leadership and influence can be exercised.UX Collective has an amazing series of interviews with Individual Contributors, Leading with Craft (with some terrific illustrations by Shreya Damle). I’d like to focus on this one interview with Madhavi Jagdish. She’s asked about the difference between lead, staff, and principal designer.The differences in my mind are mostly those of scope, responsibility and visibility.As a lead designer, your focus is the project, and your responsibilities are to ensure that you work cross-functionally with PM and Engineering to deliver high-quality work that meets deadlines and expectations.Staff designers have a broader scope, their work reaches beyond their immediate functional and cross-functional teams. They contribute to design strategy at the company, and have more visibility with leadership and executives than lead designers do.Principal designers have even more responsibility outside their teams and functions. They are seen as design leaders at the company, contributing to strategic growth not just technically, but also along the lines of team culture and growth. They use systems thinking to ensure their work can have far-reaching impact, and set the vision for the team and company’s creative work. They are also expected to have a deeper understanding of the business impact of their work and to communicate the value of research and design to executives.The level of a designer is directly related to the complexity of the problems that they’re solving. And their ability to solve complex problems is directly related to their influence over other people. A design lead influences the immediate people on their project. A staff designer influences people cross functionally. And a principal designer influences people across an entire organization.The Manager’s RoleThe Job: Protect your team.It’s the manager’s job to teach, equip, and block for the people on their team. They are responsible for their team’s output. They should be supporting and mentoring the career development of their team.This means less design, less making, and more meetings. It means learning how to understand people (and a wide variety of different types of people), and putting them into places or giving them the resources they need to be successful. That could be education and training, it could be additional experience. It could also be strategic insight so that the team member can solve the problem accurately.In my role as a manager, I view myself as a shield, protecting my team members so that they can do their best work. And while I still get the odd chance to build a component or perform user research, most managers don’t. That is their blessing and their curse. They are communicating with everyone around them so that the men and women on their teams don’t have to.This can lead to a few pitfalls. Work for a manager is meetings. It’s communication. It’s coordination. If they get caught up in that work, they may start to believe that other people have similar responsibilities. They may forget that the bulk of the work that needs to be done requires human beings to bring forth something from nothing, spending a great deal of time and effort in the creation of something new.Christopher Nguyen has some great, practical tips for being a UX manager.Meetings are not work for a designer who is making things. They’re mostly distractions. At best, a meeting is an opportunity for quick relational connection, and information sharing. The real work happens when the designer is free to think, make, and build.Similarly to an Individual Contributor, the level of a manager is directly related to the complexity of the problems they’re solving. The difference is that a manager leverages the people on their team, while an IC is able to make a much more direct contribution.Lead, No Matter Your RoleWe need more leaders. Not enough people are doing the good work of leading. And I think that too many people are waiting around to be given a title. Don’t wait for someone to hand you the “mantle of leadership.” Start right now.Care about the people you’re surrounded by. Influence the culture of the people and work around you. Cast vision for a way to make things better.You do not need to be a manager to do that. Most managers don’t do that anyway. Lead now. Do it with humility. Be genuinely interested in the people around you. Identify ways to make the culture of your work better.ResourcesThe Servant, James C. HunterYou don’t need to be “the boss” to be a leader by Matt Mayberry, Harvard Business ReviewLeading with Craft, UX CollectiveIndividual Contributor designers are cross-functional leaders by Caio Bruga, UX CollectiveHow to be a better UX manager by Christopher NguyenAffiliate Disclosure: Any Amazon links are affiliate links and help support my writing and drawing.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*RLhSuo3cid60jUqDmK8U1w.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cfigure\u003e\u003cpicture\u003e\u003csource srcset=\"https://miro.medium.com/v2/resize:fit:640/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 640w, https://miro.medium.com/v2/resize:fit:720/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 720w, https://miro.medium.com/v2/resize:fit:750/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 750w, https://miro.medium.com/v2/resize:fit:786/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 786w, https://miro.medium.com/v2/resize:fit:828/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 828w, https://miro.medium.com/v2/resize:fit:1100/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 1100w, https://miro.medium.com/v2/resize:fit:4800/format:webp/1*RLhSuo3cid60jUqDmK8U1w.jpeg 4800w\" sizes=\"(min-resolution: 4dppx) and (max-width: 700px) 50vw, (-webkit-min-device-pixel-ratio: 4) and (max-width: 700px) 50vw, (min-resolution: 3dppx) and (max-width: 700px) 67vw, (-webkit-min-device-pixel-ratio: 3) and (max-width: 700px) 65vw, (min-resolution: 2.5dppx) and (max-width: 700px) 80vw, (-webkit-min-device-pixel-ratio: 2.5) and (max-width: 700px) 80vw, (min-resolution: 2dppx) and (max-width: 700px) 100vw, (-webkit-min-device-pixel-ratio: 2) and (max-width: 700px) 100vw, 100vw\" type=\"image/webp\"/\u003e\u003csource data-testid=\"og\" srcset=\"https://miro.medium.com/v2/resize:fit:640/1*RLhSuo3cid60jUqDmK8U1w.jpeg 640w, https://miro.medium.com/v2/resize:fit:720/1*RLhSuo3cid60jUqDmK8U1w.jpeg 720w, https://miro.medium.com/v2/resize:fit:750/1*RLhSuo3cid60jUqDmK8U1w.jpeg 750w, https://miro.medium.com/v2/resize:fit:786/1*RLhSuo3cid60jUqDmK8U1w.jpeg 786w, https://miro.medium.com/v2/resize:fit:828/1*RLhSuo3cid60jUqDmK8U1w.jpeg 828w, https://miro.medium.com/v2/resize:fit:1100/1*RLhSuo3cid60jUqDmK8U1w.jpeg 1100w, https://miro.medium.com/v2/resize:fit:4800/1*RLhSuo3cid60jUqDmK8U1w.jpeg 4800w\" sizes=\"(min-resolution: 4dppx) and (max-width: 700px) 50vw, (-webkit-min-device-pixel-ratio: 4) and (max-width: 700px) 50vw, (min-resolution: 3dppx) and (max-width: 700px) 67vw, (-webkit-min-device-pixel-ratio: 3) and (max-width: 700px) 65vw, (min-resolution: 2.5dppx) and (max-width: 700px) 80vw, (-webkit-min-device-pixel-ratio: 2.5) and (max-width: 700px) 80vw, (min-resolution: 2dppx) and (max-width: 700px) 100vw, (-webkit-min-device-pixel-ratio: 2) and (max-width: 700px) 100vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003eA comic illustration of Jean-Claude Van Damme performing the splits between two eighteen wheelers careening down the highway, all while eating poptarts. Credit: \u003ca href=\"https://tripcarroll.com/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eMe\u003c/a\u003e.\u003c/figcaption\u003e\u003c/figure\u003e\u003c/p\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2 id=\"e88e\"\u003eHow to choose the right career path for you.\u003c/h2\u003e\u003cdiv\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://tripcarroll.medium.com/?source=post_page---byline--b3c8440b80a6--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Trip Carroll\" src=\"https://miro.medium.com/v2/resize:fill:88:88/1*t337SNX-E71PD41K5aBlEg.png\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003ca href=\"https://uxdesign.cc/?source=post_page---byline--b3c8440b80a6--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"UX Collective\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*mDhF9X4VO0rCrJvWFatyxg.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cp id=\"ab96\"\u003eYou are Jean-Claude Van Damme. You’re straddling two 18-wheelers careening through space while doing the splits. It’s very difficult, your groin hurts, and \u003ca href=\"https://www.indiewire.com/features/general/jean-claude-van-johnson-trailer-jcvd-amazon-series-1201718341/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eyou could really use a strawberry Pop-tart…\u003c/a\u003e\u003c/p\u003e\u003cp id=\"d386\"\u003eHere’s the question that has brought on all the pain and Pop-tart cravings: “Do I continue the path of individual contributor or turn towards management?”\u003c/p\u003e\u003cp id=\"703c\"\u003eAs designers, this is a decision that we all need to face eventually. As soon as we become competent in our craft, we start to realize that we can’t straddle the gap forever.\u003c/p\u003e\u003ch2 id=\"ea79\"\u003eI’m still asking myself the question\u003c/h2\u003e\u003cp id=\"6efa\"\u003eWe all start our careers as ICs. But it’s around the time of Senior Designer that we’re confronted with the diverging path of IC and Manager. This is a challenging question, as both paths require totally different skillsets. I’ve often seen people move into management ill-equipped to teach, mentor, and lead their teams well. They were just good at design and wanted to move forward in their careers.\u003c/p\u003e\u003cp id=\"0ac2\"\u003eI don’t want this to happen to you.\u003c/p\u003e\u003cp id=\"df10\"\u003eOver the last three years, I have been managing a steadily growing team. I now have 5 designers and 3 engineers reporting to me. I’ve been learning a lot about what being a manager is (and what it isn’t). I’ve steadily been answering the questions that I’ve had about the transition from individual contributor to manager. And I’ve learned a lot about what it means to lead and influence others.\u003c/p\u003e\u003cp id=\"6249\"\u003eMaybe you’re in a similar position I was, questioning what the next step in your career holds. Here are a few things that I’m learning:\u003c/p\u003e\u003ch2 id=\"4cdc\"\u003eLet’s be thankful\u003c/h2\u003e\u003cp id=\"ac74\"\u003eDo you know how many people would have killed to be in our position 20 or 30 years ago? It’s only been relatively recently that growth in our careers as designers does not necessarily include management. Companies are realizing the importance of employing and incentivizing expert IC talent in their organization. That’s a really cool opportunity for us as UX designers.\u003c/p\u003e\u003cp id=\"0575\"\u003eWe don’t have to become managers to move forward in our careers. We can keep designing. We can keep doing the thing that we love.\u003c/p\u003e\u003cp id=\"95ed\"\u003eThis was not always the case. I think it’s important that we take some time to appreciate it. We’re not in a rush, and we shouldn’t make any decisions too rashly.\u003c/p\u003e\u003ch2 id=\"f244\"\u003eLeadership is not just for managers\u003c/h2\u003e\u003cp id=\"537b\"\u003eIn the book, \u003cem\u003eThe Servant\u003c/em\u003e, Hunter identifies two levers you can use as a manager to get people to do what you want: power and authority.\u003c/p\u003e\u003cp id=\"0f34\"\u003e\u003cstrong\u003eLeadership\u003c/strong\u003e: The skill of influencing people to work enthusiastically toward goals identified as being for the common good.\u003c/p\u003e\u003cp id=\"50e9\"\u003e\u003cstrong\u003ePower\u003c/strong\u003e: The ability to force or coerce someone to do your will, even if they would choose not to, because of your position or your might.\u003c/p\u003e\u003cp id=\"ad45\"\u003e\u003cstrong\u003eAuthority\u003c/strong\u003e: The skill of getting people to willingly do your will because of your personal influence.\u003c/p\u003e\u003cp id=\"0c1c\"\u003eHe spends the book communicating that while using the lever of power may be necessary in some situations (firing a bad employee for instance), as leaders, we need to be practicing authority and influence in order to lead the people around us.\u003c/p\u003e\u003cp id=\"b8af\"\u003eWhen I read this for the first time, I found it incredibly empowering — \u003cstrong\u003e\u003cem\u003eI didn’t need a particular position to lead.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"8ff6\"\u003eIf we’re to advance in our design careers, our craft, and our influence, whether we’re an individual contributor or manager, \u003cem\u003ewe still need to learn to lead other people well\u003c/em\u003e. Managers are not leaders. ICs are not leaders. \u003cstrong\u003e\u003cem\u003eLeaders are leaders\u003c/em\u003e\u003c/strong\u003e. And the core of leadership is influence. That means that anyone, in any position can be a leader.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"3fc9\"\u003e\u003cem\u003eManagement is what you do; leadership is the person you are and the influence and impact you have upon the people you come into contact with. Management is not synonymous with leadership. Leadership is synonymous with influence…\u003c/em\u003e\u003c/p\u003e\u003cp id=\"2502\"\u003e\u003cem\u003eEveryone is a leader because everyone influences other people every day, for good or not so good, which is why you don’t have to be the boss to be a leader.\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"9b4f\"\u003eJames C Hunter, \u003cem\u003eThe Servant\u003c/em\u003e\u003c/p\u003e\u003cp id=\"4692\"\u003eThis world needs better leaders. It needs people who can change the culture around them, people who know how to make work better (in a whole lot of different ways). We are surrounded by poor leaders, and if we’re not thoughtful and intentional with how we engage with our teams, we’ll become the part of the problem.\u003c/p\u003e\u003cp id=\"bbc8\"\u003eThe way that we grow in our careers as UX designers is by increasing our ability to solve complex problems, but our capacity to solve problems individually only gets us so far. It is our ability to lead and influence people around us that allows us to have a big impact.\u003c/p\u003e\u003cp id=\"007f\"\u003e\u003ca href=\"https://hbr.org/2023/02/you-dont-need-to-be-the-boss-to-be-a-leader\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eLeadership is a skill, and we can start developing it now\u003c/a\u003e.\u003c/p\u003e\u003cp id=\"0469\"\u003eLet’s take a look at how leadership shows up (or doesn’t) in the two career paths that we have as UX designers.\u003c/p\u003e\u003ch2 id=\"50f0\"\u003eThe Individual Contributor’s Role\u003c/h2\u003e\u003cp id=\"56f8\"\u003e\u003cstrong\u003eThe Job: Solve problems.\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"4560\"\u003eICs make things. Their primary output is some kind of artifact. They have trained hands and minds to build things that assist in the software development process. And as more skills and experience are acquired, more leadership and influence can be exercised.\u003c/p\u003e\u003cp id=\"99f1\"\u003eUX Collective has an amazing series of interviews with Individual Contributors, \u003ca href=\"https://craft.uxdesign.cc/\" rel=\"noopener\" target=\"_blank\"\u003eLeading with Craft\u003c/a\u003e (with some \u003ca href=\"https://www.shreyadamle.com/paintings\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eterrific illustrations by Shreya Damle\u003c/a\u003e). I’d like to focus on this \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/individual-contributors-designers-are-cross-functional-leaders-9027ed032708\"\u003eone interview with Madhavi Jagdish\u003c/a\u003e. She’s asked about the difference between lead, staff, and principal designer.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"165b\"\u003e\u003cem\u003eThe differences in my mind are mostly those of scope, responsibility and visibility.\u003c/em\u003e\u003c/p\u003e\u003cp id=\"fd43\"\u003e\u003cem\u003eAs a lead designer, your focus is the project, and your responsibilities are to ensure that you work cross-functionally with PM and Engineering to deliver high-quality work that meets deadlines and expectations.\u003c/em\u003e\u003c/p\u003e\u003cp id=\"61cd\"\u003e\u003cem\u003eStaff designers have a broader scope, their work reaches beyond their immediate functional and cross-functional teams. They contribute to design strategy at the company, and have more visibility with leadership and executives than lead designers do.\u003c/em\u003e\u003c/p\u003e\u003cp id=\"1128\"\u003e\u003cem\u003ePrincipal designers have even more responsibility outside their teams and functions. They are seen as design leaders at the company, contributing to strategic growth not just technically, but also along the lines of team culture and growth. They use systems thinking to ensure their work can have far-reaching impact, and set the vision for the team and company’s creative work. They are also expected to have a deeper understanding of the business impact of their work and to communicate the value of research and design to executives.\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"325e\"\u003eThe level of a designer is directly related to the complexity of the problems that they’re solving. And their ability to solve complex problems is directly related to their influence over other people. A design lead influences the immediate people on their project. A staff designer influences people cross functionally. And a principal designer influences people across an entire organization.\u003c/p\u003e\u003ch2 id=\"e496\"\u003eThe Manager’s Role\u003c/h2\u003e\u003cp id=\"b3bc\"\u003e\u003cstrong\u003eThe Job: Protect your team.\u003c/strong\u003e\u003c/p\u003e\u003cp id=\"71a0\"\u003eIt’s the manager’s job to teach, equip, and block for the people on their team. They are responsible for their team’s output. They should be supporting and mentoring the career development of their team.\u003c/p\u003e\u003cp id=\"5375\"\u003eThis means less design, less making, and more meetings. It means learning how to understand people (and a wide variety of different types of people), and putting them into places or giving them the resources they need to be successful. That could be education and training, it could be additional experience. It could also be strategic insight so that the team member can solve the problem accurately.\u003c/p\u003e\u003cp id=\"29f1\"\u003eIn my role as a manager, I view myself as a shield, protecting my team members so that they can do their best work. And while I still get the odd chance to build a component or perform user research, most managers don’t. \u003cstrong\u003eThat is their blessing and their curse\u003c/strong\u003e. They are communicating with everyone around them so that the men and women on their teams don’t have to.\u003c/p\u003e\u003cp id=\"9cd6\"\u003eThis can lead to a few pitfalls. Work for a manager is meetings. It’s communication. It’s coordination. If they get caught up in that work, they may start to believe that other people have similar responsibilities. They may forget that the bulk of the work that needs to be done requires human beings to bring forth something from nothing, spending a great deal of time and effort in the creation of something new.\u003c/p\u003e\u003cp id=\"c13d\"\u003eChristopher Nguyen has \u003ca href=\"https://uxplaybook.org/articles/how-to-be-a-better-ux-manager\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003esome great, practical tips for being a UX manager\u003c/a\u003e.\u003c/p\u003e\u003cp id=\"08de\"\u003eMeetings are not work for a designer who is making things. They’re mostly distractions. At best, a meeting is an opportunity for quick relational connection, and information sharing. The real work happens when the designer is free to think, make, and build.\u003c/p\u003e\u003cp id=\"9081\"\u003eSimilarly to an Individual Contributor, the level of a manager is directly related to the complexity of the problems they’re solving. The difference is that a manager leverages the people on their team, while an IC is able to make a much more direct contribution.\u003c/p\u003e\u003ch2 id=\"96e1\"\u003eLead, No Matter Your Role\u003c/h2\u003e\u003cp id=\"3869\"\u003eWe need more leaders. Not enough people are doing the good work of leading. And I think that too many people are waiting around to be given a title. Don’t wait for someone to hand you the “mantle of leadership.” Start right now.\u003c/p\u003e\u003cp id=\"e256\"\u003eCare about the people you’re surrounded by. Influence the culture of the people and work around you. Cast vision for a way to make things better.\u003c/p\u003e\u003cp id=\"6748\"\u003eYou do not need to be a manager to do that. Most managers don’t do that anyway. Lead now. Do it with humility. Be genuinely interested in the people around you. Identify ways to make the culture of your work better.\u003c/p\u003e\u003ch2 id=\"281c\"\u003eResources\u003c/h2\u003e\u003cp id=\"d1c0\"\u003e\u003ca href=\"https://amzn.to/3ULpX8W\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cem\u003eThe Servant\u003c/em\u003e, James C. Hunter\u003c/a\u003e\u003c/p\u003e\u003cp id=\"a031\"\u003e\u003ca href=\"https://hbr.org/2023/02/you-dont-need-to-be-the-boss-to-be-a-leader\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eYou don’t need to be “the boss” to be a leader by Matt Mayberry, Harvard Business Review\u003c/a\u003e\u003c/p\u003e\u003cp id=\"2ee6\"\u003e\u003ca href=\"https://craft.uxdesign.cc/\" rel=\"noopener\" target=\"_blank\"\u003eLeading with Craft, UX Collective\u003c/a\u003e\u003c/p\u003e\u003cp id=\"2671\"\u003e\u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/individual-contributors-designers-are-cross-functional-leaders-9027ed032708\"\u003eIndividual Contributor designers are cross-functional leaders by Caio Bruga, UX Collective\u003c/a\u003e\u003c/p\u003e\u003cp id=\"4c4f\"\u003e\u003ca href=\"https://uxplaybook.org/articles/how-to-be-a-better-ux-manager\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eHow to be a better UX manager by Christopher Nguyen\u003c/a\u003e\u003c/p\u003e\u003cp id=\"6196\"\u003e\u003cstrong\u003e\u003cem\u003eAffiliate Disclosure:\u003c/em\u003e\u003c/strong\u003e\u003cem\u003e Any Amazon links are affiliate links and help support my writing and drawing.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-11-11T22:14:04.217Z",
  "modifiedTime": null
}
