{
  "id": "51692832-e98a-46de-80d6-154299d89877",
  "title": "The masked side of design leadership",
  "link": "https://uxdesign.cc/the-masked-side-of-design-leadership-ea3969688f2f?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Jose Coronado",
  "published": "Sat, 05 Jul 2025 14:39:47 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "growth",
    "professional-development",
    "ux",
    "design",
    "leadership"
  ],
  "byline": "Jose Coronado",
  "length": 23726,
  "excerpt": "Many in the design industry have been inspired by design leaders who created environments that enabled their teams to succeed, grow, and make a positive impact in the world. However, many of our…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "The masked side of design leadershipThe behaviors we need to break and evolveVenetian Carnaval Mask — Photo from PixabayMany in the design industry have been inspired by design leaders who created environments that enabled their teams to succeed, grow, and make a positive impact in the world. However, many of our peers, clients, and colleagues have been frustrated, burned out, and held back by leadership, which can have more negative effects.In this post, authored by in close collaboration with and his shaping tools, we decode some negative archetypes, or ‘anti-patterns,’ of design leadership and explore how you can start to improve and manage them better, as the leader yourself, or someone affected by such a leader. We are grateful to for her editorial feedback.Before diving in, we have a confession to make: when we first brainstormed ideas for this article, we were pointing fingers at others, rather than taking a close look in the mirror at our behaviors. We realized that throughout our careers, we have fallen into some of these archetypes. This article helped us reflect and think about our evolution and growth as leaders. We encourage you to reflect.Power, control, and quiet damageIn our work — whether in-house, as external management consultants, coaching, or engaging the design community — we have observed different patterns (or ‘archetypes’) of design leaders.Some of these archetypes have a more positive impact: creating an engaging culture, building high-performing teams, and delivering strong business outcomes.However, some archetypes often have more negative impacts. Design teams are burning out, feeling stuck, and frustrated. (Hey designers, they’re gaslighting you)Executives in these archetypal roles vary across industries, experience, and exposure to a wide range of situations.We share some negative archetypes, or ‘anti-patterns,’ of design leadership and offer some perspectives on what you might do about them.The characters and situations portrayed in these archetypes are illustrative, and any resemblance to real people or events is purely coincidental.6 negative leader archetypes in designHere are six negative design leader archetypes, along with suggestions on how to address them.Directive DisruptorProtective ParentSolo SolverAcademic PuristOmnipresent ImpressorMasked ManipulatorNB: These archetypes aren’t exhaustive, but their impact can be draining, and their behaviors exhausting. Some are probably familiar to you. We have amplified some of their traits for dramatic effect, but from your own experience, you may feel we are being too kind.A visual summary of where these profiles might direct their time and attention across key leadership areas is illustrated with \u0026 ’s Leadership Functions Shaping Tool.A visual summary illustrating the style of leadership these archetypes sometimes portray. The dot indicates their dominant position on the false dichotomies of design leadership styles. A healthy design leader would have some comfort ranges across these dichotomies.The Directive DisruptorThe design executive in this role looks to shake things up and show the beacon of design value to the team and the organization.Their approach is straightforward: They will plow through the existing design team and implement a new organizational design and working model. Their style is often overt, with glossy surface-level design pizazz at its core, and it is evident from the start of every single presentation.This driver-driver¹ executive only accepts their way or the highway. This type of leader may be insensitive, unsympathetic, and harsh.[1] NB: A driver-driver personality does not like chit-chat and wants information right away. Some leaders with a dominant Driver profile rarely admit when they are wrong. They can also rush to a decision without thoroughly thinking through or understanding the results or consequences of their impact. For more: Forbes — How Understanding The Four Workplace Personalities Can Change Your Office For The BetterYou might often find them referencing the power of Apple design, their previous achievements at a big FANG (Investopedia) company, or a poster-child startup. You might also hear stories of collateral damage told in hallways of conferences and private Slack channel communities from past teammates.They have already made up their mind, even before taking the time to understand the context in which the team operates. They’ll often advocate for centralized design control, hyping up those who are more overt in their tangible execution quality, rather than the deeper, complex thinkers.“Design can change the world. We’re going to use the power of Design to design a new organization, and re-Design the Insurance industry. We’ll be the Apple of Insurance.”They will bring in people from their past that they trust to show ‘what good looks like’, while pushing out those who challenge them with more complex questions and thinking.“I will reshape the structure of this leadership team, and I will bring in people I trust. We are going to show this organization what great looks like.”As new, incoming leaders to an organization, we must consider the enterprise and the design team’s context and maturity level.We must assess our leadership capabilities and understand the gaps (HBR- Leadership Self-Assessment: How Effective Are You?). If we accelerate change without understanding the organization’s needs, we risk alienating our sponsors, our partners, and our team. We inflict severe damage to the team’s culture, causing unintended exodus, a lack of psychological safety, and low morale.If you suspect you might be this kind of executive, you could ask yourself to reflect on these questions:What outcomes am I afraid of if I don’t control this?What are people saying about me behind my back?Am I acting from a place of confidence or anxiety? Is my fear masked as certainty?What story am I telling myself about what an effective leader would do in this situation?For leaders of people and individual contributors under this leadership archetype, there are limited options:Run for the exit: Let’s face it, while this may not be an easy choice, considering the economic conditions in the market, it might be your best option. You may need to keep your eyes open for opportunities with other organizations.Hide: Avoid the leader and continue working, keeping your head down, protecting your team, and focusing on the objectives and outcomes. Unfortunately, if your work and your impact are not visible, you and your team may become expendable in this leader’s view.Fight in private: You might choose to confront the new leader, stand your ground, and argue with facts. You may try to understand the underlying motivations of the change pushed by this leader. But be careful not to do this in a public forum, as you could risk being torn to pieces, and you can’t expect your fellow peers to back you up. The leader may even enjoy the friction of a heated discussion.Connect on different levels: Find a way to better connect with them on a human level and to the positive aspects of their narratives. Understand their motives, their remit, and the expectations set by whoever brought them in. Find ways to connect any lofty, shallow aspirational examples and rhetoric with real, deep work from the past or already planned for the future.Challenge softly over time: Through better understanding, if you choose to connect, you can establish more rapport to up the ante on your challenges and dull some of the incessant shallow sparkle, arming them with more reasoned ways to make their arguments to the business.The Protective ParentThe design executive in this role invests a disproportionate amount of time looking inward and downward within the design team. They nurture the design team and their needs, at the expense of the organization’s overall needs at a system level. They are also looking to please everyone, often causing churn and burnout through indecision and a perception of being two-faced.“My focus is on taking care of the team. When the team is engaged, the work takes care of itself.”“Don’t worry, I’ve got this. I’m holding the umbrella, so you don’t have to deal with the shit”Creating the right cultural conditions for the team to engage and thrive in the organization is important. However, we must balance our time investment to ensure we are building strong partnerships and creating the conditions for the team to meet the organizational needs (Forbes: 18 Overlooked Areas Leaders Should Invest More Time In). We also must invest in promoting the business impact and results of the Design team. And that doesn’t mean we have to do it all. Protecting, or even molly-coddling (at the extreme), may not do the team any favors in the long run. It can disempower them, limit their growth, and put too much on the leader’s plate.As an executive who may fall into this archetype, we need to pause and reflect on key questions:What do I fear if I focus my time outward and upward in the organization?Is it easier to be with my tribe than with people who have different values and value systems? How do I develop more empathy for those in the wider system?Who do I seek approval from?How much does my (over) protection disempower my team to learn and grow?What are the new behaviors that I need to adopt, and what behaviors do I need to drop?What are the key relationships and cross-functional partnerships that I need to develop?How do I invest in leadership coaching to continue my professional growth to meet the demands of the organization and the team?For leaders of people and individual contributors under this leadership archetype, you could consider:Express disempowerment: Explain how indecision and pleasing the many hurt and limit your ability to be effective in your role.Offer time: Talk to your leader and offer to take things off their plate. Reassure them that you will keep them updated with progress and will inform them promptly if issues arise.Seek advice and support: Look for allies or mentors in the organization to help you gain an understanding of the broader stakeholders, their pressures and motivations, and what is important to them.Share Feedback and Ask Questions: In specific situations and decisions, discuss the impact that the leader has on the team. Be open and recognize that your perspective is incomplete, and you want to understand your leader’s perspective. Ask them questions that focus on what matters, invite thoughtful reflection, and give them room to respond.The Solo SolverThis design executive collaborates with their peers and facilitates connections, but doesn’t advocate for the team. They manage up and across, with an eye towards “what’s in it for them,” while leaving the team behind.They avoid taking a strong stance to support the team and promote their wins. They are more concerned about their position and political network within the organization, rather than their own design team’s well-being and growth. The person with this profile delegates and outsources the team’s culture and growth to their direct reports while they get on with the ‘real work’.“Keep your head down, do great work, and results will speak for themselves.”As Design Executives, we are accountable for shaping the culture and vision for our teams. We must engage our leadership team in the process, defining it in a participatory manner. We also need to balance our promotion with expanding the team’s platform to gain visibility and recognition for their achievements and business impact.Design executives who see themselves with some of the characteristics of this archetype would benefit from reflecting on:Do I feel that I am not recognized and valued by my boss and my peers?Do I fear getting excluded from strategic discussions and executive forums?Do I bring people up, share the stage, and support them in building influential relationships across and up with the management team?Does my team have the platform in the organization to promote their business impact?Do I need to have more direct power in solving to be content? If so, is typical leadership right for me, or should I pursue a more Principal/Distinguished/Super Individual Contributor (IC) path?If you and your team fall under this leader archetype, you could consider:Understand Recognition: ask your leader about the last time they felt recognized and listen to the elements they share with you. You may reciprocate and share a story of your own, with different elements. Is recognition about Encouraging Words, Time Investment, Autonomy \u0026 Empowerment, Tangible Rewards, or Visibility?Articulate Business Impact: Take the initiative to showcase and promote the business impact that you and your team are generating. Share the impact with your leader, and most importantly, share it with your cross-functional partners and stakeholders.Co-create Culture: Invite your leader to proactively co-create the design team culture. Engage your leader in forums with the team, skip-level conversations, and encourage them to create meaningful moments.The Academic PuristThis design executive brings a “true \u0026 tested” way of working. They follow a formula that worked before. Often from books or posts, they wrote or are popular in design leadership. It is, in many ways, perceived as the theoretical textbook approach. It’s logical. It’s convincing. However, it lacks flexibility, pragmatism, and appreciation of human and wider system dynamics. (Forbes: Leadership Flaws: How To Combat Inflexibility)This archetype’s blind spots preclude leaders from understanding the complexity of the whole system. They move pieces around in the same manner they have done in other contexts, with a grand design, and expect to achieve similar results. The leader with this archetype is often uncomfortable with experimentation and failure.“We need to teach the business the ideal Design Process. We know the right way to do research and design; they don’t. We just have to keep telling them until they understand.”They value rigor, consistency, and proven systems, which can bring structure and discipline to a design organization. However, their resistance to change and an appreciation of relational dynamics signal a lack of adaptability, often defaulting to a “one-size-fits-all” approach. This creates potential friction with cross-functional partners and stifles innovation.A design executive who exhibits this behavior may have a fear of the unknown, a fear of failure. Here are some questions that may help us reflect and adjust our behavior:What is the underlying feeling or fear that precludes me from trying a different process or approach?What are some potential blind spots I’ve identified in the past that could creep in unexpectedly in this new environment?What does the situation require? How is this different from the common patterns in core texts? What are the different paths that we may take?How could I probe the author on the literature to understand the context of the models and frameworks, and how confident they really are in their published assertions, especially when applied to my contexts?Working with my leadership team, how can we create a culture of experimentation with small bets, calculated risk, and reward learning?What new models can I bring from complex, ambiguous environments?For leaders of people and individual contributors under this leadership archetype, you could consider:Take Calculated Risks: Identify opportunities to experiment. Take small, calculated risks to demonstrate that a different approach may open the possibilities of learning in flexible ways.Use Evidence: Share examples from other organizations, case studies, and research in a way that aligns with your leader’s mindset. You want them to be open to iteration.Expand their View: Position your ideas as an extension of what the leader values. Show respect for process and structure, while inviting adaptation and openness to evolve.The Omnipresent ImpressorThe design executives in this archetype try to excel at everything, missing the things that matter most. We observe them doing things because they think they can do them faster or better than their team. They lack trust and patience in their team (or even themselves) and in delegating to them. They try to do everything, everywhere, all at once. But they often run out of time and energy to effectively cover all the ground they would like to tackle. They stress themselves out in the process. They express to their teams and peers that they are “very busy,” making it hard to get decent time with them as they are always in meetings and workshops.The team culture suffers, and the work is also impacted. They get so close to the work in short bursts that come out of nowhere that they are perceived as micro-managers,“There is no one else who can do that. I have to get involved to ensure things are done right.”As leaders, we need to achieve a balance in how we invest our time. We need to trust our leadership team in their ability to execute with high quality and efficiently achieve the expected outcomes.If we are feeling overwhelmed and experiencing burnout, we may need to reflect on these questions:Is anxiety or fear what moves me towards this behavior?Where are my true strengths and interests? Which parts do I get bored with?How do I leverage my Design leadership team to rebalance the way I invest my time?What are the critical areas I should own, versus which I should delegate?How do I invest in my emotional intelligence, self-awareness development, and leadership growth?For leaders of people and individual contributors under this leadership archetype, you could consider:Make progress visible: Take a proactive approach and create consistent signals of progress. Build trust through rhythm, making progress visible.Invite feedback: Give your leader structured space to contribute, and then ask for space to execute.Remove ambiguity: Demonstrate competence and alignment through clarity. Show them the plan, including the priorities, and check in periodically to alleviate their fear of getting caught by surprise issues that may impact the schedule.The Masked ManipulatorThis design executive understands humanity on a conscious, deep level, and can connect on a personable and apparent caring level. This leader appeals to the good nature of the people in their team and across the organization. However, they often gaslight and put pressure on their team. They withhold and hoard information, focusing on gain and personal power. This archetype is dangerous because it is covert. It uses guilt and emotional pressure to maintain control. It frames coercion as care. This leader may have some insecurities and could feel that they are in a position way over their heads.“I care about you and your success, but I expect you to be ready to turn things around quickly, even if that requires some nights and weekend work.”As executives and leaders, we must create the conditions for psychological safety (Harvard Business School — How to build psychological safety in the workplace) and trust our teams and our partners. We should invite candid conversations, healthy challenges, or disagreements. We must empower and give autonomy to our teams.Executives who pick up signals or get feedback on these behaviors may reflect in some of these areas:Is fear, doubt, or something else making me feel insecure or vulnerable?How can I develop resiliency to help me feel more grounded and secure?Am I creating trust with my team and cross-functional partners?Are my behaviors creating toxic or safe team dynamics?Am I modeling healthy conflict?For leaders of people and individual contributors under this leadership archetype, you could consider:Anchor to shared goals: Recognize and acknowledge the emotions, then pivot to clarity and intent. Shift the conversation to grounded priorities.Focus on shared purpose: Frame your stance aligned with the mission, the team, and the goals. Acknowledge their influence while modeling maturity and principled leadership.Set boundaries: They will test your limits. Calmly hold your ground without becoming defensive. Draw a boundary that is logical, not emotional.Keep records and share with care: Keep track of what has been said to you and share back regularly. Limiting any wiggle room and gaslighting. Find ways to share this with others without exposing the manipulator publicly. Be gentle, but make it known that you will try to keep on top of any shifting sands.The Six Leadership Archetypes at a glanceReframing our role as Design Executives and LeadersThe current economic and political conditions are putting pressure on organizations. There is uncertainty and fear in the air. As leaders, we can feel the pressure and stress on our shoulders. And so, without malicious intent, we may fall into behaviors that are not positive for our teams or ourselves.These archetype profiles highlight behaviors and traits that negatively impact teams and organizations. A lack of flexibility, low emotional intelligence, or exposure to different environments and situations could explain these behaviors.Certainly, the authors can relate to drifting towards some of these archetypes in our design leadership, and so writing this has been quite therapeutic to us. It forced us to reflect on our leadership styles and ways to improve them.Periodically, we should create the space to reflect and ask:Time: What tasks or projects am I doing that should be delegated?Feedback: How could I support you / my team better?Culture: Am I creating the right conditions for my team to do their best work?Power: Am I holding power responsibly?KISS methodology: what behaviors should I Keep, Improve, Start, Stop?Development \u0026 Growth: What coaching, mentoring, or training can support my leadership growth?Leadership shaping toolsBelow, we illustrate two of the ‘Leadership Shaping Tools’ that created with .Since its development, Jason has been extending the dichotomies and using the tool in different ways. Above, we have tried to use the tools to express some of the biases and profiles of the negative archetypes, but using the tools with yourself and your team can help to identify a range of opportunities to develop, re-focus attention, and distribute power and responsibility across the team in healthier ways.Reflection tool for key Leadership FunctionsLeadership Dicotomies — reflect on your style range and dominant positioningWe are shaping culture, vision, and strategy. We must create the conditions for psychological safety, experimentation, learning, empowerment, and autonomy. Our biggest failure is not about making a bad decision; it is about building a team that does not trust us or fear us. A team that would think of us as a horrible boss. With Leadership comes power and responsibility. Power is never neutral, and we must use it with care.We invite you to reflectAs executives and leaders, what strategies of self-reflection help us understand our fears and adjust our leadership behaviors?As a team member, how do you navigate negative leadership styles and influence behavior change?About the Authors is a Design and Operations Executive. His experience spans different industries, including financial services, management consulting, retail, and enterprise technology. He helps UX teams amplify their impact and companies maximize the business value of investing in design. is a Coach, Consultant, and Connector. He helps people explore positive futures. For themselves, their organizations, and the worlds they serve. Navigating the uncertainties of their present. He does this through Creative Coaching, Strategic Consulting, Community Connection, and Shaping Designers.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*JqpBubHXT1itFSNResgZ0w.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2 id=\"279a\" data-testid=\"storyTitle\"\u003e\u003cstrong\u003eThe masked side of design leadership\u003c/strong\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2 id=\"5224\"\u003e\u003cstrong\u003eThe behaviors we need to break and evolve\u003c/strong\u003e\u003c/h2\u003e\u003cdiv tabindex=\"-1\" aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/@jcoronado1?source=post_page---byline--ea3969688f2f---------------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"Jose Coronado\" src=\"https://miro.medium.com/v2/resize:fill:64:64/1*u4YlVk_MhLVswsp5VyTERA@2x.jpeg\" width=\"32\" height=\"32\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigure\u003e\u003cfigcaption\u003eVenetian Carnaval Mask — Photo from Pixabay\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"8cbe\"\u003eMany in the design industry have been inspired by design leaders who created environments that enabled their teams to succeed, grow, and make a positive impact in the world. However, many of our peers, clients, and colleagues have been frustrated, burned out, and held back by leadership, which can have more negative effects.\u003c/p\u003e\u003cp id=\"6d03\"\u003eIn this post, authored by \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e in close collaboration with \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e and his shaping tools, we decode some negative archetypes, or ‘anti-patterns,’ of design leadership and explore how you can start to improve and manage them better, as the leader yourself, or someone affected by such a leader. We are grateful to \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e for her editorial feedback.\u003c/p\u003e\u003cp id=\"5ee0\"\u003e\u003cem\u003eBefore diving in, we have a confession to make: when we first brainstormed ideas for this article, we were pointing fingers at others, rather than taking a close look in the mirror at our behaviors. We realized that throughout our careers, we have fallen into some of these archetypes. This article helped us reflect and think about our evolution and growth as leaders. We encourage you to reflect.\u003c/em\u003e\u003c/p\u003e\u003ch2 id=\"3c9b\"\u003ePower, control, and quiet damage\u003c/h2\u003e\u003cp id=\"40ab\"\u003eIn our work — whether in-house, as external management consultants, coaching, or engaging the design community — we have observed different patterns (or ‘archetypes’) of design leaders.\u003c/p\u003e\u003cp id=\"e382\"\u003eSome of these archetypes have a more positive impact: creating an engaging culture, building high-performing teams, and delivering strong business outcomes.\u003c/p\u003e\u003cp id=\"b5e2\"\u003eHowever, some archetypes often have more negative impacts. Design teams are burning out, feeling stuck, and frustrated. (\u003ca href=\"https://medium.com/nice-work-from-active-voice/hey-designers-theyre-gaslighting-you-e02e5a4d9cff\" rel=\"noopener\"\u003eHey designers, they’re gaslighting you\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"3415\"\u003eExecutives in these archetypal roles vary across industries, experience, and exposure to a wide range of situations.\u003c/p\u003e\u003cp id=\"c8b2\"\u003eWe share some negative archetypes, or ‘anti-patterns,’ of design leadership and offer some perspectives on what you might do about them.\u003c/p\u003e\u003cp id=\"c59c\"\u003eThe characters and situations portrayed in these archetypes are illustrative, and any resemblance to real people or events is purely coincidental.\u003c/p\u003e\u003ch2 id=\"4bc3\"\u003e6 negative leader archetypes in design\u003c/h2\u003e\u003cp id=\"a688\"\u003eHere are six negative design leader archetypes, along with suggestions on how to address them.\u003c/p\u003e\u003col\u003e\u003cli id=\"cfec\"\u003eDirective Disruptor\u003c/li\u003e\u003cli id=\"c962\"\u003eProtective Parent\u003c/li\u003e\u003cli id=\"f9a4\"\u003eSolo Solver\u003c/li\u003e\u003cli id=\"12f3\"\u003eAcademic Purist\u003c/li\u003e\u003cli id=\"f552\"\u003eOmnipresent Impressor\u003c/li\u003e\u003cli id=\"c240\"\u003eMasked Manipulator\u003c/li\u003e\u003c/ol\u003e\u003cp id=\"6ac4\"\u003eNB: \u003cem\u003eThese archetypes aren’t exhaustive, but their impact can be draining, and their behaviors exhausting. Some are probably familiar to you. We have amplified some of their traits for dramatic effect, but from your own experience, you may feel we are being too kind.\u003c/em\u003e\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"98e3\"\u003eA visual summary of where these profiles might direct their time and attention across key leadership areas is illustrated with \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e \u0026amp; \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e’s Leadership Functions Shaping Tool.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"49a4\"\u003eA visual summary illustrating the style of leadership these archetypes sometimes portray. The dot indicates their dominant position on the false dichotomies of design leadership styles. A healthy design leader would have some comfort ranges across these dichotomies.\u003c/p\u003e\u003ch2 id=\"1c3f\"\u003eThe Directive Disruptor\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"1a84\"\u003eThe design executive in this role looks to shake things up and show the beacon of design value to the team and the organization.\u003c/p\u003e\u003cp id=\"b1e4\"\u003eTheir approach is straightforward: They will plow through the existing design team and implement a new organizational design and working model. Their style is often overt, with glossy surface-level design pizazz at its core, and it is evident from the start of every single presentation.\u003c/p\u003e\u003cp id=\"08bb\"\u003eThis driver-driver¹ executive only accepts their way or the highway. This type of leader may be insensitive, unsympathetic, and harsh.\u003c/p\u003e\u003cp id=\"770a\"\u003e\u003cem\u003e[1] NB: A driver-driver personality does not like chit-chat and wants information right away. Some leaders with a dominant Driver profile rarely admit when they are wrong. They can also rush to a decision without thoroughly thinking through or understanding the results or consequences of their impact. For more: \u003c/em\u003e\u003ca href=\"https://www.forbes.com/councils/theyec/2018/11/27/how-understanding-the-four-workplace-personalities-can-change-your-office-for-the-better/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003e\u003cem\u003eForbes — How Understanding The Four Workplace Personalities Can Change Your Office For The Better\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e\u003cp id=\"a84b\"\u003eYou might often find them referencing the power of Apple design, their previous achievements at a big FANG (\u003ca href=\"https://www.investopedia.com/terms/f/faang-stocks.asp\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eInvestopedia\u003c/a\u003e) company, or a poster-child startup. You might also hear stories of collateral damage told in hallways of conferences and private Slack channel communities from past teammates.\u003c/p\u003e\u003cp id=\"07f2\"\u003eThey have already made up their mind, even before taking the time to understand the context in which the team operates. They’ll often advocate for centralized design control, hyping up those who are more overt in their tangible execution quality, rather than the deeper, complex thinkers.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"abf3\"\u003e\u003cem\u003e“Design can change the world. We’re going to use the power of Design to design a new organization, and re-Design the Insurance industry. We’ll be the Apple of Insurance.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"c320\"\u003eThey will bring in people from their past that they trust to show ‘what good looks like’, while pushing out those who challenge them with more complex questions and thinking.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"f95b\"\u003e\u003cem\u003e“I will reshape the structure of this leadership team, and I will bring in people I trust. We are going to show this organization what great looks like.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"cb38\"\u003eAs new, incoming leaders to an organization, we must consider the enterprise and the design team’s context and maturity level.\u003c/p\u003e\u003cp id=\"6c97\"\u003eWe must assess our leadership capabilities and understand the gaps (\u003ca href=\"https://online.hbs.edu/blog/post/leadership-self-assessment\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eHBR- Leadership Self-Assessment: How Effective Are You?\u003c/a\u003e). If we accelerate change without understanding the organization’s needs, we risk alienating our sponsors, our partners, and our team. We inflict severe damage to the team’s culture, causing unintended exodus, a lack of psychological safety, and low morale.\u003c/p\u003e\u003cp id=\"16b2\"\u003eIf you suspect you might be this kind of executive, you could ask yourself to reflect on these questions:\u003c/p\u003e\u003cul\u003e\u003cli id=\"54a1\"\u003eWhat outcomes am I afraid of if I don’t control this?\u003c/li\u003e\u003cli id=\"fe90\"\u003eWhat are people saying about me behind my back?\u003c/li\u003e\u003cli id=\"faac\"\u003eAm I acting from a place of confidence or anxiety? Is my fear masked as certainty?\u003c/li\u003e\u003cli id=\"9b15\"\u003eWhat story am I telling myself about what an effective leader would do in this situation?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"4896\"\u003eFor leaders of people and individual contributors under this leadership archetype, there are limited options:\u003c/p\u003e\u003cul\u003e\u003cli id=\"0490\"\u003e\u003cstrong\u003eRun for the exit\u003c/strong\u003e: Let’s face it, while this may not be an easy choice, considering the economic conditions in the market, it might be your best option. You may need to keep your eyes open for opportunities with other organizations.\u003c/li\u003e\u003cli id=\"e441\"\u003e\u003cstrong\u003eHide\u003c/strong\u003e: Avoid the leader and continue working, keeping your head down, protecting your team, and focusing on the objectives and outcomes. Unfortunately, if your work and your impact are not visible, you and your team may become expendable in this leader’s view.\u003c/li\u003e\u003cli id=\"d50b\"\u003e\u003cstrong\u003eFight in private\u003c/strong\u003e: You might choose to confront the new leader, stand your ground, and argue with facts. You may try to understand the underlying motivations of the change pushed by this leader. But be careful not to do this in a public forum, as you could risk being torn to pieces, and you can’t expect your fellow peers to back you up. The leader may even enjoy the friction of a heated discussion.\u003c/li\u003e\u003cli id=\"58e5\"\u003e\u003cstrong\u003eConnect on different levels: \u003c/strong\u003eFind a way to better connect with them on a human level and to the positive aspects of their narratives. Understand their motives, their remit, and the expectations set by whoever brought them in. Find ways to connect any lofty, shallow aspirational examples and rhetoric with real, deep work from the past or already planned for the future.\u003c/li\u003e\u003cli id=\"f11b\"\u003e\u003cstrong\u003eChallenge softly over time: \u003c/strong\u003eThrough better understanding, if you choose to connect, you can establish more rapport to up the ante on your challenges and dull some of the incessant shallow sparkle, arming them with more reasoned ways to make their arguments to the business.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"1d12\"\u003eThe Protective Parent\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"e62b\"\u003eThe design executive in this role invests a disproportionate amount of time looking inward and downward within the design team. They nurture the design team and their needs, at the expense of the organization’s overall needs at a system level. They are also looking to please everyone, often causing churn and burnout through indecision and a perception of being two-faced.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"bf8f\"\u003e\u003cem\u003e“My focus is on taking care of the team. When the team is engaged, the work takes care of itself.”\u003c/em\u003e\u003c/p\u003e\u003cp id=\"63a3\"\u003e\u003cem\u003e“Don’t worry, I’ve got this. I’m holding the umbrella, so you don’t have to deal with the shit”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"3576\"\u003eCreating the right cultural conditions for the team to engage and thrive in the organization is important. However, we must balance our time investment to ensure we are building strong partnerships and creating the conditions for the team to meet the organizational needs (\u003ca href=\"https://www.forbes.com/councils/forbescoachescouncil/2024/03/07/18-overlooked-areas-leaders-should-invest-more-time-in/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eForbes: 18 Overlooked Areas Leaders Should Invest More Time In\u003c/a\u003e). We also must invest in promoting the business impact and results of the Design team. And that doesn’t mean we have to do it all. Protecting, or even molly-coddling (at the extreme), may not do the team any favors in the long run. It can disempower them, limit their growth, and put too much on the leader’s plate.\u003c/p\u003e\u003cp id=\"65b7\"\u003eAs an executive who may fall into this archetype, we need to pause and reflect on key questions:\u003c/p\u003e\u003cul\u003e\u003cli id=\"23cc\"\u003eWhat do I fear if I focus my time outward and upward in the organization?\u003c/li\u003e\u003cli id=\"09de\"\u003eIs it easier to be with my tribe than with people who have different values and value systems? How do I develop more empathy for those in the wider system?\u003c/li\u003e\u003cli id=\"0a6c\"\u003eWho do I seek approval from?\u003c/li\u003e\u003cli id=\"51e7\"\u003eHow much does my (over) protection disempower my team to learn and grow?\u003c/li\u003e\u003cli id=\"2a17\"\u003eWhat are the new behaviors that I need to adopt, and what behaviors do I need to drop?\u003c/li\u003e\u003cli id=\"f5a5\"\u003eWhat are the key relationships and cross-functional partnerships that I need to develop?\u003c/li\u003e\u003cli id=\"f39f\"\u003eHow do I invest in leadership coaching to continue my professional growth to meet the demands of the organization and the team?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"7da2\"\u003eFor leaders of people and individual contributors under this leadership archetype, you could consider:\u003c/p\u003e\u003cul\u003e\u003cli id=\"7ff4\"\u003e\u003cstrong\u003eExpress disempowerment:\u003c/strong\u003e Explain how indecision and pleasing the many hurt and limit your ability to be effective in your role.\u003c/li\u003e\u003cli id=\"6260\"\u003e\u003cstrong\u003eOffer time\u003c/strong\u003e: Talk to your leader and offer to take things off their plate. Reassure them that you will keep them updated with progress and will inform them promptly if issues arise.\u003c/li\u003e\u003cli id=\"5548\"\u003e\u003cstrong\u003eSeek advice and support:\u003c/strong\u003e Look for allies or mentors in the organization to help you gain an understanding of the broader stakeholders, their pressures and motivations, and what is important to them.\u003c/li\u003e\u003cli id=\"68e0\"\u003e\u003cstrong\u003eShare Feedback and Ask Questions\u003c/strong\u003e: In specific situations and decisions, discuss the impact that the leader has on the team. Be open and recognize that your perspective is incomplete, and you want to understand your leader’s perspective. Ask them questions that focus on what matters, invite thoughtful reflection, and give them room to respond.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"4108\"\u003eThe Solo Solver\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"dc28\"\u003eThis design executive collaborates with their peers and facilitates connections, but doesn’t advocate for the team. They manage up and across, with an eye towards “what’s in it for them,” while leaving the team behind.\u003c/p\u003e\u003cp id=\"809e\"\u003eThey avoid taking a strong stance to support the team and promote their wins. They are more concerned about their position and political network within the organization, rather than their own design team’s well-being and growth. The person with this profile delegates and outsources the team’s culture and growth to their direct reports while they get on with the ‘real work’.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"ba15\"\u003e“Keep your head down, do great work, and results will speak for themselves.”\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"3be5\"\u003eAs Design Executives, we are accountable for shaping the culture and vision for our teams. We must engage our leadership team in the process, defining it in a participatory manner. We also need to balance our promotion with expanding the team’s platform to gain visibility and recognition for their achievements and business impact.\u003c/p\u003e\u003cp id=\"380b\"\u003eDesign executives who see themselves with some of the characteristics of this archetype would benefit from reflecting on:\u003c/p\u003e\u003cul\u003e\u003cli id=\"f86a\"\u003eDo I feel that I am not recognized and valued by my boss and my peers?\u003c/li\u003e\u003cli id=\"1b93\"\u003eDo I fear getting excluded from strategic discussions and executive forums?\u003c/li\u003e\u003cli id=\"048d\"\u003eDo I bring people up, share the stage, and support them in building influential relationships across and up with the management team?\u003c/li\u003e\u003cli id=\"1d61\"\u003eDoes my team have the platform in the organization to promote their business impact?\u003c/li\u003e\u003cli id=\"164b\"\u003eDo I need to have more direct power in solving to be content? If so, is typical leadership right for me, or should I pursue a more Principal/Distinguished/Super Individual Contributor (IC) path?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"1f47\"\u003eIf you and your team fall under this leader archetype, you could consider:\u003c/p\u003e\u003cul\u003e\u003cli id=\"f348\"\u003e\u003cstrong\u003eUnderstand Recognition\u003c/strong\u003e: ask your leader about the last time they felt recognized and listen to the elements they share with you. You may reciprocate and share a story of your own, with different elements. Is recognition about Encouraging Words, Time Investment, Autonomy \u0026amp; Empowerment, Tangible Rewards, or Visibility?\u003c/li\u003e\u003cli id=\"ed76\"\u003e\u003cstrong\u003eArticulate Business Impact\u003c/strong\u003e: Take the initiative to showcase and promote the business impact that you and your team are generating. Share the impact with your leader, and most importantly, share it with your cross-functional partners and stakeholders.\u003c/li\u003e\u003cli id=\"df44\"\u003e\u003cstrong\u003eCo-create Culture\u003c/strong\u003e: Invite your leader to proactively co-create the design team culture. Engage your leader in forums with the team, skip-level conversations, and encourage them to create meaningful moments.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"7ead\"\u003eThe Academic Purist\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"848a\"\u003eThis design executive brings a “true \u0026amp; tested” way of working. They follow a formula that worked before. Often from books or posts, they wrote or are popular in design leadership. It is, in many ways, perceived as the theoretical textbook approach. It’s logical. It’s convincing. However, it lacks flexibility, pragmatism, and appreciation of human and wider system dynamics. (\u003ca href=\"https://www.forbes.com/councils/forbescoachescouncil/2019/11/26/leadership-flaws-how-to-combat-inflexibility/\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eForbes: Leadership Flaws: How To Combat Inflexibility\u003c/a\u003e)\u003c/p\u003e\u003cp id=\"6d98\"\u003eThis archetype’s blind spots preclude leaders from understanding the complexity of the whole system. They move pieces around in the same manner they have done in other contexts, with a grand design, and expect to achieve similar results. The leader with this archetype is often uncomfortable with experimentation and failure.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"c821\"\u003e\u003cem\u003e“We need to teach the business the ideal Design Process. We know the right way to do research and design; they don’t. We just have to keep telling them until they understand.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"bb02\"\u003eThey value rigor, consistency, and proven systems, which can bring structure and discipline to a design organization. However, their resistance to change and an appreciation of relational dynamics signal a lack of adaptability, often defaulting to a “one-size-fits-all” approach. This creates potential friction with cross-functional partners and stifles innovation.\u003c/p\u003e\u003cp id=\"de6d\"\u003eA design executive who exhibits this behavior may have a fear of the unknown, a fear of failure. Here are some questions that may help us reflect and adjust our behavior:\u003c/p\u003e\u003cul\u003e\u003cli id=\"ef5d\"\u003eWhat is the underlying feeling or fear that precludes me from trying a different process or approach?\u003c/li\u003e\u003cli id=\"8188\"\u003eWhat are some potential blind spots I’ve identified in the past that could creep in unexpectedly in this new environment?\u003c/li\u003e\u003cli id=\"152e\"\u003eWhat does the situation require? How is this different from the common patterns in core texts? What are the different paths that we may take?\u003c/li\u003e\u003cli id=\"e9fb\"\u003eHow could I probe the author on the literature to understand the context of the models and frameworks, and how confident they really are in their published assertions, especially when applied to my contexts?\u003c/li\u003e\u003cli id=\"ff1a\"\u003eWorking with my leadership team, how can we create a culture of experimentation with small bets, calculated risk, and reward learning?\u003c/li\u003e\u003cli id=\"4be6\"\u003eWhat new models can I bring from complex, ambiguous environments?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"88e5\"\u003eFor leaders of people and individual contributors under this leadership archetype, you could consider:\u003c/p\u003e\u003cul\u003e\u003cli id=\"d6f9\"\u003e\u003cstrong\u003eTake Calculated Risks\u003c/strong\u003e: Identify opportunities to experiment. Take small, calculated risks to demonstrate that a different approach may open the possibilities of learning in flexible ways.\u003c/li\u003e\u003cli id=\"75d8\"\u003e\u003cstrong\u003eUse Evidence\u003c/strong\u003e: Share examples from other organizations, case studies, and research in a way that aligns with your leader’s mindset. You want them to be open to iteration.\u003c/li\u003e\u003cli id=\"7e56\"\u003e\u003cstrong\u003eExpand their View\u003c/strong\u003e: Position your ideas as an extension of what the leader values. Show respect for process and structure, while inviting adaptation and openness to evolve.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"a424\"\u003eThe Omnipresent Impressor\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"b3ff\"\u003eThe design executives in this archetype try to excel at everything, missing the things that matter most. We observe them doing things because they think they can do them faster or better than their team. They lack trust and patience in their team (or even themselves) and in delegating to them. They try to do everything, everywhere, all at once. But they often run out of time and energy to effectively cover all the ground they would like to tackle. They stress themselves out in the process. They express to their teams and peers that they are “very busy,” making it hard to get decent time with them as they are always in meetings and workshops.\u003c/p\u003e\u003cp id=\"f81c\"\u003eThe team culture suffers, and the work is also impacted. They get so close to the work in short bursts that come out of nowhere that they are perceived as micro-managers,\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"212f\"\u003e\u003cem\u003e“There is no one else who can do that. I have to get involved to ensure things are done right.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"272c\"\u003eAs leaders, we need to achieve a balance in how we invest our time. We need to trust our leadership team in their ability to execute with high quality and efficiently achieve the expected outcomes.\u003c/p\u003e\u003cp id=\"811d\"\u003eIf we are feeling overwhelmed and experiencing burnout, we may need to reflect on these questions:\u003c/p\u003e\u003cul\u003e\u003cli id=\"d29f\"\u003eIs anxiety or fear what moves me towards this behavior?\u003c/li\u003e\u003cli id=\"1ef6\"\u003eWhere are my true strengths and interests? Which parts do I get bored with?\u003c/li\u003e\u003cli id=\"467b\"\u003eHow do I leverage my Design leadership team to rebalance the way I invest my time?\u003c/li\u003e\u003cli id=\"177e\"\u003eWhat are the critical areas I should own, versus which I should delegate?\u003c/li\u003e\u003cli id=\"c4f3\"\u003eHow do I invest in my emotional intelligence, self-awareness development, and leadership growth?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"d0e3\"\u003eFor leaders of people and individual contributors under this leadership archetype, you could consider:\u003c/p\u003e\u003cul\u003e\u003cli id=\"d9cb\"\u003e\u003cstrong\u003eMake progress visible\u003c/strong\u003e: Take a proactive approach and create consistent signals of progress. Build trust through rhythm, making progress visible.\u003c/li\u003e\u003cli id=\"a55d\"\u003e\u003cstrong\u003eInvite feedback\u003c/strong\u003e: Give your leader structured space to contribute, and then ask for space to execute.\u003c/li\u003e\u003cli id=\"0ac2\"\u003e\u003cstrong\u003eRemove ambiguity\u003c/strong\u003e: Demonstrate competence and alignment through clarity. Show them the plan, including the priorities, and check in periodically to alleviate their fear of getting caught by surprise issues that may impact the schedule.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"6533\"\u003eThe Masked Manipulator\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"93a5\"\u003eThis design executive understands humanity on a conscious, deep level, and can connect on a personable and apparent caring level. This leader appeals to the good nature of the people in their team and across the organization. However, they often gaslight and put pressure on their team. They withhold and hoard information, focusing on gain and personal power. This archetype is dangerous because it is covert. It uses guilt and emotional pressure to maintain control. It frames coercion as care. This leader may have some insecurities and could feel that they are in a position way over their heads.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"c8e9\"\u003e\u003cem\u003e“I care about you and your success, but I expect you to be ready to turn things around quickly, even if that requires some nights and weekend work.”\u003c/em\u003e\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"810a\"\u003eAs executives and leaders, we must create the conditions for psychological safety (\u003ca href=\"https://online.hbs.edu/blog/post/psychological-safety-in-the-workplace\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eHarvard Business School — How to build psychological safety in the workplace\u003c/a\u003e) and trust our teams and our partners. We should invite candid conversations, healthy challenges, or disagreements. We must empower and give autonomy to our teams.\u003c/p\u003e\u003cp id=\"942b\"\u003eExecutives who pick up signals or get feedback on these behaviors may reflect in some of these areas:\u003c/p\u003e\u003cul\u003e\u003cli id=\"f6a7\"\u003eIs fear, doubt, or something else making me feel insecure or vulnerable?\u003c/li\u003e\u003cli id=\"db54\"\u003eHow can I develop resiliency to help me feel more grounded and secure?\u003c/li\u003e\u003cli id=\"e1ed\"\u003eAm I creating trust with my team and cross-functional partners?\u003c/li\u003e\u003cli id=\"3c5a\"\u003eAre my behaviors creating toxic or safe team dynamics?\u003c/li\u003e\u003cli id=\"5d2c\"\u003eAm I modeling healthy conflict?\u003c/li\u003e\u003c/ul\u003e\u003cp id=\"2874\"\u003eFor leaders of people and individual contributors under this leadership archetype, you could consider:\u003c/p\u003e\u003cul\u003e\u003cli id=\"b0c9\"\u003e\u003cstrong\u003eAnchor to shared goals\u003c/strong\u003e: Recognize and acknowledge the emotions, then pivot to clarity and intent. Shift the conversation to grounded priorities.\u003c/li\u003e\u003cli id=\"6176\"\u003e\u003cstrong\u003eFocus on shared purpose\u003c/strong\u003e: Frame your stance aligned with the mission, the team, and the goals. Acknowledge their influence while modeling maturity and principled leadership.\u003c/li\u003e\u003cli id=\"6676\"\u003e\u003cstrong\u003eSet boundaries\u003c/strong\u003e: They will test your limits. Calmly hold your ground without becoming defensive. Draw a boundary that is logical, not emotional.\u003c/li\u003e\u003cli id=\"418a\"\u003e\u003cstrong\u003eKeep records and share with care:\u003c/strong\u003e Keep track of what has been said to you and share back regularly. Limiting any wiggle room and gaslighting. Find ways to share this with others without exposing the manipulator publicly. Be gentle, but make it known that you will try to keep on top of any shifting sands.\u003c/li\u003e\u003c/ul\u003e\u003ch2 id=\"43ee\"\u003eThe Six Leadership Archetypes at a glance\u003c/h2\u003e\u003cfigure\u003e\u003c/figure\u003e\u003ch2 id=\"628e\"\u003eReframing our role as Design Executives and Leaders\u003c/h2\u003e\u003cp id=\"420b\"\u003eThe current economic and political conditions are putting pressure on organizations. There is uncertainty and fear in the air. As leaders, we can feel the pressure and stress on our shoulders. And so, without malicious intent, we may fall into behaviors that are not positive for our teams or ourselves.\u003c/p\u003e\u003cp id=\"e880\"\u003eThese archetype profiles highlight behaviors and traits that negatively impact teams and organizations. A lack of flexibility, low emotional intelligence, or exposure to different environments and situations could explain these behaviors.\u003c/p\u003e\u003cp id=\"0422\"\u003eCertainly, the authors can relate to drifting towards some of these archetypes in our design leadership, and so writing this has been quite therapeutic to us. It forced us to reflect on our leadership styles and ways to improve them.\u003c/p\u003e\u003cp id=\"0865\"\u003ePeriodically, we should create the space to reflect and ask:\u003c/p\u003e\u003col\u003e\u003cli id=\"dd4c\"\u003e\u003cstrong\u003eTime\u003c/strong\u003e: What tasks or projects am I doing that should be delegated?\u003c/li\u003e\u003cli id=\"a3f3\"\u003e\u003cstrong\u003eFeedback\u003c/strong\u003e: How could I support you / my team better?\u003c/li\u003e\u003cli id=\"1270\"\u003e\u003cstrong\u003eCulture\u003c/strong\u003e: Am I creating the right conditions for my team to do their best work?\u003c/li\u003e\u003cli id=\"55a5\"\u003e\u003cstrong\u003ePower\u003c/strong\u003e: Am I holding power responsibly?\u003c/li\u003e\u003cli id=\"1ade\"\u003e\u003cstrong\u003eKISS methodology\u003c/strong\u003e: what behaviors should I Keep, Improve, Start, Stop?\u003c/li\u003e\u003cli id=\"a2d3\"\u003e\u003cstrong\u003eDevelopment \u0026amp; Growth\u003c/strong\u003e: What coaching, mentoring, or training can support my leadership growth?\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"de14\"\u003eLeadership shaping tools\u003c/h2\u003e\u003cp id=\"f24d\"\u003eBelow, we illustrate two of the ‘\u003cem\u003eLeadership Shaping Tools\u003c/em\u003e’ that \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003cp\u003e created with \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003c/span\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp id=\"b8cc\"\u003eSince its development, Jason has been extending the dichotomies and using the tool in different ways. Above, we have tried to use the tools to express some of the biases and profiles of the negative archetypes, but using the tools with yourself and your team can help to identify a range of opportunities to develop, re-focus attention, and distribute power and responsibility across the team in healthier ways.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eReflection tool for key Leadership Functions\u003c/figcaption\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cfigcaption\u003eLeadership Dicotomies — reflect on your style range and dominant positioning\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"272a\"\u003eWe are shaping culture, vision, and strategy. We must create the conditions for psychological safety, experimentation, learning, empowerment, and autonomy. Our biggest failure is not about making a bad decision; it is about building a team that does not trust us or fear us. A team that would think of us as a horrible boss. With Leadership comes power and responsibility. Power is never neutral, and we must use it with care.\u003c/p\u003e\u003ch2 id=\"ab78\"\u003eWe invite you to reflect\u003c/h2\u003e\u003cp id=\"f3af\"\u003eAs executives and leaders, what strategies of self-reflection help us understand our fears and adjust our leadership behaviors?\u003c/p\u003e\u003cp id=\"e29a\"\u003eAs a team member, how do you navigate negative leadership styles and influence behavior change?\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"89b2\"\u003eAbout the Authors\u003c/h2\u003e\u003cp\u003e is a Design and Operations Executive. His experience spans different industries, including financial services, management consulting, retail, and enterprise technology. He helps UX teams amplify their impact and companies maximize the business value of investing in design.\u003c/p\u003e\u003cp\u003e is a Coach, Consultant, and Connector. He helps people explore positive futures. For themselves, their organizations, and the worlds they serve. Navigating the uncertainties of their present. He does this through \u003cstrong\u003eCreative Coaching\u003c/strong\u003e, \u003cstrong\u003eStrategic Consulting\u003c/strong\u003e, \u003cstrong\u003eCommunity Connection\u003c/strong\u003e, and \u003cstrong\u003eShaping Designers\u003c/strong\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "25 min read",
  "publishedTime": "2025-07-05T14:39:47.251Z",
  "modifiedTime": null
}
