{
  "id": "d9c40b13-4085-47af-8381-6ce273c82a75",
  "title": "How designers create alignment",
  "link": "https://uxdesign.cc/how-designers-create-alignment-f3f11c36a16c?source=rss----138adf9c44c---4",
  "description": "",
  "author": "Ed Orozco",
  "published": "Mon, 07 Oct 2024 11:12:01 GMT",
  "source": "https://uxdesign.cc/feed",
  "categories": [
    "ux",
    "strategic-design",
    "leadership",
    "design",
    "project-management"
  ],
  "byline": "Ed Orozco",
  "length": 8305,
  "excerpt": "The truth is, projects ship late because the team is not aligned. Alignment is the most important indicator of whether projects get done on time. Alignment is a collection of agreements on what…",
  "siteName": "UX Collective",
  "favicon": "https://miro.medium.com/v2/resize:fill:256:256/1*dn6MbbIIlwobt0jnUcrt_Q.png",
  "text": "Alignment is a design superpower that keeps teams focused and projects on track.We’ve all been there: Projects that drag on forever and never ship.PMs blame designers, designers blame devs, and devs blame lawyers.The truth is, projects ship late because the team is not aligned. Alignment is the most important indicator of whether projects get done on time.Aligned teams ship great productsAlignment is a collection of agreements on what everyone should do, how, and when. Aligned teams run like clockwork. Everyone chips in their part and the work keeps moving along smoothly.Misaligned teams are a different story. There’s no clarity around who should do what or what the next steps should be. People waste time on assumptions and the work gets delayed.Alignment is a design superpowerDesign has the power to create alignment at multiple levels. To understand how, let’s look at the three key moments in which alignment happens:When deciding what to work on — strategic alignmentAt the beginning of a project — operational alignmentThroughout the project — tactical alignmentAlignment before the project startsA design strategy helps you decide what to work on. It creates an exciting north star to aim towards. Usually design collaborates with product and management to create that vision.Julie Zhuo wrote a great piece on strategic alignment a while back.Imagine your team is wildly successful in 3 years. What does that look like? Write down your answer. Now, turn to your neighbor and ask him or her the same question. When you compare your answers, how similar or different are they?They shouldn’t be different. You both work on the same team. — How to be strategic, Julie Zhuo (2018)Julie’s quote is proposing a simple test to check for strategic alignment. You know your team is strategically aligned if they know what the mid to long-term goal is and can articulate it.The way you create strategic alignment depends on the size of your organization and the culture. Designers at companies like Github and Ramp create artifacts that showcase what the product might look like in 2–3 years. They present that to the whole company and constantly remind every one of it during company-wide meetings. Those artifacts could be design prototypes, illustrations, or videos.It doesn’t necessarily have to be a super production. A strategic alignment artifact can also be an image or a sentence. The simpler it is, the easier it is to remember.Alignment at the start of a projectWith a clear design strategy, designers and PMs can decide which problem to solve next. If you have a system for continuous, quality learning, this tends to be a lot easier.To align everyone around the problem you intent to solve, the PM will usually create some kind of one-pager or brief. While this is the responsibility of the PM, the best designers I know own the process and meaningfully contribute to it.Getting this step right is crucial. It doesn’t have to be complicated, yet so many teams half-ass it or ignore it completely. Here’s an example:# Problem descriptionCustomers have multiple accounts for different purposes. It's difficult and time-consuming having to log out of one account and log into another. Especially when most of them have 5 or more accounts. There's no way to see aggregate data across accounts.# Why should we fix itWe charge our customers based on each account's usage. If we don't make it easy for them to use all their accounts, we earn less per customer.# What do we know from customersMost customers have between 3-5 accounts. About a quarter of them have more than 7. Johnny from Company A said\u003e I need to check the performance of all my accounts every morning. Having 8 accounts means this process takes up to 1 hour each day.Arjun from Company B said\u003e It'd be great if I could aggregate the data of all my accounts in one place. # What have we tried beforeWe tried merging all the data into a single account but users wantto keep the data separate.The above example communicates:What the problem isWhy is it worth solvingWhat you shouldn’t spend time onNow that everyone knows which problem to focus on and what it looks like, it’s time to start working on it.Alignment throughout the projectTactical alignment is the result of everyone in the team knowing what the pending tasks in a project are, which ones should be done next, by whom, and how.Making sure the team stays aligned for the entire project is no easy feat. In fact there’s an entire industry around project management tools worth $7.5 billions and growing.There’s no shortage of tools: Asana, Jira, Monday.com, Wrike, Linear and a whole bunch of others.But of course, tools are useless without the right habits in place. As projects progress, some tasks become irrelevant or outdated. Many don’t have an owner and they are not prioritized based on importance.I’m a big believer in the power of simplicity. Modern humans live their lives feeling overwhelmed and most project management tools throw too much information at us all at once. They are useful, but also create cognitive overload.So I want to share something that’s been incredibly helpful for my projects. They’re called product development journals.Product development journalsI’ve found keeping a simple journal is tremendously helpful to maintain alignment throughout projects. This product development journal serves as the team’s collective memory.How many times have you made a decision about a feature with a colleague only to forget what it was a week later?Product development journals are a simple way to capture important decisions and agreements on what to do next without increasing the cognitive load.Keeping a product development journalIn a document that everyone has access too, create a text-based timeline of each conversation. Each entry should include:The date of the discussionWhat the decision wasWhat the next steps areWhenever you have a conversation regarding the project, write a new entry. Someone needs to be in charge of writing the entry and if they are not present, someone else should be appointed the task. I personally like to take responsibility for writing the entry myself.Here’s an example of what an entry might look like:4 October 2024 · @anna, @jonas, and @rick agreed to use the card component as the basis of the widgets instead of introducing a new component into the design system.Next steps:· @anna will design the way the card component shows stats· @jonas will create a new API endpoint to serve the stats· @rick will wait for the designs and the API before starting the front-end codeI have been writing these journals in Notion for years and only recently started keeping them in Linear. You can create documents in the header of a Linear project. For us that’s the perfect location since that’s where our team manages its tasks. If you don’t use Linear, try figuring out where your journal will be most visible for the team.You can create documents in the header of Linear projects. You can also link to a Notion page if you rather keep your journal there.If someone forgets why the team decided X, they can go back in the journal and read about it. It’s also great when a new person joins the project. They can quickly get up to speed by reading the journal.“The project journal is a valuable part of any work journal because it captures project-specific reflections and notes. Within each work journal, I have multiple project journals: dedicated pages for every defined project at the company.“— Using a work journal to create design case studies, Tanner Christensen (2022)How not to keep a product development journalDo not keep a journal in an app nobody uses or a place that’s hard to find. The journal should be shareable with a link and everyone should be able to access it quickly.Also, make sure everyone in the team can edit it. You don’t want people to start collecting information outside the journal as that won’t benefit the rest of the team.TakeawaysAlignment is making sure everyone knows who’s responsible for what and what the next steps are. It helps teams finish projects on time. Design can play a decisive role in creating alignment before, at the start and throughout projects. As a designer or PM, you can use product development journals to keep your team aligned during projects.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*IB-eElcfiA5_rJQGZxseAw.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ch2 id=\"33a3\"\u003eAlignment is a design superpower that keeps teams focused and projects on track.\u003c/h2\u003e\u003cdiv\u003e\u003ca href=\"https://edorozco.medium.com/?source=post_page-----f3f11c36a16c--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003cp\u003e\u003cimg alt=\"Ed Orozco\" src=\"https://miro.medium.com/v2/resize:fill:88:88/1*XYfHlT3x6Tji2882Q0w5Wg.png\" width=\"44\" height=\"44\" loading=\"lazy\" data-testid=\"authorPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003ca href=\"https://uxdesign.cc/?source=post_page-----f3f11c36a16c--------------------------------\" rel=\"noopener follow\"\u003e\u003cdiv aria-hidden=\"false\"\u003e\u003cp\u003e\u003cimg alt=\"UX Collective\" src=\"https://miro.medium.com/v2/resize:fill:48:48/1*mDhF9X4VO0rCrJvWFatyxg.png\" width=\"24\" height=\"24\" loading=\"lazy\" data-testid=\"publicationPhoto\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigure\u003e\u003c/figure\u003e\u003cp id=\"96fc\"\u003eWe’ve all been there: Projects that drag on forever and never ship.\u003c/p\u003e\u003cp id=\"f16c\"\u003ePMs blame designers, designers blame devs, and devs blame lawyers.\u003c/p\u003e\u003cp id=\"08fe\"\u003eThe truth is, projects ship late because the team is not aligned. Alignment is the most important indicator of whether projects get done on time.\u003c/p\u003e\u003ch2 id=\"1040\"\u003eAligned teams ship great products\u003c/h2\u003e\u003cp id=\"bf7d\"\u003eAlignment is a collection of agreements on what everyone should do, how, and when. Aligned teams run like clockwork. Everyone chips in their part and the work keeps moving along smoothly.\u003c/p\u003e\u003cp id=\"9c27\"\u003eMisaligned teams are a different story. There’s no clarity around who should do what or what the next steps should be. People waste time on assumptions and the work gets delayed.\u003c/p\u003e\u003ch2 id=\"d6b3\"\u003eAlignment is a design superpower\u003c/h2\u003e\u003cp id=\"74ea\"\u003eDesign has the power to create alignment at multiple levels. To understand how, let’s look at the three key moments in which alignment happens:\u003c/p\u003e\u003col\u003e\u003cli id=\"61fb\"\u003eWhen deciding what to work on — strategic alignment\u003c/li\u003e\u003cli id=\"3103\"\u003eAt the beginning of a project — operational alignment\u003c/li\u003e\u003cli id=\"199a\"\u003eThroughout the project — tactical alignment\u003c/li\u003e\u003c/ol\u003e\u003ch2 id=\"ad49\"\u003eAlignment before the project starts\u003c/h2\u003e\u003cp id=\"528f\"\u003eA \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/what-is-design-strategy-and-why-do-you-need-it-8120b6eddbf3\"\u003edesign strategy\u003c/a\u003e helps you decide what to work on. It creates an exciting north star to aim towards. Usually design collaborates with product and management to create that vision.\u003c/p\u003e\u003cp id=\"d745\"\u003e\u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/u/b8a4e5ae7490?source=post_page-----f3f11c36a16c--------------------------------\" rel=\"noopener\" target=\"_blank\"\u003eJulie Zhuo\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e wrote a great piece on strategic alignment a while back.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"686b\"\u003eImagine your team is wildly successful in 3 years. What does that look like? Write down your answer. Now, turn to your neighbor and ask him or her the same question. When you compare your answers, how similar or different are they?\u003c/p\u003e\u003cp id=\"a8e9\"\u003eThey shouldn’t be different. You both work on the same team. — \u003ca href=\"https://medium.com/the-year-of-the-looking-glass/how-to-be-strategic-f6630a44f86b\" rel=\"noopener\"\u003eHow to be strategic\u003c/a\u003e, \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/u/b8a4e5ae7490?source=post_page-----f3f11c36a16c--------------------------------\" rel=\"noopener\" target=\"_blank\"\u003eJulie Zhuo\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e (2018)\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"de25\"\u003eJulie’s quote is proposing a simple test to check for strategic alignment. You know your team is strategically aligned if they know what the mid to long-term goal is and can articulate it.\u003c/p\u003e\u003cp id=\"c618\"\u003eThe way you create strategic alignment depends on the size of your organization and the culture. Designers at companies like \u003ca href=\"https://www.youtube.com/watch?v=o9JRH2wH8a8\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eGithub\u003c/a\u003e and \u003ca href=\"https://www.youtube.com/watch?v=aNJDZ_RzTVk\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eRamp\u003c/a\u003e create artifacts that showcase what the product might look like in 2–3 years. They present that to the whole company and constantly remind every one of it during company-wide meetings. Those artifacts could be design prototypes, illustrations, or videos.\u003c/p\u003e\u003cp id=\"6ac5\"\u003eIt doesn’t necessarily have to be a super production. A strategic alignment artifact can also be an image or a sentence. The simpler it is, the easier it is to remember.\u003c/p\u003e\u003ch2 id=\"c077\"\u003eAlignment at the start of a project\u003c/h2\u003e\u003cp id=\"21b6\"\u003eWith a clear design strategy, designers and PMs can decide which problem to solve next. If you have a \u003ca rel=\"noopener\" target=\"_blank\" href=\"https://uxdesign.cc/strategic-ux-research-doesnt-need-fancy-tools-04274eb54657/#2cea\"\u003esystem for continuous, quality learning\u003c/a\u003e, this tends to be a lot easier.\u003c/p\u003e\u003cp id=\"8402\"\u003eTo align everyone around the problem you intent to solve, the PM will usually create some kind of one-pager or brief. While this is the responsibility of the PM, the best designers I know own the process and meaningfully contribute to it.\u003c/p\u003e\u003cp id=\"e77d\"\u003eGetting this step right is crucial. It doesn’t have to be complicated, yet so many teams half-ass it or ignore it completely. Here’s an example:\u003c/p\u003e\u003cpre\u003e\u003cspan id=\"f734\"\u003e# Problem description\u003cbr/\u003eCustomers have multiple accounts for different purposes. It\u0026#39;s difficult and time-consuming having to log out of one account and log into another. Especially when most of them have 5 or more accounts. There\u0026#39;s no way to see aggregate data across accounts.\u003c/span\u003e\u003cspan id=\"86d7\"\u003e# Why should we fix it\u003cbr/\u003eWe charge our customers based on each account\u0026#39;s usage. If we don\u0026#39;t make it easy for them to use all their accounts, we earn less per customer.\u003c/span\u003e\u003cspan id=\"7618\"\u003e# What do we know from customers\u003cbr/\u003eMost customers have between 3-5 accounts. About a quarter of them have more than 7. \u003c/span\u003e\u003cspan id=\"b5c5\"\u003eJohnny from Company A said\u003cbr/\u003e\u0026gt; I need to check the performance of all my accounts every morning. Having 8 accounts means this process takes up to 1 hour each day.\u003c/span\u003e\u003cspan id=\"e15d\"\u003eArjun from Company B said\u003cbr/\u003e\u0026gt; It\u0026#39;d be great if I could aggregate the data of all my accounts in one place. \u003c/span\u003e\u003cspan id=\"4904\"\u003e# What have we tried before\u003cbr/\u003eWe tried merging all the data into a single account but users want\u003cbr/\u003eto keep the data separate.\u003c/span\u003e\u003c/pre\u003e\u003cp id=\"9651\"\u003eThe above example communicates:\u003c/p\u003e\u003col\u003e\u003cli id=\"b81f\"\u003eWhat the problem is\u003c/li\u003e\u003cli id=\"019e\"\u003eWhy is it worth solving\u003c/li\u003e\u003cli id=\"92e6\"\u003eWhat you shouldn’t spend time on\u003c/li\u003e\u003c/ol\u003e\u003cp id=\"c409\"\u003eNow that everyone knows which problem to focus on and what it looks like, it’s time to start working on it.\u003c/p\u003e\u003ch2 id=\"7823\"\u003e\u003cstrong\u003eAlignment throughout the project\u003c/strong\u003e\u003c/h2\u003e\u003cp id=\"fb21\"\u003eTactical alignment is the result of everyone in the team knowing what the pending tasks in a project are, which ones should be done next, by whom, and how.\u003c/p\u003e\u003cp id=\"cda6\"\u003eMaking sure the team stays aligned for the entire project is no easy feat. In fact there’s an \u003ca href=\"https://www.futuremarketinsights.com/reports/project-management-software-market\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eentire industry around project management tools worth $7.5 billions and growing\u003c/a\u003e.\u003c/p\u003e\u003cp id=\"3dee\"\u003eThere’s no shortage of tools: Asana, Jira, Monday.com, Wrike, Linear and a whole bunch of others.\u003c/p\u003e\u003cp id=\"0572\"\u003eBut of course, tools are useless without the right habits in place. As projects progress, some tasks become irrelevant or outdated. Many don’t have an owner and they are not prioritized based on importance.\u003c/p\u003e\u003cp id=\"11e6\"\u003eI’m a big believer in the power of simplicity. \u003ca href=\"https://www.youtube.com/watch?v=gzLPa6NbcrE\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eModern humans live their lives feeling overwhelmed\u003c/a\u003e and most project management tools throw too much information at us all at once. They are useful, but also create cognitive overload.\u003c/p\u003e\u003cp id=\"0b80\"\u003eSo I want to share something that’s been incredibly helpful for my projects. They’re called product development journals.\u003c/p\u003e\u003ch2 id=\"4d33\"\u003eProduct development journals\u003c/h2\u003e\u003cp id=\"bddf\"\u003eI’ve found keeping a simple journal is tremendously helpful to maintain alignment throughout projects. This product development journal serves as the team’s collective memory.\u003c/p\u003e\u003cp id=\"e466\"\u003eHow many times have you made a decision about a feature with a colleague only to forget what it was a week later?\u003c/p\u003e\u003cp id=\"1879\"\u003eProduct development journals are a simple way to capture important decisions and agreements on what to do next without increasing the cognitive load.\u003c/p\u003e\u003ch2 id=\"fe64\"\u003eKeeping a product development journal\u003c/h2\u003e\u003cp id=\"66d1\"\u003eIn a document that everyone has access too, create a text-based timeline of each conversation. Each entry should include:\u003c/p\u003e\u003col\u003e\u003cli id=\"a582\"\u003eThe date of the discussion\u003c/li\u003e\u003cli id=\"5c84\"\u003eWhat the decision was\u003c/li\u003e\u003cli id=\"9edc\"\u003eWhat the next steps are\u003c/li\u003e\u003c/ol\u003e\u003cp id=\"5546\"\u003eWhenever you have a conversation regarding the project, write a new entry. Someone needs to be in charge of writing the entry and if they are not present, someone else should be appointed the task. I personally like to take responsibility for writing the entry myself.\u003c/p\u003e\u003cp id=\"7650\"\u003eHere’s an example of what an entry might look like:\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"d40d\"\u003e4 October 2024 · @anna, @jonas, and @rick agreed to use the card component as the basis of the widgets instead of introducing a new component into the design system.\u003c/p\u003e\u003cp id=\"672f\"\u003eNext steps:\u003cbr/\u003e· @anna will design the way the card component shows stats\u003cbr/\u003e· @jonas will create a new API endpoint to serve the stats\u003cbr/\u003e· @rick will wait for the designs and the API before starting the front-end code\u003c/p\u003e\u003c/blockquote\u003e\u003cp id=\"aae5\"\u003eI have been writing these journals in Notion for years and only recently started keeping them in Linear. You can create documents in the header of a Linear project. For us that’s the perfect location since that’s where our team manages its tasks. If you don’t use Linear, try figuring out where your journal will be most visible for the team.\u003c/p\u003e\u003cfigure\u003e\u003cfigcaption\u003eYou can create documents in the header of Linear projects. You can also link to a Notion page if you rather keep your journal there.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp id=\"fdc3\"\u003eIf someone forgets why the team decided X, they can go back in the journal and read about it. It’s also great when a new person joins the project. They can quickly get up to speed by reading the journal.\u003c/p\u003e\u003cblockquote\u003e\u003cp id=\"3d4e\"\u003e“The project journal is a valuable part of any work journal because it captures project-specific reflections and notes. Within each work journal, I have multiple project journals: dedicated pages for every defined project at the company.“— \u003ca href=\"https://www.tannerchristensen.com/notes/using-a-work-journal-to-create-design-case-studies\" rel=\"noopener ugc nofollow\" target=\"_blank\"\u003eUsing a work journal to create design case studies\u003c/a\u003e, \u003cspan\u003e\u003cspan aria-hidden=\"false\"\u003e\u003ca href=\"https://medium.com/u/e184f9feff12?source=post_page-----f3f11c36a16c--------------------------------\" rel=\"noopener\" target=\"_blank\"\u003eTanner Christensen\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e (2022)\u003c/p\u003e\u003c/blockquote\u003e\u003ch2 id=\"7e35\"\u003eHow not to keep a product development journal\u003c/h2\u003e\u003cp id=\"658b\"\u003eDo not keep a journal in an app nobody uses or a place that’s hard to find. The journal should be shareable with a link and everyone should be able to access it quickly.\u003c/p\u003e\u003cp id=\"001f\"\u003eAlso, make sure everyone in the team can edit it. You don’t want people to start collecting information outside the journal as that won’t benefit the rest of the team.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003ch2 id=\"b1a3\"\u003eTakeaways\u003c/h2\u003e\u003cp id=\"d098\"\u003eAlignment is making sure everyone knows who’s responsible for what and what the next steps are. It helps teams finish projects on time. Design can play a decisive role in creating alignment before, at the start and throughout projects. As a designer or PM, you can use product development journals to keep your team aligned during projects.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-10-07T11:12:01.426Z",
  "modifiedTime": null
}
