{
  "id": "f181a19d-5bb2-424b-9aa0-29d064e9c33d",
  "title": "Foldable Smartphones: New Devices, New Opportunities",
  "link": "https://www.nngroup.com/articles/foldable-smartphones/",
  "description": "Two types of foldable smartphones blur the boundaries between traditional device sizes. Fold-out and flip phones create new viewports that hint at future smartphones.",
  "author": "Feifei Liu",
  "published": "Fri, 10 Jan 2025 18:00:00 +0000",
  "source": "https://www.nngroup.com/feed/rss/",
  "categories": [
    "Article"
  ],
  "byline": "Feifei Liu",
  "length": 10840,
  "excerpt": "Two types of foldable smartphones blur the boundaries between traditional device sizes. Fold-out and flip phones create new viewports that hint at future smartphones.",
  "siteName": "Nielsen Norman Group",
  "favicon": "",
  "text": "Summary:  Two types of foldable smartphones blur the boundaries between traditional device sizes. Fold-out and flip phones create new viewports that hint at future smartphones. Mobile phones have evolved dramatically, with displays growing from 1.5–2.5 inches pre iPhone to 6.1–6.8 inches today. However, this growth has practical limits, as larger screens compromise single-handed use and portability. It has led to mobile-device specialization, with a range of sizes from large tablets to tiny smartwatches, each with different benefits and use cases. Recently, a new type of smartphone that leverages the technology of bendable screens has emerged; the foldable smartphone may reduce the need to own multiple mobile devices. Fold-Out Phones vs. Flip Phones Foldable Phone Growing in Popularity Two Viewports in One Device New Angles Enable New Interaction Dynamics Recommendations for Designers Fold-Out Phones vs. Flip Phones There are two types of foldable smartphones: flip phones and fold-out phones. The key difference lies in the folding direction and their possible sizes. Fold-out phones are horizontally folding devices that unfold into tablet-sized screens, offering a larger viewing area with bendable, double-wide screens. When folded, the outer screen works like a regular smartphone screen. A flip phone is a vertically folding device (like a clamshell) that expands to a standard phone size when unfolded. When folded, flip phones are compact — about half the size of a typical smartphone. Many flip phones include a small cover screen that mimics the functionality of a smartwatch. Fold-out phones (left) and flip phones (right) are two different types of foldable phones. Readers older than Gen Z may remember the original “flip phones” that were popular in the mid 1990s to the early 2000s. Unlike modern flip phones, those had tiny screens, physical keyboards, and no external screen when closed. However, modern flip phones do mimic the classic clamshell design.   The Samsung Galaxy Z Fold 5 is a fold-out phone: when closed, it is about the size of a regular smartphone. When the phone is opened, its size is close to a tablet   The Samsung Galaxy Z Flip 6 is a flip phone: When closed (left), only a small exterior screen is visible, and the device is conveniently pocket-sized. When the phone is opened (right), it resembles more traditional modern smartphones in its screen size.  Types of Foldable Phone   Folding Direction Smallest Screen Size Largest Screen Size Fold-out phones Horizontal 6-7 inches (smartphone) 7.6-10.2 inches(tablet) Flip phones Vertical 1.5-3 inches(smartwatch) 6-7 inches(smartphone) These two categories represent most currently available foldable phones. However, bendable screens aren’t limited to single fold. Recently, Huawei, a Chinese phone manufacturer, made headlines by launching the world’s first tri-fold phone, drawing considerable attention to this emerging field. Huawei’s latest tri-fold phone allows users to unfold the phone 2 times, providing users with three sizes: a single-panel mode, a dual-screen mode, and a fully unfolded mode. Foldable Phone Growing in Popularity Manufacturers have been attempting to deliver foldable devices since the 2010s, but technological limitations held them back. Early attempts had a variety of usability issues, including bulky designs, poorly aligned screens, or gaps between screens. Modern foldable phones are vastly more seamless and successfully implemented, thanks to flexible OLED panels, complex hinges, and screen layers that protect from damage after repeated folding. Foldable phones are still fairly novel and not widely adopted. However, the foldable smartphone market has been growing in popularity and market penetration. According to Statista, the global market share of foldable smartphones has grown from 0.5% in 2021 to 1.6% in 2023, and TrendForce has predicted the market penetration is expected to reach nearly 5% by 2028. There are regional differences in the foldable phone adoption rate: according to CINNO, China is the world’s biggest foldable-smartphone market, with a 4.1% market penetration rate. In late 2024, rumors started to circulate about Apple working on a foldable iPhone. Two Viewports in One Device Fold-Out Phones: A Full Screen Comparable to Tablets Fold-out phones blur the lines between smartphones and tablets. When unfolded, the full-sized screen offers significant advantages for tasks requiring a larger viewport or a combination of multiple apps. For example, participants in our research found that the larger viewport was useful for tasks like: Watching movies or shows Reading and editing documents (like blueprints) Checking grocery lists (with bigger fonts) In our study with owners of foldable smartphones, an engineer working at construction sites shared how he used his folded-out phone for his work: “I visit sites and need to review building plans with onsite workers frequently. I used to carry an iPad, but it was inconvenient — holding an iPad in one hand, a briefcase in the other, and struggling to answer my phone. Now, I just use my foldable phone. I download plans in real time, unfold the screen, and share it with workers like it’s a tablet.” Additionally, fold-out phones support multitasking, with the ability to split the screen into multiple windows. This feature allows users to view and interact with multiple apps simultaneously, increasing the complexity of tasks they can accomplish on phones. In this example, the search result pages of Apple Watch on two different apps, Best Buy (left) and Walmart (right), are displayed side by side on a fold-out phone in a split-screen view. The same engineer mentioned he often used the split-screen view to open both overview plans and detailed drawings side by side, enhancing collaboration with colleagues. A study participant used his fold-out phone to share the construction prints with workers on construction sites (top) and to browse an overall plan and access detail specs at the same time (split-screen view, bottom). Multitasking cases that can benefit from the larger screens of fold-out phones include: Performing secondary tasks at the same time with a main task, such as replying to text messages during video calls or checking stock performances. Combining information from multiple sources. For instance, comparing product prices on 2 ecommerce apps, editing files based on email instructions, checking calendar availability to reply to emails, or page parking.   A study participant compared the price of a robot vacuum on 2 major Chinese ecommerce platforms, Taobao and JD, by opening both apps side-by-side and running the same search in each app simultaneously. The larger screen also provides accessibility benefits: it helps users with visual impairments to read text and view content and is particularly helpful for older adults. Flip Phones: A Compact, Smartwatch-Like Cover Screen Unlike fold-out phones, the outer screens of flip phones are relatively small (ranging from 1.5 to 3.4 inches). These screens are similar to smartwatches, providing users with quick access to basic information, such as notifications, reminders, and quick actions. Samsung’s Z Flip series demonstrates how manufacturers can enhance the cover screen experience by allowing users to interact with widgets specifically designed for smaller displays. For example, users can customize the calendar widget and preview their day’s events directly from the cover screen. The Samsung Z Flip 6 phone allowed users to choose different sizes of the calendar widget shown on the cover screen (top). People could view the selected widget style and preview the events scheduled on that day (bottom). New Angles Enable New Interaction Dynamics In addition to new screen sizes, the physical process of folding the screen in or out creates new angles of interaction. For example, the flexibility of positioning the two screens at different angles opens up opportunities for tasks like typing and photography. Typing: Some fold-out phones can be positioned at a 90-degree angle to mimic a mini-laptop, with the bottom half acting as a keyboard and the top half as a screen. Photography: Fold-out and flip phones can be adjusted to a half-folded position, with one half as a base and the other half used to frame shots. This setup enabled users to take photos from angles that are difficult to achieve with a standard phone. A study participant used the “hover” position (making the phone fold to 90 degrees) to type, mimicking a laptop. During the Paris 2024 Paralympics Games, victory photos were taken with Samsung Z Flip 6 phones in fully-folded (left) mode and hover mode (half-folded, right), demonstrating their versatility (images from Samsung). Recommendations for Designers Foldable smartphones represent a growing trend. While the market remains relatively small, the ability to combine multiple devices into one makes these phones increasingly nonnegligible. App designers should start preparing for this new class of devices by ensuring usability across different screen sizes. Set breakpoints wisely: Foldable smartphones may have unconventional screen sizes compared to standard phones or tablets. Check how your app performs on different screen sizes of the most popular foldable models. If the app struggles to support key tasks on these devices, adjust breakpoints accordingly to maintain usability. Account for different interaction modes: Users can treat the same device differently when using different modes of foldable devices. For instance, they may operate fold-out phones with two hands in the full-screen mode but rely on single-hand operation when the device is folded. Fitts’s Law tells us that interaction costs change based on the distance to a target, especially on larger screens. When adapting your app for a tablet-size display, consider increasing target sizes to offset the higher interaction cost caused by the larger screen. Ensure consistency among screen versions: With foldable phones, users can access multiple screen sizes for the same app on a single device. This reinforces the need for consistency across app versions. If primary workflows differ significantly between screen sizes, users may feel as if they need to relearn the app each time they switch modes. To avoid this friction, maintain a consistent experience across both small and large screens. Designing for foldable devices means thinking beyond traditional breakpoints. UX practitioners must consider new patterns of interaction, screen-switching behaviors, and multitasking opportunities. As the market for foldable phones grows, the need to design seamless, cross-screen experiences will become even more essential.",
  "image": "https://media.nngroup.com/media/articles/opengraph_images/Social-Card-Foldable-Smartphones-opengraph.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003cspan\u003e\n                  Summary: \n                \u003c/span\u003eTwo types of foldable smartphones blur the boundaries between traditional device sizes. Fold-out and flip phones create new viewports that hint at future smartphones.\n              \u003c/p\u003e\u003cdiv\u003e\n              \u003cp\u003eMobile phones have evolved dramatically, with displays growing from 1.5–2.5 inches pre iPhone to 6.1–6.8 inches today. However, this growth has practical limits, as larger screens compromise single-handed use and portability. It has led to mobile-device specialization, with a range of sizes from large tablets to tiny smartwatches, each with different benefits and use cases.\u003c/p\u003e\n\u003cp\u003eRecently, a new type of smartphone that leverages the technology of bendable screens has emerged; the foldable smartphone may reduce the need to own multiple mobile devices.\u003c/p\u003e\n\u003cdiv\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-fold-out-phones-vs-flip-phones-1\"\u003eFold-Out Phones vs. Flip Phones\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-foldable-phone-growing-in-popularity-2\"\u003eFoldable Phone Growing in Popularity\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-two-viewports-in-one-device-3\"\u003eTwo Viewports in One Device\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-new-angles-enable-new-interaction-dynamics-4\"\u003eNew Angles Enable New Interaction Dynamics\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"#toc-recommendations-for-designers-5\"\u003eRecommendations for Designers\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003ch2 id=\"toc-fold-out-phones-vs-flip-phones-1\"\u003eFold-Out Phones vs. Flip Phones\u003c/h2\u003e\n\u003cp\u003eThere are two types of foldable smartphones: flip phones and fold-out phones. The key difference lies in the folding direction and their possible sizes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFold-out phones \u003c/strong\u003eare horizontally folding devices that unfold into tablet-sized screens, offering a larger viewing area with bendable, double-wide screens. When folded, the outer screen works like a regular smartphone screen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eA flip phone \u003c/strong\u003eis a vertically folding device (like a clamshell) that expands to a standard phone size when unfolded. When folded, flip phones are compact — about half the size of a typical smartphone. Many flip phones include a small cover screen that mimics the functionality of a smartwatch.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg alt=\"Fold-out phones (left) and flip phones (right) are two different types of foldable phones.\" height=\"450\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/18/foldablesmartphone-images-annotated.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eFold-out phones (left) and flip phones (right) are two different types of foldable phones.\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eReaders older than Gen Z may remember the original “flip phones” that were popular in the mid 1990s to the early 2000s. Unlike modern flip phones, those had tiny screens, physical keyboards, and no external screen when closed. However, modern flip phones do mimic the classic clamshell design.\u003c/p\u003e\n\u003cfigure\u003e\n\u003cvideo controls=\"controls\" poster=\"https://media.nngroup.com/media/editor/2024/12/16/foldoutphone-thumbnail.png\" src=\"https://media.nngroup.com/media/editor/2024/12/16/foldoutphone-demo-annotated-compressed.mp4\" title=\"\" width=\"350\"\u003e \u003c/video\u003e\n\u003cfigcaption\u003e\u003cem\u003eThe Samsung Galaxy Z Fold 5 is a \u003cstrong\u003efold-out phone\u003c/strong\u003e: when closed, it is about the size of a regular smartphone. When the phone is opened, its size is close to a tablet\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\n\u003cvideo controls=\"controls\" poster=\"https://media.nngroup.com/media/editor/2024/12/16/flipphone_thumbnail.jpg\" src=\"https://media.nngroup.com/media/editor/2024/12/16/flipphone_demo_trimmed_compressed_2.mp4\" title=\"\" width=\"350\"\u003e \u003c/video\u003e\n\u003cfigcaption\u003e\u003cem\u003eThe Samsung Galaxy Z Flip 6 is a \u003cstrong\u003eflip phone\u003c/strong\u003e: When closed (left), only a small exterior screen is visible, and the device is conveniently pocket-sized. When the phone is opened (right), it resembles more traditional modern smartphones in its screen size. \u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch4\u003eTypes of Foldable Phone\u003c/h4\u003e\n\u003ctable\u003e\n\u003ctbody\u003e\n\u003ctr\u003e\n\u003ctd\u003e \u003c/td\u003e\n\u003ctd\u003eFolding Direction\u003c/td\u003e\n\u003ctd\u003eSmallest Screen Size\u003c/td\u003e\n\u003ctd\u003eLargest Screen Size\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eFold-out phones\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eHorizontal\u003c/td\u003e\n\u003ctd\u003e6-7 inches (smartphone)\u003c/td\u003e\n\u003ctd\u003e7.6-10.2 inches(tablet)\u003c/td\u003e\n\u003c/tr\u003e\n\u003ctr\u003e\n\u003ctd\u003e\u003cstrong\u003eFlip phones\u003c/strong\u003e\u003c/td\u003e\n\u003ctd\u003eVertical\u003c/td\u003e\n\u003ctd\u003e1.5-3 inches(smartwatch)\u003c/td\u003e\n\u003ctd\u003e6-7 inches(smartphone)\u003c/td\u003e\n\u003c/tr\u003e\n\u003c/tbody\u003e\n\u003c/table\u003e\n\u003cp\u003eThese two categories represent most currently available foldable phones. However, bendable screens aren’t limited to single fold. Recently, Huawei, a Chinese phone manufacturer, made headlines by launching the \u003cstrong\u003eworld’s first tri-fold phone\u003c/strong\u003e, drawing considerable attention to this emerging field.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"338\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/huawei-trifoldphone.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eHuawei’s latest tri-fold phone allows users to unfold the phone 2 times, providing users with three sizes: a single-panel mode, a dual-screen mode, and a fully unfolded mode.\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch2 id=\"toc-foldable-phone-growing-in-popularity-2\"\u003eFoldable Phone Growing in Popularity\u003c/h2\u003e\n\u003cp\u003eManufacturers have been attempting to deliver foldable devices since the 2010s, but technological limitations held them back. Early attempts had a variety of usability issues, including bulky designs, poorly aligned screens, or gaps between screens.\u003c/p\u003e\n\u003cp\u003eModern foldable phones are vastly more seamless and successfully implemented, thanks to flexible OLED panels, complex hinges, and screen layers that protect from damage after repeated folding.\u003c/p\u003e\n\u003cp\u003eFoldable phones are still fairly novel and not widely adopted. However, the foldable smartphone market has been growing in popularity and market penetration. According to \u003ca href=\"https://www.statista.com/statistics/1293547/smartphone-shipments-worldwide-forecast/\"\u003eStatista\u003c/a\u003e, the global market share of \u003cstrong\u003efoldable smartphones has grown from\u003c/strong\u003e \u003cstrong\u003e0.5% in 2021 to 1.6% in 2023\u003c/strong\u003e, and \u003ca href=\"https://www.trendforce.com/presscenter/news/20240603-12170.html\"\u003eTrendForce\u003c/a\u003e has predicted the market penetration is expected to reach nearly 5% by 2028. There are regional differences in the foldable phone adoption rate: \u003ca href=\"https://www.scmp.com/tech/big-tech/article/3287400/huaweis-foldable-smartphone-sales-nearly-double-third-quarter-says-report\"\u003eaccording to CINNO\u003c/a\u003e, China is the world’s biggest foldable-smartphone market, with a 4.1% market penetration rate. In late 2024, rumors started to circulate about Apple working on a foldable iPhone.\u003c/p\u003e\n\u003ch2 id=\"toc-two-viewports-in-one-device-3\"\u003eTwo Viewports in One Device\u003c/h2\u003e\n\u003ch3\u003eFold-Out Phones: A Full Screen Comparable to Tablets\u003c/h3\u003e\n\u003cp\u003eFold-out phones blur the lines between smartphones and tablets. When unfolded, the full-sized screen offers significant \u003cstrong\u003eadvantages for\u003c/strong\u003e \u003cstrong\u003etasks requiring a larger viewport \u003c/strong\u003eor a combination of multiple apps. For example, participants in our research found that the larger viewport was useful for tasks like:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWatching movies or shows\u003c/li\u003e\n\u003cli\u003eReading and editing documents (like blueprints)\u003c/li\u003e\n\u003cli\u003eChecking grocery lists (with bigger fonts)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIn our study with owners of foldable smartphones, an engineer working at construction sites shared how he used his folded-out phone for his work:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cem\u003e“I visit sites and need to review building plans with onsite workers frequently. I used to carry an iPad, but it was inconvenient — holding an iPad in one hand, a briefcase in the other, and struggling to answer my phone. Now, I just use my foldable phone. I download plans in real time, unfold the screen, and share it with workers like it’s a tablet.”\u003c/em\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eAdditionally, fold-out phones support \u003ca href=\"https://www.nngroup.com/articles/multitasking-mobile/\"\u003e\u003cstrong\u003emultitasking\u003c/strong\u003e\u003c/a\u003e, with the ability to split the screen into multiple windows. This feature allows users to view and interact with multiple apps simultaneously, increasing the complexity of tasks they can accomplish on phones.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"831\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/samsung_splitscreen.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eIn this example, the search result pages of \u003c/em\u003eApple Watch \u003cem\u003eon two different apps, Best Buy (left) and Walmart (right), are displayed side by side on a fold-out phone in a split-screen view.\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThe same engineer mentioned he often used the \u003cstrong\u003esplit-screen view\u003c/strong\u003e to open both overview plans and detailed drawings side by side, enhancing collaboration with colleagues.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"772\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/split-fullscreen.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eA study participant used his fold-out phone to share the construction prints with workers on construction sites (top) and to browse an overall plan and access detail specs at the same time (split-screen view, bottom).\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eMultitasking cases that can benefit from the larger screens of fold-out phones include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePerforming secondary tasks at the same time with a main task\u003c/strong\u003e, such as replying to text messages during video calls or checking stock performances.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eCombining information from multiple sources\u003c/strong\u003e. For instance, comparing product prices on 2 ecommerce apps, editing files based on email instructions, checking calendar availability to reply to emails, or \u003ca href=\"https://www.nngroup.com/articles/multi-tab-page-parking/\"\u003e\u003cstrong\u003epage parking\u003c/strong\u003e\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cfigure\u003e\n\u003cvideo controls=\"controls\" poster=\"https://media.nngroup.com/media/editor/2024/12/16/comparison-p5-thumbnail-compressed.jpg\" src=\"https://media.nngroup.com/media/editor/2024/12/16/comparison-p5-annotated-compressed-2.mp4\" title=\"\" width=\"692\"\u003e \u003c/video\u003e\n\u003cfigcaption\u003e\u003cem\u003eA study participant compared the price of a robot vacuum on 2 major Chinese ecommerce platforms, Taobao and JD, by opening both apps side-by-side and running the same search in each app simultaneously.\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cp\u003eThe larger screen also provides \u003cstrong\u003eaccessibility benefits:\u003c/strong\u003e it helps users with visual impairments to read text and view content and is particularly helpful for older adults.\u003c/p\u003e\n\u003ch3\u003eFlip Phones: A Compact, Smartwatch-Like Cover Screen\u003c/h3\u003e\n\u003cp\u003eUnlike fold-out phones, the outer screens of flip phones are relatively small (ranging from 1.5 to 3.4 inches). These screens are similar to \u003ca href=\"https://www.nngroup.com/articles/smartwatch-interactions/\"\u003e\u003cstrong\u003esmartwatches, \u003c/strong\u003eproviding users with quick access to basic information\u003c/a\u003e, such as notifications, reminders, and quick actions.\u003c/p\u003e\n\u003cp\u003eSamsung’s \u003cstrong\u003eZ Flip series\u003c/strong\u003e demonstrates how manufacturers can enhance the \u003cstrong\u003ecover screen experience\u003c/strong\u003e by allowing users to interact with widgets specifically designed for smaller displays. For example, users can customize the calendar widget and preview their day’s events directly from the cover screen.\u003c/p\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"1128\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/flipphone-2views.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eThe Samsung Z Flip 6 phone allowed users to choose different sizes of the calendar widget shown on the cover screen (top). People could view the selected widget style and preview the events scheduled on that day (bottom).\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch2 id=\"toc-new-angles-enable-new-interaction-dynamics-4\"\u003eNew Angles Enable New Interaction Dynamics\u003c/h2\u003e\n\u003cp\u003eIn addition to new screen sizes, the physical process of folding the screen in or out creates new angles of interaction. For example, the\u003cstrong\u003e flexibility of\u003c/strong\u003e \u003cstrong\u003epositioning the two screens at different angles \u003c/strong\u003eopens up opportunities for tasks like typing and photography.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eTyping\u003c/strong\u003e: Some fold-out phones can be positioned at a 90-degree angle to mimic a mini-laptop, with the bottom half acting as a keyboard and the top half as a screen.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003ePhotography:\u003c/strong\u003e Fold-out and flip phones can be adjusted to a half-folded position, with one half as a base and the other half used to frame shots. This setup enabled users to take photos from angles that are difficult to achieve with a standard phone.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"397\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/hoverstatus-foldoutphone.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eA study participant used the “hover” position (making the phone fold to 90 degrees) to type, mimicking a laptop.\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003cfigure\u003e\u003cimg alt=\"\" height=\"314\" loading=\"lazy\" src=\"https://media.nngroup.com/media/editor/2024/12/13/samsungflipphone_olympics.jpg\" width=\"692\"/\u003e\n\u003cfigcaption\u003e\u003cem\u003eDuring the Paris 2024 Paralympics Games, victory photos were taken with Samsung Z Flip 6 phones in fully-folded (left) mode and hover mode (half-folded, right), demonstrating their versatility (\u003ca href=\"https://news.samsung.com/us/samsung-paris-2024-paralympians-share-new-view-medal-winning-moments-reimagined-victory-selfie-powered-by-galaxy-z-flip6-olympic-edition/\"\u003eimages from Samsung\u003c/a\u003e).\u003c/em\u003e\u003c/figcaption\u003e\n\u003c/figure\u003e\n\u003ch2 id=\"toc-recommendations-for-designers-5\"\u003eRecommendations for Designers\u003c/h2\u003e\n\u003cp\u003eFoldable smartphones represent a growing trend. While the market remains relatively small, the ability to combine multiple devices into one makes these phones increasingly nonnegligible. \u003cstrong\u003eApp designers should start preparing\u003c/strong\u003e for this new class of devices by ensuring usability across different screen sizes.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eSet \u003c/strong\u003e\u003ca href=\"https://www.nngroup.com/articles/breakpoints-in-responsive-design/\"\u003e\u003cstrong\u003ebreakpoints\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e wisely\u003c/strong\u003e: Foldable smartphones may have unconventional screen sizes compared to standard phones or tablets. Check how your app performs on different screen sizes of the most popular foldable models. If the app struggles to support key tasks on these devices, adjust breakpoints accordingly to maintain usability.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eAccount for different interaction modes\u003c/strong\u003e: Users can treat the same device differently when using different modes of foldable devices. For instance, they may operate fold-out phones with two hands in the full-screen mode but rely on single-hand operation when the device is folded. \u003ca href=\"https://www.nngroup.com/articles/fitts-law/\"\u003eFitts’s Law\u003c/a\u003e tells us that interaction costs change based on the distance to a target, especially on larger screens. When adapting your app for a tablet-size display, consider \u003cstrong\u003eincreasing target sizes\u003c/strong\u003e to offset the higher \u003ca href=\"https://www.nngroup.com/articles/interaction-cost-definition/\"\u003einteraction cost\u003c/a\u003e caused by the larger screen.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eEnsure consistency among screen versions\u003c/strong\u003e: With foldable phones, users can access multiple screen sizes for the same app on a single device. This reinforces the need for consistency across app versions. If primary workflows differ significantly between screen sizes, users may feel as if they need to \u003cstrong\u003erelearn the app\u003c/strong\u003e each time they switch modes. To avoid this friction, \u003ca href=\"https://www.nngroup.com/articles/consistency-and-standards/\"\u003emaintain a consistent experience\u003c/a\u003e across both small and large screens.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesigning for foldable devices means thinking beyond traditional breakpoints. UX practitioners must consider new patterns of interaction, screen-switching behaviors, and multitasking opportunities. As the market for foldable phones grows, the need to design seamless, cross-screen experiences will become even more essential.\u003c/p\u003e\n            \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-01-10T18:00:00Z",
  "modifiedTime": null
}
