{
  "id": "daddace3-f954-46c8-abbd-c7dde373a3a1",
  "title": "The 19th Century Odyssey of Japan’s Nakahama Manjirō",
  "link": "http://www.historyisnowmagazine.com/blog/2025/7/10/the-19th-century-odyssey-of-japans-nakahama-manjir",
  "description": "The Tokugawa period of Japan limited foreign trade beginning in the 17th century. For example, Chinese traders were restricted to the port of Nagasaki or through indirect routes like the Ryūkū Islands. Dutch traders also became the only Europeans allowed to enter Japan. Similarly, Japanese people were not permitted to go abroad. Those who resided in another country and returned to Japan could face the death penalty. These policies lasted for over 200 years. Yet, at least one Japanese person made it to the United States and back again during this time.Michael Mirra explains. Manjiro Nakahama.Five Fishermen from JapanOn Japan’s island Shikoku, a 13-year-old boy named Manjirō lived in a village called Nakanohama (now part of the city Tosashimizu). His father had died when he was eight or nine years old. To support his mother and siblings, Manjirō got a job on a fishing expedition. The crew consisted of three brothers named Fudenojo (37), Jusuke (24), and Goemon (15), and their neighbor Toraemon (25). They set sail on January 5, 1841 in search of either bonito, mackerel, or tuna. The trip was expected to last only a few days.A storm hit the five fishermen on the second or third day. They were about twenty miles from the coast of Japan. Fighting the wind while trying to make it back to land, their sculling oarlock broke off and soon their sculling oar broke in half. Propelling the boat was no longer in their control.The boat was blown off course for three or four days and the fishermen ran out of provisions. Around January 13th, they finally spotted an island. It was the small and uninhabited Izu-Torishima (also known as “Bird Island”) a few hundred miles from the mainland. They were unable to find a beach to land the boat and decided to swim for it. Right before jumping in, a high wave overturned the boat and injured Jusuke’s leg, but all made it to land.Manjirō turned 14 years old a couple of weeks later as the crew attempted to survive on the island. Fudenojo cared for Jusuke in their cave shelter while the others searched for food. Shellfish and seaweed could be gathered. Albatross were also plentiful until their migration season began in late April or early May. However, there was no spring water or edible plants on land.  A Ship from New England On June 27th, a whaling ship appeared near the island. The John Howland had sailed from New Bedford, Massachusetts and was now sending two boats to the island in search of turtles to eat. As the boats approached, its members noticed Goemon, Manjirō, and Toraemon waving their clothes attached to sticks and shouting for help. The whalers could not understand anything that the trapped fishermen were saying, but recognized that they were distressed and hungry. All five castaways were taken aboard.From there, the John Howland sailed to the north Pacific in search of whales for oil and baleens. Unlike Japanese whalers, the Americans discarded the rest of the whale. Through attempted sign language and eventually learning some English words, the rescued fisherman were able to communicate with the whalers and were given chores aboard the ship. Manjirō was assigned to the crow’s nest to look for whales in the distance. He was successful at least once and was given a seaman’s cap as a reward from the ship’s captain, William H. Whitfield.Heading east, the John Howland stopped at Oahu (then part of the independent Kingdom of Hawai’i ruled by Kamehameha III) on November 20th. It was still not known to the Americans where the fishermen were from. Whitfield brought them to a medical missionary, Dr. Gerrit P. Judd, who reasoned they were Japanese after showing them Japanese coins.Arrangements were made for the fishermen to stay in Honolulu. However, Whitfield wished to take Manjirō with him to the United States. Accepting the offer, Manjirō left Oahu on December 1st. Whitfield renamed him “John Mung” with “John” coming from the ship’s name and “Mung” being a shortened version of Manjirō. The John Howland continued to hunt for whales and stopped in Guam in March of the following year before finally heading back to Massachusetts. Life in AmericaIt was on May 6, 1843 that the John Howland reached New Bedford. Whitfield led the now 16-year-old Manjirō to his home in the neighboring town of Fairhaven. Shortly afterward, Whitfield married his second wife, Albertina. The couple had become engaged before Whitfield’s whaling voyage. Whitfield’s first wife, Ruth, had died while he was at sea a few years earlier. The wedding to Albertina, however, was held at the home of Whitfield’s uncle in New York. He left Manjirō in the care of a friend named Eben Aiken until he returned. A teacher named Jane Allen also began tutoring Manjirō to prepare him for the upcoming school year.Upon returning from the wedding, Whitfield bought a farm in the Sconticut Neck part of Fairhaven. Living there gave Manjirō the opportunity to learn how to ride a horse. Manjirō was then enrolled in the nearby Bartlett School where he studied math, navigation, and surveying. He went on to apprentice as a cooper–crafting and repairing barrels and casks–in New Bedford.New Bedford was generally viewed as a place of acceptance partly because its people lived and worked with the inclusive whaling industry. It was also seen as a safe-haven for freed and escaped slaves–notably Frederick Douglass. Unfortunately, this sentiment was not always extended. Members of a Congregational church disapproved of Manjirō sitting in the Whitfield family pew. The Whitfields responded by joining a more accepting Unitarian church. Coincidentally, one of the Unitarian church’s members was Warren Delano Jr. who later spoke about Manjirō to his grandson, President Franklin Delano Roosevelt. The Journey Home After he had turned 19 years old, Manjirō was asked to join a whaling ship by Ira Davis who had been the harpooner on the John Howland and was now the captain of the Franklin. On May 16, 1846, they took an eastern route to the Pacific via the Cape of Good Hope to avoid impacts of the Mexican-American War on the Cape Horn route.Almost a year later, in March of 1847, the Franklin stopped in Guam. It was there that Manjirō wrote to Whitfield about the ship’s plans to sail to the Ryūkyū Islands, which were not yet annexed by Japan but an independent vassal state. He expressed hope at opening a whaling port there. The Franklin arrived in May and Manjirō acted as an interpreter. However, he was unable to understand their dialect and returned to the ship.In October of 1848, the Franklin stopped in Honolulu and Manjirō was reunited with the castaway fishermen. Fudenojo had changed his name to Denzo to make it easier for the locals to pronounce. He and Goemon had recently come back from an unsuccessful attempt at returning to Japan. Toraemon was working as a carpenter. Sadly, Jusuke had died five years earlier.The Franklin arrived back in New Bedford on September 23, 1849. The three year plus trip had earned Manjirō $350. At this time, news of gold in California reached him. There was no doubt that Manjirō missed his mother. If he made enough money in the gold industry then he could afford to take a passenger ship to the Pacific and maybe find his way back to Japan. Two months later, he took a job on the Stieglitz, which was carrying lumber to San Francisco.Arriving in the spring of 1850, Majiro began looking for gold near Sacramento. He earned $600 in about seventy days. Heading back to San Francisco, he booked a passenger ticket to Honolulu on the Eliza Warwick, which left on September 17th.Manjirō met with his old friends in Honolulu. Denzo and Goemon agreed to go with him back to Japan. Toraemon, however, wished to stay in Honolulu since he was successful as a carpenter and had married a local woman. The next step was to purchase a small boat. A friend of Whitfield’s named Reverend C. Damon spread the story of the three fishermen hoping to return home and asked for donations. With his help, the fishermen bought a boat that they named the Adventurer. Now the fishermen had to get the Adventurer close to Japan. To do this, they brought their small boat onto the Sarah Boyd, which was headed for China on December 17, 1850. As the Sarah Boyd passed the Ryūkyū Islands on its way to China, the three fishermen lowered the Adventurer into the water. They rowed home on February 2, 1851.The Adventurer landed on Okinawa, which was controlled by the daimyō of the Satsuma Province on Kyūshū. The three fishermen were soon taken by Satsuma officials to the city of Naha for interrogation. In the meantime, they were put under house arrest. After this period of interrogation, the fishermen were moved from Okinawa to Kyūshū–in the city of Kagoshima and then Nagasaki–to be interrogated by Tokugawa officials. They were finally set free in June of 1852 and made it to their respective homes in October.Manjirō found his mother still alive. Although, she had long thought he had died. Their reunion lasted for three days, for Manjirō was called to the city of Kochi to teach English to samurai among others.  Japan-United States RelationsThe following year, the American Commodore Matthew C. Perry arrived at the harbor of Uraga with four warships. He was carrying a letter from President Millard Fillmore that demanded Japan open its ports to the outside world. The shogunate ordered Manjirō to Edo (Uraga is located at the entrance of Edo Bay–now Tokyo Bay) to provide information on the United States. In response to his service, Manjirō was given samurai status at the end of the year. He then adopted a surname, Nakahama, after his home village. Japan signed the Treaty of Kanagawa with the United States on March 31, 1854 putting an end to its isolation.Manjirō put his English language knowledge to other uses. In 1857, he translated Nathaniel Bowditch’s The New American Practical Navigator into Japanese. He also authored the first English text to be published in Japan, A Shortcut To Anglo-American Conversation, in 1859. Around this time, he taught English to future leading dramatist Fukuchi Gen’ichirō.1859 saw a story similar to Manjirō, but with the roles reversed. An American named John Mercer Brooke was commanding a surveying expedition in the Pacific aboard the Fenimore Cooper. This time it was the Americans that were shipwrecked as a typhoon destroyed the ship off the coast of Yokohama. Japan happened to be looking for an experienced navigator to help bring an embassy to San Francisco on its way to Washington, D.C. Brooke accepted the job at Japan’s request. He chose nine American crew members and the draftsman Edward Meyer Kern from the Fenimore Cooper to join him.Brooke boarded the Kanrin-maru, a Dutch ship that had been purchased by Japan two years earlier for approximately $70,000. It escorted an American warship, the Powhatan, that carried the embassy. The Kanrin-maru, however, carried a samurai “Magistrate of Warships” named Kimura Toshitake. Should something happen to the Powhatan, it would be Kimura’s responsibility to represent Japan in Washington. The translator on the Kanrin-maru was Manjirō.Apart from Manjirō, none of the Japanese crew members had been on a sea voyage before. The ship faced a storm right after leaving Yokohama. Together, Brooke and Manjirō taught the inexperienced crew how to manage their vessel. The ship’s captain, another samurai named Katsu Rinatarō, soon became ill from seasickness and delegated the running of the ship. Despite these trials, both ships made it to San Francisco safely on March 17, 1860.Japan treated this voyage as a test of their naval capabilities. Katsu would go on to become the chief architect of the Imperial Japanese Navy, which was formally created in 1869. A Return to WhalingJapanese whaling soon evolved in two ways. First, whalers searched for new shore stations. This indirectly aided colonial expansion, so the government offered financial backing to whalers. Second, foreign whaling techniques were incorporated, which eventually influenced modern Japanese whaling. These two evolutions intertwined around Korea where Japan competed with Russia and where fin whales were so fast that they could only be caught by Norwegian whaling technology.The city of Hakodate welcomed foreign whaling ships into its harbor so the Japanese could observe their techniques. Around 1862, Manjirō started an American-style whaling operation out of Hakodate. He went on to help the government bring whaling to the Ogasawara Islands (known as the Bonin Islands to the British). He had previously visited the islands on a whaling expedition after the government grew concerned that American, European, and Hawaiian colonizers–who had encroached on the territory in 1830–were getting more use from the whales than Japan. This expedition was ultimately shortened by a typhoon. Manjirō returned in 1863 for more whaling. However, Japan abandoned its plans for a few years due to expenses and pressure from foreign powers. Manjirō was sent on another diplomatic mission that stopped in the United States and Europe in 1870. While docked in New York City, Manjirō took a train to Massachusetts where he visited Whitfield. His American homes, both Fairhaven and New Bedford, became sister cities with his native home, Tosashimizu, in 1987.On a final note, a 21-year-old Herman Melville left New Bedford on the whaling ship Acushnet two days before Manjirō went fishing in 1841. This trip was the genesis for his novel Moby-Dick in which he wrote, “If that double-bolted land, Japan, is even to become hospitable, it is the whale-ship alone to whom the credit will be due; for already she is on the threshold.” Moby-Dick was published the same year that Manjirō returned to Japan. Did you find that piece interesting? If so, join us for free by clicking here.  Works CitedArch, Jakobina. “Birth of a Pelagic Empire: Japanese Whaling and Early Territorial Expansions in the Pacific.” Across Species and Cultures: Whales, Humans, and Pacific Worlds, edited by Ryan Tucker Jones and Angela Wanhalla, University of Hawai’i Press, 2022, pp. 93–110. JSTOR, https://doi.org/10.2307/jj.13568102.8. Accessed 10 June 2025.“Herman Melville.” National Park Service, https://www.nps.gov/nebe/learn/historyculture/hermanmelville.htm. Accessed 10 June 2025.Huffman, James L. “The Clash of Two Worlds: 1841–1868.” Politics of the Meiji Press: The Life of Fukuchi Gen’ichirō, University of Hawai’i Press, 1980, pp. 1–31. JSTOR, https://doi.org/10.2307/j.ctv9zckgw.5. Accessed 10 June 2025.Kitadai, Junji. “The Saga of Manjirō.” Education About Asia, vol. 19, no. 2, 2014. https://www.asianstudies.org/publications/eaa/archives/the-saga-of-manjiro. Accessed 10 June 2025.“The Manjiro Story.” Whitfield-Manjiro Friendship Society, https://whitfield-manjiro.org/the-manjiro-story. Accessed 10 June 2025.“Nakahama Manjiro.” The Millicent Library, https://millicentlibrary.org/NakahamaManjiro. Accessed 10 June 2025.Taketani, Etsuko. “Samurai Ambassadors and the Smithsonian Institute in 1860.” Journal of the American Oriental Society, vol. 115, no. 3, 1995, pp. 479–81. JSTOR, https://doi.org/10.2307/606225. Accessed 9 June 2025.Uenuma, Francine. “The Shipwrecked Teenager Who Helped End Japan’s Isolationist Era.” Smithsonian, https://www.smithsonianmag.com/history/the-shipwrecked-teenager-who-helped-end-japans-isolationist-era-180982199. Accessed 10 June 2025.Yanaga, Chitoshi. “The First Japanese Embassy to the United States.” Pacific Historical Review, vol. 9, no. 2, 1940, pp. 113–38. JSTOR, https://doi.org/10.2307/3633080. Accessed 10 June 2025.Young, Dana B. “The Voyage of the Kanrin Maru to San Francisco, 1860.” California History, vol. 61, no. 4, 1983, pp. 264–75. JSTOR, https://doi.org/10.2307/25158123. Accessed 10 June 2025.",
  "author": "George Levrier-Jones",
  "published": "Thu, 10 Jul 2025 21:36:25 +0000",
  "source": "https://www.historyisnowmagazine.com/blog?format=RSS",
  "categories": [
    "19th century",
    "Blog Post"
  ],
  "byline": "AuthorGeorge Levrier-Jones",
  "length": 15799,
  "excerpt": "The Tokugawa period of Japan limited foreign trade beginning in the 17th century. For example, Chinese traders were restricted to the port of Nagasaki or through indirect routes like the Ryūkū Islands. Dutch traders also became the only Europeans allowed to enter Japan. Similarly, Japanese people we",
  "siteName": "History is Now Magazine, Podcasts, Blog and Books | Modern International and American history",
  "favicon": "",
  "text": "The Tokugawa period of Japan limited foreign trade beginning in the 17th century. For example, Chinese traders were restricted to the port of Nagasaki or through indirect routes like the Ryūkū Islands. Dutch traders also became the only Europeans allowed to enter Japan. Similarly, Japanese people were not permitted to go abroad. Those who resided in another country and returned to Japan could face the death penalty. These policies lasted for over 200 years. Yet, at least one Japanese person made it to the United States and back again during this time.Michael Mirra explains. Manjiro Nakahama.Five Fishermen from JapanOn Japan’s island Shikoku, a 13-year-old boy named Manjirō lived in a village called Nakanohama (now part of the city Tosashimizu). His father had died when he was eight or nine years old. To support his mother and siblings, Manjirō got a job on a fishing expedition. The crew consisted of three brothers named Fudenojo (37), Jusuke (24), and Goemon (15), and their neighbor Toraemon (25). They set sail on January 5, 1841 in search of either bonito, mackerel, or tuna. The trip was expected to last only a few days.A storm hit the five fishermen on the second or third day. They were about twenty miles from the coast of Japan. Fighting the wind while trying to make it back to land, their sculling oarlock broke off and soon their sculling oar broke in half. Propelling the boat was no longer in their control.The boat was blown off course for three or four days and the fishermen ran out of provisions. Around January 13th, they finally spotted an island. It was the small and uninhabited Izu-Torishima (also known as “Bird Island”) a few hundred miles from the mainland. They were unable to find a beach to land the boat and decided to swim for it. Right before jumping in, a high wave overturned the boat and injured Jusuke’s leg, but all made it to land.Manjirō turned 14 years old a couple of weeks later as the crew attempted to survive on the island. Fudenojo cared for Jusuke in their cave shelter while the others searched for food. Shellfish and seaweed could be gathered. Albatross were also plentiful until their migration season began in late April or early May. However, there was no spring water or edible plants on land. A Ship from New England On June 27th, a whaling ship appeared near the island. The John Howland had sailed from New Bedford, Massachusetts and was now sending two boats to the island in search of turtles to eat. As the boats approached, its members noticed Goemon, Manjirō, and Toraemon waving their clothes attached to sticks and shouting for help. The whalers could not understand anything that the trapped fishermen were saying, but recognized that they were distressed and hungry. All five castaways were taken aboard.From there, the John Howland sailed to the north Pacific in search of whales for oil and baleens. Unlike Japanese whalers, the Americans discarded the rest of the whale. Through attempted sign language and eventually learning some English words, the rescued fisherman were able to communicate with the whalers and were given chores aboard the ship. Manjirō was assigned to the crow’s nest to look for whales in the distance. He was successful at least once and was given a seaman’s cap as a reward from the ship’s captain, William H. Whitfield.Heading east, the John Howland stopped at Oahu (then part of the independent Kingdom of Hawai’i ruled by Kamehameha III) on November 20th. It was still not known to the Americans where the fishermen were from. Whitfield brought them to a medical missionary, Dr. Gerrit P. Judd, who reasoned they were Japanese after showing them Japanese coins.Arrangements were made for the fishermen to stay in Honolulu. However, Whitfield wished to take Manjirō with him to the United States. Accepting the offer, Manjirō left Oahu on December 1st. Whitfield renamed him “John Mung” with “John” coming from the ship’s name and “Mung” being a shortened version of Manjirō. The John Howland continued to hunt for whales and stopped in Guam in March of the following year before finally heading back to Massachusetts.Life in AmericaIt was on May 6, 1843 that the John Howland reached New Bedford. Whitfield led the now 16-year-old Manjirō to his home in the neighboring town of Fairhaven. Shortly afterward, Whitfield married his second wife, Albertina. The couple had become engaged before Whitfield’s whaling voyage. Whitfield’s first wife, Ruth, had died while he was at sea a few years earlier. The wedding to Albertina, however, was held at the home of Whitfield’s uncle in New York. He left Manjirō in the care of a friend named Eben Aiken until he returned. A teacher named Jane Allen also began tutoring Manjirō to prepare him for the upcoming school year.Upon returning from the wedding, Whitfield bought a farm in the Sconticut Neck part of Fairhaven. Living there gave Manjirō the opportunity to learn how to ride a horse. Manjirō was then enrolled in the nearby Bartlett School where he studied math, navigation, and surveying. He went on to apprentice as a cooper–crafting and repairing barrels and casks–in New Bedford.New Bedford was generally viewed as a place of acceptance partly because its people lived and worked with the inclusive whaling industry. It was also seen as a safe-haven for freed and escaped slaves–notably Frederick Douglass. Unfortunately, this sentiment was not always extended. Members of a Congregational church disapproved of Manjirō sitting in the Whitfield family pew. The Whitfields responded by joining a more accepting Unitarian church. Coincidentally, one of the Unitarian church’s members was Warren Delano Jr. who later spoke about Manjirō to his grandson, President Franklin Delano Roosevelt.The Journey Home After he had turned 19 years old, Manjirō was asked to join a whaling ship by Ira Davis who had been the harpooner on the John Howland and was now the captain of the Franklin. On May 16, 1846, they took an eastern route to the Pacific via the Cape of Good Hope to avoid impacts of the Mexican-American War on the Cape Horn route.Almost a year later, in March of 1847, the Franklin stopped in Guam. It was there that Manjirō wrote to Whitfield about the ship’s plans to sail to the Ryūkyū Islands, which were not yet annexed by Japan but an independent vassal state. He expressed hope at opening a whaling port there. The Franklin arrived in May and Manjirō acted as an interpreter. However, he was unable to understand their dialect and returned to the ship.In October of 1848, the Franklin stopped in Honolulu and Manjirō was reunited with the castaway fishermen. Fudenojo had changed his name to Denzo to make it easier for the locals to pronounce. He and Goemon had recently come back from an unsuccessful attempt at returning to Japan. Toraemon was working as a carpenter. Sadly, Jusuke had died five years earlier.The Franklin arrived back in New Bedford on September 23, 1849. The three year plus trip had earned Manjirō $350. At this time, news of gold in California reached him. There was no doubt that Manjirō missed his mother. If he made enough money in the gold industry then he could afford to take a passenger ship to the Pacific and maybe find his way back to Japan. Two months later, he took a job on the Stieglitz, which was carrying lumber to San Francisco.Arriving in the spring of 1850, Majiro began looking for gold near Sacramento. He earned $600 in about seventy days. Heading back to San Francisco, he booked a passenger ticket to Honolulu on the Eliza Warwick, which left on September 17th.Manjirō met with his old friends in Honolulu. Denzo and Goemon agreed to go with him back to Japan. Toraemon, however, wished to stay in Honolulu since he was successful as a carpenter and had married a local woman. The next step was to purchase a small boat. A friend of Whitfield’s named Reverend C. Damon spread the story of the three fishermen hoping to return home and asked for donations. With his help, the fishermen bought a boat that they named the Adventurer. Now the fishermen had to get the Adventurer close to Japan. To do this, they brought their small boat onto the Sarah Boyd, which was headed for China on December 17, 1850. As the Sarah Boyd passed the Ryūkyū Islands on its way to China, the three fishermen lowered the Adventurer into the water. They rowed home on February 2, 1851.The Adventurer landed on Okinawa, which was controlled by the daimyō of the Satsuma Province on Kyūshū. The three fishermen were soon taken by Satsuma officials to the city of Naha for interrogation. In the meantime, they were put under house arrest. After this period of interrogation, the fishermen were moved from Okinawa to Kyūshū–in the city of Kagoshima and then Nagasaki–to be interrogated by Tokugawa officials. They were finally set free in June of 1852 and made it to their respective homes in October.Manjirō found his mother still alive. Although, she had long thought he had died. Their reunion lasted for three days, for Manjirō was called to the city of Kochi to teach English to samurai among others. Japan-United States RelationsThe following year, the American Commodore Matthew C. Perry arrived at the harbor of Uraga with four warships. He was carrying a letter from President Millard Fillmore that demanded Japan open its ports to the outside world. The shogunate ordered Manjirō to Edo (Uraga is located at the entrance of Edo Bay–now Tokyo Bay) to provide information on the United States. In response to his service, Manjirō was given samurai status at the end of the year. He then adopted a surname, Nakahama, after his home village. Japan signed the Treaty of Kanagawa with the United States on March 31, 1854 putting an end to its isolation.Manjirō put his English language knowledge to other uses. In 1857, he translated Nathaniel Bowditch’s The New American Practical Navigator into Japanese. He also authored the first English text to be published in Japan, A Shortcut To Anglo-American Conversation, in 1859. Around this time, he taught English to future leading dramatist Fukuchi Gen’ichirō.1859 saw a story similar to Manjirō, but with the roles reversed. An American named John Mercer Brooke was commanding a surveying expedition in the Pacific aboard the Fenimore Cooper. This time it was the Americans that were shipwrecked as a typhoon destroyed the ship off the coast of Yokohama. Japan happened to be looking for an experienced navigator to help bring an embassy to San Francisco on its way to Washington, D.C. Brooke accepted the job at Japan’s request. He chose nine American crew members and the draftsman Edward Meyer Kern from the Fenimore Cooper to join him.Brooke boarded the Kanrin-maru, a Dutch ship that had been purchased by Japan two years earlier for approximately $70,000. It escorted an American warship, the Powhatan, that carried the embassy. The Kanrin-maru, however, carried a samurai “Magistrate of Warships” named Kimura Toshitake. Should something happen to the Powhatan, it would be Kimura’s responsibility to represent Japan in Washington. The translator on the Kanrin-maru was Manjirō.Apart from Manjirō, none of the Japanese crew members had been on a sea voyage before. The ship faced a storm right after leaving Yokohama. Together, Brooke and Manjirō taught the inexperienced crew how to manage their vessel. The ship’s captain, another samurai named Katsu Rinatarō, soon became ill from seasickness and delegated the running of the ship. Despite these trials, both ships made it to San Francisco safely on March 17, 1860.Japan treated this voyage as a test of their naval capabilities. Katsu would go on to become the chief architect of the Imperial Japanese Navy, which was formally created in 1869.A Return to WhalingJapanese whaling soon evolved in two ways. First, whalers searched for new shore stations. This indirectly aided colonial expansion, so the government offered financial backing to whalers. Second, foreign whaling techniques were incorporated, which eventually influenced modern Japanese whaling. These two evolutions intertwined around Korea where Japan competed with Russia and where fin whales were so fast that they could only be caught by Norwegian whaling technology.The city of Hakodate welcomed foreign whaling ships into its harbor so the Japanese could observe their techniques. Around 1862, Manjirō started an American-style whaling operation out of Hakodate. He went on to help the government bring whaling to the Ogasawara Islands (known as the Bonin Islands to the British). He had previously visited the islands on a whaling expedition after the government grew concerned that American, European, and Hawaiian colonizers–who had encroached on the territory in 1830–were getting more use from the whales than Japan. This expedition was ultimately shortened by a typhoon. Manjirō returned in 1863 for more whaling. However, Japan abandoned its plans for a few years due to expenses and pressure from foreign powers. Manjirō was sent on another diplomatic mission that stopped in the United States and Europe in 1870. While docked in New York City, Manjirō took a train to Massachusetts where he visited Whitfield. His American homes, both Fairhaven and New Bedford, became sister cities with his native home, Tosashimizu, in 1987.On a final note, a 21-year-old Herman Melville left New Bedford on the whaling ship Acushnet two days before Manjirō went fishing in 1841. This trip was the genesis for his novel Moby-Dick in which he wrote, “If that double-bolted land, Japan, is even to become hospitable, it is the whale-ship alone to whom the credit will be due; for already she is on the threshold.” Moby-Dick was published the same year that Manjirō returned to Japan.Did you find that piece interesting? If so, join us for free by clicking here.Works CitedArch, Jakobina. “Birth of a Pelagic Empire: Japanese Whaling and Early Territorial Expansions in the Pacific.” Across Species and Cultures: Whales, Humans, and Pacific Worlds, edited by Ryan Tucker Jones and Angela Wanhalla, University of Hawai’i Press, 2022, pp. 93–110. JSTOR, https://doi.org/10.2307/jj.13568102.8. Accessed 10 June 2025.“Herman Melville.” National Park Service, https://www.nps.gov/nebe/learn/historyculture/hermanmelville.htm. Accessed 10 June 2025.Huffman, James L. “The Clash of Two Worlds: 1841–1868.” Politics of the Meiji Press: The Life of Fukuchi Gen’ichirō, University of Hawai’i Press, 1980, pp. 1–31. JSTOR, https://doi.org/10.2307/j.ctv9zckgw.5. Accessed 10 June 2025.Kitadai, Junji. “The Saga of Manjirō.” Education About Asia, vol. 19, no. 2, 2014. https://www.asianstudies.org/publications/eaa/archives/the-saga-of-manjiro. Accessed 10 June 2025.“The Manjiro Story.” Whitfield-Manjiro Friendship Society, https://whitfield-manjiro.org/the-manjiro-story. Accessed 10 June 2025.“Nakahama Manjiro.” The Millicent Library, https://millicentlibrary.org/NakahamaManjiro. Accessed 10 June 2025.Taketani, Etsuko. “Samurai Ambassadors and the Smithsonian Institute in 1860.” Journal of the American Oriental Society, vol. 115, no. 3, 1995, pp. 479–81. JSTOR, https://doi.org/10.2307/606225. Accessed 9 June 2025.Uenuma, Francine. “The Shipwrecked Teenager Who Helped End Japan’s Isolationist Era.” Smithsonian, https://www.smithsonianmag.com/history/the-shipwrecked-teenager-who-helped-end-japans-isolationist-era-180982199. Accessed 10 June 2025.Yanaga, Chitoshi. “The First Japanese Embassy to the United States.” Pacific Historical Review, vol. 9, no. 2, 1940, pp. 113–38. JSTOR, https://doi.org/10.2307/3633080. Accessed 10 June 2025.Young, Dana B. “The Voyage of the Kanrin Maru to San Francisco, 1860.” California History, vol. 61, no. 4, 1983, pp. 264–75. JSTOR, https://doi.org/10.2307/25158123. Accessed 10 June 2025.",
  "image": "http://static1.squarespace.com/static/50adfa2ae4b0cc1d786569eb/t/687031fdb1b1b97adf063af7/1752183293479/20250710+1024px-Manjiro_Nakahama_circa_1880%2C_Millicent_Library_collection_%28cropped%29.jpg?format=1500w",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-block-type=\"2\" id=\"block-0af6202efc3179cc9f77\"\u003e\n  \u003cp\u003e\u003cem\u003eThe Tokugawa period of Japan limited foreign trade beginning in the 17th century. For example, Chinese traders were restricted to the port of Nagasaki or through indirect routes like the Ryūkū Islands. Dutch traders also became the only Europeans allowed to enter Japan. Similarly, Japanese people were not permitted to go abroad. Those who resided in another country and returned to Japan could face the death penalty. These policies lasted for over 200 years. Yet, at least one Japanese person made it to the United States and back again during this time.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eMichael Mirra explains.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv data-block-type=\"2\" id=\"block-yui_3_17_2_1_1752183252626_13059\"\u003e\n  \u003cp\u003e\u003cem\u003eManjiro Nakahama.\u003c/em\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFive Fishermen from Japan\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOn Japan’s island Shikoku, a 13-year-old boy named Manjirō lived in a village called Nakanohama (now part of the city Tosashimizu). His father had died when he was eight or nine years old. To support his mother and siblings, Manjirō got a job on a fishing expedition. The crew consisted of three brothers named Fudenojo (37), Jusuke (24), and Goemon (15), and their neighbor Toraemon (25). They set sail on January 5, 1841 in search of either bonito, mackerel, or tuna. The trip was expected to last only a few days.\u003c/p\u003e\u003cp\u003eA storm hit the five fishermen on the second or third day. They were about twenty miles from the coast of Japan. Fighting the wind while trying to make it back to land, their sculling oarlock broke off and soon their sculling oar broke in half. Propelling the boat was no longer in their control.\u003c/p\u003e\u003cp\u003eThe boat was blown off course for three or four days and the fishermen ran out of provisions. Around January 13th, they finally spotted an island. It was the small and uninhabited Izu-Torishima (also known as “Bird Island”) a few hundred miles from the mainland. They were unable to find a beach to land the boat and decided to swim for it. Right before jumping in, a high wave overturned the boat and injured Jusuke’s leg, but all made it to land.\u003c/p\u003e\u003cp\u003eManjirō turned 14 years old a couple of weeks later as the crew attempted to survive on the island. Fudenojo cared for Jusuke in their cave shelter while the others searched for food. Shellfish and seaweed could be gathered. Albatross were also plentiful until their migration season began in late April or early May. However, there was no spring water or edible plants on land. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eA Ship from New England \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eOn June 27th, a whaling ship appeared near the island. The \u003cem\u003eJohn Howland\u003c/em\u003e had sailed from New Bedford, Massachusetts and was now sending two boats to the island in search of turtles to eat. As the boats approached, its members noticed Goemon, Manjirō, and Toraemon waving their clothes attached to sticks and shouting for help. The whalers could not understand anything that the trapped fishermen were saying, but recognized that they were distressed and hungry. All five castaways were taken aboard.\u003c/p\u003e\u003cp\u003eFrom there, the \u003cem\u003eJohn Howland\u003c/em\u003e sailed to the north Pacific in search of whales for oil and baleens. Unlike Japanese whalers, the Americans discarded the rest of the whale. Through attempted sign language and eventually learning some English words, the rescued fisherman were able to communicate with the whalers and were given chores aboard the ship. Manjirō was assigned to the crow’s nest to look for whales in the distance. He was successful at least once and was given a seaman’s cap as a reward from the ship’s captain, William H. Whitfield.\u003c/p\u003e\u003cp\u003eHeading east, the \u003cem\u003eJohn Howland\u003c/em\u003e stopped at Oahu (then part of the independent Kingdom of Hawai’i ruled by Kamehameha III) on November 20th. It was still not known to the Americans where the fishermen were from. Whitfield brought them to a medical missionary, Dr. Gerrit P. Judd, who reasoned they were Japanese after showing them Japanese coins.\u003c/p\u003e\u003cp\u003eArrangements were made for the fishermen to stay in Honolulu. However, Whitfield wished to take Manjirō with him to the United States. Accepting the offer, Manjirō left Oahu on December 1st. Whitfield renamed him “John Mung” with “John” coming from the ship’s name and “Mung” being a shortened version of Manjirō. The \u003cem\u003eJohn Howland\u003c/em\u003e continued to hunt for whales and stopped in Guam in March of the following year before finally heading back to Massachusetts.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eLife in America\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eIt was on May 6, 1843 that the \u003cem\u003eJohn Howland\u003c/em\u003e reached New Bedford. Whitfield led the now 16-year-old Manjirō to his home in the neighboring town of Fairhaven. Shortly afterward, Whitfield married his second wife, Albertina. The couple had become engaged before Whitfield’s whaling voyage. Whitfield’s first wife, Ruth, had died while he was at sea a few years earlier. The wedding to Albertina, however, was held at the home of Whitfield’s uncle in New York. He left Manjirō in the care of a friend named Eben Aiken until he returned. A teacher named Jane Allen also began tutoring Manjirō to prepare him for the upcoming school year.\u003c/p\u003e\u003cp\u003eUpon returning from the wedding, Whitfield bought a farm in the Sconticut Neck part of Fairhaven. Living there gave Manjirō the opportunity to learn how to ride a horse. Manjirō was then enrolled in the nearby Bartlett School where he studied math, navigation, and surveying. He went on to apprentice as a cooper–crafting and repairing barrels and casks–in New Bedford.\u003c/p\u003e\u003cp\u003eNew Bedford was generally viewed as a place of acceptance partly because its people lived and worked with the inclusive whaling industry. It was also seen as a safe-haven for freed and escaped slaves–notably Frederick Douglass. Unfortunately, this sentiment was not always extended. Members of a Congregational church disapproved of Manjirō sitting in the Whitfield family pew. The Whitfields responded by joining a more accepting Unitarian church. Coincidentally, one of the Unitarian church’s members was Warren Delano Jr. who later spoke about Manjirō to his grandson, President Franklin Delano Roosevelt.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eThe Journey Home \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAfter he had turned 19 years old, Manjirō was asked to join a whaling ship by Ira Davis who had been the harpooner on the \u003cem\u003eJohn Howland\u003c/em\u003e and was now the captain of the \u003cem\u003eFranklin\u003c/em\u003e. On May 16, 1846, they took an eastern route to the Pacific via the Cape of Good Hope to avoid impacts of the Mexican-American War on the Cape Horn route.\u003c/p\u003e\u003cp\u003eAlmost a year later, in March of 1847, the \u003cem\u003eFranklin\u003c/em\u003e stopped in Guam. It was there that Manjirō wrote to Whitfield about the ship’s plans to sail to the Ryūkyū Islands, which were not yet annexed by Japan but an independent vassal state. He expressed hope at opening a whaling port there. The \u003cem\u003eFranklin\u003c/em\u003e arrived in May and Manjirō acted as an interpreter. However, he was unable to understand their dialect and returned to the ship.\u003c/p\u003e\u003cp\u003eIn October of 1848, the \u003cem\u003eFranklin\u003c/em\u003e stopped in Honolulu and Manjirō was reunited with the castaway fishermen. Fudenojo had changed his name to Denzo to make it easier for the locals to pronounce. He and Goemon had recently come back from an unsuccessful attempt at returning to Japan. Toraemon was working as a carpenter. Sadly, Jusuke had died five years earlier.\u003c/p\u003e\u003cp\u003eThe \u003cem\u003eFranklin\u003c/em\u003e arrived back in New Bedford on September 23, 1849. The three year plus trip had earned Manjirō $350. At this time, news of gold in California reached him. There was no doubt that Manjirō missed his mother. If he made enough money in the gold industry then he could afford to take a passenger ship to the Pacific and maybe find his way back to Japan. Two months later, he took a job on the \u003cem\u003eStieglitz\u003c/em\u003e, which was carrying lumber to San Francisco.\u003c/p\u003e\u003cp\u003eArriving in the spring of 1850, Majiro began looking for gold near Sacramento. He earned $600 in about seventy days. Heading back to San Francisco, he booked a passenger ticket to Honolulu on the \u003cem\u003eEliza Warwick\u003c/em\u003e, which left on September 17th.\u003c/p\u003e\u003cp\u003eManjirō met with his old friends in Honolulu. Denzo and Goemon agreed to go with him back to Japan. Toraemon, however, wished to stay in Honolulu since he was successful as a carpenter and had married a local woman. \u003c/p\u003e\u003cp\u003eThe next step was to purchase a small boat. A friend of Whitfield’s named Reverend C. Damon spread the story of the three fishermen hoping to return home and asked for donations. With his help, the fishermen bought a boat that they named the \u003cem\u003eAdventurer\u003c/em\u003e. \u003c/p\u003e\u003cp\u003eNow the fishermen had to get the \u003cem\u003eAdventurer\u003c/em\u003e close to Japan. To do this, they brought their small boat onto the \u003cem\u003eSarah Boyd\u003c/em\u003e, which was headed for China on December 17, 1850. As the \u003cem\u003eSarah Boyd\u003c/em\u003e passed the Ryūkyū Islands on its way to China, the three fishermen lowered the \u003cem\u003eAdventurer\u003c/em\u003e into the water. They rowed home on February 2, 1851.\u003c/p\u003e\u003cp\u003eThe \u003cem\u003eAdventurer\u003c/em\u003e landed on Okinawa, which was controlled by the daimyō of the Satsuma Province on Kyūshū. The three fishermen were soon taken by Satsuma officials to the city of Naha for interrogation. In the meantime, they were put under house arrest. \u003c/p\u003e\u003cp\u003eAfter this period of interrogation, the fishermen were moved from Okinawa to Kyūshū–in the city of Kagoshima and then Nagasaki–to be interrogated by Tokugawa officials. They were finally set free in June of 1852 and made it to their respective homes in October.\u003c/p\u003e\u003cp\u003eManjirō found his mother still alive. Although, she had long thought he had died. Their reunion lasted for three days, for Manjirō was called to the city of Kochi to teach English to samurai among others. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eJapan-United States Relations\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe following year, the American Commodore Matthew C. Perry arrived at the harbor of Uraga with four warships. He was carrying a letter from President Millard Fillmore that demanded Japan open its ports to the outside world. The shogunate ordered Manjirō to Edo (Uraga is located at the entrance of Edo Bay–now Tokyo Bay) to provide information on the United States. In response to his service, Manjirō was given samurai status at the end of the year. He then adopted a surname, Nakahama, after his home village. Japan signed the Treaty of Kanagawa with the United States on March 31, 1854 putting an end to its isolation.\u003c/p\u003e\u003cp\u003eManjirō put his English language knowledge to other uses. In 1857, he translated Nathaniel Bowditch’s \u003cem\u003eThe New American Practical Navigator\u003c/em\u003e into Japanese. He also authored the first English text to be published in Japan, \u003cem\u003eA Shortcut To Anglo-American Conversation\u003c/em\u003e, in 1859. Around this time, he taught English to future leading dramatist Fukuchi Gen’ichirō.\u003c/p\u003e\u003cp\u003e1859 saw a story similar to Manjirō, but with the roles reversed. An American named John Mercer Brooke was commanding a surveying expedition in the Pacific aboard the \u003cem\u003eFenimore Cooper\u003c/em\u003e. This time it was the Americans that were shipwrecked as a typhoon destroyed the ship off the coast of Yokohama. \u003c/p\u003e\u003cp\u003eJapan happened to be looking for an experienced navigator to help bring an embassy to San Francisco on its way to Washington, D.C. Brooke accepted the job at Japan’s request. He chose nine American crew members and the draftsman Edward Meyer Kern from the \u003cem\u003eFenimore Cooper\u003c/em\u003e to join him.\u003c/p\u003e\u003cp\u003eBrooke boarded the \u003cem\u003eKanrin-maru\u003c/em\u003e, a Dutch ship that had been purchased by Japan two years earlier for approximately $70,000. It escorted an American warship, the \u003cem\u003ePowhatan\u003c/em\u003e, that carried the embassy. The \u003cem\u003eKanrin-maru\u003c/em\u003e, however, carried a samurai “Magistrate of Warships” named Kimura Toshitake. Should something happen to the \u003cem\u003ePowhatan\u003c/em\u003e, it would be Kimura’s responsibility to represent Japan in Washington. The translator on the \u003cem\u003eKanrin-maru\u003c/em\u003e was Manjirō.\u003c/p\u003e\u003cp\u003eApart from Manjirō, none of the Japanese crew members had been on a sea voyage before. The ship faced a storm right after leaving Yokohama. Together, Brooke and Manjirō taught the inexperienced crew how to manage their vessel. The ship’s captain, another samurai named Katsu Rinatarō, soon became ill from seasickness and delegated the running of the ship. Despite these trials, both ships made it to San Francisco safely on March 17, 1860.\u003c/p\u003e\u003cp\u003eJapan treated this voyage as a test of their naval capabilities. Katsu would go on to become the chief architect of the Imperial Japanese Navy, which was formally created in 1869.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eA Return to Whaling\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eJapanese whaling soon evolved in two ways. First, whalers searched for new shore stations. This indirectly aided colonial expansion, so the government offered financial backing to whalers. Second, foreign whaling techniques were incorporated, which eventually influenced modern Japanese whaling. These two evolutions intertwined around Korea where Japan competed with Russia and where fin whales were so fast that they could only be caught by Norwegian whaling technology.\u003c/p\u003e\u003cp\u003eThe city of Hakodate welcomed foreign whaling ships into its harbor so the Japanese could observe their techniques. Around 1862, Manjirō started an American-style whaling operation out of Hakodate. He went on to help the government bring whaling to the Ogasawara Islands (known as the Bonin Islands to the British). He had previously visited the islands on a whaling expedition after the government grew concerned that American, European, and Hawaiian colonizers–who had encroached on the territory in 1830–were getting more use from the whales than Japan. This expedition was ultimately shortened by a typhoon. Manjirō returned in 1863 for more whaling. However, Japan abandoned its plans for a few years due to expenses and pressure from foreign powers. \u003c/p\u003e\u003cp\u003eManjirō was sent on another diplomatic mission that stopped in the United States and Europe in 1870. While docked in New York City, Manjirō took a train to Massachusetts where he visited Whitfield. His American homes, both Fairhaven and New Bedford, became sister cities with his native home, Tosashimizu, in 1987.\u003c/p\u003e\u003cp\u003eOn a final note, a 21-year-old Herman Melville left New Bedford on the whaling ship \u003cem\u003eAcushnet\u003c/em\u003e two days before Manjirō went fishing in 1841. This trip was the genesis for his novel \u003cem\u003eMoby-Dick\u003c/em\u003e in which he wrote, “If that double-bolted land, Japan, is even to become hospitable, it is the whale-ship alone to whom the credit will be due; for already she is on the threshold.” \u003cem\u003eMoby-Dick\u003c/em\u003e was published the same year that Manjirō returned to Japan.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cem\u003eDid you find that piece interesting? If so, join us for free by \u003c/em\u003e\u003c/strong\u003e\u003ca href=\"https://itshistorypodcasts.us6.list-manage.com/subscribe?id=e4bf64a513\u0026amp;u=a5ae852ff75414a674c7c8463\"\u003e\u003cspan\u003e\u003cstrong\u003eclicking here\u003c/strong\u003e\u003c/span\u003e\u003c/a\u003e\u003cstrong\u003e\u003cem\u003e.\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWorks Cited\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eArch, Jakobina. “Birth of a Pelagic Empire: Japanese Whaling and Early Territorial Expansions in the Pacific.” \u003cem\u003eAcross Species and Cultures: Whales, Humans, and Pacific Worlds\u003c/em\u003e, edited by Ryan Tucker Jones and Angela Wanhalla, University of Hawai’i Press, 2022, pp. 93–110. \u003cem\u003eJSTOR\u003c/em\u003e, https://doi.org/10.2307/jj.13568102.8. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003e“Herman Melville.” National Park Service, https://www.nps.gov/nebe/learn/historyculture/hermanmelville.htm. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003eHuffman, James L. “The Clash of Two Worlds: 1841–1868.” \u003cem\u003ePolitics of the Meiji Press: The Life of Fukuchi Gen’ichirō\u003c/em\u003e, University of Hawai’i Press, 1980, pp. 1–31. \u003cem\u003eJSTOR\u003c/em\u003e, https://doi.org/10.2307/j.ctv9zckgw.5. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003eKitadai, Junji. “The Saga of Manjirō.” \u003cem\u003eEducation About Asia\u003c/em\u003e, vol. 19, no. 2, 2014. https://www.asianstudies.org/publications/eaa/archives/the-saga-of-manjiro. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003e“The Manjiro Story.” Whitfield-Manjiro Friendship Society, https://whitfield-manjiro.org/the-manjiro-story. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003e“Nakahama Manjiro.” The Millicent Library, https://millicentlibrary.org/NakahamaManjiro. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003eTaketani, Etsuko. “Samurai Ambassadors and the Smithsonian Institute in 1860.” \u003cem\u003eJournal of the American Oriental Society\u003c/em\u003e, vol. 115, no. 3, 1995, pp. 479–81. \u003cem\u003eJSTOR\u003c/em\u003e, https://doi.org/10.2307/606225. Accessed 9 June 2025.\u003c/p\u003e\u003cp\u003eUenuma, Francine. “The Shipwrecked Teenager Who Helped End Japan’s Isolationist Era.” Smithsonian, https://www.smithsonianmag.com/history/the-shipwrecked-teenager-who-helped-end-japans-isolationist-era-180982199. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003eYanaga, Chitoshi. “The First Japanese Embassy to the United States.” \u003cem\u003ePacific Historical Review\u003c/em\u003e, vol. 9, no. 2, 1940, pp. 113–38. \u003cem\u003eJSTOR\u003c/em\u003e, https://doi.org/10.2307/3633080. Accessed 10 June 2025.\u003c/p\u003e\u003cp\u003eYoung, Dana B. “The Voyage of the Kanrin Maru to San Francisco, 1860.” \u003cem\u003eCalifornia History\u003c/em\u003e, vol. 61, no. 4, 1983, pp. 264–75. \u003cem\u003eJSTOR\u003c/em\u003e, https://doi.org/10.2307/25158123. Accessed 10 June 2025.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "17 min read",
  "publishedTime": "2025-07-10T22:36:25+01:00",
  "modifiedTime": null
}
