{
  "id": "007a7698-368e-4ed2-9993-17f8c066b3f8",
  "title": "Policy uncertainty fuels rise in U.S. government debt hedging",
  "link": "https://finance.yahoo.com/news/policy-uncertainty-fuels-rise-u-184220180.html",
  "description": "",
  "author": "",
  "published": "2025-05-09T18:42:20Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Davide Barbuscia",
  "length": 2821,
  "excerpt": "NEW YORK (Reuters) -The cost of insuring exposure to U.S. government debt has climbed noticeably over the past month and remains stubbornly high, as jittery ...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "By Davide Barbuscia NEW YORK (Reuters) -The cost of insuring exposure to U.S. government debt has climbed noticeably over the past month and remains stubbornly high, as jittery investors brace for a looming U.S. borrowing-limit political debate as well as overall policy uncertainty. Spreads on U.S. credit default swaps (CDS) - market-based gauges of the risk of a sovereign default - widened to their highest since the debt ceiling crisis of 2023 in recent weeks. The size of the market and trading volumes have also increased recently, Barclays said in a note this week, in a sign that a product generally considered to be niche is garnering more investor attention. While years ago buying protection for a U.S. default was an unpopular trade, things have changed recently because of policy uncertainty in Washington, said Greg Peters, co-chief investment officer of PGIM Fixed Income. \"Now, with the debt ceiling and everything else going on, no one wants to be short that option,\" he said. U.S. sovereign CDS spreads have increased not just for short-dated maturities but across the curve, with one-year and five-year spreads at their highest since May 2023, when the U.S. was on the verge of a default because of political brinkmanship over the debt ceiling. On Friday, those spreads stood at 60 basis points and 56 basis points, respectively - a touch lower than in recent weeks but still significantly higher than in March, S\u0026P Global Market Intelligence data showed. The rise in the protection costs has gained momentum after April 2, when U.S. President Donald Trump announced sweeping tariffs, which in the following days sparked a sharp selloff in the Treasury market, the bedrock of the global financial system. \"What you've seen since April 2 is a real rise in that risk premium,\" said Peters. After days of heavy selling, Treasuries rallied after Trump announced a 90-day tariff pause for most U.S. trading partners, a move likely prompted by the tariff-fueled selloff. Benchmark 10-year yields were last at 4.36%, about 20 basis points lower than the high they touched on April 11, the day tariffs were paused. Still, another key measure of risk embedded in Treasury bonds, which captures the premium investors charge for policy uncertainty, has remained elevated in recent weeks, according to New York Fed data. The U.S. government reached its statutory borrowing limit in January and began employing \"extraordinary measures\" to keep it from breaching the cap and risking a potential default. Barclays analysts said in a note this week the so-called X-date, when the government will no longer be able to pay all its obligations, will likely fall in late August or early September, but that an economic slowdown could put pressure on the Treasury's cash position and pull that date forward.",
  "image": "https://media.zenfs.com/en/reuters-finance.com/6556eb788a208c0ea1cbfed763d43052",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e  \u003cdiv data-testid=\"article-content-wrapper\"\u003e  \u003cp\u003eBy Davide Barbuscia\u003c/p\u003e  \u003cp\u003eNEW YORK (Reuters) -The cost of insuring exposure to U.S. government debt has climbed noticeably over the past month and remains stubbornly high, as jittery investors brace for a looming U.S. borrowing-limit political debate as well as overall policy uncertainty.\u003c/p\u003e  \u003cp\u003eSpreads on U.S. credit default swaps (CDS) - market-based gauges of the risk of a sovereign default - widened to their highest since the debt ceiling crisis of 2023 in recent weeks. The size of the market and trading volumes have also increased recently, Barclays said in a note this week, in a sign that a product generally considered to be niche is garnering more investor attention.\u003c/p\u003e    \u003cp\u003eWhile years ago buying protection for a U.S. default was an unpopular trade, things have changed recently because of policy uncertainty in Washington, said Greg Peters, co-chief investment officer of PGIM Fixed Income. \u0026#34;Now, with the debt ceiling and everything else going on, no one wants to be short that option,\u0026#34; he said.\u003c/p\u003e  \u003cp\u003eU.S. sovereign CDS spreads have increased not just for short-dated maturities but across the curve, with one-year and five-year spreads at their highest since May 2023, when the U.S. was on the verge of a default because of political brinkmanship over the debt ceiling.\u003c/p\u003e  \u003cp\u003eOn Friday, those spreads stood at 60 basis points and 56 basis points, respectively - a touch lower than in recent weeks but still significantly higher than in March, S\u0026amp;P Global Market Intelligence data showed.\u003c/p\u003e  \u003cp\u003eThe rise in the protection costs has gained momentum after April 2, when U.S. President Donald Trump announced sweeping tariffs, which in the following days sparked a sharp selloff in the Treasury market, the bedrock of the global financial system.\u003c/p\u003e    \u003cp\u003e\u0026#34;What you\u0026#39;ve seen since April 2 is a real rise in that risk premium,\u0026#34; said Peters.\u003c/p\u003e  \u003cp\u003eAfter days of heavy selling, Treasuries rallied after Trump announced a 90-day tariff pause for most U.S. trading partners, a move likely prompted by the tariff-fueled selloff. Benchmark 10-year yields were last at 4.36%, about 20 basis points lower than the high they touched on April 11, the day tariffs were paused.\u003c/p\u003e  \u003cp\u003eStill, another key measure of risk embedded in Treasury bonds, which captures the premium investors charge for policy uncertainty, has remained elevated in recent weeks, according to New York Fed data.\u003c/p\u003e  \u003cp\u003eThe U.S. government reached its statutory borrowing limit in January and began employing \u0026#34;extraordinary measures\u0026#34; to keep it from breaching the cap and risking a potential default.\u003c/p\u003e  \u003cp\u003eBarclays analysts said in a note this week the so-called X-date, when the government will no longer be able to pay all its obligations, will likely fall in late August or early September, but that an economic slowdown could put pressure on the Treasury\u0026#39;s cash position and pull that date forward.\u003c/p\u003e \u003c/div\u003e      \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-09T18:42:20Z",
  "modifiedTime": null
}
