{
  "id": "0da548b6-e28c-4e00-9b3a-8afc95b4e48d",
  "title": "4-Hour Workweek Success Stories — Charlie Houpert on Building “Charisma on Command” to 10M+ Subscribers, From Charging $10 for Seminars to Making Millions, Living in Brazil, Critical Early Decisions, and The Secret to Freedom (#817)",
  "link": "https://tim.blog/2025/06/25/charlie-houpert-charisma-on-command/",
  "description": "Interview with Nsima Inyang, Mutant and Movement Coach! The post 4-Hour Workweek Success Stories — Charlie Houpert on Building “Charisma on Command” to 10M+ Subscribers, From Charging $10 for Seminars to Making Millions, Living in Brazil, Critical Early Decisions, and The Secret to Freedom (#817) appeared first on The Blog of Author Tim Ferriss.",
  "author": "Tim Ferriss",
  "published": "Wed, 25 Jun 2025 13:44:26 +0000",
  "source": "https://tim.blog/feed/",
  "categories": [
    "The Tim Ferriss Show",
    "charisma on command",
    "Charlie Houpert"
  ],
  "byline": "Tim Ferriss",
  "length": 29682,
  "excerpt": "Interview with Nsima Inyang, Mutant and Movement Coach!",
  "siteName": "The Blog of Author Tim Ferriss",
  "favicon": "https://i0.wp.com/tim.blog/wp-content/uploads/2019/12/cropped-site-icon-tim-ferriss-2.png?fit=192%2C192\u0026ssl=1",
  "text": "“Do I choose myself in the face of the world offering me all of this temptation to be something else?”— Charlie Houpert Charlie Houpert (@charliehoupert) is the co-founder of Charisma on Command, a company that helps people develop confidence, charisma, and strong social skills. Originally launched as a 4-Hour Workweek-inspired “muse,” it has since grown into one of the largest platforms for social skills and confidence training, with more than 10 million YouTube subscribers worldwide and more than a billion views across its content in six languages. His flagship course, Charisma University, has guided more than 30,000 members through practical steps to become more magnetic. Charlie was once voted “Most Likely to Break Out of His Shell” and began studying charisma to overcome his own social anxiety. He now explores the deeper roots of confidence through archetypal psychology, embodiment practices, and more. Please enjoy! Listen to the episode on Apple Podcasts, Spotify, Overcast, Podcast Addict, Pocket Casts, Castbox, YouTube Music, Amazon Music, Audible, or on your favorite podcast platform. Watch the interview on YouTube here. The transcript of this episode can be found here. Transcripts of all episodes can be found here. This episode is brought to you by Patagonia’s call-to-action to protect America’s public lands. Go to Patagonia.com/Tim to learn more and act now. The episode is also brought to you by Monarch Money’s all-in-one financial tool to help you track, budget, plan, and do more with your money and by LinkedIn Jobs recruitment platform with 1B+ users. 4-Hour Workweek Success Stories — Charlie Houpert on Building “Charisma on Command” to 10M+ Subscribers, From Charging $10 for Seminars to Making Millions, Living in Brazil, Critical Early Decisions, and The Secret to Freedom This message is brought to you by Patagonia. I’m always asked by listeners what helps me reset, feel grounded, recover from setbacks, or simply feel at peace. Without a doubt, it’s going into nature, usually with my pup Molly. For many millions of Americans, myself included, our national-park system is the best place to do just that.  Our public lands cover nearly a third of our country’s landmass. With more than 433 national-park sites, there’s a ton to explore, whether you’re fishing, hiking, or just camping with family.And the best thing about our parks? As Americans, we collectively own them. This means we can visit and enjoy them any time we want.  For more than a century, our government has protected our public lands by holding them in a public trust. But it’s becoming harder and less safe for us to access these awe-inspiring places. Congress is preparing to vote on a bill that would force the sale of millions of acres of public lands to, among other things, fund tax breaks for billionaires. If approved, the bill could trigger the largest single sale of national public lands in modern history.  Please join me and thousands of other Americans who are speaking up to protect our public lands. Visit patagonia.com/Tim to learn more. This episode is brought to you by Monarch Money! Traditional budgeting apps can help, but they don’t compare to the complete financial command center you get with this episode’s sponsor, Monarch Money. Monarch is like your own personal CFO, giving you full visibility and control so you can stop merely earning and start growing. Monarch was named The Wall Street Journal’s Best Budgeting App of 2025, and it’s the top-recommended personal finance app by users and experts, with more than 30,000 5-star reviews. Get control of your overall finances with Monarch Money. Use code TIM at monarchmoney.com/Tim for half off your first year. This episode is brought to you by LinkedIn Jobs. Whether you are looking to hire now for a critical role or thinking about needs that you may have in the future, LinkedIn Jobs can help. LinkedIn screens candidates for the hard and soft skills you’re looking for and puts your job in front of candidates looking for job opportunities that match what you have to offer. Using LinkedIn’s active community of more than 1 billion professionals worldwide, LinkedIn Jobs can help you find and hire the right person faster. When your business is ready to make that next hire, find the right person with LinkedIn Jobs. And now, you can post a job for free. Just visit LinkedIn.com/Tim. Want to hear another episode with someone who understands social dynamics and influenced Charlie’s entrepreneurial path? Listen to my conversation with bestselling author Neil Strauss, in which we discussed his creative process, conducting engaging interviews, overcoming writer’s block, maximizing creative output, and much more. What was your favorite quote or lesson from this episode? Please let me know in the comments. SELECTED LINKS FROM THE EPISODE Connect with Charlie Houpert: Charisma on Command | Charisma University | Dropping In Podcast | Improv \u0026 Dragons | YouTube | Twitter | Instagram | LinkedIn The transcript of this episode can be found here. Transcripts of all episodes can be found here. Companies, Organizations, and Brands Charisma on Command: a personal development company and YouTube channel focused on enhancing charisma and communication skills through online courses and content. Skillshare: an online learning platform offering thousands of creative and business courses taught by industry experts. TrepStar: an on-demand media fulfillment service specializing in short-run CD, DVD, and USB manufacturing and shipping. Chipotle: a fast-casual Mexican restaurant chain known for customizable burritos, bowls, and tacos made with responsibly sourced ingredients. Airbnb: a global online marketplace connecting travelers with hosts offering unique accommodations and experiences. Google (Adwords): Google’s online advertising platform, now called Google Ads, that enables businesses to display ads across Google’s network. SamCart: an e-commerce platform designed specifically for selling digital products with conversion-optimized checkout experiences and upselling features. Marvel: a multimedia entertainment company famous for its superhero franchises, comic books, and blockbuster film universe. Lexus: Toyota’s luxury vehicle division known for premium cars, SUVs, and hybrid technology with emphasis on craftsmanship and reliability. Patek Philippe: a prestigious Swiss luxury watch manufacturer renowned for creating some of the world’s most expensive and collectible timepieces. Boeing: an American multinational aerospace corporation that designs, manufactures, and sells commercial airplanes, defense systems, and space technology. Whole Foods: an upscale grocery chain specializing in organic and natural products, known for high-quality foods and health-conscious shopping experience. Blogs, Websites, and Online Platforms KickAss Academy: the original domain name for Charlie’s personal development blog and business before rebranding to Charisma on Command. Reddit: a social news aggregation and discussion platform where users can share content and engage in community discussions across thousands of topics. Clarity.fm: an on-demand consulting platform that connects entrepreneurs with industry experts for paid phone consultations, featuring advisors like Mark Cuban and Eric Ries. WordPress: the world’s most popular content management system, powering over 40% of websites with flexible themes and plugins for building any type of site. vBulletin: a commercial forum software package that enables communities to create feature-rich discussion boards with advanced moderation and customization tools. The Last Psychiatrist: an influential anonymous blog by psychiatrist Dr. Chris Ballas that offered penetrating cultural criticism and psychological analysis from 2007-2014. Cracked: a humor website known for its comedic articles, lists, and videos that blend entertainment with surprising insights and historical facts. Courses and Programs Charisma University: Charlie’s flagship online course teaching practical charisma and communication skills through step-by-step training modules, exercises, and real-world application techniques. Marketing Step-by-Step: Eben Pagan’s comprehensive entrepreneurial marketing course covering psychology-driven strategies for customer acquisition, conversion, and business growth. Art of Accomplishment: Joe Hudson’s transformational coaching program blending neuroscience, psychology, and spiritual practices to help high-performers break through limiting patterns and emotional barriers. Books The 4-Hour Workweek: Escape 9-5, Live Anywhere, and Join the New Rich by Timothy Ferriss The 4-Hour Body: An Uncommon Guide to Rapid Fat-Loss, Incredible Sex, and Becoming Superhuman by Timothy Ferriss The Game: Penetrating the Secret Society of Pickup Artists by Neil Strauss I Hope They Serve Beer in Hell by Tucker Max Essentialism: The Disciplined Pursuit of Less by Greg McKeown Influence: The Psychology of Persuasion by Robert Cialdini The Six Pillars of Self-Esteem: The Definitive Work on Self-Esteem by the Leading Pioneer in the Field by Nathaniel Branden The Prophet by Kahlil Gibran Running Lean: Iterate from Plan A to a Plan That Works by Ash Maurya How to Win Friends and Influence People: Updated For the Next Generation of Leaders by Dale Carnegie The 80/20 Principle: The Secret to Achieving More with Less by Richard Koch Who: The A Method for Hiring by Geoff Smart and Randy Street Entrepreneur Magazine’s Young Millionaires: Inspiring Stories to Ignite Your Entrepreneurial Dreams by Rieva Lesonsky History of the Peloponnesian War by Thucydides Tested Advertising Methods by John Caples Joint Ventures: From Mediocrity to Millions by Jay Abraham (PDF) Let My People Go Surfing: The Education of a Reluctant Businessman by Yvon Chouinard Losing My Virginity: How I Survived, Had Fun, and Made a Fortune Doing Business My Way by Richard Branson The Angels Knocking on the Tavern Door: Thirty Poems of Hafez by Hafez Movies, TV Shows, and Media Inception: Christopher Nolan’s mind-bending heist thriller about extracting and planting ideas through shared dreaming, featuring layered dream sequences within dreams and Leonardo DiCaprio’s reality-questioning performance. Casino Royale (2006): the James Bond reboot featuring an iconic eight-minute parkour chase sequence with freerunner Sébastien Foucan that inspired Charlie’s first business idea for parkour training DVDs. Game of Thrones: HBO’s fantasy epic whose complex characters like Jon Snow and Tyrion Lannister became perfect subjects for Charlie’s “fame-jacking” YouTube strategy, borrowing existing audience attention. The Tim Ferriss Experiment: My reality TV show where I attempted to master various skills in record time, including a particularly cringe-worthy episode about dating and cold approach techniques. True Detective: the philosophical crime drama that was referenced in one of The Last Psychiatrist‘s characteristically penetrating blog post titles, blending pop culture with psychological analysis. Improv \u0026 Dragons: Charlie’s own YouTube series combining improvisational comedy with Dungeons \u0026 Dragons gameplay, showcasing his evolution from consumer to creator of entertaining content. People Neil Strauss: author of The Game, a controversial exploration of pickup artist culture that inadvertently became a masterclass in social psychology and persuasion techniques. Neville Medhora: a copywriter and entrepreneur who founded Copywriting Course after helping AppSumo achieve their highest sales days through psychological email marketing. Tony Robbins: legendary motivational speaker and life coach known for transforming human potential through neurolinguistic programming and peak performance strategies. Tucker Max: bestselling author of I Hope They Serve Beer in Hell and master of provocative personal branding who provided Charlie crucial early feedback on his business positioning. Eben Pagan: marketing strategist and entrepreneur who created the “Marketing Step-by-Step” course that influenced Charlie’s rebranding to Charisma on Command, known for alliterative branding techniques. David DeAngelo: Eben Pagan’s pseudonym under which he wrote Double Your Dating, demonstrating early personal branding strategies in the dating advice industry. Ryan Holiday: bestselling author and marketing expert who was working as Tucker Max’s research assistant when I first encountered Tucker’s unconventional approach. Brian Chesky: co-founder and CEO of Airbnb, renowned for his philosophy of “doing things that don’t scale” in the early stages of building disruptive businesses. Clay Collins: online course creator who developed influential frameworks for pre-selling courses before creating them, providing Charlie with strategic product launch methodologies. Avicii: Swedish DJ and electronic music producer whose live performance Charlie witnessed during his transformational first visit to Las Vegas. Bill Clinton: 42nd President of the United States whose masterful eye contact techniques in political debates became the subject of one of Charlie’s breakthrough YouTube videos. Greg McKeown: author of Essentialism, advocating for the disciplined pursuit of less but better through systematic prioritization and elimination strategies. Herbie: fictional character from Greg McKeown’s Essentialism representing the bottleneck principle – that improving the slowest part of any system dramatically improves overall performance. Donald Trump: businessman and 45th President whose communication style Charlie analyzed in a viral 2016 video predicting his electoral success, which tripled Charlie’s business. Scott Adams: creator of the Dilbert comic strip and master persuader who also predicted Trump’s victory early, demonstrating advanced understanding of cognitive biases. Conor McGregor: Irish UFC fighter whose psychological warfare tactics and charismatic self-promotion became frequent subjects of Charlie’s behavioral analysis videos. Robert Downey Jr.: Academy Award-nominated actor whose quick wit and magnetic interview presence provided rich material for Charlie’s charisma breakdowns. Gary Vaynerchuk: entrepreneur and social media expert who popularized the “jab, jab, jab, right hook” content strategy of providing value before making sales pitches. Mr. Beast: YouTube phenomenon whose data-driven approach to viral content creation and psychological thumbnail optimization represents modern digital storytelling mastery. David Ogilvy: legendary advertising executive known as the “Father of Advertising” whose timeless principles of persuasion continue influencing modern marketing. Keanu Reeves: the perfect example of an introvert who exudes confidence despite being quiet and somewhat reclusive. Brené Brown: research professor and author whose insights on vulnerability and courage include the wisdom that healthy relationships are never truly 50/50. Thucydides: ancient Greek historian whose philosophy inspired Charlie’s tattoo: “The secret to freedom is courage” — representing the intersection of wisdom and personal transformation. Joe Hudson: executive coach and creator of Art of Accomplishment who guided Charlie through the complex emotional and strategic challenges of buying out his business co-founder. Sam Altman: CEO of OpenAI who publicly endorsed Joe Hudson’s work through social media, validating the psychological frameworks Charlie was learning. Nathaniel Branden: psychologist and author of The Six Pillars of Self-Esteem whose sentence completion exercises helped Charlie excavate limiting beliefs and unconscious patterns. Jay Abraham: business strategist and “old-school” marketing coach who challenged Charlie to create content worthy of being consumed by the people who had influenced him. Kahlil Gibran: Lebanese-American writer and philosopher, author of The Prophet, whose poetic wisdom on human nature continues influencing spiritual and personal development. Dale Carnegie: author of the timeless classic How to Win Friends and Influence People, establishing foundational principles for human relationship dynamics and social influence. Hafez: Persian lyrical poet from Shiraz, considered one of the greatest masters of the ghazal form, whose mystical and romantic verses exploring love, wine, and spiritual yearning have influenced literature for over 600 years. Martha Beck: life coach and author known for integrating ancient wisdom with modern psychological techniques. Brandon Sanderson: prolific fantasy author whose systematic approach to world-building and storytelling demonstrates the intersection of creativity and methodical execution. Richard Koch: author of The 80/20 Principle, advocating for identifying the vital few inputs that generate the majority of meaningful outputs in any system. Yvon Chouinard: founder of Patagonia and author of Let My People Go Surfing, demonstrating how authentic values can drive both business success and environmental activism. Ricardo Semler: Brazilian CEO who revolutionized corporate culture through radical workplace democracy, inspiring alternative approaches to business leadership and organizational design. Richard Branson: founder of Virgin Group whose scrappy, unconventional approach to starting an airline exemplifies entrepreneurial resourcefulness and bold risk-taking. Diana Chapman: executive coach whose interview on this show explored advanced techniques for integrating emotional intelligence with rational decision-making. Sigmund Freud and Carl Jung: pioneering psychoanalysts whose exploration of the unconscious mind inspired Charlie’s Dungeons \u0026 Dragons character “Sigmund,” blending psychology with creative expression. Charlie Hoehn: entrepreneur, 4x New York Times bestselling editor, co-founder of Author.Inc, and my former Director of Special Projects. Places and Venues Washington, DC: the capital of the United States, known for its federal government, historic monuments, and vibrant political and cultural scene. H Street (in DC): a historic corridor in Northeast Washington DC known for its diverse dining scene, nightlife, and cultural venues stretching from Union Station to the Anacostia River. New York City, NY: the most populous city in the United States, renowned as a global center for finance, arts, fashion, and culture. Lower East Side, NYC: a historic Manhattan neighborhood known for its immigrant heritage, trendy restaurants, bars, and mix of affordable and luxury housing. Brazil: the largest country in South America, famous for its Amazon rainforest, vibrant culture, beaches, and cities like Rio de Janeiro and São Paulo. Rio de Janeiro, Brazil: Brazil’s iconic coastal city famous for its stunning beaches, Christ the Redeemer statue, Carnival celebration, and dramatic mountain landscapes. Floripa (Florianópolis), Brazil: the capital of Santa Catarina state, known as the “Magic Island” for its beautiful beaches, technology hub, and high quality of life. Las Vegas, NV: the entertainment capital of the world, famous for its casinos, shows, nightlife, and extravagant themed hotels along the Las Vegas Strip. Vancouver, Canada: a major West Coast seaport city known for its natural beauty, mild climate, diverse culture, and proximity to mountains and ocean. Colombia: a South American country known for its diverse landscapes from Caribbean coastlines to Amazon rainforest, vibrant cities, and rich cultural heritage. Pennsylvania: a Mid-Atlantic U.S. state known for its historical significance, including Philadelphia’s Independence Hall and the Liberty Bell. Los Angeles, CA: the second-largest city in the United States, famous for Hollywood, entertainment industry, beaches, and diverse neighborhoods. XS (Nightclub in Las Vegas): an upscale nightclub at Encore Las Vegas known for its luxurious indoor-outdoor design, celebrity DJ performances, and high-end bottle service. UNLV (University of Nevada, Las Vegas): a public research university known for its hospitality, business, and engineering programs, as well as its Runnin’ Rebels basketball team. South by Southwest (SXSW): an annual conglomeration of interactive media, music, and film festivals and conferences held in Austin, Texas. UT Austin: the University of Texas at Austin, a top-tier public research university known for its academics, athletics, and vibrant campus culture. San Francisco / Bay Area: a northern California region known for its tech industry, iconic Golden Gate Bridge, diverse culture, and steep hills. Concepts, Ideas, and Frameworks Management Consulting: a professional service where experts analyze organizational problems and provide strategic solutions to improve business performance and efficiency. The Muse: concept from The 4-Hour Workweek for creating an automated, low-maintenance business that generates passive income while requiring minimal ongoing involvement. Scratch-Your-Own-Itch: the entrepreneurial philosophy of solving a problem you personally experience, ensuring product-market fit by building something you genuinely want and need. Moonlighting: the practice of working a side business or project while maintaining full-time employment, allowing entrepreneurs to test ideas with reduced financial risk. Burn the Ships: a commitment strategy inspired by historical military tactics, meaning to eliminate all options for retreat and force complete dedication to a new venture. Fear-Setting: My systematic exercise for defining worst-case scenarios, prevention strategies, and recovery plans to overcome decision paralysis and take calculated risks. The Game: Neil Strauss’ exploration of pickup artist culture and social dynamics, revealing psychological techniques for attraction and social influence. 10 out of 10 Upside: the component of fear-setting that focuses on envisioning and quantifying the best possible outcomes of taking action on a decision. Fame-Jacking: Charlie’s term for his YouTube strategy of creating content analyzing famous personalities to attract their fans and leverage existing audience interest. Tripwire: an online marketing strategy using a low-cost, high-value initial product to convert prospects into paying customers and establish a buying relationship. Jab, Jab, Jab, Right Hook: Gary Vaynerchuk’s content marketing philosophy of providing value repeatedly (jabs) before making sales pitches (right hooks) to build trust and engagement. The Herbie Parable: a story from Essentialism about identifying and addressing the primary bottleneck in any system to improve overall performance and efficiency. Audience Capture: the phenomenon where content creators become trapped by their audience’s expectations, leading to creative stagnation and burnout as they chase engagement over authenticity. 50/50 Partnership Split: the commonly problematic business arrangement where two partners share equal ownership despite rarely contributing equally, often leading to disputes and power struggles. Sentence Completion Exercises: a psychological technique from The Six Pillars of Self-Esteem using open-ended prompts to uncover subconscious thoughts and limiting beliefs. Shotgun Deal: a business partnership buyout mechanism where one partner names a price and the other must either accept or buy them out at the same price, forcing fair valuation. Mimetic Desire: René Girard’s theory that humans copy the desires of others rather than developing authentic wants, creating cycles of competition and social imitation. Relevant Resources BC-X Parkour Philosophy of Continuous Learning | Charlie Houpert Fear-Setting: The Most Valuable Exercise I Do Every Month | Tim Ferriss Step 1 for Living a Kickass Life: Stop “Just Being Yourself” | KickAss Academy I Hired a Pickup Artist to Help Me Find a Girlfriend | The Tim Ferriss Experiment #7 The Secret Of Bill Clinton’s Charisma | Charisma on Command The Listener by James Christensen | The Collection Shop Why Trump Will SMASH Hillary | Charisma on Command How To Build Unwavering Confidence | Charisma on Command Ranking the Most Charismatic Players In Game of Thrones | Charisma on Command How to Make a Disrespectful Person Look Insecure for Insulting You | Charisma on Command How to Look Extremely Confident (Even if You’re Quiet) | Charisma on Command Brené Brown — Striving versus Self-Acceptance, Saving Marriages, and More | The Tim Ferriss Show #409 The Maintenance of Certification Exam as Fetish | The Last Psychiatrist Ten Extra Seconds Would Have Saved True Detective’s Finale | The Last Psychiatrist Advertising’s Collateral Damage | The Last Psychiatrist If You’re Watching, It’s For You | The Last Psychiatrist Joe Hudson: How to be More Emotionally Intelligent (Without Trying so Hard) | Twitter Filling the Void: Thoughts on Learning and Karma | Tim Ferriss Martha Beck — The Amazing and Brutal Results of Zero Lies for 365 Days, How to Do a Beginner “Integrity Cleanse,” Lessons from Lion Trackers, and Novel Tactics for Reducing Anxiety | The Tim Ferriss Show #732 Brandon Sanderson on Building a Fiction Empire, Creating $40M+ Kickstarter Campaigns, Unbreakable Habits, The Art of World-Building, and The Science of Magic Systems | The Tim Ferriss Show #794 Diana Chapman — How to Get Unstuck, Do “The Work,” Take Radical Responsibility, and Reduce Drama in Your Life | The Tim Ferriss Show #536 SHOW NOTES [00:00:00] Start. [00:06:44] Charlie meets the boogeyman (me). [00:10:11] Why defaulting to management consulting after college felt like daily self-betrayal. [00:13:21] Leaping into parkour training via DVD as a first business attempt. [00:15:45] Moonlighting vs. burning-ships entrepreneurship. [00:16:54] Negotiating remote work with a 90% raise. [00:21:22] Charlie moves to New York and kicks off KickAss Academy. [00:22:16] Airbnb survival tactics while living in a 396 sq. ft. apartment. [00:23:26] Using the fear-setting exercise and other disaster-mitigation strategies. [00:26:11] Charlie’s first blog post and crossing the publishing Rubicon. [00:28:26] How Charlie’s first in-person class prompted an accidental business model. [00:34:21] 10 go-getters make an ambitious move to Brazil. [00:32:14] The daily growth whiteboard system. [00:37:58] How a harsh Tucker Max consultation galvanized the rebranding to Charisma on Command. [00:44:39] From financial downturn to pre-selling a course for $12,500. [00:50:44] Finally making enough money to chase summer in six-to-eight-month increments. [00:52:00] Enjoying the sustainable benefits of creating timeless content. [00:54:05] How Bill Clinton seduced 7,000 people into following Charlie on YouTube. [00:55:46] How Greg McKeown’s Essentialism helped solve Charlie’s “Herbie” problem. [00:58:26] Evolving funnel flow and fame-jacking. [01:03:46] YouTube algorithm changes, short-form content, and maintaining audience trust for the long term. [01:10:58] Why I still create this podcast. [01:19:30] The dangers of succumbing entirely to audience expectation over authenticity. [01:21:42] The catalysts that led to time off, an ayahuasca retreat, and a seven-year transformation process. [01:30:26] Making the transition from 50/50 partner to sole owner. [01:35:16] Recommended reading: Six Pillars of Self-Esteem by Nathaniel Branden [01:37:32] The influence of The Last Psychiatrist blog. [01:41:46] Jay Abraham coaching: “Make it good enough for Tim Ferriss.” [01:43:52] How testimonials added a 4x conversion lift. [01:44:31] Coming to an agreement with the co-founder. [01:47:20] Joe Hudson and the Art of Accomplishment. [01:51:57] Why I stand by The 4-Hour Workweek without further revision, warts and all. [01:55:06] Exercising gratitude even when receiving praise is difficult. [01:59:15] Relationship with earlier work: video vs. writing. [02:02:05] Don’t miss “Filling the Void.” [02:03:56] More recommended reading. [02:06:43] Improv \u0026 Dragons. [02:08:06] Charlie’s billboard: “Don’t think, feel.” [02:08:57] Parting thoughts. MORE CHARLIE HOUPERT QUOTES FROM THE INTERVIEW “Do I choose myself in the face of the world offering me all of this temptation to be something else?”— Charlie Houpert “If you don’t believe in it fully, you’re going to sell it with hesitancy.”— Charlie Houpert “Don’t think, feel. I know that’s counterintuitive to a lot of people, but lately, that’s been my guiding principle is feel my heart, feel my gut, think from my mind, and try to find some union of the three to move forward.”— Charlie Houpert “When you start trading your beliefs for cash or approval, you’re just sending a signal that, ‘I can’t be relied on to be myself and be safe and earn.'”— Charlie Houpert The Tim Ferriss Show is one of the most popular podcasts in the world with more than one billion downloads. It has been selected for \"Best of Apple Podcasts\" three times, it is often the #1 interview podcast across all of Apple Podcasts, and it's been ranked #1 out of 400,000+ podcasts on many occasions. To listen to any of the past episodes for free, check out this page.",
  "image": "https://tim.blog/wp-content/uploads/2025/06/Charlie-Houpert-Illustration-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle id=\"post-110057\"\u003e\n\t\t\n\n\t\u003cdiv\u003e\n\t\t\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe data-placeholder-image=\"https://tim.blog/wp-content/uploads/complianz/placeholders/youtubegxkjMnSCg3k-maxresdefault.webp\" data-category=\"marketing\" data-service=\"youtube\" data-cmplz-target=\"src\" data-src-cmplz=\"https://www.youtube.com/embed/gxkjMnSCg3k?feature=oembed\" title=\"4-Hour Workweek Success Story — Charlie Houpert \u0026amp; Building “Charisma on Command” to 10M+ Subscribers\" width=\"600\" height=\"338\" src=\"about:blank\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003e“Do I choose myself in the face of the world offering me all of this temptation to be something else?”\u003c/strong\u003e\u003cbr/\u003e— Charlie Houpert\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eCharlie Houpert\u003c/strong\u003e (\u003ca target=\"_blank\" href=\"https://x.com/CharlieHoupert\"\u003e@charliehoupert\u003c/a\u003e) is the co-founder of \u003ca target=\"_blank\" href=\"https://www.youtube.com/user/charismaoncommand\"\u003e\u003cstrong\u003eCharisma on Command\u003c/strong\u003e\u003c/a\u003e, a company that helps people develop confidence, charisma, and strong social skills. Originally launched as a \u003cem\u003e4-Hour Workweek\u003c/em\u003e-inspired “muse,” it has since grown into one of the largest platforms for social skills and confidence training, with more than 10 million YouTube subscribers worldwide and more than a billion views across its content in six languages. His flagship course, \u003ca target=\"_blank\" href=\"https://www.charismaoncommand.com/coc-charisma-university/\"\u003eCharisma University\u003c/a\u003e, has guided more than 30,000 members through practical steps to become more magnetic.\u003c/p\u003e\n\n\n\n\u003cp\u003eCharlie was once voted “Most Likely to Break Out of His Shell” and began studying charisma to overcome his own social anxiety. He now explores the deeper roots of confidence through archetypal psychology, embodiment practices, and more.\u003c/p\u003e\n\n\n\n\u003cp\u003ePlease enjoy!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eListen to the episode on \u003ca target=\"_blank\" href=\"https://podcasts.apple.com/us/podcast/817-4-hour-workweek-success-stories-charlie-houpert/id863897795?i=1000714477493\"\u003eApple Podcasts\u003c/a\u003e, \u003ca target=\"_blank\" href=\"https://open.spotify.com/episode/1mQZDKcmAeXXqELsia1k9d?si=XN7jR1H1SCmji2PAYUFI2Q\"\u003eSpotify\u003c/a\u003e, \u003ca href=\"https://overcast.fm/+AAKebte-S-I\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eOvercast\u003c/a\u003e, \u003ca href=\"https://podcastaddict.com/podcast/2031148#\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePodcast Addict\u003c/a\u003e, \u003ca href=\"https://pca.st/timferriss\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePocket Casts\u003c/a\u003e, \u003ca href=\"https://castbox.fm/channel/id1059468?country=us\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCastbox\u003c/a\u003e, \u003ca target=\"_blank\" href=\"https://music.youtube.com/playlist?list=PLuu6fDad2eJyWPm9dQfuorm2uuYHBZDCB\"\u003eYouTube Music\u003c/a\u003e, \u003ca href=\"https://music.amazon.com/podcasts/9814f3cc-1dc5-4003-b816-44a8eb6bf666/the-tim-ferriss-show\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAmazon Music\u003c/a\u003e, \u003ca href=\"https://www.audible.com/podcast/The-Tim-Ferriss-Show/B08K58QX5W\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAudible\u003c/a\u003e, or on your favorite podcast platform.  \u003ca target=\"_blank\" href=\"https://youtu.be/gxkjMnSCg3k\"\u003eWatch the interview on YouTube here\u003c/a\u003e. The transcript of this episode \u003ca href=\"https://tim.blog/2025/06/25/charlie-houpert-charisma-on-command-transcript/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ecan be found here\u003c/a\u003e. Transcripts of all episodes \u003ca href=\"https://tim.blog/2018/09/20/all-transcripts-from-the-tim-ferriss-show/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ecan be found here\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by \u003c/strong\u003e\u003ca href=\"https://www.patagonia.com/tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003ePatagonia\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e’s call-to-action to protect America’s public lands. \u003c/strong\u003e\u003ca href=\"https://www.patagonia.com/tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eGo to Patagonia.com/Tim to learn more and act now\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe episode is also brought to you by \u003ca href=\"https://www.monarchmoney.com/tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMonarch Money\u003c/a\u003e’s all-in-one financial tool to help you track, budget, plan, and do more with your money and by  \u003ca href=\"https://linkedin.com/tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLinkedIn Jobs\u003c/a\u003e recruitment platform with 1B+ users. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\u003cdiv\u003e\u003cp\u003e4-Hour Workweek Success Stories — Charlie Houpert on Building “Charisma on Command” to 10M+ Subscribers, From Charging $10 for Seminars to Making Millions, Living in Brazil, Critical Early Decisions, and The Secret to Freedom\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eThis message is brought to you by \u003ca target=\"_blank\" href=\"https://patagonia.com/tim\"\u003ePatagonia\u003c/a\u003e. \u003c/strong\u003eI’m always asked by listeners what helps me reset, feel grounded, recover from setbacks, or simply feel at peace. Without a doubt, it’s going into nature, usually with my pup Molly. For many millions of Americans, myself included, our national-park system is the best place to do just that.  Our public lands cover nearly a third of our country’s landmass. With more than 433 national-park sites, there’s a ton to explore, whether you’re fishing, hiking, or just camping with family.\u003c/p\u003e\u003cp\u003eAnd the best thing about our parks? As Americans, we collectively own them. This means we can visit and enjoy them any time we want.  For more than a century, our government has protected our public lands by holding them in a public trust. But it’s becoming harder and less safe for us to access these awe-inspiring places. \u003c/p\u003e\u003cp\u003e\u003cstrong\u003eCongress is preparing to vote on a bill that would force the sale of millions of acres of public lands\u003c/strong\u003e to, among other things, fund tax breaks for billionaires. If approved, the bill could trigger the largest single sale of national public lands in modern history. \u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003ePlease join me and thousands of other Americans who are speaking up to protect our public lands. Visit \u003ca target=\"_blank\" href=\"https://patagonia.com/tim\"\u003epatagonia.com/Tim\u003c/a\u003e to learn more. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by \u003ca target=\"_blank\" href=\"http://monarchmoney.com/tim\"\u003eMonarch Money\u003c/a\u003e! \u003c/strong\u003eTraditional budgeting apps can help, but they don’t compare to the complete financial command center you get with this episode’s sponsor, \u003ca target=\"_blank\" href=\"http://monarchmoney.com/tim\"\u003eMonarch Money\u003c/a\u003e. Monarch is like your own personal CFO, giving you full visibility and control so you can stop merely earning and start growing.\u003c/p\u003e\n\n\n\n\u003cp\u003eMonarch was named \u003cem\u003eThe Wall Street Journal\u003c/em\u003e’s Best Budgeting App of 2025, and it’s the top-recommended personal finance app by users and experts, with more than 30,000 5-star reviews. \u003cstrong\u003eGet control of your overall finances with Monarch Money. \u003ca target=\"_blank\" href=\"http://monarchmoney.com/tim\"\u003eUse code TIM at monarchmoney.com/Tim for half off your first year\u003c/a\u003e. \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThis episode is brought to you by \u003c/strong\u003e\u003ca rel=\"noreferrer noopener\" href=\"https://linkedin.com/Tim\" target=\"_blank\"\u003e\u003cstrong\u003eLinkedIn Jobs\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e.\u003c/strong\u003e Whether you are looking to hire now for a critical role or thinking about needs that you may have in the future, \u003ca rel=\"noreferrer noopener\" href=\"https://linkedin.com/Tim\" target=\"_blank\"\u003eLinkedIn Jobs\u003c/a\u003e can help. LinkedIn screens candidates for the hard and soft skills you’re looking for and puts your job in front of candidates looking for job opportunities that match what you have to offer.\u003c/p\u003e\n\n\n\n\u003cp\u003eUsing LinkedIn’s active community of more than 1 billion professionals worldwide, \u003ca href=\"https://linkedin.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eLinkedIn Jobs\u003c/strong\u003e\u003c/a\u003e can help you find and hire the right person faster. \u003cstrong\u003eWhen your business is ready to make that next hire, find the right person with LinkedIn Jobs. And now, you can post a job for free.\u003c/strong\u003e \u003ca href=\"https://linkedin.com/Tim\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eJust visit LinkedIn.com/Tim\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://tim.blog/2014/06/24/neil-strauss/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWant to hear\u003c/a\u003e another episode with someone who understands social dynamics and influenced Charlie’s entrepreneurial path?\u003c/strong\u003e Listen to my conversation with bestselling author \u003ca href=\"https://tim.blog/2014/06/24/neil-strauss/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cstrong\u003eNeil Strauss\u003c/strong\u003e\u003c/a\u003e, in which we discussed his creative process, conducting engaging interviews, overcoming writer’s block, maximizing creative output, \u003ca href=\"https://tim.blog/2014/06/24/neil-strauss/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eand much more\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eWhat was your favorite quote or lesson from this episode? Please let me know \u003ca href=\"#respond\"\u003ein the comments\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003ch3\u003eSELECTED LINKS FROM THE EPISODE\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eConnect with \u003cstrong\u003eCharlie Houpert\u003c/strong\u003e:\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.charismaoncommand.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCharisma on Command\u003c/a\u003e | \u003ca href=\"https://www.charismaoncommand.com/coc-charisma-university/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCharisma University\u003c/a\u003e | \u003ca href=\"https://www.youtube.com/@DroppingInPodcast/videos\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDropping In Podcast\u003c/a\u003e | \u003ca href=\"https://www.youtube.com/@ImprovnDragons\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eImprov \u0026amp; Dragons\u003c/a\u003e | \u003ca href=\"https://www.youtube.com/@Charismaoncommand\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eYouTube\u003c/a\u003e | \u003ca href=\"https://twitter.com/CharlieHoupert\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTwitter\u003c/a\u003e | \u003ca href=\"https://www.instagram.com/charliehoupert/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eInstagram\u003c/a\u003e | \u003ca href=\"https://www.linkedin.com/in/charliehoupert\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLinkedIn\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eThe transcript of this episode \u003ca href=\"https://tim.blog/2025/06/25/charlie-houpert-charisma-on-command-transcript/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ecan be found here\u003c/a\u003e. Transcripts of all episodes \u003ca href=\"https://tim.blog/2018/09/20/all-transcripts-from-the-tim-ferriss-show/#content\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ecan be found here\u003c/a\u003e.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003ch3\u003eCompanies, Organizations, and Brands\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.charismaoncommand.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCharisma on Command\u003c/a\u003e: a personal development company and YouTube channel focused on enhancing charisma and communication skills through online courses and content.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.skillshare.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSkillshare\u003c/a\u003e: an online learning platform offering thousands of creative and business courses taught by industry experts.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.trepstar.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTrepStar\u003c/a\u003e: an on-demand media fulfillment service specializing in short-run CD, DVD, and USB manufacturing and shipping.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.chipotle.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eChipotle\u003c/a\u003e: a fast-casual Mexican restaurant chain known for customizable burritos, bowls, and tacos made with responsibly sourced ingredients.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.airbnb.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAirbnb\u003c/a\u003e: a global online marketplace connecting travelers with hosts offering unique accommodations and experiences.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://ads.google.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGoogle (Adwords)\u003c/a\u003e: Google’s online advertising platform, now called Google Ads, that enables businesses to display ads across Google’s network.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.samcart.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSamCart\u003c/a\u003e: an e-commerce platform designed specifically for selling digital products with conversion-optimized checkout experiences and upselling features.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.marvel.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMarvel\u003c/a\u003e: a multimedia entertainment company famous for its superhero franchises, comic books, and blockbuster film universe.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.lexus.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLexus\u003c/a\u003e: Toyota’s luxury vehicle division known for premium cars, SUVs, and hybrid technology with emphasis on craftsmanship and reliability.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.patek.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePatek Philippe\u003c/a\u003e: a prestigious Swiss luxury watch manufacturer renowned for creating some of the world’s most expensive and collectible timepieces.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.boeing.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBoeing\u003c/a\u003e: an American multinational aerospace corporation that designs, manufactures, and sells commercial airplanes, defense systems, and space technology.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.wholefoodsmarket.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWhole Foods\u003c/a\u003e: an upscale grocery chain specializing in organic and natural products, known for high-quality foods and health-conscious shopping experience.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eBlogs, Websites, and Online Platforms\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://web.archive.org/web/20120810010244/http://www.kickassacademy.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKickAss Academy\u003c/a\u003e: the original domain name for Charlie’s personal development blog and business before rebranding to Charisma on Command.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.reddit.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eReddit\u003c/a\u003e: a social news aggregation and discussion platform where users can share content and engage in community discussions across thousands of topics.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://clarity.fm/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eClarity.fm\u003c/a\u003e: an on-demand consulting platform that connects entrepreneurs with industry experts for paid phone consultations, featuring advisors like Mark Cuban and Eric Ries.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://wordpress.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWordPress\u003c/a\u003e: the world’s most popular content management system, powering over 40% of websites with flexible themes and plugins for building any type of site.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.vbulletin.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003evBulletin\u003c/a\u003e: a commercial forum software package that enables communities to create feature-rich discussion boards with advanced moderation and customization tools.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thelastpsychiatrist.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Last Psychiatrist\u003c/a\u003e: an influential anonymous blog by psychiatrist Dr. Chris Ballas that offered penetrating cultural criticism and psychological analysis from 2007-2014.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.cracked.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCracked\u003c/a\u003e: a humor website known for its comedic articles, lists, and videos that blend entertainment with surprising insights and historical facts.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eCourses and Programs\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.charismaoncommand.com/c-university/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCharisma University\u003c/a\u003e: Charlie’s flagship online course teaching practical charisma and communication skills through step-by-step training modules, exercises, and real-world application techniques.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://ebenpagantraining.com/product/marketing-step-by-step/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMarketing Step-by-Step\u003c/a\u003e: Eben Pagan’s comprehensive entrepreneurial marketing course covering psychology-driven strategies for customer acquisition, conversion, and business growth.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.artofaccomplishment.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eArt of Accomplishment\u003c/a\u003e: Joe Hudson’s transformational coaching program blending neuroscience, psychology, and spiritual practices to help high-performers break through limiting patterns and emotional barriers.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eBooks\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0307465357/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe 4-Hour Workweek: Escape 9-5, Live Anywhere, and Join the New Rich\u003c/em\u003e\u003c/a\u003e by Timothy Ferriss\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/030746363X/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe 4-Hour Body: An Uncommon Guide to Rapid Fat-Loss, Incredible Sex, and Becoming Superhuman\u003c/em\u003e\u003c/a\u003e by Timothy Ferriss\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0060554738/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe Game: Penetrating the Secret Society of Pickup Artists\u003c/em\u003e\u003c/a\u003e by Neil Strauss\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0806532254/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eI Hope They Serve Beer in Hell\u003c/em\u003e\u003c/a\u003e by Tucker Max\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0804137382/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eEssentialism: The Disciplined Pursuit of Less\u003c/em\u003e\u003c/a\u003e by Greg McKeown\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0062937650/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eInfluence: The Psychology of Persuasion\u003c/em\u003e\u003c/a\u003e by Robert Cialdini\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0553374397/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe Six Pillars of Self-Esteem: The Definitive Work on Self-Esteem by the Leading Pioneer in the Field\u003c/em\u003e\u003c/a\u003e by Nathaniel Branden\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0143133586/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe Prophet\u003c/em\u003e\u003c/a\u003e by Kahlil Gibran\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/1098108779/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eRunning Lean: Iterate from Plan A to a Plan That Works\u003c/em\u003e\u003c/a\u003e by Ash Maurya\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/1982171456/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eHow to Win Friends and Influence People: Updated For the Next Generation of Leaders\u003c/em\u003e\u003c/a\u003e by Dale Carnegie\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0385491743/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe 80/20 Principle: The Secret to Achieving More with Less\u003c/em\u003e\u003c/a\u003e by Richard Koch\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/gp/product/0345504194/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eWho: The A Method for Hiring\u003c/em\u003e\u003c/a\u003e by Geoff Smart and Randy Street\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/dp/1891984012/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eEntrepreneur Magazine’s Young Millionaires: Inspiring Stories to Ignite Your Entrepreneurial Dreams\u003c/em\u003e\u003c/a\u003e by Rieva Lesonsky\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/dp/0140440399/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eHistory of the Peloponnesian War\u003c/em\u003e\u003c/a\u003e by Thucydides\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/dp/B0DDTZ8VT2/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eTested Advertising Methods\u003c/em\u003e\u003c/a\u003e by John Caples\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://grumomedia.com/files/Jay_Abraham-From_Mediocrity_to_Millions.pdf\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eJoint Ventures: From Mediocrity to Millions\u003c/em\u003e\u003c/a\u003e by Jay Abraham (PDF)\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0143109677/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eLet My People Go Surfing: The Education of a Reluctant Businessman\u003c/em\u003e\u003c/a\u003e by Yvon Chouinard\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://amazon.com/dp/0307720748/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eLosing My Virginity: How I Survived, Had Fun, and Made a Fortune Doing Business My Way\u003c/em\u003e\u003c/a\u003e by Richard Branson\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003cem\u003e\u003ca href=\"https://www.amazon.com/dp/0061138843/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Angels Knocking on the Tavern Door: Thirty Poems of Hafez\u003c/a\u003e\u003c/em\u003e by Hafez\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eMovies, TV Shows, and Media\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/gp/video/detail/B00BUBR3UI/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eInception\u003c/em\u003e\u003c/a\u003e: Christopher Nolan’s mind-bending heist thriller about extracting and planting ideas through shared dreaming, featuring layered dream sequences within dreams and Leonardo DiCaprio’s reality-questioning performance.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/dp/B09TX3R5VJ/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eCasino Royale\u003c/em\u003e (2006)\u003c/a\u003e: the James Bond reboot featuring an iconic eight-minute parkour chase sequence with freerunner Sébastien Foucan that inspired Charlie’s first business idea for parkour training DVDs.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/gp/video/detail/B0B8SG9XTB/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eGame of Thrones\u003c/em\u003e\u003c/a\u003e: HBO’s fantasy epic whose complex characters like Jon Snow and Tyrion Lannister became perfect subjects for Charlie’s “fame-jacking” YouTube strategy, borrowing existing audience attention.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/playlist?list=PLuu6fDad2eJwnly_hEdir9biYcpG_MKMd\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eThe Tim Ferriss Experiment\u003c/em\u003e\u003c/a\u003e: My reality TV show where I attempted to master various skills in record time, including \u003ca href=\"https://www.youtube.com/watch?v=3zPa7b1uq4A\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ea particularly cringe-worthy episode about dating and cold approach techniques\u003c/a\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.amazon.com/gp/video/detail/B0B6L37SLD/?tag=offsitoftimfe-20\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eTrue Detective\u003c/em\u003e\u003c/a\u003e: the philosophical crime drama that was referenced in one of \u003cem\u003eThe Last Psychiatrist\u003c/em\u003e‘s characteristically penetrating blog post titles, blending pop culture with psychological analysis.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/channel/UCo2j35a3W-lv0GXykTDdUtg\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eImprov \u0026amp; Dragons\u003c/em\u003e\u003c/a\u003e: Charlie’s own YouTube series combining improvisational comedy with \u003cem\u003eDungeons \u0026amp; Dragons\u003c/em\u003e gameplay, showcasing his evolution from consumer to creator of entertaining content.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003ePeople\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://tim.blog/2014/06/24/neil-strauss/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNeil Strauss\u003c/a\u003e: author of \u003cem\u003eThe Game\u003c/em\u003e, a controversial exploration of pickup artist culture that inadvertently became a masterclass in social psychology and persuasion techniques.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.nevblog.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNeville Medhora\u003c/a\u003e: a copywriter and entrepreneur who founded Copywriting Course after helping AppSumo achieve their highest sales days through psychological email marketing.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2016/08/10/tony-robbins-on-achievement-versus-fulfillment/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTony Robbins\u003c/a\u003e: legendary motivational speaker and life coach known for transforming human potential through neurolinguistic programming and peak performance strategies.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2010/09/28/tucker-max/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTucker Max\u003c/a\u003e: bestselling author of \u003cem\u003eI Hope They Serve Beer in Hell\u003c/em\u003e and master of provocative personal branding who provided Charlie crucial early feedback on his business positioning.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://ebenpagantraining.com/about/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eEben Pagan\u003c/a\u003e: marketing strategist and entrepreneur who created the “Marketing Step-by-Step” course that influenced Charlie’s rebranding to Charisma on Command, known for alliterative branding techniques.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://x.com/daviddeangelo?lang=en\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDavid DeAngelo\u003c/a\u003e: Eben Pagan’s pseudonym under which he wrote \u003cem\u003eDouble Your Dating\u003c/em\u003e, demonstrating early personal branding strategies in the dating advice industry.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2020/04/09/ryan-holiday-stoicism/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRyan Holiday\u003c/a\u003e: bestselling author and marketing expert who was working as Tucker Max’s research assistant when I first encountered Tucker’s unconventional approach.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2018/07/11/how-to-scale-to-100-million-users/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrian Chesky\u003c/a\u003e: co-founder and CEO of Airbnb, renowned for his philosophy of “doing things that don’t scale” in the early stages of building disruptive businesses.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://zenfounder.com/podcast/episodes/episode-130-founder-origin-stories-clay-collins\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eClay Collins\u003c/a\u003e: online course creator who developed influential frameworks for pre-selling courses before creating them, providing Charlie with strategic product launch methodologies.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Avicii\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAvicii\u003c/a\u003e: Swedish DJ and electronic music producer whose live performance Charlie witnessed during his transformational first visit to Las Vegas.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=0o_EK4EjuEY\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBill Clinton\u003c/a\u003e: 42nd President of the United States whose masterful eye contact techniques in political debates became the subject of one of Charlie’s breakthrough YouTube videos.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2025/01/09/personal-reboot-greg-mckeown/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGreg McKeown\u003c/a\u003e: author of \u003cem\u003eEssentialism\u003c/em\u003e, advocating for the disciplined pursuit of less but better through systematic prioritization and elimination strategies.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.anyapearse.com/blog/whats-your-slowest-hiker\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHerbie\u003c/a\u003e: fictional character from Greg McKeown’s \u003cem\u003eEssentialism\u003c/em\u003e representing the bottleneck principle – that improving the slowest part of any system dramatically improves overall performance.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Donald_Trump\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDonald Trump\u003c/a\u003e: businessman and 45th President whose communication style Charlie analyzed in a viral 2016 video predicting his electoral success, which tripled Charlie’s business.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2015/09/22/scott-adams-the-man-behind-dilbert/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eScott Adams\u003c/a\u003e: creator of the \u003cem\u003eDilbert\u003c/em\u003e comic strip and master persuader who also predicted Trump’s victory early, demonstrating advanced understanding of cognitive biases.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Conor_McGregor\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eConor McGregor\u003c/a\u003e: Irish UFC fighter whose psychological warfare tactics and charismatic self-promotion became frequent subjects of Charlie’s behavioral analysis videos.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Robert_Downey_Jr.\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRobert Downey Jr.\u003c/a\u003e: Academy Award-nominated actor whose quick wit and magnetic interview presence provided rich material for Charlie’s charisma breakdowns.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.garyvaynerchuk.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGary Vaynerchuk\u003c/a\u003e: entrepreneur and social media expert who popularized the “jab, jab, jab, right hook” content strategy of providing value before making sales pitches.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/@MrBeast\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMr. Beast\u003c/a\u003e: YouTube phenomenon whose data-driven approach to viral content creation and psychological thumbnail optimization represents modern digital storytelling mastery.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/David_Ogilvy_(businessman)\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDavid Ogilvy\u003c/a\u003e: legendary advertising executive known as the “Father of Advertising” whose timeless principles of persuasion continue influencing modern marketing.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=wHHwE8Y-pqk\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKeanu Reeves\u003c/a\u003e: the perfect example of an introvert who exudes confidence despite being quiet and somewhat reclusive.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2016/12/10/tools-of-titans-brene-brown-distilled-and-other-goodies/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrené Brown\u003c/a\u003e: research professor and author whose insights on vulnerability and courage include the wisdom that healthy relationships are never truly 50/50.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Thucydides\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThucydides\u003c/a\u003e: ancient Greek historian whose philosophy inspired Charlie’s tattoo: “The secret to freedom is courage” — representing the intersection of wisdom and personal transformation.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.artofaccomplishment.com/about\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJoe Hudson\u003c/a\u003e: executive coach and creator of Art of Accomplishment who guided Charlie through the complex emotional and strategic challenges of buying out his business co-founder.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Sam_Altman\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSam Altman\u003c/a\u003e: CEO of OpenAI who publicly endorsed Joe Hudson’s work through social media, validating the psychological frameworks Charlie was learning.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nathanielbranden.com/58-2/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNathaniel Branden\u003c/a\u003e: psychologist and author of \u003cem\u003eThe Six Pillars of Self-Esteem\u003c/em\u003e whose sentence completion exercises helped Charlie excavate limiting beliefs and unconscious patterns.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.abraham.com/about.php\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJay Abraham\u003c/a\u003e: business strategist and “old-school” marketing coach who challenged Charlie to create content worthy of being consumed by the people who had influenced him.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.poetryfoundation.org/poets/kahlil-gibran\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eKahlil Gibran\u003c/a\u003e: Lebanese-American writer and philosopher, author of \u003cem\u003eThe Prophet\u003c/em\u003e, whose poetic wisdom on human nature continues influencing spiritual and personal development.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.dalecarnegie.com/en/approach/heritage\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDale Carnegie\u003c/a\u003e: author of the timeless classic \u003cem\u003eHow to Win Friends and Influence People\u003c/em\u003e, establishing foundational principles for human relationship dynamics and social influence.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.poetryfoundation.org/poets/hafez\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHafez\u003c/a\u003e: Persian lyrical poet from Shiraz, considered one of the greatest masters of the ghazal form, whose mystical and romantic verses exploring love, wine, and spiritual yearning have influenced literature for over 600 years.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2024/04/17/martha-beck/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMartha Beck\u003c/a\u003e: life coach and author known for integrating ancient wisdom with modern psychological techniques.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2025/02/05/brandon-sanderson/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrandon Sanderson\u003c/a\u003e: prolific fantasy author whose systematic approach to world-building and storytelling demonstrates the intersection of creativity and methodical execution.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2023/07/05/richard-koch-2/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRichard Koch\u003c/a\u003e: author of \u003cem\u003eThe 80/20 Principle\u003c/em\u003e, advocating for identifying the vital few inputs that generate the majority of meaningful outputs in any system.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Yvon_Chouinard\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eYvon Chouinard\u003c/a\u003e: founder of Patagonia and author of \u003cem\u003eLet My People Go Surfing\u003c/em\u003e, demonstrating how authentic values can drive both business success and environmental activism.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2017/03/19/ricardo-semler/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRicardo Semler\u003c/a\u003e: Brazilian CEO who revolutionized corporate culture through radical workplace democracy, inspiring alternative approaches to business leadership and organizational design.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2017/10/09/richard-branson/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRichard Branson\u003c/a\u003e: founder of Virgin Group whose scrappy, unconventional approach to starting an airline exemplifies entrepreneurial resourcefulness and bold risk-taking.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2021/10/06/diana-chapman/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDiana Chapman\u003c/a\u003e: executive coach whose interview on this show explored advanced techniques for integrating emotional intelligence with rational decision-making.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://iep.utm.edu/freud/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSigmund Freud\u003c/a\u003e and \u003ca href=\"https://www.thesap.org.uk/articles-on-jungian-psychology-2/carl-gustav-jung/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCarl Jung\u003c/a\u003e: pioneering psychoanalysts whose exploration of the unconscious mind inspired Charlie’s \u003cem\u003eDungeons \u0026amp; Dragons\u003c/em\u003e character “Sigmund,” blending psychology with creative expression.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2014/02/13/anxiety-treatments/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eCharlie Hoehn\u003c/a\u003e: entrepreneur, 4x \u003cem\u003eNew York Times\u003c/em\u003e bestselling editor, co-founder of Author.Inc, and my former Director of Special Projects.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003ePlaces and Venues\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://washington.org/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWashington, DC\u003c/a\u003e: the capital of the United States, known for its federal government, historic monuments, and vibrant political and cultural scene.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/H_Street_(Washington,_D.C.)\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eH Street (in DC)\u003c/a\u003e: a historic corridor in Northeast Washington DC known for its diverse dining scene, nightlife, and cultural venues stretching from Union Station to the Anacostia River.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.nyctourism.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eNew York City, NY\u003c/a\u003e: the most populous city in the United States, renowned as a global center for finance, arts, fashion, and culture.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.lowereastside.nyc/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLower East Side, NYC\u003c/a\u003e: a historic Manhattan neighborhood known for its immigrant heritage, trendy restaurants, bars, and mix of affordable and luxury housing.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.visitbrasil.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrazil\u003c/a\u003e: the largest country in South America, famous for its Amazon rainforest, vibrant culture, beaches, and cities like Rio de Janeiro and São Paulo.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://whc.unesco.org/en/list/1100/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRio de Janeiro, Brazil\u003c/a\u003e: Brazil’s iconic coastal city famous for its stunning beaches, Christ the Redeemer statue, Carnival celebration, and dramatic mountain landscapes.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://visitbrasil.com/en/location/florianopolis-en/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFloripa (Florianópolis), Brazil\u003c/a\u003e: the capital of Santa Catarina state, known as the “Magic Island” for its beautiful beaches, technology hub, and high quality of life.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.visitlasvegas.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLas Vegas, NV\u003c/a\u003e: the entertainment capital of the world, famous for its casinos, shows, nightlife, and extravagant themed hotels along the Las Vegas Strip.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.destinationvancouver.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eVancouver, Canada\u003c/a\u003e: a major West Coast seaport city known for its natural beauty, mild climate, diverse culture, and proximity to mountains and ocean.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://colombia.travel/en\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eColombia\u003c/a\u003e: a South American country known for its diverse landscapes from Caribbean coastlines to Amazon rainforest, vibrant cities, and rich cultural heritage.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.pa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePennsylvania\u003c/a\u003e: a Mid-Atlantic U.S. state known for its historical significance, including Philadelphia’s Independence Hall and the Liberty Bell.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.discoverlosangeles.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLos Angeles, CA\u003c/a\u003e: the second-largest city in the United States, famous for Hollywood, entertainment industry, beaches, and diverse neighborhoods.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.wynnlasvegas.com/nightlife/xs-nightclub\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eXS (Nightclub in Las Vegas)\u003c/a\u003e: an upscale nightclub at Encore Las Vegas known for its luxurious indoor-outdoor design, celebrity DJ performances, and high-end bottle service.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.unlv.edu/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eUNLV (University of Nevada, Las Vegas)\u003c/a\u003e: a public research university known for its hospitality, business, and engineering programs, as well as its Runnin’ Rebels basketball team.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.sxsw.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSouth by Southwest (SXSW)\u003c/a\u003e: an annual conglomeration of interactive media, music, and film festivals and conferences held in Austin, Texas.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.utexas.edu/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eUT Austin\u003c/a\u003e: the University of Texas at Austin, a top-tier public research university known for its academics, athletics, and vibrant campus culture.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.sftravel.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSan Francisco / Bay Area\u003c/a\u003e: a northern California region known for its tech industry, iconic Golden Gate Bridge, diverse culture, and steep hills.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eConcepts, Ideas, and Frameworks\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.mckinsey.com/careers/life-at-mckinsey/how-we-work/what-is-management-consulting\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eManagement Consulting\u003c/a\u003e: a professional service where experts analyze organizational problems and provide strategic solutions to improve business performance and efficiency.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2010/11/28/4-hour-work-week-case-studies-muse/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Muse\u003c/a\u003e: concept from \u003cem\u003eThe 4-Hour Workweek\u003c/em\u003e for creating an automated, low-maintenance business that generates passive income while requiring minimal ongoing involvement.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?app=desktop\u0026amp;v=hqo9g_3FelY\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eScratch-Your-Own-Itch\u003c/a\u003e: the entrepreneurial philosophy of solving a problem you personally experience, ensuring product-market fit by building something you genuinely want and need.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.startupgrind.com/blog/moonlighting-a-side-project-while-employed-full-time-here-are-the-dos-and-donts/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMoonlighting\u003c/a\u003e: the practice of working a side business or project while maintaining full-time employment, allowing entrepreneurs to test ideas with reduced financial risk.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.deathgripwax.com/blogs/news/the-history-and-meaning-behind-burn-the-ships\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBurn the Ships\u003c/a\u003e: a commitment strategy inspired by historical military tactics, meaning to eliminate all options for retreat and force complete dedication to a new venture.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2017/05/15/fear-setting/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFear-Setting\u003c/a\u003e: My systematic exercise for defining worst-case scenarios, prevention strategies, and recovery plans to overcome decision paralysis and take calculated risks.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.goodreads.com/book/show/900.The_Game\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Game\u003c/a\u003e: Neil Strauss’ exploration of pickup artist culture and social dynamics, revealing psychological techniques for attraction and social influence.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2017/05/15/fear-setting/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e10 out of 10 Upside\u003c/a\u003e: the component of fear-setting that focuses on envisioning and quantifying the best possible outcomes of taking action on a decision.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://youtu.be/Ap4RlaHls6g?si=xaSICTnwwkrl4El3\u0026amp;t=135\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFame-Jacking\u003c/a\u003e: Charlie’s term for his YouTube strategy of creating content analyzing famous personalities to attract their fans and leverage existing audience interest.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.engagemore.co.uk/glossary/tripwire\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTripwire\u003c/a\u003e: an online marketing strategy using a low-cost, high-value initial product to convert prospects into paying customers and establish a buying relationship.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.garyvaynerchuk.com/jab-jab-jab-right-hook-book/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJab, Jab, Jab, Right Hook\u003c/a\u003e: Gary Vaynerchuk’s content marketing philosophy of providing value repeatedly (jabs) before making sales pitches (right hooks) to build trust and engagement.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.anyapearse.com/blog/whats-your-slowest-hiker\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Herbie Parable\u003c/a\u003e: a story from \u003cem\u003eEssentialism\u003c/em\u003e about identifying and addressing the primary bottleneck in any system to improve overall performance and efficiency.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.gurwinder.blog/p/the-perils-of-audience-capture\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAudience Capture\u003c/a\u003e: the phenomenon where content creators become trapped by their audience’s expectations, leading to creative stagnation and burnout as they chase engagement over authenticity.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://cenkuslaw.com/50-50-business-partnerships/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e50/50 Partnership Split\u003c/a\u003e: the commonly problematic business arrangement where two partners share equal ownership despite rarely contributing equally, often leading to disputes and power struggles.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://nathanielbranden.com/sentence-completion-i/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSentence Completion Exercises\u003c/a\u003e: a psychological technique from \u003cem\u003eThe Six Pillars of Self-Esteem\u003c/em\u003e using open-ended prompts to uncover subconscious thoughts and limiting beliefs.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://en.wikipedia.org/wiki/Shotgun_clause\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eShotgun Deal\u003c/a\u003e: a business partnership buyout mechanism where one partner names a price and the other must either accept or buy them out at the same price, forcing fair valuation.\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://idealsandidentities.com/2023/09/17/mimetic-desire-and-the-battle-for-authenticity/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMimetic Desire\u003c/a\u003e: René Girard’s theory that humans copy the desires of others rather than developing authentic wants, creating cycles of competition and social imitation.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eRelevant Resources\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=ocmx0yXdx4c\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBC-X Parkour Philosophy of Continuous Learning\u003c/a\u003e | Charlie Houpert\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2017/05/15/fear-setting/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFear-Setting: The Most Valuable Exercise I Do Every Month\u003c/a\u003e | Tim Ferriss\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://web.archive.org/web/20101126163845/http://kickassacademy.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eStep 1 for Living a Kickass Life: Stop “Just Being Yourself”\u003c/a\u003e | KickAss Academy\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=3zPa7b1uq4A\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eI Hired a Pickup Artist to Help Me Find a Girlfriend\u003c/a\u003e | The Tim Ferriss Experiment #7\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=0o_EK4EjuEY\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Secret Of Bill Clinton’s Charisma\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.thecollectionshop.com/Fine-Art-by/James-Christensen/The-Listener/GWLISTENER/444\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Listener by James Christensen\u003c/a\u003e | The Collection Shop\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=LibRNYJmZ-I\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eWhy Trump Will SMASH Hillary\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=2CfFvtSUDA0\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow To Build Unwavering Confidence\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=LPQrZ974v4k\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eRanking the Most Charismatic Players In Game of Thrones\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=LyBIT0Q7fOc\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow to Make a Disrespectful Person Look Insecure for Insulting You\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/watch?v=wHHwE8Y-pqk\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eHow to Look Extremely Confident (Even if You’re Quiet)\u003c/a\u003e | Charisma on Command\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2020/02/06/brene-brown-striving-self-acceptance-saving-marriages/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrené Brown — Striving versus Self-Acceptance, Saving Marriages, and More\u003c/a\u003e | The Tim Ferriss Show #409\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thelastpsychiatrist.com/2014/04/the_maintenance_of_certificati.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eThe Maintenance of Certification Exam as Fetish\u003c/a\u003e | The Last Psychiatrist\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thelastpsychiatrist.com/2014/03/ten_extra_seconds_would_have_s.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eTen Extra Seconds Would Have Saved True Detective’s Finale\u003c/a\u003e | The Last Psychiatrist\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thelastpsychiatrist.com/2010/11/advertisings_collateral_damage.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAdvertising’s Collateral Damage\u003c/a\u003e | The Last Psychiatrist\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://thelastpsychiatrist.com/2008/08/if_youre_watching_its_for_you.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eIf You’re Watching, It’s For You\u003c/a\u003e | The Last Psychiatrist\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://x.com/fu_joehudson?lang=en\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eJoe Hudson: How to be More Emotionally Intelligent (Without Trying so Hard)\u003c/a\u003e | Twitter\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2011/11/16/filling-the-void-thoughts-on-learning-and-karma/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFilling the Void: Thoughts on Learning and Karma\u003c/a\u003e | Tim Ferriss\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2024/04/17/martha-beck/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMartha Beck — The Amazing and Brutal Results of Zero Lies for 365 Days, How to Do a Beginner “Integrity Cleanse,” Lessons from Lion Trackers, and Novel Tactics for Reducing Anxiety\u003c/a\u003e | The Tim Ferriss Show #732\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2025/02/05/brandon-sanderson/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBrandon Sanderson on Building a Fiction Empire, Creating $40M+ Kickstarter Campaigns, Unbreakable Habits, The Art of World-Building, and The Science of Magic Systems\u003c/a\u003e | The Tim Ferriss Show #794\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://tim.blog/2021/10/06/diana-chapman/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eDiana Chapman — How to Get Unstuck, Do “The Work,” Take Radical Responsibility, and Reduce Drama in Your Life\u003c/a\u003e | The Tim Ferriss Show #536\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eSHOW NOTES\u003c/h3\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e[00:00:00] Start.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:06:44] Charlie meets the boogeyman (me).\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:10:11] Why defaulting to management consulting after college felt like daily self-betrayal.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:13:21] Leaping into parkour training via DVD as a first business attempt.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:15:45] Moonlighting vs. burning-ships entrepreneurship.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:16:54] Negotiating remote work with a 90% raise.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:21:22] Charlie moves to New York and kicks off KickAss Academy.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:22:16] Airbnb survival tactics while living in a 396 sq. ft. apartment.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:23:26] Using the fear-setting exercise and other disaster-mitigation strategies.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:26:11] Charlie’s first blog post and crossing the publishing Rubicon.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:28:26] How Charlie’s first in-person class prompted an accidental business model.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:34:21] 10 go-getters make an ambitious move to Brazil.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:32:14] The daily growth whiteboard system.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:37:58] How a harsh Tucker Max consultation galvanized the rebranding to Charisma on Command.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:44:39] From financial downturn to pre-selling a course for $12,500.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:50:44] Finally making enough money to chase summer in six-to-eight-month increments.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:52:00] Enjoying the sustainable benefits of creating timeless content.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:54:05] How Bill Clinton seduced 7,000 people into following Charlie on YouTube.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:55:46] How Greg McKeown’s \u003cem\u003eEssentialism\u003c/em\u003e helped solve Charlie’s “Herbie” problem.\u003c/li\u003e\n\n\n\n\u003cli\u003e[00:58:26] Evolving funnel flow and fame-jacking.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:03:46] YouTube algorithm changes, short-form content, and maintaining audience trust for the long term.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:10:58] Why I still create this podcast.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:19:30] The dangers of succumbing entirely to audience expectation over authenticity.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:21:42] The catalysts that led to time off, an ayahuasca retreat, and a seven-year transformation process.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:30:26] Making the transition from 50/50 partner to sole owner.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:35:16] Recommended reading: \u003cem\u003eSix Pillars of Self-Esteem\u003c/em\u003e by Nathaniel Branden\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:37:32] The influence of \u003cem\u003eThe Last Psychiatrist\u003c/em\u003e blog.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:41:46] Jay Abraham coaching: “Make it good enough for Tim Ferriss.”\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:43:52] How testimonials added a 4x conversion lift.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:44:31] Coming to an agreement with the co-founder.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:47:20] Joe Hudson and the Art of Accomplishment.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:51:57] Why I stand by \u003cem\u003eThe 4-Hour Workweek\u003c/em\u003e without further revision, warts and all.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:55:06] Exercising gratitude even when receiving praise is difficult.\u003c/li\u003e\n\n\n\n\u003cli\u003e[01:59:15] Relationship with earlier work: video vs. writing.\u003c/li\u003e\n\n\n\n\u003cli\u003e[02:02:05] Don’t miss “Filling the Void.”\u003c/li\u003e\n\n\n\n\u003cli\u003e[02:03:56] More recommended reading.\u003c/li\u003e\n\n\n\n\u003cli\u003e[02:06:43] \u003cem\u003eImprov \u0026amp; Dragons\u003c/em\u003e.\u003c/li\u003e\n\n\n\n\u003cli\u003e[02:08:06] Charlie’s billboard: “Don’t think, feel.”\u003c/li\u003e\n\n\n\n\u003cli\u003e[02:08:57] Parting thoughts.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003ch3\u003eMORE CHARLIE HOUPERT QUOTES FROM THE INTERVIEW\u003c/h3\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e“Do I choose myself in the face of the world offering me all of this temptation to be something else?”\u003c/strong\u003e\u003cbr/\u003e— Charlie Houpert\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e“If you don’t believe in it fully, you’re going to sell it with hesitancy.”\u003c/strong\u003e\u003cbr/\u003e— Charlie Houpert\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e“Don’t think, feel. I know that’s counterintuitive to a lot of people, but lately, that’s been my guiding principle is feel my heart, feel my gut, think from my mind, and try to find some union of the three to move forward.”\u003c/strong\u003e\u003cbr/\u003e— Charlie Houpert\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003e“When you start trading your beliefs for cash or approval, you’re just sending a signal that, ‘I can’t be relied on to be myself and be safe and earn.\u0026#39;”\u003c/strong\u003e\u003cbr/\u003e— Charlie Houpert\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u003cem\u003e\u003ca href=\"https://tim.blog/podcast\"\u003e\u003cstrong\u003eThe Tim Ferriss Show\u003c/strong\u003e\u003c/a\u003e \u003c/em\u003e\u003cspan\u003eis one \u003c/span\u003eof the most popular podcasts in the world with more than one billion downloads. It has been selected for \u0026#34;Best of Apple Podcasts\u0026#34; three times, it is often the #1 interview podcast across all of Apple Podcasts, and it\u0026#39;s been ranked #1 out of 400,000+ podcasts on many occasions. To listen to any of the past episodes for free, check out \u003cstrong\u003e\u003ca href=\"https://tim.blog/podcast\"\u003ethis page\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003c/div\u003e\n\t \n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "31 min read",
  "publishedTime": "2025-06-25T13:44:26Z",
  "modifiedTime": "2025-06-26T01:37:57Z"
}
