{
  "id": "0fec5fb9-068b-4ee2-b258-ed5d1de12f25",
  "title": "The White House tightens control over the Fed — but not on rates",
  "link": "https://finance.yahoo.com/news/the-white-house-tightens-control-over-the-fed--but-not-on-rates-181819439.html",
  "description": "",
  "author": "",
  "published": "2025-02-19T18:18:19Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Jennifer Schonberger",
  "length": 3006,
  "excerpt": "A new executive order gives President Donald Trump's appointees more power over independent agencies, including how the Fed regulates banks. But monetary...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "The White House is tightening its control over how the Federal Reserve regulates big banks as part of a new executive order that gives President Donald Trump's appointees more power over independent agencies. But in doing so the new administration made it clear that monetary policy — the direction of interest rates — will remain under the Fed’s full control. Rates are set by the Fed's Federal Open Market Committee, which is composed of seven Fed governors based in Washington, D.C., and presidents of regional Fed banks spread across the country. \"This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy,\" according to the order released Tuesday. That language may help alleviate concerns that the White House could encroach on the long-held independence of the Fed when it comes to the question of whether rates should be raised or lowered. Federal Reserve Board Chair Jerome Powell testifies before the House Financial Services Committee last week. (AP Photo/Jose Luis Magana) · ASSOCIATED PRESS But it does make it clear that another key Fed function — oversight of the country’s biggest banks — will now have a closer connection to the policies and priorities of the White House. \"This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions,\" the order said. Read more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investments Independent agencies — which would also include the Federal Communications Commission, the Securities and Exchange Commission, and the Federal Trade Commission — will now submit major regulations to the White House Office of Management and Budget, which is overseen by Russell Vought. Vought will establish \"performance standards and management objectives\" for the heads of these agencies. He can also review and adjust budgets, which \"may prohibit independent regulatory agencies from expending appropriations on particular activities, functions, projects, or objects.\" Russell Vought, director of the Office of Management and Budget. (REUTERS/Kaylee Greenlee Beal/File Photo) · Reuters / Reuters The tighter control over the Fed's regulation of banks coincides with attempts by the Trump administration to rein in one big bank regulatory agency, the Consumer Financial Protection Bureau, and rethink how to restructure other big regulators that oversee the nation's largest lenders. Earlier this month, the Trump administration ordered effectively all work at the CFPB to halt. It is also reportedly discussing plans to consolidate other bank regulators without Congress' input, according to a report in the Wall Street Journal. The discussions include possibly folding the FDIC into the Treasury Department and combining it with the Office of the Comptroller of the Currency.",
  "image": "https://s.yimg.com/ny/api/res/1.2/ACidVzLknW0W0EWTEPdbWg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-02/45821720-eecb-11ef-abec-ba9131015994",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003eThe White House is tightening its control over how the Federal Reserve regulates big banks as part of a \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:new executive order;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003enew executive order\u003c/a\u003e that gives President Donald Trump\u0026#39;s appointees more power over independent agencies.\u003c/p\u003e \u003cp\u003eBut in doing so the new administration made it clear that monetary policy — \u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://finance.yahoo.com/news/fed-rate-cuts-bets-trimmed-as-powell-says-close-but-not-there-on-inflation-144936170.html\" data-ylk=\"slk:the direction of interest rates;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003ethe direction of interest rates\u003c/a\u003e — will remain under the Fed’s full control.\u003c/p\u003e  \u003cp\u003eRates are set by the Fed\u0026#39;s Federal Open Market Committee, which is composed of seven Fed governors based in Washington, D.C., and presidents of regional Fed banks spread across the country.\u003c/p\u003e \u003cp\u003e\u0026#34;This order shall not apply to the Board of Governors of the Federal Reserve System or to the Federal Open Market Committee in its conduct of monetary policy,\u0026#34; according to the order released Tuesday.\u003c/p\u003e \u003cp\u003eThat language may help alleviate concerns that the White House could encroach on the long-held independence of the Fed when it comes to the question of whether rates should be raised or lowered.\u003c/p\u003e \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"Federal Reserve Board Chair Jerome Powell testifies before the House Financial Services Committee during a hearing on the Semi-Annual Monetary Policy Report, on Capitol Hill in Washington, Wednesday, Feb. 12, 2025. (AP Photo/Jose Luis Magana)\" loading=\"eager\" height=\"427\" width=\"640\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eFederal Reserve Board Chair Jerome Powell testifies before the House Financial Services Committee last week. (AP Photo/Jose Luis Magana)  \u003cspan data-svelte-h=\"svelte-nxhdlu\"\u003e·\u003c/span\u003e \u003cspan\u003eASSOCIATED PRESS\u003c/span\u003e\u003c/figcaption\u003e \u003c/figure\u003e \u003cp\u003eBut it does make it clear that another key Fed function — oversight of the country’s biggest banks — will now have a closer connection to the policies and priorities of the White House.\u003c/p\u003e \u003cp\u003e\u0026#34;This order shall apply to the Board of Governors of the Federal Reserve System only in connection with its conduct and authorities directly related to its supervision and regulation of financial institutions,\u0026#34; the order said.\u003c/p\u003e \u003cp\u003e\u003cem\u003eRead more: \u003c/em\u003e\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://finance.yahoo.com/personal-finance/banking/article/fed-rate-decision-how-it-affects-your-bank-accounts-loans-credit-cards-and-investments-220526037.html\" data-ylk=\"slk:How the Fed rate decision affects your bank accounts, loans, credit cards, and investments;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cem\u003eHow the Fed rate decision affects your bank accounts, loans, credit cards, and investments\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e  \u003cp\u003eIndependent agencies — which would also include the Federal Communications Commission, the Securities and Exchange Commission, and the Federal Trade Commission — will now submit major regulations to the White House Office of Management and Budget, which is overseen by Russell Vought.\u003c/p\u003e \u003cp\u003eVought will establish \u0026#34;performance standards and management objectives\u0026#34; for the heads of these agencies. He can also review and adjust budgets, which \u0026#34;may prohibit independent regulatory agencies from expending appropriations on particular activities, functions, projects, or objects.\u0026#34;\u003c/p\u003e \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"FILE PHOTO: Russell Vought, U.S. President Trump\u0026amp;#39;s nominee to be director of the Office of Management and Budget (OMB), testifies before a Senate Budget Committee confirmation hearing on Capitol Hill in Washington, U.S., January 22, 2025. REUTERS/Kaylee Greenlee Beal/File Photo\" loading=\"lazy\" height=\"427\" width=\"640\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eRussell Vought, director of the Office of Management and Budget. (REUTERS/Kaylee Greenlee Beal/File Photo)  \u003cspan data-svelte-h=\"svelte-nxhdlu\"\u003e·\u003c/span\u003e \u003cspan\u003eReuters / Reuters\u003c/span\u003e\u003c/figcaption\u003e \u003c/figure\u003e \u003cp\u003eThe tighter control over the Fed\u0026#39;s regulation of banks coincides with attempts by the Trump administration to rein in one big bank regulatory agency, the Consumer Financial Protection Bureau, and rethink how to restructure other big regulators that oversee the nation\u0026#39;s largest lenders.\u003c/p\u003e \u003cp\u003eEarlier this month, the Trump administration ordered effectively all work at the CFPB to halt. It is also \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.wsj.com/finance/regulation/trump-advisers-eye-bank-regulator-consolidation-after-targeting-cfpb-85055a2e?mod=article_inline\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:reportedly discussing;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ereportedly discussing\u003c/a\u003e plans to consolidate other bank regulators without Congress\u0026#39; input, according to a report in the Wall Street Journal. The discussions include possibly folding the FDIC into the Treasury Department and combining it with the Office of the Comptroller of the Currency.\u003c/p\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-19T18:18:20Z",
  "modifiedTime": null
}
