{
  "id": "15c88a89-bb0a-485a-8a76-788e9142df20",
  "title": "India's high food inflation leaves less in lunch boxes of poor school children",
  "link": "https://www.investing.com/news/stock-market-news/indias-high-food-inflation-leaves-less-in-lunch-boxes-of-poor-school-children-3659018",
  "description": "",
  "author": "Reuters",
  "published": "2024-10-11 03:47:54",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 5945,
  "excerpt": "India's high food inflation leaves less in lunch boxes of poor school children",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Jatindra , Saurabh Sharma and Ira Dugal ODISHA, India (Reuters) - Nearly two years of elevated food inflation in India is leaving less in the lunch boxes of impoverished children, as government funded school meals suffer cutbacks because of rising prices of vegetables, fruits and pulses. The three-decades old programme, intended to draw poor children into school and provide them with basic nutrition, throws into sharp relief the inflationary impact of food on the nation's most needy and the widening inequality in the world's fastest growing major economy. Reuters interviews with 21 school teachers across four states, a dozen families and researchers show schools have been forced to scrimp on key ingredients as the meal budget under the scheme has not increased for the last two years despite soaring food prices. The programme covers an estimated 120 million children across a million government and government-aided schools up to class 8, data available on the scheme's website showed. Teachers and school administrators manage the quality of food provided. \"Budget for the mid-day meal scheme is not indexed to inflation regularly as it should be, compromising the quality of the meal,\" said Dipa Sinha, an independent development economist and researcher who works with the 'Right For Food' campaign, an informal non-government network of organisations and individuals. \"While the government provides free grain for these meals, that does not compensate for a cut-back in other nutritious ingredients like vegetables, pulses, milk and eggs due to inadequate budgets,\" said Sinha. A case in point is 8-year old Ranjit Nayak, who lives in Ghugudipada village, 150 kilometres from Bhubaneshwar, the capital city of the eastern Indian state of Odisha. Ranjit's family of five survive on daily wages of about 250 Indian rupees ($2.98) and can afford to feed him and his 4-year old brother little more than boiled rice on most days. Often, the school provides his very first meal of the day, but the food price spike has left an unwelcome aftertaste in recent times. “My son is sometimes satisfied with the school meal, but other days it's just yellow water with hardly any dal (lentils),\" said Arati Nayak, Ranjit's 26-year old mother who weaves dry leaves into disposable plates earning 25 rupees a day. The rising cost of cooking oil, vegetables and potatoes has made it difficult to provide a nutritious meal for students, said Chhabi Nayak, head of the managing committee at the Ghugudipada school. The school opts for cheaper variety of lentils and skips more nutritious vegetables like carrots to manage budgets, he said. SIZZLING FOOD PRICES India's food inflation has averaged 6.3% between June 2020 and June 2024, a central bank study published in August showed, compared to 2.9% in the previous four years. It eased slightly in July and August due to statistical base effects but is expected to have risen again last month. Despite this surge in prices, the minimum budget of 5.45 rupees for each primary school student and 8.17 rupees for upper primary students under the scheme has not been raised since October 2022. A decision to increase allocations for the current 2024-25 year has been delayed due to elections, said an official at the federal Ministry for Education, which administers the scheme, declining to be identified as he is not authorised to speak to the media. An email to the federal Ministry for Education was not answered. Price increases have been particularly persistent in vegetables, a category which has seen inflation of over 10% in 22 months in the past four years, according to the central bank study. Pulses and oils have experienced double digit inflation for 24 months and eggs for 15 months over this period. Sixteen of the 21 teachers who spoke to Reuters said inflation has dented the existing budget making it difficult to provide nutritious meals to students Fruits have not been served for the past six months and green vegetables have been replaced with pumpkin, a teacher from the Sitapur district in the state of Uttar Pradesh said, declining to be identified for fear of being targeted by state officials. The milk given to students is little more than white water, the teacher said, suggesting dilution by water. NOT ENOUGH CALORIES? The government scheme requires each primary school meal to include 450 calories and 12 grams of protein, increasing to 700 calories and 20 grams of protein for the upper primary class. While periodic audits are conducted, the nutrition levels are not measured or recorded daily, teachers and researchers said. There is no publicly available recent study on the nutritional impact of higher inflation and cut back in mid-day meals to students due to limited availability of data. \"But if quality of meals for students is going down in a country where about 50% of the population does not have access to a healthy diet, it would have nutritional implications,\" Sinha said. According to the Food and Agriculture Organisation (FAO) 2024 report on 'State of Food Security and Nutrition', 55% of the Indian population was unable to afford a healthy diet as of 2022 - the latest data available. The impact of high food inflation must also be seen against the backdrop of low wages in India, said Rajendran Narayanan, at Azim Premji University, who runs a 'Data, Democracy and Development' curriculum for the university. Narayanan pointed to a 2019 federal government committee recommendation for a national minimum floor wage of 375 rupees per day, based on the amount of money needed to ensure a balanced diet for each person. In 2022-23, 300 million workers were earning less than that threshold, said Narayanan, basing his findings on the government's labour force survey. This makes it important to boost nutritional schemes in times of high inflation but the \"political will\" to do so is missing, Narayanan said. ($1 = 83.9650 Indian rupees)",
  "image": "https://i-invdn-com.investing.com/news/LYNXMPEA6606G_L.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Jatindra , Saurabh Sharma and Ira Dugal\u003c/p\u003e \u003cp\u003eODISHA, India (Reuters) - Nearly two years of elevated food inflation in India is leaving less in the lunch boxes of impoverished children, as government funded school meals suffer cutbacks because of rising prices of vegetables, fruits and pulses.\u003c/p\u003e \u003cp\u003eThe three-decades old programme, intended to draw poor children into school and provide them with basic nutrition, throws into sharp relief the inflationary impact of food on the nation\u0026#39;s most needy and the widening inequality in the world\u0026#39;s fastest growing major economy.\u003c/p\u003e \u003cp\u003eReuters interviews with 21 school teachers across four states, a dozen families and researchers show schools have been forced to scrimp on key ingredients as the meal budget under the scheme has not increased for the last two years despite soaring food prices.\u003c/p\u003e \u003cp\u003eThe programme covers an estimated 120 million children across a million government and government-aided schools up to class 8, data available on the scheme\u0026#39;s website showed. Teachers and school administrators manage the quality of food provided.\u003c/p\u003e \u003cp\u003e\u0026#34;Budget for the mid-day meal scheme is not indexed to inflation regularly as it should be, compromising the quality of the meal,\u0026#34; said Dipa Sinha, an independent development economist and researcher who works with the \u0026#39;Right For Food\u0026#39; campaign, an informal non-government network of organisations and individuals.\u003c/p\u003e \u003cp\u003e\u0026#34;While the government provides free grain for these meals, that does not compensate for a cut-back in other nutritious ingredients like vegetables, pulses, milk and eggs due to inadequate budgets,\u0026#34; said Sinha.\u003c/p\u003e \u003cp\u003eA case in point is 8-year old Ranjit Nayak, who lives in Ghugudipada village, 150 kilometres from Bhubaneshwar, the capital city of the eastern Indian state of Odisha. \u003c/p\u003e \u003cp\u003eRanjit\u0026#39;s family of five survive on daily wages of about 250 Indian rupees ($2.98) and can afford to feed him and his 4-year old brother little more than boiled rice on most days.\u003c/p\u003e \u003cp\u003eOften, the school provides his very first meal of the day, but the food price spike has left an unwelcome aftertaste in recent times. \u003c/p\u003e \u003cp\u003e“My son is sometimes satisfied with the school meal, but other days it\u0026#39;s just yellow water with hardly any dal (lentils),\u0026#34; said Arati Nayak, Ranjit\u0026#39;s 26-year old mother who weaves dry leaves into disposable plates earning 25 rupees a day. \u003c/p\u003e \u003cp\u003eThe rising cost of cooking oil, vegetables and potatoes has made it difficult to provide a nutritious meal for students, said Chhabi Nayak, head of the managing committee at the Ghugudipada school.\u003c/p\u003e \u003cp\u003eThe school opts for cheaper variety of lentils and skips more nutritious vegetables like carrots to manage budgets, he said.\u003c/p\u003e \u003cp\u003eSIZZLING FOOD PRICES\u003c/p\u003e \u003cp\u003eIndia\u0026#39;s food inflation has averaged 6.3% between June 2020 and June 2024, a central bank study published in August showed, compared to 2.9% in the previous four years. It eased slightly in July and August due to statistical base effects but is expected to have risen again last month. \u003c/p\u003e \u003cp\u003eDespite this surge in prices, the minimum budget of 5.45 rupees for each primary school student and 8.17 rupees for upper primary students under the scheme has not been raised since October 2022.\u003c/p\u003e \u003cp\u003eA decision to increase allocations for the current 2024-25 year has been delayed due to elections, said an official at the federal Ministry for Education, which administers the scheme, declining to be identified as he is not authorised to speak to the media.\u003c/p\u003e \u003cp\u003eAn email to the federal Ministry for Education was not answered.\u003c/p\u003e \u003cp\u003ePrice increases have been particularly persistent in vegetables, a category which has seen inflation of over 10% in 22 months in the past four years, according to the central bank study. Pulses and oils have experienced double digit inflation for 24 months and eggs for 15 months over this period.\u003c/p\u003e \u003cp\u003eSixteen of the 21 teachers who spoke to Reuters said inflation has dented the existing budget making it difficult to provide nutritious meals to students\u003c/p\u003e \u003cp\u003eFruits have not been served for the past six months and green vegetables have been replaced with pumpkin, a teacher from the Sitapur district in the state of Uttar Pradesh said, declining to be identified for fear of being targeted by state officials.\u003c/p\u003e \u003cp\u003eThe milk given to students is little more than white water, the teacher said, suggesting dilution by water.\u003c/p\u003e \u003cp\u003eNOT ENOUGH CALORIES? \u003c/p\u003e \u003cp\u003eThe government scheme requires each primary school meal to include 450 calories and 12 grams of protein, increasing to 700 calories and 20 grams of protein for the upper primary class. \u003c/p\u003e \u003cp\u003eWhile periodic audits are conducted, the nutrition levels are not measured or recorded daily, teachers and researchers said. \u003c/p\u003e \u003cp\u003eThere is no publicly available recent study on the nutritional impact of higher inflation and cut back in mid-day meals to students due to limited availability of data.\u003c/p\u003e \u003cp\u003e\u0026#34;But if quality of meals for students is going down in a country where about 50% of the population does not have access to a healthy diet, it would have nutritional implications,\u0026#34; Sinha said.\u003c/p\u003e \u003cp\u003eAccording to the Food and Agriculture Organisation (FAO) 2024 report on \u0026#39;State of Food Security and Nutrition\u0026#39;, 55% of the Indian population was unable to afford a healthy diet as of 2022 - the latest data available.\u003c/p\u003e \u003cp\u003eThe impact of high food inflation must also be seen against the backdrop of low wages in India, said Rajendran Narayanan, at Azim Premji University, who runs a \u0026#39;Data, Democracy and Development\u0026#39; curriculum for the university.\u003c/p\u003e \u003cp\u003eNarayanan pointed to a 2019 federal government committee recommendation for a national minimum floor wage of 375 rupees per day, based on the amount of money needed to ensure a balanced diet for each person.\u003c/p\u003e \u003cp\u003eIn 2022-23, 300 million workers were earning less than that threshold, said Narayanan, basing his findings on the government\u0026#39;s labour force survey.\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEK9A039_L.jpg\" title=\"© Reuters. A plate of a lunch meal lies on the floor before it is served to a child at a government-run upper primary school in Ghugudipada village in Nayagarh district of the eastern state of Odisha, India, September 24, 2024. REUTERS/Stringer/File Photo\" alt=\"© Reuters. A plate of a lunch meal lies on the floor before it is served to a child at a government-run upper primary school in Ghugudipada village in Nayagarh district of the eastern state of Odisha, India, September 24, 2024. REUTERS/Stringer/File Photo\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eThis makes it important to boost nutritional schemes in times of high inflation but the \u0026#34;political will\u0026#34; to do so is missing, Narayanan said.\u003c/p\u003e \u003cp\u003e($1 = 83.9650 Indian rupees) \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-11T03:36:36Z",
  "modifiedTime": null
}
