{
  "id": "1da6cd5e-09e4-4e2c-8e86-56bcf152b9e3",
  "title": "Fintech market stirs as Celero seeks a buyer while Finexio looks for minority investor",
  "link": "https://fortune.com/2024/10/10/fintech-mergers-payments-celero-private-equity-finexio-mergers/",
  "description": "Mergers remain slow ahead of U.S. presidential election",
  "author": "Luisa Beltran",
  "published": "Thu, 10 Oct 2024 22:21:43 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Finance"
  ],
  "byline": "Luisa Beltran",
  "length": 2851,
  "excerpt": "Mergers remain slow ahead of U.S. presidential election",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Celero Commerce, the payments company backed by LLR Partners, is up for sale and has hired an investment bank to advise on the process, according to four banking and private equity executives. The execs predict the Brentwood, Tennessee-based company could sell for roughly $600 million, or 12 times Celero’s trailing Ebitda of $50 million. Celero is in the “back half’ of a process that has attracted private equity, they said. LLR, a lower middle market PE firm, formed Celero in late 2018 when it invested in UMS Banking, a merchant acquirer. Celero has remained very acquisitive, buying about 10 companies since then, including RazorSync in 2019, TransNational Payments in 2020, and this past August, it scooped up SONA.   LLR and Celero did not return messages for comment. News of the Celero sale comes as mergers remain slow. The number of U.S. announced transactions so far this year has dropped about 8% to 7,993, totaling $1.2 trillion as of Oct. 7, according to data from Dealogic. That figure represents a 17% jump in value compared to 2023 when 8,660 mergers totaled $1 trillion, according to Dealogic. While there are lots of discussions going on, sales are harder to get done this year, one fintech banker said. Mergers typically slow down ahead of the U.S. presidential election with many expecting deals to return next year. “Buyers aren’t ready to spend on these M\u0026A situations as easily as they used to in the past. That’s the issue,” one banker said. In another fintech development, Finexio, the payments startup backed by JPMorgan, is seeking a minority round of capital, according to three banking sources. Finexio has hired an investment bank to advise on the fundraise, they said. In 2015, Ernest Rolfson, a former Mastercard executive, founded Finexio, which seeks to simplify the accounts payable process for medium and large companies. The company provides software that converts paper checks to electronic payments. Finexio has introduced a Card by Mail product which seeks to blend the comfort of paper checks with the efficiency of digital payments, according to an April blog post. Despite the shift to digital, some businesses continue to use legacy payment methods. About 75% of organizations use paper checks despite the high costs, according to a study from PYMNTS Intelligence. Finexio has raised about $83.5 million in funding, according to Crunchbase. JPMorgan, an active fintech acquirer, was the largest investor of Finexio’s $35 million B round that it raised in October 2022. Discover Financial Services and Valley Bank also took part. The B round valued Finexio at $100 million. (Capital One’s more than $35 billion buy of Discover is expected to close later this year or early 2025.) JPMorgan declined comment. Discover, Finexio and Valley Bank did not return messages for comment.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/10/digitalpayments.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003cp\u003eCelero Commerce, the payments company backed by LLR Partners, is up for sale and has hired an investment bank to advise on the process, according to four banking and private equity executives. The execs predict the Brentwood, Tennessee-based company could sell for roughly $600 million, or 12 times Celero’s trailing Ebitda of $50 million. Celero is in the “back half’ of a process that has attracted private equity, they said.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eLLR, a lower middle market PE firm, formed Celero in late 2018 when it\u003ca href=\"https://www.businesswire.com/news/home/20181203005079/en/LLR-Partners-Backs-Payments-Industry-Leader-Kevin-Jones-to-Form-Celero-Commerce\" target=\"_blank\" aria-label=\"Go to https://www.businesswire.com/news/home/20181203005079/en/LLR-Partners-Backs-Payments-Industry-Leader-Kevin-Jones-to-Form-Celero-Commerce\" rel=\"noopener\"\u003e invested\u003c/a\u003e in UMS Banking, a merchant acquirer. Celero has remained very acquisitive,\u003ca href=\"https://www.llrpartners.com/celero-commerce-acquires-elmhurst-tandem-payments/\" target=\"_blank\" aria-label=\"Go to https://www.llrpartners.com/celero-commerce-acquires-elmhurst-tandem-payments/\" rel=\"noopener\"\u003e buying\u003c/a\u003e about 10 companies since then, including RazorSync in 2019,\u003ca href=\"https://www.llrpartners.com/celero-commerce-acquires-transnational-payments/\" target=\"_blank\" aria-label=\"Go to https://www.llrpartners.com/celero-commerce-acquires-transnational-payments/\" rel=\"noopener\"\u003e TransNational Payments\u003c/a\u003e in 2020, and this past August, it scooped up SONA.  \u003c/p\u003e\n\n\n\n\u003cp\u003eLLR and Celero did not return messages for comment.\u003c/p\u003e\n\n\n\n\u003cp\u003eNews of the Celero sale comes as mergers remain slow. The number of U.S. announced transactions so far this year has dropped about 8% to 7,993, totaling $1.2 trillion as of Oct. 7, according to data from Dealogic. That figure represents a 17% jump in value compared to 2023 when 8,660 mergers totaled $1 trillion, according to Dealogic.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile there are lots of discussions going on, sales are harder to get done this year, one fintech banker said. Mergers typically slow down ahead of the U.S. presidential election with many expecting deals to return next year. “Buyers aren’t ready to spend on these M\u0026amp;A situations as easily as they used to in the past. That’s the issue,” one banker said.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn another fintech development, Finexio, the payments startup backed by JPMorgan, is seeking a minority round of capital, according to three banking sources.\u003c/p\u003e\n\n\n\n\u003cp\u003eFinexio has hired an investment bank to advise on the fundraise, they said. In 2015, Ernest Rolfson, a former \u003ca href=\"https://fortune.com/company/mastercard/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/mastercard/\"\u003eMastercard\u003c/a\u003e executive, founded Finexio, which seeks to simplify the accounts payable process for medium and large companies. The company provides software that converts paper checks to electronic payments. Finexio has introduced a\u003ca href=\"https://www.finexio.com/blog/card-by-mail-revolutionizing-b2b-check-payments\" target=\"_blank\" aria-label=\"Go to https://www.finexio.com/blog/card-by-mail-revolutionizing-b2b-check-payments\" rel=\"noopener\"\u003e Card by Mail\u003c/a\u003e product which seeks to blend the comfort of paper checks with the efficiency of digital payments, according to an April blog post.\u003c/p\u003e\n\n\n\n\u003cp\u003eDespite the shift to digital, some businesses continue to use legacy payment methods. About 75% of organizations use paper checks despite the high costs, according to a study from \u003ca href=\"http://PYMNTS Intelligence\" target=\"_self\" aria-label=\"Go to http://PYMNTS Intelligence\"\u003ePYMNTS Intelligence\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eFinexio has raised about $83.5 million in funding, according to Crunchbase. JPMorgan, an active fintech acquirer, was the largest investor of Finexio’s $35 million B round that it\u003ca href=\"https://www.globenewswire.com/en/news-release/2022/10/24/2539922/0/en/Finexio-Closes-35-Million-Series-B-Funding-Round.html\" target=\"_blank\" aria-label=\"Go to https://www.globenewswire.com/en/news-release/2022/10/24/2539922/0/en/Finexio-Closes-35-Million-Series-B-Funding-Round.html\" rel=\"noopener\"\u003e raised\u003c/a\u003e in October 2022. \u003ca href=\"https://fortune.com/company/discover-financial-services/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/discover-financial-services/\"\u003eDiscover Financial Services\u003c/a\u003e and Valley Bank also took part. The B round valued Finexio at $100 million. (Capital One’s more than $35 billion buy of Discover is expected to close later this year or early 2025.)\u003c/p\u003e\n\n\n\n\u003cp\u003eJPMorgan declined comment. Discover, Finexio and Valley Bank did not return messages for comment.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
