{
  "id": "21d978db-7f28-4f43-ac77-3de290487f36",
  "title": "Tech's strong ad sales are showing signs of cracking from Trump's trade war",
  "link": "https://www.cnbc.com/2025/05/09/meta-alphabet-amazon-ads-tariffs.html",
  "description": "Meta, Alphabet and Amazon reported strong online advertising sales in the face of economic worries fueled by the White House's global trade overhaul.",
  "author": "",
  "published": "Fri, 09 May 2025 19:07:40 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jonathan Vanian",
  "length": 5773,
  "excerpt": "Meta, Alphabet and Amazon reported strong online advertising sales in the face of economic worries fueled by the White House's global trade overhaul.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Mark Zuckerberg arrives before the inauguration of Donald Trump as the 47th president of the United States takes place inside the Capitol Rotunda of the U.S. Capitol building in Washington, D.C., Monday, Jan. 20, 2025.Kenny Holston | Via ReutersThe digital advertising market was sunny enough for investors this past quarter, providing what could be a last hurrah before a looming economic storm from President Donald Trump's tariff onslaught.Wall Street cheered the first-quarter results from tech giants like Meta and Alphabet, which both saw shares rise on strong revenue and earnings that beat analyst expectations.The strong numbers from the online advertising titans in the face of economic worries showed that companies were still willing to promote their goods and services to consumers across the internet.Amazon's burgeoning online advertising unit also topped analyst estimates for the quarter. The online retail giant's first-quarter ad sales jumped 19% year over year, representing a faster growth rate than Meta's and Google's advertising sales, which were 16% and 9%, respectively.Smaller social media and online advertising firms like Reddit, Snap and Pinterest posted first-quarter sales that topped Wall Street projections. And even advertising technology companies like AppLovin and The Trade Desk posted strong quarterly earnings.AppLovin shares surged nearly 15% on Wednesday after the provider of mobile ad technology surpassed analysts estimates and said it would sell its mobile gaming business to Tripledot Studios.Shares of The Trade Desk jumped 18% on Friday, just one day after the ad-tech firm reported first-quarter earnings that beat on the top and bottom lines.The celebrations stopped, however, when it came time for executives to discuss the rest of the year.Meta Chief Financial Officer Susan Li last week said that \"Asia-based e-commerce exporters\" are spending less on digital advertising due to the cessation of the de minimis trade loophole that benefited retail upstarts and heavy Facebook spenders like Temu and Shein.\"It's very early, hard to know how things will play out over the quarter, and certainly, harder to know that for the rest of the year,\" Li said during a call with analysts.Executives at Alphabet and Pinterest shared similar sentiments about slower, Asia-specific ad sales and broader macroeconomic uncertainty heading into the rest of the year. Snap went so far as to pull its second-quarter guidance over the unpredictable economy potentially shrinking corporate ad budgets for the rest of the year.Jeff Green, CEO of The Trade Desk, also noted the challenging economy on Thursday, saying that marketers face an \"important time\" as they work \"amid increased macro volatility to start the year.\"\"The good news is, Q1 was really strong, and Q4 of last year was pretty darn good,\" said Sameer Samana, head of global equities and real assets for Wells Fargo Investment Institute.But with companies from a variety of sectors lowering or even suspending their 2025 sales guidance, as in the case of auto giants like Ford Motor and toymaker Mattel, Samana believes the good times are likely coming to an end.\"What it's telling me is that we better enjoy this rally, we better enjoy these good numbers,\" Samana said. \"This is going to be about as good as it gets for the coming year.\"In an ominous sign for social media and online advertising companies, retail and consumer packaged goods businesses like Procter \u0026 Gamble have warned of weakening sales amid the turbulent economy.Jasmine Enberg, a vice president and principal analyst at eMarketer, said companies in these sectors generate \"about half of all social ads in the U.S.,\" and a decrease in their advertising spend \"will have a ripple effect on the social ad market.\"Mark Zuckerberg, CEO of Meta Platforms Inc.; from left, Lauren Sanchez; Jeff Bezos, founder of Amazon.com Inc.; Sundar Pichai, CEO of Alphabet Inc.; and Elon Musk, CEO of Tesla Inc., during the 60th presidential inauguration in the rotunda of the U.S. Capitol in Washington, D.C., on Jan. 20, 2025.Julia Demaree Nikhinson | Bloomberg | Getty ImagesEnberg believes that a potential slowdown in advertising spend will hurt smaller tech platforms more than their larger rivals.\"I think what we're likely to see is what we tend to see in times of economic uncertainty, which is that advertisers seek refuge in larger platforms that provide them with scale and consistent ROI,\" Enberg said.But even tech giants like Meta may feel some financial pain, explained Greg Silverman, the global director of brand economics at consulting firm Interbrand.Although other retailers may decide to run Facebook ads now that China-linked retailers like Temu are stepping back, those promotional campaigns are unlikely to be as lucrative for those companies, said Silverman.Temu was willing to spend big on Facebook ads because it previously benefited from the de minimis trade loophole, Silverman said, and it's unlikely that any U.S. retailer will do the same, particularly with a rickety supply chain and high tariffs potentially raising the cost of their goods.\"The return on ad spend that Temu was getting on Facebook is going to be hard for anyone else to recreate,\" Silverman said.For Wells Fargo's Samana, the current economic uncertainty can be traced to trade policy and tariffs and their ensuing effects throughout the markets.\"We started the year with very low levels on tariffs,\" Samana said. \"Tariffs at the end of this are going to be higher, and they're going to be meaningfully higher, and that is just not good for markets. I think that's the only point that matters.\"Correction: AppLovin said it would sell its mobile gaming business to Tripledot Studios. An earlier version misstated the move.",
  "image": "https://image.cnbcfm.com/api/v1/image/108094543-1738190828828-108094543-17381907042025-01-20t161411z_705425238_rc2sdcavkpm0_rtrmadp_0_usa-trump-inauguration.jpeg?v=1738190876\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108094543\" data-test=\"InlineImage\"\u003e\u003cp\u003eMark Zuckerberg arrives before the inauguration of Donald Trump as the 47th president of the United States takes place inside the Capitol Rotunda of the U.S. Capitol building in Washington, D.C., Monday, Jan. 20, 2025.\u003c/p\u003e\u003cp\u003eKenny Holston | Via Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe digital \u003ca href=\"https://www.cnbc.com/2025/04/30/meta-q1-earnings-report-2025.html\"\u003eadvertising\u003c/a\u003e market was sunny enough for investors this past quarter, providing what could be a last hurrah before a looming economic storm from President \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e\u0026#39;s \u003ca href=\"https://www.cnbc.com/2025/05/09/trump-china-tariffs-trade-talks.html\"\u003etariff\u003c/a\u003e onslaught.\u003c/p\u003e\u003cp\u003eWall Street cheered the first-quarter results from \u003ca href=\"https://www.cnbc.com/2025/04/24/alphabet-expects-slight-headwind-to-ads-business-in-2025-execs-say.html\"\u003etech giants\u003c/a\u003e like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-5\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/META/\"\u003eMeta\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-6\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOG/\"\u003eAlphabet\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, which both saw shares rise on strong revenue and \u003ca href=\"https://www.cnbc.com/earnings/\"\u003eearnings\u003c/a\u003e that beat analyst expectations.\u003c/p\u003e\u003cp\u003eThe strong numbers from the online advertising titans in the face of \u003ca href=\"https://www.cnbc.com/2025/05/06/wobbling-economy-will-push-the-fed-to-cut-interest-rates-later-this-year-cnbc-survey-finds.html\"\u003eeconomic worries\u003c/a\u003e showed that companies were still willing to promote their goods and services to consumers across the internet.\u003c/p\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-9\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/AMZN/\"\u003eAmazon\u0026#39;s\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e \u003ca href=\"https://www.cnbc.com/2025/05/01/amazons-ad-business-grew-19percent-in-first-quarter-topping-estimates.html\"\u003eburgeoning online advertising unit\u003c/a\u003e also topped analyst estimates for the quarter. The online retail giant\u0026#39;s first-quarter ad sales jumped 19% year over year, representing a faster growth rate than Meta\u0026#39;s and Google\u0026#39;s advertising sales, which were 16% and 9%, respectively.\u003c/p\u003e\u003cp\u003eSmaller social media and online advertising firms like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-11\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/RDDT/\"\u003eReddit\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-12\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/SNAP/\"\u003eSnap\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-13\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/PINS/\"\u003ePinterest\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e posted \u003ca href=\"https://www.cnbc.com/2025/04/29/snap-q1-earnings-report-2025.html\"\u003efirst-quarter sales\u003c/a\u003e that \u003ca href=\"https://www.cnbc.com/2025/05/01/reddit-rddt-q1-2025.html\"\u003etopped\u003c/a\u003e Wall Street projections. And even advertising technology companies like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-16\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/APP/\"\u003eAppLovin\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-17\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/TTD/\"\u003eThe Trade Desk\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e posted strong quarterly earnings.\u003c/p\u003e\u003cp\u003eAppLovin shares surged nearly 15% on Wednesday after the provider of mobile ad technology \u003ca href=\"https://www.cnbc.com/2025/05/07/applovin-earnings-mobile-gaming.html\"\u003esurpassed analysts estimates\u003c/a\u003e and said it would sell its mobile gaming business to Tripledot Studios.\u003c/p\u003e\u003cp\u003eShares of The Trade Desk jumped 18% on Friday, just one day after the ad-tech firm \u003ca href=\"https://www.businesswire.com/news/home/20250508185295/en/The-Trade-Desk-Reports-First-Quarter-2025-Financial-Results\" target=\"_blank\"\u003ereported first-quarter earnings\u003c/a\u003e that beat on the top and bottom lines.\u003c/p\u003e\u003cp\u003eThe celebrations stopped, however, when it came time for executives to discuss the rest of the year.\u003c/p\u003e\u003cp\u003eMeta Chief Financial Officer \u003ca href=\"https://www.cnbc.com/2025/04/30/meta-says-china-retailers-are-reducing-digital-ad-spend.html\"\u003eSusan Li last week said\u003c/a\u003e that \u0026#34;Asia-based e-commerce exporters\u0026#34; are spending less on digital advertising due to the cessation of the de minimis trade loophole that benefited retail upstarts and \u003ca href=\"https://www.cnbc.com/2024/01/31/metas-continued-rally-could-hinge-on-fortunes-of-temu-and-shein.html\"\u003eheavy Facebook spenders like Temu and Shein\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s very early, hard to know how things will play out over the quarter, and certainly, harder to know that for the rest of the year,\u0026#34; Li said during a call with analysts.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eExecutives at Alphabet and Pinterest shared similar sentiments about slower, Asia-specific ad sales and broader \u003ca href=\"https://www.cnbc.com/2025/04/21/tech-earnings-trump-tariffs-tesla-apple-alphabet-meta-microsoft-amazon-nvidia.htmlhttps:/www.cnbc.com/2025/04/21/tech-earnings-trump-tariffs-tesla-apple-alphabet-meta-microsoft-amazon-nvidia.html\"\u003emacroeconomic uncertainty\u003c/a\u003e heading into the rest of the year. Snap went so far as to pull its second-quarter guidance over the unpredictable economy potentially shrinking corporate ad budgets for the rest of the year.\u003c/p\u003e\u003cp\u003eJeff Green, CEO of The Trade Desk, also noted the challenging economy on Thursday, saying that marketers face an \u0026#34;important time\u0026#34; as they work \u0026#34;amid increased macro volatility to start the year.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;The good news is, Q1 was really strong, and Q4 of last year was pretty darn good,\u0026#34; said Sameer Samana, head of global equities and real assets for Wells Fargo Investment Institute.\u003c/p\u003e\u003cp\u003eBut with companies from a variety of sectors lowering or even \u003ca href=\"https://www.cnbc.com/2025/05/05/ford-motor-f-earnings-q1-2025.html\"\u003esuspending\u003c/a\u003e their 2025 \u003ca href=\"https://www.cnbc.com/2025/05/05/mattel-pulls-annual-forecasts-will-hike-prices-as-tariffs-raise-costs.html\"\u003esales guidance\u003c/a\u003e, as in the case of \u003ca href=\"https://www.cnbc.com/2025/05/01/auto-giants-ditch-guidance-as-industry-reels-from-trump-tariff-chaos.html\"\u003eauto giants\u003c/a\u003e like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-26\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/F/\"\u003eFord Motor\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and toymaker \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-27\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/MAT/\"\u003eMattel\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e, Samana believes the good times are likely coming to an end.\u003c/p\u003e\u003cp\u003e\u0026#34;What it\u0026#39;s telling me is that we better enjoy this rally, we better enjoy these good numbers,\u0026#34; Samana said. \u0026#34;This is going to be about as good as it gets for the coming year.\u0026#34;\u003c/p\u003e\u003cp\u003eIn an ominous sign for social media and online advertising companies, retail and consumer packaged goods businesses like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-28\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/PG/\"\u003eProcter \u0026amp; Gamble\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e have \u003ca href=\"https://www.cnbc.com/2025/04/24/procter-gamble-pg-q3-2025-earnings.html\"\u003ewarned of weakening sales\u003c/a\u003e amid the turbulent economy.\u003c/p\u003e\u003cp\u003eJasmine Enberg, a vice president and principal analyst at eMarketer, said companies in these sectors generate \u0026#34;about half of all social ads in the U.S.,\u0026#34; and a decrease in their advertising spend \u0026#34;will have a ripple effect on the social ad market.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"ArticleBody-InlineImage-108127180\" data-test=\"InlineImage\"\u003e\u003cp\u003eMark Zuckerberg, CEO of Meta Platforms Inc.; from left, Lauren Sanchez; Jeff Bezos, founder of Amazon.com Inc.; Sundar Pichai, CEO of Alphabet Inc.; and Elon Musk, CEO of Tesla Inc., during the 60th presidential inauguration in the rotunda of the U.S. Capitol in Washington, D.C., on Jan. 20, 2025.\u003c/p\u003e\u003cp\u003eJulia Demaree Nikhinson | Bloomberg | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eEnberg believes that a potential slowdown in advertising spend will hurt smaller tech platforms more than their larger rivals.\u003c/p\u003e\u003cp\u003e\u0026#34;I think what we\u0026#39;re likely to see is what we tend to see in times of economic uncertainty, which is that advertisers seek refuge in larger platforms that provide them with scale and consistent ROI,\u0026#34; Enberg said.\u003c/p\u003e\u003cp\u003eBut even tech giants like Meta may feel some financial pain, explained Greg Silverman, the global director of brand economics at consulting firm Interbrand.\u003c/p\u003e\u003cp\u003eAlthough other retailers may decide to run Facebook ads now that China-linked retailers like Temu are stepping back, those promotional campaigns are unlikely to be as lucrative for those companies, said Silverman.\u003c/p\u003e\u003cp\u003eTemu was willing to spend big on Facebook ads because it previously benefited from the de minimis trade loophole, Silverman said, and it\u0026#39;s unlikely that any U.S. retailer will do the same, particularly with a rickety supply chain and high tariffs potentially raising the cost of their goods.\u003c/p\u003e\u003cp\u003e\u0026#34;The return on ad spend that Temu was getting on Facebook is going to be hard for anyone else to recreate,\u0026#34; Silverman said.\u003c/p\u003e\u003cp\u003eFor Wells Fargo\u0026#39;s Samana, the current economic uncertainty can be traced to trade policy and tariffs and their ensuing effects throughout the markets.\u003c/p\u003e\u003cp\u003e\u0026#34;We started the year with very low levels on tariffs,\u0026#34; Samana said. \u0026#34;Tariffs at the end of this are going to be higher, and they\u0026#39;re going to be meaningfully higher, and that is just not good for markets. I think that\u0026#39;s the only point that matters.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cem\u003eCorrection: AppLovin said it would sell its mobile gaming business to Tripledot Studios. An earlier version misstated the move.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108143190\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000375520\" aria-labelledby=\"Placeholder-ArticleBody-Video-108143190\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108143191-17467360001746735996-39716626469-1080pnbcnews.jpg?v=1746735999\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"There are growth positive policies on the horizon, says JPMorgan\u0026#39;s Abby Yoder\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-09T16:23:20Z",
  "modifiedTime": "2025-05-09T19:07:40Z"
}
