{
  "id": "23af6f09-fcf6-46d9-a549-72a70e9a60e6",
  "title": "Is the BFSI sector set for a major breakout in June?",
  "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-bfsi-sector-set-for-a-major-breakout-in-june/articleshow/121558457.cms",
  "description": "Several stocks, particularly in the BFSI sector, are showing bullish signals with increased open interest in the June series. PNB, Bank of India, Manappuram Finance, SBI Cards, and SBI are poised for potential breakouts. BSE is also exhibiting strong upside potential due to regulatory changes, while Inox Wind sees continued bullish momentum with high rollover rates.",
  "author": "",
  "published": "Mon, 02 Jun 2025 05:54:54 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "",
  "length": 4646,
  "excerpt": "Several stocks, particularly in the BFSI sector, are showing bullish signals with increased open interest in the June series. PNB, Bank of India, Manappuram Finance, SBI Cards, and SBI are poised for potential breakouts. BSE is also exhibiting strong upside potential due to regulatory changes, while Inox Wind sees continued bullish momentum with high rollover rates.",
  "siteName": "The Economic Times",
  "favicon": "",
  "text": "A look at select stock futures that have seen higher-than average rollovers to June series, and their near-term outlook. Analysts said that the BFSI (banking, financial services, and insurance) sector is on the verge of a fresh breakout and looks firm in the uncertain market.Tired of too many ads? Remove AdsPNB CMP (Rs): 105.8 Change in Open Interest in June Series: +6.1% Change in price in June Series: +3.4% PNB added over 6% open interest in the June series as long positions were built on Friday. Vipin Kumar, assistant vice president, derivatives and technical research, Globe Capital Market, said the stock had witnessed a bullish breakout with a noticeable rise in volumes on daily charts. “Considering the current chart patterns and strong long buildup, we expect it to move northward till it is trading above Rs 100 levels and anticipate it to test Rs 112-Rs 115 levels in the immediate near term,” he said. He suggests buying the June future for a target of Rs 112-Rs 115, with a stop loss at Rs 100 (ex-dividend support at Rs 97, effective June 20)Tired of too many ads? Remove AdsBANK OF INDIACMP (Rs): 121.9 Change in Open Interest in June Series: +1.8% Change in price in June Series: +2.3% Kumar said strong rollovers of nearly 98% were seen on expiry day—signifi cantly higher than the past three months’ average of 91%—and the stock has also registered a bullish breakout on weekly charts, setting the tone for a medium-term up move. “Considering both technical charts as well as derivatives data, we expect a strong bullish momentum in this counter till it is holding above Rs 114 levels (ex-dividend support at Rs 110) and likely to test Rs 129-Rs 135 levels in the near term,” he said.MANAPPURAM FIN CMP (Rs): 237.6 Change in Open Interest in June Series: +59% Change in price in June Series: +2.5% “Manappuram Finance has broken out of a tight consolidation range between Rs 220 and Rs 235, after spending nearly two months near its record high,” said Ajit Mishra, senior vice president, research, Religare Broking. Mishra said the stock’s chart pattern, along with a noticeable surge in volumes and open interest, indicates a likely resumption of the uptrend. He suggested traders buy its June contracts for a target of `256, with a stop loss at `232Tired of too many ads? Remove AdsSBI CARDS AND PAYMENT SERVICES CMP (Rs): 919.7 Change in Open Interest in June Series: +0.8% Change in price in June Series: +0.6% “From a technical perspective, SBI Card is sending early reversal signals, trading close to the neckline of a multi-year base pattern and staying comfortably above its key moving averages on the daily chart—both are solid markers of enduring strength,” said Dhupesh Dhameja of Samco. He said fresh long trades can be considered from Rs 910-Rs 921, for a target of Rs 1,050, with a stop loss at Rs 850.STATE BANK OF INDIA CMP (Rs): 814 Change in Open Interest in June Series: +10% Change in price in June Series: +2.1% Mishra said the market is witnessing noticeable traction in the PSU banking space, with SBI also participating in the move. The stock has seen a breakout and a strong surge in open interest. “All indications suggest that the prevailing bullish tone is likely to strengthen further,” he said. Mishra suggests traders buy its future for a target of `864, with a stop loss at `795.BSE CMP (Rs): 2,669 Change in Open Interest in June Series: +17.7% Change in price in June Series: +8.3% The stock surged about 27% in May and hit a fresh 52-week high on Friday and led to high trading volumes following Sebi’s decision to restrict weekly expiries to Tuesday and Thursday, which is expected to benefit the exchange’s business. Dhupesh Dhameja, derivatives analyst, Samco Securities, said the alignment of technical resilience and strong derivative signals presents a compelling case for further upside potential in the coming sessions. He said traders may consider initiating fresh long positions around Rs 2,600- Rs 2,670, with a target of Rs 3,020. The bullish view remains intact as long as the stock holds above Rs 2,380.INOX WIND CMP (Rs): 195 Change in Open Interest in June Series: +19.2% Change in price in June Series: +1.9% “With an impressive 95.21% rollover rate, it’s evident that market participants are keen to carry forward their bullish bets, boosting optimism heading into the new series,” said Dhameja. He said the stock is trading above its 10- and 20-day moving averages, and other indicators also confirm that bullish momentum is alive and well. Dhameja said traders can create fresh long positions between Rs 187-Rs 195, for a target of Rs 225. The stop loss is at Rs 172.",
  "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-26662,resizemode-75,msid-121558457/markets/stocks/news/is-the-bfsi-sector-set-for-a-major-breakout-in-june.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"articlebody_121558457\"\u003e\u003cp\u003eA look at select \u003ca href=\"https://economictimes.indiatimes.com/topic/stock-futures\"\u003estock futures\u003c/a\u003e that have seen higher-than average rollovers to June series, and their near-term outlook. Analysts said that the BFSI (banking, financial services, and insurance) sector is on the verge of a fresh breakout and looks firm in the uncertain market.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003ePNB\u003c/strong\u003e\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 105.8 Change in Open Interest in June Series: +6.1% Change in price in June Series: +3.4% \u003c/p\u003e\u003cp\u003ePNB added over 6% open interest in the June series as long positions were built on Friday. Vipin Kumar, assistant vice president, derivatives and technical research, Globe Capital Market, said the stock had witnessed a bullish breakout with a noticeable rise in volumes on daily charts. \u003c/p\u003e\u003cp\u003e“Considering the current chart patterns and strong long buildup, we expect it to move northward till it is trading above Rs 100 levels and anticipate it to test Rs 112-Rs 115 levels in the immediate near term,” he said. He suggests buying the June future for a target of Rs 112-Rs 115, with a stop loss at Rs 100 (ex-dividend support at Rs 97, effective June 20)\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eBANK OF INDIA\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eCMP (Rs): 121.9 Change in Open Interest in June Series: +1.8% Change in price in June Series: +2.3% \u003c/p\u003e\u003cp\u003eKumar said strong rollovers of nearly 98% were seen on expiry day—signifi cantly higher than the past three months’ average of 91%—and the stock has also registered a bullish breakout on weekly charts, setting the tone for a medium-term up move. \u003c/p\u003e\u003cp\u003e“Considering both technical charts as well as derivatives data, we expect a strong bullish momentum in this counter till it is holding above Rs 114 levels (ex-dividend support at Rs 110) and likely to test Rs 129-Rs 135 levels in the near term,” he said.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eMANAPPURAM FIN\u003c/strong\u003e\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 237.6 Change in Open Interest in June Series: +59% Change in price in June Series: +2.5% \u003c/p\u003e\u003cp\u003e“Manappuram Finance has broken out of a tight consolidation range between Rs 220 and Rs 235, after spending nearly two months near its record high,” said Ajit Mishra, senior vice president, research, Religare Broking. \u003c/p\u003e\u003cp\u003eMishra said the stock’s chart pattern, along with a noticeable surge in volumes and open interest, indicates a likely resumption of the uptrend. He suggested traders buy its June contracts for a target of `256, with a stop loss at `232\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003e\u003c/strong\u003e\u003ca href=\"https://economictimes.indiatimes.com/topic/sbi-cards\"\u003eSBI CARDS\u003c/a\u003e AND PAYMENT SERVICES\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 919.7 Change in Open Interest in June Series: +0.8% Change in price in June Series: +0.6% \u003c/p\u003e\u003cp\u003e“From a technical perspective, SBI Card is sending early reversal signals, trading close to the neckline of a multi-year base pattern and staying comfortably above its key moving averages on the daily chart—both are solid markers of enduring strength,” said Dhupesh Dhameja of Samco. He said fresh long trades can be considered from Rs 910-Rs 921, for a target of Rs 1,050, with a stop loss at Rs 850.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003e\u003c/strong\u003e\u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/state-bank-of-india/stocks/companyid-11984.cms\"\u003eSTATE BANK OF INDIA\u003c/a\u003e\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 814 Change in Open Interest in June Series: +10% Change in price in June Series: +2.1% \u003c/p\u003e\u003cp\u003eMishra said the market is witnessing noticeable traction in the PSU banking space, with SBI also participating in the move. The stock has seen a breakout and a strong surge in open interest. “All indications suggest that the prevailing bullish tone is likely to strengthen further,” he said. Mishra suggests traders buy its future for a target of `864, with a stop loss at `795.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eBSE\u003c/strong\u003e\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 2,669 Change in Open Interest in June Series: +17.7% Change in price in June Series: +8.3% \u003c/p\u003e\u003cp\u003eThe stock surged about 27% in May and hit a fresh 52-week high on Friday and led to high trading volumes following Sebi’s decision to restrict weekly expiries to Tuesday and Thursday, which is expected to benefit the exchange’s business. \u003c/p\u003e\u003cp\u003eDhupesh Dhameja, derivatives analyst, Samco Securities, said the alignment of technical resilience and strong derivative signals presents a compelling case for further upside potential in the coming sessions. He said traders may consider initiating fresh long positions around Rs 2,600- Rs 2,670, with a target of Rs 3,020. The bullish view remains intact as long as the stock holds above Rs 2,380.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eINOX WIND\u003c/strong\u003e\u003c/strong\u003e \u003cbr/\u003eCMP (Rs): 195 Change in Open Interest in June Series: +19.2% Change in price in June Series: +1.9% \u003c/p\u003e\u003cp\u003e“With an impressive 95.21% rollover rate, it’s evident that market participants are keen to carry forward their bullish bets, boosting optimism heading into the new series,” said Dhameja. \u003c/p\u003e\u003cp\u003eHe said the stock is trading above its 10- and 20-day moving averages, and other indicators also confirm that bullish momentum is alive and well. Dhameja said traders can create fresh long positions between Rs 187-Rs 195, for a target of Rs 225. The stop loss is at Rs 172.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
