{
  "id": "241b54d0-5cc6-4e98-bb8d-22c04e06b26d",
  "title": "Cuba grid collapses again, hurricane heaps on misery",
  "link": "https://www.investing.com/news/commodities-news/cuba-suffers-third-major-setback-in-restoring-power-to-island-millions-still-in-dark-3671888",
  "description": "",
  "author": "Reuters",
  "published": "2024-10-21 00:52:52",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 5115,
  "excerpt": "Cuba grid collapses again, hurricane heaps on misery",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Dave Sherwood HAVANA (Reuters) -Cuba's electrical grid collapsed again on Sunday, the fourth such failure in 48 hours, with a hurricane making landfall to compound the island's misery and threaten further havoc on its decrepit infrastructure. Cuba earlier on Sunday had said it was making headway restoring service after multiple false starts, though millions of people remained without electricity more than two days after the grid's initial collapse. \"Restoration work began immediately,\" the country's energy and mines ministry said on X. Hurricane Oscar made landfall on the Caribbean island on Sunday, bringing strong winds, a powerful storm surge and rain to parts of eastern Cuba and threatening to further complicate the government's efforts to reestablish service. Cuba's meteorological survey warned of \"an extremely dangerous situation\" in eastern Cuba, while the U.S. National Hurricane Center reported winds of 75 miles per hour (120 kph) as the storm made its way across the island. \"On the forecast track, the center of Oscar is expected to continue moving across eastern Cuba tonight and Monday, then emerge off the northern coast of Cuba late Monday and cross the central Bahamas on Tuesday,\" the Hurricane Center said. The Communist-run government canceled school through Wednesday - a near unprecedented move in Cuba - citing the hurricane and the ongoing energy crisis. Officials said only essential workers should report to work on Monday. The repeated grid collapses marked a major setback in the government's efforts to quickly restore power to exhausted residents already suffering from severe shortages of food, medicine and fuel. The multiple setbacks in the first 48 hours also underscored the complexity of the work and the still precarious state of the country's grid. Cuba had restored power to 160,000 clients in Havana just prior to the grid's Sunday collapse, giving some residents a glimmer of hope. But housewife Anabel Gonzalez, of old Havana, a neighborhood popular with tourists, said she was growing desperate after three days without power. \"My cell phone is dead and look at my refrigerator. The little that I had has all gone to waste,\" she said, pointing to bare shelves in her two-room home. Energy and mines minister Vicente de la O Levy told reporters earlier on Sunday he expected the grid to be fully functional by Monday or Tuesday but warned residents not to expect dramatic improvements. It was not immediately clear how much the latest setback would delay the government's efforts. Cuba's national electrical grid first crashed around midday on Friday after the island's largest power plant shut down, sowing chaos. The grid collapsed again on Saturday morning, state-run media reported.  By early evening on Saturday, authorities reported some progress restoring power before announcing another partial grid collapse. RISING TENSIONS Reuters reporters witnessed two small protests overnight after a grid failure left Havana in the dark late Saturday, one on the outskirts of the capital in Marianao and the other in the more central Cuatro Caminos. Various videos of protests elsewhere in the capital began to crop up on social media late on Saturday, though Reuters was not able to verify their authenticity. Energy Minister O Levy said the blackouts were bothersome to residents, but he said most Cubans understood and supported government efforts to restore power. \"It is Cuban culture to cooperate,\" O Levy told reporters on Sunday. \"Those isolated and minimal incidents that do exist, we catalog them as incorrect, as indecent.\" Internet traffic dropped off sharply in Cuba over the weekend, according to data from internet monitoring group NetBlocks, as vast power outages made it all but impossible for most island residents to charge phones and get online.  \"Network data show that Cuba remains largely offline as the island experiences a second nationwide power outage,\" Netblocks said on Saturday. The government has blamed weeks of worsening blackouts - as long as 10 to 20 hours a day across much of the island - on deteriorating infrastructure, fuel shortages and rising demand.  Cuba also blames the U.S. trade embargo, as well as sanctions instituted by then-President Donald Trump, for ongoing difficulties in acquiring fuel and spare parts to operate and maintain its oil-fired plants. The U.S. has denied any role in the grid failures. Cuba depends on imports to feed its largely obsolete, oil-fired power plants. Fuel deliveries to the island have dropped significantly this year as Venezuela, Russia and Mexico, once important suppliers, have slashed their exports to Cuba. Ally Venezuela - struggling to supply its own market - cut by half its deliveries of subsidized fuel to Cuba this year, forcing the island to search for more costly oil on the spot market.   Mexico, another frequent supplier, appeared also to have cut fuel flows to Cuba during a presidential election year. Recently elected President Claudia Sheinbaum has not said if the state-supported supply to Cuba will continue under same terms under her administration.",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK9J02L_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Dave Sherwood \u003c/p\u003e \u003cp\u003eHAVANA (Reuters) -Cuba\u0026#39;s electrical grid collapsed again on Sunday, the fourth such failure in 48 hours, with a hurricane making landfall to compound the island\u0026#39;s misery and threaten further havoc on its decrepit infrastructure.\u003c/p\u003e \u003cp\u003eCuba earlier on Sunday had said it was making headway restoring service after multiple false starts, though millions of people remained without electricity more than two days after the grid\u0026#39;s initial collapse.\u003c/p\u003e \u003cp\u003e\u0026#34;Restoration work began immediately,\u0026#34; the country\u0026#39;s energy and mines ministry said on X.\u003c/p\u003e \u003cp\u003eHurricane Oscar made landfall on the Caribbean island on Sunday, bringing strong winds, a powerful storm surge and rain to parts of eastern Cuba and threatening to further complicate the government\u0026#39;s efforts to reestablish service.\u003c/p\u003e \u003cp\u003eCuba\u0026#39;s meteorological survey warned of \u0026#34;an extremely dangerous situation\u0026#34; in eastern Cuba, while the U.S. National Hurricane Center reported winds of 75 miles per hour (120 kph) as the storm made its way across the island.\u003c/p\u003e \u003cp\u003e\u0026#34;On the forecast track, the center of Oscar is expected to continue moving across eastern Cuba tonight and Monday, then emerge off the northern coast of Cuba late Monday and cross the central Bahamas on Tuesday,\u0026#34; the Hurricane Center said.\u003c/p\u003e \u003cp\u003eThe Communist-run government canceled school through Wednesday - a near unprecedented move in Cuba - citing the hurricane and the ongoing energy crisis. Officials said only essential workers should report to work on Monday.\u003c/p\u003e \u003cp\u003eThe repeated grid collapses marked a major setback in the government\u0026#39;s efforts to quickly restore power to exhausted residents already suffering from severe shortages of food, medicine and fuel. \u003c/p\u003e \u003cp\u003eThe multiple setbacks in the first 48 hours also underscored the complexity of the work and the still precarious state of the country\u0026#39;s grid.\u003c/p\u003e \u003cp\u003eCuba had restored power to 160,000 clients in Havana just prior to the grid\u0026#39;s Sunday collapse, giving some residents a glimmer of hope.\u003c/p\u003e \u003cp\u003eBut housewife Anabel Gonzalez, of old Havana, a neighborhood popular with tourists, said she was growing desperate after three days without power.\u003c/p\u003e \u003cp\u003e\u0026#34;My cell phone is dead and look at my refrigerator. The little that I had has all gone to waste,\u0026#34; she said, pointing to bare shelves in her two-room home.\u003c/p\u003e \u003cp\u003eEnergy and mines minister Vicente de la O Levy told reporters earlier on Sunday he expected the grid to be fully functional by Monday or Tuesday but warned residents not to expect dramatic improvements.\u003c/p\u003e \u003cp\u003eIt was not immediately clear how much the latest setback would delay the government\u0026#39;s efforts.\u003c/p\u003e \u003cp\u003eCuba\u0026#39;s national electrical grid first crashed around midday on Friday after the island\u0026#39;s largest power plant shut down, sowing chaos. The grid collapsed again on Saturday morning, state-run media reported. \u003c/p\u003e \u003cp\u003eBy early evening on Saturday, authorities reported some progress restoring power before announcing another partial grid collapse.\u003c/p\u003e \u003cp\u003eRISING TENSIONS\u003c/p\u003e \u003cp\u003eReuters reporters witnessed two small protests overnight after a grid failure left Havana in the dark late Saturday, one on the outskirts of the capital in Marianao and the other in the more central Cuatro Caminos. Various videos of protests elsewhere in the capital began to crop up on social media late on Saturday, though Reuters was not able to verify their authenticity.\u003c/p\u003e \u003cp\u003eEnergy Minister O Levy said the blackouts were bothersome to residents, but he said most Cubans understood and supported government efforts to restore power. \u003c/p\u003e \u003cp\u003e\u0026#34;It is Cuban culture to cooperate,\u0026#34; O Levy told reporters on Sunday. \u0026#34;Those isolated and minimal incidents that do exist, we catalog them as incorrect, as indecent.\u0026#34;\u003c/p\u003e \u003cp\u003eInternet traffic dropped off sharply in Cuba over the weekend, according to data from internet monitoring group NetBlocks, as vast power outages made it all but impossible for most island residents to charge phones and get online. \u003c/p\u003e \u003cp\u003e\u0026#34;Network data show that Cuba remains largely offline as the island experiences a second nationwide power outage,\u0026#34; Netblocks said on Saturday.\u003c/p\u003e \u003cp\u003eThe government has blamed weeks of worsening blackouts - as long as 10 to 20 hours a day across much of the island - on deteriorating infrastructure, fuel shortages and rising demand. \u003c/p\u003e \u003cp\u003eCuba also blames the U.S. trade embargo, as well as sanctions instituted by then-President Donald Trump, for ongoing difficulties in acquiring fuel and spare parts to operate and maintain its oil-fired plants.\u003c/p\u003e \u003cp\u003eThe U.S. has denied any role in the grid failures.\u003c/p\u003e \u003cp\u003eCuba depends on imports to feed its largely obsolete, oil-fired power plants. Fuel deliveries to the island have dropped significantly this year as Venezuela, Russia and Mexico, once important suppliers, have slashed their exports to Cuba.\u003c/p\u003e \u003cp\u003eAlly Venezuela - struggling to supply its own market - cut by half its deliveries of subsidized fuel to Cuba this year, forcing the island to search for more costly oil on the spot market.  \u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEK9J09W_L.jpg\" title=\"© Reuters. Oney Machado and Diana Machado, Havana, October 20, 2024. REUTERS/Norlys Perez\" alt=\"© Reuters. Oney Machado and Diana Machado, Havana, October 20, 2024. REUTERS/Norlys Perez\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eMexico, another frequent supplier, appeared also to have cut fuel flows to Cuba during a presidential election year. \u003c/p\u003e \u003cp\u003eRecently elected President Claudia Sheinbaum has not said if the state-supported supply to Cuba will continue under same terms under her administration.\u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-20T07:42:14Z",
  "modifiedTime": null
}
