{
  "id": "37c8426e-4679-44d4-ae96-e0ae445ddfd1",
  "title": "RBI's OMO buys get a strong response amid high prices",
  "link": "https://economictimes.indiatimes.com/markets/bonds/rbis-omo-buys-get-a-strong-response-amid-high-prices/articleshow/120946637.cms",
  "description": "Bids offered for this OMO round were worth ₹1.32 lakh crore, against the notified amount of ₹50,000 crore. The Reserve Bank of India (RBI) has scheduled further bond purchases worth ₹75,000 crore for the month of May with an aim to quicken the pace of policy rate transmissions.",
  "author": "",
  "published": "Wed, 07 May 2025 05:37:37 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "",
  "length": 1707,
  "excerpt": "Bids offered for this OMO round were worth ₹1.32 lakh crore, against the notified amount of ₹50,000 crore. The Reserve Bank of India (RBI) has scheduled further bond purchases worth ₹75,000 crore for the month of May with an aim to quicken the pace of policy rate transmissions.",
  "siteName": "The Economic Times",
  "favicon": "",
  "text": "Mumbai: The central bank's bond purchases in open market operations (OMO) on Tuesday saw strong demand, with market participants offering bonds worth more than double the notified amount. Prices for the bonds were majorly at a premium from market prices, and in line with expectations, treasury heads said. Tired of too many ads? Remove AdsBids offered for this OMO round were worth ₹1.32 lakh crore, against the notified amount of ₹50,000 crore. The Reserve Bank of India (RBI) has scheduled further bond purchases worth ₹75,000 crore for the month of May with an aim to quicken the pace of policy rate transmissions.\"Prices for most bonds were at a premium, except for the paper maturing in 2031, which was priced at a discount from the markets,\" said Mataprasad Pandey, vice president at Arete Capital Services. \"The auction had good demand and further auctions are expected to see great demand as well because market participants know that they will get a good price.\"The auction did not have ultra long tenured bonds, and maturities ranged from 3- to 14-year paper. Securities maturing in 2035 - the 7.10% GS 2034 paper - saw the maximum demand. Investors have tried to exit their positions by selling the 7.10 2034 paper to RBI, as they would want to make space for the new 10-year paper, a bond trader from a private sector bank said. Tired of too many ads? Remove AdsRBI auctioned a new 10 year paper on Friday, May 2, while the 7.10% GS 2034 paper used to be the benchmark security before October 2024. The next OMO purchase is scheduled for Friday, May 9 for a quantum of ₹25,000 crore.Yields of the 10-year benchmark security closed at 6.35% on Tuesday, up 3 basis points from its previous close.",
  "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-373188,resizemode-75,msid-120946637/markets/bonds/rbis-omo-buys-get-a-strong-response-amid-high-prices.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"articlebody_120946637\"\u003e\u003cp\u003eMumbai: The central bank\u0026#39;s \u003ca href=\"https://economictimes.indiatimes.com/topic/bond-purchases\"\u003ebond purchases\u003c/a\u003e in open market operations (OMO) on Tuesday saw strong demand, with market participants offering bonds worth more than double the notified amount. Prices for the bonds were majorly at a premium from market prices, and in line with expectations, treasury heads said. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eBids offered for this OMO round were worth ₹1.32 lakh crore, against the notified amount of ₹50,000 crore. The \u003ca href=\"https://economictimes.indiatimes.com/topic/reserve-bank-of-india\"\u003eReserve Bank of India\u003c/a\u003e (RBI) has scheduled further bond purchases worth ₹75,000 crore for the month of May with an aim to quicken the pace of policy rate transmissions.\u003c/p\u003e\u003cp\u003e\u0026#34;Prices for most bonds were at a premium, except for the paper maturing in 2031, which was priced at a discount from the markets,\u0026#34; said Mataprasad Pandey, vice president at Arete Capital Services. \u0026#34;The auction had good demand and further auctions are expected to see great demand as well because market participants know that they will get a good price.\u0026#34;\u003c/p\u003e\u003cp\u003eThe auction did not have ultra long tenured bonds, and maturities ranged from 3- to 14-year paper. Securities maturing in 2035 - the 7.10% GS 2034 paper - saw the maximum demand. \u003c/p\u003e\u003cp\u003eInvestors have tried to exit their positions by selling the 7.10 2034 paper to RBI, as they would want to make space for the new 10-year paper, a bond trader from a private sector bank said. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eRBI auctioned a new 10 year paper on Friday, May 2, while the 7.10% GS 2034 paper used to be the benchmark security before October 2024. \u003c/p\u003e\u003cp\u003eThe next OMO purchase is scheduled for Friday, May 9 for a quantum of ₹25,000 crore.\u003c/p\u003e\u003cp\u003eYields of the 10-year benchmark security closed at 6.35% on Tuesday, up 3 basis points from its previous close.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": null,
  "modifiedTime": null
}
