{
  "id": "3dc5b106-5561-4411-ab30-d81ca46735e3",
  "title": "A herpes misdiagnosis sent Hollywood icon Halle Berry on a crusade for all women",
  "link": "https://fortune.com/2024/10/15/halle-berry-menopause-midlife-wellness-platform-respin/",
  "description": "“I realized that my own doctor didn’t really understand what was happening with my menopausal body,” the actress and entrepreneur told the Fortune’s Most Powerful Women audience.",
  "author": "Amanda Gerut",
  "published": "Wed, 16 Oct 2024 00:36:51 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Conferences"
  ],
  "byline": "Amanda Gerut",
  "length": 3097,
  "excerpt": "“I realized that my own doctor didn’t really understand what was happening with my menopausal body,” the actress and entrepreneur told the Fortune’s Most Powerful Women audience.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "A night of great intimacy was followed by a painful morning in which Academy Award-winning actress Halle Berry felt like she was being attacked by razor blades. She took a trip to the doctor, who told her she had “the worst case of herpes he had ever seen,” Berry recalled. Turns out, Berry, 54, was suffering the incredibly common symptoms of menopause after she had been in perimenopause—the transitional phase of a woman’s life that leads to the end of her cycle—for about 10 years and didn’t know it.  “I’m in menopause,” Berry declared during a live interview with Fortune’s Michal Lev-Ram at the Most Powerful Women Summit in Laguna Niguel, Calif., on Tuesday. “How liberating is that?”  Before menopause, Berry was well known for her starring roles in the romantic comedy Boomerang and the biopic Introducing Dorothy Dandridge, which earned her an Emmy and Golden Globe award. She is also the first and only Black actress to win the Academy Award for Best Actress for her haunting role in Monster’s Ball in 2001. Fast forward to her doctor’s appointment and misdiagnosis, it was likely a relief to find out she was in the throes of menopause and not something more harmful to her health. But Berry realized the gravity of the issue: millions of women grapple to find productive information about their symptoms and potential treatments while they’re experiencing menopause. Not to mention, there’s a stigma surrounding the issue of actually explaining a hot flash, the sudden exhilarating rage common in menopause, or brain fog, lest it backfire and make a woman in her 50s or older appear less capable at work or home.  That realization sent Berry on a voyage not only to raise money in Silicon Valley to launch a community platform with her new midlife women’s wellness business, Respin, but also to rally the halls of Congress to support a bill aimed at directing $275 million for research on effective therapies and medicines. The bill, Advancing Menopause Care and Mid-Life Women’s Health Act, has support from a bipartisan coalition of women in the U.S. Senate, led by Sen. Patty Murray (D-Wash.) and Sen. Lisa Murkowski (R-Alaska).  It was at a press briefing in front of the Capitol Building that Berry first unleashed her “I have menopause, OK!” rallying cry last spring. She has since won the backing of 18 of 25 senators and her goal is to get all of them over the line to support the standalone funding bill. Some of the legislators she’s spoken with have opposed additional medical funding, rather than redirecting existing funding into menopausal research. Still, she’s determined to keep advancing the issue. And even in an election year, Berry said the matter of menopause is one that shouldn’t be politicized.  “This is a human rights issue,” said Berry. Women are worthy of doctors who won’t tell patients they have herpes when they don’t, she added.  “We deserve more.”Recommended newsletter The Broadsheet: Covers the trends and issues impacting women in and out of the workplace and the women transforming the future of business. Sign up here.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/10/54070407984_0087d63538_k.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-cy=\"article-content\"\u003e\u003cp\u003eA night of great intimacy was followed by a painful morning in which Academy Award-winning actress Halle Berry felt like she was being attacked by razor blades. She took a trip to the doctor, who told her she had “the worst case of herpes he had ever seen,” Berry recalled. \u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eTurns out, Berry, 54, was suffering the incredibly common symptoms of menopause after she had been in perimenopause—the transitional phase of a woman’s life that leads to the end of her cycle—for about 10 years and didn’t know it. \u003c/p\u003e\n\n\n\n\u003cp\u003e“I’m in menopause,” Berry declared during a live interview with \u003cem\u003eFortune\u003c/em\u003e’s Michal Lev-Ram at the Most Powerful Women Summit in Laguna Niguel, Calif., on Tuesday. “How liberating is that?” \u003c/p\u003e\n\n\n\n\u003cp\u003eBefore menopause, Berry was well known for her starring roles in the romantic comedy \u003cem\u003eBoomerang\u003c/em\u003e and the biopic \u003cem\u003eIntroducing Dorothy Dandridge\u003c/em\u003e, which earned her an Emmy and Golden Globe award. She is also the first and only Black actress to win the Academy Award for Best Actress for her haunting role in \u003cem\u003eMonster’s Ball \u003c/em\u003ein 2001. Fast forward to her doctor’s appointment and misdiagnosis, it was likely a relief to find out she was in the throes of menopause and not something more harmful to her health. But Berry realized the gravity of the issue: millions of women grapple to find productive information about their symptoms and potential treatments while they’re experiencing menopause. Not to mention, there’s a stigma surrounding the issue of actually explaining a hot flash, the sudden exhilarating rage common in menopause, or brain fog, lest it backfire and make a woman in her 50s or older appear less capable at work or home. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat realization sent Berry on a voyage not only to raise money in Silicon Valley to launch a community platform with her new midlife women’s wellness business, \u003ca href=\"https://re-spin.com/\" target=\"_blank\" aria-label=\"Go to https://re-spin.com/\" rel=\"noopener\"\u003eRespin\u003c/a\u003e, but also to rally the halls of Congress to support a bill aimed at directing $275 million for research on effective therapies and medicines. The bill, Advancing Menopause Care and Mid-Life Women’s Health Act, has support from a bipartisan coalition of women in the U.S. Senate, led by Sen. \u003ca href=\"https://thehill.com/people/patty-murray/\" target=\"_blank\" aria-label=\"Go to https://thehill.com/people/patty-murray/\" rel=\"noopener\"\u003ePatty Murray \u003c/a\u003e(D-Wash.) and Sen. \u003ca href=\"https://thehill.com/people/lisa-murkowski/\" target=\"_blank\" aria-label=\"Go to https://thehill.com/people/lisa-murkowski/\" rel=\"noopener\"\u003eLisa Murkowski \u003c/a\u003e(R-Alaska). \u003c/p\u003e\n\n\n\n\u003cp\u003eIt was at a press briefing in front of the Capitol Building that Berry \u003ca href=\"https://thehill.com/homenews/senate/4639579-halle-berry-makes-push-for-275m-menopause-research-bill/\" target=\"_blank\" aria-label=\"Go to https://thehill.com/homenews/senate/4639579-halle-berry-makes-push-for-275m-menopause-research-bill/\" rel=\"noopener\"\u003efirst unleashed\u003c/a\u003e her “I have menopause, OK!” rallying cry last spring. She has since won the backing of 18 of 25 senators and her goal is to get all of them over the line to support the standalone funding bill. Some of the legislators she’s spoken with have opposed additional medical funding, rather than redirecting existing funding into menopausal research. Still, she’s determined to keep advancing the issue. \u003c/p\u003e\n\n\n\n\u003cp\u003eAnd even in an election year, Berry said the matter of menopause is one that shouldn’t be politicized. \u003c/p\u003e\n\n\n\n\u003cp\u003e“This is a human rights issue,” said Berry. Women are worthy of doctors who won’t tell patients they have herpes when they don’t, she added. \u003c/p\u003e\n\n\n\n\u003cp\u003e“We deserve more.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-cy=\"subscriptionPlea\"\u003e\u003cp\u003e\u003cstrong\u003e\u003cu\u003eRecommended newsletter\u003c/u\u003e\u003c/strong\u003e\u003cbr/\u003e\n\u003cstrong\u003eThe Broadsheet:\u003c/strong\u003e Covers the trends and issues impacting women in and out of the workplace and the women transforming the future of business.\u003cbr/\u003e\n\u003ca href=\"https://fortune.com/newsletters/the-broadsheet?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=mostpowerfulwomen\" target=\"_self\" aria-label=\"Go to https://fortune.com/newsletters/the-broadsheet?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=mostpowerfulwomen\"\u003eSign up here.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
