{
  "id": "3e69b162-6526-43da-9a6e-1d5e52af8549",
  "title": "NEW FOUND FILES QUEENSWAY GOLD PROJECT NI 43-101 TECHNICAL REPORT",
  "link": "https://www.investing.com/news/press-releases/new-found-files-queensway-gold-project-ni-43101-technical-report-93CH-3726749",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-16 00:52:05",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 6766,
  "excerpt": "NEW FOUND FILES QUEENSWAY GOLD PROJECT NI 43-101 TECHNICAL REPORT",
  "siteName": "Investing.com",
  "favicon": "",
  "text": ", /PRNewswire/ - New Found Gold Corp. (\"New Found\" or the \"Company\") (TSXV: NFG) (NYSE-A: NFGC) is pleased to announce that the Company has filed a National Instrument 43-101 Standards of Disclosure for Mineral Projects (\"NI 43-101\") technical report for New Found's 100% owned Queensway Project, entitled \"NI 43-101 Technical Report, New Found Gold Corp.'s Queensway Gold Project in Newfoundland and Labrador, Canada: 2024 Property Expansion and Exploration Update\", with an effective date of November 1, 2024 (the \"Technical Report\"). The purpose of the Technical Report is to provide an update on the Queensway Project expanded land position, including the Company's acquisition of the Kingsway Property (as defined below), and new exploration activities. The Technical Report is available under the Company's SEDAR+ profile at www.sedarplus.ca. The Technical Report was prepared by D. Roy Eccles, M.Sc., P. Geol. P Geo. of APEX Geoscience Ltd., Mark K. Jorgensen, B.Sc., QP Metallurgy of Jorgensen Engineering and Technical Services, LLC and Gary Simmons, B.Sc., QP Metallurgy of GL Simmons Consulting, LLC, each a \"Qualified Person\" as defined under NI 43-101 and independent of New Found. The Technical Report provides an update on New Found's exploration activities at the Queensway Project since the Company's previous technical report, which had an effective date of April 18, 2024. Since that time, New Found has 1) acquired 100% interest in Labrador Gold Corp.'s Kingsway Project including four licences (311 claims) (the \"Kingsway Property\"), 2) acquired 100% interest in three licences (54 claims) from Sky Gold Corp., and 3) completed new diamond drilling at the Big Vein, Dome, Dropkick, Everest, Golden Dome, Golden Glove, Golden Joint, Green Mantle, Honey Pot, Iceberg, Iceberg Alley, Jackpot, Keats South and West, Knobby, Lotto North, Monte Carlo, Pistachio, Pristine, and Road gold prospects. Qualified Person The scientific and technical information disclosed in this press release was reviewed and approved by Greg Matheson, P. Geo., Chief Operating Officer, and a Qualified Person as defined under NI 43-101. Greg Matheson consents to the publication of this press release dated November 15, 2024, by New Found. Greg Matheson certifies that this press release fairly and accurately represents the scientific and technical information that forms the basis for this press release. About New Found Gold Corp. New Found holds a 100% interest in the Queensway Project, located 15km west of Gander, Newfoundland and Labrador, and just 18km from Gander International Airport. The project is intersected by the Trans-Canada Highway and has logging roads crosscutting the project, high voltage electric power lines running through the project area, and easy access to a highly skilled workforce. The Company is currently undertaking a 650,000m drill program at Queensway and is well funded for this program with cash and marketable securities of approximately $35 million as of November 2024. Please see the Company's website at www.newfoundgold.ca and the Company's SEDAR+ profile at www.sedarplus.ca. Contact To contact the Company, please visit the Company's website, www.newfoundgold.ca and make your request through our investor inquiry form. Our management has a pledge to be in touch with any investor inquiries within 24 hours.New Found Gold Corp.Per: \"Collin Kettell\"Collin Kettell, Chief Executive OfficerEmail: ckettell@newfoundgold.caPhone: +1 (845) 535-1486 Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Statement Cautions This press release contains certain \"forward-looking statements\" within the meaning of Canadian and U.S. securities legislation (including the Private Securities Litigation Reform Act of 1995), relating to exploration, drilling and mineralization on the Company's Queensway Gold Project in Newfoundland and Labrador for the future; and the merits of the Queensway Project. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"interpreted\", \"intends\", \"estimates\", \"projects\", \"aims\", \"suggests\", \"often\", \"target\", \"future\", \"likely\", \"pending\", \"potential\", \"goal\", \"objective\", \"prospective\", \"possibly\", \"preliminary\", and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can\", \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made, and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the TSX Venture Exchange or the NYSE American, the Company undertakes no obligation to update these forward-looking statements if management's beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include risks associated with possible accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, risks associated with the interpretation of assay results and the drilling program, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company's exploration plans, the volatility of capital markets, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company's business and prospects. The reader is urged to refer to the Company's Annual Information Form and Management's Discussion and Analysis, publicly available through the Canadian Securities Administrators' System for Electronic Document Analysis and Retrieval (SEDAR+) at www.sedarplus.ca or through the SEC's Electronic Data Gathering and Retrieval System (EDGAR) at www.sec.gov for a more complete discussion of such risk factors and their potential effects.",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e,  /PRNewswire/ -\u003cb\u003e \u003cspan idsrc=\"xmltag.org\" value=\"TorontoVE:NFG\"\u003eNew Found Gold Corp.\u003c/span\u003e\u003c/b\u003e (\u0026#34;\u003cb\u003eNew Found\u003c/b\u003e\u0026#34; or the \u0026#34;\u003cb\u003eCompany\u003c/b\u003e\u0026#34;) (TSXV: NFG) (NYSE-A: NFGC) is pleased to announce that the Company has filed a National Instrument 43-101 \u003ci\u003eStandards of Disclosure for Mineral Projects \u003c/i\u003e(\u0026#34;\u003cb\u003eNI 43-101\u003c/b\u003e\u0026#34;) technical report for New Found\u0026#39;s 100% owned \u003cspan\u003eQueensway Project\u003c/span\u003e, entitled \u0026#34;NI 43-101 Technical Report, \u003cspan idsrc=\"xmltag.org\" value=\"TorontoVE:NFG\"\u003eNew Found Gold Corp.\u003c/span\u003e\u0026#39;s \u003cspan\u003eQueensway Gold Project\u003c/span\u003e in \u003clocation idsrc=\"xmltag.org\" value=\"LS/ca.nl\"\u003eNewfoundland\u003c/location\u003e and \u003clocation idsrc=\"xmltag.org\" value=\"LU/ca.nl.labrdr\"\u003eLabrador, Canada\u003c/location\u003e: 2024 Property Expansion and Exploration Update\u0026#34;, with an effective date of \u003cchron\u003eNovember 1, 2024\u003c/chron\u003e (the \u0026#34;\u003cb\u003eTechnical Report\u003c/b\u003e\u0026#34;). The purpose of the Technical Report is to provide an update on the \u003cspan\u003eQueensway Project\u003c/span\u003e expanded land position, including the Company\u0026#39;s acquisition of the Kingsway Property (as defined below), and new exploration activities. The Technical Report is available under the Company\u0026#39;s SEDAR+ profile at www.sedarplus.ca.\u003c/p\u003e \u003cp\u003eThe Technical Report was prepared by \u003cperson\u003eD. Roy Eccles\u003c/person\u003e, \u003cperson\u003eM.Sc\u003c/person\u003e., P. Geol. P Geo. of \u003cspan\u003eAPEX Geoscience Ltd.\u003c/span\u003e, \u003cperson\u003eMark K. Jorgensen\u003c/person\u003e, \u003cperson\u003eB.Sc\u003c/person\u003e., QP Metallurgy of \u003cspan idsrc=\"xmltag.org\" value=\"ACORN:2342525809\"\u003eJorgensen Engineering\u003c/span\u003e and \u003cspan\u003eTechnical Services, LLC\u003c/span\u003e and \u003cperson\u003eGary Simmons\u003c/person\u003e, \u003cperson\u003eB.Sc\u003c/person\u003e., QP Metallurgy of \u003cspan\u003eGL Simmons Consulting, LLC\u003c/span\u003e, each a \u0026#34;Qualified Person\u0026#34; as defined under NI 43-101 and independent of New Found.\u003c/p\u003e\n\u003cp\u003eThe Technical Report provides an update on New Found\u0026#39;s exploration activities at the \u003cspan\u003eQueensway Project\u003c/span\u003e since the Company\u0026#39;s previous technical report, which had an effective date of \u003cchron\u003eApril 18, 2024\u003c/chron\u003e. Since that time, New Found has 1) acquired 100% interest in Labrador Gold Corp.\u0026#39;s \u003cspan\u003eKingsway Project\u003c/span\u003e including four licences (311 claims) (the \u0026#34;\u003cb\u003eKingsway Property\u003c/b\u003e\u0026#34;), 2) acquired 100% interest in three licences (54 claims) from Sky Gold Corp., and 3) completed new diamond drilling at the Big Vein, Dome, Dropkick, Everest, \u003cperson\u003eGolden Dome\u003c/person\u003e, Golden Glove, Golden Joint, Green Mantle, Honey Pot, Iceberg, \u003clocation\u003eIceberg Alley\u003c/location\u003e, Jackpot, Keats South and West, Knobby, Lotto North, \u003clocation idsrc=\"xmltag.org\" value=\"LU/mc..mntcrl\"\u003eMonte Carlo\u003c/location\u003e, Pistachio, Pristine, and Road gold prospects.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eQualified Person\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eThe scientific and technical information disclosed in this press release was reviewed and approved by \u003cperson\u003eGreg Matheson\u003c/person\u003e, \u003cperson\u003eP. Geo\u003c/person\u003e., Chief Operating Officer, and a Qualified Person as defined under NI 43-101. \u003cperson\u003eGreg Matheson\u003c/person\u003e consents to the publication of this press release dated \u003cchron\u003eNovember 15, 2024\u003c/chron\u003e, by New Found. \u003cperson\u003eGreg Matheson\u003c/person\u003e certifies that this press release fairly and accurately represents the scientific and technical information that forms the basis for this press release.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eAbout \u003cspan idsrc=\"xmltag.org\" value=\"TorontoVE:NFG\"\u003eNew Found Gold Corp.\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eNew Found holds a 100% interest in the \u003cspan\u003eQueensway Project\u003c/span\u003e, located 15km west of \u003clocation idsrc=\"xmltag.org\" value=\"LU/ca.nl.gander\"\u003eGander, Newfoundland\u003c/location\u003e and \u003clocation idsrc=\"xmltag.org\" value=\"LU/ca.nl.labrdr\"\u003eLabrador\u003c/location\u003e, and just 18km from \u003clocation\u003eGander International Airport\u003c/location\u003e. The project is intersected by the \u003clocation\u003eTrans-Canada Highway\u003c/location\u003e and has logging roads crosscutting the project, high voltage electric power lines running through the project area, and easy access to a highly skilled workforce. The Company is currently undertaking a 650,000m drill program at Queensway and is well funded for this program with cash and marketable securities of approximately $35  million as of \u003cchron\u003eNovember 2024\u003c/chron\u003e.\u003c/p\u003e\n\u003cp\u003ePlease see the Company\u0026#39;s website at www.newfoundgold.ca and the Company\u0026#39;s SEDAR+ profile at www.sedarplus.ca.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eContact\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eTo contact the Company, please visit the Company\u0026#39;s website, www.newfoundgold.ca and make your request through our investor inquiry form. Our management has a pledge to be in touch with any investor inquiries within 24 hours.\u003cbr/\u003e\u003cspan idsrc=\"xmltag.org\" value=\"TorontoVE:NFG\"\u003eNew Found Gold Corp.\u003c/span\u003e\u003cbr/\u003ePer: \u0026#34;Collin Kettell\u0026#34;\u003cbr/\u003e\u003cperson\u003eCollin Kettell\u003c/person\u003e, Chief Executive Officer\u003cbr/\u003eEmail: ckettell@newfoundgold.ca\u003cbr/\u003ePhone: +1 (845) 535-1486\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eNeither the \u003cspan idsrc=\"xmltag.org\" value=\"ACORN:3607821560\"\u003eTSX Venture Exchange\u003c/span\u003e nor its Regulation Services Provider (as that term is defined in the policies of the \u003cspan idsrc=\"xmltag.org\" value=\"ACORN:3607821560\"\u003eTSX Venture Exchange\u003c/span\u003e) accepts responsibility for the adequacy or accuracy of this release.\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eForward-Looking Statement Cautions\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eThis press release contains certain \u0026#34;forward-looking statements\u0026#34; within the meaning of Canadian and \u003clocation idsrc=\"xmltag.org\" value=\"LC/us\"\u003eU.S.\u003c/location\u003e securities legislation (including the Private Securities Litigation Reform Act of 1995), relating to exploration, drilling and mineralization on the Company\u0026#39;s \u003cspan\u003eQueensway Gold Project\u003c/span\u003e in \u003clocation idsrc=\"xmltag.org\" value=\"LS/ca.nl\"\u003eNewfoundland\u003c/location\u003e and \u003clocation idsrc=\"xmltag.org\" value=\"LU/ca.nl.labrdr\"\u003eLabrador\u003c/location\u003e for the future; and the merits of the \u003cspan\u003eQueensway Project\u003c/span\u003e. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \u0026#34;expects\u0026#34;, \u0026#34;plans\u0026#34;, \u0026#34;anticipates\u0026#34;, \u0026#34;believes\u0026#34;, \u0026#34;interpreted\u0026#34;, \u0026#34;intends\u0026#34;, \u0026#34;estimates\u0026#34;, \u0026#34;projects\u0026#34;, \u0026#34;aims\u0026#34;, \u0026#34;suggests\u0026#34;, \u0026#34;often\u0026#34;, \u0026#34;target\u0026#34;, \u0026#34;future\u0026#34;, \u0026#34;likely\u0026#34;, \u0026#34;pending\u0026#34;, \u0026#34;potential\u0026#34;, \u0026#34;goal\u0026#34;, \u0026#34;objective\u0026#34;, \u0026#34;prospective\u0026#34;, \u0026#34;possibly\u0026#34;, \u0026#34;preliminary\u0026#34;, and similar expressions, or that events or conditions \u0026#34;will\u0026#34;, \u0026#34;would\u0026#34;, \u0026#34;may\u0026#34;, \u0026#34;can\u0026#34;, \u0026#34;could\u0026#34; or \u0026#34;should\u0026#34; occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company\u0026#39;s management on the date the statements are made, and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the \u003cspan idsrc=\"xmltag.org\" value=\"ACORN:3607821560\"\u003eTSX Venture Exchange\u003c/span\u003e or the NYSE American, the Company undertakes no obligation to update these forward-looking statements if management\u0026#39;s beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include risks associated with possible accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, risks associated with the interpretation of assay results and the drilling program, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company\u0026#39;s exploration plans, the volatility of capital markets, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company\u0026#39;s business and prospects. The reader is urged to refer to the Company\u0026#39;s Annual Information Form and Management\u0026#39;s Discussion and Analysis, publicly available through the Canadian Securities Administrators\u0026#39; System for Electronic Document Analysis and Retrieval (SEDAR+) at www.sedarplus.ca or through the \u003cspan\u003eSEC\u003c/span\u003e\u0026#39;s Electronic Data Gathering and Retrieval System (EDGAR) at \u003ca href=\"https://c212.net/c/link/?t=0\u0026amp;l=en\u0026amp;o=4304855-1\u0026amp;h=1105187640\u0026amp;u=http%3A%2F%2Fwww.sec.gov%2F\u0026amp;a=www.sec.gov\" rel=\"nofollow\" target=\"_blank\"\u003ewww.sec.gov\u003c/a\u003e for a more complete discussion of such risk factors and their potential effects.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-16T00:52:05Z",
  "modifiedTime": null
}
