{
  "id": "4ae8516b-9abc-498f-b6fc-3a3ce3650871",
  "title": "Cities are still trying to figure things out post-pandemic—and that’s providing an opportunity for design firms like Gensler",
  "link": "https://fortune.com/2024/12/04/gensler-design-forecast-trends-mixed-use-districts-return-to-office-housing-affordability/",
  "description": "Mixed-use neighborhoods, 20-minute cities, and an office you might actually want to work in—these are Gensler's 2025 predictions for design in 2025.",
  "author": "Nicholas Gordon",
  "published": "Thu, 05 Dec 2024 01:05:00 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Conferences"
  ],
  "byline": "Nicholas Gordon",
  "length": 8290,
  "excerpt": "Mixed-use neighborhoods, 20-minute cities, and an office you might actually want to work in—these are Gensler's 2025 predictions for design in 2025.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "One of the world’s largest architecture firm says it feels a sense of “optimism and engagement” heading into 2025, driven by cooling inflation, coming rate cuts, and a growing drive among developers to start investing money again.  On Thursday, U.S.-based Gensler unveiled its “Design Forecast”, which names the trends that it expects to shape design in the coming year. These trends include a focus on how design needs to adapt to changes in city life—the continued shift to work-from-home, the resulting hit to downtowns and shopping districts, and increasingly unaffordable housing. “Our cities are convenors,” said Jordan Goldstein, Gensler’s co-CEO, in an interview with Fortune in mid-November. “That’s where we see the power of design to really shape that experience for the better.” The COVID pandemic sparked a shift in urban life that can still be seen. Despite company appeals to return to the office five days a week, hybrid work appears to have settled into urban professional life, reducing the need for office space and, in turn, reducing foot traffic through urban downtown areas. That, along with higher interest rates, has contributed to a massive global downturn in the commercial real estate market, as office and retail tenants downsize their physical presence. “The issues we were seeing post-pandemic are driving a lot of [these design trends],” said Goldstein. Then add what he calls “crisis multipliers”—like technological change and sustainability, to name a few.  But he notes that planners are now far more willing to consider experimental redevelopments in the urban core. “There’s an opportunity to have these dialogues [with planners] that frankly didn’t necessarily happen on a regular basis, pre-pandemic,” he said. And in some markets, like India, these discussions “weren’t happening, period.” In one example, Gensler is working with the Philadelphia city government to turn South Broad Street into a 10-block-long arts park, with greenery, outdoor entertainment spaces, and public artwork. The firm is pursuing a similar project in Chicago’s Michigan Avenue, building new green spaces, performance venues, and a new cafe in Jane Byrne Park’s water tower. “Most of our cities know they can’t just thrive in the future doing things the way they’ve done them. Bringing design into the mix really pushes forward innovation [and] experimentation,” said Gensler co-CEO Elizabeth Brink in mid-November. Unique and unpredictable In its “Design Forecast,” Gensler identifies five trends that it calls “the most important and actionable insights our clients need to know,” drawn from its dozens of offices around the world. “We reach out to all our locations and ask: What are you seeing? What are you seeing as a need in your location?” Brink said in mid-November. Several trends relate to a need to rethink the city post-COVID, as districts shift away from the more traditional mix of separate office neighborhoods, suburbs, and shopping and entertainment districts that mark most modern cities.  For example, Gensler predicts that mixed-use districts will take “center stage in 2025,” as cities look to “drive community engagement and bring people together around visceral shared experiences.” Both Brink and Goldstein referred to the idea of the “20-minute city”, or an urban environment where people can access home, work, and entertainment in just a 20-minute trip. But beyond that, Brink suggested that there’s a desire to create a “more immersive and participatory kind of experience,” and cited sports as an example. “People want to go have experiences that are unique and unpredictable. They’re doing this together, and it’s something that’s creating a sense of community,” she explained. How to fix the office Another major design trend Gensler highlights is the need to revamp the workplace. Rather than ordering people back to the office, employers will instead need to make it a valuable place to do work. Offices will be all about “employee experience” and “inspiration”, the firm predicts, as tenants continue a “flight to quality” that meets their employees’ “professional aspirations.” “We know that the workplace is still really important,” Brink said in mid-November. “It’s really important for organizations. It’s really important for creativity. It’s really important for connection, it’s really important for the human experience,” she explained.  Gensler’s global workplace survey, released in May, reports that almost all workers in a high-performing office have access to a space for focused concentration, compared to just 26% in low-performing workplaces. Some companies have successfully revived in-person attendance after moving to a nicer office. U.K. bank HSBC doubled the rate at which New York-based employees came into the office after moving to the Spiral, designed by Danish architect Bjarke Ingels. Still, the commercial real estate slump triggered by hybrid work isn’t going away.  Gensler predicts that depressed prices offer developers an opportunity to create “valuable new real estate.” Interest rate cuts might also encourage developers to take the plunge and convert their unused office space into something more in demand. The architecture firm says that the “adaptive reuse boom” will go beyond just a straight office-to-apartment transition, as developers instead embrace “creative conversions” including sectors like healthcare, science labs, and senior living, among other sectors. But Brink noted the transition from office to home is easier said than done. Offices don’t afford themselves to the traditional apartment layout, due to the need to add plumbing infrastructure and kitchen areas. She suggests that a co-living model, with smaller units and shared bathrooms and kitchens, will be an easier convection for developers. Constructions costs could be reduced by a third, with three times as many units provided by the conversion. “It’s a creative way of looking at some of those conversations that could be great for different urban populations: Students, retirees, good for anyone that might just need a place,” she suggested.  Converting underused office buildings to residential complexes may help with another one of Gensler’s 2025 design trends: a push towards “attainable market-rate housing,” as changes to zoning laws and building codes encourage the creation of all types of homes.  One plus one equals three’ Gensler, founded in 1965 by architect Art Gensler, has over 6,000 designers spread out across 17 countries, in the Americas, Europe, Asia and the Middle East. Among Gensler’s many projects are the Santa Clara, Calif. headquarters of Nvidia, the still-under-construction Terminal One at New York’s John F. Kennedy International Airport, and the Shanghai Tower, the world’s third-tallest building. The firm reported $1.84 billion in revenue for its 2023 fiscal year.  Brink and Goldstein took over as Gensler’s co-CEOs in April. Their predecessors, Diane Hoskins and Andy Cohen, jointly led the architecture firm for almost 20 years.  Courtesy of Gensler Gensler is an uncommon example of a firm that’s embraced the co-CEO model. Other companies have tried to have two chief executives with mixed success: Salesforce and SAP both saw one of their two co-CEOs step down within a year. (On Monday, chipmaker Intel adopted the co-CEO model, elevating David Zinsner and Michelle Johnston Holthaus to serve as interim co-CEOs, replacing retiring CEO Pat Gelsinger.) Yet successful co-CEOs say the structure allows executives to rely on each other for support, provides a check on a particular leader’s biases, or just allows the C-suite to do more each day. “Most CEOs have 24 hours a day, we have 48 hours a day,” Hoskins said on Fortune’s Leadership Next podcast last year. “The two of us can work together and be a ‘one plus one equals three’ scenario,” Goldstein said. “We each have some particular passions, and we put those together, and it really resonates around the company.”How many degrees of separation are you from the globe's most powerful business leaders? Explore who made our brand-new list of the 100 Most Powerful People in Business. Plus, learn about the metrics we used to make it.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/12/HIR_Harborplace_20231101_10_hip-e1733320120725.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eOne of the world’s largest architecture firm says it feels a sense of “optimism and engagement” heading into 2025, driven by cooling inflation, coming rate cuts, and a growing drive among developers to start investing money again. \u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eOn Thursday, U.S.-based Gensler unveiled its “Design Forecast”, which names the trends that it expects to shape design in the coming year. These trends include a focus on how design needs to adapt to changes in city life—the continued shift to work-from-home, the resulting hit to downtowns and shopping districts, and increasingly unaffordable housing.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Our cities are convenors,” said Jordan Goldstein, Gensler’s co-CEO, in an interview with \u003cem\u003eFortune \u003c/em\u003ein mid-November. “That’s where we see the power of design to really shape that experience for the better.”\u003c/p\u003e\n\n\n\n\u003cp\u003eThe COVID pandemic sparked a shift in urban life that can still be seen. Despite company appeals to \u003ca href=\"https://fortune.com/well/article/workplace-well-being-covid-return-to-office-hybrid-remote/\" target=\"_self\" aria-label=\"Go to https://fortune.com/well/article/workplace-well-being-covid-return-to-office-hybrid-remote/\"\u003ereturn to the office\u003c/a\u003e five days a week, \u003ca href=\"https://fortune.com/2024/10/30/work-from-home-rto-debate-better-stock-returns/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/10/30/work-from-home-rto-debate-better-stock-returns/\"\u003ehybrid work\u003c/a\u003e appears to have settled into urban professional life, reducing the need for office space and, in turn, reducing foot traffic through \u003ca href=\"https://fortune.com/2023/09/25/downtowns-dead-dying-life-support-commercial-real-estate-office-buildings/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2023/09/25/downtowns-dead-dying-life-support-commercial-real-estate-office-buildings/\"\u003eurban downtown areas\u003c/a\u003e. That, along with higher interest rates, has contributed to a massive global downturn in the \u003ca href=\"https://fortune.com/2024/11/15/return-to-office-loan-delinquencies-commercial-real-estate-crisis/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/11/15/return-to-office-loan-delinquencies-commercial-real-estate-crisis/\"\u003ecommercial real estate market\u003c/a\u003e, as office and retail tenants downsize their physical presence.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The issues we were seeing post-pandemic are driving a lot of [these design trends],” said Goldstein. Then add what he calls “crisis multipliers”—like technological change and sustainability, to name a few. \u003c/p\u003e\n\n\n\n\u003cp\u003eBut he notes that planners are now far more willing to consider experimental redevelopments in the urban core. “There’s an opportunity to have these dialogues [with planners] that frankly didn’t necessarily happen on a regular basis, pre-pandemic,” he said. And in some markets, like India, these discussions “weren’t happening, period.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn one example, Gensler is working with the Philadelphia city government to turn \u003ca href=\"https://whyy.org/articles/philadelphia-avenue-arts-pedestrian-improvements-south-broad-street/\" target=\"_blank\" aria-label=\"Go to https://whyy.org/articles/philadelphia-avenue-arts-pedestrian-improvements-south-broad-street/\" rel=\"noopener\"\u003eSouth Broad Street\u003c/a\u003e into a 10-block-long arts park, with greenery, outdoor entertainment spaces, and public artwork. The firm is pursuing a similar project in Chicago’s\u003ca href=\"https://www.archpaper.com/2024/07/gensler-transformation-chicago-north-michigan-avenue/\" target=\"_blank\" aria-label=\"Go to https://www.archpaper.com/2024/07/gensler-transformation-chicago-north-michigan-avenue/\" rel=\"noopener\"\u003e Michigan Avenue\u003c/a\u003e, building new green spaces, performance venues, and a new cafe in Jane Byrne Park’s water tower.\u003c/p\u003e\n\n\n\n\u003cp\u003e“Most of our cities know they can’t just thrive in the future doing things the way they’ve done them. Bringing design into the mix really pushes forward innovation [and] experimentation,” said Gensler co-CEO Elizabeth Brink in mid-November.\u003c/p\u003e\n\n\n\n\u003ch2\u003eUnique and unpredictable\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn its “Design Forecast,” Gensler identifies five trends that it calls “the most important and actionable insights our clients need to know,” drawn from its dozens of offices around the world.\u003c/p\u003e\n\n\n\n\u003cp\u003e“We reach out to all our locations and ask: What are you seeing? What are you seeing as a need in your location?” Brink said in mid-November.\u003c/p\u003e\n\n\n\n\u003cp\u003eSeveral trends relate to a need to rethink the city post-COVID, as districts shift away from the more traditional mix of separate office neighborhoods, suburbs, and shopping and entertainment districts that mark most modern cities. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, Gensler predicts that mixed-use districts will take “center stage in 2025,” as cities look to “drive community engagement and bring people together around visceral shared experiences.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBoth Brink and Goldstein referred to the idea of the “20-minute city”, or an urban environment where people can access home, work, and entertainment in just a 20-minute trip.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut beyond that, Brink suggested that there’s a desire to create a “more immersive and participatory kind of experience,” and cited sports as an example. “People want to go have experiences that are unique and unpredictable. They’re doing this together, and it’s something that’s creating a sense of community,” she explained.\u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eHow to fix the office\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eAnother major design trend Gensler highlights is the need to revamp the workplace. Rather than ordering people back to the office, employers will instead need to make it a valuable place to do work. Offices will be all about “employee experience” and “inspiration”, the firm predicts, as tenants continue a “flight to quality” that meets their employees’ “professional aspirations.”\u003c/p\u003e\n\n\n\n\u003cp\u003e“We know that the workplace is still really important,” Brink said in mid-November. “It’s really important for organizations. It’s really important for creativity. It’s really important for connection, it’s really important for the human experience,” she explained. \u003c/p\u003e\n\n\n\n\u003cp\u003eGensler’s global workplace survey, released in May, reports that almost all workers in a high-performing office have access to a space for focused concentration, compared to just 26% in low-performing workplaces.\u003c/p\u003e\n\n\n\n\u003cp\u003eSome companies have successfully revived in-person attendance after moving to a nicer office. U.K. bank HSBC \u003ca href=\"https://www.bloomberg.com/news/articles/2024-05-23/hsbc-s-americas-chief-says-he-won-t-compel-5-days-in-the-office\" target=\"_blank\" aria-label=\"Go to https://www.bloomberg.com/news/articles/2024-05-23/hsbc-s-americas-chief-says-he-won-t-compel-5-days-in-the-office\" rel=\"noopener\"\u003edoubled the rate\u003c/a\u003e at which New York-based employees came into the office after moving to the Spiral, designed by Danish architect Bjarke Ingels.\u003c/p\u003e\n\n\n\n\u003cp\u003eStill, the commercial real estate slump triggered by hybrid work isn’t going away.  Gensler predicts that depressed prices offer developers an opportunity to create “valuable new real estate.” Interest rate cuts might also encourage developers to take the plunge and convert their unused office space into something more in demand. The architecture firm says that the “adaptive reuse boom” will go beyond just a straight office-to-apartment transition, as developers instead embrace “creative conversions” including sectors like healthcare, science labs, and senior living, among other sectors.\u003c/p\u003e\n\n\n\n\u003cp\u003eBut Brink noted the transition from office to home is easier said than done. Offices don’t afford themselves to the traditional apartment layout, due to the need to add plumbing infrastructure and kitchen areas.\u003c/p\u003e\n\n\n\n\u003cp\u003eShe suggests that a co-living model, with smaller units and shared bathrooms and kitchens, will be an easier convection for developers. Constructions costs could be reduced by a third, with three times as many units provided by the conversion.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s a creative way of looking at some of those conversations that could be great for different urban populations: Students, retirees, good for anyone that might just need a place,” she suggested. \u003c/p\u003e\n\n\n\n\u003cp\u003eConverting underused office buildings to residential complexes may help with another one of Gensler’s 2025 design trends: a push towards “attainable market-rate housing,” as changes to zoning laws and building codes encourage the creation of all types of homes. \u003c/p\u003e\n\n\n\n\u003ch2\u003e\u003cstrong\u003eOne plus one equals three’\u003c/strong\u003e\u003c/h2\u003e\n\n\n\n\u003cp\u003eGensler, founded in 1965 by architect Art Gensler, has over 6,000 designers spread out across 17 countries, in the Americas, Europe, Asia and the Middle East. Among Gensler’s many projects are the \u003ca href=\"https://www.gensler.com/projects/nvidia\" target=\"_blank\" aria-label=\"Go to https://www.gensler.com/projects/nvidia\" rel=\"noopener\"\u003eSanta Clara, Calif. headquarters\u003c/a\u003e of \u003ca href=\"https://fortune.com/company/nvidia/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/nvidia/\"\u003eNvidia\u003c/a\u003e, the \u003ca href=\"https://www.gensler.com/projects/new-terminal-one-at-jfk-international-airport\" target=\"_blank\" aria-label=\"Go to https://www.gensler.com/projects/new-terminal-one-at-jfk-international-airport\" rel=\"noopener\"\u003estill-under-construction Terminal One\u003c/a\u003e at New York’s John F. Kennedy International Airport, and \u003ca href=\"https://www.gensler.com/projects/shanghai-tower\" target=\"_blank\" aria-label=\"Go to https://www.gensler.com/projects/shanghai-tower\" rel=\"noopener\"\u003ethe Shanghai Tower\u003c/a\u003e, the world’s third-tallest building. The firm reported \u003ca href=\"https://www.gensler.com/doc/gensler-fact-sheet.pdf\" target=\"_blank\" aria-label=\"Go to https://www.gensler.com/doc/gensler-fact-sheet.pdf\" rel=\"noopener\"\u003e$1.84 billion in revenue\u003c/a\u003e for its 2023 fiscal year. \u003c/p\u003e\n\n\n\n\u003cp\u003eBrink and Goldstein took over as Gensler’s co-CEOs in April. Their predecessors, Diane Hoskins and Andy Cohen, jointly led the architecture firm for almost 20 years. \u003c/p\u003e\n\n\n\u003cdiv\u003e\u003cp\u003e\u003cimg alt=\"\" loading=\"lazy\" width=\"1024\" height=\"683\" decoding=\"async\" data-nimg=\"1\" sizes=\"100vw\" srcset=\"https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=320\u0026amp;q=75 320w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=384\u0026amp;q=75 384w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=480\u0026amp;q=75 480w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=576\u0026amp;q=75 576w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=768\u0026amp;q=75 768w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=1024\u0026amp;q=75 1024w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=1280\u0026amp;q=75 1280w, https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=1440\u0026amp;q=75 1440w\" src=\"https://fortune.com/img-assets/wp-content/uploads/2024/12/HIPFW_Gensler_Board-of-Directors_2024_Gensler_Co-CEOs_72_ret_v1_FINAL_231007.jpg?w=1440\u0026amp;q=75\"/\u003e\u003c/p\u003e\u003cp\u003eCourtesy of Gensler\u003c/p\u003e\u003c/div\u003e\n\n\n\n\u003cp\u003eGensler is an uncommon example of a firm that’s embraced the co-CEO model. Other companies have tried to have two chief executives \u003ca href=\"https://fortune.com/2020/02/17/co-ceos-model-companies/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2020/02/17/co-ceos-model-companies/\"\u003ewith mixed success\u003c/a\u003e: \u003ca href=\"https://fortune.com/company/salesforce-com/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/salesforce-com/\"\u003eSalesforce\u003c/a\u003e and \u003ca href=\"https://fortune.com/company/sap/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/sap/\"\u003eSAP\u003c/a\u003e both saw one of their two co-CEOs step down within a year. (On Monday, chipmaker \u003ca href=\"https://fortune.com/company/intel/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/intel/\"\u003eIntel\u003c/a\u003e adopted the co-CEO model, elevating David Zinsner and Michelle Johnston Holthaus to serve as\u003ca href=\"https://fortune.com/2024/12/03/intels-cfo-has-a-tough-new-job-serve-as-interim-co-ceo-to-keep-its-finances-from-further-deteriorating/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/12/03/intels-cfo-has-a-tough-new-job-serve-as-interim-co-ceo-to-keep-its-finances-from-further-deteriorating/\"\u003e interim co-CEOs\u003c/a\u003e, replacing retiring CEO Pat Gelsinger.)\u003c/p\u003e\n\n\n\n\u003cp\u003eYet successful co-CEOs say the structure allows executives to rely on each other for support, provides a check on a particular leader’s biases, or just allows the C-suite to do more each day. “Most CEOs have 24 hours a day, we have 48 hours a day,” Hoskins said on \u003cem\u003eFortune\u003c/em\u003e’s\u003ca href=\"https://fortune.com/2023/09/15/gensler-design-co-ceos-office-space-return-to-work-commerical-real-estate-book-interview/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2023/09/15/gensler-design-co-ceos-office-space-return-to-work-commerical-real-estate-book-interview/\"\u003e Leadership Next podcast\u003c/a\u003e last year.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The two of us can work together and be a ‘one plus one equals three’ scenario,” Goldstein said. “We each have some particular passions, and we put those together, and it really resonates around the company.”\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cb\u003eHow many degrees of separation are you from the globe\u0026#39;s most powerful business leaders? \u003c/b\u003eExplore who made our brand-new list of the \u003ca href=\"https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/most-powerful-people/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\"\u003e100 Most Powerful People in Business\u003c/a\u003e. Plus, learn about the metrics we used to make it.\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": null,
  "modifiedTime": null
}
