{
  "id": "4cfd3cf4-91dc-4144-bc9e-788be349227c",
  "title": "#1050 How a former lawyer built a multi-million dollar company that teaches social skills – with Jordan Harbinger",
  "link": "https://mixergy.com/interviews/jordan-harbinger-the-art-of-charm-interview/",
  "description": "How does a former lawyer build a multi-million dollar company that teaches social skills. Jordan Harbinger is the co-founder of The Art of Charm, a company that teaches confidence and emotional intelligence. Jordan Harbinger is the co-founder of The Art of Charm, a company that teaches confidence and emotional intelligence, and the host of The Jordan Harbinger Show, which interviews top performers, from legendary musicians to intelligence operatives.   Sponsored byLead Pages – Lead Pages took my most successful page and turned it into a product that you can use—which magically converts strangers into leads. So if you want to use the page that I use to collect email addresses, check out AndrewsWelcomeGate.com. It will work on your site no matter what your site is built on. Even if you have no site, you can use this URL to collect email addresses for your business. It’s AndrewsWelcomeGate.com. More interviews -\u003e https://mixergy.com/moreint Rate this interview -\u003e https://mixergy.com/rateint",
  "author": "Andrew Warner",
  "published": "Wed, 13 Aug 2014 13:00:43 +0000",
  "source": "https://feeds.feedburner.com/Mixergy-main-podcast",
  "categories": [
    "startups",
    "ambition",
    "mix",
    "energy",
    "synergy",
    "mixology",
    "entrepreneur",
    "business",
    "tips",
    "motivation"
  ],
  "byline": "",
  "length": 80641,
  "excerpt": "Jordan Harbinger is the co-founder of The Art of Charm, a company that teaches confidence and emotional intelligence.",
  "siteName": "Business Podcast for Startups",
  "favicon": "https://mixergy.com/wp-content/themes/mixergy-2015-v2/assets/img/icons/apple-touch-icon-180x180.png",
  "text": "Andrew: Hey there, freedom fighters. My name is Andrew Warner. I am the founder of Mixergy.com. I got my very serious face on because business I take this very, very seriously. I really want to do these interviews so that you and I can learn from entrepreneurs about how they built their businesses. More importantly, take back the best ideas we can and help grow our own businesses. And when you do that, my hope for you, my hope for the mission here at Mixergy is that you will return and do an interview here on Mixergy and teach others what you learned along the way. The circle of Mixergy. I’ve said it for years, and now many of the thousand interviewees that I’ve had here on Mixergy have done just that. Successful companies they’ve built, and then they come back here and do an interview about it. And today we’re going to find out how a lawyer built a multi-million dollar company that teaches social skills. Jordan Harbinger is the co-founder of The Art of Charm, a company that teaches confidence and emotional intelligence. This interview is sponsored by LeadPages. Later on I’ll tell you a special URL where you can go if you want a great page that will help get more of your traffic to convert into email subscribers. Pay attention for that later. First, I’ve got to welcome Jordan. Jordan, good to have you here. Jordan: Thanks for having me. It’s funny you should mention LeadPages. We have LeadPages. Andrew: I know. I feel like all of us use LeadPages. Jordan: Yeah. Well, I spotted it, and I was like “Is this real? This looks amazing.” And so I started using it, and our traffic, you know, our squeeze or whatever you want to call it, email marketing is not my department, obviously, at ASU, went through the freaking roof, man. Andrew: Because Clay Collins, the guy who created the company, is obsessed with conversion rates. Jordan: Yeah. Andrew: I see what they do to tweak things. I see how they allow you to plug in someone’s email address before they even put it into the site. I see how they put a button to increase conversion rates, and they play with the colors and all that. Anyway, I should tell people if you want my page, the one that works especially well for me, the one that does more than 20% conversion rate, here’s the URL to go to. AndrewsWelcomeGate.com, AndrewsWalcomeGate.com. Jordan, you were here for Scotch, right? Jordan: Yes, I was, and now I’m here for Scotch. Andrew: Oh, you are having a Scotch while we are having this conversation! Super! Jordan: It’s 5:00 p.m. Central Standard Time, or something, somewhere. Anyway… Andrew: Wait, you’re not in Pacific Coast time anymore? Jordan: I am, but it’s only 4:00 here so that would be shameful. Andrew: Gotcha, so you are looking for the excuse. Jordan: Yeah. Andrew: But you came here to Mixergy HQ. We were here with a couple guys, and we were having conversation that was really open. I won’t even talk about the stuff we got into because we get really raw here. On the way out, we had a little extra cheese and crackers. I said, “Does anyone want it?” Do you remember what you said? Jordan: I said, “Yeah, give it to me.” I shoved it in my pocket like a homeless person. Andrew: I had Saran Wrap. I wrapped it up for you. You took it in your pocket. Then, it took me to the elevator, the handful of us, and I said, “Hey, Jordan. Now that we’re all a little bit tipsy here, you can be open. How much money do you have?” Jordan: Yeah, are things all right at home? Andrew: Yes, that’s what I was getting at. I’m going to ask you now, on camera, what kind of revenue are you guys pulling in? Jordan: I mean, it’s funny because it’s the one thing my business partners don’t want me to be too specific on, but I’m going to pull a Ramit Sethi and not tell you the exact number. But I will say, multi- multi- seven figures. Someday, I’m sure I’ll come back again and be like, “And here’s the enormous number!” But, honestly, it’s more money than I ever thought I would make in my whole life which is pretty cool. And multiple seven figures, at that. Andrew: I don’t know if you remember the follow up question that I had for you in the elevator after a few Scotches which was, “Do you have over a million in the bank?” Jordan: Right, and my answer was “no” because who keeps that amount of cash around? You’ve got to put it into assets and things like that. Andrew: So what kind of assets do you put it into? Jordan: Property. I’ve got mutual funds galore that are super boring. I invest in a few companies that are not public yet, like really early-stage stuff. I’m hoping that doesn’t go down the tubes. Investing like that, you are basically putting it [??]. Andrew: How about this? Cash and cash equivalents. I’d consider a mutual fund to be cash equivalent. Jordan: Yeah. Andrew: So, why’d you take the cheese? Jordan: Why did I take the cheese? Andrew: Why did you take the cheese? Jordan: It was really good cheese. Andrew: Wasn’t it? Jordan: And, you know, I’m not going to go to Whole Foods and buy friggin’ cheese. My girlfriend would say, “You don’t need all that.” Meanwhile, I have this huge chunk of cheese that is all mine now. If it makes you feel any better, I didn’t get to eat it all because it was a lot of cheese. My girlfriend didn’t want most of it, and I ate a ton of it. Andrew: That is the best cheese, and I can say that whole-heartedly because I AB tested the cheese. I signed up for Amazon Fresh, brought in every different kind of cheese that I could from there, and even none of those will compete with that one cheese from Trader Joe’s. All right, let’s talk about how you got here. You know what? I think I might have made a mistake at the top of the interview. I said you were a law firm, that you were a lawyer. Were you a lawyer? Jordan: Yeah, I was a lawyer. Andrew: You were? Okay, good. Jordan: I still am, technically, a lawyer in New York State. Andrew: And so, you started out going to law school with the idea that you would be a lawyer, or that you would be a big shot on Wall Street? Jordan: Oh, worst idea ever. I went to law school because I didn’t know what else to do after undergrad. Andrew: It was just the next thing to do to keep yourself busy while you figured it out. Jordan: It was, literally, undergrad ended. I walked into Best Buy. I told them I could fix computers. They said, cool. You got to work here for three years before you do that. I remember going, there’s no way I’m working here for three years in general. Let alone before I get the job that’s interesting. There like, well, you can sell CDs. I thought, why would I sell something that’s not even going to exist in four years? At that point I went home, got super depressed for an afternoon. Then went oh, this is stupid. I’m not going to get a stupid job like this. I have a degree from the University of Michigan, which the depression was, basically, wow, this means nothing to anyone. No one cares. Then, of course, I had a relative who was, like, you should be a lawyer, which is dumb advice because it’s based on nothing. I applied to law schools and I ended up getting into Michigan, which I then found out that there were rankings and things like that for law school, which is an unhealthy obsession. I went to Michigan. My girlfriend lived in Michigan at the time. I went to Michigan Law. I don’t regret it because it was awesome. I was with super smart people that were a hell of a lot smarter than me and had great work ethic and honed that like crazy for three years, but it was freakin’ expensive. Then I left and I got a job with Wall Street through networking connections. Now, I don’t use it at all. Andrew: You know what? I’m looking at you. You’re a guy who had an XM Radio show, successful podcast, teaching people at live events how to build relationships. You’re clearly a hustler, a guy who works intensely hard, comes up with creative business ideas. I can’t imagine someone like that being in law school. Jordan: No. Andrew: Did you not have this hunger at that time? Did you not say, I want to leave my mark on the world? I want to make money. I want to be something bigger than a guy in a law firm. Jordan: I was going through this weird crisis-ish thing that didn’t seem so urgent at the time. It’s funny because now that I think about it, I remember being in law school going, I’m going to be the worst employee in the world. Anybody who hires me is going to be pissed that I work for them because I don’t care. I can’t care and I can’t seem to wrap my mind around why I should even though I realize that my dad would’ve hated to hear that because he worked for Ford. He was a great and he was a great manager, or whatever. I didn’t know that I was an entrepreneur. I didn’t know that was what I think now, which is that crap is genetic, man. I just thought that I was really not cut out for what everybody else was going into. Even when I was in law school, 20/20 hindsight, I didn’t study that much. I worked my butt off, but I didn’t study that much. I read everything. I prepared everything, but I couldn’t learn to memorize. I couldn’t pay attention in class. What I did is I made friends with a lot of those smart kids who could also communicate really well. They participated the most. We started a study group the first week. Everyone made fun of us, especially me. They were, like, why are you in a study group you geek. I thought because this is the only thing that’s going to get me through this. We met every single week a couple times. I went up to a lot of these kids and I said, listen, full disclosure, I’m not the best student, but I will ask the best questions of you guys. If you guys teach me everything that I need to know I will ask you all of the ins and outs, and all the little fine details of this. A couple of the guys, especially some of these Indian dudes, Russian guys and stuff who are super analytical. They were, like, that’s what I need. Because I memorized all the details, but I can’t really pick these apart like you can. The only problem was I couldn’t listen. They would go through and teach me everything. I’d go, well, why doesn’t this do the same thing as that when the laws sort of seem like this. They’d go, hmm, well, I think it’s probably because this, this, this, and this. They’d go back to the professors office hours with 80 million questions. When exam time rolled around we were made because we had already gone through all this stuff a million times with the class and with everybody else. Andrew: I see. Jordan: I rocked it in law school, but it wasn’t because of me. It was because of those guys. The smart kids taught me everything. Andrew: You got a job and you noticed something at the law firm, which was there was a guy who was hardly ever at the firm who made more money than everyone else. Jordan: Right. Andrew: I remember seeing this at the first law firm I hired. Why was he doing better than everyone else even though he wasn’t in the firm. He wasn’t in the office much? Jordan: Yeah. This is a funny story because this guy was from Brooklyn and he had a great tan, which is an immediate red flag, right. Anybody from Brooklyn with a tan you got to wonder what the heck’s going on. He was never there. Eventually, he was, sort of, like, my quote, unquote, mentor. What that means was that HR was, like, your mentee is, Jordan Harbinger. He’s, like, whatever, but that’s how mentorship works in most law firms. Andrew: They assign you to a mentor? Jordan: They assign it in the beginning. They go, huh, fine. I’ll take him out for an expensive, all expenses paid dinner somewhere near by the office and then bounce. He took me out for coffee one day and he goes, all right. Ask me anything. I’m pretty sure that he expected to say something like, oh, how do real estate deals really work, or whatever? I said, how come you . . . I really thought he was just going to fire me, but I didn’t care. Why is a rumor that you make more money, but you’re never in the office? Do you just work from home, or what? He, sort of, laughed awkwardly, leaned back in his chair and went, all right. Fine, I’ll tell you because I went on saying, listen, I see the other partner that I work next to and they’re in the office at 1:00 am on a Sunday night. I went in there late one Sunday to show my mom and my business partner, AJ, the office where I was working and get a diet Coke out of the pantry, and there were tons of people there. I thought, what the hell’s going on here? He wasn’t there even during business hours. I asked him what the deal was. He said, all these technical guys, these guys that work so hard, they work day and night, all these dudes who come from the old country, or parents come from the old country, they will work 24/7. You can’t compete with that. Their technical knowledge is great, but at the end of the day it’s kind of replaceable with somebody else with the same amount of knowledge. The only thing that’s not readily replaceable is somebody with a great network because even if you find another person with a really great network you still want both of those people working with you because they bring in business. His time was literally better spent on the golf course on a cruise, at a charity event, doing jiu jitsu, freakin’ doing yoga with bankers and other people who are doing deals and had business for the law firm than it was sitting in the office. His time in the office was misspent. Andrew: The big takeaway for you there is knowledge is out there and enough people have it. Relationships there aren’t enough of. If I could build relationships with guy I can make more money, have more fun, that’s the life for me. Were you the kind of person who was social in high school? Were you the kind of person who talk to strangers? Jordan: No, not really. No. I was definitely really shy as a kid too. High school I started to come out of my shell a little bit. College I kind of retreated right back in there. You’re right. Knowledge, the way you put it is perfect. Knowledge is essentially a commodity even at the highest levels. Some of it’s esoteric. Some of its harder to gain than others and some of its gained through experience, but at the end of the day there’s always going to be a larger pool of those people that have that knowledge versus the pool of people that have the right type of network and connections. Of course, later on when that firm, sort of, went downhill, he just bounced and went straight to partner level at another firm in Midtown Manhattan. He probably didn’t even have to move, he probably didn’t even have to change his usual parking space. Everybody else got screwed. Andrew: You see this and what do you do? How does that change the course of your life? Jordan: It was amazing because what I did was then go, wait a minute. I don’t have to out work all these other people in the office. I just have to be a better networker than they do. Already kind of liked talking to people even though I’m not the greatest at it, but I certainly hate tracking documents, and checking all these tiny little legal details. Even the research part that everybody says is so fascinating about law, it freakin’ blows if you don’t like it, right. It sucks. There’s always going to be people who can do it better than you. I went, all right. I am going to dig into this people’s skills set and get as good at it as humanly possible because at the end of the day if I can spend the proverbial 10,000 hours mastering this versus mastering real estate finance deals I’m going to be able to stay engaged more. At the end of the day I’m more valuable than the guy who masters the other skills sets. [??] Andrew: What’s one thing that you learned before you got especially good at it? What’s one basic tip that you can give us that you learned about then. Jordan: One of the super, rudimentary basic tips that everyone’s going to go, pphh, I knew that, is that nonverbal communication trumps verbal communication every time. That seems so obvious now, but 10, 15 plus years ago that wasn’t something that just everybody knew, right. A lot of people didn’t know that your nonverbal communication was much more important than the words you say. That your delivery was key. That your first impressions were made when you walked into the room, not when you decided to introduce yourself. Those were [??] for me. Andrew: [??] I saw you. You came into the room for scotch. You were very confident and talkative. There was another guy and I don’t remember his name now. Jordan: Nobody will ever remember his name. I feel bad. Andrew: He’s very shy. Jordan: Yes. Andrew: I gave him the whiskey as a way of saying, look you can be in control here. Jordan: Right. Andrew: I said, you pour the first round for everyone. I could see he was a little intimidated by that because you don’t know how much to pour whiskey. It’s not water where you go all the way to the top of the glass. Jordan: Right. Andrew: There’s no line on a glass that says to here. What could he do differently knowing this to make himself come across really powerfully at this small event? Jordan: Yeah. Andrew: It’s not even like of us guys were sitting around. Jordan: There’s theoretically no reason for him to be that quiet there, right, but he was. When he walked in he stood next to me while I was standing there talking to either your aide. Andrew: Olivia, my wife. Jordan: Yeah. Your wife. Andrew: She happened to be finishing up for the day. Jordan: Right. So I was sitting there chatting with her and he stood there. And I remember looking at him and going, “Hey, man.” Like are you going to say something instead of just awkwardly…I wasn’t sure if he was a food delivery guy or anything. Like he really had no presence. Andrew: So then what does he do? I mean, he’s clearly…He doesn’t know anyone. It’s an intimidating situation. You don’t know are 50 people going to show up? Or is this just going to be all five of us, three of us, or how many? What’s the conversation going to be about? Am I even in the right place. I’ve had people say to me, “I feel a little awkward being here, Andrew because I’m not a real entrepreneur. Yet, one day maybe I’ll be an entrepreneur and I’ll deserve to be here for Scott.” Which is kind of weird when it’s just like four of us guys sitting around. Jordan: Right. If they only knew. Andrew: I get that though. What do you do if someone’s like that and they hear Jordan say that nonverbal communication is important? Give me one thing to do. What do they do? Do they strut in? Do they just make a fist as they come in? Jordan: Just fist pound everybody. [??] Andrew: What do they do? Do they…go ahead. Jordan: He rolled in and he said nothing and he didn’t make himself known at all. Andrew: No, I get that. But in that situation, what should he do? Jordan: Exactly. Walk in and just say hello to everybody. That sounds like a dumb tip because it’s so obvious. But here’s the thing. He was standing there afraid to interrupt us. When you walk in from somewhere, if you walk in and say, “Hey, guys.” And you introduce yourself, “Hey, guys. I’m Jordan.” It doesn’t matter. People might go, “Oh, we were talking here.” But no one’s going to be like, “What a barbarian.” They’re just going to realize that you walked in and made yourself known. You introduced yourself. In fact, we have this sort of weird societal unwritten rule that introductions kind of always trump anything else that’s going on in a conversation. Because if you don’t introduce yourself, it’s weird. And if you don’t know who you’re talking to, it’s also weird. So you have that ace up your sleeve. If you need to introduce yourself, you can really stop someone mid-sentence and go, “Sorry, sorry, man. I’m Jordan. I don’t believe we’ve actually met.” And it’s not that rude. Even if they’re in the middle of a freaking sentence talking to somebody else. So definitely should have introduced himself. He didn’t look like a schlep. He was fine in every other way. It’s not like he was hunched over in a little fetal position. Andrew: Good looking guy, had a lot going for him. Jordan: Exactly. Andrew: All right. So walk in, don’t be afraid to interrupt, and you’re right. Societally we’re okay with someone introducing themselves even if we’re mid-sentence. Jordan: Exactly. Andrew: All right. You met AJ, who’s your partner. Right? Jordan: Right. Business partner. Andrew: Business partner. Excuse me. Not life partner. Business partner. Jordan: It’s San Francisco man. Be clear. Andrew: Speaking of. AJ was really good with women. Were you really good with women growing up? Jordan: Hell no. I was terrible. AJ was really good with women. Andrew: Give me an example of how bad you were at picking up women. I should say picking up women. We weren’t thinking of picking up women in high school. I wanted to be in a relationship with a woman. I wouldn’t want to pick her up. I couldn’t. I was 115 pounds. Jordan: Oh, man. Andrew: What I wanted was to just go and start a conversation with someone I was interested in. I didn’t know how to do it. Give me an example of how bad you were at it. Jordan: I remember there was a girl that liked me and her friends knew it. They were trying to hook her up with me even though I wasn’t really friends with them. Because I was kind of quiet and didn’t have a lot of female friends, was kind of jocky. She took the craziest, ballsiest risk one day and stood up in the middle of the class of 90 people right before the lecture started. She goes, “Jordan, will you go to Sadie Hawkins with me which is that dance where the girls ask the guys.? And I remember just turning beet red and putting my books in my chair and walking straight out the back of the room to go to the bathroom as everyone chanted, “Do it. Do it.” You know, because they felt bad for her and it was awkward for me. So it was like a double win for everyone in the classroom. She felt awful. Meanwhile, I wasn’t thinking about her. I was just thinking about how she was probably making fun of me and how her friends were probably also making fun of me. And I was really pissed. Then after school one of her friends who I sort of knew was like, “What was that all about?” And I was like, “You know, you guys don’t have to make it worse than it already is. Duh, duh, duh.” And they were like, “What are you talking about? She’s had a crush on you for like two years.” At that point I felt like a total idiot because I had no idea. I was so in my head that I literally thought, “Well, this girl’s talking to me in front of all these people. This isn’t some risk she’s taking because she likes me to the point where she’s like desperate to get my attention. She just wants to make theatrics out of how shy I am.” That’s how wrapped up in my own crap that I was. And at the end of the day it wasn’t true. She had literally had a crush on me for a really long time. I just had no idea how to handle it. So that was a great metaphor for how crumby I was with the opposite sex for pretty much the first 20 plus years of my life. And it sucked. And it sucked. Andrew: AJ was not like that. Do you have an exam…By the way, what a great freaking example. I totally relate to that. In my head, I’m picturing a couple of examples in my life where I did that. So AJ was how? Jordan: AJ, I remember the time when I realized he was so good with girls. One day, it was on my birthday, and we were hanging out. We went to this bar. I was facing him and then behind him was a table of like four girls, maybe five or six girls. And he was like, “Hey, what do those girls look like behind me?” And I was like, “Oh, they’re cute.” And he was like, “They’re interested in talking to us, I was like, okay. First of all, no they’re not because blah, blah, blah, my own weird issues. Second of all, how the hell do you know? You’re facing me, I’m facing you. What could you possibly know about that table of girls? You don’t even know what they look like. He goes, “Trust me. They’re saying things a little bit louder than they need to for each other to hear and they’re talking about subject matter that’s specifically designed to get our attention.” He didn’t even say it like that, but that was what he sort of communicated. And I was like, “What are you talking about?” I was like, “Let’s get out of here, I want to go to a different place, it’s my birthday, I don’t want to talk to those girls. You don’t know what you’re talking about, we’re just going to embarrass ourselves.” He goes, “Alright, your loss”. As we’re leaving, I’m putting my jacket on, he puts his jacket on, he’s halfway out the door and the girls go, “Hey, where are you guys going? We’ll go with you”. And they, like, got their stuff and the girl was like, “Wait, what are you doing? We haven’t paid the tab.” And the girl was like, “Where are you going?” Like yelling at us. And I was like, “Uh, blah, blah, blah, other bar”. And he goes, “I told you.” And I was like, “Okay, back up the truck.” And we spent the next five hours talking about all the things that he knew that I didn’t, and we literally spent the next, I think, three years talking about it on what was then, you know, the beginning of our podcast. Because I did not understand what he intuitively knew, and it was frickin’ fascinating. Andrew: And it was a mentor protegee relationship where . . . Jordan: Yeah. Andrew: . . . AJ was the guy teaching you. So far we’ve talked a lot about relationships, we’ve talked a lot about our connection over one time we met for scotch. We haven’t gotten to the business yet. How does the realization that you had at the law firm and the connection you have with AJ lead to a business? What’s the first step that you guys took that allowed you to create a business together? Jordan: Sure. So we went out, like six, seven nights a week for a year more than a year in Ann Arbor, and we had all these guys and business owners are asking us how do you know everyone, because we would have people coming into bars by the dozens where we were going to hang out. The guys were there to learn what we were doing with girl and how we were making these relationships and business owners were like, “You guys drink for free because you’re bringing in 30 people wherever you go.” Andrew: Wait, guys would come to you and say . . . Jordan: Yes. Andrew: . . . I’ll pay you to, wait, so how did these guys find out about you? Jordan: They watched us. They would go, okay, I mean, drunk guys would approach us at like 11, 1:00 in the morning and go, “Hey. You’re with different girls every night. What’s the deal? I’ve seen you out every Saturday, or three times”, depending on how often they go out, they were like . . . Andrew: And they would meet you in person . . . Jordan: Yes. Andrew: . . . and you would say, ‘I will teach you if you pay me?’ Jordan: We would say just buy us drinks and you can come hang out, and they would be like, send me an email or call me when you’re going to go out and we had a list of, like, 28 guys. And we would call small numbers of them and make sure that we had free drinks for the rest of the night, and the venue owners would give us free drinks too because we’d bring in so many people. So we never paid for dinner, we never paid for drinks . . . Andrew: Wait, guys who come into bars aren’t a big boon usually, because you’re not spending that much money, you’re not drawing in a lot of women. Bartenders don’t tend to buy drinks for guys who come. They buy drinks for women. Jordan: Right. Andrew: Or they want you to, they want both men and women to pay. How did these guys end up paying for your drinks? Jordan: They offered to, we told the guys to pay for the drinks and the venue owners and the bartenders would pay for our drinks because we’d befriended them and also because we would tell the manager, like ‘Hey, I bring 8 to 10 guys here every Saturday. Can you hook it up?’ And they’d be like, ‘Yeah sure. The first three are on the house.’ And I mean, when you say first three drinks and you can ask for a glass full of vodka and another glass full of Coca-Cola, you’re good, unless you’re an alcoholic, for the rest of the night. Andrew: Okay, so we’re talking three drinks total. Not three per person. Jordan: No, no, three per person, and additionally, then the guys we were out would buy the rest. So we hadn’t paid for drinks in months. Andrew: At that point, the pickup artist community had already started. The stuff that Neil Strauss wrote about had already . . . Jordan: It was not out yet. Andrew: It wasn’t out yet. Jordan: No, it wasn’t out yet. Andrew: But you were looking at it online and reading what was going on? Jordan: No. We didn’t see most of that stuff. And when we did see it, we were like this is so weird, I don’t want anything to do with this and there’s no way this stuff works and I’m not ordering a light up hat. Andrew: So what’s, you’re talking about the flair, or the . . . Jordan: The peacocking, weird . . . Andrew: The peacocking is what they call it to get attention. Jordan: That stuff is so ridiculous and there was just no way that it was happening, we weren’t doing that. Andrew: So is the next step to build a podcast or to start selling lessons to these guys? Jordan: We accidentally started the podcast in the way that guys were like, ‘You should write a book, you should write a book, you should write a book.’ AJ was a cancer biologist. I was studying for the Bar exam. Ain’t nobody going to write a book, right? So we decided to make some sort of CD Audio thing and maybe hand it to guys that would ask us for this stuff, because we thought this information must be free. I mean, it was just so good. And so AJ was like, ‘Hey, listen, there’s this thing call podcasting. There’s like 800 of them in the new iTunes that’s out. It’s real cool. We should just buy some microphones from Guitar Center and just record some stuff and put it online. And then when people want it, we can just tell them the website to download it. So he made a website, we recorded some stuff, outlined a few episodes, put it online and. We were one of 800 or 8,000, or however many podcasts there were, in 2005. Andrew: Two thousand five. And at the time the site was called Pickup Podcast? Jordan: Right, because it was all about picking up the ladies back then. We didn’t care about other stuff then. We didn’t see the overlap. Andrew: Here’s what the side of the site says. “Join us each week as AJ and Jordan discuss pickup, dating, and social dynamic. Every show includes tips, tactics, listener quotes, and stories from the field designed to help you get your game in order.” Jordan: Cringe. That’s from Wayback Machine or something, right? Because… Andrew: Yeah, way back. Jordan: Because I was going to say, that’s been gone for… Andrew: Even the domain no longer exists. Jordan: …years. Andrew: Right. The domain now redirects to ArtofCharmPodcast.com, right? If I remember… Jordan: Yeah. Andrew: I’m now looking at a 2007 version of the site, and here’s what it says on Saturday, March 17, 2007. “Wow! So for those of you who’ve been paying attention, you know we’ve been giving away a ton of free stuff every week. Yet we still get questions, so here’s a laundry list of the stuff we’re tossing out to about one in five of our listeners who responded to the survey.” And what you have is Steven Nash CD sets, Carlos Zuma e-books, “How to Manage Your Wildly Successful Dating Life,” Mystery Method DVDs — that’s the guy who you’re talking about with the boot? Jordan: We were giving a lot of stuff away, because they were sending it to us. They were like, “A lot of our clients are finding us through. Can you do something to promote you?” We were like, “Well, we’re not just going to randomly promote you. Give us a bunch of your products, and we’ll give them away to our guys for free when they ask for it.” Andrew: I see. But you couldn’t have hated them that much at that point. Jordan: No, at that point we hadn’t met them in real life. I don’t hate those guys. To be super clear, I just think it’s ridiculous. A lot of those guys have evolved as well. Guys like that have evolved. Then there’s other guys who haven’t. If you still look at those Mystery guys from VH1, they’re still wearing light-up stuff, and it’s ridiculous. This has been going for eight years. That stuff kind of expired. It’s like, “Get with the program.” Once you meet those guys in real life and you find out that 99% of what they do is internet marketing, and they don’t really care about helping people, it pisses you off. That’s what jaded us a lot to that whole industry. Andrew: I see on the right side of the page from back then, Pua Training and Boot camps. I see…I know you’re cringing. We have to include the whole thing to see how you got here. Jordan: No, you go for it, man. It’s like pulling off a really old Band- Aid. Andrew: Alpha Immersion DVDs. You were making money off of affiliate links, as far as I could tell by… Jordan: No, we never made any affiliate money off of that stuff. If we had affiliate links, they were woefully unsuccessful. We literally got no affiliate money from that stuff. Andrew: I see. I was trying to figure out what the companies are that you’re doing affiliate programs with. I saw something called marketing…where is that? MarketersChoice.com, but maybe that’s other people who are using it, and that’s the way you link to them. My question then is, where is the money in all this? That tail is from your cat. Jordan: My cat’s. It’s my cat’s tail. No, it’s my tail, because when I get asked tough questions, it dangles in front of the printer. Sorry, go ahead. Andrew: Where is the money coming from? Jordan: There was no money at that point. We didn’t get… Andrew: What was the first thing that you sold? Jordan: Guys told us they wanted to come to Ann Arbor and learn from us. I said, “Where are you going to stay?” They said, “We have family there. We don’t care.” So we said, “Okay, fine, come to Ann Arbor and we’ll meet up.” There’s a street fair, and we’ll take you out during the day. They said, “How much is it going to cost?” We said, “50 dollars an hour.” One of them said, “That’s it?” We said, “Dammit! Yeah, okay, that’s it.” And then it happened again a month later, and it happened again a month later. Every time we raised our prices. A couple times before we really got the memo, proverbially, we had a guy saying, “Can you take me to the mall and teach me how to talk to strangers?” And we said, “Sure.” This guy worked for Intel and it was fine. He said, “How much is that?” We said, “Just buy us dinner and pay us for our time a little bit.” He gave us $900, and we were like, “Whoa.” We thought he was going to give us 50 bucks and dinner. He gave us $900 and he bought us a really nice dinner. We were like, “Wait a minute. There might be something here.” I started getting phone coaching clients, and then AJ did too, where guys would pay us $100, $150 an hour to stay on the phone with us, talk about social issues they were having. One was an immigrant from some African country that lived in Denmark. He was like, “Listen, I’m having trouble making friends. I’m a student here. I just don’t get it.” I gave him a bunch of drills and exercises, and we talked every single week on Skype. Him and a bunch of his friends were like, “This is changing my life.” And that’s when I was like, “This is really cool.” I didn’t know that it was going to have this big of an impact on other people as it did on myself. We really… Andrew: How do you know what to tell them to do? It’s so hard to tell someone else what to say. It’s so hard… Jordan: It doesn’t matter what you say, and that was part of it. It made it easier. Andrew: If it doesn’t matter what you say, and I noticed that too, that I can come up with, when I was really struggling I could talk to my brother. We would go out and we would say, “What’s the line? What do we say? Look at that. Do we comment on their dress? Do we comment on their drink? Do we ask them if we can buy them a drink?” We’d get in our head and when I got comfortable with myself and got comfortable talking to strangers, I could just walk over and say, blah, blah, blah, blah. And if they were interested, it would be the wackiest thing, and it would start a conversation. Jordan: Yeah, yeah. Andrew: And if they weren’t, then that’s fine. But to get to that, I needed a crutch. How do you get someone who’s so uncomfortable, who’s in a new country, culturally unsure of himself, what do you tell him that gets him comfortable saying something to a stranger? Jordan: A lot of it is exposure therapy, and at that point I just didn’t want to make crap up and give it to clients who were paying me money, so I contacted very interesting and value-giving and cool therapists, psychologists, people like that. And I was like, “Listen, what would you give somebody with social anxiety?” I looked up a lot of those dreads and read lots of books and educated myself when I was, “Okay, listen, if this doesn’t work for you, you don’t pay me.” That’s what I gave to every single client, and that’s the guarantee that we still give to Art of Charm clients because we don’t want them to shoulder the risk, the burden of the risk. So we would say, “All right. Listen, if you rode the bus and you see people that you want to talk to and they’re not talking to you, it’s not because you’re African, it’s because you live in Norway and people don’t frigging talk to each other on the bus. Nor do they do that in the United States. So just lean over, and at that point it was whatever he was comfortable with. I mean, some clients it was ask for directions. Other clients were like tell them that you’re new in the country, and you’re having trouble making friends. And he’s like, “Wow, that’s dangerous. That feels dangerous.” And I said, “If it feels dangerous but it doesn’t feel physically dangerous, then just got for it and see what happens. Just don’t get arrested.” And so, of course, he did that and he did that for months and months and months. He ended up with this really cool girlfriend. He had a circle of friends, people that he’s met like in libraries and student places, and he wrote me an email years later that, “This has changed my whole life. I never would have been able to assimilate as well as I have”, and it was actually Denmark not Norway, “As I would have without your help. I really appreciate it, and I have a job. I have a family now and all this stuff.” That was awesome, and that’s what we do, and that’s what I love doing about it. And so it really is courageous to everybody because you can’t give a cookie cutter/answer/cookie cutter solution for every single client that comes through, and that’s why we cap our programs at seven or eight guys. Yet we have like seven coaches because it’s just too [??] Andrew: Seven or eight guys in person? Jordan, Right, in our live training, at our school. They stay overnight for the week. Andrew: Is that the first thing that you did, took people up on their offer to fly in and learn? Jordan: Yeah, they flew in and learned, but they didn’t stay with us. And then after that it was fun coaching, and then after that guys were flying in and staying with us. We were based in Manhattan at the time. They would stay in my apartment in Manhattan, and they would sleep there. There were like one or two guys every week because we had no real . . . our audience was tiny, and they would do that, and they would tell their friends. Fast forward to now, it’s eight guys, seven or eight guys every single week, four months, six months in advance. But then the season we’re booked out completely. Andrew By the way, that sound, I was looking at you to say, “You’re a pro. Why are you having audio on? You should know not to. If not, you it’s me.” Jordan: It’s you, right? Andrew: It’s totally me, but that sound is on your site. You have that chatbox where a guy named Ocean Ray [sp] comes in and says, “Hey, welcome. How did you discover the site? It hit me back and, yes, I’m a real person, not a bot. Hey you’ve been here before. I see. You let me know if you need anything. Otherwise, I won’t bug you.” You guys have your stuff so together, like it’s really a professional operation that it’s hard to now compare today which looks fantastic, where you’re selling something very clearly, which has a phone number at the top . . . Jordan: Right. Andrew: . . . has this guy, Ocean, on the bottom who is going to chat with you, when before where you clearly were trying to figure out your way. I’m looking around here. If see my eyes darting everywhere, it’s because . . . there it is. Your tag line, your podcast name was “pickup podcast.” The tag line was “where gurus gather.” Jordan: Yeah. And that was terrible. I mean, I’ll be the first to say, “That’s a terrible name.” But the marketing worked really great because people were looking for that, and we called it hiding the broccoli, right? Because in order to get a kid to eat broccoli which is good for them, you have to cover it in cheese. And that’s what we were doing back then, but now we’re refined. Thank God we don’t need to do that anymore because people aren’t looking for quick fixes. They’re not looking for . . . and if they are, they’re not fit for what we do. Back then we were kind of like trying to survive. Now we can filter in people who get it, and by get it they go, “This is a process. It’s going to take work. It’s not about getting a fix. It’s about me, and it’s about the work I’m willing to put in.” We filter for that now. Back then it was like, “Is this a business? I don’t know. I have a day job. Hopefully, it is.” Andrew: When did you know it would be a business? Jordan: You know what? Honestly, it took years and years. I’m trying to . . . That’s a good question because I’m thinking about I’d quit law and even then I was like, “Oh, am I going to have to become, like, a school teacher?” Not that there’s anything wrong with that. My mom does that. But am I going to have to get a day job again? And the answer . . . eventually, the answer was no, probably like three, four years ago. And that’s probably 50% of the company history was with me spent going, “I just want to work at the Post Office. Those people don’t have that much stress,” which is a lie because they shoot each other. But there was so much stress at points that I wished I was not in business for myself. Now that I literally never wish for that, ever, I mean, at all. Andrew: So about three years ago was there . . . Jordan: Four, four, four years ago, yeah, four years ago. Andrew: . . . was there a milestone, a product that you sold that suddenly took you over? Jordan: No, it was we brought in some new blood to the company. We got rid of a lot of dumbass people, if I can say that on your show, that were just, like, value drains, stupid friends that we’d hired that turned out to be more trouble than they were worth. Stuff like that, we got rid of all those people. We had, finally, our website was working a lot better. Our show audience was growing like crazy. And it was just, all signs were go. And our clients were super satisfied. We weren’t making stupid mistakes anymore due to laziness or incompetence. And I mean, that’s like an ongoing battle whenever you run a team. Andrew: So it was just constant, small improvements? I’ll tell you for Mixergy what did it . . . Jordan: Yeah. Andrew: . . . was I was trying to figure out where’s the revenue in doing Mixergy. Otherwise, I either pay for all the work out of my pocket, like pay Joe, the editor, out of my pocket, or I have to close it down. And I didn’t want to do either one. I tried a bunch of different things and then I said, “I’m going to do these small courses.” And one of the first ones was “How to Interview,” and it was like a mini-test course, and people bought it. You were one of the customers who bought it, which . . . Jordan: I bought it, yeah. Andrew: . . . I’m really proud that you did. And that helped take off. That was just the start and then when I switched to memberships so I didn’t have to sell each one individually and deal with all those individual smaller products, life got a whole lot different and now there’s a team here and those two steps were dramatic. You didn’t have anything like that, did you? Jordan: No, no, there was no, like, “Oh, that made everything a lot easier.” I mean, that would be great, that would be cool if we had some major big wins like that, but honestly, one of the things that helped me get to the next level and helped us as a company get to the next level was me realizing that I couldn’t pick up all the slack for any other team members that were slacking and I also couldn’t do everything myself. So hiring people and getting return on investment beforehand after learning their job was something that I started to replicate. So I did . . . that Ocean Ray guy – that’s a real person, by the way – I did his job for, I think, at least one year, maybe two. That’s why he’s real and talks real, because I wouldn’t outsource to a bot. I want guys with a certain level of competency, I tested them myself, I . . . Andrew: It was you on the popup box. Jordan: For at least a year. I spent 12 hours a day selling. Andrew: Who makes the popup box? It’s a good one. Jordan: That is Live Chat but our outsourcing company is totally separate. They’re based in Australia. And if anybody . . . honestly, I can’t remember off the top of my head, but if people want to email me personally, am I allowed to do this? Andrew: Yeah. Jordan: If they want to email me personally, just email me jordanh@theartofcharm.com and I will introduce you to that plugin and the person that staffs it, because they do a frickin’ phenomenal job. Andrew: So it’s a company that staffs it, that learns your product well enough . . . Jordan: Yes. Andrew: . . . to be able to respond. Jordan: Exactly, exactly. And I can call them any time day or night and somebody will answer. And I know the owner and he’s a boss. And the company . . . Andrew: And it’s always Ocean Ray who’s on there? Jordan: No, it’s, it depends [??]. Andrew: And is it really his photo because Ocean Ray looks like a really good-looking guy. That can’t be him. Jordan: Yeah, he’s like a mofo but the girls’ photos I found are fake, which is highly disappointing. Andrew: Okay. Jordan: But yeah, no, we chose, I mean, we selected salesmen with a certain level of English and/or native English but Ocean Ray, honestly, that’s his real name. I told him, “Hey, can you pick a different fake name?” And he was like, “No, because that’s my real name.” And I thought, “Who am I to talk? My last name is Harbinger.” So, you know . . . Andrew: [laughs] I just sent the one message saying, “What products can I buy?” cause he’s a salesman. Jordan: Yeah, and I hope he doesn’t disappoint me live on your show cause I’ll be very pissed. Andrew: The podcast was the very first thing you created. Not a blog, but a podcast, right? Jordan: Right, yeah, no, the blog was a placeholder that said, “Hey, we have another episode. Click here to download it.” That was the blog. Andrew: Mm-hmm. So how did you get so many viewers for or so many listeners for your podcast? You guys are enormous. Jordan: Yeah, right now I think we’ve got like 800,000. We’re one of the largest shows in iTunes. It’s pretty awesome. I love it. It’s my baby. I’m obsessed with it. I check my iTunes rank every five minutes. But the way that we did it, this is going to sound cliche and dumb, feel free to try and poke holes in it. I am honestly welcoming it. I think putting out consistent quality without trying to be salesy and not trying to be, like, “Here’s a quick fix!” And just telling people like it is. Also, being authentic in terms of admitting my own shortcomings in every area of my life and probably too publicly? Made us relatable enough that people stuck with us, and giving people things we had tested and not just the latest “flavor of the month” bull crap. That self-help you guys were trying to hock and not hocking those DVDs. All those DVDs all those products you sell? We gave those away for free, until we weren’t able to any more. Then we removed it from the site. We never sold any of that trash because we didn’t know about it. So people would have to ask for that. Even when we were having links for stuff on our website? We removed those eventually. I remember at one point we were actually giving people refunds when the person who sold them the product wouldn’t give fund, if they found out about it through our site. We cared enough that we didn’t want them to feel burned by their experience with us. I remember refunding a set of DVDs from a company even though they weren’t our DVD’s. People thought we were crazy. But A.J. and I were like, it doesn’t matter. We just want them to be happy with what we’re doing. I think that attitude? As cliche as it sounds and putting out only top- notch stuff as far as we could? Was the best thing ever because what that did is, we have people emailing us every day, ‘I’ve been listening to you for seven years.’ I mean, that’s ridiculous! I haven’t done anything for seven years other than wake up in the morning. That’s as consistent as we have been and podcasting is the only other thing. Andrew: So being good to your audience. But was there something that you did? I know one of the things that you told April Dykeman, here on the research staff at Mixergy you said, “You emailed blogs and you got on message boards and you started asking for links, back in the time when it worked?” Jordan: Yeah. Back in the day, and you remember this and probably very few other listeners do, blogs were something you did because you actually liked it. You didn’t care if you never became a millionaire off the damn thing. So, I would email everybody in our niche and outside the niche and say, hey I’ve got this show and it’s all about becoming a better guy. Would you check it out and/or link to it? I stayed up until 5 a.m., probably for four straight months during the summer and I emailed every, single blog I could find. Probably, high double-digit, low three-digit number of blogs were, like, ‘Sure.’ and they linked to us and that built our original audience. People are always asking me, “Oh man, what’s the way to get podcast listeners?” I’m, like, I don’t know, I did it eight years ago and it was a crap load of work that, quite frankly you’re probably not willing to do. And people don’t like that answer but that’s the truth. Andrew: Why is Lewis Howes sending you so much traffic? Jordan: Is he? I didn’t know that. Andrew: Yeah. What’s the connection with Lewis’ site?lewishowes.com, I looked at your. I have a similar web account and I’m looking to see where your traffic is coming from, to get a sense of it. I see pick-up artist, pickuppodcast.com is sending you traffic but that makes sense, Jordan: That’s our [??], yeah. Andrew: because your URL is out there, people are typing it in and they get redirected [anyway]. feedlead of course makes sense because that’s a feed, ourassessreader, and leapdaily maybe, maybe not and then Lewis Howes in the fourth slot. I’m wondering did you do an interview with Lewis? Is that what happened? Jordan: Yeah. Yeah. Lewis is a good buddy of mine, real cool cat, a sharp dude. He interviewed me pretty recently so that’s probably why it’s fresh. I think if you did your way-back machine on the stats, you’d probably see some other large show that I went on recently. Andrew: That’s the thing. It seems like going on other podcasts also helps you guys. Jordan: Oh yes, of course. The trick is though, you’ve got to deliver good stuff. If you go on a large podcast and go, “Everybody go to my website right now!” No one is going to give a crap. The host is going to hate you and maybe never air the show. But, yeah, if you go on and deliver something really good that people can use and you show that you care, like we try to every, single time. Then, yeah, people will come on over. I know that Lewis is sending us traffic. I just didn’t know it was that much. I don’t pay attention to that stuff. I’m supposed to but I don’t. Andrew: But you do take a look at your rankings on iTunes? Jordan: iTunes. That’s kind of like the weavy measuring of the podcast world. It’s like where you are. I want to make damn sure I’m number one in self-help. I want to make damn sure I’m in the top five in health. I want to make damn sure I’m in the top 100.. Andrew: So what do you do if tomorrow you wake up and you’re number three? What do you do to fix it? Jordan: That’s a great question. What I would do, I would reach out to my network and say, ‘Hey, I know you’ve been trying to interview me for a while. I would love to come on. Or I would get a high-profile guest and I would interview them. Honestly though, what I typically do is call Apple is the unfair advantage that I have now I’ve been doing this for a long time. I call Apple and I say, “Hey, who would you like to see me interview? I’ve got these ideas and who would you like to see me interview? I’ve got these ideas and who would you put on the front page of iTunes?” And they give me a list out of that list. Then I call those people’s PR. Have my people call their people, you know. Then we set it up. Then I go on the front page of iTunes. [??] Andrew: Who’s a big name that Apple said if you interview them then it’s a good reason to be on? Jordan: Robert Green was a good one. Also because he was our episode 250 which was our seven year anniversary of the show. So that was met with approval. I’ve had quite a few features go up in the front page of Apple. I’ve got some guys coming out in the next few months that I’m not supposed to talk about because they’re not up there yet. Andrew: Give me a past guest who was especially popular and got you featured. Jordan: Robert Green was the most recent one that got me featured. Andrew: You know what’s great about Robert Green? I believe I interviewed him and I believe, I believe what Ryan Holiday who works for him did was I think he paid to buy ads to send them to Robert’s interview on Mixergy. And if he didn’t buy ads, he did something. Ryan Holiday did something. He does something to promote his guys. Jordan: Sure. Andrew: I don’t know if that happened to you, but they don’t just send Robert Green on. They make sure Robert Green kills. Jordan: Well, no. I’m friends with Robert Green so I literally just called him and was like, “Hey. This has been a long time in the making. Why don’t we do this show finally? Oh, also I want to put it on the front page of iTunes.” Which is a great way to get a guest. Andrew: Got you. So you then email them back or call them back and then they get you on the list. So interviewing is a good one. Interviewing people who are well known. Asking others to interview you. Working the blogs back then made sense. Today you have to be a lot more PRy about it. Jordan: Yeah. Unfortunately. Andrew: And I’m trying to think if there’s anything else that I can see from here. Are you buying ads? Jordan: No. Andrew: I can’t find any ad buys. Jordan: You will not find any ad buys, my friend. Andrew: I don’t see…here’s the search terms that seem to do well. Obviously The Art of Charm, The Art of Charm. Jordan Harbinger. People are typing in your name. How to turn a girl on over text? Jordan: Sweet. Andrew: Right. And the reason that is doing well is you have this, according to my friend, Ocean Ray, you have a book on that. Jordan: Yes, we do. Andrew: For a hundred bucks I could buy the book that shows me how to text women. Jordan: Holly crap. That’s expensive. I wrote that thing a long time ago. It’s a good book, but apparently we raised the price. Andrew: Let me see. Is it? It is that. So you’re doing the events in person. Ninety-seven dollars. There it is. Will get me started immediately. You do any events in person? Jordan: Yes. Andrew: Then the next big product that you sell is? Jordan: The next big product. We have a book called “Attraction Alchemy.” That comes with some phone coaching that I think is 247. And then we’ve got our membership site. That’s 67 bucks a month. That’s good because it gets you interacting with people. But honestly if I’m being fully a hundred percent transparent, you can only learn so much from an online product or a website. It’s like riding a motorcycle… Andrew: You got to come in person. Jordan: You got to come and learn it from people. Or you got to at least talk to us. Andrew: And it’s less than or fewer than ten people who will be there. By the way, it’s called The Art of Charm Academy. I can sign up for a buck to get started. And then it’s what? Sixty-seven bucks a month after, right? Jordan: That’s the membership site. Andrew: That’s the membership site. Jordan: And all that stuff comes with your live programs. A lot of people are like, “I’m going to get started with this.” I’m like, “Great. But you’re just wasting time and telling yourself you’re making progress.” Andrew: Whereas if I come into the live program I also get the membership. Jordan: You get everything. Andrew: What does the live program cost? Jordan: It depends. They range from four to eight thousand. Andrew: Four to eight thousand. Jordan: And we’re raising prices this summer, but yeah. And what, sorry? Andrew: What do I learn or that? Jordan: We take you through the ringer. It’s six days. It’s accommodation in LA. It includes all the expenses except for flight and food. We take you through banter, starting conversations, generating report. We videotape you in interactions with other people. Then we go through the tape with you. We let you see the way that you interact with others. The way that you show up to others. We help you tweak that in an authentic way. We go through a lot drills and exercises that help expose insecurities or things that you’re dealing with. We help break those down so that they’re not sticking points anymore. We teach you how to deal with difficult people. We teach you persuasion, association. It’s huge. Andrew: I can use it for dating, but it’s beyond dating too. Jordan: Oh, yeah. It’s beyond dating. It’s well beyond. Andrew: You guys haven’t fully moved beyond dating. Dating is still there. Jordan: Oh yeah. It’s still there. Andrew: It’s clearly dating. Jordan: Yes. Andrew: Okay. What is this eBook that you acquired for 30 thousand dollars? Because apparently something happened there. Jordan: eBook that we acquired… Andrew: You decided to come up with an eBook. Had acquired it for 30 thousand and the team that created it. Jordan: Thirty thousand bucks. Andrew: No? Here’s what you told April. She asked you about the lowest point. We do pre-interviews and research. Jordan: Oh, the guy stole it and it was worth that much. We had invested 30 grand. Andrew: Got it. So when you say you acquired it for 30 thousand, that means how much…So if you’re writing an eBook, how does it cost 30 thousand dollars? Jordan: It’s marketing and the salaries of all the people that were involved with it over a longer period of time and all the tech behind it. It wasn’t the eBook. No we didn’t acquire it for 30 grand. I would never pay 30 grand for an eBook. Andrew: And then what happened? Jordan: Well, they decided, hey, Jordan, AJ, all those guys do is sit and collect checks because we don’t really understand their job. We’re just going to take this website and we’re going to take this IP, Intellectual Property, the book and associated content and we’re just going to sell them, and we’re going to keep the money, and screw you. That really sucked. That was like the worst because those guys were, or so I thought, we were friends. I had paid them. Paid for their living expenses in New York. I had paid for them places to live, but I kind of after a while realized that I was dealing with people that were, like, . . . and this is 20/20 hindsight. This is not something I came to right away. These guys really never wanted to build what we wanted to build. They just wanted income. They just wanted a way out of the grind. They wanted hope because they had nothing else going on. Looking at what they’re doing now they’re literally in the same position they were six years ago. I was mad about it for so long, and now it’s just, like, nah. Andrew: Who are they? Jordan: I can’t name names. I won’t name names. It’s just like a dick thing to do. Andrew: This got really bad. Your hair was starting to falling out in the shower. Jordan: Oh, my God. Yeah. Andrew: You started to obsess. How do you resolve something like this? Jordan: I was so stressed that, this is, again, five years ago. I was so stressed. I was taking showers. My hair was falling out. I was freaking out. We were in court all the time. I was just this big mess. You know what? I decided to stop worrying about it because there was nothing I could do. I realized that I’d gotten this far. My team was really great. We were like a family. I was very distraught with what happened, but I realized everybody’s who’s left are the people who are willing to be around through thick and thin. Because if they’re putting up with this now this is a lean time. We were dead in the water. It was the worst thing ever. They’d had gone on and done things and they had been broadcasting like they were doing something really great. Then as time wore on we kept our heads down in the trenches and just kept building what we were doing at the [??] charm. We ended up fine. Then we look back at what they were doing and we realized, wow, they’re still living on people’s couches and have no money. It’s just, like, what was I worried about that whole time. That galvanized me in a lot of ways. Not in the way where I’m, like, everything is a transaction and screw everyone, but where I’m, like, ah, everybody’s got their own crap in their head. Everybody thinks they’re doing the right thing and if they don’t, it’s just doesn’t matter. You can’t get wrapped up in their shit. If you do it will drown you. I can try to carry everyone’s brick, but what you need to do, if you have a vision, if you want to leave that legacy, if you want to build a company you cannot get wrapped up in the drama. You just can’t. It will kill you. It will kill your company anyway. Andrew: I was doing some searches to see if I could find out exactly what happened. I’m sure I could, but it’s not worth getting into them. Where is self-help in the podcast directory? I’m now in the podcast directory to see where you’re ranking and . . . Jordan: Under self-help. Andrew: Under self-help. I don’t see self-help. I see science, societies, sports. It’s under . . . Jordan: Do you see health? Andrew: Sorry? Jordan: Health. Go click on health. Andrew: There’s health. Okay. Jordan: Yeah. You see, Tucker Maxes [??]. That’s trending right now. It will be gone later. Then savage love cast, which is, Dan Savage. He’s always on top. He’s a New York Times Syndicated Columnist. He’s great at what he does. Then there’s us. Then if you go to the sub-category . . . Andrew: Oh, yeah. Here we go. Now I see the top, under health. It’s like you said, it’s the Mating Grounds by, Tucker Max, his new one, Savage Love Cast, and then number three, Heart of Charm and right below is, Juliane Michaels Show. Jordan: Right, Jillian Michaels, yeah. Andrew: Jillian, excuse me. What is it with all these people who created podcast? I think they are over estimating the power of just throwing up a podcast. Jordan: Oh, yeah. Podcasting right now is like the trendiest thing that you can do. It’s trendy among internet marketers. It’s trendy among authors. It’s very powerful, but here’s the thing. It’s a very double edged sword. If you’re an author and you start a podcast and you freakin’ suck at it, like a lot of them do, all the editing in the world is not going to make you more interesting, unfortunately. There’s a lot of authors that are not that interesting other than when they write. They don’t have podcast. Those that do I feel like they [??] their material. Andrew: I think we might be limiting ourselves by saying podcast . . . Jordan: I’m sure. Andrew: . . . because go through the streets of San Francisco, ask someone to show you how they install a podcast on their phone. Most people don’t freakin’ understand what it is. Jordan: [??] Andrew: Yes, there are programs like Stitcher that make it more accessible. Ask someone about Stitcher and they’re going to tell you about Pandora. That’s what they listen to not Stitcher. Jordan: Sure. Andrew: These guys see that you do well and they want to jump in there and they think that it’s going to be a snap. Jordan: Sure. Andrew: Because they’re trying to mimic you, I think, not just you. They’re trying to mimic a couple of other successful podcast. Because they are blinding themselves the power of going to YouTube. Jordan: Sure. Andrew: Going to Text and Edition, all those other things. Let me do a quick plug here that I should have done really earlier in the interview. Then I want to follow up and ask you one or two more important questions. The plug is for Andrewswelcomegate.com, Andrewswelcomegate.com. Why? Because, here’s the thing, you need to find the same thing all of us entrepreneurs need. We need audience to take action. A specific kind of action. Either go and buy or give us their email address or download a podcast. All those things take so much psychological understanding of what’s going on in the user’s head. What they’ve seen before. How to get them to sign up. All that stuff is pretty complicated. You can spend a lot of time doing it. Or you can just go to Lead Pages where they have the templates already set up. Where it’s all prepared to allow you to easily get the sale or get the email address. Because the guy behind it, Clay, is really obsessed with it. And they have tons of templates that will allow you to collect email addresses to close sales, etc. One of those templates is my very own template. The one that I created for Mixergy. It took me a couple of years to get right. It took me a lot of time to increase conversions on. But it’s there and it works and it’s available to you right now if you sign up for Andrewswecomegate.com. It’s going to cost you a buck. LeadPages will power it. So you don’t even have to know how to add it to a WordPress site or to another site. But if you do, you can easily add it to WordPress. I know I have. You can easily add it to, frankly if you have no site you can do it. Or if you just have a URL and you want to point it over. It’s all available to you if you go over to Andrewswelcomegate.com. It’ll work instantly. You’ll be amazed by how many email addresses you get. How many relationships you end up building with people who would otherwise just turn out to be hits. You know, just hit on the website. Not enough, you want a real relationship. That starts with someone joining your mailing list and you continuing the conversation that way. Andrewswelcomegate.com, it’ll work. Frankly I’m a little worried, Jordan, that’s it’s going to work too well. Because I get a lot of my email addresses from people that go to my welcome gate who give me their email addresses. I’m a little concerned that by giving it to Clay who’s going to give it to everyone else that it might lose its power. Jordan: You might be right. Andrew: Yeah, it might. And if it does then there’s a reason why it’s Andrewswelcomegate.com. I can always say, “All right, let’s delete the URL.” Then no more new people can have it. Jordan: Yeah. Or you could just innovate and get something that works even better. Andrew: Innovate. You out of your freaking mind? I got that working, can’t I just live off that for the rest of my life? Jordan: You can. You can try. You can see how… Andrew: What do you think of people who talk about this… Jordan: Passive income? Andrew: Passive income. Create… Jordan: I knew you were going to say that. Andrew: …that runs while you’re sleeping. Jordan: That’s a bunch of crap. Ever look at Pat Flynn, runs Smart Passive Income. He’s so smart. He works eight hours a day. Andrew: The guy works really hard. Jordan: He works really hard. Andrew: I rejected his interview because when people suggested it because I said I don’t want to promote this idea of passive income. And then I came on here and the first question out of my mouth was about this passive income being a crock and why I didn’t have him on before. And he explained what he was talking about. It’s not this don’t ever work mentality that other passive income people have. I think maybe I read too much into the title of the site. Jordan: Well yeah. I mean if you think about it the guy who wrote the four hour work week works at least 40 hours a week I would say. So how’s that working out. And all those people that try to work four hours a week they’re broke and living in their mom’s basement. So you know, scoreboard. Andrew: There is no passive income in this I don’t believe anyway. In the sense that you put a website up and the thing just works. People can look back and say, “Oh, Jordan doesn’t even have to man the live chat box.” No, but Jordan does. What do you have to do now or else the business is going to fail? Jordan: Sure. So everyday I’m hustling. I’m always on other shows. I’m always recording top notch hopefully content for The Art of Charm. I proof all the emails, well most all the emails that go out with my name on it because I don’t want that to be crumby. I do a lot of media and PR. I’m always training our sales guys on the little live chat thing. I always do a ton of customer service stuff. Andrew: What’s media and PR for you? Jordan: What’s that? Andrew: What’s media and PR? Jordan: So it seems like every day that somebody’s like, either another podcast or some sort of Ink magazine thing like, “We want to learn how you earn money digitally.” Or whatever the latest thing is. I get those opportunities all the time. I do a lot of networking where I talk to people and develop relationships. Try to help as many people as possible. I also do coaching and consulting on my own, of course. About everything from podcasting to helping clients who are looking for advanced social skills for whatever purpose they want. Lawyers, doctors, special forces guys, people who need to negotiate things. Those people they all come to us. So I’m on the hook for that. There’s no such thing as passive income. Honestly I wish there was a such thing as a 40 hour freaking work week for me sometimes. Andrew: Forty hours would be nice. Jordan: Forty hours, yeah. Andrew: Yes. Jordan: I mean, I’m usually great because I’m flexible with my time off. But I certainly don’t have this overabundance of time off where I just don’t know what to do with myself. People who tell you they’re doing that are either not making that much money or they’ve made money and they’re coasting on it or they’re full of crap. Usually it’s some mix of those three things. Andrew: Alright. Here’s where I wanted to end it. April said I got to ask you about going to North Korea. Jordan: Ah, yes. Andrew: She doesn’t even have to say I got to ask you about going to North Korea. If I hear that you went to North Korea three times and you’re planning to return. I am going to have to ask you about that. Bill Clinton in 2009 had to fly into North Korea to rescue someone who was trapped there. Aren’t you worried you’re going to get trapped in North Korea? Jordan: I have been worried about that in the past. Yes. But I’ve run towards there. I’ve got enough decent connections with people there that I’m just hoping I don’t have to call Uncle Bill to come fly in and rescue me. Andrew: Because he’s not going to rescue you. Imagine Bill Clinton with his problems with women, is going to fly and save the guy who used to have a [poo-op] podcast? Forget it! He can’t do it. Jordan: How do you think he got out of that rut? Honestly, I don’t think that it’s going to be an issue. I’m no causing any trouble. I bring the tourist industry there and a lot of engagements which is what they are after. I keep my mouth shut and keep my head down. Andrew: Does the U.S. allow you to go to North Korea? Jordan: Yes. Andrew: How? Jordan: Hey, I do a show and run a business about generating relationships. They love the fact that I do that. Andrew: The U.S. is okay with you going to North Korea? Jordan: They are 100% okay with it and they’re 100% with tourist going there as well. It’s easy for me to get an American visa to North Korea. It’s a snap and it’s completely legal. Andrew: Wow! And there is no embassy there. In case you run into trouble, what do you do? Jordan: There is a Swedish Embassy which has some a U.S. intersection that will help us out when we need it. But honestly the tours there are controlled, they are strictly guided. Our guides there know us, it’s not a big deal. It’s really not s big deal. We’re not there handing out freaking bibles and we’re not there with shotgun microphones and taking secret footage. We’re going through the motions and it’s fascinating but it’s certainly not controversial for them. Andrew: If you get caught in North Korea and can’t come out and A.J. needs a new partner, will you be insulted if I ask him to partner up with him on the business? Jordan: No, go ahead. Please do, keep it running. Andrew: Okay. Eventually insulted if I run edited excerpts of you in the end saying North Korea is a very safe place just so I can juice-up my traffic? Jordan: Yeah, no, go for it, man. Here’s the thing, it’s a very safe place for tourists because all the criminals are dead. They’re breaking rocks in the gulag somewhere. It’s not safe politically. I would say that if you want to go, it’s the adventure-ish type thing of the edgy tourist, but I wouldn’t want to set up shop there any time soon. I think it might be a little bit sketchy. Andrew: That seems amazing. I can’t believe it. Jordan: It is amazing. I take a lot of entrepreneurs there. You should go. Andrew: I’m a little afraid. To be honest, I would like to go. Jordan: People you know are going. Andrew: For example? Jordan: Oh, we can talk of it. I got to get their permission. I don’t know if they want me to blab all over the place. Andrew: Do you feel a little bit violated that I started out this interview by asking you about the cheese? Jordan: No! The cheese is totally fair game. I think it illustrates, here’s the thing, you’re never going to be so set that you don’t have to hustle. If you look at Mark Cuban on Shark Tank. That guy is not like, “Oh, screw it, I’m so rich I don’t give a crap!’ No, the dude is hustling. Everybody “on top is hustling. They get there by hustling, they stay there by hustling. There’s not a whole lot of [cursing] going on by people who actually earn their money as far as I’ve seen. Andrew: And I’ve seen you hustle for a long time and it’s great to have had you on here. How do you feel it went? Jordan: I think it was cool. This is a good milestone for me personally because I emailed you a shit load back in the day. And somebody was, ‘Man, no thanks’. And that was fine. Andrew: No, back then it was me that was ‘no’ somebody. I think I just looked at it and I said, all he must be doing is pick up artist stuff. I don’t know if there’s anything to this. I’m looking at the email here, we’ve got emails going back to 2010 maybe even before then. Jordan: Yeah. So, I was Pat Flynn 1.0, you were like, I’m judging a book by its cover. No thanks! Andrew: Totally. But the thing is, sometimes I feel really bad I say, “Why am I saying no to this guy?’ Jordan is obviously a good guy. Especially after Scott, I was starting to feel bad.” Then I say, “There is no perfect way to do this right. I have to just trust that I get it right most of the time and learn when I don’t.” If I look and say what can I learn from this it’s that I could of looked beyond the topic. I could of looked a little more in-depth and said, “What’s here?” But you know what? I don’t know how I would have found out because you weren’t at the top of the podcast list at the time. If I look at your traffic numbers? Frankly, they don’t show much. If I look at your site, I don’t know how I would find out. The only way that I could find out for sure is, I’m looking at my inbox under your name. The other thing I see come up a lot is people like Kelly [Acevedo] saying, “You should meet these guys” and telling me in person like, John Corcoran and a couple of others. That’s the only way, frankly, that I know. I can’t tell otherwise. Jordan: Yeah, we come highly recommended. Honestly, if I took the first ‘no’ for an answer, I wouldn’t be anywhere right now. Andrew: I’m not being defensive, I’m just saying, I think I’m trying to make myself feel a little bit better, because I do feel bad about that. I feel bad when I get it wrong with people. Especially, in this case it didn’t have to happen, but sometimes I then have to go and beg people to come back on, you know people who look at my inbox to find their email. I see, oh right we said no in the past. That’s why I say no matter what you really can’t predict who’s going to do well in this business. You always have to just … even if we turn someone down I tell everyone on the team. We’re not turning them down forever, we’re going to beg them in the future. Jordan: Well, I appreciate you begging me to come back on this show. Andrew: I’m really grateful for you for being on here. And I really enjoyed our conversation in private apart from this. I would not reveal anything including the cheese without our permission. And you know that none of the other cool stuff that we talked about was revealed publically. And I hope it’s not going to be the last time that we get together. Jordan: I agree, well of course we’ll hang we’re in the same city. I was thinking if you were set up for it we could do this face to face but it’s just not, we’re both in small rooms right now. Andrew: You know, I think it was hard to do it face to face it so much easier to do it this way. The editing comes up really fast. And frankly also if you see my eyes dart around it’s because when you say something I quickly go and check it out. And see what else can I go? What other information can I get? And it’s kind of awkward to do that in person. Jordan: I agree, the only real downside to doing it in separate locations is I have to drink my own Scotch instead of yours. Andrew: And I’ve got a really good collection here. It’s mounting. You know what just before my baby was born I built such a great collection at home and now I don’t even know when I’m going to get a drink at home. But I do it here in the office from time to time still. Jordan: Yeah, well excellent you’re biking distance from me, so I’ll see you soon. Andrew: All right, I’d love it. Thank you for doing this interview everyone out there thank you for being a part of it. Jordan actually gave his email address so when I tell you all the time that the first way to start a conversation with someone who you’ve heard on Mixergy or seen do something credible at a conference or write a good blog post or a book. When I tell you what you should do is email them or phone them or tell them in person, thank you. Usually I give you a little bit of homework, right. You have to go and look for it, in this case all you have to do is just scroll up in the transcript and his email address is right there. Jordan: That’s right. Andrew: when you do that, when you say thank you. You end up setting the foundation for a relationship that often, often you can draw on in the future. Often starts out so well that you’ve warmed up the conversation with them for the next time. If you ever see Jordan in person don’t be afraid to interrupt and say, hey. Because apparently interrupting is okay if it’s an introduction. Jordan: It is, it’s okay. In fact it happened to me in Starbucks today. Andrew: Somebody recognized you? Jordan: Are you Jordan Harbinger? And I went … I look around like I’m on ”Punked” because you know who does that? When does that ever happen? But it’s awesome. Andrew: That is such a frickin cool thing. It’s one often best [??] about doing this. So I guess I can understand why Max …. Why Coco Max would want to do a podcast and all those other people. It is an awesome bi- product. Jordan: Yes, agreed. I’m sure he get recognized it’s on he’s on the cover of his own book. Andrew: He’s on the cover of the book. Yes. Jordan: Exactly. Andrew: All right, thank you so much for being a part of it. Thank you all to bye.",
  "image": "https://mixergy.com/interviews/jordan-harbinger-the-art-of-charm-interview/?get-twitter-card=true\u0026v=14\u0026time=1560509786",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Hey there, freedom fighters. My name is Andrew Warner. I am the founder of Mixergy.com. I got my very serious face on because business I take this very, very seriously. I really want to do these interviews so that you and I can learn from entrepreneurs about how they built their businesses. More importantly, take back the best ideas we can and help grow our own businesses.\u003c/p\u003e\n\u003cp\u003eAnd when you do that, my hope for you, my hope for the mission here at Mixergy is that you will return and do an interview here on Mixergy and teach others what you learned along the way. The circle of Mixergy. I’ve said it for years, and now many of the thousand interviewees that I’ve had here on Mixergy have done just that. Successful companies they’ve built, and then they come back here and do an interview about it. And today we’re going to find out how a lawyer built a multi-million dollar company that teaches social skills.\u003c/p\u003e\n\u003cp\u003eJordan Harbinger is the co-founder of The Art of Charm, a company that teaches confidence and emotional intelligence. This interview is sponsored by LeadPages. Later on I’ll tell you a special URL where you can go if you want a great page that will help get more of your traffic to convert into email subscribers. Pay attention for that later. First, I’ve got to welcome Jordan. Jordan, good to have you here.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Thanks for having me. It’s funny you should mention LeadPages. We have LeadPages.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I know. I feel like all of us use LeadPages.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Well, I spotted it, and I was like “Is this real? This looks amazing.” And so I started using it, and our traffic, you know, our squeeze or whatever you want to call it, email marketing is not my department, obviously, at ASU, went through the freaking roof, man.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Because Clay Collins, the guy who created the company, is obsessed with conversion rates.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I see what they do to tweak things. I see how they allow you to plug in someone’s email address before they even put it into the site. I see how they put a button to increase conversion rates, and they play with the colors and all that. Anyway, I should tell people if you want my page, the one that works especially well for me, the one that does more than 20% conversion rate, here’s the URL to go to. AndrewsWelcomeGate.com, AndrewsWalcomeGate.com. Jordan, you were here for Scotch, right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes, I was, and now I’m here for Scotch.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, you are having a Scotch while we are having this conversation! Super!\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s 5:00 p.m. Central Standard Time, or something, somewhere. Anyway…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Wait, you’re not in Pacific Coast time anymore?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I am, but it’s only 4:00 here so that would be shameful.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Gotcha, so you are looking for the excuse.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: But you came here to Mixergy HQ. We were here with a couple guys, and we were having conversation that was really open. I won’t even talk about the stuff we got into because we get really raw here. On the way out, we had a little extra cheese and crackers. I said, “Does anyone want it?” Do you remember what you said?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I said, “Yeah, give it to me.” I shoved it in my pocket like a homeless person.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I had Saran Wrap. I wrapped it up for you. You took it in your pocket. Then, it took me to the elevator, the handful of us, and I said, “Hey, Jordan. Now that we’re all a little bit tipsy here, you can be open. How much money do you have?”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, are things all right at home?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes, that’s what I was getting at. I’m going to ask you now, on camera, what kind of revenue are you guys pulling in?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I mean, it’s funny because it’s the one thing my business partners don’t want me to be too specific on, but I’m going to pull a Ramit Sethi and not tell you the exact number. But I will say, multi- multi- seven figures. Someday, I’m sure I’ll come back again and be like, “And here’s the enormous number!” But, honestly, it’s more money than I ever thought I would make in my whole life which is pretty cool. And multiple seven figures, at that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I don’t know if you remember the follow up question that I had for you in the elevator after a few Scotches which was, “Do you have over a million in the bank?”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right, and my answer was “no” because who keeps that amount of cash around? You’ve got to put it into assets and things like that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So what kind of assets do you put it into?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Property. I’ve got mutual funds galore that are super boring. I invest in a few companies that are not public yet, like really early-stage stuff. I’m hoping that doesn’t go down the tubes. Investing like that, you are basically putting it [??].\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: How about this? Cash and cash equivalents. I’d consider a mutual fund to be cash equivalent.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So, why’d you take the cheese?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Why did I take the cheese?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Why did you take the cheese?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was really good cheese.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Wasn’t it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And, you know, I’m not going to go to Whole Foods and buy friggin’ cheese. My girlfriend would say, “You don’t need all that.” Meanwhile, I have this huge chunk of cheese that is all mine now. If it makes you feel any better, I didn’t get to eat it all because it was a lot of cheese. My girlfriend didn’t want most of it, and I ate a ton of it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That is the best cheese, and I can say that whole-heartedly because I AB tested the cheese. I signed up for Amazon Fresh, brought in every different kind of cheese that I could from there, and even none of those will compete with that one cheese from Trader Joe’s. All right, let’s talk about how you got here. You know what? I think I might have made a mistake at the top of the interview. I said you were a law firm, that you were a lawyer. Were you a lawyer?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, I was a lawyer.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You were? Okay, good.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I still am, technically, a lawyer in New York State.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And so, you started out going to law school with the idea that you would be a lawyer, or that you would be a big shot on Wall Street?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, worst idea ever. I went to law school because I didn’t know what else to do after undergrad.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was just the next thing to do to keep yourself busy while you figured it out.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was, literally, undergrad ended. I walked into Best Buy. I told them I could fix computers. They said, cool. You got to work here for three years before you do that. I remember going, there’s no way I’m working here for three years in general. Let alone before I get the job that’s interesting. There like, well, you can sell CDs.\u003c/p\u003e\n\u003cp\u003eI thought, why would I sell something that’s not even going to exist in four years? At that point I went home, got super depressed for an afternoon. Then went oh, this is stupid. I’m not going to get a stupid job like this. I have a degree from the University of Michigan, which the depression was, basically, wow, this means nothing to anyone. No one cares.\u003c/p\u003e\n\u003cp\u003eThen, of course, I had a relative who was, like, you should be a lawyer, which is dumb advice because it’s based on nothing. I applied to law schools and I ended up getting into Michigan, which I then found out that there were rankings and things like that for law school, which is an unhealthy obsession. I went to Michigan. My girlfriend lived in Michigan at the time. I went to Michigan Law.\u003c/p\u003e\n\u003cp\u003eI don’t regret it because it was awesome. I was with super smart people that were a hell of a lot smarter than me and had great work ethic and honed that like crazy for three years, but it was freakin’ expensive. Then I left and I got a job with Wall Street through networking connections. Now, I don’t use it at all.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You know what? I’m looking at you. You’re a guy who had an XM Radio show, successful podcast, teaching people at live events how to build relationships. You’re clearly a hustler, a guy who works intensely hard, comes up with creative business ideas. I can’t imagine someone like that being in law school.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Did you not have this hunger at that time? Did you not say, I want to leave my mark on the world? I want to make money. I want to be something bigger than a guy in a law firm.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I was going through this weird crisis-ish thing that didn’t seem so urgent at the time. It’s funny because now that I think about it, I remember being in law school going, I’m going to be the worst employee in the world. Anybody who hires me is going to be pissed that I work for them because I don’t care. I can’t care and I can’t seem to wrap my mind around why I should even though I realize that my dad would’ve hated to hear that because he worked for Ford.\u003c/p\u003e\n\u003cp\u003eHe was a great and he was a great manager, or whatever. I didn’t know that I was an entrepreneur. I didn’t know that was what I think now, which is that crap is genetic, man. I just thought that I was really not cut out for what everybody else was going into. Even when I was in law school, 20/20 hindsight, I didn’t study that much. I worked my butt off, but I didn’t study that much.\u003c/p\u003e\n\u003cp\u003eI read everything. I prepared everything, but I couldn’t learn to memorize. I couldn’t pay attention in class. What I did is I made friends with a lot of those smart kids who could also communicate really well. They participated the most. We started a study group the first week. Everyone made fun of us, especially me. They were, like, why are you in a study group you geek.\u003c/p\u003e\n\u003cp\u003eI thought because this is the only thing that’s going to get me through this. We met every single week a couple times. I went up to a lot of these kids and I said, listen, full disclosure, I’m not the best student, but I will ask the best questions of you guys. If you guys teach me everything that I need to know I will ask you all of the ins and outs, and all the little fine details of this. A couple of the guys, especially some of these Indian dudes, Russian guys and stuff who are super analytical. They were, like, that’s what I need.\u003c/p\u003e\n\u003cp\u003eBecause I memorized all the details, but I can’t really pick these apart like you can. The only problem was I couldn’t listen. They would go through and teach me everything. I’d go, well, why doesn’t this do the same thing as that when the laws sort of seem like this. They’d go, hmm, well, I think it’s probably because this, this, this, and this. They’d go back to the professors office hours with 80 million questions.\u003c/p\u003e\n\u003cp\u003eWhen exam time rolled around we were made because we had already gone through all this stuff a million times with the class and with everybody else.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I see.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I rocked it in law school, but it wasn’t because of me. It was because of those guys. The smart kids taught me everything.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You got a job and you noticed something at the law firm, which was there was a guy who was hardly ever at the firm who made more money than everyone else.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I remember seeing this at the first law firm I hired. Why was he doing better than everyone else even though he wasn’t in the firm. He wasn’t in the office much?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. This is a funny story because this guy was from Brooklyn and he had a great tan, which is an immediate red flag, right. Anybody from Brooklyn with a tan you got to wonder what the heck’s going on. He was never there. Eventually, he was, sort of, like, my quote, unquote, mentor. What that means was that HR was, like, your mentee is, Jordan Harbinger. He’s, like, whatever, but that’s how mentorship works in most law firms.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: They assign you to a mentor?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: They assign it in the beginning. They go, huh, fine. I’ll take him out for an expensive, all expenses paid dinner somewhere near by the office and then bounce. He took me out for coffee one day and he goes, all right. Ask me anything. I’m pretty sure that he expected to say something like, oh, how do real estate deals really work, or whatever? I said, how come you . . . I really thought he was just going to fire me, but I didn’t care. Why is a rumor that you make more money, but you’re never in the office? Do you just work from home, or what?\u003c/p\u003e\n\u003cp\u003eHe, sort of, laughed awkwardly, leaned back in his chair and went, all right. Fine, I’ll tell you because I went on saying, listen, I see the other partner that I work next to and they’re in the office at 1:00 am on a Sunday night. I went in there late one Sunday to show my mom and my business partner, AJ, the office where I was working and get a diet Coke out of the pantry, and there were tons of people there.\u003c/p\u003e\n\u003cp\u003eI thought, what the hell’s going on here? He wasn’t there even during business hours. I asked him what the deal was. He said, all these technical guys, these guys that work so hard, they work day and night, all these dudes who come from the old country, or parents come from the old country, they will work 24/7. You can’t compete with that. Their technical knowledge is great, but at the end of the day it’s kind of replaceable with somebody else with the same amount of knowledge.\u003c/p\u003e\n\u003cp\u003eThe only thing that’s not readily replaceable is somebody with a great network because even if you find another person with a really great network you still want both of those people working with you because they bring in business. His time was literally better spent on the golf course on a cruise, at a charity event, doing jiu jitsu, freakin’ doing yoga with bankers and other people who are doing deals and had business for the law firm than it was sitting in the office. His time in the office was misspent.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The big takeaway for you there is knowledge is out there and enough people have it. Relationships there aren’t enough of. If I could build relationships with guy I can make more money, have more fun, that’s the life for me. Were you the kind of person who was social in high school? Were you the kind of person who talk to strangers?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, not really. No. I was definitely really shy as a kid too. High school I started to come out of my shell a little bit. College I kind of retreated right back in there. You’re right. Knowledge, the way you put it is perfect. Knowledge is essentially a commodity even at the highest levels. Some of it’s esoteric. Some of its harder to gain than others and some of its gained through experience, but at the end of the day there’s always going to be a larger pool of those people that have that knowledge versus the pool of people that have the right type of network and connections.\u003c/p\u003e\n\u003cp\u003eOf course, later on when that firm, sort of, went downhill, he just bounced and went straight to partner level at another firm in Midtown Manhattan. He probably didn’t even have to move, he probably didn’t even have to change his usual parking space. Everybody else got screwed.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You see this and what do you do? How does that change the course of your life?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was amazing because what I did was then go, wait a minute. I don’t have to out work all these other people in the office. I just have to be a better networker than they do. Already kind of liked talking to people even though I’m not the greatest at it, but I certainly hate tracking documents, and checking all these tiny little legal details. Even the research part that everybody says is so fascinating about law, it freakin’ blows if you don’t like it, right. It sucks.\u003c/p\u003e\n\u003cp\u003eThere’s always going to be people who can do it better than you. I went, all right. I am going to dig into this people’s skills set and get as good at it as humanly possible because at the end of the day if I can spend the proverbial 10,000 hours mastering this versus mastering real estate finance deals I’m going to be able to stay engaged more. At the end of the day I’m more valuable than the guy who masters the other skills sets. [??]\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What’s one thing that you learned before you got especially good at it? What’s one basic tip that you can give us that you learned about then.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: One of the super, rudimentary basic tips that everyone’s going to go, pphh, I knew that, is that nonverbal communication trumps verbal communication every time. That seems so obvious now, but 10, 15 plus years ago that wasn’t something that just everybody knew, right. A lot of people didn’t know that your nonverbal communication was much more important than the words you say.\u003c/p\u003e\n\u003cp\u003eThat your delivery was key. That your first impressions were made when you walked into the room, not when you decided to introduce yourself. Those were [??] for me.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: [??] I saw you. You came into the room for scotch. You were very confident and talkative. There was another guy and I don’t remember his name now.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Nobody will ever remember his name. I feel bad.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: He’s very shy.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I gave him the whiskey as a way of saying, look you can be in control here.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I said, you pour the first round for everyone. I could see he was a little intimidated by that because you don’t know how much to pour whiskey. It’s not water where you go all the way to the top of the glass.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There’s no line on a glass that says to here. What could he do differently knowing this to make himself come across really powerfully at this small event?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s not even like of us guys were sitting around.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There’s theoretically no reason for him to be that quiet there, right, but he was. When he walked in he stood next to me while I was standing there talking to either your aide.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Olivia, my wife.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Your wife.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: She happened to be finishing up for the day.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right. So I was sitting there chatting with her and he stood there. And I remember looking at him and going, “Hey, man.” Like are you going to say something instead of just awkwardly…I wasn’t sure if he was a food delivery guy or anything. Like he really had no presence.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So then what does he do? I mean, he’s clearly…He doesn’t know anyone. It’s an intimidating situation. You don’t know are 50 people going to show up? Or is this just going to be all five of us, three of us, or how many? What’s the conversation going to be about? Am I even in the right place. I’ve had people say to me, “I feel a little awkward being here, Andrew because I’m not a real entrepreneur. Yet, one day maybe I’ll be an entrepreneur and I’ll deserve to be here for Scott.” Which is kind of weird when it’s just like four of us guys sitting around.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right. If they only knew.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I get that though. What do you do if someone’s like that and they hear Jordan say that nonverbal communication is important? Give me one thing to do. What do they do? Do they strut in? Do they just make a fist as they come in?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Just fist pound everybody. [??]\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What do they do? Do they…go ahead.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: He rolled in and he said nothing and he didn’t make himself known at all.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, I get that. But in that situation, what should he do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Exactly. Walk in and just say hello to everybody. That sounds like a dumb tip because it’s so obvious. But here’s the thing. He was standing there afraid to interrupt us. When you walk in from somewhere, if you walk in and say, “Hey, guys.” And you introduce yourself, “Hey, guys. I’m Jordan.” It doesn’t matter. People might go, “Oh, we were talking here.” But no one’s going to be like, “What a barbarian.” They’re just going to realize that you walked in and made yourself known. You introduced yourself.\u003c/p\u003e\n\u003cp\u003eIn fact, we have this sort of weird societal unwritten rule that introductions kind of always trump anything else that’s going on in a conversation. Because if you don’t introduce yourself, it’s weird. And if you don’t know who you’re talking to, it’s also weird. So you have that ace up your sleeve. If you need to introduce yourself, you can really stop someone mid-sentence and go, “Sorry, sorry, man. I’m Jordan. I don’t believe we’ve actually met.” And it’s not that rude. Even if they’re in the middle of a freaking sentence talking to somebody else. So definitely should have introduced himself. He didn’t look like a schlep. He was fine in every other way. It’s not like he was hunched over in a little fetal position.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Good looking guy, had a lot going for him.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Exactly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: All right. So walk in, don’t be afraid to interrupt, and you’re right. Societally we’re okay with someone introducing themselves even if we’re mid-sentence.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Exactly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: All right. You met AJ, who’s your partner. Right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right. Business partner.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Business partner. Excuse me. Not life partner. Business partner.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s San Francisco man. Be clear.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Speaking of. AJ was really good with women. Were you really good with women growing up?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Hell no. I was terrible. AJ was really good with women.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Give me an example of how bad you were at picking up women. I should say picking up women. We weren’t thinking of picking up women in high school. I wanted to be in a relationship with a woman. I wouldn’t want to pick her up. I couldn’t. I was 115 pounds.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, man.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What I wanted was to just go and start a conversation with someone I was interested in. I didn’t know how to do it. Give me an example of how bad you were at it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I remember there was a girl that liked me and her friends knew it. They were trying to hook her up with me even though I wasn’t really friends with them. Because I was kind of quiet and didn’t have a lot of female friends, was kind of jocky. She took the craziest, ballsiest risk one day and stood up in the middle of the class of 90 people right before the lecture started. She goes, “Jordan, will you go to Sadie Hawkins with me which is that dance where the girls ask the guys.?\u003c/p\u003e\n\u003cp\u003eAnd I remember just turning beet red and putting my books in my chair and walking straight out the back of the room to go to the bathroom as everyone chanted, “Do it. Do it.” You know, because they felt bad for her and it was awkward for me. So it was like a double win for everyone in the classroom. She felt awful. Meanwhile, I wasn’t thinking about her. I was just thinking about how she was probably making fun of me and how her friends were probably also making fun of me. And I was really pissed.\u003c/p\u003e\n\u003cp\u003eThen after school one of her friends who I sort of knew was like, “What was that all about?” And I was like, “You know, you guys don’t have to make it worse than it already is. Duh, duh, duh.” And they were like, “What are you talking about? She’s had a crush on you for like two years.” At that point I felt like a total idiot because I had no idea. I was so in my head that I literally thought, “Well, this girl’s talking to me in front of all these people. This isn’t some risk she’s taking because she likes me to the point where she’s like desperate to get my attention. She just wants to make theatrics out of how shy I am.” That’s how wrapped up in my own crap that I was.\u003c/p\u003e\n\u003cp\u003eAnd at the end of the day it wasn’t true. She had literally had a crush on me for a really long time. I just had no idea how to handle it. So that was a great metaphor for how crumby I was with the opposite sex for pretty much the first 20 plus years of my life. And it sucked. And it sucked.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: AJ was not like that. Do you have an exam…By the way, what a great freaking example. I totally relate to that. In my head, I’m picturing a couple of examples in my life where I did that. So AJ was how?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: AJ, I remember the time when I realized he was so good with girls. One day, it was on my birthday, and we were hanging out. We went to this bar. I was facing him and then behind him was a table of like four girls, maybe five or six girls. And he was like, “Hey, what do those girls look like behind me?” And I was like, “Oh, they’re cute.” And he was like, “They’re interested in talking to us, I was like, okay.\u003c/p\u003e\n\u003cp\u003eFirst of all, no they’re not because blah, blah, blah, my own weird issues. Second of all, how the hell do you know? You’re facing me, I’m facing you. What could you possibly know about that table of girls? You don’t even know what they look like. He goes, “Trust me. They’re saying things a little bit louder than they need to for each other to hear and they’re talking about subject matter that’s specifically designed to get our attention.” He didn’t even say it like that, but that was what he sort of communicated. And I was like, “What are you talking about?”\u003c/p\u003e\n\u003cp\u003eI was like, “Let’s get out of here, I want to go to a different place, it’s my birthday, I don’t want to talk to those girls. You don’t know what you’re talking about, we’re just going to embarrass ourselves.” He goes, “Alright, your loss”.\u003c/p\u003e\n\u003cp\u003eAs we’re leaving, I’m putting my jacket on, he puts his jacket on, he’s halfway out the door and the girls go, “Hey, where are you guys going? We’ll go with you”. And they, like, got their stuff and the girl was like, “Wait, what are you doing? We haven’t paid the tab.” And the girl was like, “Where are you going?” Like yelling at us. And I was like, “Uh, blah, blah, blah, other bar”. And he goes, “I told you.” And I was like, “Okay, back up the truck.” And we spent the next five hours talking about all the things that he knew that I didn’t, and we literally spent the next, I think, three years talking about it on what was then, you know, the beginning of our podcast. Because I did not understand what he intuitively knew, and it was frickin’ fascinating.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And it was a mentor protegee relationship where . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . AJ was the guy teaching you. So far we’ve talked a lot about relationships, we’ve talked a lot about our connection over one time we met for scotch. We haven’t gotten to the business yet. How does the realization that you had at the law firm and the connection you have with AJ lead to a business? What’s the first step that you guys took that allowed you to create a business together?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure. So we went out, like six, seven nights a week for a year more than a year in Ann Arbor, and we had all these guys and business owners are asking us how do you know everyone, because we would have people coming into bars by the dozens where we were going to hang out. The guys were there to learn what we were doing with girl and how we were making these relationships and business owners were like, “You guys drink for free because you’re bringing in 30 people wherever you go.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Wait, guys would come to you and say . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . I’ll pay you to, wait, so how did these guys find out about you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: They watched us. They would go, okay, I mean, drunk guys would approach us at like 11, 1:00 in the morning and go, “Hey. You’re with different girls every night. What’s the deal? I’ve seen you out every Saturday, or three times”, depending on how often they go out, they were like . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And they would meet you in person . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . and you would say, ‘I will teach you if you pay me?’\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: We would say just buy us drinks and you can come hang out, and they would be like, send me an email or call me when you’re going to go out and we had a list of, like, 28 guys. And we would call small numbers of them and make sure that we had free drinks for the rest of the night, and the venue owners would give us free drinks too because we’d bring in so many people. So we never paid for dinner, we never paid for drinks . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Wait, guys who come into bars aren’t a big boon usually, because you’re not spending that much money, you’re not drawing in a lot of women. Bartenders don’t tend to buy drinks for guys who come. They buy drinks for women.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Or they want you to, they want both men and women to pay. How did these guys end up paying for your drinks?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: They offered to, we told the guys to pay for the drinks and the venue owners and the bartenders would pay for our drinks because we’d befriended them and also because we would tell the manager, like ‘Hey, I bring 8 to 10 guys here every Saturday. Can you hook it up?’ And they’d be like, ‘Yeah sure. The first three are on the house.’ And I mean, when you say first three drinks and you can ask for a glass full of vodka and another glass full of Coca-Cola, you’re good, unless you’re an alcoholic, for the rest of the night.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Okay, so we’re talking three drinks total. Not three per person.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, no, three per person, and additionally, then the guys we were out would buy the rest. So we hadn’t paid for drinks in months.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: At that point, the pickup artist community had already started. The stuff that Neil Strauss wrote about had already . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was not out yet.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It wasn’t out yet.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, it wasn’t out yet.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: But you were looking at it online and reading what was going on?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No. We didn’t see most of that stuff. And when we did see it, we were like this is so weird, I don’t want anything to do with this and there’s no way this stuff works and I’m not ordering a light up hat.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So what’s, you’re talking about the flair, or the . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The peacocking, weird . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The peacocking is what they call it to get attention.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That stuff is so ridiculous and there was just no way that it was happening, we weren’t doing that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So is the next step to build a podcast or to start selling lessons to these guys?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: We accidentally started the podcast in the way that guys were like, ‘You should write a book, you should write a book, you should write a book.’ AJ was a cancer biologist. I was studying for the Bar exam. Ain’t nobody going to write a book, right? So we decided to make some sort of CD Audio thing and maybe hand it to guys that would ask us for this stuff, because we thought this information must be free. I mean, it was just so good.\u003c/p\u003e\n\u003cp\u003eAnd so AJ was like, ‘Hey, listen, there’s this thing call podcasting. There’s like 800 of them in the new iTunes that’s out. It’s real cool. We should just buy some microphones from Guitar Center and just record some stuff and put it online. And then when people want it, we can just tell them the website to download it. So he made a website, we recorded some stuff, outlined a few episodes, put it online and. We were one of 800 or 8,000, or however many podcasts there were, in 2005.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Two thousand five. And at the time the site was called Pickup Podcast?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right, because it was all about picking up the ladies back then. We didn’t care about other stuff then. We didn’t see the overlap.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Here’s what the side of the site says. “Join us each week as AJ and Jordan discuss pickup, dating, and social dynamic. Every show includes tips, tactics, listener quotes, and stories from the field designed to help you get your game in order.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Cringe. That’s from Wayback Machine or something, right? Because…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, way back.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Because I was going to say, that’s been gone for…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Even the domain no longer exists.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: …years.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right. The domain now redirects to ArtofCharmPodcast.com, right? If I remember…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I’m now looking at a 2007 version of the site, and here’s what it says on Saturday, March 17, 2007. “Wow! So for those of you who’ve been paying attention, you know we’ve been giving away a ton of free stuff every week. Yet we still get questions, so here’s a laundry list of the stuff we’re tossing out to about one in five of our listeners who responded to the survey.” And what you have is Steven Nash CD sets, Carlos Zuma e-books, “How to Manage Your Wildly Successful Dating Life,” Mystery Method DVDs — that’s the guy who you’re talking about with the boot?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: We were giving a lot of stuff away, because they were sending it to us. They were like, “A lot of our clients are finding us through. Can you do something to promote you?” We were like, “Well, we’re not just going to randomly promote you. Give us a bunch of your products, and we’ll give them away to our guys for free when they ask for it.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I see. But you couldn’t have hated them that much at that point.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, at that point we hadn’t met them in real life. I don’t hate those guys. To be super clear, I just think it’s ridiculous. A lot of those guys have evolved as well. Guys like that have evolved. Then there’s other guys who haven’t. If you still look at those Mystery guys from VH1, they’re still wearing light-up stuff, and it’s ridiculous. This has been going for eight years. That stuff kind of expired. It’s like, “Get with the program.” Once you meet those guys in real life and you find out that 99% of what they do is internet marketing, and they don’t really care about helping people, it pisses you off. That’s what jaded us a lot to that whole industry.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I see on the right side of the page from back then, Pua Training and Boot camps. I see…I know you’re cringing. We have to include the whole thing to see how you got here.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, you go for it, man. It’s like pulling off a really old Band- Aid.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Alpha Immersion DVDs. You were making money off of affiliate links, as far as I could tell by…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, we never made any affiliate money off of that stuff. If we had affiliate links, they were woefully unsuccessful. We literally got no affiliate money from that stuff.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I see. I was trying to figure out what the companies are that you’re doing affiliate programs with. I saw something called marketing…where is that? MarketersChoice.com, but maybe that’s other people who are using it, and that’s the way you link to them. My question then is, where is the money in all this? That tail is from your cat.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: My cat’s. It’s my cat’s tail. No, it’s my tail, because when I get asked tough questions, it dangles in front of the printer. Sorry, go ahead.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Where is the money coming from?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There was no money at that point. We didn’t get…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What was the first thing that you sold?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Guys told us they wanted to come to Ann Arbor and learn from us. I said, “Where are you going to stay?” They said, “We have family there. We don’t care.” So we said, “Okay, fine, come to Ann Arbor and we’ll meet up.” There’s a street fair, and we’ll take you out during the day. They said, “How much is it going to cost?” We said, “50 dollars an hour.” One of them said, “That’s it?” We said, “Dammit! Yeah, okay, that’s it.”\u003c/p\u003e\n\u003cp\u003eAnd then it happened again a month later, and it happened again a month later. Every time we raised our prices. A couple times before we really got the memo, proverbially, we had a guy saying, “Can you take me to the mall and teach me how to talk to strangers?” And we said, “Sure.” This guy worked for Intel and it was fine. He said, “How much is that?”\u003c/p\u003e\n\u003cp\u003eWe said, “Just buy us dinner and pay us for our time a little bit.” He gave us $900, and we were like, “Whoa.” We thought he was going to give us 50 bucks and dinner. He gave us $900 and he bought us a really nice dinner. We were like, “Wait a minute. There might be something here.”\u003c/p\u003e\n\u003cp\u003eI started getting phone coaching clients, and then AJ did too, where guys would pay us $100, $150 an hour to stay on the phone with us, talk about social issues they were having. One was an immigrant from some African country that lived in Denmark. He was like, “Listen, I’m having trouble making friends. I’m a student here. I just don’t get it.” I gave him a bunch of drills and exercises, and we talked every single week on Skype. Him and a bunch of his friends were like, “This is changing my life.” And that’s when I was like, “This is really cool.” I didn’t know that it was going to have this big of an impact on other people as it did on myself. We really…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: How do you know what to tell them to do? It’s so hard to tell someone else what to say. It’s so hard…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It doesn’t matter what you say, and that was part of it. It made it easier.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: If it doesn’t matter what you say, and I noticed that too, that I can come up with, when I was really struggling I could talk to my brother. We would go out and we would say, “What’s the line? What do we say? Look at that. Do we comment on their dress? Do we comment on their drink? Do we ask them if we can buy them a drink?” We’d get in our head and when I got comfortable with myself and got comfortable talking to strangers, I could just walk over and say, blah, blah, blah, blah. And if they were interested, it would be the wackiest thing, and it would start a conversation.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And if they weren’t, then that’s fine. But to get to that, I needed a crutch. How do you get someone who’s so uncomfortable, who’s in a new country, culturally unsure of himself, what do you tell him that gets him comfortable saying something to a stranger?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: A lot of it is exposure therapy, and at that point I just didn’t want to make crap up and give it to clients who were paying me money, so I contacted very interesting and value-giving and cool therapists, psychologists, people like that. And I was like, “Listen, what would you give somebody with social anxiety?” I looked up a lot of those dreads and read lots of books and educated myself when I was, “Okay, listen, if this doesn’t work for you, you don’t pay me.”\u003c/p\u003e\n\u003cp\u003eThat’s what I gave to every single client, and that’s the guarantee that we still give to Art of Charm clients because we don’t want them to shoulder the risk, the burden of the risk. So we would say, “All right. Listen, if you rode the bus and you see people that you want to talk to and they’re not talking to you, it’s not because you’re African, it’s because you live in Norway and people don’t frigging talk to each other on the bus. Nor do they do that in the United States.\u003c/p\u003e\n\u003cp\u003eSo just lean over, and at that point it was whatever he was comfortable with. I mean, some clients it was ask for directions. Other clients were like tell them that you’re new in the country, and you’re having trouble making friends. And he’s like, “Wow, that’s dangerous. That feels dangerous.” And I said, “If it feels dangerous but it doesn’t feel physically dangerous, then just got for it and see what happens. Just don’t get arrested.”\u003c/p\u003e\n\u003cp\u003eAnd so, of course, he did that and he did that for months and months and months. He ended up with this really cool girlfriend. He had a circle of friends, people that he’s met like in libraries and student places, and he wrote me an email years later that, “This has changed my whole life. I never would have been able to assimilate as well as I have”, and it was actually Denmark not Norway, “As I would have without your help. I really appreciate it, and I have a job. I have a family now and all this stuff.”\u003c/p\u003e\n\u003cp\u003eThat was awesome, and that’s what we do, and that’s what I love doing about it. And so it really is courageous to everybody because you can’t give a cookie cutter/answer/cookie cutter solution for every single client that comes through, and that’s why we cap our programs at seven or eight guys. Yet we have like seven coaches because it’s just too [??]\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Seven or eight guys in person?\u003c/p\u003e\n\u003cp\u003eJordan, Right, in our live training, at our school. They stay overnight for the week.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Is that the first thing that you did, took people up on their offer to fly in and learn?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, they flew in and learned, but they didn’t stay with us. And then after that it was fun coaching, and then after that guys were flying in and staying with us. We were based in Manhattan at the time. They would stay in my apartment in Manhattan, and they would sleep there. There were like one or two guys every week because we had no real . . . our audience was tiny, and they would do that, and they would tell their friends.\u003c/p\u003e\n\u003cp\u003eFast forward to now, it’s eight guys, seven or eight guys every single week, four months, six months in advance. But then the season we’re booked out completely.\u003c/p\u003e\n\u003cp\u003eAndrew By the way, that sound, I was looking at you to say, “You’re a pro. Why are you having audio on? You should know not to. If not, you it’s me.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s you, right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s totally me, but that sound is on your site. You have that chatbox where a guy named Ocean Ray [sp] comes in and says, “Hey, welcome. How did you discover the site? It hit me back and, yes, I’m a real person, not a bot. Hey you’ve been here before. I see. You let me know if you need anything. Otherwise, I won’t bug you.”\u003c/p\u003e\n\u003cp\u003eYou guys have your stuff so together, like it’s really a professional operation that it’s hard to now compare today which looks fantastic, where you’re selling something very clearly, which has a phone number at the top . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . has this guy, Ocean, on the bottom who is going to chat with you, when before where you clearly were trying to figure out your way. I’m looking around here. If see my eyes darting everywhere, it’s because . . . there it is. Your tag line, your podcast name was “pickup podcast.” The tag line was “where gurus gather.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. And that was terrible. I mean, I’ll be the first to say, “That’s a terrible name.” But the marketing worked really great because people were looking for that, and we called it hiding the broccoli, right? Because in order to get a kid to eat broccoli which is good for them, you have to cover it in cheese.\u003c/p\u003e\n\u003cp\u003eAnd that’s what we were doing back then, but now we’re refined. Thank God we don’t need to do that anymore because people aren’t looking for quick fixes. They’re not looking for . . . and if they are, they’re not fit for what we do. Back then we were kind of like trying to survive. Now we can filter in people who get it, and by get it they go, “This is a process. It’s going to take work. It’s not about getting a fix. It’s about me, and it’s about the work I’m willing to put in.”\u003c/p\u003e\n\u003cp\u003eWe filter for that now. Back then it was like, “Is this a business? I don’t know. I have a day job. Hopefully, it is.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: When did you know it would be a business?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You know what? Honestly, it took years and years. I’m trying to . . . That’s a good question because I’m thinking about I’d quit law and even then I was like, “Oh, am I going to have to become, like, a school teacher?” Not that there’s anything wrong with that. My mom does that. But am I going to have to get a day job again?\u003c/p\u003e\n\u003cp\u003eAnd the answer . . . eventually, the answer was no, probably like three, four years ago. And that’s probably 50% of the company history was with me spent going, “I just want to work at the Post Office. Those people don’t have that much stress,” which is a lie because they shoot each other. But there was so much stress at points that I wished I was not in business for myself. Now that I literally never wish for that, ever, I mean, at all.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So about three years ago was there . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Four, four, four years ago, yeah, four years ago.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . was there a milestone, a product that you sold that suddenly took you over? Jordan: No, it was we brought in some new blood to the company. We got rid of a lot of dumbass people, if I can say that on your show, that were just, like, value drains, stupid friends that we’d hired that turned out to be more trouble than they were worth. Stuff like that, we got rid of all those people.\u003c/p\u003e\n\u003cp\u003eWe had, finally, our website was working a lot better. Our show audience was growing like crazy. And it was just, all signs were go. And our clients were super satisfied. We weren’t making stupid mistakes anymore due to laziness or incompetence. And I mean, that’s like an ongoing battle whenever you run a team.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So it was just constant, small improvements? I’ll tell you for Mixergy what did it . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . was I was trying to figure out where’s the revenue in doing Mixergy. Otherwise, I either pay for all the work out of my pocket, like pay Joe, the editor, out of my pocket, or I have to close it down. And I didn’t want to do either one. I tried a bunch of different things and then I said, “I’m going to do these small courses.” And one of the first ones was “How to Interview,” and it was like a mini-test course, and people bought it. You were one of the customers who bought it, which . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I bought it, yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . I’m really proud that you did. And that helped take off. That was just the start and then when I switched to memberships so I didn’t have to sell each one individually and deal with all those individual smaller products, life got a whole lot different and now there’s a team here and those two steps were dramatic. You didn’t have anything like that, did you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, no, there was no, like, “Oh, that made everything a lot easier.” I mean, that would be great, that would be cool if we had some major big wins like that, but honestly, one of the things that helped me get to the next level and helped us as a company get to the next level was me realizing that I couldn’t pick up all the slack for any other team members that were slacking and I also couldn’t do everything myself.\u003c/p\u003e\n\u003cp\u003eSo hiring people and getting return on investment beforehand after learning their job was something that I started to replicate. So I did . . . that Ocean Ray guy – that’s a real person, by the way – I did his job for, I think, at least one year, maybe two. That’s why he’s real and talks real, because I wouldn’t outsource to a bot. I want guys with a certain level of competency, I tested them myself, I . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It was you on the popup box.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: For at least a year. I spent 12 hours a day selling.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Who makes the popup box? It’s a good one.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That is Live Chat but our outsourcing company is totally separate. They’re based in Australia. And if anybody . . . honestly, I can’t remember off the top of my head, but if people want to email me personally, am I allowed to do this?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: If they want to email me personally, just email me jordanh@theartofcharm.com and I will introduce you to that plugin and the person that staffs it, because they do a frickin’ phenomenal job.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So it’s a company that staffs it, that learns your product well enough . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . to be able to respond.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Exactly, exactly. And I can call them any time day or night and somebody will answer. And I know the owner and he’s a boss. And the company . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And it’s always Ocean Ray who’s on there?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, it’s, it depends [??].\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And is it really his photo because Ocean Ray looks like a really good-looking guy. That can’t be him.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, he’s like a mofo but the girls’ photos I found are fake, which is highly disappointing.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Okay.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: But yeah, no, we chose, I mean, we selected salesmen with a certain level of English and/or native English but Ocean Ray, honestly, that’s his real name. I told him, “Hey, can you pick a different fake name?” And he was like, “No, because that’s my real name.” And I thought, “Who am I to talk? My last name is Harbinger.” So, you know . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: [laughs] I just sent the one message saying, “What products can I buy?” cause he’s a salesman.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, and I hope he doesn’t disappoint me live on your show cause I’ll be very pissed.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The podcast was the very first thing you created. Not a blog, but a podcast, right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right, yeah, no, the blog was a placeholder that said, “Hey, we have another episode. Click here to download it.” That was the blog.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Mm-hmm. So how did you get so many viewers for or so many listeners for your podcast? You guys are enormous.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, right now I think we’ve got like 800,000. We’re one of the largest shows in iTunes. It’s pretty awesome. I love it. It’s my baby. I’m obsessed with it. I check my iTunes rank every five minutes. But the way that we did it, this is going to sound cliche and dumb, feel free to try and poke holes in it. I am honestly welcoming it. I think putting out consistent quality without trying to be salesy and not trying to be, like, “Here’s a quick fix!” And just telling people like it is.\u003c/p\u003e\n\u003cp\u003eAlso, being authentic in terms of admitting my own shortcomings in every area of my life and probably too publicly? Made us relatable enough that people stuck with us, and giving people things we had tested and not just the latest “flavor of the month” bull crap. That self-help you guys were trying to hock and not hocking those DVDs.\u003c/p\u003e\n\u003cp\u003eAll those DVDs all those products you sell? We gave those away for free, until we weren’t able to any more. Then we removed it from the site. We never sold any of that trash because we didn’t know about it. So people would have to ask for that. Even when we were having links for stuff on our website? We removed those eventually.\u003c/p\u003e\n\u003cp\u003eI remember at one point we were actually giving people refunds when the person who sold them the product wouldn’t give fund, if they found out about it through our site. We cared enough that we didn’t want them to feel burned by their experience with us. I remember refunding a set of DVDs from a company even though they weren’t our DVD’s. People thought we were crazy. But A.J. and I were like, it doesn’t matter. We just want them to be happy with what we’re doing.\u003c/p\u003e\n\u003cp\u003eI think that attitude? As cliche as it sounds and putting out only top- notch stuff as far as we could? Was the best thing ever because what that did is, we have people emailing us every day, ‘I’ve been listening to you for seven years.’ I mean, that’s ridiculous! I haven’t done anything for seven years other than wake up in the morning. That’s as consistent as we have been and podcasting is the only other thing.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So being good to your audience. But was there something that you did? I know one of the things that you told April Dykeman, here on the research staff at Mixergy you said, “You emailed blogs and you got on message boards and you started asking for links, back in the time when it worked?”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Back in the day, and you remember this and probably very few other listeners do, blogs were something you did because you actually liked it. You didn’t care if you never became a millionaire off the damn thing. So, I would email everybody in our niche and outside the niche and say, hey I’ve got this show and it’s all about becoming a better guy. Would you check it out and/or link to it? I stayed up until 5 a.m., probably for four straight months during the summer and I emailed every, single blog I could find.\u003c/p\u003e\n\u003cp\u003eProbably, high double-digit, low three-digit number of blogs were, like, ‘Sure.’ and they linked to us and that built our original audience. People are always asking me, “Oh man, what’s the way to get podcast listeners?” I’m, like, I don’t know, I did it eight years ago and it was a crap load of work that, quite frankly you’re probably not willing to do. And people don’t like that answer but that’s the truth.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Why is Lewis Howes sending you so much traffic?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Is he? I didn’t know that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. What’s the connection with Lewis’ site?lewishowes.com, I looked at your. I have a similar web account and I’m looking to see where your traffic is coming from, to get a sense of it. I see pick-up artist, pickuppodcast.com is sending you traffic but that makes sense,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s our [??], yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: because your URL is out there, people are typing it in and they get redirected [anyway]. feedlead of course makes sense because that’s a feed, ourassessreader, and leapdaily maybe, maybe not and then Lewis Howes in the fourth slot. I’m wondering did you do an interview with Lewis? Is that what happened?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Yeah. Lewis is a good buddy of mine, real cool cat, a sharp dude. He interviewed me pretty recently so that’s probably why it’s fresh. I think if you did your way-back machine on the stats, you’d probably see some other large show that I went on recently.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s the thing. It seems like going on other podcasts also helps you guys.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh yes, of course. The trick is though, you’ve got to deliver good stuff. If you go on a large podcast and go, “Everybody go to my website right now!” No one is going to give a crap. The host is going to hate you and maybe never air the show. But, yeah, if you go on and deliver something really good that people can use and you show that you care, like we try to every, single time. Then, yeah, people will come on over. I know that Lewis is sending us traffic. I just didn’t know it was that much. I don’t pay attention to that stuff. I’m supposed to but I don’t.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: But you do take a look at your rankings on iTunes?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: iTunes. That’s kind of like the weavy measuring of the podcast world. It’s like where you are. I want to make damn sure I’m number one in self-help. I want to make damn sure I’m in the top five in health. I want to make damn sure I’m in the top 100..\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So what do you do if tomorrow you wake up and you’re number three? What do you do to fix it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s a great question. What I would do, I would reach out to my network and say, ‘Hey, I know you’ve been trying to interview me for a while. I would love to come on. Or I would get a high-profile guest and I would interview them. Honestly though, what I typically do is call Apple is the unfair advantage that I have now I’ve been doing this for a long time. I call Apple and I say, “Hey, who would you like to see me interview? I’ve got these ideas and who would you like to see me interview? I’ve got these ideas and who would you put on the front page of iTunes?” And they give me a list out of that list. Then I call those people’s PR. Have my people call their people, you know. Then we set it up. Then I go on the front page of iTunes. [??]\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Who’s a big name that Apple said if you interview them then it’s a good reason to be on?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Robert Green was a good one. Also because he was our episode 250 which was our seven year anniversary of the show. So that was met with approval. I’ve had quite a few features go up in the front page of Apple. I’ve got some guys coming out in the next few months that I’m not supposed to talk about because they’re not up there yet.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Give me a past guest who was especially popular and got you featured.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Robert Green was the most recent one that got me featured.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You know what’s great about Robert Green? I believe I interviewed him and I believe, I believe what Ryan Holiday who works for him did was I think he paid to buy ads to send them to Robert’s interview on Mixergy. And if he didn’t buy ads, he did something. Ryan Holiday did something. He does something to promote his guys.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I don’t know if that happened to you, but they don’t just send Robert Green on. They make sure Robert Green kills.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Well, no. I’m friends with Robert Green so I literally just called him and was like, “Hey. This has been a long time in the making. Why don’t we do this show finally? Oh, also I want to put it on the front page of iTunes.” Which is a great way to get a guest.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Got you. So you then email them back or call them back and then they get you on the list. So interviewing is a good one. Interviewing people who are well known. Asking others to interview you. Working the blogs back then made sense. Today you have to be a lot more PRy about it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Unfortunately.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And I’m trying to think if there’s anything else that I can see from here. Are you buying ads?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I can’t find any ad buys.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You will not find any ad buys, my friend.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I don’t see…here’s the search terms that seem to do well. Obviously The Art of Charm, The Art of Charm. Jordan Harbinger. People are typing in your name. How to turn a girl on over text?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sweet.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right. And the reason that is doing well is you have this, according to my friend, Ocean Ray, you have a book on that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes, we do.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: For a hundred bucks I could buy the book that shows me how to text women.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Holly crap. That’s expensive. I wrote that thing a long time ago. It’s a good book, but apparently we raised the price.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Let me see. Is it? It is that. So you’re doing the events in person. Ninety-seven dollars. There it is. Will get me started immediately. You do any events in person?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Then the next big product that you sell is?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The next big product. We have a book called “Attraction Alchemy.” That comes with some phone coaching that I think is 247. And then we’ve got our membership site. That’s 67 bucks a month. That’s good because it gets you interacting with people. But honestly if I’m being fully a hundred percent transparent, you can only learn so much from an online product or a website. It’s like riding a motorcycle…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You got to come in person.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You got to come and learn it from people. Or you got to at least talk to us.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And it’s less than or fewer than ten people who will be there. By the way, it’s called The Art of Charm Academy. I can sign up for a buck to get started. And then it’s what? Sixty-seven bucks a month after, right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s the membership site.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s the membership site.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And all that stuff comes with your live programs. A lot of people are like, “I’m going to get started with this.” I’m like, “Great. But you’re just wasting time and telling yourself you’re making progress.”\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Whereas if I come into the live program I also get the membership.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You get everything.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What does the live program cost?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It depends. They range from four to eight thousand.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Four to eight thousand.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And we’re raising prices this summer, but yeah. And what, sorry?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What do I learn or that?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: We take you through the ringer. It’s six days. It’s accommodation in LA. It includes all the expenses except for flight and food. We take you through banter, starting conversations, generating report. We videotape you in interactions with other people. Then we go through the tape with you. We let you see the way that you interact with others. The way that you show up to others. We help you tweak that in an authentic way. We go through a lot drills and exercises that help expose insecurities or things that you’re dealing with. We help break those down so that they’re not sticking points anymore. We teach you how to deal with difficult people. We teach you persuasion, association. It’s huge.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I can use it for dating, but it’s beyond dating too.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, yeah. It’s beyond dating. It’s well beyond.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You guys haven’t fully moved beyond dating. Dating is still there.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh yeah. It’s still there.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s clearly dating.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Okay. What is this eBook that you acquired for 30 thousand dollars? Because apparently something happened there.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: eBook that we acquired…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You decided to come up with an eBook. Had acquired it for 30 thousand and the team that created it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Thirty thousand bucks.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No? Here’s what you told April. She asked you about the lowest point. We do pre-interviews and research.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, the guy stole it and it was worth that much. We had invested 30 grand.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Got it. So when you say you acquired it for 30 thousand, that means how much…So if you’re writing an eBook, how does it cost 30 thousand dollars?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It’s marketing and the salaries of all the people that were involved with it over a longer period of time and all the tech behind it. It wasn’t the eBook. No we didn’t acquire it for 30 grand. I would never pay 30 grand for an eBook.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And then what happened?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Well, they decided, hey, Jordan, AJ, all those guys do is sit and collect checks because we don’t really understand their job. We’re just going to take this website and we’re going to take this IP, Intellectual Property, the book and associated content and we’re just going to sell them, and we’re going to keep the money, and screw you.\u003c/p\u003e\n\u003cp\u003eThat really sucked. That was like the worst because those guys were, or so I thought, we were friends. I had paid them. Paid for their living expenses in New York. I had paid for them places to live, but I kind of after a while realized that I was dealing with people that were, like, . . . and this is 20/20 hindsight. This is not something I came to right away.\u003c/p\u003e\n\u003cp\u003eThese guys really never wanted to build what we wanted to build. They just wanted income. They just wanted a way out of the grind. They wanted hope because they had nothing else going on. Looking at what they’re doing now they’re literally in the same position they were six years ago. I was mad about it for so long, and now it’s just, like, nah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Who are they?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I can’t name names. I won’t name names. It’s just like a dick thing to do.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: This got really bad. Your hair was starting to falling out in the shower.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, my God. Yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You started to obsess. How do you resolve something like this?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I was so stressed that, this is, again, five years ago. I was so stressed. I was taking showers. My hair was falling out. I was freaking out. We were in court all the time. I was just this big mess. You know what? I decided to stop worrying about it because there was nothing I could do. I realized that I’d gotten this far. My team was really great. We were like a family.\u003c/p\u003e\n\u003cp\u003eI was very distraught with what happened, but I realized everybody’s who’s left are the people who are willing to be around through thick and thin. Because if they’re putting up with this now this is a lean time. We were dead in the water. It was the worst thing ever. They’d had gone on and done things and they had been broadcasting like they were doing something really great.\u003c/p\u003e\n\u003cp\u003eThen as time wore on we kept our heads down in the trenches and just kept building what we were doing at the [??] charm. We ended up fine. Then we look back at what they were doing and we realized, wow, they’re still living on people’s couches and have no money. It’s just, like, what was I worried about that whole time. That galvanized me in a lot of ways.\u003c/p\u003e\n\u003cp\u003eNot in the way where I’m, like, everything is a transaction and screw everyone, but where I’m, like, ah, everybody’s got their own crap in their head. Everybody thinks they’re doing the right thing and if they don’t, it’s just doesn’t matter. You can’t get wrapped up in their shit. If you do it will drown you. I can try to carry everyone’s brick, but what you need to do, if you have a vision, if you want to leave that legacy, if you want to build a company you cannot get wrapped up in the drama. You just can’t. It will kill you. It will kill your company anyway.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I was doing some searches to see if I could find out exactly what happened. I’m sure I could, but it’s not worth getting into them. Where is self-help in the podcast directory? I’m now in the podcast directory to see where you’re ranking and . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Under self-help.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Under self-help. I don’t see self-help. I see science, societies, sports. It’s under . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Do you see health?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sorry?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Health. Go click on health.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There’s health. Okay.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. You see, Tucker Maxes [??]. That’s trending right now. It will be gone later. Then savage love cast, which is, Dan Savage. He’s always on top. He’s a New York Times Syndicated Columnist. He’s great at what he does. Then there’s us. Then if you go to the sub-category . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, yeah. Here we go. Now I see the top, under health. It’s like you said, it’s the Mating Grounds by, Tucker Max, his new one, Savage Love Cast, and then number three, Heart of Charm and right below is, Juliane Michaels Show.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Right, Jillian Michaels, yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Jillian, excuse me. What is it with all these people who created podcast? I think they are over estimating the power of just throwing up a podcast.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, yeah. Podcasting right now is like the trendiest thing that you can do. It’s trendy among internet marketers. It’s trendy among authors. It’s very powerful, but here’s the thing. It’s a very double edged sword. If you’re an author and you start a podcast and you freakin’ suck at it, like a lot of them do, all the editing in the world is not going to make you more interesting, unfortunately.\u003c/p\u003e\n\u003cp\u003eThere’s a lot of authors that are not that interesting other than when they write. They don’t have podcast. Those that do I feel like they [??] their material.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I think we might be limiting ourselves by saying podcast . . .\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I’m sure.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: . . . because go through the streets of San Francisco, ask someone to show you how they install a podcast on their phone. Most people don’t freakin’ understand what it is.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: [??]\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes, there are programs like Stitcher that make it more accessible. Ask someone about Stitcher and they’re going to tell you about Pandora. That’s what they listen to not Stitcher.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: These guys see that you do well and they want to jump in there and they think that it’s going to be a snap.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Because they’re trying to mimic you, I think, not just you. They’re trying to mimic a couple of other successful podcast. Because they are blinding themselves the power of going to YouTube.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Going to Text and Edition, all those other things. Let me do a quick plug here that I should have done really earlier in the interview. Then I want to follow up and ask you one or two more important questions. The plug is for Andrewswelcomegate.com, Andrewswelcomegate.com. Why? Because, here’s the thing, you need to find the same thing all of us entrepreneurs need. We need audience to take action. A specific kind of action.\u003c/p\u003e\n\u003cp\u003eEither go and buy or give us their email address or download a podcast. All those things take so much psychological understanding of what’s going on in the user’s head. What they’ve seen before. How to get them to sign up. All that stuff is pretty complicated. You can spend a lot of time doing it. Or you can just go to Lead Pages where they have the templates already set up. Where it’s all prepared to allow you to easily get the sale or get the email address. Because the guy behind it, Clay, is really obsessed with it. And they have tons of templates that will allow you to collect email addresses to close sales, etc.\u003c/p\u003e\n\u003cp\u003eOne of those templates is my very own template. The one that I created for Mixergy. It took me a couple of years to get right. It took me a lot of time to increase conversions on. But it’s there and it works and it’s available to you right now if you sign up for Andrewswecomegate.com. It’s going to cost you a buck. LeadPages will power it. So you don’t even have to know how to add it to a WordPress site or to another site. But if you do, you can easily add it to WordPress. I know I have. You can easily add it to, frankly if you have no site you can do it. Or if you just have a URL and you want to point it over.\u003c/p\u003e\n\u003cp\u003eIt’s all available to you if you go over to Andrewswelcomegate.com. It’ll work instantly. You’ll be amazed by how many email addresses you get. How many relationships you end up building with people who would otherwise just turn out to be hits. You know, just hit on the website. Not enough, you want a real relationship. That starts with someone joining your mailing list and you continuing the conversation that way. Andrewswelcomegate.com, it’ll work.\u003c/p\u003e\n\u003cp\u003eFrankly I’m a little worried, Jordan, that’s it’s going to work too well. Because I get a lot of my email addresses from people that go to my welcome gate who give me their email addresses. I’m a little concerned that by giving it to Clay who’s going to give it to everyone else that it might lose its power.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You might be right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, it might. And if it does then there’s a reason why it’s Andrewswelcomegate.com. I can always say, “All right, let’s delete the URL.” Then no more new people can have it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. Or you could just innovate and get something that works even better.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Innovate. You out of your freaking mind? I got that working, can’t I just live off that for the rest of my life?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You can. You can try. You can see how…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What do you think of people who talk about this…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Passive income?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Passive income. Create…\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I knew you were going to say that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: …that runs while you’re sleeping.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s a bunch of crap. Ever look at Pat Flynn, runs Smart Passive Income. He’s so smart. He works eight hours a day.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The guy works really hard.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: He works really hard.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I rejected his interview because when people suggested it because I said I don’t want to promote this idea of passive income. And then I came on here and the first question out of my mouth was about this passive income being a crock and why I didn’t have him on before. And he explained what he was talking about. It’s not this don’t ever work mentality that other passive income people have. I think maybe I read too much into the title of the site.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Well yeah. I mean if you think about it the guy who wrote the four hour work week works at least 40 hours a week I would say. So how’s that working out. And all those people that try to work four hours a week they’re broke and living in their mom’s basement. So you know, scoreboard.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There is no passive income in this I don’t believe anyway. In the sense that you put a website up and the thing just works. People can look back and say, “Oh, Jordan doesn’t even have to man the live chat box.” No, but Jordan does. What do you have to do now or else the business is going to fail?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Sure. So everyday I’m hustling. I’m always on other shows. I’m always recording top notch hopefully content for The Art of Charm. I proof all the emails, well most all the emails that go out with my name on it because I don’t want that to be crumby. I do a lot of media and PR. I’m always training our sales guys on the little live chat thing. I always do a ton of customer service stuff.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What’s media and PR for you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What’s that?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What’s media and PR?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: So it seems like every day that somebody’s like, either another podcast or some sort of Ink magazine thing like, “We want to learn how you earn money digitally.” Or whatever the latest thing is. I get those opportunities all the time. I do a lot of networking where I talk to people and develop relationships. Try to help as many people as possible.\u003c/p\u003e\n\u003cp\u003eI also do coaching and consulting on my own, of course. About everything from podcasting to helping clients who are looking for advanced social skills for whatever purpose they want. Lawyers, doctors, special forces guys, people who need to negotiate things. Those people they all come to us. So I’m on the hook for that. There’s no such thing as passive income. Honestly I wish there was a such thing as a 40 hour freaking work week for me sometimes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Forty hours would be nice.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Forty hours, yeah.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I mean, I’m usually great because I’m flexible with my time off. But I certainly don’t have this overabundance of time off where I just don’t know what to do with myself. People who tell you they’re doing that are either not making that much money or they’ve made money and they’re coasting on it or they’re full of crap. Usually it’s some mix of those three things.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Alright. Here’s where I wanted to end it. April said I got to ask you about going to North Korea.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Ah, yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: She doesn’t even have to say I got to ask you about going to North Korea. If I hear that you went to North Korea three times and you’re planning to return. I am going to have to ask you about that. Bill Clinton in 2009 had to fly into North Korea to rescue someone who was trapped there. Aren’t you worried you’re going to get trapped in North Korea?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I have been worried about that in the past. Yes. But I’ve run towards there. I’ve got enough decent connections with people there that I’m just hoping I don’t have to call Uncle Bill to come fly in and rescue me.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Because he’s not going to rescue you. Imagine Bill Clinton with his problems with women, is going to fly and save the guy who used to have a [poo-op] podcast? Forget it! He can’t do it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: How do you think he got out of that rut? Honestly, I don’t think that it’s going to be an issue. I’m no causing any trouble. I bring the tourist industry there and a lot of engagements which is what they are after. I keep my mouth shut and keep my head down.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Does the U.S. allow you to go to North Korea?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: How?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Hey, I do a show and run a business about generating relationships. They love the fact that I do that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: The U.S. is okay with you going to North Korea?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: They are 100% okay with it and they’re 100% with tourist going there as well. It’s easy for me to get an American visa to North Korea. It’s a snap and it’s completely legal.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Wow! And there is no embassy there. In case you run into trouble, what do you do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: There is a Swedish Embassy which has some a U.S. intersection that will help us out when we need it. But honestly the tours there are controlled, they are strictly guided. Our guides there know us, it’s not a big deal. It’s really not s big deal. We’re not there handing out freaking bibles and we’re not there with shotgun microphones and taking secret footage. We’re going through the motions and it’s fascinating but it’s certainly not controversial for them.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: If you get caught in North Korea and can’t come out and A.J. needs a new partner, will you be insulted if I ask him to partner up with him on the business?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, go ahead. Please do, keep it running.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Okay. Eventually insulted if I run edited excerpts of you in the end saying North Korea is a very safe place just so I can juice-up my traffic?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, no, go for it, man. Here’s the thing, it’s a very safe place for tourists because all the criminals are dead. They’re breaking rocks in the gulag somewhere. It’s not safe politically. I would say that if you want to go, it’s the adventure-ish type thing of the edgy tourist, but I wouldn’t want to set up shop there any time soon. I think it might be a little bit sketchy.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That seems amazing. I can’t believe it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It is amazing. I take a lot of entrepreneurs there. You should go.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I’m a little afraid. To be honest, I would like to go.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: People you know are going.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: For example?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Oh, we can talk of it. I got to get their permission. I don’t know if they want me to blab all over the place.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Do you feel a little bit violated that I started out this interview by asking you about the cheese?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No! The cheese is totally fair game. I think it illustrates, here’s the thing, you’re never going to be so set that you don’t have to hustle. If you look at Mark Cuban on Shark Tank. That guy is not like, “Oh, screw it, I’m so rich I don’t give a crap!’ No, the dude is hustling. Everybody “on top is hustling. They get there by hustling, they stay there by hustling. There’s not a whole lot of [cursing] going on by people who actually earn their money as far as I’ve seen.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And I’ve seen you hustle for a long time and it’s great to have had you on here. How do you feel it went?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I think it was cool. This is a good milestone for me personally because I emailed you a shit load back in the day. And somebody was, ‘Man, no thanks’. And that was fine.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: No, back then it was me that was ‘no’ somebody. I think I just looked at it and I said, all he must be doing is pick up artist stuff. I don’t know if there’s anything to this. I’m looking at the email here, we’ve got emails going back to 2010 maybe even before then.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah. So, I was Pat Flynn 1.0, you were like, I’m judging a book by its cover. No thanks!\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Totally. But the thing is, sometimes I feel really bad I say, “Why am I saying no to this guy?’ Jordan is obviously a good guy. Especially after Scott, I was starting to feel bad.” Then I say, “There is no perfect way to do this right. I have to just trust that I get it right most of the time and learn when I don’t.” If I look and say what can I learn from this it’s that I could of looked beyond the topic. I could of looked a little more in-depth and said, “What’s here?” But you know what?\u003c/p\u003e\n\u003cp\u003eI don’t know how I would have found out because you weren’t at the top of the podcast list at the time. If I look at your traffic numbers? Frankly, they don’t show much. If I look at your site, I don’t know how I would find out. The only way that I could find out for sure is, I’m looking at my inbox under your name. The other thing I see come up a lot is people like Kelly [Acevedo] saying, “You should meet these guys” and telling me in person like, John Corcoran and a couple of others. That’s the only way, frankly, that I know. I can’t tell otherwise.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, we come highly recommended. Honestly, if I took the first ‘no’ for an answer, I wouldn’t be anywhere right now.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I’m not being defensive, I’m just saying, I think I’m trying to make myself feel a little bit better, because I do feel bad about that. I feel bad when I get it wrong with people. Especially, in this case it didn’t have to happen, but sometimes I then have to go and beg people to come back on, you know people who look at my inbox to find their email. I see, oh right we said no in the past.\u003c/p\u003e\n\u003cp\u003eThat’s why I say no matter what you really can’t predict who’s going to do well in this business. You always have to just … even if we turn someone down I tell everyone on the team. We’re not turning them down forever, we’re going to beg them in the future.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Well, I appreciate you begging me to come back on this show.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I’m really grateful for you for being on here. And I really enjoyed our conversation in private apart from this. I would not reveal anything including the cheese without our permission. And you know that none of the other cool stuff that we talked about was revealed publically. And I hope it’s not going to be the last time that we get together.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I agree, well of course we’ll hang we’re in the same city. I was thinking if you were set up for it we could do this face to face but it’s just not, we’re both in small rooms right now.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: You know, I think it was hard to do it face to face it so much easier to do it this way. The editing comes up really fast. And frankly also if you see my eyes dart around it’s because when you say something I quickly go and check it out. And see what else can I go? What other information can I get? And it’s kind of awkward to do that in person.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: I agree, the only real downside to doing it in separate locations is I have to drink my own Scotch instead of yours.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: And I’ve got a really good collection here. It’s mounting. You know what just before my baby was born I built such a great collection at home and now I don’t even know when I’m going to get a drink at home. But I do it here in the office from time to time still.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yeah, well excellent you’re biking distance from me, so I’ll see you soon.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: All right, I’d love it. Thank you for doing this interview everyone out there thank you for being a part of it. Jordan actually gave his email address so when I tell you all the time that the first way to start a conversation with someone who you’ve heard on Mixergy or seen do something credible at a conference or write a good blog post or a book.\u003c/p\u003e\n\u003cp\u003eWhen I tell you what you should do is email them or phone them or tell them in person, thank you. Usually I give you a little bit of homework, right. You have to go and look for it, in this case all you have to do is just scroll up in the transcript and his email address is right there.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That’s right.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: when you do that, when you say thank you. You end up setting the foundation for a relationship that often, often you can draw on in the future. Often starts out so well that you’ve warmed up the conversation with them for the next time. If you ever see Jordan in person don’t be afraid to interrupt and say, hey. Because apparently interrupting is okay if it’s an introduction.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: It is, it’s okay. In fact it happened to me in Starbucks today.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Somebody recognized you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Are you Jordan Harbinger? And I went … I look around like I’m on ”Punked” because you know who does that? When does that ever happen? But it’s awesome.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: That is such a frickin cool thing. It’s one often best [??] about doing this. So I guess I can understand why Max …. Why Coco Max would want to do a podcast and all those other people. It is an awesome bi- product.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Yes, agreed. I’m sure he get recognized it’s on he’s on the cover of his own book.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: He’s on the cover of the book. Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJordan\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: Exactly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eAndrew\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: All right, thank you so much for being a part of it. Thank you all to bye.\u003c/p\u003e\n\t\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "83 min read",
  "publishedTime": null,
  "modifiedTime": "2019-06-14T17:56:26Z"
}
