{
  "id": "52a5e1cc-18f9-4c92-b269-5a64f9baf1fb",
  "title": "Oil prices rise more than 4% on escalating U.S.-Iran tensions",
  "link": "https://www.cnbc.com/2025/06/11/oil-prices-rise-more-than-4percent-on-escalating-middle-east-tensions.html",
  "description": "The U.S. is preparing to evacuate all non-essential personnel from its embassy in Baghdad, two State Department officials told NBC News.",
  "author": "",
  "published": "Wed, 11 Jun 2025 22:40:54 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Spencer Kimball",
  "length": 2248,
  "excerpt": "The U.S. is preparing to evacuate all non-essential personnel from its embassy in Baghdad, two State Department officials told NBC News.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "People walk past an anti-US mural on a street in Tehran, Iran, June 5, 2025. Majid Asgaripour | Via ReutersCrude oil futures rose more than 4% on Wednesday as tensions escalated between the U.S. and Iran, with President Donald Trump expressing doubt that the two countries will reach a nuclear deal.Brent crude futures rose $2.90, or 4.3%, to close at $69.77 a barrel. U.S. West Texas Intermediate crude gained $3.17, or 4.9%, to settle at $68.15.The U.S. is preparing to evacuate all non-essential personnel from its embassy in Baghdad, two State Department officials told NBC News without elaborating on the reason. Trump is \"committed to keeping Americans safe, both at home and abroad,\" a third State Department official said. \"In keeping with that commitment, we are constantly assessing the appropriate personnel posture at all our embassies,\" the official told NBC News. \"Based on our latest analysis, we decided to reduce the footprint of our Mission in Iraq.\"Meanwhile, United Kingdom Maritime Trade Operations, a Royal Navy unit that exchanges information between commercial shippers and military forces, warned of increased tensions in the region that could lead to an \"escalation of military activity.\"Trump said he is losing confidence that the U.S. and Iran can strike a deal over the Islamic Republic's nuclear program that would avoid a war in the region.\"They seem to be delaying, and I think that's a shame, but I'm less confident now than I would have been a couple of months ago,\" Trump told the New York Post in a story that published early Wednesday. \"Something happened to them, but I am much less confident of a deal being made.\"Trump told the Post that Iran will not acquire a nuclear weapon, \"but it would be nicer to do it without warfare, without people dying.\"\"But I don't think I see the same level of enthusiasm for them to make a deal,\" the president said. \"I think they would make a mistake, but we'll see. I guess time will tell.\"Iran's defense minister, meanwhile, warned that U.S. bases in the region are within reach of the Islamic Republic's military, according to the state Islamic Republic News Agency. Tehran would not hesitate to target all U.S. bases in the region, Brigadier General Aziz Nasirzadeh said.",
  "image": "https://image.cnbcfm.com/api/v1/image/108155200-17491313752025-06-05t133616z_1399101084_rc2dweacwvjo_rtrmadp_0_iran-usa-trump.jpeg?v=1749131424\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108155200\" data-test=\"InlineImage\"\u003e\u003cp\u003ePeople walk past an anti-US mural on a street in Tehran, Iran, June 5, 2025. \u003c/p\u003e\u003cp\u003eMajid Asgaripour | Via Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eCrude oil futures rose more than 4% on Wednesday as tensions escalated between the U.S. and Iran, with President Donald Trump expressing doubt that the two countries will reach a nuclear deal.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.cnbc.com/quotes/@LCO.1/\"\u003eBrent\u003c/a\u003e crude futures rose $2.90, or 4.3%, to close at $69.77 a barrel. U.S. \u003ca href=\"https://www.cnbc.com/quotes/@CL.1/\"\u003eWest Texas Intermediate\u003c/a\u003e crude gained $3.17, or 4.9%, to settle at $68.15.\u003c/p\u003e\u003cp\u003eThe U.S. is preparing to evacuate all non-essential personnel from its embassy in Baghdad, two State Department officials told NBC News without elaborating on the reason. Trump is \u0026#34;committed to keeping Americans safe, both at home and abroad,\u0026#34; a third State Department official said. \u003c/p\u003e\u003cp\u003e\u0026#34;In keeping with that commitment, we are constantly assessing the appropriate personnel posture at all our embassies,\u0026#34; the official told NBC News. \u0026#34;Based on our latest analysis, we decided to reduce the footprint of our Mission in Iraq.\u0026#34;\u003c/p\u003e\u003cp\u003eMeanwhile, \u003ca href=\"https://www.ukmto.org/about-us\" target=\"_blank\"\u003eUnited Kingdom Maritime Trade Operations\u003c/a\u003e, a Royal Navy unit that exchanges information between commercial shippers and military forces, warned of increased tensions in the region that could lead to an \u0026#34;escalation of military activity.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump said he is losing confidence that the U.S. and Iran can strike a deal over the Islamic Republic\u0026#39;s nuclear program that would avoid a war in the region.\u003c/p\u003e\u003cp\u003e\u0026#34;They seem to be delaying, and I think that\u0026#39;s a shame, but I\u0026#39;m less confident now than I would have been a couple of months ago,\u0026#34; Trump told \u003ca href=\"https://nypost.com/2025/06/11/us-news/trump-tells-post-hes-less-confident-about-iran-deal-but-vows-mullahs-wont-get-nukes/\" target=\"_blank\"\u003ethe New York Post\u003c/a\u003e in a story that published early Wednesday. \u0026#34;Something happened to them, but I am much less confident of a deal being made.\u0026#34;\u003c/p\u003e\u003cp\u003eTrump told the Post that Iran will not acquire a nuclear weapon, \u0026#34;but it would be nicer to do it without warfare, without people dying.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;But I don\u0026#39;t think I see the same level of enthusiasm for them to make a deal,\u0026#34; the president said. \u0026#34;I think they would make a mistake, but we\u0026#39;ll see. I guess time will tell.\u0026#34;\u003c/p\u003e\u003cp\u003eIran\u0026#39;s defense minister, meanwhile, warned that U.S. bases in the region are within reach of the Islamic Republic\u0026#39;s military, according to the state \u003ca href=\"https://en.irna.ir/news/85858655/Defense-Minister-warns-Any-aggression-will-force-U-S-withdrawal\" target=\"_blank\"\u003eIslamic Republic News Agency\u003c/a\u003e. Tehran would not hesitate to target all U.S. bases in the region, Brigadier General Aziz Nasirzadeh said.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-06-11T19:24:08Z",
  "modifiedTime": "2025-06-11T22:40:54Z"
}
