{
  "id": "5379bf67-15d6-4f68-a3e4-1e75d413c078",
  "title": "Syria rebels celebrate in captured Homs, set sights on Damascus",
  "link": "https://www.investing.com/news/world-news/syria-rebels-celebrate-in-captured-homs-set-sights-on-damascus-3760315",
  "description": "",
  "author": "Reuters",
  "published": "2024-12-08 00:52:17",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 5001,
  "excerpt": "Syria rebels celebrate in captured Homs, set sights on Damascus",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Suleiman Al-Khalidi and Timour Azhari AMMAN/BEIRUT (Reuters) -Syrian rebels announced they gained full control over the key city of Homs early on Sunday after only a day of fighting, leaving President Bashar al-Assad's 24-year rule dangling by a thread as insurgents marched on the capital, Damascus. Thousands of Homs residents poured onto the streets after the army withdrew from the central city, dancing and chanting \"Assad is gone, Homs is free\" and \"Long live Syria and down with Bashar al-Assad\". Rebels fired into the air in celebration, and youths tore down posters of the Syrian president, whose territorial control has collapsed in a dizzying week-long retreat by the military. The fall of Homs gives the insurgents control over Syria's strategic heartland and a key highway crossroads, severing Damascus from the coastal region that is the stronghold of Assad's Alawite sect and where his Russian allies have a naval base and air base. Homs' capture is also a powerful symbol of the rebel movement's dramatic comeback in the 13-year-old conflict. Swathes of Homs were destroyed by gruelling siege warfare between the rebels and the army years ago. The fighting ground down the insurgents, who were forced out. Hayat Tahrir al-Sham commander Abu Mohammed al-Golani, the main rebel leader, called the capture of Homs a historic moment and urged fighters not to harm \"those who drop their arms\". Rebels freed thousands of detainees from the city prison. Security forces left in haste after burning their documents. The battle for control of the country is likely to turn quickly to the capital. Residents of numerous Damascus districts turned out to protest Assad on Saturday evening, and security forces were either unwilling or unable to clamp down. Syrian rebel commander Hassan Abdul Ghani said in a statement early Sunday that operations were ongoing to \"completely liberate\" the countryside around Damascus and rebel forces were looking toward the capital. In one suburb, a statue of Assad's father, the late President Hafez al-Assad, was toppled and torn apart. The Syrian army said it was reinforcing around Damascus, and state television reported on Saturday that Assad remained in the city. Outside the city, rebels swept across the entire southwest over 24 hours and established control. EXISTENTIAL THREAT TO ASSAD RULE The fall of Homs and threat to the capital pose an immediate existential danger to the Assad dynasty's five-decade reign over Syria and the continued influence there of its main regional backer, Iran. Foreign officials said the government may be on the verge of collapse. One U.S. official put the timeframe at five to 10 days, while another said Assad could be ousted within the coming week. The pace of events has stunned Arab capitals and raised fears of a new wave of regional instability. Qatar, Saudi Arabia, Jordan, Egypt, Iraq, Iran, Turkey and Russia issued a joint statement saying the crisis was a dangerous development and calling for a political solution. But there was no indication they agreed on any concrete steps, with the situation inside Syria changing by the hour. Syria's civil war, which erupted in 2011 as an uprising against Assad's rule, dragged in big outside powers, created space for jihadist militants to plot attacks around the world and sent millions of refugees into neighbouring states. Hayat Tahrir al-Sham, the strongest rebel group, is the former al Qaeda affiliate in Syria regarded by the U.S. and others as a terrorist organisation, and many Syrians remain fearful it will impose draconian Islamist rule. Golani has tried to reassure minorities that he will not interfere with them and the international community that he opposes Islamist attacks abroad. In Aleppo, which the rebels captured a week ago, there have not been reports of reprisals. When asked on Saturday whether he believed Golani, Russian Foreign Minister Sergei Lavrov replied, \"The proof of the pudding is in the eating\". Lebanon's Iran-backed Hezbollah group withdrew from the Syrian city of Qusayr on the border with Lebanon before rebel forces seized it, Syrian army sources said on Sunday. At least 150 armoured vehicles carrying hundreds of Hezbollah fighters left the city, long a point on the route for arms transfers and fighters moving in and out of Syria, the sources said. Israel hit one of the convoys as it was departing, one source said. ALLIES' ROLE IN SUPPORTING ASSAD Assad long relied on allies to subdue the rebels. Russian warplanes conducted bombing while Iran sent allied forces including Hezbollah and Iraqi militia to reinforce the Syrian military and storm insurgent strongholds. But Russia has been focused on the war in Ukraine since 2022 and Hezbollah has suffered big losses in its own gruelling war with Israel, significantly limiting its ability or that of Iran to bolster Assad. U.S. President-elect Donald Trump has said the U.S. should not be involved in the conflict and should \"let it play out\".",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEKB60BW_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Suleiman Al-Khalidi and Timour Azhari\u003c/p\u003e \u003cp\u003eAMMAN/BEIRUT (Reuters) -Syrian rebels announced they gained full control over the key city of Homs early on Sunday after only a day of fighting, leaving President Bashar al-Assad\u0026#39;s 24-year rule dangling by a thread as insurgents marched on the capital, Damascus. \u003c/p\u003e \u003cp\u003eThousands of Homs residents poured onto the streets after the army withdrew from the central city, dancing and chanting \u0026#34;Assad is gone, Homs is free\u0026#34; and \u0026#34;Long live Syria and down with Bashar al-Assad\u0026#34;. \u003c/p\u003e \u003cp\u003eRebels fired into the air in celebration, and youths tore down posters of the Syrian president, whose territorial control has collapsed in a dizzying week-long retreat by the military. \u003c/p\u003e \u003cp\u003eThe fall of Homs gives the insurgents control over Syria\u0026#39;s strategic heartland and a key highway crossroads, severing Damascus from the coastal region that is the stronghold of Assad\u0026#39;s Alawite sect and where his Russian allies have a naval base and air base. \u003c/p\u003e \u003cp\u003eHoms\u0026#39; capture is also a powerful symbol of the rebel movement\u0026#39;s dramatic comeback in the 13-year-old conflict. Swathes of Homs were destroyed by gruelling siege warfare between the rebels and the army years ago. The fighting ground down the insurgents, who were forced out. \u003c/p\u003e \u003cp\u003eHayat Tahrir al-Sham commander Abu Mohammed al-Golani, the main rebel leader, called the capture of Homs a historic moment and urged fighters not to harm \u0026#34;those who drop their arms\u0026#34;. \u003c/p\u003e \u003cp\u003eRebels freed thousands of detainees from the city prison. Security forces left in haste after burning their documents. \u003c/p\u003e \u003cp\u003eThe battle for control of the country is likely to turn quickly to the capital. Residents of numerous Damascus districts turned out to protest Assad on Saturday evening, and security forces were either unwilling or unable to clamp down. \u003c/p\u003e \u003cp\u003eSyrian rebel commander Hassan Abdul Ghani said in a statement early Sunday that operations were ongoing to \u0026#34;completely liberate\u0026#34; the countryside around Damascus and rebel forces were looking toward the capital.\u003c/p\u003e \u003cp\u003eIn one suburb, a statue of Assad\u0026#39;s father, the late President Hafez al-Assad, was toppled and torn apart. \u003c/p\u003e \u003cp\u003eThe Syrian army said it was reinforcing around Damascus, and state television reported on Saturday that Assad remained in the city. \u003c/p\u003e \u003cp\u003eOutside the city, rebels swept across the entire southwest over 24 hours and established control. \u003c/p\u003e \u003cp\u003eEXISTENTIAL THREAT TO ASSAD RULE\u003c/p\u003e \u003cp\u003eThe fall of Homs and threat to the capital pose an immediate existential danger to the Assad dynasty\u0026#39;s five-decade reign over Syria and the continued influence there of its main regional backer, Iran. \u003c/p\u003e \u003cp\u003eForeign officials said the government may be on the verge of collapse. One U.S. official put the timeframe at five to 10 days, while another said Assad could be ousted within the coming week. \u003c/p\u003e \u003cp\u003eThe pace of events has stunned Arab capitals and raised fears of a new wave of regional instability.\u003c/p\u003e \u003cp\u003eQatar, Saudi Arabia, Jordan, Egypt, Iraq, Iran, Turkey and Russia issued a joint statement saying the crisis was a dangerous development and calling for a political solution. \u003c/p\u003e \u003cp\u003eBut there was no indication they agreed on any concrete steps, with the situation inside Syria changing by the hour.\u003c/p\u003e \u003cp\u003eSyria\u0026#39;s civil war, which erupted in 2011 as an uprising against Assad\u0026#39;s rule, dragged in big outside powers, created space for jihadist militants to plot attacks around the world and sent millions of refugees into neighbouring states.\u003c/p\u003e \u003cp\u003eHayat Tahrir al-Sham, the strongest rebel group, is the former al Qaeda affiliate in Syria regarded by the U.S. and others as a terrorist organisation, and many Syrians remain fearful it will impose draconian Islamist rule. \u003c/p\u003e \u003cp\u003eGolani has tried to reassure minorities that he will not interfere with them and the international community that he opposes Islamist attacks abroad. In Aleppo, which the rebels captured a week ago, there have not been reports of reprisals. \u003c/p\u003e \u003cp\u003eWhen asked on Saturday whether he believed Golani, Russian Foreign Minister Sergei Lavrov replied, \u0026#34;The proof of the pudding is in the eating\u0026#34;.\u003c/p\u003e \u003cp\u003eLebanon\u0026#39;s Iran-backed Hezbollah group withdrew from the Syrian city of Qusayr on the border with Lebanon before rebel forces seized it, Syrian army sources said on Sunday.\u003c/p\u003e \u003cp\u003eAt least 150 armoured vehicles carrying hundreds of Hezbollah fighters left the city, long a point on the route for arms transfers and fighters moving in and out of Syria, the sources said. Israel hit one of the convoys as it was departing, one source said.\u003c/p\u003e \u003cp\u003eALLIES\u0026#39; ROLE IN SUPPORTING ASSAD\u003c/p\u003e \u003cp\u003eAssad long relied on allies to subdue the rebels. Russian warplanes conducted bombing while Iran sent allied forces including Hezbollah and Iraqi militia to reinforce the Syrian military and storm insurgent strongholds. \u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEKB60C6_L.jpg\" title=\"© Reuters. Rebel fighters, Homs countryside, Syria, December 7, 2024. REUTERS/Mahmoud Hasano\" alt=\"© Reuters. Rebel fighters, Homs countryside, Syria, December 7, 2024. REUTERS/Mahmoud Hasano\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eBut Russia has been focused on the war in Ukraine since 2022 and Hezbollah has suffered big losses in its own gruelling war with Israel, significantly limiting its ability or that of Iran to bolster Assad.\u003c/p\u003e \u003cp\u003eU.S. President-elect Donald Trump has said the U.S. should not be involved in the conflict and should \u0026#34;let it play out\u0026#34;. \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-07T23:45:16Z",
  "modifiedTime": null
}
