{
  "id": "5610835f-5ef9-4c0d-b289-961fd025afb8",
  "title": "Encounter underway between security forces, terrorists in J-K's Kathua",
  "link": "https://www.business-standard.com/india-news/encounter-underway-between-security-forces-terrorists-in-j-k-s-kathua-125032300699_1.html",
  "description": "The encounter started when the Special Operations Group of Jammu and Kashmir Police launched a search operation in the nursery in Sanyal village, one-and-a-half kilometres from the border in Hiranagar",
  "author": "",
  "published": "Mon, 24 Mar 2025 00:23:04 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 2175,
  "excerpt": "A gunfight broke out on Sunday after security forces intercepted a group of terrorists who had infiltrated and taken shelter in a dense nursery near the International Border in Kathua district of Jammu and Kashmir, officials said.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "A gunfight broke out on Sunday after security forces intercepted a group of terrorists who had infiltrated and taken shelter in a dense nursery near the International Border in Kathua district of Jammu and Kashmir, officials said. The encounter started when the Special Operations Group of Jammu and Kashmir Police launched a search operation in the nursery in Sanyal village, one-and-a-half kilometres from the border in Hiranagar sector, after receiving information in the evening about the presence of terrorists in the area, the officials said. They said the hiding terrorists opened heavy fire on the police party, which retaliated. There was no report of any casualty in the initial exchange of fire, which went on for nearly half an hour. Reinforcements from police, Army and paramilitary forces were rushed to the area, the officials said. The cordon around the nursery has been strengthened and efforts are on to neutralise the terrorists, they said.Also Read Some village women, who had gone to collect firewood from the nursery, spotted the terrorists, said to be five in number. It is believed that they infiltrated from across the border last night and had taken shelter in the sprawling area, according to the officials. A seven-year-old girl, Anchal Kumar, suffered injuries and was shifted to a local hospital. However, the exact cause of her injuries is not yet known, the officials said. Director General of Police (DGP) Nalin Prabhat is at the spot and supervising the anti-terrorist operation, they said. \"Based on intelligence input regarding the presence of terrorists, a joint operation has been launched by police, and troops of Rising star corps on March 23 in general area Saniyal Hiranagar. Operations in progress,\" the Army's Rising Star Corps said in a post on X. District Development Councillor Karan Kumar said heavy gunfire rocked the entire area after security forces launched the operation to track down the terrorists who were found hiding in the nursery.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-12/19/thumb/fitandfill/1200X630/1734583313-8247.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tA gunfight broke out on Sunday after security forces intercepted a group of terrorists who had infiltrated and taken shelter in a dense nursery near the International Border in Kathua district of Jammu and Kashmir, officials said.\u003c/p\u003e\n\u003cp\u003e\n\tThe encounter started when the Special Operations Group of Jammu and Kashmir Police launched a search operation in the nursery in Sanyal village, one-and-a-half kilometres from the border in Hiranagar sector, after receiving information in the evening about the presence of terrorists in the area, the officials said.\u003c/p\u003e\n\u003cp\u003e\n\tThey said the hiding terrorists opened heavy fire on the police party, which retaliated.\u003c/p\u003e\n\u003cp\u003e\n\tThere was no report of any casualty in the initial exchange of fire, which went on for nearly half an hour. Reinforcements from police, Army and paramilitary forces were rushed to the area, the officials said.\u003c/p\u003e\n\u003cp\u003e\n\tThe cordon around the nursery has been strengthened and efforts are on to neutralise the terrorists, they said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tSome village women, who had gone to collect firewood from the nursery, spotted the terrorists, said to be five in number. It is believed that they infiltrated from across the border last night and had taken shelter in the sprawling area, according to the officials.\u003c/p\u003e\n\u003cp\u003e\n\tA seven-year-old girl, Anchal Kumar, suffered injuries and was shifted to a local hospital. However, the exact cause of her injuries is not yet known, the officials said.\u003c/p\u003e\n\u003cp\u003e\n\tDirector General of Police (DGP) Nalin Prabhat is at the spot and supervising the anti-terrorist operation, they said.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;Based on intelligence input regarding the presence of terrorists, a joint operation has been launched by police, and troops of Rising star corps on March 23 in general area Saniyal Hiranagar. Operations in progress,\u0026#34; the Army\u0026#39;s Rising Star Corps said in a post on X.\u003c/p\u003e\n\u003cp\u003e\n\tDistrict Development Councillor Karan Kumar said heavy gunfire rocked the entire area after security forces launched the operation to track down the terrorists who were found hiding in the nursery.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-24T00:22:54+05:30",
  "modifiedTime": null
}
