{
  "id": "6c952614-f1b3-4952-b2e9-200fdc6d0a65",
  "title": "How Leaders Should Really Use AI",
  "link": "",
  "description": "Geoff Woods is the #1 international bestselling author of The AI-Driven Leader: Harnessing AI to Make Faster Decisions and the founder of AI Leadership and the AI Driven Leadership Collective. As a former Chief Growth Officer of a global company, Geoff brings real-world expertise in using AI to transform how leaders think and make decisions. In this episode, he reveals how AI can serve as a powerful thought partner—enhancing strategic focus, overcoming operational overwhelm, and unlocking breakthrough solutions using his CRIT framework. Tune in to learn how the most effective leaders are leveraging AI to stay ahead in a rapidly evolving business landscape. Today we discussed: 00:00 Opening 00:48 Introducing Geoff Woods 01:19 How AI Enhances Leaders Strategic Thinking 03:17 AI as a Thought Partner 04:46 How AI Can Help with Operation Tasks 06:16 Focusing on the 20% 07:52 The C.R.I.T. Framework 13:11 Addressing the AI Culture Shift 16:22 How is AI Changing Decision Making 17:45 What's AI's Role in Leadership 19:28 How to Start Integrating AI Into Your Leadership Practices More About Geoff Woods: The AI-Driven Leader by Geoff Woods on Amazon: https://www.amazon.com/AI-Driven-Leader-Harnessing-Smarter-Decisions/dp/B0DB8QL3ZK?utm_source=chatgpt.com Rate, Review, \u0026 Follow If you liked this episode, please rate and review the show. Let us know what you loved most about the episode. Struggling with strategy? Unlock your free AI-powered prompts now and start building a winning strategy today! 👉 Get Your Free Prompts: https://dtm.world/freeprompts",
  "author": "John Jantsch",
  "published": "Thu, 29 May 2025 09:30:00 -0000",
  "source": "https://ducttape.libsyn.com/rss",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
