{
  "id": "73782213-73bc-42c3-9601-35cd8eb366ee",
  "title": "Worried about a job loss? Time to pump up your emergency savings.",
  "link": "https://finance.yahoo.com/news/worried-about-a-job-loss-time-to-pump-up-your-emergency-savings-140002547.html",
  "description": "",
  "author": "",
  "published": "2025-04-19T14:00:02Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Kerry Hannon",
  "length": 2600,
  "excerpt": "Having an emergency account can help get you through a job loss. If you're worried about growing layoffs, now is the time to boost your savings.",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "For a growing number of workers, job loss anxiety is gaining steam. According to a new survey by the Federal Reserve Bank of New York, Americans who are worried about the job market hit levels on par with the pandemic. Unemployment expectations — whether people think the unemployment rate will pop up a year from now — jumped 4.6 percentage points to 44%, the highest reading since April 2020. The increase was spread across age, education, and income groups. It’s hard not to feel shaky given the chatter about a recession looming, inflation taking off again, and the daily roster of thousands of layoffs in the federal workforce and large companies. Instead of sitting around worrying, use that fear to get as financially fit as you can right now. One way is to turbocharge your emergency savings fund. “Consumers are anxious about higher inflation and household expenses as well as lower wage growth combined with worsening job security across all income levels,” Sid Pailla, chief executive of the Sunny Day Fund, a financial technology company that helps workers establish emergency funds, told Yahoo Finance. “It’s no surprise that we’re seeing emergency savings now top of mind as folks prepare for a potential financial blow.” Having cash on hand to cover living expenses for a few months, even if you don’t experience a financial jolt, helps you stay cool and calm when the economy feels rocky. Learn more: How to save $10,000 in 6 months “With many people worried about job security, it's not just about preparing for the unexpected — it’s about giving people the peace of mind they can weather the storm,” Liz Davidson, CEO and founder of Financial Finesse, told Yahoo Finance. “If they lose their job or face an unexpected expense, having savings to fall back on can make all the difference.” Successful saving is all about habit, and that starts with setting up an automatic direct deposit from your paycheck into a dedicated high-yield savings account. “The key is to start small and stay consistent,” Davidson said. “Setting aside a little bit each paycheck can add up over time. Starting with a goal like saving $500 or $1,000 is a great way to begin, and once that’s achieved, you can keep going.” One thing I can attest to is setting aside money before you even see it. “This way, you’re saving without thinking about it,” Davidson said. Read more: 50 tips to grow your wealth in 2025 The ideal amount to have set aside in an emergency savings account is roughly a year’s worth of expenses, but if that sounds daunting start with a goal of four months.",
  "image": "https://s.yimg.com/ny/api/res/1.2/Oghs_j1xx2k3GlPbAHLd3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-04/3364fba0-1bd7-11f0-bbf7-6999741b79cf",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"nimbus-app\" tabindex=\"-1\"\u003e  \u003carticle\u003e  \u003cdiv\u003e   \u003cdiv data-testid=\"article-content-wrapper\"\u003e  \u003cp\u003eFor a growing number of workers, job loss anxiety is gaining steam.\u003c/p\u003e  \u003cp\u003eAccording to a new \u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.newyorkfed.org/newsevents/news/research/2025/20250414\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:survey;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003esurvey\u003c/a\u003e by the Federal Reserve Bank of New York, Americans who are worried about the job market hit levels on par with the pandemic.\u003c/p\u003e  \u003cp\u003eUnemployment expectations — whether people think the unemployment rate will pop up a year from now — jumped 4.6 percentage points to 44%, the highest reading since April 2020. The increase was spread across age, education, and income groups.\u003c/p\u003e  \u003cp\u003eIt’s hard not to feel shaky given the chatter about a recession looming, inflation taking off again, and the daily roster of thousands of layoffs in the federal workforce and large companies.\u003c/p\u003e    \u003cp\u003eInstead of sitting around worrying, use that fear to get as financially fit as you can right now.\u003c/p\u003e  \u003cp\u003eOne way is to turbocharge your emergency savings fund.\u003c/p\u003e    \u003cp\u003e“Consumers are anxious about higher inflation and household expenses as well as lower wage growth combined with worsening job security across all income levels,” Sid Pailla, chief executive of the\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.sunnydayfund.com/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Sunny Day Fund;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e Sunny Day Fund\u003c/a\u003e, a financial technology company that helps workers establish emergency funds, told Yahoo Finance. “It’s no surprise that we’re seeing emergency savings now top of mind as folks prepare for a potential financial blow.”\u003c/p\u003e    \u003cp\u003eHaving cash on hand to cover living expenses for a few months, even if you don’t experience a financial jolt, helps you stay cool and calm when the economy feels rocky.\u003c/p\u003e  \u003cp\u003e\u003cem\u003eLearn more: \u003c/em\u003e\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://finance.yahoo.com/personal-finance/banking/article/how-to-save-10k-in-6-months-213716889.html\" data-ylk=\"slk:How to save $10,000 in 6 months;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cem\u003eHow to save $10,000 in 6 months\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e  \u003cp\u003e“With many people worried about job security, it\u0026#39;s not just about preparing for the unexpected — it’s about giving people the peace of mind they can weather the storm,” Liz Davidson, CEO and founder of \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://www.financialfinesse.com/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Financial Finesse,;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eFinancial Finesse,\u003c/a\u003e told Yahoo Finance. “If they lose their job or face an unexpected expense, having savings to fall back on can make all the difference.”\u003c/p\u003e        \u003cp\u003eSuccessful saving is all about habit, and that starts with setting up an automatic direct deposit from your paycheck into a dedicated high-yield savings account.\u003c/p\u003e  \u003cp\u003e“The key is to start small and stay consistent,” Davidson said. “Setting aside a little bit each paycheck can add up over time. Starting with a goal like saving $500 or $1,000 is a great way to begin, and once that’s achieved, you can keep going.”\u003c/p\u003e    \u003cp\u003eOne thing I can attest to is setting aside money before you even see it.\u003c/p\u003e  \u003cp\u003e“This way, you’re saving without thinking about it,” Davidson said.\u003c/p\u003e  \u003cp\u003e\u003cem\u003eRead more: \u003c/em\u003e\u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://finance.yahoo.com/personal-finance/banking/article/how-to-save-money-193015616.html\" data-ylk=\"slk:50 tips to grow your wealth in 2025;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cem\u003e50 tips to grow your wealth in 2025\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e  \u003cp\u003eThe ideal amount to have set aside in an emergency savings account is roughly a year’s worth of expenses, but if that sounds daunting start with a goal of four months.\u003c/p\u003e \u003c/div\u003e    \u003chr/\u003e \u003cul\u003e\u003cli data-testid=\"seamlessscroll-03d9a286-a547-4c3c-9e70-243eb4920d05\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-68329f51-a969-4324-89ce-923cee727241\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-9a5377d6-87f0-4256-86c2-774accad7373\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-1b575ea5-87fc-4862-a810-56705e442d6b\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-790d44e9-c33b-41ae-bdae-5285010f3457\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-9ea3b825-72c0-4c8e-b779-172e985c925c\"\u003e \u003c/li\u003e\u003cli data-testid=\"seamlessscroll-4fead08b-655c-46d2-b7c1-fa5e896108a4\"\u003e \u003c/li\u003e\u003c/ul\u003e \u003csection\u003e\u003cheader\u003e \u003c/header\u003e   \u003c/section\u003e\u003c/div\u003e\u003c/article\u003e \u003c/section\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-19T14:00:03Z",
  "modifiedTime": null
}
