{
  "id": "7bbe5929-42a4-48b4-848e-1781baf3c790",
  "title": "'Treadmill of debt': Consumer protection head sounds off on credit card companies' practices",
  "link": "https://finance.yahoo.com/news/treadmill-of-debt-consumer-protection-head-sounds-off-on-credit-card-companies-practices-110007774.html",
  "description": "",
  "author": "",
  "published": "2024-12-20T11:00:07Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Jordan Weissmann",
  "length": 2897,
  "excerpt": "Consumer Financial Protection Bureau Director Rohit Chopra tells Yahoo Finance that the high interest rates charged by credit card companies amount to price ...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Rohit Chopra may not have much time left as director of the Consumer Financial Protection Bureau, with Donald Trump preparing to assume the presidency. But the regulator has been making the most of his likely final months on the job, telling Congress recently he didn’t think there was any reason for the agency to act like a “dead fish.” This week, the CFPB took a flurry of small actions involving the credit card industry. Among the actions: It warned companies that devaluing customers’ points might be illegal and released a study knocking retail credit cards for offering particularly high interest rates. It also debuted a new credit card comparison tool using data the agency collects that, in theory, could offer an alternative to commercial sites that it argues often rely on kickbacks or affiliate marketing. In an interview on Thursday, Chopra told Yahoo Finance that the credit card industry has a growing price-gouging problem and shared some of his thoughts on regulations that may be needed to curb it — even if it may be a while before another Democrat has a chance to implement them. Below is a transcript of the interview, which has been edited for length and clarity. Weissmann: I want to take a step back. In general, how would you describe the way the credit card industry is currently treating consumers? Is its whole business model fundamentally problematic or are there just a bunch of discrete issues that need better regulation, in your view? Chopra: I think the most noteworthy shift in recent years has been what many would consider price gouging. Very importantly, we have seen a shift in the margins on credit card interest rates. In other words, when you look at the cost of funds for big credit card issuers, and you look at other factors like consumer credit profiles, we’re seeing much fatter margins. And in some ways credit cards have been more expensive than at any time in recent history. So just to put a finer point on it: Even when you consider [the Fed’s] interest rate hikes, those credit card interest rates went well beyond that. The net result is that as consumers were walking down the aisle and wondering why things like diapers were so expensive when they were swiping those purchases with a credit card, they were once again getting hit with high prices. Read more: How do credit card companies make money? Weissmann: What is your theory about why those margins have gotten so much fatter? What's allowing them to engage in “price gouging,” as you put it? Chopra: There's a whole host of reasons and we've looked at many of them. Some of them range from real in-the-weeds type practices, like how they've changed their credit reporting to obscure to their competitors who their most profitable customers are, to things that are much more in the open. And one of those things is the major role that rewards cards have now played in the market.",
  "image": "https://s.yimg.com/ny/api/res/1.2/yvhhwqfNln2FQFrTd6FI5A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-12/cc861c90-be5a-11ef-bbeb-c5e631b4e692",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003e\u003cem\u003eRohit Chopra may not have much time left as director of the Consumer Financial Protection Bureau, with Donald Trump preparing to assume the presidency. But the regulator has been making the most of his likely final months on the job, telling Congress recently he didn’t think there was any reason for the agency to act like a “dead fish.” \u003c/em\u003e\u003c/p\u003e  \u003cp\u003e\u003cem\u003eThis week, the CFPB took a flurry of small actions involving the credit card industry. Among the actions: It \u003c/em\u003e\u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://www.consumerfinance.gov/about-us/newsroom/cfpb-takes-action-on-bait-and-switch-credit-card-rewards-tactics/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:warned companies;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003ewarned companies\u003c/em\u003e\u003c/a\u003e\u003cem\u003e that devaluing customers’ points might be illegal and released \u003c/em\u003e\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://www.consumerfinance.gov/data-research/research-reports/issue-spotlight-the-high-cost-of-retail-credit-cards/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:a study;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003ea study\u003c/em\u003e\u003c/a\u003e\u003cem\u003e knocking retail credit cards for offering particularly high interest rates. It also debuted a new \u003c/em\u003e\u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://www.consumerfinance.gov/consumer-tools/credit-cards/explore-cards/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:credit card comparison tool;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003e\u003cem\u003ecredit card comparison tool\u003c/em\u003e\u003c/a\u003e\u003cem\u003e using data the agency collects that, in theory, could offer an alternative to commercial sites that it argues often rely on kickbacks or affiliate marketing.\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cem\u003eIn an interview on Thursday, Chopra told Yahoo Finance that the credit card industry has a growing price-gouging problem and shared some of his thoughts on regulations that may be needed to curb it — even if it may be a while before another Democrat has a chance to implement them. Below is a transcript of the interview, which has been edited for length and clarity.\u003c/em\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eWeissmann\u003c/strong\u003e: I want to take a step back. In general, how would you describe the way the credit card industry is currently treating consumers? Is its whole business model fundamentally problematic or are there just a bunch of discrete issues that need better regulation, in your view?\u003c/p\u003e  \u003cp\u003e\u003cstrong\u003eChopra\u003c/strong\u003e: I think the most noteworthy shift in recent years has been what many would consider price gouging. Very importantly, we have seen a shift in the margins on credit card interest rates. In other words, when you look at the cost of funds for big credit card issuers, and you look at other factors like consumer credit profiles, we’re seeing much fatter margins. And in some ways credit cards have been more expensive than at any time in recent history.\u003c/p\u003e \u003cp\u003eSo just to put a finer point on it: Even when you consider [the Fed’s] interest rate hikes, those credit card interest rates went well beyond that. The net result is that as consumers were walking down the aisle and wondering why things like diapers were so expensive when they were swiping those purchases with a credit card, they were once again getting hit with high prices.\u003c/p\u003e \u003cp\u003e\u003cem\u003eRead more: \u003c/em\u003e\u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://finance.yahoo.com/personal-finance/credit-cards/article/how-do-credit-card-companies-make-money-220247707.html\" data-ylk=\"slk:How do credit card companies make money?;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e\u003cem\u003eHow do credit card companies make money?\u003c/em\u003e\u003c/a\u003e\u003c/p\u003e \u003cp\u003e\u003cstrong\u003eWeissmann\u003c/strong\u003e: What is your theory about why those margins have gotten so much fatter? What\u0026#39;s allowing them to engage in “price gouging,” as you put it?\u003c/p\u003e  \u003cp\u003e\u003cstrong\u003eChopra\u003c/strong\u003e: There\u0026#39;s a whole host of reasons and we\u0026#39;ve looked at many of them. Some of them range from real in-the-weeds type practices, like how they\u0026#39;ve changed their credit reporting \u003ca data-i13n=\"cpos:5;pos:1\" href=\"https://finance.yahoo.com/news/your-credit-report-is-missing-key-data-that-lenders-are-refusing-to-report-140042485.html\" data-ylk=\"slk:to obscure to their competitors who their most profitable customers are;cpos:5;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003eto obscure to their competitors who their most profitable customers are\u003c/a\u003e, to things that are much more in the open. And one of those things is the major role that rewards cards have now played in the market.\u003c/p\u003e        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-21T14:31:26Z",
  "modifiedTime": null
}
