{
  "id": "7d909d0f-5236-496a-b59d-510f8b5f0bc6",
  "title": "Apple's services unit is now a $100 billion a year juggernaut after 'phenomenal' growth",
  "link": "https://www.cnbc.com/2024/10/31/apple-services-is-100-billion-per-year-juggernaut-but-growth-slowing.html",
  "description": "Apple's services business has become a critical part of the company's appeal to Wall Street over the past decade.",
  "author": "",
  "published": "Fri, 01 Nov 2024 00:35:28 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Kif Leswing",
  "length": 3998,
  "excerpt": "Apple's services business has become a critical part of the company's appeal to Wall Street over the past decade.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Apple CEO Tim Cook (C) joins customers during Apple's iPhone 16 launch in New York on September 20, 2024. Timothy A. Clary | Afp | Getty ImagesApple's second-largest division after the iPhone has turned into a $100 billion a year business that Wall Street loves.In Apple's earnings report on Thursday, the company said it reached just under $25 billion in services revenue, an all-time high for the category, and 12% growth on an annual basis.\"It's an important milestone,\" Apple CFO Luca Maestri said on a call with analysts. \"We've got to a run rate of $100 billion. You look back just a few years ago and the the growth has been phenomenal.\"Apple first broke out its services revenue in the December quarter of 2014. At the time, it was $4.8 billion.Apple's services unit has become a critical part of Apple's appeal to investors over the past decade. Its gross margin was 74% in the September quarter compared to Apple's overall margin of 46.2%.Services contains a wide range of different offerings. According to the company's SEC filings, it includes advertising, search licensing revenue from Google, warranties called AppleCare, cloud subscription services such as iCloud, content subscriptions such as the company's Apple TV+ service, and payments from Apple Pay and AppleCare.On a January 2016 earnings call, when the reporting segment was relatively new, Apple CEO Tim Cook told investors to pay attention.\"I do think that the assets that we have in this area are huge, and I do think that it's probably something that the investment community would want to and should focus more on,\" Cook said.Over the years, Apple has compared its services business to the size of Fortune 500 companies, which are ranked by sales, to give a sense of its scale. After Thursday, Apple's services business alone, based on its most recent run rate, would land around 40th on the Fortune 500, topping Morgan Stanley and Johnson \u0026 Johnson.Services appeals to investors because many of the subscriptions contained in it are billed on a recurring basis. That can be more reliably modeled than hardware sales, which will increase or decrease based on a given iPhone model's demand.\"Yes, the the recurring portion is growing faster than the transactional one,\" Maestri said on Thursday.Apple's fourth-quarter results beat Wall Street expectations for revenue and earnings on Thursday, but net income slumped after a one-time charge as part of a tax decision in Europe. The stock fell as much as 2% in extended trading.  Apple boasts to investors that its sales from Services will grow alongside its installed base. After someone buys an iPhone, they're likely to sign up for Apple's subscriptions, use Safari to search Google, or buy an extended warranty.Apple also cites a \"subscription\" figure that includes both its first-party services, such as Apple TV+ subscriptions, and users who sign up to be billed by an App Store app on a recurring basis.The company said the installed base and subscriptions hit all-time-highs, but didn't give updated figures. Apple said it had 2.2 billion active devices in February, and in August said it had topped 1 billion paid subscriptions.Still, Apple faces questions about how long its services business can continue growing at such a rapid rate. Between 2016 and 2021, the unit sported significantly higher growth, reaching 27.3% at the end of that stretch.In fiscal 2023, services growth dropped to 9.1% for the year, before recovering to about 13% the next year. Apple told investors that it expected services growth in the December quarter to be about what it was in fiscal 2024.Cook was asked on Thursday what Apple could do to make some of its services and its Apple One subscription bundle grow faster.\"There's lots of customers to try to convince to take advantage of it,\" Cook said. \"We're going to continue investing in the services and adding new features. Whether it's News+ or Music or Arcade, that's what we're going to do.\"WATCH: Apple has a big leg up in AI",
  "image": "https://image.cnbcfm.com/api/v1/image/108037085-1726838112123-gettyimages-2172369092-AFP_36GT3E9.jpeg?v=1730416256\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108037085\" data-test=\"InlineImage\"\u003e\u003cp\u003eApple CEO Tim Cook (C) joins customers during Apple\u0026#39;s iPhone 16 launch in New York on September 20, 2024. \u003c/p\u003e\u003cp\u003eTimothy A. Clary | Afp | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-1\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/AAPL/\"\u003eApple\u0026#39;s\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e second-largest division after the iPhone has turned into a $100 billion a year business that Wall Street loves.\u003c/p\u003e\u003cp\u003eIn Apple\u0026#39;s earnings report on Thursday, the company said it reached just under $25 billion in services revenue, an all-time high for the category, and 12% growth on an annual basis.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s an important milestone,\u0026#34; Apple CFO Luca Maestri said on a call with analysts. \u0026#34;We\u0026#39;ve got to a run rate of $100 billion. You look back just a few years ago and the the growth has been phenomenal.\u0026#34;\u003c/p\u003e\u003cp\u003eApple first broke out its services revenue in the December quarter of 2014. At the time, it was $4.8 billion.\u003c/p\u003e\u003cp\u003eApple\u0026#39;s services unit has become a critical part of Apple\u0026#39;s appeal to investors over the past decade. Its gross margin was 74% in the September quarter compared to Apple\u0026#39;s overall margin of 46.2%.\u003c/p\u003e\u003cp\u003eServices contains a wide range of different offerings. According to the company\u0026#39;s SEC filings, it includes advertising, search licensing revenue from Google, warranties called AppleCare, cloud subscription services such as iCloud, content subscriptions such as the company\u0026#39;s Apple TV+ service, and payments from Apple Pay and AppleCare.\u003c/p\u003e\u003cp\u003eOn a January 2016 earnings call, when the reporting segment was relatively new, Apple CEO Tim Cook \u003ca href=\"https://www.businessinsider.com/apple-wants-to-be-a-services-company-2016-1\" target=\"_blank\"\u003etold investors\u003c/a\u003e to pay attention.\u003c/p\u003e\u003cp\u003e\u0026#34;I do think that the assets that we have in this area are huge, and I do think that it\u0026#39;s probably something that the investment community would want to and should focus more on,\u0026#34; Cook said.\u003c/p\u003e\u003cp\u003eOver the years, Apple has compared its services business to the size of Fortune 500 companies, which are ranked by sales, to give a sense of its scale. After Thursday, Apple\u0026#39;s services business alone, based on its most recent run rate, would land around 40th on \u003ca href=\"https://fortune.com/ranking/fortune500/search/\" target=\"_blank\"\u003ethe Fortune 500\u003c/a\u003e, topping Morgan Stanley and Johnson \u0026amp; Johnson.\u003c/p\u003e\u003cp\u003eServices appeals to investors because many of the subscriptions contained in it are billed on a recurring basis. That can be more reliably modeled than hardware sales, which will increase or decrease based on a given iPhone model\u0026#39;s demand.\u003c/p\u003e\u003cp\u003e\u0026#34;Yes, the the recurring portion is growing faster than the transactional one,\u0026#34; Maestri said on Thursday.\u003c/p\u003e\u003cp\u003eApple\u0026#39;s \u003ca href=\"https://www.cnbc.com/2024/10/31/apple-aapl-q4-earnings-report-2024.html\"\u003efourth-quarter results\u003c/a\u003e beat Wall Street expectations for revenue and earnings on Thursday, but net income slumped after a one-time charge as part of a tax decision in Europe. The stock fell as much as 2% in extended trading.  \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eApple boasts to investors that its sales from Services will grow alongside its installed base. After someone buys an iPhone, they\u0026#39;re likely to sign up for Apple\u0026#39;s subscriptions, use Safari to search Google, or buy an extended warranty.\u003c/p\u003e\u003cp\u003eApple also cites a \u0026#34;subscription\u0026#34; figure that includes both its first-party services, such as Apple TV+ subscriptions, and users who sign up to be billed by an App Store app on a recurring basis.\u003c/p\u003e\u003cp\u003eThe company said the installed base and subscriptions hit all-time-highs, but didn\u0026#39;t give updated figures. Apple said it had 2.2 billion active devices in February, and in August said it had topped 1 billion paid subscriptions.\u003c/p\u003e\u003cp\u003eStill, Apple faces questions about how long its services business can continue growing at such a rapid rate. Between 2016 and 2021, the unit sported significantly higher growth, reaching 27.3% at the end of that stretch.\u003c/p\u003e\u003cp\u003eIn fiscal 2023, services growth dropped to 9.1% for the year, before recovering to about 13% the next year. Apple told investors that it expected services growth in the December quarter to be about what it was in fiscal 2024.\u003c/p\u003e\u003cp\u003eCook was asked on Thursday what Apple could do to make some of its services and its Apple One subscription bundle grow faster.\u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s lots of customers to try to convince to take advantage of it,\u0026#34; Cook said. \u0026#34;We\u0026#39;re going to continue investing in the services and adding new features. Whether it\u0026#39;s News+ or Music or Arcade, that\u0026#39;s what we\u0026#39;re going to do.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH:\u003c/strong\u003e \u003ca href=\"https://www.cnbc.com/video/2024/10/31/apple-has-a-big-leg-up-in-ai-compared-to-other-smartphone-makers-says-fmr-executive-tony-fadell.html\"\u003eApple has a big leg up in AI\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108055947\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000356603\" aria-labelledby=\"Placeholder-ArticleBody-Video-108055947\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108055948-17304081371730408132-36920059001-1080pnbcnews.jpg?v=1730408135\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Apple has a big leg up in AI compared to other smartphone makers, says Fmr. Executive Tony Fadell\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-01T00:35:28Z",
  "modifiedTime": "2024-11-01T00:35:28Z"
}
