{
  "id": "81a80bd2-e992-4702-a29f-84cd05750912",
  "title": "The Anti-Agency Model: A Bold New Future for Marketing Services with Sara Nay",
  "link": "",
  "description": "Sara Nay, CEO of Duct Tape Marketing and longtime collaborator with John Jantsch, joins the show to unveil a bold new approach to delivering marketing services—the Anti-Agency Model. With over 15 years of experience leading strategy and innovation, Sara breaks down why the traditional agency model is failing both marketers and small businesses, and how AI is reshaping everything from execution to internal team leadership. This episode explores the shift from outsourced marketing to building in-house systems supported by AI, empowering businesses to take ownership of their growth. Tune in to discover how agencies and fractional CMOs can embrace this future-ready model and drive deeper value for clients. Today we discussed: 00:00 Introduction 01:18 How the current agency model fails businesses and agencies alike 02:48 The misalignment between agency incentives and business goals 03:26 Using AI to elevate—not eliminate—marketers 07:06 The evolution toward system installers and strategic leaders 09:47 Business owner reactions to the anti-agency concept 12:13 Adding consistency as the fourth “C” of effective marketing 13:53 Workshop overview: structure, tools, and outcomes 15:57 Licensing a system, not just learning a method 17:19 Who this workshop is designed to help 18:23 Who your ideal client is for this new model Rate, Review, \u0026 Follow If you liked this episode, please rate and review the show. Let us know what you loved most about the episode. Struggling with strategy? Unlock your free AI-powered prompts now and start building a winning strategy today! 👉 Get Your Free Prompts: https://dtm.world/freeprompts",
  "author": "John Jantsch",
  "published": "Wed, 21 May 2025 09:30:00 -0000",
  "source": "https://ducttape.libsyn.com/rss",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
