{
  "id": "8a8dee5c-d2be-47c3-9df8-839454e9006f",
  "title": "Smartphone PLI scheme rings in record electronics exports, shows data",
  "link": "https://www.business-standard.com/industry/news/smartphone-pli-scheme-rings-in-record-electronics-exports-shows-data-124111901246_1.html",
  "description": "The momentum in electronics exports has been built due to the big push in exports through the smartphone production-linked incentive scheme",
  "author": "",
  "published": "Tue, 19 Nov 2024 23:12:36 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Surajeet Das Gupta",
  "length": 1974,
  "excerpt": "The momentum in electronics exports has been built due to the big push in exports through the smartphone production-linked incentive scheme",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "2 min read Last Updated : Nov 19 2024 | 11:30 PM IST Electronics exports reached the highest-ever mark of $19.1 billion within a seven-month period of any financial year, at the end of October 2024. This is a 24 per cent growth over the $15.4 billion export figure for the sector during the same period in the last financial year, according to the latest government data. The momentum in electronics exports has been built due to the big push in exports through the smartphone production-linked incentive scheme. For the month of October, electronics exports reached $3.4 billion — a 45 per cent growth over last October, when the sector had clocked $2.4 billion in exports.  Nearly 55 percent of the electronics exports until October 2024 constituted smartphone exports alone. Apple was a major contributor. Exports of iPhones formed 66 percent of the smartphone exports and 37 percent of electronics exports from India until October 2024. Last year, at the end of October, electronics was ranked the sixth-largest export, behind engineering goods, petroleum products, gems and jewellery, pharmaceuticals, and organic and inorganic chemicals. By October this year, it had jumped three positions to occupy the third slot, only behind engineering goods and petroleum products.More From This Section Electronics has been India’s fastest-growing export, not just on a monthly basis but also cumulatively among India’s top five exports for the seven-month period, according to the Department of Commerce. It is not only increasing its position in India’s top five exports but also narrowing the gap between electronics goods and second-ranked petroleum exports. In the last financial year, electronics exports were less than a third of the petroleum exports, which stood at $47 billion in the first seven months. In 2024-25, for the same period, electronics exports have reached nearly half of petroleum exports, which have clocked $40.9 billion thus far. Also Read",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-11/19/thumb/fitandfill/400X400/1732038087-6523.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e2 min read  Last Updated : Nov 19 2024 | 11:30 PM IST\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tElectronics exports reached the highest-ever mark of $19.1 billion within a seven-month period of any financial year, at the end of October 2024. This is a 24 per cent growth over the $15.4 billion export figure for the sector during the same period in the last financial year, according to the latest government data.\u003c/p\u003e\n\u003cp\u003e\n\tThe momentum in electronics exports has been built due to the big push in exports through the smartphone production-linked incentive scheme.\u003c/p\u003e\n\u003cdiv\u003e\u003cp\u003e\n\tFor the month of October, electronics exports reached $3.4 billion — a 45 per cent growth over last October, when the sector had clocked $2.4 billion in exports.\u003csmall\u003e \u003c/small\u003e\u003c/p\u003e\u003cp\u003e\u003cimg alt=\"chart\" height=\"480\" src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2024-11/19/full/1732038113-0429.jpg?im=Resize=(640,480)\" title=\"Chart\" width=\"640\" loading=\"lazy\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\n\tNearly 55 percent of the electronics exports until October 2024 constituted smartphone exports alone. Apple was a major contributor. Exports of iPhones formed 66 percent of the smartphone exports and 37 percent of electronics exports from India until October 2024.\u003c/p\u003e\n\u003cp\u003e\n\tLast year, at the end of October, electronics was ranked the sixth-largest export, behind engineering goods, petroleum products, gems and jewellery, pharmaceuticals, and organic and inorganic chemicals. By October this year, it had jumped three positions to occupy the third slot, only behind engineering goods and petroleum products.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMore From This Section\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tElectronics has been India’s fastest-growing export, not just on a monthly basis but also cumulatively among India’s top five exports for the seven-month period, according to the Department of Commerce. It is not only increasing its position in India’s top five exports but also narrowing the gap between electronics goods and second-ranked petroleum exports.\u003c/p\u003e\n\u003cp\u003e\n\tIn the last financial year, electronics exports were less than a third of the petroleum exports, which stood at $47 billion in the first seven months. In 2024-25, for the same period, electronics exports have reached nearly half of petroleum exports, which have clocked $40.9 billion thus far.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-19T23:30:30+05:30",
  "modifiedTime": null
}
