{
  "id": "91b7b110-1f80-4f5c-8db1-cee1b22c408b",
  "title": "India eyes strong trade deal with US, aims to double trade: Sitharaman",
  "link": "https://www.business-standard.com/external-affairs-defence-security/news/india-eyes-strong-trade-deal-with-us-aims-to-double-trade-sitharaman-125030800769_1.html",
  "description": "Finance Minister Nirmala Sitharaman said that amid a growing global tariff war, India will have to move smartly to guard against dumping of goods from nations that are facing higher US tariffs",
  "author": "",
  "published": "Sat, 08 Mar 2025 22:07:50 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 3259,
  "excerpt": "Finance Minister Nirmala Sitharaman on Saturday said India is looking for a \"good\" trade agreement with the US to promote economic growth and ensure smooth supply chains.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Finance Minister Nirmala Sitharaman on Saturday said India is looking for a \"good\" trade agreement with the US to promote economic growth and ensure smooth supply chains. She also said that amid a growing global tariff war, India will have to move \"smartly\" to guard against possible dumping of goods from countries that are facing higher US tariffs. At the same time, India will protect the interests of domestic industries that rely on affordable imports. \"In a broad sense, I think, both sides should have ambition for a good treaty, and nobody can fault that. Particularly for India, when you are looking at Viksit Bharat, you need to have good traction. Everybody is concerned about the growth numbers,\" she said at The Economic Times Awards. The minister said that a lot more steps are required to strengthen the country's exports across the board, wherever there is potential. \"So, I am sure the commerce minister (Piyush Goyal) is quite seized of this, and he would take this (trade) agreement to meet the ambitions that we have in terms of promoting growth, in terms of ensuring that our supply chains are intact and smooth and flowing well, and therefore, that would guide his negotiations, I would think,\" Sitharaman said.Also Read India and the US are negotiating a bilateral trade agreement, with an aim to double trade to $500 billion by 2030. After a week-long visit, Goyal on Saturday returned from Washington after holding trade talks with his US counterparts. Over the concern that due to the US tariffs, there is a possibility of dumping of goods in the country, Sitharaman said: \"When such chances exist, we will have to guard ourselves against it. But, how smartly do we do that?...We need to be smart about these sorts of things\". Among stakeholders, there are sections that opt for complete stoppage of dumped goods and some sections prefer a calibrated approach to it, she added. \"So, the government's task is to make sure that we plan for it and balance everybody's interests,\" the minister said. Already various sectors like steel have approached the government to impose safeguard duties to protect them against the increase in imports from countries, such as China, which have huge inventories. When asked about the guiding principles that India needs to follow while negotiating free trade agreements, she said: \"The first principle is to put India's interest first\". She said the language of certain agreements signed by the previous government \"was very loose\" and India is facing a challenge now because of those. She said the commerce ministry is now engaged to review many of the FTAs, including with countries like Japan, Korea, and ASEAN, which were signed in the past. \"...today our understanding is good negotiation...India's interest should be absolutely your top priority. And unless you do negotiate for India's own good, even your negotiation will not be taken seriously by the opposite side, because they are very clear on what they want. But can you not be as clear? And therefore, I would think the approach now is to be a lot more hands-on in your negotiation,\" she said. She also pitched for consulting with the stakeholders at every process and taking their inputs from time to time.",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/03/thumb/fitandfill/1200X630/1738564929-7724.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tFinance Minister Nirmala Sitharaman on Saturday said India is looking for a \u0026#34;good\u0026#34; trade agreement with the US to promote economic growth and ensure smooth supply chains.\u003c/p\u003e\n\u003cp\u003e\n\tShe also said that amid a growing global tariff war, India will have to move \u0026#34;smartly\u0026#34; to guard against possible dumping of goods from countries that are facing higher US tariffs. At the same time, India will protect the interests of domestic industries that rely on affordable imports.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;In a broad sense, I think, both sides should have ambition for a good treaty, and nobody can fault that. Particularly for India, when you are looking at Viksit Bharat, you need to have good traction. Everybody is concerned about the growth numbers,\u0026#34; she said at \u003cem\u003eThe Economic Times Awards\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\n\tThe minister said that a lot more steps are required to strengthen the country\u0026#39;s exports across the board, wherever there is potential.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;So, I am sure the commerce minister (Piyush Goyal) is quite seized of this, and he would take this (trade) agreement to meet the ambitions that we have in terms of promoting growth, in terms of ensuring that our supply chains are intact and smooth and flowing well, and therefore, that would guide his negotiations, I would think,\u0026#34; Sitharaman said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tIndia and the US are negotiating a bilateral trade agreement, with an aim to double trade to $500 billion by 2030. After a week-long visit, Goyal on Saturday returned from Washington after holding trade talks with his US counterparts.\u003c/p\u003e\n\u003cp\u003e\n\tOver the concern that due to the US tariffs, there is a possibility of dumping of goods in the country, Sitharaman said: \u0026#34;When such chances exist, we will have to guard ourselves against it. But, how smartly do we do that?...We need to be smart about these sorts of things\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\n\tAmong stakeholders, there are sections that opt for complete stoppage of dumped goods and some sections prefer a calibrated approach to it, she added.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;So, the government\u0026#39;s task is to make sure that we plan for it and balance everybody\u0026#39;s interests,\u0026#34; the minister said.\u003c/p\u003e\n\u003cp\u003e\n\tAlready various sectors like steel have approached the government to impose safeguard duties to protect them against the increase in imports from countries, such as China, which have huge inventories.\u003c/p\u003e\n\u003cp\u003e\n\tWhen asked about the guiding principles that India needs to follow while negotiating free trade agreements, she said: \u0026#34;The first principle is to put India\u0026#39;s interest first\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\n\tShe said the language of certain agreements signed by the previous government \u0026#34;was very loose\u0026#34; and India is facing a challenge now because of those.\u003c/p\u003e\n\u003cp\u003e\n\tShe said the commerce ministry is now engaged to review many of the FTAs, including with countries like Japan, Korea, and ASEAN, which were signed in the past.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;...today our understanding is good negotiation...India\u0026#39;s interest should be absolutely your top priority. And unless you do negotiate for India\u0026#39;s own good, even your negotiation will not be taken seriously by the opposite side, because they are very clear on what they want. But can you not be as clear? And therefore, I would think the approach now is to be a lot more hands-on in your negotiation,\u0026#34; she said.\u003c/p\u003e\n\u003cp\u003e\n\tShe also pitched for consulting with the stakeholders at every process and taking their inputs from time to time.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-08T22:07:36+05:30",
  "modifiedTime": null
}
