{
  "id": "a52eccc6-e821-467f-a8f3-7d9cc962f747",
  "title": "Jeff Bezos doubles down on unprecedented block of a presidential endorsement from ‘The Washington Post’ but admits ‘I am not an ideal owner’",
  "link": "https://fortune.com/2024/10/29/jeff-bezos-doubles-down-on-unprecedented-block-of-a-presidential-endorsement-from-the-washington-post-but-admits-i-am-not-an-ideal-owner/",
  "description": "Amazon’s founder stands by his words, calling out the decline in media trust.",
  "author": "Chloe Berger",
  "published": "Tue, 29 Oct 2024 23:41:00 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "Chloe Berger",
  "length": 5379,
  "excerpt": "Amazon’s founder stands by his words, calling out the decline in media trust.",
  "siteName": "Fortune",
  "favicon": "",
  "text": "Amazon founder Jeff Bezos might not allow The Washington Post to run its traditional endorsement of a presidential candidate, but he’s willing to pen and run an op-ed justifying his move. It’s all in the name of keeping the media unbiased, Jeff Bezos insists. Last Friday, the Post announced it was not endorsing a candidate in the upcoming election, which has been deemed by some to be one of the closest in America’s modern history. Sources said two Post writers produced an article that endorsed Kamala Harris, but the story was killed by Bezos, the outlet’s billionaire owner.  Facing backlash, Bezos is standing by his words. But Bezos’ op-ed indicates this is a change of policy for future elections. On the topic of endorsements, he said “ending them is a principled decision, and it’s the right one.” He called his decision “a meaningful step in the right direction” when it comes to regaining the trust of readers amidst disillusionment with the sector in general. Bezos defends himself, but admits some missteps  Citing Gallup’s data regarding slipping belief in institutions including the media, Bezos wrote “our profession is now the least trusted of all. Something we are doing is clearly not working.” Despite being the owner of the Post since 2013, Bezos made his wealth and spent most of his career in the tech sector where he founded Amazon. Amazon did not respond immediately to requests for comment. “It would be easy to blame others for our long and continuing fall in credibility (and, therefore, decline in impact), but a victim mentality will not help,” Bezos wrote. “Complaining is not a strategy.” Going on to claim that “presidential endorsements do nothing to tip the scales of an election,” Bezos said all they do is “create a perception of bias.”  Research from professors at Brown University shows that said endorsements are actually pretty influential “in the sense that voters are more likely to support the recommended candidate after publication of the endorsement.” But influence varies based on one’s bias.  Even Bezos admits the timing is a little off, as the election is only two weeks away from when the decision was announced. Calling the move “inadequate planning, and not some intentional strategy,” he insists there’s “no quid pro quo of any kind at work here.” That’s all despite Dave Limp, chief executive at Bezos’ Blue Origin, meeting with Republican candidate Donald Trump the day of the announcement.  Bezos said he didn’t know about the meeting beforehand, and implored people to trust him. Calling upon his track record at the Post, Bezos said his views are “principled.”  Perhaps this is not the job for a billionaire, concedes Bezos (though without any apparent desire to resign). “When it comes to the appearance of conflict, I am not an ideal owner of The Post,” he wrote, noting that officials at Amazon, Blue Origin, or other company he’s invested in are often meeting with politicians. “I once wrote that The Post is a ‘complexifier’ for me. It is, but it turns out I’m also a complexifier for The Post.”  Backlash against Bezos amidst larger billionaire skepticism  The newspaper with the slogan “democracy lies in darkness,” has endorsed a candidate since 1976—the only other time the Post declined to do so was in 1988, according to NPR. The choice to stay on the sidelines was met with some swift backlash from both internal and external figures.  Editor-at-large Robert Kagan resigned the same day as the announcement regarding the change in endorsements, telling CNN that the policy was “obviously an effort by Jeff Bezos to curry favor with Donald Trump in the anticipation of his possible victory,” as “Trump has threatened to go after Bezos’ business.” Three out ten people on the Post’s editorial board also stepped down because of the decision, while other journalists and columnists also quit in response.  An op-ed signed by 21 Post columnists disavows the choice as a “terrible mistake,” adding it “represents an abandonment of the fundamental editorial convictions of the newspaper that we love.” Bezos’ choice also caused a dent in readership: As of Monday, more than 200,000 people—representing around 8% of the outlet’s total subscriber base—canceled their subscriptions to the Post, sources told NPR. “It’s a colossal number,” former Post executive editor Marcus Brauchli told NPR of the dip in subscribers, adding there’s no way to know “why the decision was made.: A likely crucial element to America’s distrust of the media is their growing skepticism of the rich. As wealth inequality balloons, more than half of (59%) of Americans reportedly believe billionaires create a more unfair society per Harris Poll’s released survey of more than 2,100 U.S. adults. While respondents have some regard for billionaire’s influence over the economy, many want them out of certain spheres. One of them is the media, as 42% of Americans don’t think billionaires should be able to purchase businesses in the media sector. As one of the richest people in the world, Bezos’ wealth isn’t just the elephant in the room; it’s basically the whole room. “You can see my wealth and business interests as a bulwark against intimidation, or you can see them as a web of conflicting interests,” he wrote in his op-ed. It seems that some Americans see it as the latter.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2024/10/GettyImages-2094343620-e1730228162260.jpg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003e\u003ca href=\"https://fortune.com/company/amazon-com/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/amazon-com/\"\u003eAmazon\u003c/a\u003e founder Jeff Bezos might not allow \u003cem\u003eThe Washington Post\u003c/em\u003e to run its traditional endorsement of a presidential candidate, but he’s willing to pen and run an \u003ca href=\"https://www.washingtonpost.com/opinions/2024/10/28/jeff-bezos-washington-post-trust/\" target=\"_blank\" aria-label=\"Go to https://www.washingtonpost.com/opinions/2024/10/28/jeff-bezos-washington-post-trust/\" rel=\"noopener\"\u003eop-ed\u003c/a\u003e justifying his move. It’s all in the name of keeping the media unbiased, Jeff Bezos insists.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eLast \u003ca href=\"https://fortune.com/2024/10/25/jeff-bezos-washington-post-editorial-endorsement-kamala-harris-donald-trump-election/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/10/25/jeff-bezos-washington-post-editorial-endorsement-kamala-harris-donald-trump-election/\"\u003eFriday\u003c/a\u003e, the \u003cem\u003ePost\u003c/em\u003e announced it was not endorsing a candidate in the upcoming election, which has been deemed by some to be \u003ca href=\"https://www.nbcnews.com/politics/2024-election/uncertainty-reigns-election-closer-ever-seen-rcna175326\" target=\"_blank\" aria-label=\"Go to https://www.nbcnews.com/politics/2024-election/uncertainty-reigns-election-closer-ever-seen-rcna175326\" rel=\"noopener\"\u003eone of the closest\u003c/a\u003e in America’s modern history. Sources said two \u003cem\u003ePost\u003c/em\u003e writers produced an article that endorsed Kamala Harris, but the story was killed by Bezos, the outlet’s billionaire owner. \u003c/p\u003e\n\n\n\n\u003cp\u003eFacing backlash, Bezos is standing by his words. But Bezos’ op-ed indicates this is a change of policy for future elections. On the topic of endorsements, he said “ending them is a principled decision, and it’s the right one.” He called his decision “a meaningful step in the right direction” when it comes to regaining the trust of readers amidst disillusionment with the sector in general.\u003c/p\u003e\n\n\n\n\u003ch2\u003eBezos defends himself, but admits some missteps \u003c/h2\u003e\n\n\n\n\u003cp\u003eCiting \u003ca href=\"https://news.gallup.com/poll/651977/americans-trust-media-remains-trend-low.aspx\" target=\"_blank\" aria-label=\"Go to https://news.gallup.com/poll/651977/americans-trust-media-remains-trend-low.aspx\" rel=\"noopener\"\u003eGallup’s\u003c/a\u003e data regarding slipping belief in institutions including the media, Bezos wrote “our profession is now the least trusted of all. Something we are doing is clearly not working.” Despite being the owner of the \u003cem\u003ePost \u003c/em\u003esince 2013, Bezos made his wealth and spent most of his career in the tech sector where he founded Amazon. Amazon did not respond immediately to requests for comment.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It would be easy to blame others for our long and continuing fall in credibility (and, therefore, decline in impact), but a victim mentality will not help,” Bezos wrote. “Complaining is not a strategy.” Going on to claim that “presidential endorsements do nothing to tip the scales of an election,” Bezos said all they do is “create a perception of bias.” \u003c/p\u003e\n\n\n\n\u003cp\u003eResearch from professors at Brown University \u003ca href=\"https://economics.sas.upenn.edu/sites/default/files/filevault/u4/endorsements3.pdf\" target=\"_blank\" aria-label=\"Go to https://economics.sas.upenn.edu/sites/default/files/filevault/u4/endorsements3.pdf\" rel=\"noopener\"\u003eshows\u003c/a\u003e that said endorsements are actually pretty influential “in the sense that voters are more likely to support the recommended candidate after publication of the endorsement.” But influence varies based on one’s bias. \u003c/p\u003e\n\n\n\n\u003cp\u003eEven Bezos admits the timing is a little off, as the election is only two weeks away from when the decision was announced. Calling the move “inadequate planning, and not some intentional strategy,” he insists there’s “no quid pro quo of any kind at work here.” That’s all despite Dave Limp, chief executive at Bezos’ Blue Origin, meeting with Republican candidate Donald Trump the day of the announcement. \u003c/p\u003e\n\n\n\n\u003cp\u003eBezos said he didn’t know about the meeting beforehand, and implored people to trust him. Calling upon his track record at the \u003cem\u003ePost\u003c/em\u003e, Bezos said his views are “principled.” \u003c/p\u003e\n\n\n\n\u003cp\u003ePerhaps this is not the job for a billionaire, concedes Bezos (though without any apparent desire to resign). “When it comes to the appearance of conflict, I am not an ideal owner of The Post,” he wrote, noting that officials at Amazon, Blue Origin, or other company he’s invested in are often meeting with politicians. “I once wrote that The Post is a ‘complexifier’ for me. It is, but it turns out I’m also a complexifier for The Post.” \u003c/p\u003e\n\n\n\n\u003ch2\u003eBacklash against Bezos amidst larger billionaire skepticism \u003c/h2\u003e\n\n\n\n\u003cp\u003eThe newspaper with the slogan “democracy lies in darkness,” has endorsed a candidate since 1976—the only other time the \u003cem\u003ePost\u003c/em\u003e declined to do so was in 1988, according to \u003ca href=\"https://www.npr.org/2024/10/25/nx-s1-5165353/washington-post-presidential-endorsement-trump-harris\" target=\"_blank\" aria-label=\"Go to https://www.npr.org/2024/10/25/nx-s1-5165353/washington-post-presidential-endorsement-trump-harris\" rel=\"noopener\"\u003e\u003cem\u003eNPR\u003c/em\u003e\u003c/a\u003e. The choice to stay on the sidelines was met with some swift backlash from both internal and external figures. \u003c/p\u003e\n\n\n\n\u003cp\u003eEditor-at-large Robert Kagan \u003ca href=\"https://x.com/maxwelltani/status/1849873607163289666\" target=\"_blank\" aria-label=\"Go to https://x.com/maxwelltani/status/1849873607163289666\" rel=\"noopener\"\u003eresigned\u003c/a\u003e the same day as the announcement regarding the change in endorsements, telling \u003ca href=\"https://www.cnn.com/2024/10/25/media/washington-post-wont-endorse-presidential-candidate/index.html\" target=\"_blank\" aria-label=\"Go to https://www.cnn.com/2024/10/25/media/washington-post-wont-endorse-presidential-candidate/index.html\" rel=\"noopener\"\u003e\u003cem\u003eCNN\u003c/em\u003e\u003c/a\u003e that the policy was “obviously an effort by Jeff Bezos to curry favor with Donald Trump in the anticipation of his possible victory,” as “Trump has threatened to go after Bezos’ business.” Three out ten people on the \u003cem\u003ePost’s \u003c/em\u003e\u003ca href=\"https://www.washingtonpost.com/style/media/2024/10/28/post-editorial-board-resignations/\" target=\"_blank\" aria-label=\"Go to https://www.washingtonpost.com/style/media/2024/10/28/post-editorial-board-resignations/\" rel=\"noopener\"\u003eeditorial board\u003c/a\u003e also stepped down because of the decision, while other \u003ca href=\"https://deadline.com/2024/10/washington-post-endorsement-jeff-bezos-trump-1236159993/\" target=\"_blank\" aria-label=\"Go to https://deadline.com/2024/10/washington-post-endorsement-jeff-bezos-trump-1236159993/\" rel=\"noopener\"\u003ejournalists\u003c/a\u003e and \u003ca href=\"http://i\" target=\"_blank\" aria-label=\"Go to http://i\" rel=\"noopener\"\u003ecolumnists\u003c/a\u003e also quit in response. \u003c/p\u003e\n\n\n\n\u003cp\u003eAn op-ed signed by\u003ca href=\"https://www.washingtonpost.com/opinions/2024/10/25/post-columnist-no-endorsement-2024-trump-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjAyYjE0MzFjLWE3NDItNGQxNi1iMWUxLTUxYWI3NTBiYjdjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3Bvc3QtY29sdW1uaXN0LW5vLWVuZG9yc2VtZW50LTIwMjQtdHJ1bXAtaGFycmlzLyJ9.KCWBtmo8IMrEBOJbSZfuDv38U6GLmgAaDDTifHmVGxw\" target=\"_blank\" aria-label=\"Go to https://www.washingtonpost.com/opinions/2024/10/25/post-columnist-no-endorsement-2024-trump-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjAyYjE0MzFjLWE3NDItNGQxNi1iMWUxLTUxYWI3NTBiYjdjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3Bvc3QtY29sdW1uaXN0LW5vLWVuZG9yc2VtZW50LTIwMjQtdHJ1bXAtaGFycmlzLyJ9.KCWBtmo8IMrEBOJbSZfuDv38U6GLmgAaDDTifHmVGxw\" rel=\"noopener\"\u003e 21 \u003cem\u003ePost\u003c/em\u003e columnists\u003c/a\u003e disavows the choice as a “terrible mistake,” adding it “represents an abandonment of the fundamental editorial convictions of the newspaper that we love.”\u003c/p\u003e\n\n\n\n\u003cp\u003eBezos’ choice also caused a dent in readership: As of Monday, more than 200,000 people—representing around 8% of the outlet’s total subscriber base—canceled their subscriptions to the Post, sources told \u003ca href=\"https://www.npr.org/2024/10/28/nx-s1-5168416/washington-post-bezos-endorsement-president-cancellations-resignations\" target=\"_blank\" aria-label=\"Go to https://www.npr.org/2024/10/28/nx-s1-5168416/washington-post-bezos-endorsement-president-cancellations-resignations\" rel=\"noopener\"\u003e\u003cem\u003eNPR\u003c/em\u003e\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003e“It’s a colossal number,” former Post executive editor Marcus Brauchli told \u003cem\u003eNPR\u003c/em\u003e of the dip in subscribers, adding there’s no way to know “why the decision was made.:\u003c/p\u003e\n\n\n\n\u003cp\u003eA likely crucial element to America’s distrust of the media is their \u003ca href=\"https://fortune.com/2024/08/15/the-american-dream-is-collapsing-and-its-knocking-billionaires-off-their-pedestals/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/08/15/the-american-dream-is-collapsing-and-its-knocking-billionaires-off-their-pedestals/\"\u003egrowing skepticism\u003c/a\u003e of the rich. As wealth inequality balloons, more than half of (59%) of Americans reportedly believe billionaires create a more unfair society per \u003ca href=\"https://theharrispoll.com/wp-content/uploads/2024/07/Americans-and-Billionaires-Survey-August-2024.pdf\" target=\"_blank\" aria-label=\"Go to https://theharrispoll.com/wp-content/uploads/2024/07/Americans-and-Billionaires-Survey-August-2024.pdf\" rel=\"noopener\"\u003eHarris Poll’s\u003c/a\u003e released survey of more than 2,100 U.S. adults.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile respondents have some regard for billionaire’s influence over the economy, many want them out of certain spheres. One of them is the media, as 42% of Americans don’t think billionaires should be able to purchase businesses in the media sector.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs one of the richest people in the world, Bezos’ wealth isn’t just the elephant in the room; it’s basically the whole room. “You can see my wealth and business interests as a bulwark against intimidation, or you can see them as a web of conflicting interests,” he wrote in his op-ed. It seems that some Americans see it as the latter.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
