{
  "id": "a7906bb0-2ecd-4d58-8bf3-22e9396607df",
  "title": "Centre considers seed funding to establish a shipping insurance entity",
  "link": "https://www.business-standard.com/economy/news/amid-slow-progress-govt-mulls-financial-push-for-marine-p-i-entity-124101001227_1.html",
  "description": "The finance ministry may undertake an amendment to the Insurance Act, which will allow mutual insurance associations",
  "author": "",
  "published": "Fri, 11 Oct 2024 00:06:49 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Dhruvaksh Saha, Harsh Kumar",
  "length": 3672,
  "excerpt": "The finance ministry may undertake an amendment to the Insurance Act, which will allow mutual insurance associations",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "3 min read Last Updated : Oct 11 2024 | 12:06 AM IST With little progress in establishing a protection and indemnity (P\u0026I) entity to insure cargo vessels, the Centre is considering deploying its own funds as preliminary investment. This approach would involve private insurers and shippers contributing at a secondary stage, according to multiple officials familiar with the development. More than a year after Union Finance Minister Nirmala Sitharaman’s unexpected announcement calling for a P\u0026I entity, the lack of regulatory clarity and the nascency of the Indian shipping sector have slowed progress on this key initiative. Click here to connect with us on WhatsApp The Ministry of Ports, Shipping, and Waterways initially requested insurers and shipping companies in February to provide the first layer of insurance for shippers and shipbuilders, with reinsurance expected to be managed by larger global players in a second layer.   “We’ve held several rounds of discussions, but the quantum of funds the industry is willing to commit won’t be much. We’re exploring options, including the possibility of an initial ‘seed’ fund once legislative provisions are in place,” a senior official from the shipping ministry revealed. “This could be done directly or through the Maritime Development Fund, but we will need firm structure and clarity from the Department of Financial Services (DFS) before finalising anything.”   An inter-ministerial consultation process has been ongoing this year to create the marine insurance entity, with industry representatives participating. Officials say the finance ministry is likely to propose an amendment to the Insurance Act, allowing mutual insurance associations — a critical provision that has impeded the formation of a P\u0026I club. For now, the government is  considering starting with a fixed premium framework. More From This Section Initially, the proposed P\u0026I entity would cover only coastal and riverine vessels, which fall outside the international P\u0026I framework and carry a lower risk profile, as previously reported. The ministry is exploring international partnerships to pool funds for the insurance entity, potentially with government-backed funds or other P\u0026I clubs, the official said, adding, but this would occur later, when the entity would be handling export-import cargo. A senior finance ministry official noted that Indian-owned ships are currently insured in various countries, with premiums substantially higher for vessels navigating volatile regions like West Asia and Russia. “They (the shipping ministry and other stakeholders) want to explore options, possibly a mutual insurance model. India’s marine insurance sector is not very mature in providing coverage for shipping. We are trying to establish a mechanism to address this,” he explained. “This will take time; talks are ongoing. It’s a significant decision, and we need to coordinate our efforts to make it successful. However, no timeline has been set,” said a top executive at a public sector insurance company involved in the consultative process. Queries sent to the Ministry of Ports, Shipping, and Waterways, as well as the Ministry of Finance, remained unanswered until publication. P\u0026I insurance offers shipowners coverage against costs in the event of accidents that could impact cargo, human lives, and the environment. This coverage is typically provided through not-for-profit clubs of like-minded shipowners. The International Group, comprising 12 P\u0026I clubs, offers marine liability coverage to approximately 90-95 percent of the world’s sea tonnage. Also Read",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-07/18/thumb/featurecrop/400X400/1721269090-5894.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e3 min read  Last Updated : Oct 11 2024 | 12:06 AM IST\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv id=\"parent_top_div\"\u003e\n\t\u003cp\u003e\n\t\tWith little progress in establishing a protection and indemnity (P\u0026amp;I) entity to insure cargo vessels, the Centre is considering deploying its own funds as preliminary investment. This approach would involve private insurers and shippers contributing at a secondary stage, according to multiple officials familiar with the development.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tMore than a year after Union Finance Minister Nirmala Sitharaman’s unexpected announcement calling for a P\u0026amp;I entity, the lack of regulatory clarity and the nascency of the Indian shipping sector have slowed progress on this key initiative.\u003c/p\u003e\u003cp\u003e \u003ca href=\"https://www.whatsapp.com/channel/0029Va6cbsSDuMRmPCIgXS2t\" target=\"_blank\" rel=\"nofollow\"\u003eClick here to connect with us on WhatsApp\u003c/a\u003e\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tThe Ministry of Ports, Shipping, and Waterways initially requested insurers and shipping companies in February to provide the first layer of insurance for shippers and shipbuilders, with reinsurance expected to be managed by larger global players in a second layer.\u003cbr/\u003e\n\t\t \u003c/p\u003e\u003c/div\u003e\n\t\u003cp\u003e\n\t\t“We’ve held several rounds of discussions, but the quantum of funds the industry is willing to commit won’t be much. We’re exploring options, including the possibility of an initial ‘seed’ fund once legislative provisions are in place,” a senior official from the shipping ministry revealed. “This could be done directly or through the Maritime Development Fund, but we will need firm structure and clarity from the Department of Financial Services (DFS) before finalising anything.”\u003cbr/\u003e\n\t\t \u003c/p\u003e\n\t\u003cp\u003e\n\t\tAn inter-ministerial consultation process has been ongoing this year to create the marine insurance entity, with industry representatives participating. Officials say the finance ministry is likely to propose an amendment to the Insurance Act, allowing mutual insurance associations — a critical provision that has impeded the formation of a P\u0026amp;I club. For now, the government is \u003c/p\u003e\n\t\u003cp\u003e\n\t\tconsidering starting with a fixed premium framework.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMore From This Section\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\t\n\t\u003cp\u003e\n\t\tInitially, the proposed P\u0026amp;I entity would cover only coastal and riverine vessels, which fall outside the international P\u0026amp;I framework and carry a lower risk profile, as previously reported.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tThe ministry is exploring international partnerships to pool funds for the insurance entity, potentially with government-backed funds or other P\u0026amp;I clubs, the official said, adding, but this would occur later, when the entity would be handling export-import cargo.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tA senior finance ministry official noted that Indian-owned ships are currently insured in various countries, with premiums substantially higher for vessels navigating volatile regions like West Asia and Russia. “They (the shipping ministry and other stakeholders) want to explore options, possibly a mutual insurance model. India’s marine insurance sector is not very mature in providing coverage for shipping. We are trying to establish a mechanism to address this,” he explained.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\t“This will take time; talks are ongoing. It’s a significant decision, and we need to coordinate our efforts to make it successful. However, no timeline has been set,” said a top executive at a public sector insurance company involved in the consultative process.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tQueries sent to the Ministry of Ports, Shipping, and Waterways, as well as the Ministry of Finance, remained unanswered until publication.\u003c/p\u003e\n\t\n\t\u003cp\u003e\n\t\tP\u0026amp;I insurance offers shipowners coverage against costs in the event of accidents that could impact cargo, human lives, and the environment. This coverage is typically provided through not-for-profit clubs of like-minded shipowners. The International Group, comprising 12 P\u0026amp;I clubs, offers marine liability coverage to approximately 90-95 percent of the world’s sea tonnage.\u003c/p\u003e\n\t\n\n\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-11T00:06:49+05:30",
  "modifiedTime": null
}
