{
  "id": "af287965-df14-43d7-883d-ae054b66fb76",
  "title": "#2260 Noah Kagan, SHUT UP and take my $100!",
  "link": "https://mixergy.com/interviews/noah-kagan-shut-up-and-take-my-100/",
  "description": "My vision for this interview was to hear Noah Kagan’s process for launching companies, like the $80+ million / year AppSumo – the process he wrote about in his book, Million Dollar Weekend. We did that. You’ll hear his step-by-step business launch process. But, when I asked him how he was proving his process, he told me he was creating an alternative to Docusign and started asking me about the problems I have with it. I got so angry listing my problems that I told him I’d fork up whatever money he wanted to buy his alternative. Noah Kagan is the founder of AppSumo, which provides entrepreneurs deals on software and other tools. He’s also a popular YouTuber whose channel just broke 1 million subscribers and the author of “Million Dollar Weekend.” Sponsored byGusto – The easy payroll and benefits software the Mixergy interviewees love. More interviews -\u003e https://mixergy.com/moreint Rate this interview -\u003e https://mixergy.com/rateint",
  "author": "Andrew Warner",
  "published": "Tue, 30 Jan 2024 18:00:47 +0000",
  "source": "https://feeds.feedburner.com/Mixergy-main-podcast",
  "categories": [
    "startups",
    "ambition",
    "mix",
    "energy",
    "synergy",
    "mixology",
    "entrepreneur",
    "business",
    "tips",
    "motivation"
  ],
  "byline": "",
  "length": 50409,
  "excerpt": "My vision for this interview was to hear Noah Kagan’s process for launching companies, like the $80+ million / year AppSumo – the process he wrote about in his book, Million Dollar Weekend. We did that. You’ll hear his step-by-step business launch process. But, when I asked him how he was...",
  "siteName": "Business Podcast for Startups",
  "favicon": "https://mixergy.com/wp-content/themes/mixergy-2015-v2/assets/img/icons/apple-touch-icon-180x180.png",
  "text": "Andrew Warner: Hey there Freedom Fighters. My name is Andrew Warner. I’m the founder of Mixergy. We’re going to interview entrepreneurs about how they built their businesses. And today I’m going to be interviewing somebody who’s going to tell you how you should be building your business. He’s my old buddy, Noah Kagan. I watched him launch his business, AppSumo, here on the podcast, back when it was just a little more than an email list. and he did it. We’re going to find out how big AppSumo, the site that gives entrepreneurs deals on software and other tools, how well that’s doing. And we’re going to find out about his latest book, which is called million dollar weekend. I’ve seen him build several companies in a weekend. I’ve actually been the customer of some of these experimental companies that he launched in a weekend. And I’ll ask him about the book, ask him about how his business is doing. And then also ask him, why is it that the last time I was at his house, there was a plaque from YouTube for a million subscriber, whatever, achievement that’s just sitting there with a bunch of shoes on top of it. all right, we can do all that. Thanks to my sponsor, Gusto. If you are paying people who are working with you, you owe it to them to give them a good experience to let them see how much you got paid, to make it easy for yourself to pay them and to give them benefits and to keep it all organized. And that’s why later I’m going to tell you why you should go to Not gusto, but gusto. com slash mixer G. No, you like a good deal. I see you’re typing that in you should go to gusto. com slash mixer G. All right. Let me start with this question, dude. I saw you do an interview last night I was just kind of scrolling before I went to sleep and I saw you do an interview where the very first question you Asked the person was What’s the best part of being rich now? Don’t punk out be like the interviewer Noah who wants somebody to be open not the guy who goes, you know It’s just being happy with my girlfriend and all that. What’s the best part of being rich balls out? Noah Kagan: it’s about sharing it and making sure you’re being generous with everybody, but yourself. Andrew Warner: Yeah, don’t don’t give me any of Noah Kagan: I know, I know. But people always give this thing to in business. It’s like, first off, I want to thank my team. And it’s like, dude, just thank yourself. Everyone. Everyone. And I know it sounds bad, too, at the money part, but, I think,everyone, including myself, we all take ourselves down, and then we don’t, just keep it real, and it’s okay to take a compliment, it’s okay to say, hey, I worked hard, and I’m proud of something. What’s the best part of being rich? A lot of things, I would say, and I never really enjoyed it until the past, until COVID, I didn’t really enjoy being rich. I would say not budgeting is probably the best part of being rich. I did a CNBC show called Make It. And I didn’t even know how much I made last year. It was 3. 3 million dollars. Andrew Warner: You personally or the business? Noah Kagan: Me? Andrew Warner: Okay, Noah Kagan: I was like, whoa. after a mil, like, it’s more, way more than enough. And then, I don’t even know how much my expenses are. They’re like, how much is your insurance? I was like, I don’t, I don’t know. Andrew Warner: because you used to budget to that degree Noah Kagan: I still do a monthly net worth evaluation, so every month that I’ve done this for 15 years, I use a Google spreadsheet, which attracts every single one of my assets, every single one of my liabilities. And it just gives me a cash liquid net worth. I don’t do valuation in that. yeah, overall, I don’t budget. And that’s a great part of being rich. Like you go to the store, you go to the, like last night I was at dinner with Ian, Dan Taylor. At, Bob’s Chop House in Austin. And it was nice, I could just pick up the bill, it was 7 50. And it’s not a concern. And I do recognize there’s a lot of people who are like, either paycheck to paycheck, or 7. 50 is a lot. And, I can buy duplicates of things. So I have a duplicate of a lot of my stuff that’s in Austin, in Spain, where I spend half the year with my girlfriend. That’s a super luxury. Hiring people is super luxury. hiring a house manager to take care of things around the house. Not worrying if things break. Which I don’t want him to break, but if something breaks, I know I don’t have to worry about the money for it. there is a lot of great things, and for 20 years, I don’t think I even enjoyed any of the money I had. It was only in these recent years I’m buying Rolexes, and I’m proud of myself. And I get Rolexes for certain moments in life. Wow, that sounded like an ad read. And I talked to someone yesterday who’s frustrated. And he’s like, I’m jealous of you. I’m like, what are you jealous about? Tell me about it. And he’s like, it seems like everything’s going your way and I’m like, yeah, I feel very lucky and blessed, but it’s not exclusive. It’s not something that no one else can be where I’m at or even beyond it. And also I started 10 years ago to be able to enjoy it today. And you can do the same thing. So in the next 10 years or next five years, you could have all these things or however you want to live, but What I noticed was really enjoying the victim role and the, well, it’s for Noah, not for me, and I was like this is not exclusive, but you have to start right now, and you can do that, too Andrew Warner: What’s the house manager thing? I was at your place, and you said, I know you’re coming over, so I got you Middle Eastern food, or my house manager did, but I’m really curious. What does a house manager do? Noah Kagan: So I have different assistants I probably have five different types of people that can help me with different things which I used to feel self conscious about like you sure you want to help me am I just pain and I feel awkward about it candidly the house manager specifically It’s just anything around the house that needs to get done. And some of it, I think it’s good to wash your dishes. And what I mean by that is if you outsource everything and you don’t do any hard work, I think you get a little soft. but there’s things like hanging up my painting. It’s been sitting in the stairwell. Now two months and by the way, I think this is a business opportunity is house managers on demand So my grass, I killed some of my grass because I parked my car over it I just lately have been so focused on my girlfriend or the book Million Dollar Weekend and AppSumo or YouTube that I have not Had time nor even interest in prioritizing that so there’s just like numerous things Buying, what are those a welcome mat? I have a sauna So I want a welcome mat that’s says namaste or something silly Just like small little things I have a shared to do list. where I just put the things that have been backlogged around the house. And it’s definitely a luxury. I’ve had three house managers. They’ve all quit. but then when they quit, I do it myself. I’m like, nah, it’s fine. But it definitely, uh, nice to have not a must have, and that’s a great part of being rich is that you can afford that and also gives you time to do the things you want or do just sit on your ass too. Andrew Warner: Why do they quit? One of them quit because I was leaving to Spain and she wanted me to pay her and I said I can’t pay you the full amount because I don’t need you to do anything around the house but can you suggest other things you can do and then I’ll pay you for that and she got frustrated about that. One of them quit unexpectedly. She had a kid and I think something happened with her kid so she left Houston one day and was like, I quit today. She was nice about that. And the last one, she was always sourpuss face. Mm. Noah Kagan: hey, do you mind doing this? I’m paying you, and I think it was like 30 or 40 an hour. And she would just always make me feel guilty about it. She’s like, you want me to do that? And I’m like, that’s literally your job. You don’t have to do it, and that’s okay, too. But it was always pretty sour. She was really intelligent, and she did get some things done. but it was always with a bad attitude. And it’s just, it’s nice to be around optimistic people. Andrew Warner: All right, let’s go to AppSumo. What’s the revenue and profit at AppSumo now? Noah Kagan: Last year we did about 80 million gross revenue, net revenue 53 million, and then profit was about 7. 1 million at AppSumo in 2023. Andrew Warner: And so the rest of the money just gets saved in the AppSumo account? No, actually, you don’t take any money out of AppSumo, I imagine. When you said 3 point something million, that’s from what? Noah Kagan: So with AppSumo, we copy Amazon and a lot of things because I like how they operate their business. And what they did, if you look at their strategy, was that they invested or even lost money for maybe 15 years before they started making serious profit. And so we’ve replicated that where If you actually look at our net income over the past 14 years, it’s very small. It’s maybe after everything at the end of the year, maybe half a percent of. Profit. And so what we do is we have a budget for the whole year and we target at least a 10 percent not operating income. And in Q4, we taper down the spend or we taper up the spend and down the operating income, investing in distribution to the team. So they get fat bonuses. I think we did 1. 2 million to the teammates we spent. Almost half a million dollars on an all expenses paid trip for everyone who wanted to go to Mexico. We bought servers, we bought copies of the book to give to our VIP customers, we buy ads, we sponsor people. And then there’s a distribution with whatever’s left, to me and Chad. Chad’s the guy you introduced me to, that helped run AppSumo now. And so that, that’s only at the end of the year, if things are going well, is the, investments and distribution. And so for myself I’ll share it at a high level. my actual, base salary. I finally got a raise at AppSumo. My boss gave me a raise, which was cool. my base has been 175, 000 for about five, six years. And I was like, man, I think my mortgage plus property tax is like 12, 000 a month. I was like, it’s not like a huge savings to pay for that. So I got a raise to 250, 000, which was nice. And. The way I distribute it is at the end, I think my AppSumo salary ended up being a little over a million. And then the other one and a half million dollars is the company sponsors an LLC I have, which is all of my content creation business. So I do that for one, mostly tax reasons, it’s tax advantageous for everyone out there if you don’t have an LLC, whether you’re an employee or whether you have a company, there’s a lot of advantages to that, which I think people miss out on. And so, because I have a content. You know, YouTube and the book and all these things in a separate LLC, there’s a lot more expenses against that money that goes in via AppSumo as a sponsor of LLC. Andrew Warner: I was looking over at my bookcase because I remember at one point you published a book on these types of techniques that people who you know are really rich use Noah Kagan: I think that I took it offline because I wanted everything to be focused on Million Dollar Weekend. I had a lot of free time and I was bored. And so interviewed rich friends and the book is called Things That Rich People Don’t Want You To Know. Some of those things, I did it myself, because I think governments are very inefficient, and I think private business is the way to, have money be distributed, generally. I think there’s some parts of government that are good. and so I wanted to figure out ways, like, art donation is an interesting one. You know, having an LLC is one that I think people are pretty familiar with, conservation easements. There’s one now, which is defined benefit plan, which is you create your own pension plan as an individual person. And then you can put up to almost 200, 000 a year tax free. Let’s come back to AppSumo. I was paying Calendly forever, and I wasn’t really using a lot of their features. I said, why am I paying for this thing where I rarely use it? Andrew Warner: And then I found and it’s pay one time and I thought, all right, I’m going to get a lifetime deal, 29 or whatever. And then they’re going to increase the price and switch to monthly. You never increase the price and switch to monthly. I’m now seeing there’s a bit of a movement in software creators to sell one time prices. What are the economics of that? Of selling software at one time instead of a monthly fee? Noah Kagan: the strategy at a high level for people to copy So everything you buy on AppSumo is pay once, use it forever. Andrew Warner: Like I bought Cast Magic. I have lifetime access. I talked to the founder. I said, why are you doing this? And he said, I need people early days of my software so that I know what’s working, what’s not. And frankly, it’s a good cash infusion today. And then later on, we’ll figure it out and we’ll charge people a monthly fee. It makes sense for him. That’s not his whole model. The idea of TidyCal going one price forever That’s interesting. What are you seeing here? Noah Kagan: We’ve been doing it for a decade and we’ve been promoting these lifetime deals. So specifically from our strategy, it’s how do we have low cost popular tools that are also viral that will bring people into the absolute ecosystem? So the easiest way to think about it in your business is what’s the lifetime value? So how much do people stay? And spend with you. And then what’s the cost to acquire them? And if you can even do napkin math to understand, Hey, people spend, so tiny cows, 29 bucks, the profit on that though, is 28 or whatever, after the processing fees. that doesn’t necessarily cost, I think it depends on the channel, but our costs could be higher, that brings Andrew Warner: though because there’s still software updates. You guys are updating it. I remember firing off a message to you saying, there’s this thing I need. But then a few weeks later, the feature was put in. You introduced me to the CEO. He put it in. I got the feature. That takes software. That takes time. That takes people. Noah Kagan: Yeah. That team costs 60, 000 a month. And so that’s the originals team. So we have sendfox. com for email, which is a MailChimp alternative. kingsuma. com, which is giveaway software. A lot of these are tools we frankly like and use ourselves. I use all these myself. And so the economics is let’s take kingsuma. com or sendfox. com. We haven’t really updated them actively in two or three years And they still work. They work great. I use Senfox every single week. and they’re generating in terms of the sales, maybe, let’s give it to, I haven’t looked at them specifically, but let’s just say 3, 000 a day in profit. So that’s 90, 000 a month. And that’s just direct sales. What we use this for really, our number one thing, is bringing new buyers into the AppSumo ecosystem. And so, TidyCal. com as an example, I think brought in, 21 percent of all new buyers in 2023, Andrew Warner: Oh, whoa, whoa, whoa, whoa, whoa. Wait, wait. 21% of customers who came to your marketplace, new buyers, who came to your marketplace came because they want this Calendly alternative for a one-time fee. I see. So for you, it’s not just the revenue that you’re making in the profit, and you’re saying you are making good profit from this. It’s also the ongoing customers that you get from this Noah Kagan: percent. the problem with AppSumo is, and this is a thing you can use in any business. what’s the thing that’s the consistent bringer inner of new people. And for us, it’s these products that are low cost for things. Cause on AppSumo, a lot of the deals go away. like you need a AI, podcast tool like Cast Magic or Neuron Rider, which is an AI writing tool. a lot of those can go away, Cast Magic doesn’t want to come back right now, but TidyCal is forever. And then we can keep building off, alright, how do we build our affiliate stuff off of TidyCal? How do we have more ads that keep running off TidyCal? And at some point there’s a feature set that’s, 80%. And so, I think I pitched you on it, but in the next 30 days, we’re launching a DocuSign alternative. So how do you stack rank things to see what’s the biggest opportunity? So we stack rank based on one, what do we like? Two, what’s viral? And then three, is there a high cost alternative? And that led us to say that DocuSign which I’ve used Million Dollar Weekend to validate it. the DocuSign alternative is the biggest opportunity for us. And so that’s what we’re launching in the next 30 days. Andrew Warner: That was your weekend project that you did to prove that the ideas in the book work. that’s why I know about it. Noah Kagan: Did you pay? Andrew Warner: You never hit me up! Dude, you, I should have actually brought this up when you and I talked. I walked away thinking I use HelloSign for their free tier, but there’s an issue with HelloSign in the free tier, and that is that it doesn’t have templates, which is a thing that I need, and I’m limited in a weird way, and I accidentally keep paying a monthly fee, because I have multiple accounts with them, I find that there’s this payment. Basically what I’m doing is I’m gaming HelloSign, which is no way to run a business because I have all these little issues with it. And DocuSign is too clumsy for me, I should have just brought it up and just taken advantage of whatever the low price is because I know you’re going to invest in it. Noah Kagan: Yeah, the economics work because we do get them in at 30 and then they spend more on other products throughout AppSumo. so the, the overall channel, it’s a very effective one. So by the way, everyone that’s out there, A lot of businesses, you can start it a lot easier than you expect. and this is, something I talk about in the book and it’s what we do at AppSumo. how are you testing things really quickly, finding the thing that works, and then going all in on it? Andrew Warner: test and invest is one of our values. And so we’ve tried, I think, nine different AppSumo original products and really only Three and really only one tidy cal has been like a rocket ship. And so, in business, the first thing that doesn’t always work is you try, try, try, try, try, try. Noah Kagan: And then when you find the thing working, really doubling down. So there’s a team behind Tidy Cal, and instead of moving the team off to do something new, it’s like, no, stay on that. And we’ll hire more people to build more original products. Andrew Warner: One of the things that I noticed is SendFox is good, but the email marketing competitors have gotten really good. ConvertKit is now allowing people to subscribe to other people’s subscriptions as a way of growing. They’re adding, advertising, they’re adding automation and all that. One of the things that’s happening here is SendFox is maybe 50 percent of the feature list. There’s another 50 percent that is for people who are living in email as a business. And it seems like what you’re saying is we’re just not going after them. We’re going to go after the 50 percent that matters most people and keep it that basic. Noah Kagan: Think of it as like Google Docs compared to Microsoft Word. You really just write and you need to share it and print it. And there’s just all these other whiz bang features. And the thing with email marketing specifically, and AppSumo, I think half our revenue comes from email marketing. Getting people to switch email marketing was very, very, very hard. And it’s a dedicated business where you’d have to get a lot of support. We have three support people on the originals products, but you have to get an operations person. You have to get a support person. TidyCal, you literally, we have a one click Cal only import. And getting someone to switch off, whatever, 20 a month for 29 for life is a very easy sale. And I think the same thing will be said for DocuSign, where there’s not a lot of investment costs to get you to switch from HelloSign, it doesn’t, sometimes it doesn’t matter how rich you are, you’re just, certain things don’t seem worth it. And I also think that creates great business opportunities. Andrew Warner: That’s right. That is what it is. That’s why I have multiple accounts. There must have been some months where I had to send a whole lot of documents. And so I created multiple accounts and then I accidentally paid for one. yeah, the things that frustrate you, or you’re spending money on, or you’re wasting time on, or you have avoided, are all business opportunities. Tell me how you started. This is a business. This is an example of what you were talking about in million dollar weekend. It’s the kind of business launch that I’ve seen you do over the years. Where did the idea come from? How did you validate it? And then what did you do once it was validated? Noah Kagan: AppSumo started the same way in a weekend for 50 bucks, which I probably spent too much on it, and it was very quick that this worked. While literally so many of the things I’ve tried, Andrew, Did not work, but you have to get started today so that if you find the thing that eventually works, stick with it. And then you get the compounded returns years later. I think there’s compounded business is this idea that most people are missing out on, find something that works and then just keep doing it for a long period of time. And one, the results will be there, but two, if ideally you do work, you like, it’ll be enjoyable. So with this idea, I wanted to make it even harder on myself, Andrew, following the million dollar weekend process. One, I couldn’t use any of my social media or my email list. For everyone out there, make it easier on yourself. I don’t know why people want to make businesses so hard. It should be easy. It should be fun. And then the second thing was I wanted the audience to suggest the ideas. So I posted on social media. I said, Hey, I’m going to do a 48 hour challenge, not using any social media. you suggest ideas. So the ideas were, hamster daycare business, physical businesses, e commerce businesses, software businesses, Then I followed the book, and this is stuff at a high level, most people are like, okay, tell me how to start the business. That’s not even what you need. You need to actually get started. And how do I practice getting started? So I went on the streets of Austin to make it even harder on myself And I asked people on the streets for a dollar. most people don’t become millionaires because they never make the first dollar. And early on in my life, it was risky to have the day job. It was risky to stay at Intel. It didn’t feel risky to, to try at least living the life I wanted. And today it’s amazing. I can’t believe I get to live this life. So I did the dollar challenge on the streets. Then I did the coffee challenge where I went to different Coffee shops and restaurants asking for 10 percent off because business is really starting and asking. Those are the two cores of all business. I got rejected on all of it, except the dollar. Actually, the dollar challenge, I made five bucks. I can’t believe so many people kept giving me a dollar. I actually had to get rejected. I was like, Hey, can you not give me any money? Part one is getting going and practicing asking, practicing getting rejected. Cause business is you start something, you ask people for something. Some say yes, some say no, and then you keep doing that over and over and over and over and over again, And so you have to practice it in fun, simple ways so that you can do it in ways that could actually produce life changing results over time. next part, which was key, is, I had all these ideas. someone asked me this morning on Twitter, they said, How do you go from a six to seven figure business? And the first answer to that is you have to be working at a million dollar opportunity. Some business opportunities, If you try to create a local pho delivery business, I just don’t think that’s a million dollar opportunity. And so how do you know that? You can go look How much is pho? How much do people actually spend on that a year, if at all, in your local area? Now you want to do a delivery? how much do you think people are spending? And If you’re doing things that are in small markets, you’re going to work hard either way. Find the market where there’s a lot of people that are doing it and they’re spending money on it. And so what I like to do is use Google Trends to see how markets are looking. So look at Pho, look at Austin. Someone had the idea of an Austin taco tour. I think that’s a million dollar opportunity. What you do is you’re saying, all right, how many people are in Austin? How much are tours? There’s 1 million people in Austin and there’s 30 million visitors a year. So that’s actually a pretty sizable amount of people. Tours are 50 bucks. a lot of things I teach is like super quick because you only have a weekend because everyone, you know, you have two kids, you’re barely getting by with, having free time for yourself. So how do you do it quickly to know that it’s going to be that opportunity? And the next thing I aim to do is. Let me at least look at a light business model to see how economics will work. And so for Austin taco tours, let’s just say that one is 50 bucks for a tour. And maybe you pay a college kid or someone 25 bucks. So that’s 25 like that’s a lot of tours. And really, to make a million dollars. That’s 4000 or is it 40, 000 tours? That’s a lot, right? And so by using a very quick one minute business model, you can start thinking, all right, well, I maybe need to do corporate events, or maybe I don’t need to do this business. Let me find something where. It won’t be as hard over some period of time, maybe years, to make a million dollars. I tried a lawn care business, that was one of ones, and I went door to door knocking trying to ask my neighbors to sign up for lawn care. And a lot of people ask this question, they say, how do you know when you have product market fit? And the easiest answer I’ve seen in 20 years of doing startups is that you’re not having to convince people to give you the money. They want to give you the money. And to be clear for everyone, I’ve done so many businesses where I’m begging. I’m like, please. Andrew Warner: like what? Noah Kagan: we try to compete with Klaviyo. We got a domain and we spent maybe a year building software called meetfam. com. Don’t go to the site. And then I like begged friends. I said, can you do Klaviyo? I’ll do anything for you. And they’re like, yeah, just already use Klaviyo. And I noticed that the same thing with SendFox is that a lot of people like, yeah, I’m already on active campaign or I’m on whatever MailChimp. And I’m like, this is really hard. Should it always be this hard? No, because if it’s hard in the beginning, it’s only gonna get harder. we built a thing called Hall Drop, which was, I don’t even know how to explain it. You like drop products, try to convince people to use it was hard, try to explain it was hard. Most of the best businesses are simple to explain. Yeah, Andrew Warner: were talking over COVID and you’re like, I can’t talk right now. I’m selling weights door to door here in Austin. I go, what the hell are you doing? Noah Kagan: I was showing examples of how every business can be started in a weekend, if not sooner, Andrew Warner: So this was you starting a weight selling business locally in a weekend. Noah Kagan: Yeah. So what I noticed for myself was I wanted to work out, but the gyms were closed and I didn’t have weights at home and Amazon was out of it. And so I thought, Hey, that’s something I’m struggling with. I wonder if others are too. I posted it. In our Slack group for AppSumo. And a lot of people were like, Oh my god, do you have weights? And by the way, business doesn’t have to be so scary. that’s why the book starts with how to get better at asking. You can just ask people for feedback. Hey, what’s up friend Andrew, Warner. I hate DocuSign. Do you ever use DocuSign? How is it for you? And you’ll be like, oh my god, I signed up for 3, I have a subscription, oh really? What’s annoying about it? Oh, okay, what do you love about it? Oh, interesting, and the way I break it down is L O T. So you listen to someone, then you give them options, and then you transition them to pay you. So the option is so it sounds like you’re pretty happy with HelloSign, but you want templates, which is what you said, and you hate the subscription. If I can do that, and it’s 29, how does that sound to you? Andrew Warner: Wait, come back to the beginning of this. So people said, come up with an idea. They gave you a few different options. You were thinking, okay, I like software. You launched it in one weekend. How did you sell it? And then how much did you sell? What was the number? Noah Kagan: So start starting and start asking, practicing that. Then make sure it’s a million dollar opportunity. And then in terms of validation, there’s three ways to do validation. So there’s pre sales, which is the best way to do it. Then there’s marketplace posting. So looking where there’s people raising their hand to spend money. So Nextdoor, Etsy. Facebook marketplace, Craigslist, a lot of places where people are trying to spend money on things. And the last one is, I would say an older school way, which is landing pages and ads, which I don’t like it because it takes time and money. And I didn’t have time or money really that I wanted to spend or show people to spend it in this example. So the way I did it here was I noticed, Hey, over the years, I’ve gotten a lot of people sending me hello signs and docu signs and Panda doc. So I went to my Gmail and I said, search. Everything that was a hello sign email to me over the past five years and I took every single person and this is what I recommend in all businesses call it a dream 10. I just listed every single person on a Apple note. I literally just made a list. And my goal, so what I recommend for people is, can you get three customers in 48 hours? And, if you can’t get three, it’s gonna be much harder to get beyond that. And let me be clear, I didn’t have a Shopify site, I didn’t even get a domain, I didn’t create social media, I didn’t do anything. I just created this Dream 10 list of people who’ve sent me DocuSigns, and I thought, if they’re using it, maybe they’ll want to use an alternative. who was on that list, which is interesting, is my accountant. social media people who’ve agencies who’ve I’ve hired my old bookkeeper, an SEO agency who’s interviewing me in the next few weeks. My wealth advisor, realtors like Dave Shapiro, I think you know Dave, my other realtor friend Rick Orr. Ian Schoen from Tropical MBA, he sent me, one. Jack Paxton from Top Growth Marketing. So it was all these people andso when I’m contacting them, I’m working backwards from who I think the customer is going to be. So I call them up and I said, You’re not waiting. And I only had a very little time to show this and I wanted to make at least a million dollars and a million dollars a year is 2, 700 a day. So I was like, can I make that? At least in a day. And so when I talked to these people, I said, Hey, can I call you real fast? Hey, do you have a second? And I just did the same thing I did to you. Listen, option transition. Hey, you sent me a docusign. I’ve been working on this alternative. Tell me more about how it’s going for you. Ah, okay. Well, my option is it’s going to have a one time payment. It’ll have at least some of the basic features and I’m going to get it to you in the next 45 days. Sounds great. Now. What was interesting is two parts. Number one, I did get rejected. Andrew Warner: Did David Shapiro reject you? Noah Kagan: Dave actually said yes, normally I was expecting him to reject me my neighbor spends 10, 000 a year. On DocuSign, and I’m like, oh my God, yes, you’re going to just give me the 3, 000 one time payment. And he said, no, and I said, how come? He’s like, well, I’m never a beta customer. I was like, oh, how come? Well, I like to make sure that the technology is tested. Okay, what kind of test would you like to see? And it’s interesting because when people say no or not yet, it’s a rejection. And I do think no’s are not yet but. lot of times it’s like, well, let me try to understand it. And the promise of payment is a rejection. Another example, I was in a WhatsApp group for Austin CEOs. I posted, Hey, does anyone here use DocuSign or an alternative? And a few people, I think three said, yeah. So I messaged one of them, And she said, Oh my God, I hate DocuSign. Are you working on alternative? I was like, yeah, I’m working on one. What do you hate about it? And so again, ask open ended questions. Listen, Oh, I hate the subscription. I hate all these things. I’m like, okay, what are the core things you need? I need templates. I need signing and I need reminders. Okay, great. Sounds like I can do that, and it’s a one time payment, and I’ll have it for you in 45 days. Do you want to sign up to be one of my, the early customers? Ooh, uh, What, when, when’s it coming out? I’ll just wait for it then. Okay, how come you want to wait for it then? Yeah, I just, uh, I’m, yeah, I don’t, I don’t know. I’m just not ready. And I was like, okay, thank you. And so this is the thing in business though where most people are afraid to ask and you don’t have to make it this big scary thing. I just asked, Hey, is it interesting for you? And when they say they’ll pay you later, that’s a no. But most people are like, okay, let me go build it. And I’ve done this twice where I spent six months building something. One was betarcade. com and the other was a payments system for Disney. I brought it six months later and they’re like, ah, we don’t want it.And so that is why. You have to validate before you start running really fast in the wrong direction. so the other point that was interesting is that I noticed that through calling people, the actual customer, that’s my sweet spot, is agencies. So agencies. were going to be the customers I should focus more on. Then I was thinking, all right, well, who are agencies I’ve worked with? How do I look up on LinkedIn? Anybody who’s been an agency. that was something though, if I was sitting on the sidelines, planning and preparing, it would have been hard to know versus getting going led me to that outcome pretty quickly. Andrew Warner: big agencies, or are you talking about a one or two person shop doing something? Noah Kagan: small agencies. So it was noticing that, Oh crap. Agencies have a lot of, these documents. And so that was a light bulb moment that I noticed that I was able to then focus more on as I was doing the challenge. Andrew Warner: So overall, how much money did you make? Noah Kagan: I did 3, 000 in one day and the thing that was interesting for me is it was exhausting. Everyone has friends and network and colleagues and past clients that they can work with. Andrew Warner: It was 3000 for one day, but isn’t a weekend two days essentially and part of Friday. So, Noah Kagan: video. So, the first day I went out and did the dollar challenge. I did the coffee challenge, and then I worked through the market validation Andrew Warner: ah, got it. So one day for selling the others. Mart is trying to figure out what to sell and validation. Do I have that right? Noah Kagan: That’s a good way that I’ve noticed people are naturally taking the book, which is one day is preparing and the second day is really the selling. And you have to be okay that if people don’t want it, great, ask them why not. And for people out there, they’re like, well, how are you going to build the software? So now that I have the money and I have the customers, it is so much easier to build the software. So I’ve taken the 3, 000 and I’m giving it to Garrett to build that. The other thing you could do is there’s Muhammad. Muhammad. is a guy. It’s 12 an hour, maybe with inflation. Now he’s 13, but he’s the guy for 48. Me and him put a PayPal button on AppSumo. com 14 years ago. So I would go to someone like him, or a more likely, freelancer or Upwork or someone in my network to then build it. But it is a million times easier with a customer and a problem that people are excited. To have solved then the other way where you build it and now you have to go find people that have a problem, Most people have solutions and they try to find problems. I try to find problems and then bring the solution because now being resourceful as an entrepreneur is way easier. Now I have customers in the money. Andrew Warner: Alright, let me tell you about, uh, Gusto. Here’s why I signed up for Gusto. You told me you had a positive experience for them. I’d love to hear yours. My issue was, every freaking year, around April 1st, actually no, it’s not even April 1st, it’s the end of January, I had to get A list of who I paid the previous year, all the contractors, all the, anyone who I was paying more than I think, what was it, 400 and organize it for my accountant. And I tried QuickBooks for paying my people and I couldn’t get a clear statement from them. I tried PayPal. I go, you know what? Screw it. I’m going to go with PayPal. Let PayPal actually do their 1099 K or whatever the, the, that thing is. And that became a headache because I can’t pay everybody by PayPal. And there are all these different issues. I found Gusto. Clean, so easy even I could do it. So easy that they understood exactly what was coming up and it did everything. So that’s why I switched to them. What’s your experience with Gusto? Noah Kagan: the cool story with gusto for me is when I was new to the job market in 2005, I started putting on conferences and I met Josh Reeves, the founder he was working at a startup, he was trying things, and then to see him finally find something that was such a huge hit, I’ve had that problem personally. It is a pain in the ass to do 1099s. What I want to have everyone out there think about is, make it a problem for yourself. Make it a problem where you’re like, man, I gotta pay more people and I’m dealing with this problem. So that you need gusto. Andrew Warner: You know, I was actually paid by someone. They, they read my book on how to interview. He wanted to know how to do better job interviewing. And he said, can I hire you as a coach? And I go, you know what? Fine. I don’t need the money for it. I don’t need the agita of once a week getting on a call with somebody and working with them, but I want to be a better interviewer myself by understanding what he’s going through. So his people were very nice. They said we’re gonna pay you, putting you on our system. Freaking system was such a pain in the ass. Every few weeks I would go in to try to deal with it, and then I said screw it. I don’t care. I’m just not gonna do it. I didn’t get paid a dollar for it, because it’s not worth my effort to go and deal with their stupid software. and maybe you could say they save themselves time, but most oh, they save themselves money by not paying me. But I think for most of the people who they’re working with, They are going to have to pay and they have to deal with this trashy software. What a bad experience. Anyway, Gusto, so fricking good. Your people will enjoy using it. Go to gusto. com slash Mixergy to try it for free. All right, YouTube, I want to close it out with this. What’s the advantage for you of doing YouTube at this point? Why are you doing this? Noah Kagan: I like it. Andrew Warner: What do you like about it? It seems like it’s just another job for you where you’ve outsourced everything, including go plant seeds in my garden or hire a gardener because I drove over my own lawn. Why then not hire someone to do your social media instead of you putting your face out there. Noah Kagan: I like how it’s helped me meet people like you. Which you led me to meet Chad, who became my first customer at my first startup. Which led him to become my business partner. Which now, almost 15 plus years later, we’re running AppSumo together. Andrew Warner: You’re saying you do social media and you get to meet people beyond the audience. It’s more like you get to meet one on one relationships Noah Kagan: and the audience. like today There’s a guy who emailed me back here. He works at 33 degree boards. It’s a surfboard company out of San Diego I’m like I know who he is cuz David Kelly the guy who runs up some originals Surfs a lot and he uses those boards and that guy reads my newsletter and that’s so cool Or I can go to Spain and people are like, hey, do you wanna come have lunch? And it’s not that I always want to meet every single person, but it’s put me in a place To meet people like that or interview people that I admire and I’m curious about. And so what I do hire out though, Andrew is a lot of the work I don’t want to do for the content. So do I want to do pre production and all the question planning? No. Do I want to do video editing? No. Thumbnails? No. And twice a month, three times a month, I go and film either a person I’m really excited to meet, or I do a challenge, which I don’t want to do, but I’m always proud of myself afterwards. I do like it. As I’m getting older and, having a family and so forth, I’m not gonna be doing as much of I want to travel and go on the streets. So there’ll be some evolvement of it or evolution of it. I really do love it If people can find things that they can do for at least a decade, that at the end of the decade, I think people will be shocked about how far they’ll be. And so for me with content, it’s a balance of how do I do content I like, that I enjoy, as well as what people also want to watch. Now I gotta give you a quick warning for everyone out there though. I put out a YouTube video last week, and I have over a million subs. And 000 people watched this video. We have millions of subs. same with Apple with podcasts, now they don’t auto download. So your podcast downloads went from whatever, 30 percent down. It was a great reminder to go get an email list for everyone out there. go to ConvertKit or, I use SendFox. com or MailChimp. But if you don’t control your audience and your customers and the platforms do, you are very likely to get screwed. And that’s happened to me. I built, Facebook games and I built Facebook payments for games and then one day Facebook banned us. And that was the lesson that I was like, I am not in control. And the same thing with a day job. If you have a day job, one person controls your livelihood. So create your own business, whether you want to quit it and do it full time or you just want something on the side so you have a backup plan that frankly is enjoyable. Andrew Warner: write your own email newsletter? okay Noah Kagan: who’s phenomenal. We’re actually, I’m going to put out content in the upcoming weeks of all the people who helped me with this material. So her name is Sylvie Bryant. I think she’s either in Vegas and Toronto. She is amazing. And she puts together the draft of the email. So we have a Slack channel where I’ll post stuff that’s happening or she’ll see stuff that’s happening. And she also, has a folder of all the, Of my photos. Every photo I take, it goes to a folder that she has access to. I trust her and then she’ll put together the email. then I’ll approve them and then she’ll set it up and send Fox and make sure they get sent out. Andrew Warner: When you were talking about challenges for YouTube I remember seeing one video of you where you were getting on a first class flight and you’re gonna talk to people about How they got so rich And I think there was one person who just didn’t want to talk to you, which feels like such an awkward experience to be either stuck in the lounge with someone who doesn’t want to talk to you as you’re walking around with this mic or on a flight. That seems like the kind of challenge that you want to put yourself through. Noah Kagan: I don’t, to be clear, it’s not, no. I have anxiety. maybe at least a week to a month before most of these challenge videos. What I’ll say though, is that every time afterwards, I’m always proud of myself. And I think that’s such a powerful lesson for all of us, which is what is something we want? I do want to do these videos, most of them, and it’s hard. the other side of that is confidence. On the other side of that is belief of who you are and what you can do. And a lot of what Million Dollar Weekend is that it’s like, Hey, you can do this. You gotta start, and you gotta get a little bit of rejection. But guess what? You’re gonna get a lot of acceptance, and you’re gonna get a lot of yeses, too. And it’s led to such a cool experience. One of the videos was me standing outside a private airport asking to get tours of planes. And one of the guys said yes, barely. And then I said, hey, can I fly with you? With me and a videographer. He said, sure. And that’s a 100, 000 flight. That I just asked, I didn’t have any advantages that anyone else couldn’t have. Maybe because I’m male, not female. Maybe it’s even harder, I don’t know. But you can go and ask for different things that I don’t think are bad. I think people think of asking and selling as a negative. I think it’s a positive, and you can do it in silly ways, Hey, what kind of shirt are you wearing? Oh, really? Where’d you get it from? That’s a nice one. And then you can start doing that in other areas. last night, I’m out at this dad party. At Bob’s Chop House. And guess who’s at the bar? The guy whose private jet I was on. Andrew Warner: Ah, ha Noah Kagan: That was so crazy. I haven’t seen him in a, I don’t know, almost a year now. And it just made me realize like how cool it was just because I did a small ask led to this now having color of a person. And richness in life, not even just richness in money, but richness like, I just asked the person. So an easy one for anyone out there is if you see someone with a nice car, if you go to someone’s house, if you go to even your own dentist or doctor, oh, how’d you get rich? Tell me more about it. I’d love to learn from you. And I think people would be surprised with the upside and the things they can find out. And the downside is maybe they say no for a brief second, but the upside is really unlimited. Andrew Warner: Were you there with your own camera or did you have one of your videographers with you? Noah Kagan: Isaac, who’s in Austin, did that footage. The first class passengers was just me, I just used my iPhone. So I had an iPhone, and I just filmed like, hey, what’s up? Andrew Warner: Noah Kagan: You can make content with your phone. That’s how I started the YouTube channel. Each video now that we do takes two weeks and costs around 25, 000. My first videos were me shirtless with an iPhone, and we all have a phone. Andrew Warner: 000 for you going to an airport and ask people how they got rich. Noah Kagan: So, the videographer, his roughly 1500 day rate. There’s a producer for the show, so he’s, let’s just say about 10, 000 a month. And then there’s a video editor, that’s another 10, 000 a month. Then there’s a thumbnail designer. Right, then there’s a researcher, and then we have a YouTube consultant, so all things considered, it’s like 30, 35k, give or take, maybe 50, depending on the month, if we travel, to do a video, you know, what salaries are, and then we do two videos a month, Andrew Warner: You have told me that it does help the app sumo business, Tell me what the impact is on your business. Noah Kagan: We’ve surveyed, and around 35 percent of AppSumo customers know who I am. You don’t have to be in front of the camera. You can have someone else out there, but it is very helpful to grow an audience for free. Or you can, pay a team over time for free via social media, via TikTok or Instagram or LinkedIn or wherever you find that your ideal customers are. Andrew Warner: All right. book is called million dollar weekend. I’ve been a part of some of them. Now I’m part of this latest million dollar weekend experiment. The one that I thought was the best one for me to watch was. You were doing beef jerky. I’m not a beef jerky person anymore. And so you go, why not? And I said, well, I eat fish occasionally go How about fish jerky? I never tried that. Hell yeah. And then in the book you talk about how you thought about the economics of it. Well, I can sell this many to get to a million dollars. Or, I could sell a lot fewer subscriptions and get to a million dollars faster with fewer sales. Or, I could sell to businesses who are then going to buy for their whole team. And I’m not going to sell to businesses jerky. I’m going to sell them, do you want to make your people happy and healthier instead of giving them all the chocolate stuff that you have around the office or something like that. And then you’re able to sell even more. And that’s one of the things that I like about you. There is this Yes, I’m eager. I’m willing to do the hard work in the beginning stage of Noah, but Noah’s also really good at leveling up and going, where’s. The that fulcrum that place where if I apply a little bit of pressure, I can get a lot more results and for jerky It was apply a little bit of pressure to a friend or someone else and sell a company But I’m gonna get a whole lot of orders from it and I like the whole book is full of reasonable ideas like that It’s called million dollar weekend and it’s written with this guy tall Roz if you don’t know him You’ve probably read his books before he’s only co authored two books before. What are the other two? Never Split the Difference and Noah Kagan: Never eat alone. He also wrote The CEO Next Door. And he actually now does, private books. So for basically billionaires and people worth nine figures, they’ll commission him to write a family book just for their own family. Andrew Warner: Because he’s such a good writer. It’s full of great stories. Phenomenal book. Congratulations. Million dollar weekend. Noah Kagan: Thank you. Noah Kagan. Thank you everybody. Oh, thank you. Gusto. Bye everyone.",
  "image": "https://mixergy.com/interviews/noah-kagan-shut-up-and-take-my-100/?get-twitter-card=true\u0026v=14\u0026time=1706598053",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\t\t\t\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Hey there Freedom Fighters. My name is Andrew Warner. I’m the founder of Mixergy. We’re going to interview entrepreneurs about how they built their businesses. And today I’m going to be interviewing somebody who’s going to tell you how you should be building your business.\u003c/p\u003e\n\u003cp\u003eHe’s my old buddy, Noah Kagan. I watched him launch his business, AppSumo, here on the podcast, back when it was just a little more than an email list. and he did it. We’re going to find out how big AppSumo, the site that gives entrepreneurs deals on software and other tools, how well that’s doing. And we’re going to find out about his latest book, which is called million dollar weekend.\u003c/p\u003e\n\u003cp\u003eI’ve seen him build several companies in a weekend. I’ve actually been the customer of some of these experimental companies that he launched in a weekend. And I’ll ask him about the book, ask him about how his business is doing. And then also ask him, why is it that the last time I was at his house, there was a plaque from YouTube for a million subscriber, whatever, achievement that’s just sitting there with a bunch of shoes on top of it. all right, we can do all that. Thanks to my sponsor, Gusto. If you are paying people who are working with you, you owe it to them to give them a good experience to let them see how much you got paid, to make it easy for yourself to pay them and to give them benefits and to keep it all organized.\u003c/p\u003e\n\u003cp\u003eAnd that’s why later I’m going to tell you why you should go to Not gusto, but gusto. com slash mixer G. No, you like a good deal. I see you’re typing that in you should go to gusto. com slash mixer G. All right. Let me start with this question, dude. I saw you do an interview last night I was just kind of scrolling before I went to sleep and I saw you do an interview where the very first question you Asked the person was What’s the best part of being rich now?\u003c/p\u003e\n\u003cp\u003eDon’t punk out be like the interviewer Noah who wants somebody to be open not the guy who goes, you know It’s just being happy with my girlfriend and all that. What’s the best part of being rich balls out?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: it’s about sharing it and making sure you’re being generous with everybody, but yourself.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Yeah, don’t don’t give me any of\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I know, I know. But people always give this thing to in business. It’s like, first off, I want to thank my team. And it’s like, dude, just thank yourself. Everyone. Everyone. And I know it sounds bad, too, at the money part, but, I think,everyone, including myself, we all take ourselves down, and then we don’t, just keep it real, and it’s okay to take a compliment, it’s okay to say, hey, I worked hard, and I’m proud of something. What’s the best part of being rich? A lot of things, I would say, and I never really enjoyed it until the past, until COVID, I didn’t really enjoy being rich. I would say not budgeting is probably the best part of being rich. I did a CNBC show called Make It. And I didn’t even know how much I made last year.\u003c/p\u003e\n\u003cp\u003eIt was 3. 3 million dollars.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You personally or the business?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Me?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I was like, whoa. after a mil, like, it’s more, way more than enough. And then, I don’t even know how much my expenses are. They’re like, how much is your insurance? I was like, I don’t, I don’t know.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: because you used to budget to that degree\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I still do a monthly net worth evaluation, so every month that I’ve done this for 15 years, I use a Google spreadsheet, which attracts every single one of my assets, every single one of my liabilities.\u003c/p\u003e\n\u003cp\u003eAnd it just gives me a cash liquid net worth. I don’t do valuation in that. yeah, overall, I don’t budget. And that’s a great part of being rich. Like you go to the store, you go to the, like last night I was at dinner with Ian, Dan Taylor. At, Bob’s Chop House in Austin. And it was nice, I could just pick up the bill, it was 7 50. And it’s not a concern. And I do recognize there’s a lot of people who are like, either paycheck to paycheck, or 7. 50 is a lot. And, I can buy duplicates of things. So I have a duplicate of a lot of my stuff that’s in Austin, in Spain, where I spend half the year with my girlfriend. That’s a super luxury. Hiring people is super luxury. hiring a house manager to take care of things around the house. Not worrying if things break. Which I don’t want him to break, but if something breaks, I know I don’t have to worry about the money for it.\u003c/p\u003e\n\u003cp\u003ethere is a lot of great things, and for 20 years, I don’t think I even enjoyed any of the money I had.\u003c/p\u003e\n\u003cp\u003eIt was only in these recent years I’m buying Rolexes, and I’m proud of myself. And I get Rolexes for certain moments in life. Wow, that sounded like an ad read. And I talked to someone yesterday who’s frustrated. And he’s like, I’m jealous of you. I’m like, what are you jealous about? Tell me about it. And he’s like, it seems like everything’s going your way and I’m like, yeah, I feel very lucky and blessed, but it’s not exclusive. It’s not something that no one else can be where I’m at or even beyond it. And also I started 10 years ago to be able to enjoy it today.\u003c/p\u003e\n\u003cp\u003eAnd you can do the same thing. So in the next 10 years or next five years, you could have all these things or however you want to live, but What I noticed was really enjoying the victim role and the, well, it’s for Noah, not for me, and I was like this is not exclusive, but you have to start right now, and you can do that, too\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: What’s the house manager thing? I was at your place, and you said, I know you’re coming over, so I got you Middle Eastern food, or my house manager did, but I’m really curious. What does a house manager do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: So I have different assistants I probably have five different types of people that can help me with different things which I used to feel self conscious about like you sure you want to help me am I just pain and I feel awkward about it candidly the house manager specifically It’s just anything around the house that needs to get done. And some of it, I think it’s good to wash your dishes. And what I mean by that is if you outsource everything and you don’t do any hard work, I think you get a little soft. but there’s things like hanging up my painting. It’s been sitting in the stairwell. Now two months and by the way, I think this is a business opportunity is house managers on demand So my grass, I killed some of my grass because I parked my car over it I just lately have been so focused on my girlfriend or the book Million Dollar Weekend and AppSumo or YouTube that I have not Had time nor even interest in prioritizing that so there’s just like numerous things Buying, what are those a welcome mat?\u003c/p\u003e\n\u003cp\u003eI have a sauna So I want a welcome mat that’s says namaste or something silly Just like small little things I have a shared to do list.\u003c/p\u003e\n\u003cp\u003ewhere I just put the things that have been backlogged around the house. And it’s definitely a luxury.\u003c/p\u003e\n\u003cp\u003eI’ve had three house managers. They’ve all quit. but then when they quit, I do it myself. I’m like, nah, it’s fine. But it definitely, uh, nice to have not a must have,\u003c/p\u003e\n\u003cp\u003eand that’s a great part of being rich is that you can afford that and also gives you time to do the things you want or do just sit on your ass too.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Why do they quit?\u003c/p\u003e\n\u003cp\u003eOne of them quit because I was leaving to Spain and she wanted me to pay her and I said I can’t pay you the full amount because I don’t need you to do anything around the house but can you suggest other things you can do and then I’ll pay you for that and she got frustrated about that. One of them quit unexpectedly. She had a kid and I think something happened with her kid so she left Houston one day and was like, I quit today. She was nice about that. And the last one, she was always sourpuss face.\u003c/p\u003e\n\u003cp\u003eMm.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: hey, do you mind doing this? I’m paying you, and I think it was like 30 or 40 an hour. And she would just always make me feel guilty about it. She’s like, you want me to do that? And I’m like, that’s literally your job. You don’t have to do it, and that’s okay, too. But it was always pretty sour. She was really intelligent, and she did get some things done. but it was always with a bad attitude.\u003c/p\u003e\n\u003cp\u003eAnd it’s just, it’s nice to be around optimistic people.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right, let’s go to AppSumo. What’s the revenue and profit at AppSumo now?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Last year we did about 80 million gross revenue, net revenue 53 million, and then profit was about 7. 1 million at AppSumo in 2023.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: And so the rest of the money just gets saved in the AppSumo account? No, actually, you don’t take any money out of AppSumo, I imagine. When you said 3 point something million, that’s from what?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: So with AppSumo, we copy Amazon and a lot of things because I like how they operate their business. And what they did, if you look at their strategy, was that they invested or even lost money for maybe 15 years before they started making serious profit. And so we’ve replicated that where If you actually look at our net income over the past 14 years, it’s very small.\u003c/p\u003e\n\u003cp\u003eIt’s maybe after everything at the end of the year, maybe half a percent of. Profit. And so what we do is we have a budget for the whole year and we target at least a 10 percent not operating income. And in Q4, we taper down the spend or we taper up the spend and down the operating income, investing in distribution to the team.\u003c/p\u003e\n\u003cp\u003eSo they get fat bonuses. I think we did 1. 2 million to the teammates we spent. Almost half a million dollars on an all expenses paid trip for everyone who wanted to go to Mexico. We bought servers, we bought copies of the book to give to our VIP customers, we buy ads, we sponsor people. And then there’s a distribution with whatever’s left, to me and Chad.\u003c/p\u003e\n\u003cp\u003eChad’s the guy you introduced me to, that helped run AppSumo now. And so that, that’s only at the end of the year, if things are going well, is the, investments and distribution. And so for myself I’ll share it at a high level. my actual, base salary. I finally got a raise at AppSumo.\u003c/p\u003e\n\u003cp\u003eMy boss gave me a raise, which was cool. my base has been 175, 000 for about five, six years. And I was like, man, I think my mortgage plus property tax is like 12, 000 a month. I was like, it’s not like a huge savings to pay for that. So I got a raise to 250, 000, which was nice. And. The way I distribute it is at the end, I think my AppSumo salary ended up being a little over a million. And then the other one and a half million dollars is the company sponsors an LLC I have, which is all of my content creation business. So I do that for one, mostly tax reasons, it’s tax advantageous for everyone out there if you don’t have an LLC, whether you’re an employee or whether you have a company, there’s a lot of advantages to that, which I think people miss out on. And so, because I have a content. You know, YouTube and the book and all these things in a separate LLC, there’s a lot more expenses against that money that goes in via AppSumo as a sponsor of LLC.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: I was looking over at my bookcase because I remember at one point you published a book on these types of techniques that people who you know are really rich use\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I think that I took it offline because I wanted everything to be focused on Million Dollar Weekend. I had a lot of free time and I was bored. And so interviewed rich friends and the book is called Things That Rich People Don’t Want You To Know. Some of those things, I did it myself, because I think governments are very inefficient, and I think private business is the way to, have money be distributed, generally.\u003c/p\u003e\n\u003cp\u003eI think there’s some parts of government that are good. and so I wanted to figure out ways, like, art donation is an interesting one. You know, having an LLC is one that I think people are pretty familiar with, conservation easements. There’s one now, which is defined benefit plan, which is you create your own pension plan as an individual person. And then you can put up to almost 200, 000 a year tax free.\u003c/p\u003e\n\u003cp\u003eLet’s come back to AppSumo. I was paying Calendly forever, and I wasn’t really using a lot of their features. I said, why am I paying for this thing where I rarely use it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: And then I found and it’s pay one time and I thought, all right, I’m going to get a lifetime deal, 29 or whatever. And then they’re going to increase the price and switch to monthly. You never increase the price and switch to monthly.\u003c/p\u003e\n\u003cp\u003eI’m now seeing there’s a bit of a movement in software creators to sell one time prices. What are the economics of that? Of selling software at one time instead of a monthly fee?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: the strategy at a high level for people to copy So everything you buy on AppSumo is pay once, use it forever.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Like I bought Cast Magic. I have lifetime access. I talked to the founder. I said, why are you doing this? And he said, I need people early days of my software so that I know what’s working, what’s not.\u003c/p\u003e\n\u003cp\u003eAnd frankly, it’s a good cash infusion today. And then later on, we’ll figure it out and we’ll charge people a monthly fee. It makes sense for him. That’s not his whole model. The idea of TidyCal going one price forever\u003c/p\u003e\n\u003cp\u003eThat’s interesting. What are you seeing here?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: We’ve been doing it for a decade and we’ve been promoting these lifetime deals. So specifically from our strategy, it’s how do we have low cost popular tools that are also viral that will bring people into the absolute ecosystem? So the easiest way to think about it in your business is what’s the lifetime value?\u003c/p\u003e\n\u003cp\u003eSo how much do people stay? And spend with you. And then what’s the cost to acquire them? And if you can even do napkin math to understand, Hey, people spend, so tiny cows, 29 bucks, the profit on that though, is 28 or whatever, after the processing fees. that doesn’t necessarily cost, I think it depends on the channel, but our costs could be higher,\u003c/p\u003e\n\u003cp\u003ethat brings\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: though because there’s still software updates. You guys are updating it. I remember firing off a message to you saying, there’s this thing I need. But then a few weeks later, the feature was put in. You introduced me to the CEO. He put it in. I got the feature. That takes software. That takes time. That takes people.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Yeah. That team costs 60, 000 a month. And so that’s the originals team. So we have sendfox. com for email, which is a MailChimp alternative. kingsuma. com, which is giveaway software. A lot of these are tools we frankly like and use ourselves. I use all these myself.\u003c/p\u003e\n\u003cp\u003eAnd so the economics is let’s take kingsuma.\u003c/p\u003e\n\u003cp\u003ecom or sendfox. com. We haven’t really updated them actively in two or three years And they still work. They work great. I use Senfox every single week. and they’re generating in terms of the sales, maybe, let’s give it to, I haven’t looked at them specifically, but let’s just say 3, 000 a day in profit.\u003c/p\u003e\n\u003cp\u003eSo that’s 90, 000 a month. And that’s just direct sales. What we use this for really, our number one thing, is bringing new buyers into the AppSumo ecosystem. And so, TidyCal. com as an example, I think brought in, 21 percent of all new buyers in 2023,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Oh, whoa, whoa, whoa, whoa, whoa. Wait, wait. 21% of customers who came to your marketplace, new buyers, who came to your marketplace came because they want this Calendly alternative for a one-time fee. I see. So for you, it’s not just the revenue that you’re making in the profit, and you’re saying you are making good profit from this.\u003c/p\u003e\n\u003cp\u003eIt’s also the ongoing customers that you get from this\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: percent. the problem with AppSumo is, and this is a thing you can use in any business. what’s the thing that’s the consistent bringer inner of new people. And for us, it’s these products that are low cost for things. Cause on AppSumo, a lot of the deals go away. like you need a AI, podcast tool like Cast Magic or Neuron Rider, which is an AI writing tool. a lot of those can go away, Cast Magic doesn’t want to come back right now, but TidyCal is forever. And then we can keep building off, alright, how do we build our affiliate stuff off of TidyCal? How do we have more ads that keep running off TidyCal? And at some point there’s a feature set that’s, 80%. And so, I think I pitched you on it, but in the next 30 days, we’re launching a DocuSign alternative. So how do you stack rank things to see what’s the biggest opportunity?\u003c/p\u003e\n\u003cp\u003eSo we stack rank based on one, what do we like? Two, what’s viral? And then three, is there a high cost alternative? And that led us to say that DocuSign which I’ve used Million Dollar Weekend to validate it. the DocuSign alternative is the biggest opportunity for us. And so that’s what we’re launching in the next 30 days.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That was your weekend project that you did to prove that the ideas in the book work. that’s why I know about it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Did you pay?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You never hit me up! Dude, you, I should have actually brought this up when you and I talked. I walked away thinking I use HelloSign for their free tier, but there’s an issue with HelloSign in the free tier, and that is that it doesn’t have templates, which is a thing that I need, and I’m limited in a weird way, and I accidentally keep paying a monthly fee, because I have multiple accounts with them, I find that there’s this payment.\u003c/p\u003e\n\u003cp\u003eBasically what I’m doing is I’m gaming HelloSign, which is no way to run a business because I have all these little issues with it. And DocuSign is too clumsy for me, I should have just brought it up and just taken advantage of whatever the low price is because I know you’re going to invest in it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Yeah, the economics work because we do get them in at 30 and then they spend more on other products throughout AppSumo. so the, the overall channel, it’s a very effective one.\u003c/p\u003e\n\u003cp\u003eSo by the way, everyone that’s out there, A lot of businesses, you can start it a lot easier than you expect. and this is, something I talk about in the book and it’s what we do at AppSumo. how are you testing things really quickly, finding the thing that works, and then going all in on it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: test and invest is one of our values. And so we’ve tried, I think, nine different AppSumo original products and really only Three and really only one tidy cal has been like a rocket ship. And so, in business, the first thing that doesn’t always work is you try, try, try, try, try, try.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: And then when you find the thing working, really doubling down. So there’s a team behind Tidy Cal, and instead of moving the team off to do something new, it’s like, no, stay on that. And we’ll hire more people to build more original products.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: One of the things that I noticed is SendFox is good, but the email marketing competitors have gotten really good. ConvertKit is now allowing people to subscribe to other people’s subscriptions as a way of growing. They’re adding, advertising, they’re adding automation and all that.\u003c/p\u003e\n\u003cp\u003eOne of the things that’s happening here is SendFox is maybe 50 percent of the feature list. There’s another 50 percent that is for people who are living in email as a business. And it seems like what you’re saying is we’re just not going after them. We’re going to go after the 50 percent that matters most people and keep it that basic.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Think of it as like Google Docs compared to Microsoft Word. You really just write and you need to share it and print it. And there’s just all these other whiz bang features. And the thing with email marketing specifically, and AppSumo, I think half our revenue comes from email marketing. Getting people to switch email marketing was very, very, very hard. And it’s a dedicated business where you’d have to get a lot of support. We have three support people on the originals products, but you have to get an operations person. You have to get a support person. TidyCal, you literally, we have a one click Cal only import. And getting someone to switch off, whatever, 20 a month for 29 for life is a very easy sale. And I think the same thing will be said for DocuSign, where there’s not a lot of investment costs to get you to switch from HelloSign, it doesn’t, sometimes it doesn’t matter how rich you are, you’re just, certain things don’t seem worth it. And I also think that creates great business opportunities.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That’s right. That is what it is. That’s why I have multiple accounts. There must have been some months where I had to send a whole lot of documents. And so I created multiple accounts and then I accidentally paid for one.\u003c/p\u003e\n\u003cp\u003eyeah, the things that frustrate you, or you’re spending money on, or you’re wasting time on, or you have avoided, are all business opportunities.\u003c/p\u003e\n\u003cp\u003eTell me how you started. This is a business. This is an example of what you were talking about in million dollar weekend. It’s the kind of business launch that I’ve seen you do over the years. Where did the idea come from? How did you validate it? And then what did you do once it was validated?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: AppSumo started the same way in a weekend for 50 bucks, which I probably spent too much on it, and it was very quick that this worked. While literally so many of the things I’ve tried, Andrew, Did not work, but you have to get started today so that if you find the thing that eventually works, stick with it. And then you get the compounded returns years later. I think there’s compounded business is this idea that most people are missing out on, find something that works and then just keep doing it for a long period of time. And one, the results will be there, but two, if ideally you do work, you like, it’ll be enjoyable. So with this idea, I wanted to make it even harder on myself, Andrew, following the million dollar weekend process. One, I couldn’t use any of my social media or my email list. For everyone out there, make it easier on yourself. I don’t know why people want to make businesses so hard. It should be easy.\u003c/p\u003e\n\u003cp\u003eIt should be fun. And then the second thing was I wanted the audience to suggest the ideas. So I posted on social media. I said, Hey, I’m going to do a 48 hour challenge, not using any social media. you suggest ideas. So the ideas were, hamster daycare business, physical businesses, e commerce businesses, software businesses, Then I followed the book, and this is stuff at a high level, most people are like, okay, tell me how to start the business.\u003c/p\u003e\n\u003cp\u003eThat’s not even what you need. You need to actually get started. And how do I practice getting started? So I went on the streets of Austin to make it even harder on myself And I asked people on the streets for a dollar. most people don’t become millionaires because they never make the first dollar. And early on in my life, it was risky to have the day job. It was risky to stay at Intel. It didn’t feel risky to, to try at least living the life I wanted. And today it’s amazing. I can’t believe I get to live this life. So I did the dollar challenge on the streets. Then I did the coffee challenge where I went to different Coffee shops and restaurants asking for 10 percent off because business is really starting and asking. Those are the two cores of all business. I got rejected on all of it, except the dollar. Actually, the dollar challenge, I made five bucks. I can’t believe so many people kept giving me a dollar. I actually had to get rejected. I was like, Hey, can you not give me any money?\u003c/p\u003e\n\u003cp\u003ePart one is getting going and practicing asking, practicing getting rejected. Cause business is you start something, you ask people for something. Some say yes, some say no, and then you keep doing that over and over and over and over and over again, And so you have to practice it in fun, simple ways so that you can do it in ways that could actually produce life changing results over time. next part, which was key, is, I had all these ideas. someone asked me this morning on Twitter, they said, How do you go from a six to seven figure business? And the first answer to that is you have to be working at a million dollar opportunity. Some business opportunities, If you try to create a local pho delivery business, I just don’t think that’s a million dollar opportunity.\u003c/p\u003e\n\u003cp\u003eAnd so how do you know that? You can go look How much is pho? How much do people actually spend on that a year, if at all, in your local area? Now you want to do a delivery? how much do you think people are spending? And If you’re doing things that are in small markets, you’re going to work hard either way.\u003c/p\u003e\n\u003cp\u003eFind the market where there’s a lot of people that are doing it and they’re spending money on it. And so what I like to do is use Google Trends to see how markets are looking. So look at Pho, look at Austin. Someone had the idea of an Austin taco tour. I think that’s a million dollar opportunity. What you do is you’re saying, all right, how many people are in Austin? How much are tours? There’s 1 million people in Austin and there’s 30 million visitors a year. So that’s actually a pretty sizable amount of people. Tours are 50 bucks. a lot of things I teach is like super quick because you only have a weekend because everyone, you know, you have two kids, you’re barely getting by with, having free time for yourself.\u003c/p\u003e\n\u003cp\u003eSo how do you do it quickly to know that it’s going to be that opportunity? And the next thing I aim to do is. Let me at least look at a light business model to see how economics will work. And so for Austin taco tours, let’s just say that one is 50 bucks for a tour. And maybe you pay a college kid or someone 25 bucks.\u003c/p\u003e\n\u003cp\u003eSo that’s 25 like that’s a lot of tours. And really, to make a million dollars. That’s 4000 or is it 40, 000 tours? That’s a lot, right? And so by using a very quick one minute business model, you can start thinking, all right, well, I maybe need to do corporate events, or maybe I don’t need to do this business.\u003c/p\u003e\n\u003cp\u003eLet me find something where. It won’t be as hard over some period of time, maybe years, to make a million dollars. I tried a lawn care business, that was one of ones, and I went door to door knocking trying to ask my neighbors to sign up for lawn care. And a lot of people ask this question, they say, how do you know when you have product market fit? And the easiest answer I’ve seen in 20 years of doing startups is that you’re not having to convince people to give you the money. They want to give you the money. And to be clear for everyone, I’ve done so many businesses where I’m begging. I’m like, please.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: like what?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: we try to compete with Klaviyo. We got a domain and we spent maybe a\u003c/p\u003e\n\u003cp\u003eyear\u003c/p\u003e\n\u003cp\u003ebuilding software called meetfam. com. Don’t go to the site. And then I like begged friends. I said, can you do Klaviyo? I’ll do anything for you. And they’re like, yeah, just already use Klaviyo. And I noticed that the same thing with SendFox is that a lot of people like, yeah, I’m already on active campaign or I’m on whatever MailChimp.\u003c/p\u003e\n\u003cp\u003eAnd I’m like, this is really hard. Should it always be this hard? No, because if it’s hard in the beginning, it’s only gonna get harder. we built a thing called Hall Drop, which was, I don’t even know how to explain it. You like drop products, try to convince people to use it was hard, try to explain it was hard.\u003c/p\u003e\n\u003cp\u003eMost of the best businesses are simple to explain. Yeah,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: were talking over COVID and you’re like, I can’t talk right now. I’m selling weights door to door here in Austin. I go, what the hell are you doing?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I was showing examples of how every business can be started in a weekend, if not sooner,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: So this was you starting a weight selling business locally in a weekend.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Yeah. So what I noticed for myself was I wanted to work out, but the gyms were closed and I didn’t have weights at home and Amazon was out of it. And so I thought, Hey, that’s something I’m struggling with. I wonder if others are too. I posted it. In our Slack group for AppSumo.\u003c/p\u003e\n\u003cp\u003eAnd a lot of people were like, Oh my god, do you have weights? And by the way, business doesn’t have to be so scary. that’s why the book starts with how to get better at asking. You can just ask people for feedback. Hey, what’s up friend Andrew, Warner. I hate DocuSign. Do you ever use DocuSign? How is it for you? And you’ll be like, oh my god, I signed up for 3, I have a subscription, oh really? What’s annoying about it? Oh, okay, what do you love about it? Oh, interesting, and the way I break it down is L O T. So you listen to someone, then you give them options, and then you transition them to pay you. So the option is so it sounds like you’re pretty happy with HelloSign, but you want templates, which is what you said, and you hate the subscription. If I can do that, and it’s 29, how does that sound to you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Wait, come back to the beginning of this.\u003c/p\u003e\n\u003cp\u003eSo people said, come up with an idea. They gave you a few different options. You were thinking, okay, I like software. You launched it in one weekend. How did you sell it? And then how much did you sell? What was the number?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: So start starting and start asking, practicing that. Then make sure it’s a million dollar opportunity. And then in terms of validation, there’s three ways to do validation. So there’s pre sales, which is the best way to do it. Then there’s marketplace posting. So looking where there’s people raising their hand to spend money.\u003c/p\u003e\n\u003cp\u003eSo Nextdoor, Etsy. Facebook marketplace, Craigslist, a lot of places where people are trying to spend money on things. And the last one is, I would say an older school way, which is landing pages and ads, which I don’t like it because it takes time and money. And I didn’t have time or money really that I wanted to spend or show people to spend it in this example.\u003c/p\u003e\n\u003cp\u003eSo the way I did it here was I noticed, Hey, over the years, I’ve gotten a lot of people sending me hello signs and docu signs and Panda doc. So I went to my Gmail and I said, search. Everything that was a hello sign email to me over the past five years and I took every single person and this is what I recommend in all businesses call it a dream 10. I just listed every single person on a Apple note. I literally just made a list. And my goal, so what I recommend for people is, can you get three customers in 48 hours? And, if you can’t get three, it’s gonna be much harder to get beyond that.\u003c/p\u003e\n\u003cp\u003eAnd let me be clear, I didn’t have a Shopify site, I didn’t even get a domain, I didn’t create social media, I didn’t do anything. I just created this Dream 10 list of people who’ve sent me DocuSigns, and I thought, if they’re using it, maybe they’ll want to use an alternative. who was on that list, which is interesting, is my accountant. social media people who’ve agencies who’ve I’ve hired my old bookkeeper, an SEO agency who’s interviewing me in the next few weeks. My wealth advisor, realtors like Dave Shapiro, I think you know Dave, my other realtor friend Rick Orr.\u003c/p\u003e\n\u003cp\u003eIan Schoen from Tropical MBA, he sent me, one. Jack Paxton from Top Growth Marketing. So it was all these people andso when I’m contacting them, I’m working backwards from who I think the customer is going to be. So I call them up and I said,\u003c/p\u003e\n\u003cp\u003eYou’re not waiting. And I only had a very little time to show this and I wanted to make at least a million dollars and a million dollars a year is 2, 700 a day. So I was like, can I make that? At least in a day. And so when I talked to these people, I said, Hey, can I call you real fast? Hey, do you have a second? And I just did the same thing I did to you. Listen, option transition. Hey, you sent me a docusign. I’ve been working on this alternative. Tell me more about how it’s going for you. Ah, okay. Well, my option is it’s going to have a one time payment. It’ll have at least some of the basic features and I’m going to get it to you in the next 45 days. Sounds great. Now. What was interesting is two parts. Number one, I did get rejected.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Did David Shapiro reject you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Dave actually said yes, normally I was expecting him to reject me my neighbor spends 10, 000 a year. On DocuSign, and I’m like, oh my God, yes, you’re going to just give me the 3, 000 one time payment. And he said, no, and I said, how come? He’s like, well, I’m never a beta customer. I was like, oh, how come? Well, I like to make sure that the technology is tested. Okay, what kind of test would you like to see? And it’s interesting because when people say no or not yet, it’s a rejection. And I do think no’s are not yet but. lot of times it’s like, well, let me try to understand it. And the promise of payment is a rejection. Another example, I was in a WhatsApp group for Austin CEOs. I posted, Hey, does anyone here use DocuSign or an alternative? And a few people, I think three said, yeah. So I messaged one of them, And she said, Oh my God, I hate DocuSign. Are you working on alternative? I was like, yeah, I’m working on one. What do you hate about it? And so again, ask open ended questions. Listen, Oh, I hate the subscription.\u003c/p\u003e\n\u003cp\u003eI hate all these things. I’m like, okay, what are the core things you need? I need templates. I need signing and I need reminders. Okay, great. Sounds like I can do that, and it’s a one time payment, and I’ll have it for you in 45 days. Do you want to sign up to be one of my, the early customers? Ooh, uh, What, when, when’s it coming out? I’ll just wait for it then. Okay, how come you want to wait for it then? Yeah, I just, uh, I’m, yeah, I don’t, I don’t know. I’m just not ready. And I was like, okay, thank you. And so this is the thing in business though where most people are afraid to ask and you don’t have to make it this big scary thing.\u003c/p\u003e\n\u003cp\u003eI just asked, Hey, is it interesting for you? And when they say they’ll pay you later, that’s a no. But most people are like, okay, let me go build it.\u003c/p\u003e\n\u003cp\u003eAnd I’ve done this twice where I spent six months building something. One was betarcade. com and the other was a payments system for Disney. I brought it six months later and they’re like, ah, we don’t want it.And so that is why. You have to validate before you start running really fast in the wrong direction. so the other point that was interesting is that I noticed that through calling people, the actual customer, that’s my sweet spot, is agencies. So agencies. were going to be the customers I should focus more on. Then I was thinking, all right, well, who are agencies I’ve worked with? How do I look up on LinkedIn? Anybody who’s been an agency. that was something though, if I was sitting on the sidelines, planning and preparing, it would have been hard to know versus getting going led me to that outcome pretty quickly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: big agencies, or are you talking about a one or two person shop doing something?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: small agencies. So it was noticing that, Oh crap. Agencies have a lot of, these documents. And so that was a light bulb moment that I noticed that I was able to then focus more on as I was doing the challenge.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: So overall, how much money did you make?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I did 3, 000 in one day and the thing that was interesting for me is it was exhausting. Everyone has friends and network and colleagues and past clients that they can work with.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e:\u003c/p\u003e\n\u003cp\u003eIt was 3000 for one day, but isn’t a weekend two days essentially and part of Friday. So,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: video. So,\u003c/p\u003e\n\u003cp\u003ethe first day I went out and did the dollar challenge. I did the coffee challenge, and then I worked through the market validation\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: ah, got it. So one day for selling the others. Mart is trying to figure out what to sell and validation. Do I have that right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: That’s a good way that I’ve noticed people are naturally taking the book, which is one day is preparing and the second day is really the selling.\u003c/p\u003e\n\u003cp\u003eAnd you have to be okay that if people don’t want it, great, ask them why not. And for people out there, they’re like, well, how are you going to build the software?\u003c/p\u003e\n\u003cp\u003eSo now that I have the money and I have the customers, it is so much easier to build the software. So I’ve taken the 3, 000 and I’m giving it to Garrett to build that. The other thing you could do is there’s Muhammad. Muhammad. is a guy. It’s 12 an hour, maybe with inflation.\u003c/p\u003e\n\u003cp\u003eNow he’s 13, but he’s the guy for 48. Me and him put a PayPal button on AppSumo. com 14 years ago. So I would go to someone like him, or a more likely, freelancer or Upwork or someone in my network to then build it. But it is a million times easier with a customer and a problem that people are excited.\u003c/p\u003e\n\u003cp\u003eTo have solved then the other way where you build it and now you have to go find people that have a problem, Most people have solutions and they try to find problems. I try to find problems and then bring the solution because now being resourceful as an entrepreneur is way easier. Now I have customers in the money.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Alright, let me tell you about, uh, Gusto. Here’s why I signed up for Gusto. You told me you had a positive experience for them. I’d love to hear yours. My issue was, every freaking year, around April 1st, actually no, it’s not even April 1st, it’s the end of January, I had to get A list of who I paid the previous year, all the contractors, all the, anyone who I was paying more than I think, what was it, 400 and organize it for my accountant.\u003c/p\u003e\n\u003cp\u003eAnd I tried QuickBooks for paying my people and I couldn’t get a clear statement from them. I tried PayPal. I go, you know what? Screw it. I’m going to go with PayPal. Let PayPal actually do their 1099 K or whatever the, the, that thing is. And that became a headache because I can’t pay everybody by PayPal.\u003c/p\u003e\n\u003cp\u003eAnd there are all these different issues. I found Gusto. Clean, so easy even I could do it. So easy that they understood exactly what was coming up and it did everything. So that’s why I switched to them. What’s your experience with Gusto?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: the cool story with gusto for me is when I was new to the job market in 2005, I started putting on conferences and I met Josh Reeves, the founder\u003c/p\u003e\n\u003cp\u003ehe was working at a startup, he was trying things, and then to see him finally find something that was such a huge hit,\u003c/p\u003e\n\u003cp\u003eI’ve had that problem personally. It is a pain in the ass to do 1099s. What I want to have everyone out there think about is, make it a problem for yourself. Make it a problem where you’re like, man, I gotta pay more people and I’m dealing with this problem. So that you need gusto.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You know, I was actually paid by someone. They, they read my book on how to interview. He wanted to know how to do better job interviewing. And he said, can I hire you as a coach? And I go, you know what? Fine. I don’t need the money for it. I don’t need the agita of once a week getting on a call with somebody and working with them, but I want to be a better interviewer myself by understanding what he’s going through.\u003c/p\u003e\n\u003cp\u003eSo his people were very nice. They said we’re gonna pay you, putting you on our system. Freaking system was such a pain in the ass. Every few weeks I would go in to try to deal with it, and then I said screw it. I don’t care. I’m just not gonna do it. I didn’t get paid a dollar for it, because it’s not worth my effort to go and deal with their stupid software.\u003c/p\u003e\n\u003cp\u003eand maybe you could say they save themselves time, but most oh, they save themselves money by not paying me. But I think for most of the people who they’re working with, They are going to have to pay and they have to deal with this trashy software. What a bad experience.\u003c/p\u003e\n\u003cp\u003eAnyway, Gusto, so fricking good. Your people will enjoy using it. Go to gusto. com slash Mixergy to try it for free. All right, YouTube, I want to close it out with this. What’s the advantage for you of doing YouTube at this point?\u003c/p\u003e\n\u003cp\u003eWhy are you doing this?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I like it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: What do you like about it? It seems like it’s just another job for you where you’ve outsourced everything, including go plant seeds in my garden or hire a gardener because I drove over my own lawn. Why then not hire someone to do your social media instead of you putting your face out there.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I like how it’s helped me meet people like you. Which you led me to meet Chad, who became my first customer at my first startup. Which led him to become my business partner. Which now, almost 15 plus years later, we’re running AppSumo together.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You’re saying you do social media and you get to meet people beyond the audience. It’s more like you get to meet one on one relationships\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: and the\u003c/p\u003e\n\u003cp\u003eaudience.\u003c/p\u003e\n\u003cp\u003elike today There’s a guy who emailed me back here. He works at 33 degree boards. It’s a surfboard company out of San Diego I’m like I know who he is cuz David Kelly the guy who runs up some originals Surfs a lot and he uses those boards and that guy reads my newsletter and that’s so cool Or I can go to Spain and people are like, hey, do you wanna come have lunch?\u003c/p\u003e\n\u003cp\u003eAnd it’s not that I always want to meet every single person, but it’s put me in a place To meet people like that or interview people that I admire and I’m curious about. And so what I do hire out though, Andrew is a lot of the work I don’t want to do for the content. So do I want to do pre production and all the question planning?\u003c/p\u003e\n\u003cp\u003eNo. Do I want to do video editing? No. Thumbnails? No. And twice a month, three times a month, I go and film either a person I’m really excited to meet, or I do a challenge, which I don’t want to do, but I’m always proud of myself afterwards. I do like it. As I’m getting older and, having a family and so forth, I’m not gonna be doing as much of I want to travel and go on the streets.\u003c/p\u003e\n\u003cp\u003eSo there’ll be some evolvement of it or evolution of it. I really do love it If people can find things that they can do for at least a decade, that at the end of the decade, I think people will be shocked about how far they’ll be. And so for me with content, it’s a balance of how do I do content I like, that I enjoy, as well as what people also want to watch. Now I gotta give you a quick warning for everyone out there though. I put out a YouTube video last week, and I have over a million subs. And 000 people watched this video.\u003c/p\u003e\n\u003cp\u003eWe have millions of subs. same with Apple with podcasts, now they don’t auto download. So your podcast downloads went from whatever, 30 percent down. It was a great reminder to go get an email list for everyone out there.\u003c/p\u003e\n\u003cp\u003ego to ConvertKit or, I use SendFox. com or MailChimp. But if you don’t control your audience and your customers and the platforms do, you are very likely to get screwed. And that’s happened to me. I built, Facebook games and I built Facebook payments for games and then one day Facebook banned us. And that was the lesson that I was like, I am not in control. And the same thing with a day job. If you have a day job, one person controls your livelihood. So create your own business, whether you want to quit it and do it full time or you just want something on the side so you have a backup plan that frankly is enjoyable.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: write your own email newsletter? okay\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: who’s phenomenal. We’re actually, I’m going to put out content in the upcoming weeks of all the people who helped me with this material. So her name is Sylvie Bryant. I think she’s either in Vegas and Toronto. She is amazing. And she puts together the draft of the email. So we have a Slack channel where I’ll post stuff that’s happening or she’ll see stuff that’s happening. And she also, has a folder of all the, Of my photos. Every photo I take, it goes to a folder that she has access to. I trust her and then she’ll put together the email. then I’ll approve them and then she’ll set it up and send Fox and make sure they get sent out.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: When you were talking about challenges for YouTube I remember seeing one video of you where you were getting on a first class flight and you’re gonna talk to people about How they got so rich And I think there was one person who just didn’t want to talk to you, which feels like such an awkward experience to be either stuck in the lounge with someone who doesn’t want to talk to you as you’re walking around with this mic or on a flight.\u003c/p\u003e\n\u003cp\u003eThat seems like the kind of challenge that you want to put yourself through.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: I don’t, to be clear, it’s\u003c/p\u003e\n\u003cp\u003enot, no. I have anxiety. maybe at least a week to a month before most of these challenge videos. What I’ll say though, is that every time afterwards, I’m always proud of myself. And I think that’s such a powerful lesson for all of us, which is what is something we want? I do want to do these videos, most of them, and it’s hard. the other side of that is confidence. On the other side of that is belief of who you are and what you can do. And a lot of what Million Dollar Weekend is that it’s like, Hey, you can do this.\u003c/p\u003e\n\u003cp\u003eYou gotta start, and you gotta get a little bit of rejection.\u003c/p\u003e\n\u003cp\u003eBut guess what? You’re gonna get a lot of acceptance, and you’re gonna get a lot of yeses, too. And it’s led to such a cool experience. One of the videos was me standing outside a private airport asking to get tours of planes. And one of the guys said yes, barely. And then I said, hey, can I fly with you? With me and a videographer. He said, sure. And that’s a 100, 000 flight. That I just asked, I didn’t have any advantages that anyone else couldn’t have. Maybe because I’m male, not female. Maybe it’s even harder, I don’t know. But you can go and ask for different things that I don’t think are bad. I think people think of asking and selling as a negative. I think it’s a positive, and you can do it in silly ways, Hey, what kind of shirt are you wearing? Oh, really? Where’d you get it from? That’s a nice one. And then you can start doing that in other areas. last night, I’m out at this dad party. At Bob’s Chop House. And guess who’s at the bar? The guy whose private jet I was on.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Ah, ha\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: That was so crazy. I haven’t seen him in a, I don’t know, almost a year now. And it just made me realize like how cool it was just because I did a small ask led to this now having color of a person. And richness in life, not even just richness in money, but richness like, I just asked the person.\u003c/p\u003e\n\u003cp\u003eSo an easy one for anyone out there is if you see someone with a nice car, if you go to someone’s house, if you go to even your own dentist or doctor, oh, how’d you get rich? Tell me more about it. I’d love to learn from you. And I think people would be surprised with the upside and the things they can find out. And the downside is maybe they say no for a brief second, but the upside is really unlimited.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Were you there with your own camera or did you have one of your videographers with you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Isaac, who’s in Austin, did that footage. The first class passengers was just me, I just used my iPhone. So I had an iPhone, and I just filmed like, hey, what’s up?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e:\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: You can make content with your phone. That’s how I started the YouTube channel. Each video now that we do takes two weeks and costs around 25, 000. My first videos were me shirtless with an iPhone, and we all have a phone.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: 000 for you going to an airport and ask people how they got rich.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: So, the videographer, his roughly 1500 day rate. There’s a producer for the show, so he’s, let’s just say about 10, 000 a month. And then there’s a video editor, that’s another 10, 000 a month. Then there’s a thumbnail designer. Right, then there’s a researcher, and then we have a YouTube consultant, so all things considered, it’s like 30, 35k, give or take, maybe 50, depending on the month, if we travel, to do a video, you know, what salaries are, and\u003c/p\u003e\n\u003cp\u003ethen we do two videos a month,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You have told me that it does help the app sumo business, Tell me what the impact is on your business.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: We’ve surveyed, and around 35 percent of AppSumo customers know who I am. You don’t have to be in front of the camera. You can have someone else out there, but it is very helpful to grow an audience for free. Or you can, pay a team over time for free via social media, via TikTok or Instagram or LinkedIn or wherever you find that your ideal customers are.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right. book is called million dollar weekend. I’ve been a part of some of them. Now I’m part of this latest million dollar weekend experiment. The one that I thought was the best one for me to watch was. You were doing beef jerky. I’m not a beef jerky person anymore. And so you go, why not?\u003c/p\u003e\n\u003cp\u003eAnd I said, well, I eat fish occasionally go How about fish jerky? I never tried that. Hell yeah. And then in the book you talk about how you thought about the economics of it. Well, I can sell this many to get to a million dollars. Or, I could sell a lot fewer subscriptions and get to a million dollars faster with fewer sales.\u003c/p\u003e\n\u003cp\u003eOr, I could sell to businesses who are then going to buy for their whole team. And I’m not going to sell to businesses jerky. I’m going to sell them, do you want to make your people happy and healthier instead of giving them all the chocolate stuff that you have around the office or something like that.\u003c/p\u003e\n\u003cp\u003eAnd then you’re able to sell even more. And that’s one of the things that I like about you. There is this Yes, I’m eager. I’m willing to do the hard work in the beginning stage of Noah, but Noah’s also really good at leveling up and going, where’s. The that fulcrum that place where if I apply a little bit of pressure, I can get a lot more results and for jerky It was apply a little bit of pressure to a friend or someone else and sell a company But I’m gonna get a whole lot of orders from it and I like the whole book is full of reasonable ideas like that It’s called million dollar weekend and it’s written with this guy tall Roz if you don’t know him You’ve probably read his books before he’s only co authored two books before.\u003c/p\u003e\n\u003cp\u003eWhat are the other two? Never Split the Difference and\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Never eat alone. He also wrote The CEO Next Door. And he actually now does, private books. So for basically billionaires and people worth nine figures, they’ll commission him to write a family book just for their own family.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Because he’s such a good writer. It’s full of great stories. Phenomenal book. Congratulations. Million dollar weekend.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eNoah Kagan\u003c/span\u003e\u003c/span\u003e: Thank you. Noah Kagan. Thank you everybody. Oh, thank you. Gusto. Bye everyone.\u003c/p\u003e\n\n\t\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "53 min read",
  "publishedTime": null,
  "modifiedTime": "2024-01-30T15:00:53Z"
}
