{
  "id": "b47d2d3f-3be7-4fdb-9ff6-c5d3a01e3be9",
  "title": "CBC Group Completes Strategic Acquisition of UCB's Mature Product Portfolio in China",
  "link": "https://www.investing.com/news/press-releases/cbc-group-completes-strategic-acquisition-of-ucbs-mature-product-portfolio-in-china-93CH-3747354",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-30 01:04:03",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 7054,
  "excerpt": "CBC Group Completes Strategic Acquisition of UCB's Mature Product Portfolio in China",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "CBC Group and Mubadala acquire UCB's mature neurology and allergy business in China for US$680 million.New company is named NeuroGen Pharma, led by an experienced management team with a strong track record in the biopharma industry.Strategic acquisition under CBC's buyout strategy expected to drive significant value creation and positive patient outcomes through CBC's proven investor-operator approach and solution., /PRNewswire/ -- CBC Group (\"CBC\"), Asia's largest healthcare-dedicated asset management firm headquartered in Singapore, has completed the strategic acquisition of global biopharmaceutical company UCB's mature neurology and allergy business in China, in partnership with Mubadala Investment Company, the Abu Dhabi based global investment company. The acquisition marks another successful transaction under CBC's buyout strategy of acquiring key assets from global pharmaceutical companies and a significant step in establishing a market-leading neurology company in China while expanding CBC's portfolio within the region's dynamic pharmaceutical market. The transaction, valued at US$680 million, includes UCB's well-known brands Keppra ®, Vimpat ®, Neupro ®, Zyrtec ®, Xyzal ®, and the Zhuhai manufacturing site. The well-established and trusted medicine portfolio will serve as an anchor asset as CBC builds out a leading integrated central nervous system (CNS) biopharma platform in China, where the market size has reached US$33 billion1. Beyond strengthening CBC's presence in the rapidly growing Chinese healthcare market, the acquisition also enhances the firm's capabilities in meeting the rising demand for neurology and allergy treatments in the wider region. In collaboration with Mubadala, CBC will tap on its proprietary investor-operator approach, deep healthcare expertise and platform synergies to drive operational efficiencies, innovation and scale to benefit more patients across the region. Fu Wei, Chief Executive Officer of CBC Group, said, \"There is clear potential within the regional healthcare space to better serve patients with unmet medical needs in this growing CNS therapeutics market, and we are delighted to partner with Mubadala once again. This acquisition complements our existing healthcare ecosystem and aligns with our robust buyout strategy, which is strategically positioned to drive long-term, sustainable value in today's healthcare investing market. Together, we are making a profound impact on the industry by harnessing our combined expertise and capital to not only enhance patient outcomes but also build value for our stakeholders. Leveraging our joint strengths, we are poised to capitalize on synergies and deploy hands-on strategic guidance to make significant strides in CNS market access and innovation.\" Named \"NeuroGen Pharma\", the new company embodies what CBC and Mubadala envision for neuro healthcare innovation. The company will be led by a deep and experienced management team with an extensive track record in the biopharma industry, ensuring a smooth transition to propel into the next phase of growth. NeuroGen Pharma is expected to deliver quality treatments to a wider reach of patients and play an important role in addressing the evolving neurology treatment needs in China. The company aims to leverage innovative therapies and cutting-edge research to enhance patient outcomes and shape the future of neurology care in the region. Combined net sales for the acquired portfolio in this transaction were Euro131 million in 2023. The strategic acquisition builds on CBC's collaboration with Mubadala, which includes their investment in CBC Healthcare Infrastructure Platform's (HIP) first life science real assets venture and the joint investment in the US$315 million fundraising round for CBC-backed Hasten, a leading pharmaceutical company. Mohamed Albadr, Head of Asia at Mubadala, said, \"We are thrilled to partner with CBC Group to support the growth and development of NeuroGen Pharma as it scales to a leading entity in China and delivers transformative medicines to patients. Built on a strong foundation of proven therapies and driven by innovation and cutting-edge research, the company is uniquely positioned to address the growing need for advanced neurology and allergy treatments while aligning with our commitment to enhancing access to care and growth in the healthcare system.\" Jean-Christophe Tellier, CEO at UCB, said, \"In the short term, UCB is exploring the launch of novel medicines in immunology, neurology, and rare diseases in China. Our dedication to serving patients with unmet needs in China remains steadfast. Building on our 28-year presence in the country, we are committed to driving patient outcomes through continued collaboration with local partners and fostering innovation. We are convinced that the CBC Group and Mubadala are the ideal partners to advance the medicine portfolio and continue to improve the lives of people living with neurology and allergy diseases in mainland China.\"1: Source: Frost \u0026 Sullivan analysis,RMB/USD=7.1 About CBC Group Headquartered in Singapore, CBC Group is Asia's largest healthcare-dedicated asset management firm, with an AUM of US$9 billion. With a diversified, multi-product strategy, CBC Group is focused on platform-building, buyout, private credit and royalties, and real estate, across the healthcare space, including pharmaceutical, biotech, medical technology, and healthcare services. We are committed to creating lasting value by integrating global innovations and talents. Partnering with the world's top entrepreneurs and scientists, our unique \"investor-operator\" approach has empowered leading healthcare companies to widen access to affordable medical care, catalyse innovations, and improve efficiencies in fulfilling unmet medical needs worldwide. For more information on CBC Group, please visit www.cbridgecap.com/.Connect with us on LinkedIn (CBC Group). About UCB UCB, Brussels, Belgium (www.ucb.com) is a global biopharmaceutical company focused on the discovery and development of innovative medicines and solutions to transform the lives of people living with severe diseases of the immune system or of the central nervous system. With approximately 9,000 people in approximately 40 countries, the company generated revenue of €5.3 billion in 2023. UCB is listed on Euronext (EPA:) Brussels (symbol: UCB). Follow us on Twitter: @UCB_news. About Mubadala Mubadala Investment Company is a sovereign investor managing a global portfolio, aimed at generating sustainable financial returns for the Government of Abu Dhabi. Mubadala's $302 billion (AED 1,111 billion) portfolio spans six continents with interests in multiple sectors and asset classes. We leverage our deep sectoral expertise and long-standing partnerships to drive sustainable growth and profit, while supporting the continued diversification and global integration of the economy of the United Arab Emirates. For more information about Mubadala Investment Company, please visit: www.mubadala.com.",
  "image": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cul type=\"disc\"\u003e\u003cli\u003e\u003ci\u003e\u003cspan\u003eCBC Group\u003c/span\u003e and Mubadala acquire UCB\u0026#39;s mature neurology and allergy business in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e for \u003cmoney\u003eUS$680 million\u003c/money\u003e.\u003c/i\u003e\u003c/li\u003e\u003cli\u003e\u003ci\u003eNew company is named NeuroGen Pharma, led by an experienced management team with a strong track record in the biopharma industry.\u003c/i\u003e\u003c/li\u003e\u003cli\u003e\u003ci\u003eStrategic acquisition under CBC\u0026#39;s buyout strategy expected to drive significant value creation and positive patient outcomes through CBC\u0026#39;s proven investor-operator approach and solution.\u003c/i\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e,  /PRNewswire/ -- \u003cspan\u003eCBC Group\u003c/span\u003e (\u0026#34;CBC\u0026#34;), \u003clocation idsrc=\"xmltag.org\" value=\"LR/asp\"\u003eAsia\u0026#39;s\u003c/location\u003e largest healthcare-dedicated asset management firm headquartered in \u003clocation idsrc=\"xmltag.org\" value=\"LC/sg\"\u003eSingapore\u003c/location\u003e, has completed the strategic acquisition of global biopharmaceutical company UCB\u0026#39;s mature neurology and allergy business in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e, in partnership with \u003cspan\u003eMubadala Investment Company\u003c/span\u003e, the \u003clocation idsrc=\"xmltag.org\" value=\"LU/ae..abudha\"\u003eAbu Dhabi\u003c/location\u003e based global investment company. The acquisition marks another successful transaction under CBC\u0026#39;s buyout strategy of acquiring key assets from global pharmaceutical companies and a significant step in establishing a market-leading neurology company in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e while expanding CBC\u0026#39;s portfolio within the region\u0026#39;s dynamic pharmaceutical market. The transaction, valued at \u003cmoney\u003eUS$680 million\u003c/money\u003e, includes UCB\u0026#39;s well-known brands Keppra ®, Vimpat ®, Neupro ®, Zyrtec ®, Xyzal ®, and the Zhuhai manufacturing site.\u003c/p\u003e\n\u003cp\u003eThe well-established and trusted medicine portfolio will serve as an anchor asset as CBC builds out a leading integrated central nervous system (CNS) biopharma platform in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e, where the market size has reached \u003cmoney\u003eUS$33 billion\u003c/money\u003e\u003csup\u003e\u003cspan id=\"spanHghlt22c1\"\u003e1\u003c/span\u003e\u003c/sup\u003e. Beyond strengthening CBC\u0026#39;s presence in the rapidly growing Chinese healthcare market, the acquisition also enhances the firm\u0026#39;s capabilities in meeting the rising demand for neurology and allergy treatments in the wider region. In collaboration with Mubadala, CBC will tap on its proprietary investor-operator approach, deep healthcare expertise and platform synergies to drive operational efficiencies, innovation and scale to benefit more patients across the region.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003e\u003cperson\u003eFu Wei\u003c/person\u003e, Chief Executive Officer of \u003cspan\u003eCBC Group\u003c/span\u003e, said,\u003c/b\u003e \u0026#34;There is clear potential within the regional healthcare space to better serve patients with unmet medical needs in this growing CNS therapeutics market, and we are delighted to partner with Mubadala once again. This acquisition complements our existing healthcare ecosystem and aligns with our robust buyout strategy, which is strategically positioned to drive long-term, sustainable value in today\u0026#39;s healthcare investing market. Together, we are making a profound impact on the industry by harnessing our combined expertise and capital to not only enhance patient outcomes but also build value for our stakeholders. Leveraging our joint strengths, we are poised to capitalize on synergies and deploy hands-on strategic guidance to make significant strides in CNS market access and innovation.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNamed \u0026#34;NeuroGen Pharma\u0026#34;, the new company embodies what CBC and Mubadala envision for neuro healthcare innovation. The company will be led by a deep and experienced management team with an extensive track record in the biopharma industry, ensuring a smooth transition to propel into the next phase of growth. NeuroGen Pharma is expected to deliver quality treatments to a wider reach of patients and play an important role in addressing the evolving neurology treatment needs in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e. The company aims to leverage innovative therapies and cutting-edge research to enhance patient outcomes and shape the future of neurology care in the region.\u003c/p\u003e\n\u003cp\u003eCombined net sales for the acquired portfolio in this transaction were \u003cmoney\u003eEuro131 million\u003c/money\u003e in 2023. The strategic acquisition builds on CBC\u0026#39;s collaboration with Mubadala, which includes their investment in CBC Healthcare Infrastructure Platform\u0026#39;s (HIP) first life science real assets venture and the joint investment in the \u003cmoney\u003eUS$315 million\u003c/money\u003e fundraising round for CBC-backed Hasten, a leading pharmaceutical company.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eMohamed Albadr, Head of \u003clocation idsrc=\"xmltag.org\" value=\"LR/asp\"\u003eAsia\u003c/location\u003e at Mubadala, said\u003cspan id=\"spanHghltbc8b\"\u003e,\u003c/span\u003e \u003c/b\u003e\u0026#34;We are thrilled to partner with \u003cspan\u003eCBC Group\u003c/span\u003e to support the growth and development of NeuroGen Pharma as it scales to a leading entity in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e and delivers transformative medicines to patients. Built on a strong foundation of proven therapies and driven by innovation and cutting-edge research, the company is uniquely positioned to address the growing need for advanced neurology and allergy treatments while aligning with our commitment to enhancing access to care and growth in the healthcare system.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cb\u003e\u003cperson\u003eJean-Christophe Tellier\u003c/person\u003e, CEO at UCB, said\u003cspan id=\"spanHghlt0ea1\"\u003e,\u003c/span\u003e \u003c/b\u003e\u0026#34;In the short term, UCB is exploring the launch of novel medicines in immunology, neurology, and rare diseases in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e. Our dedication to serving patients with unmet needs in \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e remains steadfast. Building on our 28-year presence in the country, we are committed to driving patient outcomes through continued collaboration with local partners and fostering innovation. We are convinced that the \u003cspan\u003eCBC Group\u003c/span\u003e and Mubadala are the ideal partners to advance the medicine portfolio and continue to improve the lives of people living with neurology and allergy diseases in mainland \u003clocation idsrc=\"xmltag.org\" value=\"LC/cn\"\u003eChina\u003c/location\u003e.\u0026#34;\u003c/p\u003e\u003cdiv colspan=\"1\" rowspan=\"1\"\u003e\u003cp\u003e\u003cspan\u003e1: Source: \u003cspan idsrc=\"xmltag.org\" value=\"ACORN:0693072712\"\u003eFrost \u0026amp; Sullivan\u003c/span\u003e analysis,RMB/USD=7.1\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003cb\u003eAbout \u003cspan\u003eCBC Group\u003c/span\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eHeadquartered in \u003clocation idsrc=\"xmltag.org\" value=\"LC/sg\"\u003eSingapore\u003c/location\u003e, \u003cspan\u003eCBC Group\u003c/span\u003e is \u003clocation idsrc=\"xmltag.org\" value=\"LR/asp\"\u003eAsia\u0026#39;s\u003c/location\u003e largest healthcare-dedicated asset management firm, with an AUM of \u003cmoney\u003eUS$9 billion\u003c/money\u003e. With a diversified, multi-product strategy, \u003cspan\u003eCBC Group\u003c/span\u003e is focused on platform-building, buyout, private credit and royalties, and real estate, across the healthcare space, including pharmaceutical, biotech, medical technology, and healthcare services.\u003c/p\u003e\n\u003cp\u003eWe are committed to creating lasting value by integrating global innovations and talents. Partnering with the world\u0026#39;s top entrepreneurs and scientists, our unique \u0026#34;investor-operator\u0026#34; approach has empowered leading healthcare companies to widen access to affordable medical care, catalyse innovations, and improve efficiencies in fulfilling unmet medical needs worldwide.\u003c/p\u003e\n\u003cp\u003eFor more information on \u003cspan\u003eCBC Group\u003c/span\u003e, please visit \u003cu\u003ewww.cbridgecap.com/\u003c/u\u003e.\u003cbr/\u003eConnect with us on LinkedIn (\u003cu\u003e\u003ca href=\"https://www.linkedin.com/company/cbcgroup-sg/\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cspan\u003eCBC Group\u003c/span\u003e\u003c/a\u003e\u003c/u\u003e).\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eAbout UCB\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003eUCB, \u003clocation idsrc=\"xmltag.org\" value=\"LU/be..brussl\"\u003eBrussels, Belgium\u003c/location\u003e (www.ucb.com) is a global biopharmaceutical company focused on the discovery and development of innovative medicines and solutions to transform the lives of people living with severe diseases of the immune system or of the central nervous system. With approximately 9,000 people in approximately 40 countries, the company generated revenue of  €5.3 billion in 2023. UCB is listed on \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Euronext \u003c/span\u003e\u003c/span\u003e (EPA:) Brussels (symbol: UCB). Follow us on Twitter: @UCB_news.\u003c/p\u003e\n\u003cp\u003e\u003cb\u003eAbout Mubadala\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMubadala Investment Company\u003c/span\u003e is a sovereign investor managing a global portfolio, aimed at generating sustainable financial returns for the Government of Abu Dhabi.  \u003c/p\u003e\n\u003cp\u003eMubadala\u0026#39;s \u003cmoney\u003e$302 billion\u003c/money\u003e (AED 1,111 billion) portfolio spans six continents with interests in multiple sectors and asset classes. We leverage our deep sectoral expertise and long-standing partnerships to drive sustainable growth and profit, while supporting the continued diversification and global integration of the economy of the United Arab Emirates.  \u003c/p\u003e\n\u003cp\u003eFor more information about \u003cspan\u003eMubadala Investment Company\u003c/span\u003e, please visit: www.mubadala.com.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-11-30T01:04:03Z",
  "modifiedTime": null
}
