{
  "id": "b6a9f455-30ba-46d7-8bc9-53ef1f3a6eb6",
  "title": "VC Alexa von Tobel launches new podcast ‘Inspired,’ looking to reset American ambition",
  "link": "https://fortune.com/2025/07/14/vc-alexa-von-tobel-launches-new-podcast-inspired-founders-project-startup-ambition/",
  "description": "A long-time podcast host, Inspired Capital cofounder Alexa von Tobel has launched a new podcast called “Inspired.”",
  "author": "Allie Garfinkle",
  "published": "Mon, 14 Jul 2025 20:09:16 +0000",
  "source": "https://fortune.com/feed",
  "categories": [
    "Business"
  ],
  "byline": "Allie Garfinkle",
  "length": 3385,
  "excerpt": "A long-time podcast host, Inspired Capital cofounder Alexa von Tobel has launched a new podcast called “Inspired.”",
  "siteName": "Fortune",
  "favicon": "https://fortune.com/icons/favicons/apple-touch-icon.png",
  "text": "The Latin root of the word “ambition” literally means “to go around,” hinting that ambition isn’t just about drive—it’s the unrelenting ability to face a roadblock and, come hell or high water, find a way around it. In ancient Rome, ambition had political roots—those who were truly ambitious would “go around” canvassing for votes. Historically, ambition hasn’t always been seen as a virtue (just ask Macbeth). But in the United States, ambition became a defining ideal, championed by Founding Fathers like John Adams, who wrote about it as a virtue essential to Americans. Alexa von Tobel, Inspired Capital cofounder and LearnVest founder, argues that this American ambition has corroded in recent years—and that it’s time for a reset, one that revives ambition to its most sweeping, optimistic form. This is especially true for VCs and entrepreneurs, she exclusively tells Fortune.  “During a period of capital being effectively free, it became very easy to start companies,” said von Tobel, referencing ZIRP (zero interest rate policy) induced booms. “We were creating a lot of direct-to-consumer this and that, and building out incremental ideas—because capital effectively was everywhere. And in some ways, it was great: Entrepreneurship became mainstream. But as entrepreneurship became mainstream and capital was easy to access, we just started seeing a lot of incremental ideas. Coming out of COVID, some of that’s beginning to reset.” Von Tobel has been thinking about this as an investor, backing companies like ShopMy, Solace, and Teamshares. (In 2024, Inspired raised $330 million for its third fund.) A long-time podcast host, she’s also been considering the state of entrepreneurial ambition from a narrative perspective: From 2019 to 2024, von Tobel hosted The Founders Project podcast for about 250 episodes via Inc. Now, she’s re-launched the podcast on her own as Inspired—taking its name from her firm and her ethos. The bi-weekly episodes are generally about an hour long and feature von Tobel interviewing entrepreneurs about taking truly ambitious swings and what it takes to make a vision reality.  “I worry about the world,” von Tobel told Fortune. “As somebody who deeply cares about making the world a better place, I believe we have more problems than we’ve ever seen. And when I really dug deep on what I hope we see more of in the world it’s—no pun intended—inspiring people to dream bigger, think bigger.” Von Tobel’s first guest on the new podcast, which launched last week, is Ben Lamm, founder and CEO of Colossal Biosciences, famous for its de-extinction efforts. This year, those efforts transcended science fiction, as Colossal revealed it had successfully genetically engineered the long-extinct dire wolf. Astro Teller, Captain of Moonshots at Google X, and Dr. Becky Kennedy, founder and CEO of Good Inside, are also scheduled as guests.  “If someone says to me, ‘I want to be a lawyer’ I want them to say, ‘I want to be a Supreme Court justice,’” said von Tobel. “It’s truly just pushing yourself to say: Is this the point 0.01% of how big we can go to solve a problem and make the world better? Is this idea capable of improving four billion lives? Now, we’re at the scale we should be thinking about.” Introducing the 2025 Fortune 500, the definitive ranking of the biggest companies in America. Explore this year's list.",
  "image": "https://fortune.com/img-assets/wp-content/uploads/2025/07/Unknown-e1752522915693.jpeg?resize=1200,600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eThe Latin root of the word “ambition” literally means “to go around,” hinting that ambition isn’t just about drive—it’s the unrelenting ability to face a roadblock and, come hell or high water, find a way around it.\u003c/p\u003e\u003cdiv\u003e\n\n\n\n\u003cp\u003eIn ancient Rome, ambition had political roots—those who were truly ambitious would “go around” canvassing for votes. Historically, ambition hasn’t always been seen as a virtue (just ask Macbeth). But in the United States, ambition became a defining ideal, championed by Founding Fathers like John Adams, who wrote about it as a \u003ca href=\"https://www.masshist.org/publications/adams-papers/view/PJA05p164\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://www.masshist.org/publications/adams-papers/view/PJA05p164\"\u003evirtue essential to Americans\u003c/a\u003e.\n\n\n\n\u003c/p\u003e\u003cp\u003eAlexa von Tobel, Inspired Capital cofounder and LearnVest founder, argues that this American ambition has corroded in recent years—and that it’s time for a reset, one that revives ambition to its most sweeping, optimistic form. This is especially true for VCs and entrepreneurs, she exclusively tells \u003cem\u003eFortune\u003c/em\u003e. \n\n\n\n\u003c/p\u003e\u003cp\u003e“During a period of capital being effectively free, it became very easy to start companies,” said von Tobel, referencing ZIRP (zero interest rate policy) induced booms. “We were creating a lot of direct-to-consumer this and that, and building out incremental ideas—because capital effectively was everywhere. And in some ways, it was great: Entrepreneurship became mainstream. But as entrepreneurship became mainstream and capital was easy to access, we just started seeing a lot of incremental ideas. Coming out of COVID, some of that’s beginning to reset.”\n\n\n\n\u003c/p\u003e\u003cp\u003eVon Tobel has been thinking about this as an investor, backing companies like ShopMy, Solace, and Teamshares. (In 2024, Inspired \u003ca href=\"https://fortune.com/2024/03/06/inspired-capital-raised-330-million-third-fund/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/03/06/inspired-capital-raised-330-million-third-fund/\"\u003eraised $330 million for its third fund\u003c/a\u003e.) A long-time podcast host, she’s also been considering the state of entrepreneurial ambition from a narrative perspective: From 2019 to 2024, von Tobel hosted The Founders Project podcast for about 250 episodes via Inc. Now, she’s re-launched the podcast on her own as \u003ca href=\"https://www.youtube.com/channel/UCK8Zrp09P8yF0TlS8HURRIA\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://www.youtube.com/channel/UCK8Zrp09P8yF0TlS8HURRIA\"\u003eInspired\u003c/a\u003e—taking its name from her firm and her ethos. \u003c/p\u003e\u003cp\u003eThe bi-weekly episodes are generally about an hour long and feature von Tobel interviewing entrepreneurs about taking truly ambitious swings and what it takes to make a vision reality. \n\n\n\n\u003c/p\u003e\u003cp\u003e“I worry about the world,” von Tobel told \u003cem\u003eFortune\u003c/em\u003e. “As somebody who deeply cares about making the world a better place, I believe we have more problems than we’ve ever seen. And when I really dug deep on what I hope we see more of in the world it’s—no pun intended—inspiring people to dream bigger, think bigger.”\n\n\n\n\u003c/p\u003e\u003cp\u003eVon Tobel’s first guest on the new podcast, which launched last week, is Ben Lamm, founder and CEO of Colossal Biosciences, \u003ca href=\"https://fortune.com/2024/04/11/colossal-biosciences-de-extinction-startup-bring-back-woolly-mammoth/\" target=\"_self\" aria-label=\"Go to https://fortune.com/2024/04/11/colossal-biosciences-de-extinction-startup-bring-back-woolly-mammoth/\"\u003efamous for its de-extinction efforts\u003c/a\u003e. This year, those efforts transcended science fiction, as Colossal revealed it had \u003ca href=\"https://time.com/7274542/colossal-dire-wolf/\" target=\"_blank\" rel=\"noopener\" aria-label=\"Go to https://time.com/7274542/colossal-dire-wolf/\"\u003esuccessfully genetically engineered the long-extinct dire wolf\u003c/a\u003e. Astro Teller, Captain of Moonshots at \u003ca href=\"https://fortune.com/company/alphabet/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/alphabet/\"\u003eGoogle\u003c/a\u003e \u003ca href=\"https://fortune.com/company/twitter/\" target=\"_blank\" aria-label=\"Go to https://fortune.com/company/twitter/\"\u003eX\u003c/a\u003e, and Dr. Becky Kennedy, founder and CEO of Good Inside, are also scheduled as guests. \n\n\n\n\u003c/p\u003e\u003cp\u003e“If someone says to me, ‘I want to be a lawyer’ I want them to say, ‘I want to be a Supreme Court justice,’” said von Tobel. “It’s truly just pushing yourself to say: Is this the point 0.01% of how big we can go to solve a problem and make the world better? Is this idea capable of improving four billion lives? Now, we’re at the scale we should be thinking about.”\n\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eIntroducing the 2025 Fortune 500\u003c/strong\u003e, the definitive ranking of the biggest companies in America. \u003ca href=\"https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\" target=\"_self\" aria-label=\"Go to https://fortune.com/ranking/fortune500/?\u0026amp;itm_source=fortune\u0026amp;itm_medium=article_tout\u0026amp;itm_campaign=plea_text\"\u003eExplore this year\u0026#39;s list.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
