{
  "id": "b755b29a-70a3-4ebc-81f3-9166b9d5207a",
  "title": "Travere therapeutics CAO Calvin Sandra sells $258,277 in stock",
  "link": "https://www.investing.com/news/insider-trading-news/travere-therapeutics-cao-calvin-sandra-sells-258277-in-stock-93CH-3790290",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-28 00:48:46",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 2180,
  "excerpt": "Travere therapeutics CAO Calvin Sandra sells $258,277 in stock",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "These transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors. For deeper insights into TVTX's valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit InvestingPro. For deeper insights into TVTX's valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit InvestingPro. These transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors. For deeper insights into TVTX's valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit InvestingPro. These transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors. In other recent news, biopharmaceutical company Travere Therapeutics has announced its intention to conduct a public offering of its common stock, managed by Jefferies and Leerink Partners. The firm has not disclosed specific details about the use of proceeds from the offering. In financial highlights, Travere reported robust growth in Q3 2024, with net product sales reaching $35.6 million, a 30% increase from the previous quarter, largely driven by the commercial launch of its drug FILSPARI for IgA nephropathy. Total (EPA:) revenue for the quarter rose to $62.9 million, marking a 69% increase from the same period in 2023. However, the company also reported a net loss of $54.8 million, attributed to a one-time gain from a product sale in the previous year. Despite the net loss, Travere maintains a strong cash position of $277.4 million. In addition, the company is making progress in its sparsentan program for Focal Segmental Glomerulosclerosis, with promising study results and upcoming regulatory discussions. These recent developments indicate Travere's continued commitment to its growth strategies. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_8_800x533_L_1420026210.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eThese transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors. For deeper insights into TVTX\u0026#39;s valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit \u003ca href=\"https://www.investing.com/pro/TVTX\"\u003eInvestingPro\u003c/a\u003e. For deeper insights into TVTX\u0026#39;s valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit \u003ca href=\"https://www.investing.com/pro/TVTX\"\u003eInvestingPro\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThese transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors. For deeper insights into TVTX\u0026#39;s valuation and comprehensive analysis, including 10 key ProTips and detailed financial metrics, visit \u003ca href=\"https://www.investing.com/pro/TVTX\"\u003eInvestingPro\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThese transactions were part of routine financial management by the executive and are publicly disclosed to provide transparency to shareholders and potential investors.\u003c/p\u003e\n\u003cp\u003eIn other recent news, biopharmaceutical company Travere Therapeutics has announced its intention to conduct a public offering of its common stock, managed by Jefferies and Leerink Partners. The firm has not disclosed specific details about the use of proceeds from the offering. In financial highlights, Travere reported robust growth in Q3 2024, with net product sales reaching $35.6 million, a 30% increase from the previous quarter, largely driven by the commercial launch of its drug FILSPARI for IgA nephropathy. \u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Total \u003c/span\u003e\u003c/span\u003e (EPA:) revenue for the quarter rose to $62.9 million, marking a 69% increase from the same period in 2023. However, the company also reported a net loss of $54.8 million, attributed to a one-time gain from a product sale in the previous year. Despite the net loss, Travere maintains a strong cash position of $277.4 million. In addition, the company is making progress in its sparsentan program for Focal Segmental Glomerulosclerosis, with promising study results and upcoming regulatory discussions. These recent developments indicate Travere\u0026#39;s continued commitment to its growth strategies.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-12-28T00:48:46Z",
  "modifiedTime": null
}
