{
  "id": "bbbff015-9571-466a-91d4-9234c2c54a84",
  "title": "Super Micro stock slides over 10% on weaker-than-expected outlook, uncertainty over annual filing",
  "link": "https://finance.yahoo.com/news/super-micro-stock-slides-over-10-on-weaker-than-expected-outlook-uncertainty-over-annual-filing-215226402.html",
  "description": "",
  "author": "",
  "published": "2024-11-05T21:52:26Z",
  "source": "https://finance.yahoo.com/news/rssindex",
  "categories": null,
  "byline": "Josh Schafer",
  "length": 2924,
  "excerpt": "Super Micro stock slid 10% as the company's latest outlook fell short of Wall Street's expectations. The company also said it couldn't predict a timeline for...",
  "siteName": "Yahoo Finance",
  "favicon": "https://s.yimg.com/cv/apiv2/default/finance/favicon-180x180.png",
  "text": "Super Micro Computer (SMCI) stock fell over 10% in after-hours trading on Tuesday after the company's outlook for both earnings per share and sales in the current quarter missed Wall Street's estimates. Additionally, Super Micro still hasn't filed its 10-K annual report, which it initially pushed back on Aug. 28. The company said it \"remains unable at this time to predict when the Form 10-K will be filed.\" Super Micro said it expects adjusted earnings per share of $0.56 to $0.65 in its fiscal second quarter, below consensus estimates of $0.80, per Bloomberg data. Meanwhile, Super Micro's forecast for net sales in a range of $5.5 billion to $6.1 billion was weaker than the $6.79 billion on Wall Street had expected. \"Certainly it looks like revenues aren't where they wanted them to be either for the quarter they just reported or moving forward at the same time,\" Wedbush Securities equity research analyst Matt Bryson told Yahoo Finance. Bryson added that uncertainty on who Super Micro will hire as its next auditor or when it will be able to file its 10-K annual filing remain a headwind for the stock. \"There's a whole lot of unknown here,\" Bryson said. The earnings came less than a week after accounting firm Ernst \u0026 Young (EY) resigned as Super Micro's auditor. EY said in a filing it was \"unwilling to be associated with the financial statements prepared by management.\" Super Micro responded to those accusations on Tuesday with a response from an independent special committee that had been investigating the accusations. \"Following a three-month investigation led by Independent Counsel, the Committee’s investigation to date has found that the Audit Committee has acted independently and that there is no evidence of fraud or misconduct on the part of management or the Board of Directors,\" the release said. \"The Committee is recommending a series of remedial measures for the Company to strengthen its internal governance and oversight functions, and the Committee expects to deliver the full report on the completed work this week or next.\" FILE PHOTO: Logos of Super Micro Computer are pictured at COMPUTEX Taipei, one of the world's largest computer and technology trade shows, in Taipei, Taiwan May 30, 2023. REUTERS/Ann Wang/File Photo/File Photo · Reuters / Reuters EY's resignation came two months after a short report from Hindenburg Research alleged, among other things, \"accounting manipulation\" at the artificial intelligence highflier. After the stock rallied earlier in the year as investors cheered SMCI's prospects in the AI data center space, shares are now down more than 60% over the past six months. In August, Hindenburg said its three-month investigation \"found glaring accounting red flags, evidence of undisclosed related party transactions, sanctions and export control failures, and customer issues.\" The firm also disclosed it had taken a short position in Super Micro.",
  "image": "https://s.yimg.com/ny/api/res/1.2/8fj_K8vPwAR4Oi7CY4qGEg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2024-10/3fd591a0-9bbd-11ef-a7db-e2cbdb896bf6",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e    \u003cp\u003eSuper Micro Computer (\u003ca data-i13n=\"cpos:1;pos:1\" href=\"https://finance.yahoo.com/quote/SMCI\" data-ylk=\"slk:SMCI;cpos:1;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003eSMCI\u003c/a\u003e) stock fell over 10% in after-hours trading on Tuesday after the company\u0026#39;s outlook for both earnings per share and sales in the current quarter missed Wall Street\u0026#39;s estimates.\u003c/p\u003e \u003cp\u003eAdditionally, Super Micro still hasn\u0026#39;t filed its 10-K annual report, which it initially pushed back on Aug. 28. The company said it \u0026#34;remains unable at this time to predict when the Form 10-K will be filed.\u0026#34;\u003c/p\u003e  \u003cp\u003eSuper Micro said it expects adjusted earnings per share of $0.56 to $0.65 in its fiscal second quarter, below consensus estimates of $0.80, per Bloomberg data. Meanwhile, Super Micro\u0026#39;s forecast for net sales in a range of $5.5 billion to $6.1 billion was weaker than the $6.79 billion on Wall Street had expected.\u003c/p\u003e \u003cp\u003e\u0026#34;Certainly it looks like revenues aren\u0026#39;t where they wanted them to be either for the quarter they just reported or moving forward at the same time,\u0026#34; Wedbush Securities equity research analyst Matt Bryson told Yahoo Finance.\u003c/p\u003e \u003cp\u003eBryson added that uncertainty on who Super Micro will hire as its next auditor or when it will be able to file its 10-K annual filing remain a headwind for the stock.\u003c/p\u003e \u003cp\u003e\u0026#34;There\u0026#39;s a whole lot of unknown here,\u0026#34; Bryson said.\u003c/p\u003e  \u003cp\u003eThe earnings came less than a week after accounting firm Ernst \u0026amp; Young (EY) resigned\u003ca data-i13n=\"cpos:2;pos:1\" href=\"https://finance.yahoo.com/news/super-micro-computer-stock-tanks-after-accounting-firm-resigns-135641306.html\" data-ylk=\"slk:as Super Micro\u0026#39;s auditor;cpos:2;pos:1;elm:context_link;itc:0;sec:content-canvas;outcm:mb_qualified_link;_E:mb_qualified_link;ct:story;\"\u003e as Super Micro\u0026#39;s auditor\u003c/a\u003e. EY said in a filing it was \u0026#34;unwilling to be associated with the financial statements prepared by management.\u0026#34;\u003c/p\u003e \u003cp\u003eSuper Micro responded to those accusations on Tuesday with a response from an independent special committee that had been investigating the accusations.\u003c/p\u003e \u003cp\u003e\u0026#34;Following a three-month investigation led by Independent Counsel, the Committee’s investigation to date has found that the Audit Committee has acted independently and that there is no evidence of fraud or misconduct on the part of management or the Board of Directors,\u0026#34; \u003ca data-i13n=\"cpos:3;pos:1\" href=\"https://ir.supermicro.com/news/news-details/2024/Supermicro-Announces-an-Update-from-the-Independent-Special-Committee-and-First-Quarter-Fiscal-Year-2025-Preliminary-Financial-Information/default.aspx\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:the release said.;cpos:3;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ethe release said.\u003c/a\u003e \u0026#34;The Committee is recommending a series of remedial measures for the Company to strengthen its internal governance and oversight functions, and the Committee expects to deliver the full report on the completed work this week or next.\u0026#34;\u003c/p\u003e \u003cfigure\u003e\u003cdiv\u003e \u003cp\u003e\u003cimg src=\"data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///ywAAAAAAQABAAACAUwAOw==\" alt=\"FILE PHOTO: Logos of Super Micro Computer are pictured at COMPUTEX Taipei, one of the world\u0026amp;#39;s largest computer and technology trade shows, in Taipei, Taiwan May 30, 2023. REUTERS/Ann Wang/File Photo/File Photo\" loading=\"eager\" height=\"640\" width=\"960\"/\u003e\u003c/p\u003e\u003c/div\u003e \u003cfigcaption\u003eFILE PHOTO: Logos of Super Micro Computer are pictured at COMPUTEX Taipei, one of the world\u0026#39;s largest computer and technology trade shows, in Taipei, Taiwan May 30, 2023. REUTERS/Ann Wang/File Photo/File Photo  \u003cspan data-svelte-h=\"svelte-nxhdlu\"\u003e·\u003c/span\u003e \u003cspan\u003eReuters / Reuters\u003c/span\u003e\u003c/figcaption\u003e \u003c/figure\u003e \u003cp\u003eEY\u0026#39;s resignation came two months after a short report from Hindenburg Research \u003ca data-i13n=\"cpos:4;pos:1\" href=\"https://hindenburgresearch.com/smci/\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:alleged, among other things;cpos:4;pos:1;elm:context_link;itc:0;sec:content-canvas\"\u003ealleged, among other things\u003c/a\u003e, \u0026#34;accounting manipulation\u0026#34; at the artificial intelligence highflier.\u003c/p\u003e \u003cp\u003eAfter the stock rallied earlier in the year as investors cheered SMCI\u0026#39;s prospects in the AI data center space, shares are now down more than 60% over the past six months.\u003c/p\u003e \u003cp\u003eIn August, Hindenburg said its three-month investigation \u0026#34;found glaring accounting red flags, evidence of undisclosed related party transactions, sanctions and export control failures, and customer issues.\u0026#34; The firm also disclosed it had taken a short position in Super Micro.\u003c/p\u003e       \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-11-05T22:16:54Z",
  "modifiedTime": null
}
