{
  "id": "c41ac993-6881-4ef3-8f60-54912ce52f38",
  "title": "ITC set to acquire 24 Mantra Organic brand in Rs 472.5 crore deal",
  "link": "https://www.business-standard.com/companies/news/itc-set-to-acquire-24-mantra-organic-brand-in-rs-472-5-crore-deal-125041701408_1.html",
  "description": "It has signed a share purchase agreement to acquire a 100 per cent stake in Sresta Natural Bioproducts Private Limited (SNBPL), ITC said in a regulatory filing",
  "author": "",
  "published": "Thu, 17 Apr 2025 23:33:53 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 2469,
  "excerpt": "Multi-conglomerate ITC on Thursday said it will acquire Sresta Natural Bioproducts, engaged in the manufacturing and sale of organic packaged food products under the 24 Mantra Organic brand, for about Rs 472.50 crore.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Multi-conglomerate ITC on Thursday said it will acquire Sresta Natural Bioproducts, engaged in the manufacturing and sale of organic packaged food products under the 24 Mantra Organic brand, for about Rs 472.50 crore. It has signed a share purchase agreement to acquire a 100 per cent stake in Sresta Natural Bioproducts Private Limited (SNBPL), ITC said in a regulatory filing. The acquisition is \"in line with the strategy to augment the company's future-ready portfolio, the transaction will fortify ITC's presence and market standing in the high growth organic products segment in both Indian and overseas markets,\" it added. SNBPL's portfolio comprises a wide range of over 100 organic products, spanning branded grocery staples, spices and condiments, edible oils, and beverages, among others. Besides, it has a strong international presence with a deep connection with the Indian diaspora. \"The share acquisition is expected to be completed in Q1 of FY 2025-26 or such later date as may be mutually agreed upon by the Parties,\" ITC said.Also Read Over the cost of acquisition, ITC said it is up to Rs 472.50 crore on a cash-free debt-free basis. \"The share purchase agreements, comprising Rs 400 crore payable upfront at closing and up to Rs 72.50 crore payable in the next 24 months post Closing,\" it said. The company further said that this investment is in line with the 'ITC Next' strategy articulated by Chairman Sanjiv Puri that focusses also on building a future-ready portfolio of products that serve evolving consumer needs. \"We are excited to have 24 Mantra Organic as part of ITC's Foods Business's portfolio of nutrition-led healthy foods products. 24 Mantra Organic has built a robust backend and sourcing network which is core to its trusted organic products portfolio,\" ITC Wholetime Director Hemant Malik said. SNBPL founder and Managing Director Rajashekar Reddy Seelam said: \"ITC shares a common vision to promote sustainable livelihoods for farmers and ensure healthy lifestyles for consumers. We are confident that ITC's strengths in product development expertise and distribution strength across channels will help in taking 24 Mantra Organic to millions of homes...\"  SNBPL, incorporated in March 2004, recorded a revenue of Rs 306.1 crore in FY 2023-24.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-12/08/thumb/fitandfill/1200X630/1733639835-8445.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tMulti-conglomerate ITC on Thursday said it will acquire Sresta Natural Bioproducts, engaged in the manufacturing and sale of organic packaged food products under the 24 Mantra Organic brand, for about Rs 472.50 crore.\u003c/p\u003e\n\u003cp\u003e\n\tIt has signed a share purchase agreement to acquire a 100 per cent stake in Sresta Natural Bioproducts Private Limited (SNBPL), ITC said in a regulatory filing.\u003c/p\u003e\n\u003cp\u003e\n\tThe acquisition is \u0026#34;in line with the strategy to augment the company\u0026#39;s future-ready portfolio, the transaction will fortify ITC\u0026#39;s presence and market standing in the high growth organic products segment in both Indian and overseas markets,\u0026#34; it added.\u003c/p\u003e\n\u003cp\u003e\n\tSNBPL\u0026#39;s portfolio comprises a wide range of over 100 organic products, spanning branded grocery staples, spices and condiments, edible oils, and beverages, among others. Besides, it has a strong international presence with a deep connection with the Indian diaspora.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;The share acquisition is expected to be completed in Q1 of FY 2025-26 or such later date as may be mutually agreed upon by the Parties,\u0026#34; ITC said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tOver the cost of acquisition, ITC said it is up to Rs 472.50 crore on a cash-free debt-free basis.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;The share purchase agreements, comprising Rs 400 crore payable upfront at closing and up to Rs 72.50 crore payable in the next 24 months post Closing,\u0026#34; it said.\u003c/p\u003e\n\u003cp\u003e\n\tThe company further said that this investment is in line with the \u0026#39;ITC Next\u0026#39; strategy articulated by Chairman Sanjiv Puri that focusses also on building a future-ready portfolio of products that serve evolving consumer needs.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;We are excited to have 24 Mantra Organic as part of ITC\u0026#39;s Foods Business\u0026#39;s portfolio of nutrition-led healthy foods products. 24 Mantra Organic has built a robust backend and sourcing network which is core to its trusted organic products portfolio,\u0026#34; ITC Wholetime Director Hemant Malik said.\u003c/p\u003e\n\u003cp\u003e\n\tSNBPL founder and Managing Director Rajashekar Reddy Seelam said: \u0026#34;ITC shares a common vision to promote sustainable livelihoods for farmers and ensure healthy lifestyles for consumers. We are confident that ITC\u0026#39;s strengths in product development expertise and distribution strength across channels will help in taking 24 Mantra Organic to millions of homes...\u0026#34;\u003csmall\u003e \u003c/small\u003e\n\tSNBPL, incorporated in March 2004, recorded a revenue of Rs 306.1 crore in FY 2023-24.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-17T23:33:53+05:30",
  "modifiedTime": null
}
