{
  "id": "c5f42b78-5647-4c94-ab59-ea2cf9129420",
  "title": "Australia dumps plan for fines for social media giants enabling misinformation",
  "link": "https://www.investing.com/news/world-news/australia-dumps-plan-for-fines-for-social-media-giants-enabling-misinformation-3738420",
  "description": "",
  "author": "Reuters",
  "published": "2024-11-23 23:35:12",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 1511,
  "excerpt": "Australia dumps plan for fines for social media giants enabling misinformation",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "SYDNEY (Reuters) - Australia's government said on Sunday it had dropped plans to fine internet platforms up to 5% of their global revenue for failing to prevent the spread of misinformation online. The bill was part of a wide-ranging regulatory crackdown by Australia, where leaders have complained that foreign-domiciled tech platforms are overriding the country's sovereignty, and comes ahead of a federal election due within a year. \"Based on public statements and engagements with Senators, it is clear that there is no pathway to legislate this proposal through the Senate,\" Communications Minister Michelle Rowland said in a statement. Rowland said the bill would have \"ushered in an unprecedented level of transparency, holding big tech to account for their systems and processes to prevent and minimise the spread of harmful misinformation and disinformation online\". Some four-fifths of Australians wanted the spread of misinformation addressed, said the minister, whose centre-left Labor government has fallen behind the conservative opposition coalition in recent polling. The Liberal-National coalition, as well as the Australian Greens and crossbench senators, all opposed the legislation, Sky News reported. Greens senator Sarah Hanson-Young called the government bill a \"half-baked option\" in remarks televised on Australian Broadcasting Corp. on Sunday. Industry body DIGI, of which Meta (NASDAQ:) is a member, previously said the proposed regime reinforced an existing anti-misinformation code.",
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eSYDNEY (Reuters) - Australia\u0026#39;s government said on Sunday it had dropped plans to fine internet platforms up to 5% of their global revenue for failing to prevent the spread of misinformation online.\u003c/p\u003e \u003cp\u003eThe bill was part of a wide-ranging regulatory crackdown by Australia, where leaders have complained that foreign-domiciled tech platforms are overriding the country\u0026#39;s sovereignty, and comes ahead of a federal election due within a year.\u003c/p\u003e \u003cp\u003e\u0026#34;Based on public statements and engagements with Senators, it is clear that there is no pathway to legislate this proposal through the Senate,\u0026#34; Communications Minister Michelle Rowland said in a statement.\u003c/p\u003e \u003cp\u003eRowland said the bill would have \u0026#34;ushered in an unprecedented level of transparency, holding big tech to account for their systems and processes to prevent and minimise the spread of harmful misinformation and disinformation online\u0026#34;.\u003c/p\u003e \u003cp\u003eSome four-fifths of Australians wanted the spread of misinformation addressed, said the minister, whose centre-left Labor government has fallen behind the conservative opposition coalition in recent polling.\u003c/p\u003e \u003cp\u003eThe Liberal-National coalition, as well as the Australian Greens and crossbench senators, all opposed the legislation, Sky News reported.\u003c/p\u003e \u003cp\u003eGreens senator Sarah Hanson-Young called the government bill a \u0026#34;half-baked option\u0026#34; in remarks televised on Australian Broadcasting Corp. on Sunday.\u003c/p\u003e \u003cp\u003eIndustry body DIGI, of which Meta (NASDAQ:) is a member, previously said the proposed regime reinforced an existing anti-misinformation code. \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-11-23T23:31:31Z",
  "modifiedTime": null
}
