{
  "id": "d9f3288a-4e52-46bb-8bf8-5aadf3dd1b45",
  "title": "Control empresarial de capitales purchases $4.3 million in PBF Energy stock",
  "link": "https://www.investing.com/news/insider-trading-news/control-empresarial-de-capitales-purchases-43-million-in-pbf-energy-stock-93CH-3704020",
  "description": "",
  "author": "Investing.com",
  "published": "2024-11-06 00:54:44",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 3944,
  "excerpt": "Control empresarial de capitales purchases $4.3 million in PBF Energy stock",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "In a recent move, Control Empresarial de Capitales S.A. de C.V., a significant shareholder in PBF Energy Inc. (NYSE:), acquired 150,000 shares of the company's Class A common stock. The purchase, made on November 1, 2024, was executed at a weighted average price of $28.66 per share, with prices ranging from $28.54 to $28.75. This transaction amounts to a total value of approximately $4.3 million. Following this acquisition, Control Empresarial de Capitales now holds a total of 26,112,498 shares in PBF Energy. The Slim Family, beneficiaries of a trust owning all voting equity securities of Control Empresarial, may be deemed to indirectly own these shares. This holding represents about 22.7% of PBF Energy's outstanding Class A common shares, as reported in the company's recent Form 10-Q filing. In other recent news, PBF Energy experienced a challenging third quarter in 2024, reporting an adjusted net loss of $1.50 per share and an adjusted EBITDA loss of $60.1 million. These results were primarily due to weaker refining margins and a $29 million loss from its equity investment in St. Bernard Renewables. Despite these setbacks, PBF Energy returned $104 million to shareholders and announced a 10% increase in its quarterly dividend to $0.275 per share, signaling confidence in its financial stability. Mizuho (NYSE:) Securities, in response to these developments, has revised its price target for PBF Energy to $33 from the previous $36, maintaining a neutral rating on the stock. This adjustment reflects the firm's cautious outlook on the refining industry's near to medium-term prospects, based on a net asset value (NAV) approach. PBF Energy's fourth quarter guidance indicates a decrease in volume due to scheduled maintenance at the Chalmette refinery and adjustments for current economic conditions. However, the company is optimistic about 2025, expecting relief from refinery closures and easing geopolitical tensions. PBF Energy is also targeting $200 million in run rate cash savings by the end of 2025 and anticipates capital expenditures for the year to be between $750 million to $800 million. These are the recent developments for PBF Energy, a key player in the oil refining sector. Despite facing market challenges, the company remains strategically positioned for growth and is confident in its long-term prospects. InvestingPro Insights The recent share acquisition by Control Empresarial de Capitales aligns with several key insights from InvestingPro. According to InvestingPro Tips, PBF Energy's management has been aggressively buying back shares, which complements the significant insider purchase we've just seen. This could signal confidence in the company's future prospects despite current market challenges. PBF Energy's stock is currently trading near its 52-week low, with a price-to-book ratio of 0.57 as of the last twelve months ending Q3 2024. This low valuation might have attracted the insider purchase, potentially viewing the stock as undervalued. The company offers a dividend yield of 3.88% and has raised its dividend for three consecutive years, as highlighted by InvestingPro Tips. This commitment to shareholder returns, combined with the high shareholder yield, may be factors influencing the insider's decision to increase their stake. It's worth noting that PBF Energy faces some headwinds. The company's revenue declined by 12.81% in the last twelve months, and its EBITDA saw a significant drop of 99.54% over the same period. These figures suggest that PBF Energy is navigating a challenging operating environment, which could explain the stock's recent performance. For investors seeking a more comprehensive analysis, InvestingPro offers 12 additional tips for PBF Energy, providing a deeper understanding of the company's financial health and market position. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_8_800x533_L_1420026210.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\n\u003cp\u003eIn a recent move, Control Empresarial de Capitales S.A. de C.V., a significant shareholder in PBF Energy Inc. (NYSE:), acquired 150,000 shares of the company\u0026#39;s Class A common stock. The purchase, made on November 1, 2024, was executed at a weighted average price of $28.66 per share, with prices ranging from $28.54 to $28.75. This transaction amounts to a total value of approximately $4.3 million.\u003c/p\u003e\n\u003cp\u003eFollowing this acquisition, Control Empresarial de Capitales now holds a total of 26,112,498 shares in PBF Energy. The Slim Family, beneficiaries of a trust owning all voting equity securities of Control Empresarial, may be deemed to indirectly own these shares. This holding represents about 22.7% of PBF Energy\u0026#39;s outstanding Class A common shares, as reported in the company\u0026#39;s recent Form 10-Q filing.\u003c/p\u003e\n\n\n\u003cp\u003eIn other recent news, PBF Energy experienced a challenging third quarter in 2024, reporting an adjusted net loss of $1.50 per share and an adjusted EBITDA loss of $60.1 million. These results were primarily due to weaker refining margins and a $29 million loss from its equity investment in St. Bernard Renewables. Despite these setbacks, PBF Energy returned $104 million to shareholders and announced a 10% increase in its quarterly dividend to $0.275 per share, signaling confidence in its financial stability.\u003c/p\u003e\n\u003cp\u003e\u003cspan itemscope=\"\" itemtype=\"http://schema.org/Corporation\"\u003e\u003cspan itemprop=\"name\"\u003e Mizuho \u003c/span\u003e\u003c/span\u003e (NYSE:) Securities, in response to these developments, has revised its price target for PBF Energy to $33 from the previous $36, maintaining a neutral rating on the stock. This adjustment reflects the firm\u0026#39;s cautious outlook on the refining industry\u0026#39;s near to medium-term prospects, based on a net asset value (NAV) approach.\u003c/p\u003e\n\u003cp\u003ePBF Energy\u0026#39;s fourth quarter guidance indicates a decrease in volume due to scheduled maintenance at the Chalmette refinery and adjustments for current economic conditions. However, the company is optimistic about 2025, expecting relief from refinery closures and easing geopolitical tensions. PBF Energy is also targeting $200 million in run rate cash savings by the end of 2025 and anticipates capital expenditures for the year to be between $750 million to $800 million. \u003c/p\u003e\n\u003cp\u003eThese are the recent developments for PBF Energy, a key player in the oil refining sector. Despite facing market challenges, the company remains strategically positioned for growth and is confident in its long-term prospects.\u003c/p\u003e\n\u003ch2\u003eInvestingPro Insights\u003c/h2\u003e\n\u003cp\u003eThe recent share acquisition by Control Empresarial de Capitales aligns with several key insights from InvestingPro. According to InvestingPro Tips, PBF Energy\u0026#39;s management has been aggressively buying back shares, which complements the significant insider purchase we\u0026#39;ve just seen. This could signal confidence in the company\u0026#39;s future prospects despite current market challenges.\u003c/p\u003e\n\u003cp\u003ePBF Energy\u0026#39;s stock is currently trading near its 52-week low, with a price-to-book ratio of 0.57 as of the last twelve months ending Q3 2024. This low valuation might have attracted the insider purchase, potentially viewing the stock as undervalued.\u003c/p\u003e\n\u003cp\u003eThe company offers a dividend yield of 3.88% and has raised its dividend for three consecutive years, as highlighted by InvestingPro Tips. This commitment to shareholder returns, combined with the high shareholder yield, may be factors influencing the insider\u0026#39;s decision to increase their stake.\u003c/p\u003e\n\u003cp\u003eIt\u0026#39;s worth noting that PBF Energy faces some headwinds. The company\u0026#39;s revenue declined by 12.81% in the last twelve months, and its EBITDA saw a significant drop of 99.54% over the same period. These figures suggest that PBF Energy is navigating a challenging operating environment, which could explain the stock\u0026#39;s recent performance.\u003c/p\u003e\n\u003cp\u003eFor investors seeking a more comprehensive analysis, \u003ca href=\"https://www.investing.com/pro/pricing?referral=inv_in_article_anchor\"\u003eInvestingPro\u003c/a\u003e offers 12 additional tips for PBF Energy, providing a deeper understanding of the company\u0026#39;s financial health and market position.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-11-06T00:54:44Z",
  "modifiedTime": null
}
