{
  "id": "e09e9239-df4d-4798-9bb5-54e427cc6164",
  "title": "HCL Infosystems Q3 results: Losses down to Rs 5.25 cr, revenue rises 30.14%",
  "link": "https://www.business-standard.com/companies/results/hcl-infosystems-q3-results-losses-down-to-rs-5-25-cr-revenue-rises-30-14-125020801420_1.html",
  "description": "As a result, though the number of contracts reaching closure has increased, there has been no significant progress in recovering outstanding receivables from customers",
  "author": "",
  "published": "Sat, 08 Feb 2025 21:17:06 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Press Trust of India",
  "length": 2053,
  "excerpt": "HCL Infosystems has reported narrowing of losses to Rs 5.25 crore in the December quarter.",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "HCL Infosystems has reported narrowing of losses to Rs 5.25 crore in the December quarter. The IT system integration and solutions company had posted losses of Rs 9.30 crore in the year-ago period, according to a company filing. Revenue from operations tanked 30.14 per cent to Rs 5.70 crore in the third quarter of the ongoing fiscal year, as against Rs 8.16 crore a year earlier. Sequentially, revenue declined 16 per cent. \"During this quarter, the company continued to focus on actions and initiatives aimed at realising our long outstanding receivables and minimising operational losses,\" HCL Infosystems Manager Raj Sachdeva said.Also Read The business has continued to face challenges in obtaining timely customer acceptance and sign-offs for completed projects, leading to delays in receiving payments, a company statement said. As a result, though the number of contracts reaching closure has increased, there has been no significant progress in recovering outstanding receivables from customers. \"The company has taken the step of initiating arbitration proceedings against several customers to recover the dues owed. Due to multiple legal arbitration proceedings and legacy issues, significant effort and cost is being incurred on legal and legacy matters,\" it said. It added that costs related to project execution, regulatory compliance, internal finance management, ongoing litigations, and provision for unutilised GST input tax credit also face the company, as a result of which the firm \"anticipates limited business opportunities in the near term\". The company also announced the retirement of Ritu Arora, Independent and Non-Executive Director (existing director), who will cease office after the completion of her second term on April 5, 2025. Additionally, Rita Gupta has been appointed as Additional Non-Executive Director, the statement added.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-09/11/thumb/fitandfill/1200X630/1726051242-0926.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"parent_top_div\"\u003e\u003cp\u003e\n\tHCL Infosystems has reported narrowing of losses to Rs 5.25 crore in the December quarter.\u003c/p\u003e\n\u003cp\u003e\n\tThe IT system integration and solutions company had posted losses of Rs 9.30 crore in the year-ago period, according to a company filing.\u003c/p\u003e\n\u003cp\u003e\n\tRevenue from operations tanked 30.14 per cent to Rs 5.70 crore in the third quarter of the ongoing fiscal year, as against Rs 8.16 crore a year earlier.\u003c/p\u003e\n\u003cp\u003e\n\tSequentially, revenue declined 16 per cent.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;During this quarter, the company continued to focus on actions and initiatives aimed at realising our long outstanding receivables and minimising operational losses,\u0026#34; HCL Infosystems Manager Raj Sachdeva said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\n\tThe business has continued to face challenges in obtaining timely customer acceptance and sign-offs for completed projects, leading to delays in receiving payments, a company statement said.\u003c/p\u003e\n\u003cp\u003e\n\tAs a result, though the number of contracts reaching closure has increased, there has been no significant progress in recovering outstanding receivables from customers.\u003c/p\u003e\n\u003cp\u003e\n\t\u0026#34;The company has taken the step of initiating arbitration proceedings against several customers to recover the dues owed. Due to multiple legal arbitration proceedings and legacy issues, significant effort and cost is being incurred on legal and legacy matters,\u0026#34; it said.\u003c/p\u003e\n\u003cp\u003e\n\tIt added that costs related to project execution, regulatory compliance, internal finance management, ongoing litigations, and provision for unutilised GST input tax credit also face the company, as a result of which the firm \u0026#34;anticipates limited business opportunities in the near term\u0026#34;.\u003c/p\u003e\n\u003cp\u003e\n\tThe company also announced the retirement of Ritu Arora, Independent and Non-Executive Director (existing director), who will cease office after the completion of her second term on April 5, 2025.\u003c/p\u003e\n\u003cp\u003e\n\tAdditionally, Rita Gupta has been appointed as Additional Non-Executive Director, the statement added.\u003c/p\u003e\u003c/div\u003e\u003cp id=\"auto_disclaimer\"\u003e(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)\u003c/p\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-08T21:16:00+05:30",
  "modifiedTime": null
}
