{
  "id": "e17c4d59-f9ac-4b5a-bf87-daf934fb64c9",
  "title": "#2253 Mahway: A Startup Creating Startups",
  "link": "https://mixergy.com/interviews/mahway-with-jess-mah/",
  "description": "Jess Mah was listening to my interviews when I first connected with her, just like you are now. We got to know each other and I invested in her first startup, indinero. It aimed to take on Quickbooks, before pivoting to bookkeeping services. After watching her grow as an entrepreneur and pilot, we lost touch for years. We recently reconnected and I learned she’s now the founder of Mahway, which launches companies with moonshot ambitions. Jess Mah is the founder of indinero, the tax, financial and bookkeeping company, and of Mahway, a venture builder that aims to create innovative, industry-changing, billion-dollar businesses that improve the world. Sponsored byGusto – The cloud-based payroll, benefits, and human resource management software Mixergy interviewees use. More interviews -\u003e https://mixergy.com/moreint Rate this interview -\u003e https://mixergy.com/rateint",
  "author": "Andrew Warner",
  "published": "Fri, 10 Nov 2023 19:30:43 +0000",
  "source": "https://feeds.feedburner.com/Mixergy-main-podcast",
  "categories": [
    "startups",
    "ambition",
    "mix",
    "energy",
    "synergy",
    "mixology",
    "entrepreneur",
    "business",
    "tips",
    "motivation"
  ],
  "byline": "",
  "length": 39844,
  "excerpt": "Jess Mah was listening to my interviews when I first connected with her, just like you are now. We got to know each other and I invested in her first startup, indinero. It aimed to take on Quickbooks, before pivoting to bookkeeping services. After watching her grow as an entrepreneur and pilot,...",
  "siteName": "Business Podcast for Startups",
  "favicon": "https://mixergy.com/wp-content/themes/mixergy-2015-v2/assets/img/icons/apple-touch-icon-180x180.png",
  "text": "This interview is sponsored by Gusto. It only matters to people who are paying and handling benefits for your team. If that’s you, you know, how much of a headache it can be, why not use the software that I am more of? My interviewees have talked about that any alternative Gusto is beautiful. It’s effective. And right now if you use my link you can try it for free go to gusto.com/mixergy. this is a great time of year to do it gusto.com/mixergy. Andrew Warner: Wow. Hey there Freedom Fighters. My name is Andrew Warner. I’m the founder of Mixergy where I interview entrepreneurs and I talk very rapidly to them about how they built their businesses because I’m super freaking excited about how they built their businesses and I do it for an audience of entrepreneurs. Like today’s guest, Jess Ma, who I met back when she was in school, listening to interviews like this, I connected with her as she was building a business that was going to take on QuickBooks, which I hated at the time. And I invested in the business. It was like my first investment cause she wouldn’t let me just lend her the money. And, uh, I just tattered my house and I’d watch her grow as a business, as a business owner, as an entrepreneur, as a person, as, as a pilot. And then suddenly we lost track of each other and this business in Dinero that she founded, I didn’t know how it did. And we reconnected a little while ago and she said, Andrew, I’m actually now the founder of Mahway. It’s a holding company that oversees a lot of different businesses and it’s my vehicle for starting new ones. And as she started telling me her story about why she left the previous company, I said, every entrepreneur is going to identify with. This pain that she had that made her leave in Denaro. And a lot of you out there are going to identify with this. Ambition is creative, like vision that she has for creating a lot of companies, but most of us won’t do it. She did it. I want to find out why she transitioned away, how she’s coming up with new ideas for businesses, how she’s growing them and just in general, what’s going on. So Jessica, good to have you here. Jess Mah: Yeah, great to get to talk to you again. Andrew Warner: How many businesses does my way have now? Jess Mah: I’ve got eight businesses under Maui that I’m overseeing and I’ve got another four more are in the works. Andrew Warner: how are they doing financially? Jess Mah: Indonero is, uh, doing pretty well now. We’re profitable, making millions of dollars, top lining tens of millions and then a lot of my other companies, I’ll be honest, they’re still early. They’re still losing a lot of money and the jury’s still out on how they will do. Andrew Warner: I lost track of in dinero. it started out as a QuickBooks alternative and then it became a, an outsource, Bookkeeping company. And I thought it was doing well. the investor updates didn’t get into your inbox, I guess, or maybe they started going in a spam or something because we were pretty consistent about sending updates at, but yeah, occasionally people would not know what’s going on. And I always felt bad about that, since we had probably over a hundred investors to update. say this. You are by far the best, company at updating investors that I’d ever been a part of. And you’re right. It did absolutely go into my spam box because I got so much spam as one of the first, maybe the first. to do a podcast. And so I just had to create aggressive filters and I lost track of it. I then thought you were doing well over COVID. You told me about how you had to go and take walks after your 10th of the month finances got into your inbox because of what, what was going on? Jess Mah: before COVID, the company was growing really well. I thought, holy cow, this business is amazing. I want to run this for another 10 years. Uh, we’re going to be a mega unicorn and I’m going to be swimming in cash. This business is awesome. I was so excited about it pre COVID. And then when COVID happened, we had a lot of churn. our service quality started to suffer. We start, we went from making money to losing money. And the 10th of the month, uh, during COVID, I’m home alone, just like staring at my computer screen. And I get this whole report back on like, Exactly. How is our business doing on every metric, profitability, growth, customer satisfaction, insurance, et cetera. And all the numbers were flashing red, like this is bad. and so everyone was going through this, by the way, all my friends, all my peers,On one hand, I felt bad for myself, but I also just related to every other entrepreneur I knew who was struggling. So I would take really long walks by myself after that. And, I was with this guy named Travis, my boyfriend. And, I remember one time. After getting one of these reports on the 10th of the month, I’d come home and he’d see me just looking so upset and he said, what’s wrong? And so I would hug him. I wouldn’t say anything. And I would just start crying. I would just be bawling. I’m so emotional. I’m so upset. And I just have a five minute, one of those primal cries when you’re just so upset. I just remember thinking in my head. I’ve worked so hard for this business. It’s been going great. And the past few months it’s been going terribly. And today I just got like the worst numbers for our business. I don’t even know how we’re going to get through this. I have no idea. We’re going to run out of cash in six weeks from now. if I don’t turn this around, because I had overhired pre COVID and then now with COVID, it was clear to me I’d have to lay off lots of people. And, that was really difficult for me. You wouldn’t say anything, I’d just cry on my shoulders, and eventually he would just give me a smile and say, Jess, you’ll figure this out. I believe in you. That’s all he said. He didn’t give me any business advice, like all my other friends try to give me tactical advice. Like, okay, Jess, here’s how you do it, Rip. Here’s how you, clean up your business. Travis never did that. He just said, I believe in you. That’s all I needed to hear and pick myself back up and go right back to war. Andrew Warner: I’m surprised that was effective for me. That’s so painful because it feels like everybody. So much for me. And now even the person in my life does, but you know what, as I’m saying it, I’m thinking if Olivia, my wife said that to me, I would feel good because if I didn’t believe myself and the rest of the world, didn’t,I want to see the best possibility of me reflected back at me so that I could embody that. All right. I see that. And so then. You told me that you took a break, you went to Vegas and you had some inspiration. What was Vegas like for you? Jess Mah: We are, this is July 2020, and now I’ve got multiple months of the business not doing very well. So I’m feeling pretty, pretty upset about it. And I’ve been working on this business for over a decade. And I have all these investors like you who I’m trying to impress. And make money for, and not lose money for, but I have, I wanted to start another company and I’m partying in Vegas, totally hammered out of my mind. It’s probably 2 PM on an afternoon and we’re at, Encore Beach Club. and of course most of my friends in SF are, they’re all quarantined and anti COVID. And meanwhile, I was just like not caring at all. A close buddy of mine named Jordan and we looked at each other and he was DJing during pre COVID so he was like very well known in the Hollywood nightlife scene. And, he was now making no money because nightlife was shut down. And we both said, we want to make more money. We know we can do better. We believe in our potential as entrepreneurs. And yet, why are we making no money right now, despite having worked so hard? And so we said, let’s come up with a business idea and do something. And so over the next few hours, we’ve brainstormed a ton of ideas while we’re plastered out on Corbeach club and everyone else is having fun, but we’re talking about business. We’re determined to come up with something new and we come up with this litigation, FinTech idea. business, I’ll be honest, is still in stealth mode. Andrew Warner: Oh no, you can’t tell us what it is. Jess Mah: I’ll tell you in a nutshell. we don’t go into too much detail here because it’s, it’s a very, uh, interesting business that we don’t want people to copy. But we originate… So we find, originate, and fund litigation, launched, that year we launched of millions of dollars worth of litigation. Where we owning 50 percent plus ownership stakes in these cases. Andrew Warner: You realize there are people who clearly have been wronged, but don’t have the means to go and sue to get what they deserve. And you said, we will team up with you. We will back you financially. We’ll do what Peter Thiel did to Hulk Hogan. In return, you pay us back a portion of the winnings. Jess Mah: We and our lawyers with the plaintiff, we would split the earnings almost down the middle, roughly 50 50, and these cases would be anywhere from 30, 000, 50, 000 cases to a million dollar claims. And we, my, my buddy who I was with in Vegas, he built call centers and massive sales teams with hundreds of people. So he knew how to do that. Andrew Warner: A DJ friend had done that? Jess Mah: before he started DJing, that was what he did. he was running a business that did that, like hundreds of employees reporting to him, and then he wanted to be a DJ. And now was his, chance to come back into the business world. And we decided, we said, okay, you’ll be the CEO. You have more experience. And I’m like, I don’t want to be CEO. Yeah. And I’m already CEO. And I’m like, not doing a very good job. You be the CEO. I’ll be the exec chairman. And. And I’ll make sure it gets funded. So I put in a few hundred grand of my own money. So we came up with the idea on Saturday afternoon at Encore Beach Club. And then by Monday we started running on the business. we did not want to wait because we knew that if we waited another week or two and just let it sit in the back of our heads. We would never do it. Andrew Warner: You know, this is one of the things that I loved about living in San Francisco. People who thought this way, most people would say, Okay, let’s see if we can get a couple of people signed up, a couple of customers, we’ll see if we can sign up a few lawyers. The thought of, alright, how do we get a whole call center put up, how do we go really big, is such an exciting part of that culture. how quickly did you do that? How quickly did you go to call center? Jess Mah: We started hiring people by the end of that following week, we just posted on Craigslist, I think. So the call center, Andrew Warner: Just posted on Craigslist. We need people who are going to make phone calls to, to potential customers. That’s what it was. Jess Mah: pretty much, that’s pretty much it. But we did the phone calls ourselves that week. And my buddy, Jordan, he was the sales rep and the customer service agent and the whole thing. So we could write out a script. And I still really believed in having the founders do that hard work up front and not trying to outsource or delegate that too early because you learn a lot in that process. Andrew Warner: And then once you had a script, you hired people and you said, go make calls like this, that’s the claimant, I guess, part of the. The plaintiff claimant part of the equation and then fining lawyers was how? Jess Mah: exactly. So we found a lawyer just through our network and friends, and then we, we did a lot of, aggressive, marketing, just like how you see these billboards on the side of the highway saying got injured. I mean, we basically have doing that, um, our own way. then, yeah, we have who would, just validate and break down all the case notes. Andrew Warner: Meaning you would buy ads and then people who called up the call center was inbound people who called up would get qualified by The people who you hired on Craigslist Anyone who is a good fit would then go on to talk to a lawyer. You would pay the lawyer and then Split the profits, you and the lawyer and the claimant. Jess Mah: that is correct. Yes. Andrew Warner: Okay, and now there’s a specific issue that you were battling that you told me about that you felt really strong that these people had to put up with. I think you don’t want me to talk about what that specific issue was, and to be honest with you, I don’t remember. But I remember it wasn’t like randomly fall down people who had, Hurt themselves on a bus type of thing. Jess Mah: no, these are definitely more, aggressive things. I mean, there’s just so much bad stuff in the world, right? Whether you get hit by a car or you lose your house in, the Hawaii fire or you’ve been sexually harassed or whatever. you could just think of all these different ways that. people have a claim, but they’re too nervous to sue. And they haven’t done that before. those are the people we’re really trying to advocate for and help. Andrew Warner: What I mean is it personal injury lawyers? Like the type of things that we see on buses or no. Jess Mah: we’ve looked at personal injury, but we don’t do personal injury. It’s just very, it’s too, competitive. Andrew Warner: Okay. All right. You get this business up and running with a couple of hundred thousand that you put up, where does that money come from? Is this just you saving salary from Indonero or is it you selling some of your shares? Jess Mah: I sold some secondary, so I had a little bit of cash. That was quote unquote my life savings and I plowed a lot of that straight into this business because YOLO, why not? and I was getting great metrics very quickly, like within the first few weeks, I thought, I went from thinking, okay, this could be a great lifestyle business just tothrow off enough cash to like pay for my lifestyle. and then it snowballed from there and I realized, oh my God, I think this is going to be a home run. And it was just, it was 30 days from being like very upset and crying on my boyfriend’s shoulders to, wow, I’m going to make a lot more money. And it’s going to be way easier than what I did the first time around. I mean, in an era, it was a long slog and, Over 10 years that I was running in and out at that point. Andrew Warner: earning a salary and then these little shares that you sold right? What was your salary? Let’s be open. Jess Mah: Not even a good salary.for most of that period, I was paying myself for the first four years. I paid myself, what was it like 30, 000 a year. And then I gave myself a raise to 80, 000 a year for a few years. And then it went to 120, 000 a year. So I was making less money than pretty much all of my friends that I went to college with. Andrew Warner: You were making less than all your friends who are going to college living in San Francisco for much of it I had no idea that that’s where you were. Obviously, the 30, 000 is painful, 100, 000, I’m sorry, yeah, 120, 000, most people wouldn’t call poor unless you live in San Francisco, and then you realize that’s really painful. To give you a sense of how tough it is to live in San Francisco for that, if you make less than 300, 000, the schools we were looking at would give you financial aid in San Francisco. But you were still flying everywhere. And so I thought Jessica has made it. She’s got all these bookkeepers in the Philippines. She’s on the cover of Ink Magazine. She’s got this business is doing well. was flying expensive. You were flying your own, not your own plane, but you were flying a plane on your own. That’s expensive to get to. Jess Mah: Yeah, I’ll tell you the trick. So I was taking flying lessons because I was at your house, Andrew, we were at a dinner party and one of you had this brilliant idea for us to all get our pilot licenses. And this was 2014. So I was paying myself 40, 000 now, I think. And I put every dollar I made. Street into flying lessons. I got so addicted. Every single dollar went to I had to space out my flying lessons to make sure I had enough money to pay for the bill that month, okay? And it took five months for me to get my license, and I spent 8, 000, 8, 500. math on that, like, spending, yeah, about 1, 500 month. Um, which was all my disposable income. Andrew Warner: That’s a good deal. I should say, I didn’t know that any of this was happening. It wasn’t that we all agreed at the dinner party to do this. It was your side of the table that talked about it, and the table was unfortunately so big, I didn’t even know any of this conversation happened until after you got your license. Okay, talk to me about Travis. Supporter who believed in you when things were down, whose shoulder you could cry on. What happened? Jess Mah: Travis, he had a lot of, mental health issues. he served, as a U. S. Marine in Iraq. and he was a frontline combat guy, had seen a lot of. bad things out there and his mental health after my legal tech business started doing really well, he was on the rocks and on the decline and just having a lot of paranoia, a lot of, thinking people were out to kill him, basically. And even if you go to the doctor’s office or to the hospital or whatever to try to get help, he would think that he couldn’t walk in because the people painting the wall of the VA are trying to murder him. Like, that’s how crazy this guy. Andrew Warner: Why do you think this suddenly happened to him? Jess Mah: I think he was struggling with depression, which put him into substance abuse, and the substance abuse, brought this up and it became a vicious negative spiral. And so, eventually, I left for a week, I was on a trip, and while I was gone… he took his own life at home. I learned about it when I came back and his best friend said that he found Travis, dead at home and the police were there. It’s a crime scene, can’t come back. And. after that, I remember thinking in that moment, my life will probably never be the same again. And I didn’t know what to do. at that point, I was then, I didn’t have a home. I wasn’t going to go back there ever again. And, I only had what was in my suitcase and in my backpack. all my other belongings at home got, permanently destroyed during the process. Without going into too much detail. And, I, uh, couldn’t work again after that. I actually stopped working for the next six months. Andrew Warner: disconnected, stopped returning calls. Jess Mah: Everything. No email, no calls. Anyone who tried to get in touch with me, I just ignored. And I had my assistant replying to people, and she had a canned email. It’s explaining what happened and if they really need to talk to me, then they could call someone else in one of my companies and they would gladly deal with their situation and people were very respectful and that was a very difficult time. That was two and a half years ago. Andrew Warner: Jordan, I’m assuming, was manning the, legal tech company who was taking care of Indonero. Jess Mah: I had my entire accept team rally and. Divide and Conquer, and I just had them give me a 30 minute update call once a week, just to tell me what was going on, and they were really great during that process. Andrew Warner: How did you spend your time in that period? Jess Mah: during that time, I had a lot of friends helping me. I was bouncing around, sleeping on a bunch of sofas and spare bedrooms for friends. So I probably, I tried to stay at someone’s place for no more than two or three weeks, just so I wasn’t imposing on them. And I would wake up, meditate, read, talk to a grief counselor or therapist, explore cooking, take long walks, explore nature. And, it was such a surreal experience because I’d never lived like that before. I’ve always been stimulated on my phone, on my email, on Slack, back to back conference calls all day long. And. Here I was with nothing to do, nowhere to be, and the only priority was just to do something that would make me feel good that day, Andrew Warner: Like? Jess Mah: like cook a meal for myself, or go on a hike, or journal, or… I read so many books during that time. I reconnected with a sense of spirituality during that period. I… Spent a lot of time with friends who I didn’t have time to hang out with before that. so yeah, a lot of wholesome activities. Andrew Warner: How did you get out of it? Jess Mah: I, it was a very slow, it was a very slow process. It, I went away to visit a friend for New Year’s. And all my friends were telling me I should just take a year off and not go back to work. I had found a new CEO for Indonera to take over for me, someone who’s built companies with, much bigger than Indonera to take over. So I was now fully free. And so I thought about doing a sabbatical. So I put together this whole list of all the things I would do. If I took a year or two off for sabbatical, what would I do? And when I was flying back from Hawaii, back to LA, I’m on the plane, I’m journaling. And. I distinctly remember thinking, you know what? I gotta get back to work. That’s the next chapter in my healing. I need to get back into it. Partially to convince myself that I can do it again. Cause after Travis passing, I worried that I had a permanent disability. Kinda like if you have lose a limb. That’s kinda how I felt a bit. I wondered, did I lose my work mojo? Am I able to do that again? And I wanted to prove to myself that I could. And so I went back to work literally the next day. I started plotting out what my dream job would be, what I wanted to do, what would I do if I had no one to impress, if I didn’t care about making money, if I had no investors to appease. What do I just want to do? Because I want to do it. And that’s what led me to thinking about what I’m doing now, which is Mahway Andrew Warner: thinking, whatever I did at the legal business, I think I want to do again and again and again. I’m not going to commit myself to being a s Actually, what was your need list and what was your won’t do list? Jess Mah: my want list was I won’t be a CEO again. I had such a big ego during the time I was running in and error thinking I need to be CEO. I need to prove to myself I can be CEO. and, I realized I just. He did the job. I didn’t want to do it anymore. And I love the energy of starting the legal FinTech platform. And I love the early years of in and era and getting that going. And I just wanted to do that over and over and over and over again. And I had a whole list of dozens. Now the list is hundreds of business ideas that I wanted to build and. I dreamt in my head, what if I have a holding company of sorts that helps me make sure that Indonera and other companies don’t go off the side of the tracks, but they keep on doing well, and we start new companies, and my team of people Essentially helps me clone myself 10, 20 times over to support all my companies. And I don’t want to be a startup studio. I don’t want to print 30 companies a year. I just want to pick a few a year that I’m passionate about, that I’m excited about, that can actually help people make a difference. And I also want to do things that were more outside of the box, like one company we’re doing. Actually, we have several bio companies, so I got into bio and, we’re looking at doing some deep tech stuff and some climate stuff. And it’s basically just whatever my interests are, where I think you could do good and create a big business. that’s what we’re going to do and, I wasn’t gonna do something to appease other people anymore. At that point I realized it was time for me to prioritize myself. Leaving this world put a lot of that in a perspective for me in a way that. Would have been really hard for me to do on my own. Andrew Warner: Were you someone who tried to please other people? Jess Mah: Yeah. Like most people starting with trying to please my parents. Jess: What were your parents like? Jess Mah: Uh, pretty cool for the most part, but of course they wanted me to do well and they have their opinions on a bunch of things like they, like my mom never went to college, so she was always. Like making sure I was doing my homework and doing it well. And she’s very, she’s a very proper woman. but they were super, kind to me during this whole process with Travis, but at some point my mom said, okay, go see your therapist for a few months. But then you gotta get over it. you gotta get your head back into the game, Jess. And that was really tough love and tough for me to stomach at the time. I think a lot of people would have resented their mom for saying that, but I appreciated it because I needed that kick in the butt to get back in. Andrew Warner: So you’re someone who has a lot of business ideas. Where I’ve always been an entrepreneur who doesn’t, I I’m now seeing notes from a conversation that we had before. Uh, this is from April, 2022, where you said that you hired someone to do customer development. Customer development is where you try to understand what the customer wants, what their problems are, and then see if you could solve it, right? That aspect of. Actually, is that an aspect of how you figure out which business to go after? You’re giving me the smile like maybe I’ve just revealed something I shouldn’t or you revealed something that you shouldn’t. What’s behind that Jess Mah: I’ve been thinking about this a lot, actually, how do you come up with, create ideas? Because there are seasons where you have more ideas and some seasons where you have nothing. And I still have, I had6 months this year where I was just running dry where I wondered if I’d ever have another good idea again. And what I realized is that if I just identify a problem space. Like there are lots of problems in this general area. I don’t know exactly what the customer issue is, but I know there are problems here. Let’s go search there. Let’s go talk to all the experts and figure out what are the problems. And there’s a lot you could outsource. And by outsource, having a team of people do those interviews and come up with the questions you want to ask them and you could read the notes and that gets you thinking, obviously as an entrepreneur, I want to be on those calls too. And I want to. Good exposure there, but it starts from identifying a problem space. It’s not like I’m just walking around and, Oh my God, I just came up with this brilliant business idea that doesn’t happen. it’s always starts from the problem. Andrew Warner: give me specifics. we’ll get into some of the other businesses because I’ve left people with this idea that you’ve got a holding company without saying what it’s holding beyond giving one example. But first, Give me an example of either a company that you said we’re going to pursue or not based on this research. Where was the idea? What was the research that you did? What did it tell you? Et cetera. Jess Mah: I think one of my favorite businesses is this company called Eagle Corps. Eagle Corps. I came up with while snowboarding with a U S army veteran friend of mine. We were in Park City, I was still depressed from all this Travis stuff and I also cried on his shoulder that day. We’re getting lunch, just the two of us, and he told me we were not brainstorming business ideas. Just to be clear, this is just a friendly, we’re having lunch and we’re hanging out conversation and I said, could you tell me a little bit about your story post? the army and tell me about how you ended up being a software engineer, something like that. And he told me how he went through a coding bootcamp and how the government sponsored his uh, course. But he was the only veteran in his course. Everyone else was a normal civilian. And I thought, wow, so you got lucky. Basically, your brother told you to take a coding bootcamp course because he works at Google, and that’s what inspired you to do this. Now you’re making way more money than all these other veterans. So all these other veterans, the problem is they can’t get a good job out of the military because they don’t have the right training. Even though the government’s willing to pay for it. And he said, yeah, that’s exactly right. And so, now we have this problem that I can’t get out of my head. I’m like, oh my god, like all these veterans who can’t transition out of the military, then turn to substance abuse, and they get depressed, and there’s a lot of suicide, and I’m thinking about Travis, thinking about how this friend got lucky, I connect all the dots, and the idea becomes, how do you create an educational platform that’s focused on veterans? And could we do it in a way that’s by veterans? So you helped me start this company and it’s for veterans and we’re not taking our normal civilians because veterans have very unique challenges. you have to really cater to them. And I have this amazing go to market capability that I built from the legal FinTech company. Why don’t we just replicate that and all the best practices I learned over to finding veterans. And then by the end of the day, we had a new business. So these things happen very quickly. Andrew Warner: so at the end of the day you have a new business, but do you then go to figure out whether it’s a viable business before investing in it? do you do customer development? Jess Mah: I was pretty confident that this business would work out right away. but yeah, we started doing go to market testing to see if you could acquire, uh, customers cost effectively. And, and yeah, so we do all the testing. And we didn’t, I didn’t talk to other veterans, I’ll be honest. Cause I felt like I understood the veteran mindset very well. By that point, my dad’s us army veteran who served in Vietnam, obviously had Travis and a ton of military veteran friends. So I really understood the customer and their problem. So I was more focused on could we deliver the solution and can we acquire the customers? Those were the two biggest areas to de risk. And so, and then there’s a regulatory area in this business to de risk. so my friend, Jared, did a lot of that. and then he quit his job like two months later and then we were off and running. Andrew Warner: you said that you were doing a go to market test to see, do you have that? To do risk this business? What is that? What did you do? Jess Mah: Oh, okay. So the de risking process is, doing online marketing essentially, and then having people fill out a form. And then you or your small team actually calling the customer back and trying to sell them as if you’re the sales rep. And obviously you don’t have a solution. You don’t have a product. But you try to see if they would buy. Like, look, here’s what I would do for you if you really wanted. and just basically making up a script on the fly, Andrew. Andrew Warner: before there’s any business? Jess Mah: And then documenting what are the questions before there’s any business. This is like within, one week we’re doing this. Andrew Warner: this is basically the Eric Riesling startup idea that I remember years ago, back when you were blogging, you blogged that you had an idea for Indonero, you put it up on the website without actually creating the businessor the product you look, I’m sensing that you don’t remember what I’m talking about, but I remember you talking about this once randomly. And I get it. This is very basic stuff that you’re saying that you do. And then you have a team of people call up and say, will you buy it? See if there’s a script. I’m on the site right now, by the way, I put in my information. I’m not getting anything. There’s not even like a confirmation page. Is it up and running as a business now? Jess Mah: It is, but it’s still kind of behind the scenes still. And, I guess it’s now we’re talking about it a little bit. but yeah, we are starting to operate now. and, and we’re getting it. And the company’s raised financing and yeah,has a seasoned CEO in the seat. so yeah,we are getting Andrew Warner: It’s basically a coding school aimed at this market, right? Jess Mah: we’re started coding, but there’s a lot of other technical skills that we’re planning to teach people. So you basically have, it’s like a buffet of like, all right, what technical skills do you want to learn? And then a job placement platform on the backend. Andrew Warner: Take me to biotech. How do you get into biotech all of a sudden? And can you make it as clear as you just did the story for EagleCore? Jess Mah: I got on a bio because I’ve always been fascinated by bio. My dad worked at Sloan Kettering for 45 years. Sloan Kettering’s a world renowned cancer hospital in New York City. And I remember when I was, I think, 10 or 11 years old, I’d go visit my dad at work and I thought, okay, it’s cool. My dad’s an engineer at a cancer hospital, whatever. And I see these kids my age with no hair. And they look really sick. And so I asked my dad, Hey, what’s going on? Like, why does this kid have no hair? And he said, they have no hair. Cause they got cancer and they’re being treated here and they can’t go to school. They can’t play with their friends. They’re stuck here because they’re sick. And I just can never get that, that, that thought out of my head. And so I’ve always been fascinated with bio as a result. My dad would say things like,we’re spending billions of dollars here at Sloan Kettering on trying to cure cancer. By the time you’re an adult, we’re not going to need this anymore. We could probably shut the hospital down. I’ll be out of a job and, all will be fine in the world. He really believed that. And here we are. Fast forward. It’s been 20 plus years later and we’re nowhere close on our fight against cancer. And so I come across a scientist who. This guy, Mike Levin, I watch his TED talk online, I read his article in the New Yorker, he has a podcast interview with Lex Friedman, and he talks about things like normalizing cancer, using bioelectricity to take cancerous tumors, and instead of having to kill these cancer cells. what you do with chemo or radiation or surgery, you’re just making them act as if they’re normal cells again. And I was just so mesmerized by that, I thought, wow, is this guy getting enough funding? Does he have the right talent around him to make this real or not? So I get in touch with him. And he doesn’t have anyone working with him on this cancer stuff or longevity stuff or on, a lot of people just thought of him as this futuristic sci fi scientist and they weren’t taking him as seriously as I was taking it. And so that was the idea. can we build companies around this brilliant scientist and other brilliant scientists like him who have something amazing and the biotech community is very conservative, they’re not very forward looking, Andrew, it’s actually. pretty scary, and we’ll get into that another time. And, so I brought in this biotech veteran, I run an executive search, I hire a headhunter, pay them, I don’t know, 150, 000, I say, Find me a biotech veteran who can work with this awesome scientist to make this stuff real. And I find this guy named Tom who’d taken a drug from lab all the way through FDA for 15, 000, 1. 5 million. For a full FDA approval, it’s a drug called Elsonerase. And so this guy’s saved, I don’t know, many thousands of lives through, treating this rare form of leukemia where the patient would otherwise die within six months of diagnosis. Now these patients are going into full remission and living normal lives because of this guy. So I think, perfect. I got a guy who could help. And, and so that, that’s how that company got going. And that company is called Astonishing Labs. And they’re spinning out other companies. It’s like a holding company of bio stuff inspired by Mike Levin. and that also came to me very quickly. it was like, I heard about it and then within two weeks, I was moving on it. Andrew Warner: That is incredibly, incredibly fast. And the goal here is, maybe this is tongue in cheek, but when I look at your LinkedIn profile, it says unicorn breeder. Is the goal to turn these into unicorns? Jess Mah: I think that’s a by product of everything else we’re doing. Yeah. I want them to be unicorns, but the idea is could we actually. Like normalize cancer cells beyond just doing it, in a lab environment, can we actually help tens of better tens of thousands of veterans get better jobs? If we do that, then these companies will be very successful. They’ll make a lot of money. but the goal wasn’t. Necessarily it’s a, make money for the sake of making money. If I got tired of thinking about, doing another SaaS company or like a sales enablement tool, like that stuff just didn’t get me excited. These two examples I gave you, they’re concrete examples of businesses that can make a lot of money, but help a lot of people at the same time. Andrew Warner: All right, I’ll close out with this. Are you happy now? Because as I was looking on LinkedIn to get information about what you’re up to, I saw this post about how you’re working 60 hours a week, and there was some comment about here’s what my life is like. You don’t want to be me, right? Is this someone who’s achieved the goal that she strived for after that breakdown period? Jess Mah: That’s a long conversation. I’d say overall, I’m doing way better, way happier. but I still have the typical angst that,any other 33 year old would have, but yeah, I’m doing a lot better. I really do enjoy my work and my job now. And I just feel that there’s just so much more creating that I want to do. And I want to see how these, ventures go. I really want to see some drugs. get a full approval and actually impact patients. And until I make more progress on what I just told you, I’m not going to be satisfied. Andrew Warner: All right. I love the name of the company because it’s so fitting with what you’ve told us. It’s called Mahway, your last name, of course, being M A H Ma. All right. I’d love to come back and see how this ended up, working out for you. Jess Mah: Thank you so much. Yeah. the story is in a weird way, just beginning. I’m super excited about where this is going and, I’d love to continue this and hey, maybe we should do a part two sometime. I feel like we’re just getting this going. Andrew Warner: Anytime we got text messages and I would actually, when we are like old 120, 150 year old people, I would love to do an interview then and go back in time and talk about how this all played out in general, I will say this. I’m going to say thank you to Jessica, but also say that. Interviewing has been amazing. It’s let me connect with you, Jessica, as both a listener and a guest. And it’s let me do this now with guests over 2000 times. So many of my friends,Cody McLean, who I partnered up with on a podcast business is someone who I met because I interviewed him and then we got together in person. And then I went to his house and so on for party. It has been amazing. If you’re out there and you’re thinking about doing a podcast and you need help, we meaning me and my team here at mixer G and now Cody too, who’s partnered up with me, we’ll be happy to help you think through how to do it. And if you need to hire us to produce your podcast, we’re available to contact me. Here’s my personal email address. The same one that Jessica and I have been using. I guess you go by Jess now. Jess and I have been using for years since back when she was known as Jessica and I was known as Shuki. actually no, back then he, I was known as Andrew. Uh, it doesn’t go that far back. Not till elementary school. Here’s the email address. All seriousness, personal connection with me. Let’s talk through your business and your podcast. Even if it’s not something you pursue with us, I want to help you get there. My email address is Andrew@mixergy.com. Jess Mah: hope Andrew Warner: Bye Jess Mah: see",
  "image": "https://mixergy.com/interviews/mahway-with-jess-mah/?get-twitter-card=true\u0026v=14\u0026time=1699615888",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\t\t\t\u003cp\u003eThis interview is sponsored by Gusto. It only matters to people who are paying and handling benefits for your team. If that’s you, you know, how much of a headache it can be, why not use the software that I am more of? \u003c/p\u003e\n\u003cp\u003eMy interviewees have talked about that any alternative Gusto is beautiful. It’s effective. And right now if you use my link you can try it for free go to gusto.com/mixergy. this is a great time of year to do it gusto.com/mixergy.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Wow.\u003c/p\u003e\n\u003cp\u003eHey there Freedom Fighters. My name is Andrew Warner. I’m the founder of Mixergy where I interview entrepreneurs and I talk very rapidly to them about how they built their businesses because I’m super freaking excited about how they built their businesses and I do it for an audience of entrepreneurs.\u003c/p\u003e\n\u003cp\u003eLike today’s guest, Jess Ma, who I met back when she was in school, listening to interviews like this, I connected with her as she was building a business that was going to take on QuickBooks, which I hated at the time. And I invested in the business. It was like my first investment cause she wouldn’t let me just lend her the money.\u003c/p\u003e\n\u003cp\u003eAnd, uh, I just tattered my house and I’d watch her grow as a business, as a business owner, as an entrepreneur, as a person, as, as a pilot. And then suddenly we lost track of each other and this business in Dinero that she founded, I didn’t know how it did. And we reconnected a little while ago and she said, Andrew, I’m actually now the founder of Mahway.\u003c/p\u003e\n\u003cp\u003eIt’s a holding company that oversees a lot of different businesses and it’s my vehicle for starting new ones. And as she started telling me her story about why she left the previous company, I said, every entrepreneur is going to identify with. This pain that she had that made her leave in Denaro. And a lot of you out there are going to identify with this.\u003c/p\u003e\n\u003cp\u003eAmbition is creative, like vision that she has for creating a lot of companies, but most of us won’t do it. She did it. I want to find out why she transitioned away, how she’s coming up with new ideas for businesses, how she’s growing them and just in general, what’s going on. So Jessica, good to have you here.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Yeah, great to get to talk to you again.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: How many businesses does my way have now?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I’ve got eight businesses under Maui that I’m overseeing and I’ve got another four more are in the works.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: how are they doing financially?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Indonero is, uh, doing pretty well now. We’re profitable, making millions of dollars, top lining tens of millions and then a lot of my other companies, I’ll be honest, they’re still early. They’re still losing a lot of money and the jury’s still out on how they will do.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: I lost track of in dinero. it started out as a QuickBooks alternative and then it became a, an outsource, Bookkeeping company. And I thought it was doing well. \u003c/p\u003e\n\u003cp\u003ethe investor updates didn’t get into your inbox, I guess, or maybe they started going in a spam or something because we were pretty consistent about sending updates at, but yeah, occasionally people would not know what’s going on. And I always felt bad about that, since we had probably over a hundred investors to update.\u003c/p\u003e\n\u003cp\u003esay this. You are by far the best, company at updating investors that I’d ever been a part of. And you’re right. It did absolutely go into my spam box because I got so much spam as one of the first, maybe the first. to do a podcast. And so I just had to create aggressive filters and I lost track of it.\u003c/p\u003e\n\u003cp\u003eI then thought you were doing well over COVID. You told me about how you had to go and take walks after your 10th of the month finances got into your inbox because of what, what was going on?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: before COVID, the company was growing really well. I thought, holy cow, this business is amazing. I want to run this for another 10 years. Uh, we’re going to be a mega unicorn and I’m going to be swimming in cash. This business is awesome. I was so excited about it pre COVID. And then when COVID happened, we had a lot of churn.\u003c/p\u003e\n\u003cp\u003eour service quality started to suffer. We start, we went from making money to losing money. And the 10th of the month, uh, during COVID, I’m home alone, just like staring at my computer screen. And I get this whole report back on like, Exactly. How is our business doing on every metric, profitability, growth, customer satisfaction, insurance, et cetera.\u003c/p\u003e\n\u003cp\u003eAnd all the numbers were flashing red, like this is bad. and so everyone was going through this, by the way, all my friends, all my peers,On one hand, I felt bad for myself, but I also just related to every other entrepreneur I knew who was struggling. So I would take really long walks by myself after that.\u003c/p\u003e\n\u003cp\u003eAnd, I was with this guy named Travis, my boyfriend. And, I remember one time. After getting one of these reports on the 10th of the month, I’d come home and he’d see me just looking so upset and he said, what’s wrong? And so I would hug him. I wouldn’t say anything. And I would just start crying. I would just be bawling.\u003c/p\u003e\n\u003cp\u003eI’m so emotional. I’m so upset. And I just have a five minute, one of those primal cries when you’re just so upset. I just remember thinking in my head. I’ve worked so hard for this business. It’s been going great. And the past few months it’s been going terribly. And today I just got like the worst numbers for our business.\u003c/p\u003e\n\u003cp\u003eI don’t even know how we’re going to get through this. I have no idea. We’re going to run out of cash in six weeks from now. if I don’t turn this around, because I had overhired pre COVID and then now with COVID, it was clear to me I’d have to lay off lots of people. And, that was really difficult for me.\u003c/p\u003e\n\u003cp\u003eYou wouldn’t say anything, I’d just cry on my shoulders, and eventually he would just give me a smile and say, Jess, you’ll figure this out. I believe in you. That’s all he said. He didn’t give me any business advice, like all my other friends try to give me tactical advice. Like, okay, Jess, here’s how you do it, Rip.\u003c/p\u003e\n\u003cp\u003eHere’s how you, clean up your business. Travis never did that. He just said, I believe in you. That’s all I needed to hear and pick myself back up and go right back to war.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: I’m surprised that was effective for me. That’s so painful because it feels like everybody. So much for me. And now even the person in my life does, but you know what, as I’m saying it, I’m thinking if Olivia, my wife said that to me, I would feel good because if I didn’t believe myself and the rest of the world, didn’t,I want to see the best possibility of me reflected back at me so that I could embody that.\u003c/p\u003e\n\u003cp\u003eAll right. I see that. And so then. You told me that you took a break, you went to Vegas and you had some inspiration. What was Vegas like for you?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: We are, this is July 2020, and now I’ve got multiple months of the business not doing very well. So I’m feeling pretty, pretty upset about it. And I’ve been working on this business for over a decade. And I have all these investors like you who I’m trying to impress. And make money for, and not lose money for, but I have, I wanted to start another company and I’m partying in Vegas, totally hammered out of my mind.\u003c/p\u003e\n\u003cp\u003eIt’s probably 2 PM on an afternoon and we’re at, Encore Beach Club. and of course most of my friends in SF are, they’re all quarantined and anti COVID. And meanwhile, I was just like not caring at all. A close buddy of mine named Jordan and we looked at each other and he was DJing during pre COVID so he was like very well known in the Hollywood nightlife scene.\u003c/p\u003e\n\u003cp\u003eAnd, he was now making no money because nightlife was shut down. And we both said, we want to make more money. We know we can do better. We believe in our potential as entrepreneurs. And yet, why are we making no money right now, despite having worked so hard? And so we said, let’s come up with a business idea and do something.\u003c/p\u003e\n\u003cp\u003eAnd so over the next few hours, we’ve brainstormed a ton of ideas while we’re plastered out on Corbeach club and everyone else is having fun, but we’re talking about business. We’re determined to come up with something new and we come up with this litigation, FinTech idea. business, I’ll be honest, is still in stealth mode.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Oh no, you can’t tell us what it is.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I’ll tell you in a nutshell. we don’t go into too much detail here because it’s, it’s a very, uh, interesting business that we don’t want people to copy. But we originate… So we find, originate, and fund litigation, launched, that year we launched of millions of dollars worth of litigation.\u003c/p\u003e\n\u003cp\u003eWhere we owning 50 percent plus ownership stakes in these cases. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You realize there are people who clearly have been wronged, but don’t have the means to go and sue to get what they deserve.\u003c/p\u003e\n\u003cp\u003eAnd you said, we will team up with you. We will back you financially. We’ll do what Peter Thiel did to Hulk Hogan. In return, you pay us back a portion of the winnings.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: We and our lawyers with the plaintiff, we would split the earnings almost down the middle, roughly 50 50, and these cases would be anywhere from 30, 000, 50, 000 cases to a million dollar claims.\u003c/p\u003e\n\u003cp\u003eAnd we, my, my buddy who I was with in Vegas, he built call centers and massive sales teams with hundreds of people. So he knew how to do that.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: A DJ friend had done that?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: before he started DJing, that was what he did. he was running a business that did that, like hundreds of employees reporting to him, and then he wanted to be a DJ.\u003c/p\u003e\n\u003cp\u003eAnd now was his, chance to come back into the business world. And we decided, we said, okay, you’ll be the CEO. You have more experience. And I’m like, I don’t want to be CEO. Yeah. And I’m already CEO. And I’m like, not doing a very good job. You be the CEO. I’ll be the exec chairman. And. And I’ll make sure it gets funded.\u003c/p\u003e\n\u003cp\u003eSo I put in a few hundred grand of my own money. So we came up with the idea on Saturday afternoon at Encore Beach Club. And then by Monday we started running on the business. we did not want to wait because we knew that if we waited another week or two and just let it sit in the back of our heads.\u003c/p\u003e\n\u003cp\u003eWe would never do it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You know, this is one of the things that I loved about living in San Francisco. People who thought this way, most people would say, Okay, let’s see if we can get a couple of people signed up, a couple of customers, we’ll see if we can sign up a few lawyers. The thought of, alright, how do we get a whole call center put up, how do we go really big, is such an exciting part of that culture.\u003c/p\u003e\n\u003cp\u003ehow quickly did you do that? How quickly did you go to call center?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: We started hiring people by the end of that following week, we just posted on Craigslist, I think.\u003c/p\u003e\n\u003cp\u003eSo the call center, \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Just posted on Craigslist. We need people who are going to make phone calls to, to potential customers. That’s what it was.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: pretty much, that’s pretty much it. But we did the phone calls ourselves that week. And my buddy, Jordan, he was the sales rep and the customer service agent and the whole thing. So we could write out a script. And I still really believed in having the founders do that hard work up front and not trying to outsource or delegate that too early because you learn a lot in that process.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: And then once you had a script, you hired people and you said, go make calls like this, that’s the claimant, I guess, part of the. The plaintiff claimant part of the equation and then fining lawyers was how?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: exactly. So we found a lawyer just through our network and friends, and then we, we did a lot of, aggressive, marketing, just like how you see these billboards on the side of the highway saying got injured. I mean, we basically have doing that, um, our own way. then, yeah, we have who would, just validate and break down all the case \u003c/p\u003e\n\u003cp\u003enotes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Meaning you would buy ads and then people who called up the call center was inbound people who called up would get qualified by The people who you hired on Craigslist Anyone who is a good fit would then go on to talk to a lawyer. You would pay the lawyer and then Split the profits, you and the lawyer and the claimant.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: that is correct. Yes.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay, and now there’s a specific issue that you were battling that you told me about that you felt really strong that these people had to put up with. I think you don’t want me to talk about what that specific issue was, and to be honest with you, I don’t remember. But I remember it wasn’t like randomly fall down people who had, Hurt themselves on a bus type of thing.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: no, these are definitely more, aggressive things. I mean, there’s just so much bad stuff in the world, right? Whether you get hit by a car or you lose your house in, the Hawaii fire or you’ve been sexually harassed or whatever. you could just think of all these different ways that.\u003c/p\u003e\n\u003cp\u003epeople have a claim, but they’re too nervous to sue. And they haven’t done that before. those are the people we’re really trying to advocate for and help.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: What I mean is it personal injury lawyers? Like the type of things that we see on buses or no.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: we’ve looked at personal injury, but we don’t do personal injury. It’s just very, it’s too, competitive.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Okay. All right. You get this business up and running with a couple of hundred thousand that you put up, where does that money come from? Is this just you saving salary from Indonero or is it you selling some of your shares?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I sold some secondary, so I had a little bit of cash. That was quote unquote my life savings and I plowed a lot of that straight into this business \u003c/p\u003e\n\u003cp\u003ebecause YOLO, why not? and I was getting great metrics very quickly, like within the first few weeks, I thought, I went from thinking, okay, this could be a great lifestyle business just tothrow off enough cash to like pay for my lifestyle.\u003c/p\u003e\n\u003cp\u003eand then it snowballed from there and I realized, oh my God, I think this is going to be a home run. And it was just, it was 30 days from being like very upset and crying on my boyfriend’s shoulders to, wow, I’m going to make a lot more money. And it’s going to be way easier than what I did the first time around.\u003c/p\u003e\n\u003cp\u003eI mean, in an era, it was a long slog \u003c/p\u003e\n\u003cp\u003eand, Over 10 years that I was running in and out at that point.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: earning a salary and then \u003c/p\u003e\n\u003cp\u003ethese little shares that \u003c/p\u003e\n\u003cp\u003eyou sold right?\u003c/p\u003e\n\u003cp\u003eWhat was \u003c/p\u003e\n\u003cp\u003eyour \u003c/p\u003e\n\u003cp\u003esalary? Let’s be open. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Not even a good salary.for most of that period, I was paying myself for the first four years. I paid myself, what was it like 30, 000 a year. And then I gave myself a raise to 80, 000 a year for a few years. And then it went to 120, 000 a year. So I was making less money than pretty much all of my friends that I went to college with.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: You were making less than all your friends who are going to college living in San Francisco for much of it I had no idea that that’s where you were. Obviously, the 30, 000 is \u003c/p\u003e\n\u003cp\u003epainful, 100, 000, I’m sorry, yeah, 120, 000, most people wouldn’t call poor unless you live in San Francisco, and then you realize that’s really painful.\u003c/p\u003e\n\u003cp\u003eTo give you a sense of how tough it is to live in San Francisco for that, if you make less than 300, 000, the schools we were looking at would give you financial aid in San Francisco. But you were still flying everywhere. And so I thought Jessica has made it. She’s got all these bookkeepers in the Philippines.\u003c/p\u003e\n\u003cp\u003eShe’s on the cover of Ink Magazine. She’s got this business is doing well. was flying expensive. You were flying your own, not your own plane, but you were flying a plane on your own. That’s expensive to get to.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Yeah, I’ll tell you the trick. So I was taking flying lessons because I was at your house, Andrew, we were at a dinner party and one of you had this brilliant idea for us to all get our pilot licenses. And this was 2014. So I was paying myself 40, 000 now, I think. And I put every dollar I made.\u003c/p\u003e\n\u003cp\u003eStreet into flying lessons. I got so addicted. Every single dollar went to I had to space out my flying lessons to make sure I had enough money to pay for the bill that month, okay? And it took five months for me to get my license, and I spent 8, 000, 8, 500. math on that, like, spending, yeah, about 1, 500 month.\u003c/p\u003e\n\u003cp\u003eUm, which was \u003c/p\u003e\n\u003cp\u003eall my \u003c/p\u003e\n\u003cp\u003edisposable income. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That’s a good deal. I should say, I didn’t know that any of this was happening. It wasn’t that we all agreed at the dinner party to do this. It was your side of the table that talked about it, and the table was unfortunately so big, I didn’t even know any of this conversation happened until after you got your license.\u003c/p\u003e\n\u003cp\u003eOkay, talk to me about Travis. Supporter who believed in you when things were down, whose shoulder you could cry on. What happened?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Travis, he had a lot of, mental health issues. he served, as a U. S. Marine in Iraq. and he was a frontline combat guy, had seen a lot of. bad things out there and his mental health after my legal tech business started doing really well, he was on the rocks and on the decline and just having a lot of paranoia, a lot of, thinking people were out to kill him, basically.\u003c/p\u003e\n\u003cp\u003eAnd even if you go to the doctor’s office or to the hospital or whatever to try to get help, he would think that he couldn’t walk in because the people painting the wall of the VA are trying to murder him. Like, that’s how crazy this guy.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Why do you think this suddenly happened to him?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I think he was struggling with depression, which put him into substance abuse, and the substance abuse, brought this up and it became a vicious negative spiral. And so, eventually, I left for a week, I was on a trip, and while I was gone… he took his own life at home. I learned about it when I came back and his best friend said that he found Travis, dead at home and the police were there. It’s a crime scene, can’t come back. And. after that, I remember thinking in that moment, my life will probably never be the same again. And I didn’t know what to do. at that point, I was then, I didn’t have a home. I wasn’t going to go back there ever again. And, I only had what was in my suitcase and in my backpack. all my other belongings at home got, permanently destroyed during the process. Without going into too much detail. And, I, uh, couldn’t work again after that. I actually stopped working for the next six months.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: disconnected, stopped returning calls.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Everything. No email, no calls. Anyone who tried to get in touch with me, I just ignored. And I had my assistant replying to people, and she had a canned email. It’s explaining what happened and if they really need to talk to me, then they could call someone else in one of my companies and they would gladly deal with their situation and people were very respectful and that was a very difficult time.\u003c/p\u003e\n\u003cp\u003eThat was two and a half years ago.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Jordan, I’m assuming, was manning the, legal tech company who was taking care of Indonero.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I had my entire accept team rally and. Divide and Conquer, and I just had them give me a 30 minute update call once a week, just to tell me what was going on, and they were really great during that process.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: How did you spend your time in that period?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: during that time, I had a lot of friends helping me. I was bouncing around, sleeping on a bunch of sofas and spare bedrooms for friends. So I probably, I tried to stay at someone’s place for no more than two or three weeks, just so I wasn’t imposing on them. And I would wake up, meditate, read, talk to a grief counselor or therapist, explore cooking, take long walks, explore nature. And, it was such a surreal experience because I’d never lived like that before. I’ve always been stimulated on my phone, on my email, on Slack, back to back conference calls all day long. And. Here I was with nothing to do, nowhere to be, and the only priority was just to do something that would make me feel good that day,\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Like?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: like cook a meal for myself,\u003c/p\u003e\n\u003cp\u003eor go on a hike, or journal, or… I read so many books during that time. I reconnected with a sense of spirituality during that period. I… Spent a lot of time with friends who I didn’t have time to hang out with before that. so yeah, a lot of wholesome activities.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: How did you get out of it?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I, it was a very slow, it was a very slow process. It, I went away to visit a friend for New Year’s. And all my friends were telling me I should just take a year off and not go back to work. I had found a new CEO for Indonera to take over for me, someone who’s built companies with, much bigger than Indonera to take over.\u003c/p\u003e\n\u003cp\u003eSo I was now fully free. And so I thought about doing a sabbatical. So I put together this whole list of all the things I would do. If I took a year or two off for sabbatical, what would I do? And when I was flying back from Hawaii, back to LA, I’m on the plane, I’m journaling. And. I distinctly remember thinking, you know what? I gotta get back to work. That’s the next chapter in my healing. I need to get back into it. Partially to convince myself that I can do it again. Cause after Travis passing, I worried that I had a permanent disability. Kinda like if you have lose a limb.\u003c/p\u003e\n\u003cp\u003eThat’s kinda how I felt a bit. I wondered, did I lose my work mojo? Am I able to do that again? And I wanted to prove to myself that I could. And so I went back to work literally the next day. I started plotting out what my dream job would be, what I wanted to do, what would I do if I had no one to impress, if I didn’t care about making money, if I had no investors to appease.\u003c/p\u003e\n\u003cp\u003eWhat do I just want to do? Because I want to do it. And that’s what led me to thinking about what I’m doing now, which is Mahway\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: thinking, whatever I did at the legal business, I think I want to do again and again and again. I’m not going to commit myself to being a s Actually, what was your need list and what was your won’t do list?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: my want list was I won’t be a CEO again. I had such a big ego during the time I was running in and error thinking I need to be CEO. I need to prove to myself I can be CEO. and, I realized I just. He did the job. I didn’t want to do it anymore. And I love the energy of starting the legal FinTech platform.\u003c/p\u003e\n\u003cp\u003eAnd I love the early years of in and era and getting that going. And I just wanted to do that over and over and over and over again. And I had a whole list of dozens. Now the list is hundreds of business ideas that I wanted to build and. I dreamt in my head, what if I have a holding company of sorts that helps me make sure that Indonera and other companies don’t go off the side of the tracks, but they keep on doing well, and we start new companies, and my team of people Essentially helps me clone myself 10, 20 times over to support all my companies.\u003c/p\u003e\n\u003cp\u003eAnd I don’t want to be a startup studio. I don’t want to print 30 companies a year. I just want to pick a few a year that I’m passionate about, that I’m excited about, that can actually help people make a difference. And I also want to do things that were more outside of the box, like one company we’re doing. Actually, we have several bio companies, so I got into bio and, we’re looking at doing some deep tech stuff and some climate stuff. And it’s basically just whatever my interests are, where I think you could do good and create a big business. that’s what we’re going to do and, I wasn’t gonna do something to appease other people anymore.\u003c/p\u003e\n\u003cp\u003eAt that point I realized it was time for me to prioritize myself. Leaving this world put a lot of that in a perspective for me in a way that. Would have been really hard for me to do on my own.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Were you someone who tried to please other people?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Yeah. Like most people starting with trying to please my parents.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cspan\u003eJess\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e: What were your parents like?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Uh, pretty cool for the most part, but of course they wanted me to do well and they have their opinions on a bunch of things like they, like my mom never went to college, so she was always. Like making sure I was doing my homework and doing it well. And she’s very, she’s a very proper woman. but they were super, kind to me during this whole process with Travis, but at some point my mom said, okay, go see your therapist for a few months.\u003c/p\u003e\n\u003cp\u003eBut then you gotta get over it. you gotta get your head back into the game, Jess. And that was really tough love and tough for me to stomach at the time. I think a lot of people would have resented their mom for saying that, but I appreciated it because I needed that kick in the butt to get back in.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: So you’re someone who has a lot of business ideas. Where I’ve always been an entrepreneur who doesn’t, I I’m now seeing notes from a conversation that we had before. Uh, this is from April, 2022, where you said that you hired someone to do customer development. Customer development is where you try to understand what the customer wants, what their problems are, and then see if you could solve it, right?\u003c/p\u003e\n\u003cp\u003eThat aspect of. Actually, is that an aspect of how you figure out which business to go after? You’re giving me the smile like maybe I’ve just revealed something I shouldn’t or you revealed something that you shouldn’t. What’s behind that\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I’ve been thinking about this a lot, actually, how do you come up with, create ideas? Because there are seasons where you have more ideas and some seasons where you have nothing. And I still have, I had6 months this year where I was just running dry where I wondered if I’d ever have another good idea again.\u003c/p\u003e\n\u003cp\u003eAnd what I realized is that if I just identify a problem space. Like there are lots of problems in this general area. I don’t know exactly what the customer issue is, but I know there are problems here. Let’s go search there. Let’s go talk to all the experts and figure out what are the problems. And there’s a lot you could outsource.\u003c/p\u003e\n\u003cp\u003eAnd by outsource, having a team of people do those interviews and come up with the questions you want to ask them and you could read the notes and that gets you thinking, obviously as an entrepreneur, I want to be on those calls too. And I want to. Good exposure there, but it starts from identifying a problem space.\u003c/p\u003e\n\u003cp\u003eIt’s not like I’m just walking around and, Oh my God, I just came up with this brilliant business idea that doesn’t happen.\u003c/p\u003e\n\u003cp\u003eit’s always starts from the \u003c/p\u003e\n\u003cp\u003eproblem. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: give me specifics. we’ll get into some of the other businesses because I’ve left people with this idea that you’ve got a holding company without saying what it’s holding beyond giving one example. But first, Give me an example of either a company that you said we’re going to pursue or not based on this research.\u003c/p\u003e\n\u003cp\u003eWhere was the idea? What was the research that you did? What did it tell you? Et cetera.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I think one of my favorite businesses is this company called Eagle Corps. Eagle Corps. I came up with while snowboarding with a U S army veteran friend of mine. We were in Park City, I was still depressed from all this Travis stuff and I also cried on his shoulder that day. We’re getting lunch, just the two of us, and he told me we were not brainstorming business ideas.\u003c/p\u003e\n\u003cp\u003eJust to be clear, this is just a friendly, we’re having lunch and we’re hanging out conversation and I said, could you tell me a little bit about your story post? the army and tell me about how you ended up being a software engineer, something like that. And he told me how he went through a coding bootcamp and how the government sponsored his uh, course.\u003c/p\u003e\n\u003cp\u003eBut he was the only veteran in his course. Everyone else was a normal civilian. And I thought, wow, so you got lucky. Basically, your brother told you to take a coding bootcamp course because he works at Google, and that’s what inspired you to do this. Now you’re making way more money than all these other veterans.\u003c/p\u003e\n\u003cp\u003eSo all these other veterans, the problem is they can’t get a good job out of the military because they don’t have the right training. Even though the government’s willing to pay for it. And he said, yeah, that’s exactly right. And so, now we have this problem that I can’t get out of my head. I’m like, oh my god, like all these veterans who can’t transition out of the military, then turn to substance abuse, and they get depressed, and there’s a lot of suicide, and I’m thinking about Travis, thinking about how this friend got lucky, I connect all the dots, and the idea becomes, how do you create an educational platform that’s focused on veterans? And could we do it in a way that’s by veterans? So you helped me start this company and it’s for veterans and we’re not taking our normal civilians because veterans have very unique challenges. you have to really cater to them. And I have this amazing go to market capability that I built from the legal FinTech company.\u003c/p\u003e\n\u003cp\u003eWhy don’t we just replicate that and all the best practices I learned over to finding veterans. And then by the end of the day, we had a new business. So these things happen very quickly.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: so at the end of the day you have a new business, but do you then go to figure out whether it’s a viable business before investing in it? do you do customer\u003c/p\u003e\n\u003cp\u003edevelopment? \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I was pretty confident that this business would work out right away. but yeah, we started doing go to market testing to see if you could acquire, uh, customers cost effectively. And, and yeah, so we do all the testing. And we didn’t, I didn’t talk to other veterans, I’ll be honest. Cause I felt like I understood the veteran mindset very well.\u003c/p\u003e\n\u003cp\u003eBy that point, my dad’s us army veteran who served in Vietnam, obviously had Travis and a ton of military veteran friends. So I really understood the customer and their problem. So I was more focused on could we deliver the solution and can we acquire the customers? Those were the two biggest areas to de risk.\u003c/p\u003e\n\u003cp\u003eAnd so, and then there’s a regulatory area in this business to de risk. so my friend, Jared, did a lot of that. and then he quit his job like two months later and then we were off and running.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: you said that you were doing a go to market test to see, do you have that? To do risk this business? What is that? What did you do?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Oh, okay. So the de risking process is, doing online marketing essentially, and then having people fill out a form. And then you or your small team actually calling the customer back and trying to sell them as if you’re the sales rep. And obviously you don’t have a solution. You don’t have a product.\u003c/p\u003e\n\u003cp\u003eBut you try to see if they would buy. Like, look, here’s what I would do for you if you really wanted. and just basically making up a script on the fly, Andrew.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: before there’s any business?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: And then documenting what are the questions before there’s any business. This is like within,\u003c/p\u003e\n\u003cp\u003eone week we’re doing this.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: this is basically the Eric Riesling startup idea that I remember years ago, back when you were blogging, you blogged that you had an idea for Indonero, you put it up on the website without actually creating the businessor the product you look, I’m sensing that you don’t remember what I’m talking about, but I remember you talking about this once randomly.\u003c/p\u003e\n\u003cp\u003eAnd I get it. This is very basic stuff that you’re saying that you do. And then you have a team of people call up and say, will you buy it? See if there’s a script. I’m on the site right now, by the way, I put in my information. I’m not getting anything. There’s not even like a confirmation page. Is it up and running as a business now?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: It is, but it’s still kind of behind the scenes still. And, I guess it’s now we’re talking about it a little bit. but yeah, we are starting to operate now. and, and we’re getting it. And the company’s raised financing and yeah,has a seasoned CEO in the seat.\u003c/p\u003e\n\u003cp\u003eso \u003c/p\u003e\n\u003cp\u003eyeah,we are getting \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: It’s basically a coding school aimed at this market, right?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: we’re started coding, but there’s a lot of other technical skills that we’re planning to teach people. So you basically have, it’s like a buffet of like, all right, what technical skills do you want to learn? And then a job placement platform on the backend.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Take me to biotech. How do you get into biotech all of a sudden? And can you make it as clear as you just did the story for EagleCore?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I got on a bio because I’ve always been fascinated by bio. My dad worked at Sloan Kettering for 45 years. Sloan Kettering’s a world renowned cancer hospital in New York City. And I remember when I was, I think, 10 or 11 years old, I’d go visit my dad at work and I thought, okay, it’s cool. My dad’s an engineer at a cancer hospital, whatever.\u003c/p\u003e\n\u003cp\u003eAnd I see these kids my age with no hair. And they look really sick. And so I asked my dad, Hey, what’s going on? Like, why does this kid have no hair? And he said, they have no hair. Cause they got cancer and they’re being treated here and they can’t go to school. They can’t play with their friends. They’re stuck here because they’re sick.\u003c/p\u003e\n\u003cp\u003eAnd I just can never get that, that, that thought out of my head. And so I’ve always been fascinated with bio as a result. My dad would say things like,we’re spending billions of dollars here at Sloan Kettering on trying to cure cancer. By the time you’re an adult, we’re not going to need this anymore.\u003c/p\u003e\n\u003cp\u003eWe could probably shut the hospital down. I’ll be out of a job and, all will be fine in the world. He really believed that. And here we are. Fast forward. It’s been 20 plus years later and we’re nowhere close on our fight against cancer. And so I come across a scientist who. This guy, Mike Levin, I watch his TED talk online, I read his article in the New Yorker, he has a podcast interview with Lex Friedman, and he talks about things like normalizing cancer, using bioelectricity to take cancerous tumors, and instead of having to kill these cancer cells.\u003c/p\u003e\n\u003cp\u003ewhat you do with chemo or radiation or surgery, you’re just making them act as if they’re normal cells again. And I was just so mesmerized by that, I thought, wow, is this guy getting enough funding? Does he have the right talent around him to make this real or not? So I get in touch with him. And he doesn’t have anyone working with him on this cancer stuff or longevity stuff or on, a lot of people just thought of him as this futuristic sci fi scientist and they weren’t taking him as seriously as I was taking it.\u003c/p\u003e\n\u003cp\u003eAnd so that was the idea. can we build companies around this brilliant scientist and other brilliant scientists like him who have something amazing and the biotech community is very conservative, they’re not very forward looking, Andrew, it’s actually. pretty scary, and we’ll get into that another time.\u003c/p\u003e\n\u003cp\u003eAnd, so I brought in this biotech veteran, I run an executive search, I hire a headhunter, pay them, I don’t know, 150, 000, I say, Find me a biotech veteran who can work with this awesome scientist to make this stuff real. And I find this guy named Tom who’d taken a drug from lab all the way through FDA for 15, 000, 1.\u003c/p\u003e\n\u003cp\u003e5 million. For a full FDA approval, it’s a drug called Elsonerase. And so this guy’s saved, I don’t know, many thousands of lives through, treating this rare form of leukemia where the patient would otherwise die within six months of diagnosis. Now these patients are going into full remission and living normal lives because of this guy.\u003c/p\u003e\n\u003cp\u003eSo I think, perfect. I got a guy who could help. And, and so that, that’s how that company got going. And that company is called Astonishing Labs. And they’re spinning out other companies. It’s like a holding company of bio stuff inspired by Mike Levin. and that also came to me very quickly. it was like, I heard about it and then within two weeks, I was moving on it.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: That is incredibly, incredibly fast. And the goal here is, maybe this is tongue in cheek, but when I look at your LinkedIn profile, it says unicorn breeder. Is the goal to turn these into unicorns?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: I think that’s a by product of everything else we’re doing. Yeah. I want them to be unicorns, but the idea is could we actually. Like normalize cancer cells beyond just doing it, in a lab environment, can we actually help tens of better tens of thousands of veterans get better jobs? If we do that, then these companies will be very successful.\u003c/p\u003e\n\u003cp\u003eThey’ll make a lot of money. but the goal wasn’t. Necessarily it’s a, make money for the sake of making money. If I got tired of thinking about, doing another SaaS company or like a sales enablement tool, like that stuff just didn’t get me excited. These two examples I gave you, they’re concrete examples of businesses that can make a lot of money, but help a lot of people at the same time.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right, I’ll close out with this. Are you happy now? Because as I was looking on LinkedIn to get information about what you’re up to, I saw this post about how you’re working 60 hours a week, and there was some comment about here’s what my life is like. You don’t want to be me, right? Is this someone who’s achieved the goal that she strived for after that breakdown period?\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: That’s a long conversation. I’d say overall, I’m doing way better, way happier. but I still have the typical angst that,any other 33 year old would have, but yeah, I’m doing a lot better. I really do enjoy my work and my job now. And I just feel that there’s just so much more creating that I want to do.\u003c/p\u003e\n\u003cp\u003eAnd I want to see how these, ventures go. I really want to see some drugs. get a full approval and actually impact patients. And until I make more progress on what I just told you, I’m not going to be satisfied.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: All right. I love the name of the company because it’s so fitting with what you’ve told us. It’s called Mahway, your last name, of course, being M A H Ma. All right. I’d love to come back and see how this ended up, working out for you.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: Thank you so much. Yeah. the story is in a weird way, just beginning. I’m super excited about where this is going and, I’d love to continue this and hey, maybe we should do a part two sometime. I feel like we’re just getting this going.\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Anytime we got text messages and I would actually, when we are like old 120, 150 year old people, I would love to do an interview then and go back in time and talk about how this all played out in general, I will say this. I’m going to say thank you to Jessica, but also say that. Interviewing has been amazing.\u003c/p\u003e\n\u003cp\u003eIt’s let me connect with you, Jessica, as both a listener and a guest. And it’s let me do this now with guests over 2000 times. So many of my friends,Cody McLean, who I partnered up with on a podcast business is someone who I met because I interviewed him and then we got together in person.\u003c/p\u003e\n\u003cp\u003eAnd then I went to his house and so on for party. It has been amazing. If you’re out there and you’re thinking about doing a podcast and you need help, we meaning me and my team here at mixer G and now Cody too, who’s partnered up with me, we’ll be happy to help you think through how to do it. And if you need to hire us to produce your podcast, we’re available to contact me.\u003c/p\u003e\n\u003cp\u003eHere’s my personal email address. The same one that Jessica and I have been using. I guess you go by Jess now. Jess and I have been using for years since back when she was known as Jessica and I was known as Shuki. actually no, back then he, I was known as Andrew. Uh, it doesn’t go that far back. Not till elementary school.\u003c/p\u003e\n\u003cp\u003eHere’s the email address. All seriousness, personal connection with me. Let’s talk through your business and your podcast. Even if it’s not something you pursue with us, I want to help you get there. My email address is Andrew@mixergy.com. \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: hope \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eAndrew Warner\u003c/span\u003e\u003c/span\u003e: Bye \u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cspan\u003eJess Mah\u003c/span\u003e\u003c/span\u003e: see\u003c/p\u003e\n\t\t\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "42 min read",
  "publishedTime": null,
  "modifiedTime": "2023-11-10T19:31:28Z"
}
