{
  "id": "e2025775-bf33-466f-a44c-c53aede5e6b5",
  "title": "Stocks to Watch: TCS, Tata Elxsi, NBCC, Zydus Lifesciences, JSW Steel",
  "link": "https://www.business-standard.com/markets/news/stocks-to-watch-tcs-tata-elxsi-nbcc-zydus-lifesciences-jsw-steel-124101100062_1.html",
  "description": "Stock Market Today: TCS reported a net profit of Rs 11,909 crore for Q2FY25, up 5 per cent year-on-year but down 1.08 per cent sequentially.",
  "author": "",
  "published": "Fri, 11 Oct 2024 07:01:18 +0530",
  "source": "https://www.business-standard.com/rss/home_page_top_stories.rss",
  "categories": null,
  "byline": "Pranay Prakash",
  "length": 3479,
  "excerpt": "Stock Market Today: TCS reported a net profit of Rs 11,909 crore for Q2FY25, up 5 per cent year-on-year but down 1.08 per cent sequentially: stocks to watch",
  "siteName": "Business Standard",
  "favicon": "https://www.business-standard.com/android-chrome-192x192.png",
  "text": "Share Market Today: Tata Elxsi reported a 14.7 per cent year-on-year profit increase, at Rs 229 crore, driven by robust demand in its transportation division. (Image: Bloomberg)3 min read Last Updated : Oct 11 2024 | 7:01 AM IST Stocks to Watch, Friday, October 11, 2024: GIFT Nifty futures, trading at 25,090 around 6:50 AM, marginally below Nifty futures' last close, indicated a muted start for markets in India on Friday. Meanwhile, here are a few stocks likely to be in focus during today's trading session: Click here to connect with us on WhatsApp Tata Consultancy Services: TCS reported a net profit of Rs 11,909 crore for Q2FY25, up 5 per cent year-on-year but down 1.08 per cent sequentially. Revenue rose 7.6 per cent to Rs 64,259 crore, surpassing Bloomberg’s consensus estimate but missing net profit expectations. Total contract value (TCV) for new deals was $8.6 billion, a slight increase from Q1 but down 23 per cent year-on-year. The company faces cautious demand, particularly in North America and Europe, though domestic growth surged by 95.2 per cent. Tata Elxsi: The engineering and technology firm reported a 14.7 per cent year-on-year profit increase, at Rs 229 crore, driven by robust demand in its transportation division. Revenue grew 8.3 per cent to Rs 955 crore, slightly below estimates. The transportation unit, accounting for 55.7 per cent of software development revenue, saw significant growth due to new contracts. Ola Electric: The company is under scrutiny from the Ministry of Heavy Industries due to consumer complaints about delayed deliveries and defective products. The company is cooperating with an investigation by the Automotive Research Association of India (ARAI) and aims to clarify compliance timelines. Ola has launched a promotional sale offering substantial discounts on its scooters amidst these challenges. One97 Communications: Paytm’s share price has seen a recent uptick as it completes the migration of its payment handle and secures foreign direct investment clearance for its Payment Aggregator license. With stable market share in UPI and plans to diversify into other financial services, the company aims for positive Adjusted EBITDA by Q4 FY25.More From This Section NBCC: The company's subsidiary has secured a Rs 1,000 crore contract for developing Gondwana University’s campus in Maharashtra. Zydus Lifesciences: THe company has received US FDA's approval to produce its generic version of Paliperidone extended-release tablets for treating schizophrenia. JSW Steel: The company has partnered with BHP and Carbon Clean to accelerate carbon capture technology in steelmaking. This initiative aims to reduce emissions and aligns with global sustainability efforts undertaken by the company. Puravankara: Despite strong housing demand, Puravankara's sale bookings dropped 17 per cent year-on-year to Rs 1,331 crore in Q2FY25. The company plans to launch new projects worth over Rs 13,000 crore in the second half of the fiscal year. Vedanta: The company has linked its metal quality analysis system with the London Metal Exchange, becoming the first Indian smelter to do so. This initiative aims to enhance supply chain operations and meet global quality standards. Q2 earnings today: Just Dial, Hathway Cable, Reliance Industria Infrastructure and Plastiblends are among the nine companies reporting their Q2 results today. Also Read",
  "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-09/19/thumb/featurecrop/400X400/1726726567-7076.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ci\u003e\u003c/i\u003e\u003cimg src=\"https://bsmedia.business-standard.com/_media/bs/img/article/2024-09/19/full/1726726567-7076.jpg?im=FeatureCrop,size=(826,465)\" title=\"Indian markets\" alt=\"Indian markets\" width=\"826\" height=\"465\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eShare Market Today: Tata Elxsi reported a 14.7 per cent year-on-year profit increase, at Rs 229 crore, driven by robust demand in its transportation division. (Image: Bloomberg)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e3 min read  Last Updated : Oct 11 2024 | 7:01 AM IST\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv id=\"parent_top_div\"\u003e\n\t\u003cp\u003e\u003cstrong\u003eStocks to Watch, Friday, October 11, 2024:\u003c/strong\u003e GIFT Nifty futures, trading at 25,090 around 6:50 AM, marginally below Nifty futures\u0026#39; last close, indicated a muted start for markets in India on Friday.\u003c/p\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cem\u003eMeanwhile, here are a few stocks likely to be in focus during today\u0026#39;s trading session:\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e \u003ca href=\"https://www.whatsapp.com/channel/0029Va6cbsSDuMRmPCIgXS2t\" target=\"_blank\" rel=\"nofollow\"\u003eClick here to connect with us on WhatsApp\u003c/a\u003e\u003c/p\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eTata Consultancy Services: \u003c/strong\u003eTCS reported a net profit of Rs 11,909 crore for Q2FY25, up 5 per cent year-on-year but down 1.08 per cent sequentially. Revenue rose 7.6 per cent to Rs 64,259 crore, surpassing Bloomberg’s consensus estimate but missing net profit expectations. Total contract value (TCV) for new deals was $8.6 billion, a slight increase from Q1 but down 23 per cent year-on-year. The company faces cautious demand, particularly in North America and Europe, though domestic growth surged by 95.2 per cent.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eTata Elxsi: \u003c/strong\u003eThe engineering and technology firm reported a 14.7 per cent year-on-year profit increase, at Rs 229 crore, driven by robust demand in its transportation division. Revenue grew 8.3 per cent to Rs 955 crore, slightly below estimates. The transportation unit, accounting for 55.7 per cent of software development revenue, saw significant growth due to new contracts.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eOla Electric: \u003c/strong\u003eThe company is under scrutiny from the Ministry of Heavy Industries due to consumer complaints about delayed deliveries and defective products. The company is cooperating with an investigation by the Automotive Research Association of India (ARAI) and aims to clarify compliance timelines. Ola has launched a promotional sale offering substantial discounts on its scooters amidst these challenges.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eOne97 Communications: \u003c/strong\u003ePaytm’s share price has seen a recent uptick as it completes the migration of its payment handle and secures foreign direct investment clearance for its Payment Aggregator license. With stable market share in UPI and plans to diversify into other financial services, the company aims for positive Adjusted EBITDA by Q4 FY25.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eMore From This Section\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eNBCC: \u003c/strong\u003eThe company\u0026#39;s subsidiary has secured a Rs 1,000 crore contract for developing Gondwana University’s campus in Maharashtra.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eZydus Lifesciences: \u003c/strong\u003eTHe company has received US FDA\u0026#39;s approval to produce its generic version of Paliperidone extended-release tablets for treating schizophrenia.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eJSW Steel: \u003c/strong\u003eThe company has partnered with BHP and Carbon Clean to accelerate carbon capture technology in steelmaking. This initiative aims to reduce emissions and aligns with global sustainability efforts undertaken by the company.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003ePuravankara: \u003c/strong\u003eDespite strong housing demand, Puravankara\u0026#39;s sale bookings dropped 17 per cent year-on-year to Rs 1,331 crore in Q2FY25. The company plans to launch new projects worth over Rs 13,000 crore in the second half of the fiscal year.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eVedanta: \u003c/strong\u003eThe company has linked its metal quality analysis system with the London Metal Exchange, becoming the first Indian smelter to do so. This initiative aims to enhance supply chain operations and meet global quality standards.\u003c/p\u003e\u003c/div\u003e\n\t\u003cdiv\u003e\n\t\t\n\t\t\u003cp\u003e\u003cstrong\u003eQ2 earnings today: \u003c/strong\u003eJust Dial, Hathway Cable, Reliance Industria Infrastructure and Plastiblends are among the nine companies reporting their Q2 results today.\u003c/p\u003e\u003c/div\u003e\n\t\n\u003cdiv\u003e\u003cp\u003e\u003ch3\u003e\u003cspan\u003eAlso Read\u003c/span\u003e\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-11T06:56:18+05:30",
  "modifiedTime": null
}
