{
  "id": "e3f3c8ba-a10b-4516-8260-c3df50c8fb65",
  "title": "Biden pardons his family in final minutes in office",
  "link": "https://www.cnbc.com/2025/01/20/biden-pardons-family-members.html",
  "description": "President Joe Biden previously had pardoned his son Hunter Biden, who had been convicted in a criminal gun case and pleaded guilty in a tax case.",
  "author": "",
  "published": "Mon, 20 Jan 2025 19:16:57 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Kevin Breuninger",
  "length": 4005,
  "excerpt": "President Joe Biden previously had pardoned his son Hunter Biden, who had been convicted in a criminal gun case and pleaded guilty in a tax case.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "James Biden and Valerie Biden Owens arrive at the federal court for Hunter Biden's trial on criminal gun charges, in Wilmington, Delaware, U.S., June 10, 2024. Hannah Beier | ReutersPresident Joe Biden on Monday issued preemptive pardons for three of his siblings and two of their spouses, citing concerns that they will be targeted by \"baseless and politically motivated investigations.\"The White House announced the pardons just minutes before President-elect Donald Trump entered the Capitol Rotunda to be sworn in as the next commander in chief.Earlier Monday, Biden preemptively pardoned a number of other figures — including Dr. Anthony Fauci, Gen. Mark Milley and members of Congress who investigated the Jan. 6 Capitol riot — on similar grounds.Biden's final batch of pardons included his brother, James Biden; James' wife, Sara Jones Biden; his younger sister, Valerie Biden Owens; Owens' husband, John Owens; and his other brother, Francis Biden.\"The issuance of these pardons should not be mistaken as an acknowledgment that they engaged in any wrongdoing, nor should acceptance be misconstrued as an admission of guilt for any offense,\" Biden said in a statement.He also pardoned Gerald Lundergan, the former chairman of the Kentucky Democratic Party, and former South Carolina Councilman Ernest Cromartie. The departing president also commuted the life sentence of Leonard Peltier, who was convicted of killing two FBI agents in 1975.Biden in early December issued a pardon for his son Hunter Biden, reversing his prior insistence that would not do so.Hunter was convicted last year in a federal criminal gun trial, and he had pleaded guilty to charges in a separate federal case related to tax crimes.James Biden was interviewed last year by the House Oversight and Judiciary committees as part of their impeachment probe of Joe Biden.\"Jim and Sara Biden did not seek this pardon because they have never committed any crimes. But for the reasons the President described, they have accepted it,\" said Paul Fishman, an attorney for James and Sara Biden, in a statement.In Monday's press release, Biden said, \"My family has been subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me—the worst kind of partisan politics. Unfortunately, I have no reason to believe these attacks will end.\"\"I believe in the rule of law, and I am optimistic that the strength of our legal institutions will ultimately prevail over politics,\" he said.\"But baseless and politically motivated investigations wreak havoc on the lives, safety, and financial security of targeted individuals and their families. Even when individuals have done nothing wrong and will ultimately be exonerated, the mere fact of being investigated or prosecuted can irreparably damage their reputations and finances.\"\"That is why I am exercising my power under the Constitution to pardon James B. Biden, Sara Jones Biden, Valerie Biden Owens, John T. Owens, and Francis W. Biden,\" Biden said.Trump lashed out after Biden announced the pardons for Fauci, Milley and Jan. 6 committee figures, calling the move \"disgraceful.\"\"Many are guilty of MAJOR CRIMES! DJT,\" Trump told NBC News' Kristen Welker in a text message. Trump's White House press office did not immediately respond to CNBC's request for comment on Biden's subsequent pardons for his family members.While Biden's blanket grants of preemptive clemency break historic norms, it is common for presidents to issue pardons at the 11th hour. And there is precedent for a president pardoning a family member and someone related to a family member.President Bill Clinton had pardoned his half-brother Roger Clinton, who had been pleaded guilty to drug charges, on his last day in office.Trump pardoned Charles Kushner, the father of his son-in-law Jared Kushner, at the end of his first term.Charles Kushner pleaded guilty in 2004 to filing false tax returns, retaliating against a witness and making false statements to the Federal Election Commission.",
  "image": "https://image.cnbcfm.com/api/v1/image/107426403-17180236292024-06-10t124618z_648961052_rc2c88a4xxan_rtrmadp_0_usa-biden-hunter.jpeg?v=1718023653\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-107426403\" data-test=\"InlineImage\"\u003e\u003cp\u003eJames Biden and Valerie Biden Owens arrive at the federal court for Hunter Biden\u0026#39;s trial on criminal gun charges, in Wilmington, Delaware, U.S., June 10, 2024. \u003c/p\u003e\u003cp\u003eHannah Beier | Reuters\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePresident \u003ca href=\"https://www.cnbc.com/joe-biden/\"\u003eJoe Biden\u003c/a\u003e on Monday issued preemptive pardons for three of his siblings and two of their spouses, citing concerns that they will be targeted by \u0026#34;baseless and politically motivated investigations.\u0026#34;\u003c/p\u003e\u003cp\u003eThe \u003ca href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/\" target=\"_blank\"\u003eWhite House\u003c/a\u003e announced the pardons just minutes before President-elect \u003ca href=\"https://www.cnbc.com/donald-trump/\"\u003eDonald Trump\u003c/a\u003e entered the Capitol Rotunda to be \u003ca href=\"https://www.cnbc.com/2025/01/20/trump-inauguration-live-updates.html\"\u003esworn in as the next commander in chief\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eEarlier Monday, Biden \u003ca href=\"https://www.cnbc.com/2025/01/20/biden-pardons-fauci-milley-j6-committee.html\"\u003epreemptively pardoned\u003c/a\u003e a number of other figures — including \u003ca href=\"https://www.cnbc.com/2022/11/22/fauci-says-he-never-imagined-covid-would-kill-million-americans.html\"\u003eDr. Anthony Fauci\u003c/a\u003e, \u003ca href=\"https://www.nbcnews.com/nightly-news/gen-mark-milley-trump-china-threats-america-rcna118473\" target=\"_blank\"\u003eGen. Mark Milley\u003c/a\u003e and members of Congress who investigated the \u003ca href=\"https://www.cnbc.com/2022/12/22/trump-capitol-riot-jan-6-committee-issues-final-report.html\"\u003eJan. 6 Capitol riot\u003c/a\u003e — on similar grounds.\u003c/p\u003e\u003cp\u003eBiden\u0026#39;s final batch of pardons included his brother, James Biden; James\u0026#39; wife, Sara Jones Biden; his younger sister, Valerie Biden Owens; Owens\u0026#39; husband, John Owens; and his other brother, Francis Biden.\u003c/p\u003e\u003cp\u003e\u0026#34;The issuance of these pardons should not be mistaken as an acknowledgment that they engaged in any wrongdoing, nor should acceptance be misconstrued as an admission of guilt for any offense,\u0026#34; Biden said in a statement.\u003c/p\u003e\u003cp\u003eHe also pardoned Gerald Lundergan, the former chairman of the Kentucky Democratic Party, and former South Carolina Councilman Ernest Cromartie. The departing president also commuted the life sentence of Leonard Peltier, who was convicted of killing two FBI agents in 1975.\u003c/p\u003e\u003cp\u003eBiden in early December issued a pardon for his son \u003ca href=\"https://www.nbcnews.com/politics/joe-biden/joe-biden-issue-pardon-son-hunter-biden-rcna182369\" target=\"_blank\"\u003eHunter Biden\u003c/a\u003e, reversing his prior insistence that would not do so.\u003c/p\u003e\u003cp\u003eHunter was convicted last year in a federal criminal gun trial, and he had pleaded guilty to charges in a separate federal case related to tax crimes.\u003c/p\u003e\u003cp\u003eJames Biden was interviewed last year by the House Oversight and Judiciary committees as part of their impeachment probe of Joe Biden.\u003c/p\u003e\u003cp\u003e\u0026#34;Jim and Sara Biden did not seek this pardon because they have never committed any crimes. But for the reasons the President described, they have accepted it,\u0026#34; said Paul Fishman, an attorney for James and Sara Biden, in a statement.\u003c/p\u003e\u003cp\u003eIn Monday\u0026#39;s press release, Biden said, \u0026#34;My family has been subjected to unrelenting attacks and threats, motivated solely by a desire to hurt me—the worst kind of partisan politics. Unfortunately, I have no reason to believe these attacks will end.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I believe in the rule of law, and I am optimistic that the strength of our legal institutions will ultimately prevail over politics,\u0026#34; he said.\u003c/p\u003e\u003cp\u003e\u0026#34;But baseless and politically motivated investigations wreak havoc on the lives, safety, and financial security of targeted individuals and their families. Even when individuals have done nothing wrong and will ultimately be exonerated, the mere fact of being investigated or prosecuted can irreparably damage their reputations and finances.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;That is why I am exercising my power under the Constitution to pardon James B. Biden, Sara Jones Biden, Valerie Biden Owens, John T. Owens, and Francis W. Biden,\u0026#34; Biden said.\u003c/p\u003e\u003cp\u003eTrump lashed out after Biden announced the pardons for Fauci, Milley and Jan. 6 committee figures, calling the move \u0026#34;disgraceful.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;Many are guilty of MAJOR CRIMES! DJT,\u0026#34; Trump told NBC News\u0026#39; Kristen Welker in a text message. Trump\u0026#39;s White House press office did not immediately respond to CNBC\u0026#39;s request for comment on Biden\u0026#39;s subsequent pardons for his family members.\u003c/p\u003e\u003cp\u003eWhile Biden\u0026#39;s blanket grants of preemptive clemency break historic norms, it is common for presidents to issue pardons at the 11th hour. And there is precedent for a president pardoning a family member and someone related to a family member.\u003c/p\u003e\u003cp\u003ePresident Bill Clinton had pardoned his half-brother Roger Clinton, who had been pleaded guilty to drug charges, on his last day in office.\u003c/p\u003e\u003cp\u003eTrump pardoned Charles Kushner, the father of his son-in-law Jared Kushner, at the end of his first term.\u003c/p\u003e\u003cp\u003eCharles Kushner pleaded guilty in 2004 to filing false tax returns, retaliating against a witness and making false statements to the Federal Election Commission.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-01-20T16:43:37Z",
  "modifiedTime": "2025-01-20T19:16:57Z"
}
