{
  "id": "ed357824-af3f-4d76-afc3-a0f97830bcdb",
  "title": "Jio Financial Q2 Results: Cons PAT rises 3% YoY to Rs 689 crore, revenue jumps 14%",
  "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q2-results-cons-pat-rises-3-yoy-to-rs-689-crore-revenue-jumps-14/articleshow/114352681.cms",
  "description": "Jio Financial Q2 Results: The company reported quarterly revenue of Rs 693.50 crore, a 14% increase from Rs 608.04 crore in the same quarter last year. Sequentially, PAT surged 120% compared to Rs 312.63 crore in Q1FY25, while revenue rose 66% from Rs 417.82 crore in the April-June quarter.",
  "author": "",
  "published": "Fri, 18 Oct 2024 18:14:15 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "",
  "length": 2103,
  "excerpt": "Jio Financial Q2 Results: The company reported quarterly revenue of Rs 693.50 crore, a 14% increase from Rs 608.04 crore in the same quarter last year. Sequentially, PAT surged 120% compared to Rs 312.63 crore in Q1FY25, while revenue rose 66% from Rs 417.82 crore in the April-June quarter.",
  "siteName": "The Economic Times",
  "favicon": "",
  "text": "Jio Financial Services on Friday reported a 3% uptick in its net profit to Rs 689 crore for the quarter ended September 2024, versus Rs 668 crore logged in the year-ago period. Tired of too many ads? Remove AdsRevenue from operations in the reported quarter stood at Rs 693.50 crore, up 14% over Rs 608.04 crore posted by the company in the corresponding quarter of the previous financial year.On a sequential basis, PAT jumped 120% versus Rs 312.63 crore reported by the company in Q1FY25. Meanwhile, the revenue jumped 66% over Rs 417.82 crore reported in the April-June quarter.Interest income rose to Rs 205 crore versus Rs 186 crore in Q2FY24 and Rs 162 crore in Q1FY25.The company's net worth as of September 30, 2024, stood at Rs 1,37,144 crore while its assets under management (AUM) was reported at Rs 1,206 crore.Tired of too many ads? Remove AdsJFSL increased its stake in Jio Payments Bank to 82.17% in August 2024. There were 15 lakh CASA customers and it expanded business correspondents network to 3,000. The expansion will continue, the company filing to the exchanges said.The pre-provisioning operating profit or PPoP in the reported quarter stood at Rs 552 crore, which was up by 2.7% versus Rs 537 crore in Q2FY24 and 63% over Rs 339 crore in Q1FY25.Jio Insurance BrokingThe company has direct-to-customer product portfolio of 24 plans across four product categories viz. auto, two-wheeler, health and life. Its institutional product suite includes Group Term Life, Group Medical Cover, Group Personal Accident and Commercial Insurance.On a standalone basis, PAT in the July-September quarter stood at Rs 305 versus Rs 89 crore in Q2FY24, which is a 242% rise. On a sequential basis, the PAT surged by over 323% from Rs 72 crore reported in Q1FY25.Meanwhile, total standalone income stood at Rs 383 crore up from Rs 149 crore in Q2FY24 and Rs 134 crore in Q1FY25, recording a 157% YoY and 186% QoQ jump.The earnings were announced after market hours and Jio Financial Services shares on Friday ended at Rs 330.55 on the NSE, gaining by Rs 1.30 or 0.39% over Thursday’s closing price.",
  "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-121589,resizemode-75,msid-114352681/markets/stocks/earnings/jio-financial-q2-results-cons-pat-rises-3-yoy-to-rs-689-crore-revenue-jumps-14.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"articlebody_114352681\"\u003e\u003cp\u003eJio Financial Services on Friday reported a 3% uptick in its net profit to Rs 689 crore for the quarter ended September 2024, versus Rs 668 crore logged in the year-ago period. \u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eRevenue from operations in the reported quarter stood at Rs 693.50 crore, up 14% over Rs 608.04 crore posted by the company in the corresponding quarter of the previous financial year.\u003c/p\u003e\u003cp\u003eOn a sequential basis, PAT jumped 120% versus Rs 312.63 crore reported by the company in Q1FY25. Meanwhile, the revenue jumped 66% over Rs 417.82 crore reported in the April-June quarter.\u003c/p\u003e\u003cp\u003eInterest income rose to Rs 205 crore versus Rs 186 crore in Q2FY24 and Rs 162 crore in Q1FY25.\u003c/p\u003e\u003cp\u003eThe company\u0026#39;s net worth as of September 30, 2024, stood at Rs 1,37,144 crore while its assets under management (AUM) was reported at Rs 1,206 crore.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eJFSL increased its stake in Jio Payments Bank to 82.17% in August 2024. There were 15 lakh CASA customers and it expanded business correspondents network to 3,000. The expansion will continue, the company filing to the exchanges said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg width=\"90%\" src=\"https://img.etimg.com/photo/113427908.cms\" alt=\"Growfast logo\" loading=\"lazy\" decoding=\"async\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eThe pre-provisioning operating profit or PPoP in the reported quarter stood at Rs 552 crore, which was up by 2.7% versus Rs 537 crore in Q2FY24 and 63% over Rs 339 crore in Q1FY25.\u003c/p\u003e\u003ch2\u003eJio Insurance Broking\u003c/h2\u003e\u003cp\u003eThe company has direct-to-customer product portfolio of 24 plans across four product categories viz. auto, two-wheeler, health and life. Its institutional product suite includes Group Term Life, Group Medical Cover, Group Personal Accident and Commercial Insurance.\u003c/p\u003e\u003cp\u003eOn a standalone basis, PAT in the July-September quarter stood at Rs 305 versus Rs 89 crore in Q2FY24, which is a 242% rise. On a sequential basis, the PAT surged by over 323% from Rs 72 crore reported in Q1FY25.\u003c/p\u003e\u003cp\u003eMeanwhile, total standalone income stood at Rs 383 crore up from Rs 149 crore in Q2FY24 and Rs 134 crore in Q1FY25, recording a 157% YoY and 186% QoQ jump.\u003c/p\u003e\u003cp\u003eThe earnings were announced after market hours and Jio Financial Services shares on Friday ended at Rs 330.55 on the NSE, gaining by Rs 1.30 or 0.39% over Thursday’s closing price.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
