{
  "id": "f003199b-74a2-43d5-aabb-e820094a30ee",
  "title": "Saba capital management buys $791,530 in Pioneer municipal fund stock",
  "link": "https://www.investing.com/news/insider-trading-news/saba-capital-management-buys-791530-in-pioneer-municipal-fund-stock-93CH-3783529",
  "description": "",
  "author": "Investing.com",
  "published": "2024-12-20 00:44:33",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Investing.com",
  "length": 1194,
  "excerpt": "Saba capital management buys $791,530 in Pioneer municipal fund stock",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "NEW YORK—Saba Capital Management, L.P., led by Boaz Weinstein, has acquired additional shares in Pioneer Municipal High Income Advantage Fund, Inc. (NYSE:MAV), according to a recent SEC filing. The firm purchased a total of 91,638 shares over two days, December 17 and 18, with a total value of $791,530. The shares were acquired at prices ranging from $8.60 to $8.66 per share. The fund, currently trading at $8.50, has demonstrated strong performance with a 10.89% year-to-date return and maintains a healthy 4.59% dividend yield, according to InvestingPro data. As a result of these transactions, Saba Capital Management's total ownership in the fund increased to 3,577,390 shares. The purchases underscore the firm's continued interest in the fund, which focuses on high-income municipal securities and has maintained dividend payments for 22 consecutive years. The transactions were executed indirectly, as noted in the filing. InvestingPro analysis reveals the fund's strong financial position with a market capitalization of $203.51 million and an attractive P/E ratio of 5.1. This article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026C.",
  "image": "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e\u003cp\u003eNEW YORK—Saba Capital Management, L.P., led by Boaz Weinstein, has acquired additional shares in Pioneer Municipal High Income Advantage Fund, Inc. (NYSE:MAV), according to a recent SEC filing. The firm purchased a total of 91,638 shares over two days, December 17 and 18, with a total value of $791,530. The shares were acquired at prices ranging from $8.60 to $8.66 per share. The fund, currently trading at $8.50, has demonstrated strong performance with a 10.89% year-to-date return and maintains a healthy 4.59% dividend yield, according to \u003ca href=\"https://www.investing.com/pro/MAV\"\u003eInvestingPro\u003c/a\u003e data.\u003c/p\u003e\n\u003cp\u003eAs a result of these transactions, Saba Capital Management\u0026#39;s total ownership in the fund increased to 3,577,390 shares. The purchases underscore the firm\u0026#39;s continued interest in the fund, which focuses on high-income municipal securities and has maintained dividend payments for 22 consecutive years. The transactions were executed indirectly, as noted in the filing. \u003ca href=\"https://www.investing.com/pro/MAV\"\u003eInvestingPro\u003c/a\u003e analysis reveals the fund\u0026#39;s strong financial position with a market capitalization of $203.51 million and an attractive P/E ratio of 5.1.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis article was generated with the support of AI and reviewed by an editor. For more information see our T\u0026amp;C.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-20T00:44:33Z",
  "modifiedTime": null
}
