{
  "id": "f2be0611-8019-48a8-8662-7fad3f6d57a1",
  "title": "At 20 years old, Reddit is defending its data and fighting AI with AI",
  "link": "https://www.cnbc.com/2025/06/28/reddit-20-fighting-ai-defending-data.html",
  "description": "After two decades, Reddit faces the emergence of AI chatbots that threaten to inhale its vast swaths of data and siphon its users.",
  "author": "",
  "published": "Sat, 28 Jun 2025 12:00:01 GMT",
  "source": "https://www.cnbc.com/id/100003114/device/rss/rss.html",
  "categories": null,
  "byline": "Jonathan Vanian",
  "length": 6768,
  "excerpt": "After two decades, Reddit faces the emergence of AI chatbots that threaten to inhale its vast swaths of data and siphon its users.",
  "siteName": "CNBC",
  "favicon": "",
  "text": "Reddit CEO Steve Huffman stands on the floor of the New York Stock Exchange (NYSE) after ringing a bell on the floor setting the share price at $47 in its initial public offering (IPO) on March 21, 2024 in New York City.Spencer Platt | Getty Images News | Getty ImagesFor 20 years, Reddit has pitched itself as \"the front page of the internet.\" AI threatens to change that.As social media has changed over the past two decades with the shift to mobile and the more recent focus on short-form video, peers like MySpace, Digg and Flickr have faded into oblivion. Reddit, meanwhile, has refused to die, chugging along and gaining an audience of over 108 million daily users who congregate in more than 100,000 subreddit communities. There, Reddit users keep it old school and leave simple text comments to one another about their favorite hobbies, pastimes and interests.Those user-generated text comments are a treasure trove that, in the age of artificial intelligence, Reddit is fighting to defend.The emergence of AI chatbots like OpenAI's ChatGPT, Anthropic's Claude and Google's Gemini threaten to inhale vast swaths of data from services like Reddit. As more people turn to chatbots for information they previously went to websites for, Reddit faces a gargantuan challenge gaining new users, particularly if Google's search floodgates dry up.CEO Steve Huffman explained Reddit's situation to analysts in May, saying that challenges like the one AI poses can also create opportunities.While the \"search ecosystem is under heavy construction,\" Huffman said he's betting that the voices of Reddit's users will help it stand out amid the \"annotated sterile answers from AI.\"Huffman doubled down on that notion last week, saying on a podcast that the reality is AI is still in its infancy.\"There will always be a need, a desire for people to talk to people about stuff,\" Huffman said. \"That is where we are going to be focused.\"Huffman may be correct about Reddit's loyal user base, but in the age of AI, many users simply \"go the easiest possible way,\" said Ann Smarty, a marketing and reputation management consultant who helps brands monitor consumer perception on Reddit. And there may be no simpler way of finding answers on the internet than simply asking ChatGPT a question, Smarty said.\"People do not want to click,\" she said. \"They just want those quick answers.\"Protecting Reddit's data from AIIn a sign that the company believes so deeply in the value of its data, Reddit sued Anthropic earlier this month, alleging that the AI startup \"engaged in unlawful and unfair business acts\" by scraping subreddits for information to improve its large language models.While book authors have taken companies like Meta and Anthropic to court alleging that their AI models break copyright law and have suffered recent losses, Reddit is basing its lawsuit on the argument of unfair business practices. Reddit's case appears to center on Anthropic's \"commercial exploitation of the data which they don't own,\" said Randy McCarthy, head of the IP law group at Hall Estill.Reddit is defending its platform of user-generated content, said Jason Bloom, IP litigation chair at the law firm Haynes Boone.The social media company's repository of \"detailed and informative discussions\" are particularly useful for \"training an AI bot or an AI platform,\" Bloom said. As many AI researchers have noted, Reddit's large volume of moderated conversations can help make AI chatbots produce more natural-sounding responses to questions covering countless topics than say a university textbook.Although Reddit has AI-related data-licensing agreements with OpenAI and Google, the company alleged in its lawsuit that Anthropic has been covertly siphoning its data without obtaining permission. Reddit alleges that Anthropic's data-hoovering actions are \"interfering with Reddit's contractual relationships with Reddit's users,\" the legal filing said.This lack of clarity regarding what is permitted when it comes to the use of data scraping for AI is what Reddit's case and other similar lawsuits are all about, legal and AI experts said.\"Commercial use requires commercial terms,\" Huffman said on The Best One Yet podcast. \"When you use something — content or data or some resource — in business, you pay for it.\"Avishek Das | SOPA Images | Lightrocket | Getty ImagesAnthropic disagrees \"with Reddit's claims and will defend ourselves vigorously,\" a company spokesperson told CNBC.Reddit's decision to sue over claims of unfair business practices instead of copyright infringement underscores the differences between traditional publishers and platforms like Reddit that host user-generated content, McCarthy said.Bloom said that Reddit could have a valid case against Anthropic because social media platforms have many different revenue streams. One such revenue stream is selling access to their data, Bloom said.That \"enables them to sell and license that data for legitimate uses while still protecting their consumers privacy and whatnot,\" Bloom said.Fighting AI with AIReddit isn't just fending off AI. It launched its own Reddit Answers AI service in December, using technology from OpenAI and Google.Unlike general-purpose chatbots that summarize others' web pages, the Reddit Answers chatbot generates responses based purely on the social media service, and it redirects people to the source conversations so they can see the specific user comments. A Reddit spokesperson said that over 1 million people are using Reddit Answers each week.Huffman has been pitching Reddit Answers as a best-of-both worlds tool, gluing together the simplicity of AI chatbots with Reddit's corpus of commentary. He used the feature after seeing electronic music group Justice play recently in San Francisco.\"I was like, how long is this set? And Reddit could tell me it's 90 minutes 'cause somebody had already asked that question on Reddit,\" Huffman said on the podcast.Though investors are concerned about AI negatively impacting Reddit's user growth, Seaport Senior Internet Analyst Aaron Kessler said he agrees with Huffman's sentiment that the site's original content gives it staying power.People who visit Reddit often search for information about things or places they may be interested in, like tennis rackets or ski resorts, Kessler said. This user data indicates \"commercial intent,\" which means advertisers are increasingly considering Reddit as a place to run online ads, he said.\"You can tell by which page you're on within Reddit what the consumer is interested in,\" Kessler said. \"You could probably even argue there's stronger signals on Reddit versus a Facebook or Instagram, where people may just be browsing videos.\"WATCH: Reddit sues Anthropic alleging wrongful use of content.",
  "image": "https://image.cnbcfm.com/api/v1/image/108030051-1725569740850-gettyimages-2102320889-reddit394581_etwtyicj.jpeg?v=1750807178\u0026w=1920\u0026h=1080",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"RegularArticle-ArticleBody-5\" data-module=\"ArticleBody\" data-test=\"articleBody-2\" data-analytics=\"RegularArticle-articleBody-5-2\"\u003e\u003cdiv id=\"ArticleBody-InlineImage-108030051\" data-test=\"InlineImage\"\u003e\u003cp\u003eReddit CEO Steve Huffman stands on the floor of the New York Stock Exchange (NYSE) after ringing a bell on the floor setting the share price at $47 in its initial public offering (IPO) on March 21, 2024 in New York City.\u003c/p\u003e\u003cp\u003eSpencer Platt | Getty Images News | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFor 20 years, \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-1\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/RDDT/\"\u003eReddit\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e has pitched itself as \u0026#34;the front page of the internet.\u0026#34; AI threatens to change that.\u003c/p\u003e\u003cp\u003eAs social media has changed over the past two decades with the shift to mobile and the more recent focus on short-form video, peers like MySpace, Digg and Flickr have faded into oblivion. Reddit, meanwhile, has refused to die, chugging along and gaining an audience of over 108 million daily users who congregate in more than 100,000 subreddit communities. There, Reddit users keep it old school and leave simple text comments to one another about their favorite hobbies, pastimes and interests.\u003c/p\u003e\u003cp\u003eThose user-generated text comments are a treasure trove that, in the age of artificial intelligence, Reddit is fighting to defend.\u003c/p\u003e\u003cp\u003eThe emergence of AI chatbots like \u003ca href=\"https://www.cnbc.com/2025/06/10/openai-cnbc-disruptor-50.html\"\u003eOpenAI\u0026#39;s\u003c/a\u003e ChatGPT, Anthropic\u0026#39;s Claude and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-3\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eGoogle\u0026#39;s\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e Gemini threaten to inhale vast swaths of data from services like Reddit. As more people turn to chatbots for information they previously went to websites for, Reddit faces a gargantuan challenge gaining new users, particularly if Google\u0026#39;s \u003ca href=\"https://www.cnbc.com/2024/08/14/reddits-increased-reliance-on-google-traffic-has-wall-street-anxious.html\"\u003esearch floodgates dry up\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eCEO Steve Huffman \u003ca href=\"https://www.cnbc.com/2025/05/01/reddit-rddt-q1-2025.html\"\u003eexplained\u003c/a\u003e Reddit\u0026#39;s situation to analysts in May, saying that challenges like the one AI poses can also create opportunities.\u003c/p\u003e\u003cp\u003eWhile the \u0026#34;search ecosystem is under heavy construction,\u0026#34; Huffman said he\u0026#39;s betting that the voices of Reddit\u0026#39;s users will help it stand out amid the \u0026#34;annotated sterile answers from AI.\u0026#34;\u003c/p\u003e\u003cp\u003eHuffman doubled down on that notion last week, saying on a \u003ca href=\"https://app.podscribe.com/episode/134960621?transcriptVersionReqId=d4db1976-a977-467e-be12-03b8ff0c0962\" target=\"_blank\"\u003epodcast\u003c/a\u003e that the reality is AI is still in its infancy.\u003c/p\u003e\u003cp\u003e\u0026#34;There will always be a need, a desire for people to talk to people about stuff,\u0026#34; Huffman said. \u0026#34;That is where we are going to be focused.\u0026#34;\u003c/p\u003e\u003cp\u003eHuffman may be correct about Reddit\u0026#39;s loyal user base, but in the age of AI, many users simply \u0026#34;go the easiest possible way,\u0026#34; said Ann Smarty, a marketing and reputation management consultant who helps brands monitor consumer perception\u003cstrong\u003e \u003c/strong\u003eon Reddit. And there may be no simpler way of finding answers on the internet than simply asking ChatGPT a question, Smarty said.\u003c/p\u003e\u003cp\u003e\u0026#34;People do not want to click,\u0026#34; she said. \u0026#34;They just want those quick answers.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline0\"\u003e\u003c/a\u003eProtecting Reddit\u0026#39;s data from AI\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eIn a sign that the company believes so deeply in the value of its data, Reddit \u003ca href=\"https://www.cnbc.com/2025/06/04/reddit-anthropic-lawsuit-ai.html\"\u003esued\u003c/a\u003e Anthropic earlier this month, alleging that the AI startup \u0026#34;engaged in unlawful and unfair business acts\u0026#34; by scraping subreddits for information to improve its large language models.\u003c/p\u003e\u003cp\u003eWhile book authors have taken companies like \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-8\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/META/\"\u003eMeta\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e and \u003ca href=\"https://www.cnbc.com/2025/06/24/ai-training-books-anthropic.html\"\u003eAnthropic\u003c/a\u003e to court alleging that their AI models break copyright law \u003ca href=\"https://www.cnbc.com/2025/06/25/meta-llama-ai-copyright-ruling.html\"\u003eand have suffered recent losses\u003c/a\u003e, Reddit is basing its lawsuit on the argument of unfair business practices. Reddit\u0026#39;s case appears to center on Anthropic\u0026#39;s \u0026#34;commercial exploitation of the data which they don\u0026#39;t own,\u0026#34; said Randy McCarthy, head of the IP law group at Hall Estill.\u003c/p\u003e\u003cp\u003eReddit is defending its platform of user-generated content, said Jason Bloom, IP litigation chair at the law firm Haynes Boone.\u003c/p\u003e\u003cp\u003eThe social media company\u0026#39;s repository of \u0026#34;detailed and informative discussions\u0026#34; are particularly useful for \u0026#34;training an AI bot or an AI platform,\u0026#34; Bloom said. As many AI researchers have noted, Reddit\u0026#39;s large volume of moderated conversations can help make AI chatbots produce more natural-sounding responses to questions covering countless topics than say a university textbook.\u003c/p\u003e\u003cp\u003eAlthough Reddit has AI-related \u003ca href=\"https://www.cnbc.com/2024/03/15/ftc-investigating-reddit-over-ai-data-licensing-practices-ahead-of-ipo.html\"\u003edata-licensing agreements\u003c/a\u003e with OpenAI and Google, the company alleged in its lawsuit that Anthropic has been covertly siphoning its data without obtaining permission. Reddit alleges that Anthropic\u0026#39;s data-hoovering actions are \u0026#34;interfering with Reddit\u0026#39;s contractual relationships with Reddit\u0026#39;s users,\u0026#34; the legal filing said.\u003c/p\u003e\u003cp\u003eThis lack of clarity regarding what is permitted when it comes to the use of data scraping for AI is what Reddit\u0026#39;s case and other similar lawsuits are all about, legal and AI experts said.\u003c/p\u003e\u003cp\u003e\u0026#34;Commercial use requires commercial terms,\u0026#34; Huffman said on The Best One Yet podcast. \u0026#34;When you use something — content or data or some resource — in business, you pay for it.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"ArticleBody-InlineImage-108165450\" data-test=\"InlineImage\"\u003e\u003cp\u003eAvishek Das | SOPA Images | Lightrocket | Getty Images\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAnthropic disagrees \u0026#34;with Reddit\u0026#39;s claims and will defend ourselves vigorously,\u0026#34; a company spokesperson told CNBC.\u003c/p\u003e\u003cp\u003eReddit\u0026#39;s decision to sue over claims of unfair business practices instead of copyright infringement underscores the differences between traditional publishers and platforms like Reddit that host user-generated content, McCarthy said.\u003c/p\u003e\u003cp\u003eBloom said that Reddit could have a valid case against Anthropic because social media platforms have many different revenue streams. One such revenue stream is selling access to their data, Bloom said.\u003c/p\u003e\u003cp\u003eThat \u0026#34;enables them to sell and license that data for legitimate uses while still protecting their consumers privacy and whatnot,\u0026#34; Bloom said.\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003ca id=\"headline1\"\u003e\u003c/a\u003eFighting AI with AI\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eReddit isn\u0026#39;t just fending off AI. It launched its own \u003ca href=\"https://www.cnbc.com/2024/12/09/reddit-begins-testing-ai-powered-answers-feature-to-win-users.html\"\u003eReddit Answers AI service\u003c/a\u003e in December, using technology from OpenAI and \u003cspan data-test=\"QuoteInBody\" id=\"RegularArticle-QuoteInBody-13\"\u003e\u003ca href=\"https://www.cnbc.com/quotes/GOOGL/\"\u003eGoogle\u003c/a\u003e\u003cspan\u003e\u003cspan id=\"-WatchlistDropdown\" data-analytics-id=\"-WatchlistDropdown\"\u003e\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e.\u003c/p\u003e\u003cp\u003eUnlike general-purpose chatbots that summarize others\u0026#39; web pages, the Reddit Answers chatbot generates responses based purely on the social media service, and it redirects people to the source conversations so they can see the specific user comments. A Reddit spokesperson said that over 1 million people are using Reddit Answers each week.\u003c/p\u003e\u003cp\u003eHuffman has been pitching Reddit Answers as a best-of-both worlds tool, gluing together the simplicity of AI chatbots with Reddit\u0026#39;s corpus of commentary. He used the feature after seeing electronic music group Justice play recently in San Francisco.\u003c/p\u003e\u003cp\u003e\u0026#34;I was like, how long is this set? And Reddit could tell me it\u0026#39;s 90 minutes \u0026#39;cause somebody had already asked that question on Reddit,\u0026#34; Huffman said on the podcast.\u003c/p\u003e\u003cp\u003eThough investors are concerned about AI negatively impacting Reddit\u0026#39;s user growth, Seaport Senior Internet Analyst Aaron Kessler said he agrees with Huffman\u0026#39;s sentiment that the site\u0026#39;s original content gives it staying power.\u003c/p\u003e\u003cp\u003ePeople who visit Reddit often search for information about things or places they may be interested in, like tennis rackets or ski resorts, Kessler said. This user data indicates \u0026#34;commercial intent,\u0026#34; which means advertisers are increasingly considering Reddit as a place to run online ads, he said.\u003c/p\u003e\u003cp\u003e\u0026#34;You can tell by which page you\u0026#39;re on within Reddit what the consumer is interested in,\u0026#34; Kessler said. \u0026#34;You could probably even argue there\u0026#39;s stronger signals on Reddit versus a Facebook or Instagram, where people may just be browsing videos.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWATCH\u003c/strong\u003e: \u003ca href=\"https://www.cnbc.com/video/2025/06/04/reddit-sues-anthropic-alleging-wrongful-use-of-content.html\"\u003eReddit sues Anthropic alleging wrongful use of content\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"Placeholder-ArticleBody-Video-108154681\" data-test=\"VideoPlaceHolder\" role=\"region\" tabindex=\"0\" data-vilynx-id=\"7000378353\" aria-labelledby=\"Placeholder-ArticleBody-Video-108154681\"\u003e\u003cp\u003e\u003cimg src=\"https://image.cnbcfm.com/api/v1/image/108154682-17490592001749059197-40117578826-1080pnbcnews.jpg?v=1749059199\u0026amp;w=750\u0026amp;h=422\u0026amp;vtcrop=y\" alt=\"Reddit sues Anthropic alleging wrongful use of content\"/\u003e\u003cspan\u003e\u003c/span\u003e\u003cspan\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-28T12:00:01Z",
  "modifiedTime": "2025-06-28T12:00:01Z"
}
