{
  "id": "f4560119-f199-4727-970d-386b84059984",
  "title": "Israeli strikes kill 22 in Beirut as Hezoballah leader evades assassination",
  "link": "https://www.investing.com/news/world-news/israeli-strikes-kill-22-in-beirut-as-hezoballah-leader-evades-assassination-3659014",
  "description": "",
  "author": "Reuters",
  "published": "2024-10-11 03:11:49",
  "source": "https://www.investing.com/rss/news.rss",
  "categories": null,
  "byline": "Reuters",
  "length": 5212,
  "excerpt": "Israeli strikes kill 22 in Beirut as Hezoballah leader evades assassination",
  "siteName": "Investing.com",
  "favicon": "",
  "text": "By Maya Gebeily and Alexander Cornwell BEIRUT/JERUSALEM (Reuters) - Israeli strikes killed 22 people and injured more than 100 in central Beirut on Thursday, Lebanese authorities said, as a senior Hezbollah official evaded an Israeli assassination attempt in the city, according to three security sources. In the country's south, two United Nations peacekeepers were injured when an Israeli tank fired at a watchtower at the force's main headquarters in Ras al-Naqoura, prompting the U.N. to say its personnel were facing increasing danger. The conflict between Israel and Hezbollah erupted one year ago when the Iranian-backed group opened fire in support of Palestinian militant group Hamas at the start of the Gaza war. It has intensified dramatically in recent weeks, with Israel bombing Beirut's southern suburbs, the south and the Bekaa Valley, and killing many of Hezbollah's top leaders.  Wafiq Safa, who heads Hezbollah's liaison and coordination unit responsible for working with Lebanese security agencies, was targeted by Israel on Thursday night but survived, the security sources said. The Israeli strikes hit a densely packed residential neighbourhood of apartment buildings and small shops in the heart of Beirut. Israel did not issue evacuation warnings ahead of the strikes and had not previously attacked the area, which is removed from Beirut's southern suburbs where Hezbollah's headquarters have been repeatedly bombed by Israel. Lebanon's Health Ministry reported 22 people killed and 117 wounded. Among the dead was a family of eight, including three children, who had evacuated from the south, according to a security source. Reuters witnesses said at least one strike hit near a gas station and a thick column of smoke was visible. A large fire blazed in the background as rescue workers searched the rubble for survivors, according to video broadcast by Hezbollah’s al-Manar television. There was no immediate comment on the incident by Israel.  After Israel killed a series of high-ranking Hezbollah officials in recent weeks, including top leader Hassan Nasrallah, Safa was among the few surviving senior figures as the group's upper echelons struggled to reorganise. The attempt to kill Safa, whose role merges security and political affairs, marked a widening of Israel's targets among Hezbollah officials, which previously focused on the group’s military commanders and top leaders.  PEACEKEEPERS 'IN JEOPARDY'  The United Nations' peacekeeping force in Lebanon, UNIFIL, said two of its personnel were injured when an Israeli tank fired at a watchtower on Thursday at its main headquarters in Ras al-Naqoura, hitting the tower and causing the peacekeepers to fall. The two peacekeepers were from Indonesia's contingent and were in good condition after being treated for light injuries, Indonesia Foreign Minister Retno Marsudi said in a statement. The safety of more than 10,400 U.N. peacekeepers in Lebanon is \"increasingly in jeopardy\" and operations have virtually halted since late September, U.N. peacekeeping chief Jean-Pierre Lacroix told the Security Council. That coincides with Israel's escalation of its conflict with Lebanon. UNIFIL called attacks on peacekeepers \"a grave violation of international humanitarian law.\"  The White House said the U.S. was deeply concerned by reports that Israeli forces fired on U.N. positions and was pressing Israel for details.  Israel's military said in a statement its troops operated in the Naqoura area, \"next to a UNIFIL base.\"   \"Accordingly, the IDF instructed the U.N. forces in the area to remain in protected spaces, following which the forces opened fire in the area,\" Israel's statement said, adding it maintains routine communication with UNIFIL. The peacekeepers are determined to remain at their posts despite Israeli attacks and orders by Israel's military to leave, the force's spokesperson Andrea Tenenti said.  In New York, Israel's U.N. Ambassador Danny Danon said Israel recommends UNIFIL relocate 5 km (3 miles) north \"to avoid danger as fighting intensifies\". Danon said attacking Hezbollah was necessary so 70,000 displaced Israelis could return to homes in northern Israel. The Middle East remains on high alert for further escalation in the region, awaiting Israel's response to an Iranian missile strike on Oct. 1.  U.S. vice president and Democratic presidential candidate Kamala Harris said de-escalation was needed. \"We have got to reach a ceasefire,\" Harris told reporters as she departed Las Vegas, while commenting on the situations in Gaza and Lebanon. \"We've got to de-escalate.\" A ceasefire remains elusive in Gaza and Lebanon. Washington's occasional condemnation of Israel over civilian deaths has mostly been verbal with no substantive change in policy. Israeli strikes have killed at least 2,169 people in Lebanon over the last year, the Lebanese government said in its daily update. The majority have been killed since Sept. 27, when Israel expanded its military campaign. The toll does not distinguish between civilians and combatants. Hezbollah cross-border fire at Israel has killed 53 people over the same period, more than half of them civilians, according to Israeli authorities.",
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK9A02U_M.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"article\"\u003e \u003cp\u003eBy Maya Gebeily and Alexander Cornwell\u003c/p\u003e \u003cp\u003eBEIRUT/JERUSALEM (Reuters) - Israeli strikes killed 22 people and injured more than 100 in central Beirut on Thursday, Lebanese authorities said, as a senior Hezbollah official evaded an Israeli assassination attempt in the city, according to three security sources.\u003c/p\u003e \u003cp\u003eIn the country\u0026#39;s south, two United Nations peacekeepers were injured when an Israeli tank fired at a watchtower at the force\u0026#39;s main headquarters in Ras al-Naqoura, prompting the U.N. to say its personnel were facing increasing danger.\u003c/p\u003e \u003cp\u003eThe conflict between Israel and Hezbollah erupted one year ago when the Iranian-backed group opened fire in support of Palestinian militant group Hamas at the start of the Gaza war.\u003c/p\u003e \u003cp\u003eIt has intensified dramatically in recent weeks, with Israel bombing Beirut\u0026#39;s southern suburbs, the south and the Bekaa Valley, and killing many of Hezbollah\u0026#39;s top leaders. \u003c/p\u003e \u003cp\u003eWafiq Safa, who heads Hezbollah\u0026#39;s liaison and coordination unit responsible for working with Lebanese security agencies, was targeted by Israel on Thursday night but survived, the security sources said. \u003c/p\u003e \u003cp\u003eThe Israeli strikes hit a densely packed residential neighbourhood of apartment buildings and small shops in the heart of Beirut. \u003c/p\u003e \u003cp\u003eIsrael did not issue evacuation warnings ahead of the strikes and had not previously attacked the area, which is removed from Beirut\u0026#39;s southern suburbs where Hezbollah\u0026#39;s headquarters have been repeatedly bombed by Israel.\u003c/p\u003e \u003cp\u003eLebanon\u0026#39;s Health Ministry reported 22 people killed and 117 wounded. Among the dead was a family of eight, including three children, who had evacuated from the south, according to a security source.\u003c/p\u003e \u003cp\u003eReuters witnesses said at least one strike hit near a gas station and a thick column of smoke was visible. A large fire blazed in the background as rescue workers searched the rubble for survivors, according to video broadcast by Hezbollah’s al-Manar television.\u003c/p\u003e \u003cp\u003eThere was no immediate comment on the incident by Israel. \u003c/p\u003e \u003cp\u003eAfter Israel killed a series of high-ranking Hezbollah officials in recent weeks, including top leader Hassan Nasrallah, Safa was among the few surviving senior figures as the group\u0026#39;s upper echelons struggled to reorganise.\u003c/p\u003e \u003cp\u003eThe attempt to kill Safa, whose role merges security and political affairs, marked a widening of Israel\u0026#39;s targets among Hezbollah officials, which previously focused on the group’s military commanders and top leaders. \u003c/p\u003e \u003cp\u003ePEACEKEEPERS \u0026#39;IN JEOPARDY\u0026#39; \u003c/p\u003e \u003cp\u003eThe United Nations\u0026#39; peacekeeping force in Lebanon, UNIFIL, said two of its personnel were injured when an Israeli tank fired at a watchtower on Thursday at its main headquarters in Ras al-Naqoura, hitting the tower and causing the peacekeepers to fall. \u003c/p\u003e \u003cp\u003eThe two peacekeepers were from Indonesia\u0026#39;s contingent and were in good condition after being treated for light injuries, Indonesia Foreign Minister Retno Marsudi said in a statement.\u003c/p\u003e \u003cp\u003eThe safety of more than 10,400 U.N. peacekeepers in Lebanon is \u0026#34;increasingly in jeopardy\u0026#34; and operations have virtually halted since late September, U.N. peacekeeping chief Jean-Pierre Lacroix told the Security Council. That coincides with Israel\u0026#39;s escalation of its conflict with Lebanon. \u003c/p\u003e \u003cp\u003eUNIFIL called attacks on peacekeepers \u0026#34;a grave violation of international humanitarian law.\u0026#34; \u003c/p\u003e \u003cp\u003eThe White House said the U.S. was deeply concerned by reports that Israeli forces fired on U.N. positions and was pressing Israel for details. \u003c/p\u003e \u003cp\u003eIsrael\u0026#39;s military said in a statement its troops operated in the Naqoura area, \u0026#34;next to a UNIFIL base.\u0026#34;  \u003c/p\u003e \u003cp\u003e\u0026#34;Accordingly, the IDF instructed the U.N. forces in the area to remain in protected spaces, following which the forces opened fire in the area,\u0026#34; Israel\u0026#39;s statement said, adding it maintains routine communication with UNIFIL. \u003c/p\u003e \u003cp\u003eThe peacekeepers are determined to remain at their posts despite Israeli attacks and orders by Israel\u0026#39;s military to leave, the force\u0026#39;s spokesperson Andrea Tenenti said. \u003c/p\u003e \u003cp\u003eIn New York, Israel\u0026#39;s U.N. Ambassador Danny Danon said Israel recommends UNIFIL relocate 5 km (3 miles) north \u0026#34;to avoid danger as fighting intensifies\u0026#34;. \u003c/p\u003e \u003cp\u003eDanon said attacking Hezbollah was necessary so 70,000 displaced Israelis could return to homes in northern Israel.\u003c/p\u003e \u003cp\u003eThe Middle East remains on high alert for further escalation in the region, awaiting Israel\u0026#39;s response to an Iranian missile strike on Oct. 1. \u003c/p\u003e \u003cp\u003eU.S. vice president and Democratic presidential candidate Kamala Harris said de-escalation was needed.\u003c/p\u003e \u003cp\u003e\u0026#34;We have got to reach a ceasefire,\u0026#34; Harris told reporters as she departed Las Vegas, while commenting on the situations in Gaza and Lebanon. \u0026#34;We\u0026#39;ve got to de-escalate.\u0026#34;\u003c/p\u003e \u003cp\u003eA ceasefire remains elusive in Gaza and Lebanon. Washington\u0026#39;s occasional condemnation of Israel over civilian deaths has mostly been verbal with no substantive change in policy.\u003c/p\u003e \u003cp\u003e\u003cimg src=\"https://i-invdn-com.investing.com/trkd-images/LYNXMPEK9A02X_L.jpg\" title=\"© Reuters. People stand near rescue vehicles at the site of an Israeli air strike, amid ongoing hostilities between Hezbollah and Israeli forces, in Ras Al- Nabaa, in Beirut, Lebanon, October 10, 2024. REUTERS/Louisa Gouliamaki\" alt=\"© Reuters. People stand near rescue vehicles at the site of an Israeli air strike, amid ongoing hostilities between Hezbollah and Israeli forces, in Ras Al- Nabaa, in Beirut, Lebanon, October 10, 2024. REUTERS/Louisa Gouliamaki\" rel=\"external-image\"/\u003e\u003c/p\u003e\n\u003cp\u003eIsraeli strikes have killed at least 2,169 people in Lebanon over the last year, the Lebanese government said in its daily update. The majority have been killed since Sept. 27, when Israel expanded its military campaign. The toll does not distinguish between civilians and combatants.\u003c/p\u003e \u003cp\u003eHezbollah cross-border fire at Israel has killed 53 people over the same period, more than half of them civilians, according to Israeli authorities.  \u003c/p\u003e \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-11T03:08:50Z",
  "modifiedTime": null
}
