{
  "id": "fbac3356-71da-4ecd-848b-4b341fedd0a0",
  "title": "Markets poised for a relief rally amid India-Pak ceasefire",
  "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-poised-for-a-relief-rally-amid-india-pak-ceasefire/articleshow/121091248.cms",
  "description": "Following a weekend announcement of a \"pause\" in hostilities with Pakistan, Indian equity indices are set for a relief rally. Concerns of a full-scale conflict had previously prompted traders to liquidate positions, causing market declines. While a positive reaction to de-escalation is anticipated, experts caution that elevated valuations and continued geopolitical uncertainty may limit any sharp upmove.",
  "author": "",
  "published": "Mon, 12 May 2025 05:23:24 +0530",
  "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
  "categories": null,
  "byline": "",
  "length": 2631,
  "excerpt": "Following a weekend announcement of a \"pause\" in hostilities with Pakistan, Indian equity indices are set for a relief rally. Concerns of a full-scale conflict had previously prompted traders to liquidate positions, causing market declines. While a positive reaction to de-escalation is anticipated, experts caution that elevated valuations and continued geopolitical uncertainty may limit any sharp upmove.",
  "siteName": "The Economic Times",
  "favicon": "",
  "text": "Mumbai: Equity indices are poised for a relief rally Monday after the weekend announcement of a \"pause\" in hostilities with Pakistan, although the breather could well be short-lived if the situation along the border were to worsen yet again.Tired of too many ads? Remove AdsBoth benchmark indices declined around 1.3% over the past week, including a 1.1% fall on Friday, as concerns of a full-scale conflict prompted traders to liquidate their bets ahead of the weekend.\"There was apprehension among investors, especially at the fag end of the week, due to the rising tensions between India and Pakistan, which led to lightened positions,\" said Lakshmi Iyer, CEO-Investment \u0026 Strategy, Kotak Alternate Asset Managers. \"The ceasefire is a big respite and is expected to trigger a relief rally on Monday.\"Iyer noted that while markets may react positively to de-escalation, a sharp upmove is unlikely.Agencies Valuations Remain ElevatedTired of too many ads? Remove Ads Trading could remain choppy in the near term as geopolitical developments continue to weigh on sentiment, according to Iyer.The truce between India and Pakistan is shrouded in an uneasy calm, as both countries have accused each other of violating the ceasefire.The Volatility Index (VIX), often referred to as the market's fear gauge, surged 16.4% to 21.63 over the past five sessions, indicating heightened risk perception among traders.Foreign portfolio investors (FPIs) sold shares worth a net ₹3,798 crore on Friday-turning sellers for the first time in 16 trading sessions. Domestic institutional investors (DIIs) bought shares worth ₹7,278 crore. So far in May, FPIs have bought equities worth ₹9,257.95 crore after purchasing ₹3,416.08 crore in April.Calm After the Storm\"The markets were holding up despite the geopolitical noise. Now that some uncertainty has receded, they are expected to breathe a little easier,\" said Mahesh Patil, CIO, Aditya Birla Sun Life AMC.Patil said traders who built bearish positions ahead of the weekend could not rush to liquidate their positions and that could push the markets higher. Still, he warned that current valuations remain elevated, which may limit any sharp rally.Iyer also expects the upside to be capped.\"When the conflict first broke out, the markets didn't crash in a big way. So while there may not be a sharp rebound, respite buying is expected now that some uncertainty is out of the way,\" Iyer said.Tired of too many ads? Remove AdsPatil noted that domestic investors had been cautious in deploying funds, and this withheld capital could gradually enter the markets in the coming days.",
  "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-61796,resizemode-75,msid-121091248/markets/stocks/news/markets-poised-for-a-relief-rally-amid-india-pak-ceasefire.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"articlebody_121091248\"\u003e\u003cp\u003eMumbai: \u003ca href=\"https://economictimes.indiatimes.com/topic/equity-indices\"\u003eEquity indices\u003c/a\u003e are poised for a \u003ca href=\"https://economictimes.indiatimes.com/topic/relief-rally\"\u003erelief rally\u003c/a\u003e Monday after the weekend announcement of a \u0026#34;pause\u0026#34; in hostilities with Pakistan, although the breather could well be short-lived if the situation along the border were to worsen yet again.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eBoth benchmark indices declined around 1.3% over the past week, including a 1.1% fall on Friday, as concerns of a full-scale conflict prompted traders to liquidate their bets ahead of the weekend.\u003c/p\u003e\u003cp\u003e\u0026#34;There was apprehension among investors, especially at the fag end of the week, due to the rising tensions between India and Pakistan, which led to lightened positions,\u0026#34; said Lakshmi Iyer, CEO-Investment \u0026amp; Strategy, Kotak Alternate Asset Managers. \u0026#34;The ceasefire is a big respite and is expected to trigger a relief rally on Monday.\u0026#34;\u003c/p\u003e\u003cp\u003eIyer noted that while markets may react positively to de-escalation, a sharp upmove is unlikely.\u003c/p\u003e\u003cfigure\u003e\u003ca href=\"https://img.etimg.com/photo/msid-121091479,imgsize-141429/ind-pak.jpg\" target=\"_blank\"\u003e\u003cimg src=\"https://img.etimg.com/photo/msid-121091479,imgsize-141429/ind-pak.jpg\" height=\"270\" alt=\"ind-pak\" width=\"360\" loading=\"lazy\" decoding=\"async\"/\u003e\u003cspan\u003eAgencies\u003c/span\u003e\u003c/a\u003e\u003c/figure\u003e\n                 \u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eValuations Remain Elevated\u003c/strong\u003e\u003c/strong\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e Trading could remain choppy in the near term as geopolitical developments continue to weigh on sentiment, according to Iyer.\u003c/p\u003e\u003cp\u003eThe truce between India and Pakistan is shrouded in an uneasy calm, as both countries have accused each other of violating the ceasefire.\u003c/p\u003e\u003cp\u003eThe Volatility Index (VIX), often referred to as the market\u0026#39;s fear gauge, surged 16.4% to 21.63 over the past five sessions, indicating heightened risk perception among traders.\u003c/p\u003e\u003cp\u003eForeign portfolio investors (FPIs) sold shares worth a net ₹3,798 crore on Friday-turning sellers for the first time in 16 trading sessions. Domestic institutional investors (DIIs) bought shares worth ₹7,278 crore. So far in May, FPIs have bought equities worth ₹9,257.95 crore after purchasing ₹3,416.08 crore in April.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003cstrong\u003eCalm After the Storm\u003c/strong\u003e\u003c/strong\u003e\u003cbr/\u003e\u0026#34;The markets were holding up despite the geopolitical noise. Now that some uncertainty has receded, they are expected to breathe a little easier,\u0026#34; said Mahesh Patil, CIO, \u003ca rel=\"dofollow\" href=\"https://m.economictimes.com/aditya-birla-sun-life-amc-ltd/stocks/companyid-14939.cms\"\u003eAditya Birla Sun Life AMC\u003c/a\u003e.\u003c/p\u003e\u003cp\u003ePatil said traders who built bearish positions ahead of the weekend could not rush to liquidate their positions and that could push the markets higher. Still, he warned that current valuations remain elevated, which may limit any sharp rally.\u003c/p\u003e\u003cp\u003eIyer also expects the upside to be capped.\u003c/p\u003e\u003cp\u003e\u0026#34;When the conflict first broke out, the markets didn\u0026#39;t crash in a big way. So while there may not be a sharp rebound, respite buying is expected now that some uncertainty is out of the way,\u0026#34; Iyer said.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eTired of too many ads? \u003cspan\u003eRemove Ads\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003ePatil noted that domestic investors had been cautious in deploying funds, and this withheld capital could gradually enter the markets in the coming days.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
