{
  "id": "03ffa07d-6b03-4d7f-ad7a-6f82e958f204",
  "title": "GB's Draper beats Musetti to reach Madrid Open final",
  "link": "https://www.bbc.com/sport/tennis/articles/c5y57nx9188o",
  "description": "Britain's Jack Draper books his spot in the Madrid Open final with a hard-fought 6-3 7-6 (7-4) victory against Lorenzo Musetti.",
  "author": "",
  "published": "Fri, 02 May 2025 20:38:58 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Bobbie Jackson",
  "length": 3228,
  "excerpt": "Britain's Jack Draper books his spot in the Madrid Open final with a hard-fought 6-3 7-6 (7-4) victory against Lorenzo Musetti.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Jack Draper booked his spot in the Madrid Open final with a hard-fought 6-3 7-6 (7-4) victory against Lorenzo Musetti.The British number one will contest his third ATP final of the year against Norway's Casper Ruud on Sunday.Draper, 23, was broken in the opening set but claimed a double break of his own to come through comfortably.It is the first time the 2024 US Open semi-finalist has reached the final of a clay-court event.He is the first Englishman to reach the final of the Madrid Open and the second Briton after Scotland's Andy Murray, who appeared in three finals and won two titles.Draper is aiming for his second ATP title of the year after beating Holger Rune at Indian Wells in March.\"It felt like a key moment every point. The level was high from both of us. I've played Lorenzo all through the juniors and it has always been tough but he is a different animal on the clay,\" Draper told Sky Sports.\"Sometimes in the key moments now I think about the pain I go through on a daily basis - all the sacrifices.\"He has won all four meetings with Musetti as a professional and his perfect record even extends back to their days in the juniors.That might have been playing on Musetti's mind in the opening stages when he dropped his first service game.The Italian struck back immediately but was unable to force his way into the first set after a second break as Draper's forehand once again proved to be a key factor.Musetti was much improved in the second set and it made for a more competitive spectacle.The Madrid crowd were firmly behind Musetti and chanted his name in the fifth game after a perfectly placed drop shot left Draper scrambling.Both players refused to budge on serve - each saving one break point - before heading to a tie-break.Again, it proved to be a tense battle but Draper earned a break on the fifth point to steal control and went on to serve out for victory - finishing with an authoritative cross-court backhand.Ruud booked his spot in Sunday's showpiece with a 6-4 7-5 win over Francisco Cerundolo, despite struggling with a rib injury.The world number 15 required treatment three games into the opening set but still managed to save 15 of the 18 break points he faced.\"I wasn't sure I was going to be able to finish the match, honestly. I felt something in my rib during the warm-up, just towards the end before going out [on court],\" Ruud said.\"I felt it in nearly every shot, especially the serve. Luckily, I got some quick treatment on it. There's not too much you can do, you only have three minutes [with the physio]. So I will go and check it out more now.\"Sunday's final will be the first time Draper, who is set to climb into the top five in the world for the first time in his career next week, and Ruud have met in the professional ranks.It will be Ruud's 18th final on clay, with Novak Djokovic the only active player to have reached more finals - 34 - on the surface.The 26-year-old has won 11 titles on the red dirt with his most recent success coming in May 2024 at the Geneva Open.\"Casper is a two-time Roland Garros finalist and very accustomed to the clay,\" Draper said of his opponent.\"He is always tough to beat so it will be a challenge for me - but I'm ready for it.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6773/live/396a9f10-2793-11f0-b15e-cf28d9aaba15.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eJack Draper booked his spot in the Madrid Open final with a hard-fought 6-3 7-6 (7-4) victory against Lorenzo Musetti.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe British number one will contest his third ATP final of the year against Norway\u0026#39;s Casper Ruud on Sunday.\u003c/p\u003e\u003cp\u003eDraper, 23, was broken in the opening set but claimed a double break of his own to come through comfortably.\u003c/p\u003e\u003cp\u003eIt is the first time the 2024 US Open semi-finalist has reached the final of a clay-court event.\u003c/p\u003e\u003cp\u003eHe is the first Englishman to reach the final of the Madrid Open and the second Briton after Scotland\u0026#39;s Andy Murray, who appeared in three finals and won two titles.\u003c/p\u003e\u003cp\u003eDraper is aiming for his second ATP title of the year after beating Holger Rune at Indian Wells in March.\u003c/p\u003e\u003cp\u003e\u0026#34;It felt like a key moment every point. The level was high from both of us. I\u0026#39;ve played Lorenzo all through the juniors and it has always been tough but he is a different animal on the clay,\u0026#34; Draper told Sky Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;Sometimes in the key moments now I think about the pain I go through on a daily basis - all the sacrifices.\u0026#34;\u003c/p\u003e\u003cp\u003eHe has won all four meetings with Musetti as a professional and his perfect record even extends back to their days in the juniors.\u003c/p\u003e\u003cp\u003eThat might have been playing on Musetti\u0026#39;s mind in the opening stages when he dropped his first service game.\u003c/p\u003e\u003cp\u003eThe Italian struck back immediately but was unable to force his way into the first set after a second break as Draper\u0026#39;s forehand once again proved to be a key factor.\u003c/p\u003e\u003cp\u003eMusetti was much improved in the second set and it made for a more competitive spectacle.\u003c/p\u003e\u003cp\u003eThe Madrid crowd were firmly behind Musetti and chanted his name in the fifth game after a perfectly placed drop shot left Draper scrambling.\u003c/p\u003e\u003cp\u003eBoth players refused to budge on serve - each saving one break point - before heading to a tie-break.\u003c/p\u003e\u003cp\u003eAgain, it proved to be a tense battle but Draper earned a break on the fifth point to steal control and went on to serve out for victory - finishing with an authoritative cross-court backhand.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRuud booked his spot in Sunday\u0026#39;s showpiece with a 6-4 7-5 win over Francisco Cerundolo, despite struggling with a rib injury.\u003c/p\u003e\u003cp\u003eThe world number 15 required treatment three games into the opening set but still managed to save 15 of the 18 break points he faced.\u003c/p\u003e\u003cp\u003e\u0026#34;I wasn\u0026#39;t sure I was going to be able to finish the match, honestly. I felt something in my rib during the warm-up, just towards the end before going out [on court],\u0026#34; Ruud said.\u003c/p\u003e\u003cp\u003e\u0026#34;I felt it in nearly every shot, especially the serve. Luckily, I got some quick treatment on it. There\u0026#39;s not too much you can do, you only have three minutes [with the physio]. So I will go and check it out more now.\u0026#34;\u003c/p\u003e\u003cp\u003eSunday\u0026#39;s final will be the first time Draper, who is set to climb into the top five in the world for the first time in his career next week, and Ruud have met in the professional ranks.\u003c/p\u003e\u003cp\u003eIt will be Ruud\u0026#39;s 18th final on clay, with Novak Djokovic the only active player to have reached more finals - 34 - on the surface.\u003c/p\u003e\u003cp\u003eThe 26-year-old has won 11 titles on the red dirt with his most recent success coming in May 2024 at the Geneva Open.\u003c/p\u003e\u003cp\u003e\u0026#34;Casper is a two-time Roland Garros finalist and very accustomed to the clay,\u0026#34; Draper said of his opponent.\u003c/p\u003e\u003cp\u003e\u0026#34;He is always tough to beat so it will be a challenge for me - but I\u0026#39;m ready for it.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-02T20:16:18.551Z",
  "modifiedTime": null
}
