{
  "id": "0ee2e8ff-9a40-48f1-9483-fc5011ea1cf7",
  "title": "Blockx-buster: Belgian teenager targeting Next Gen ATP Finals",
  "link": "https://www.atptour.com/en/news/blockx-challenger-2025-feature-february",
  "description": "When Alexander Blockx claimed the 2023 Australian Open boys’ singles title, he defeated talents like Joao Fonseca and Learner Tien along the way. The Belgian escaped Tien in a three-set final, which featured a dramatic super tie-break to decide the match. While Fonseca and Tien have enjoyed their recent moments in the spotlight — contesting in last year’s Next Gen ATP Finals presented by PIF title match and cracking the Top 100 this season — now the 19-year-old Blockx has his sights set on joining his peers on the ATP Tour and in Jeddah for the 20-and-under showdown. “I think it could be the main goal for this year. I’m very motivated to compete there at the end of the year. I even follow the Race to Jeddah and stuff to see how many points I have,” Blockx told ATPTour.com. “Two years ago, I think it was too early. But last year I was pretty close to qualifying, like 12th or 13th. I was watching and I was like, ‘Okay, this is something I want to do next year!’” Blockx is entering his second season on the ATP Challenger Tour and he has already made a splash on that circuit. He lifted his first Challenger title in November in Kobe, Japan, his penultimate event of the year. After returning home from Asia, Blockx was monitoring a minor elbow injury, opting for rest during his first offseason week. The night before Blockx was set to resume training, he developed a fever that stubbornly lingered for a week, again taking a dent into his scheduled training. “We were like, ‘Okay, something must be wrong!’ I didn’t feel bad, just the fever, a little headache,” Blockx said. “Not even my nose or throat was hurting. Very strange. Then a week later, I felt so bad and all of the sudden, my fever got all the way up to 39 degrees, I couldn’t move anymore. “We were like, ‘This is not normal, we have to see the doctor’. The doctor said in my right lung there was a small inflammation.” Blockx’s illness cut into crucial preseason training time. “I basically didn't move a muscle for three weeks between resting the elbow and then for two weeks I couldn’t move at all. Every time I started moving, my heart rate went up and I started feeling very weak and stuff,” Blockx said. “The first week when I restarted practise, it was all very light. When there was a long rally, I was out of breath and I’d have to wait between the rallies.” After falling short in his first two matches of the season, Blockx played himself into form at last month’s Oeiras, Portugal Challenger, where he returned to the winner’s circle and became the youngest Belgian to earn multiple trophies at that level. Alexander Blockx is crowned champion at the Oeiras Challenger. Credit: Beatriz Ruivo/FPT “Every time you get through these matches, it gives you a boost that you can beat those guys,” Blockx said. “I wasn’t at my best level for the first two matches, but I told myself, ‘It’s a very good thing that I can beat these guys when I’m not playing my very best.’” Born to Ukrainian parents who were both professional athletes, Blockx’s father, Oleg, was a track athlete specialising in hurdle races, while his mother, Natalia, was a swimmer. Despite this diverse sporting background, Blockx has never played any sport besides tennis. Blockx is under the guidance of Philippe Cassiers, who has coached the rising star since the 6’4” Antwerp native was aged four. A highlight of their partnership came in 2023, when Blockx became the junior No. 1 in singles and doubles. Now aiming to establish himself at the highest levels of the sport, Blockx sees the Next Gen ATP Finals presented by PIF as a key stepping stone in his journey. “I think it would be a dream to play there and also to see where you are compared to your other opponents of your age group,” said Blockx, who is fifth in the PIF ATP Live Race To Jeddah. [NEWSLETTER FORM]",
  "author": "",
  "published": "Wed, 26 Feb 2025 22:13:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Challenger",
    "Alexander Blockx",
    "2025",
    "Player Features"
  ],
  "byline": "",
  "length": 4067,
  "excerpt": "Alexander Blockx is entering his second season on the ATP Challenger Tour and he has already made a splash on that circuit. He is aiming to continue his breakthrough and qualify for this year's Next Gen ATP Finals presented by PIF.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Challenger Learn more about the 19-year-old February 26, 2025 Patrick Hamilton/Belga Mag/AFP via Getty Images Alexander Blockx is No. 153 in the PIF ATP Rankings. By Grant Thompson When Alexander Blockx claimed the 2023 Australian Open boys’ singles title, he defeated talents like Joao Fonseca and Learner Tien along the way. The Belgian escaped Tien in a three-set final, which featured a dramatic super tie-break to decide the match. While Fonseca and Tien have enjoyed their recent moments in the spotlight — contesting in last year’s Next Gen ATP Finals presented by PIF title match and cracking the Top 100 this season — now the 19-year-old Blockx has his sights set on joining his peers on the ATP Tour and in Jeddah for the 20-and-under showdown. “I think it could be the main goal for this year. I’m very motivated to compete there at the end of the year. I even follow the Race to Jeddah and stuff to see how many points I have,” Blockx told ATPTour.com. “Two years ago, I think it was too early. But last year I was pretty close to qualifying, like 12th or 13th. I was watching and I was like, ‘Okay, this is something I want to do next year!’” Blockx is entering his second season on the ATP Challenger Tour and he has already made a splash on that circuit. He lifted his first Challenger title in November in Kobe, Japan, his penultimate event of the year. After returning home from Asia, Blockx was monitoring a minor elbow injury, opting for rest during his first offseason week. The night before Blockx was set to resume training, he developed a fever that stubbornly lingered for a week, again taking a dent into his scheduled training. “We were like, ‘Okay, something must be wrong!’ I didn’t feel bad, just the fever, a little headache,” Blockx said. “Not even my nose or throat was hurting. Very strange. Then a week later, I felt so bad and all of the sudden, my fever got all the way up to 39 degrees, I couldn’t move anymore. “We were like, ‘This is not normal, we have to see the doctor’. The doctor said in my right lung there was a small inflammation.” Blockx’s illness cut into crucial preseason training time. “I basically didn't move a muscle for three weeks between resting the elbow and then for two weeks I couldn’t move at all. Every time I started moving, my heart rate went up and I started feeling very weak and stuff,” Blockx said. “The first week when I restarted practise, it was all very light. When there was a long rally, I was out of breath and I’d have to wait between the rallies.” After falling short in his first two matches of the season, Blockx played himself into form at last month’s Oeiras, Portugal Challenger, where he returned to the winner’s circle and became the youngest Belgian to earn multiple trophies at that level. Alexander Blockx is crowned champion at the Oeiras Challenger. Credit: Beatriz Ruivo/FPT “Every time you get through these matches, it gives you a boost that you can beat those guys,” Blockx said. “I wasn’t at my best level for the first two matches, but I told myself, ‘It’s a very good thing that I can beat these guys when I’m not playing my very best.’” Born to Ukrainian parents who were both professional athletes, Blockx’s father, Oleg, was a track athlete specialising in hurdle races, while his mother, Natalia, was a swimmer. Despite this diverse sporting background, Blockx has never played any sport besides tennis. Blockx is under the guidance of Philippe Cassiers, who has coached the rising star since the 6’4” Antwerp native was aged four. A highlight of their partnership came in 2023, when Blockx became the junior No. 1 in singles and doubles. Now aiming to establish himself at the highest levels of the sport, Blockx sees the Next Gen ATP Finals presented by PIF as a key stepping stone in his journey. “I think it would be a dream to play there and also to see where you are compared to your other opponents of your age group,” said Blockx, who is fifth in the PIF ATP Live Race To Jeddah.",
  "image": "https://www.atptour.com/-/media/images/news/2025/02/24/16/46/blockx-challenger-2025-feature.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eChallenger\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eLearn more about the 19-year-old\u003c/p\u003e\n    \u003cp\u003eFebruary 26, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/02/24/16/46/blockx-challenger-2025-feature.jpg\" alt=\"Alexander Blockx is No. 153 in the PIF ATP Rankings.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003ePatrick Hamilton/Belga Mag/AFP via Getty Images\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eAlexander Blockx is No. 153 in the PIF ATP Rankings.\u003c/span\u003e\n        \u003cspan\u003eBy Grant Thompson\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eWhen \u003ca href=\"https://www.atptour.com/en/players/alexander-blockx/b0pg/overview\"\u003eAlexander Blockx\u003c/a\u003e claimed the 2023 \u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e boys’ singles title, he defeated talents like \u003ca href=\"https://www.atptour.com/en/players/joao-fonseca/f0fv/overview\"\u003eJoao Fonseca\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/learner-tien/t0ha/overview\"\u003eLearner Tien\u003c/a\u003e along the way. The Belgian escaped Tien in a three-set final, which featured a dramatic super tie-break to decide the match.\u003c/p\u003e\n\u003cp\u003e\nWhile Fonseca and Tien have enjoyed their recent moments in the spotlight — contesting in last year’s \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e title match and cracking the Top 100 this season — now the 19-year-old Blockx has his sights set on joining his peers on the ATP Tour and in Jeddah for the 20-and-under showdown.\u003c/p\u003e\n\u003cp\u003e\n“I think it could be the main goal for this year. I’m very motivated to compete there at the end of the year. I even follow the Race to Jeddah and stuff to see how many points I have,” Blockx told ATPTour.com.\u003c/p\u003e\n\u003cp\u003e\n“Two years ago, I think it was too early. But last year I was pretty close to qualifying, like 12th or 13th. I was watching and I was like, ‘Okay, this is something I want to do next year!’”\u003c/p\u003e\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/news/it-all-adds-up-hub\" target=\"_blank\"\u003e\u003cimg alt=\"It All Adds Up\" src=\"https://www.atptour.com/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026amp;hash=31EE1C2D1B04C8D5532DFFA763CBA0FF\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\nBlockx is entering his second season on the ATP Challenger Tour and he has already made a splash on that circuit. He lifted his first Challenger title in November in Kobe, Japan, his penultimate event of the year.\u003c/p\u003e\n\u003cp\u003e\nAfter returning home from Asia, Blockx was monitoring a minor elbow injury, opting for rest during his first offseason week.\u003c/p\u003e\n\u003cp\u003e\nThe night before Blockx was set to resume training, he developed a fever that stubbornly lingered for a week, again taking a dent into his scheduled training.\u003c/p\u003e\n\u003cp\u003e\n“We were like, ‘Okay, something must be wrong!’ I didn’t feel bad, just the fever, a little headache,” Blockx said. “Not even my nose or throat was hurting. Very strange. Then a week later, I felt so bad and all of the sudden, my fever got all the way up to 39 degrees, I couldn’t move anymore.\u003c/p\u003e\n\u003cp\u003e\n“We were like, ‘This is not normal, we have to see the doctor’. The doctor said in my right lung there was a small inflammation.”\u003c/p\u003e\n\u003cp\u003e\nBlockx’s illness cut into crucial preseason training time.\u003c/p\u003e\n\u003cp\u003e\n“I basically didn\u0026#39;t move a muscle for three weeks between resting the elbow and then for two weeks I couldn’t move at all. Every time I started moving, my heart rate went up and I started feeling very weak and stuff,” Blockx said. “The first week when I restarted practise, it was all very light. When there was a long rally, I was out of breath and I’d have to wait between the rallies.”\u003c/p\u003e\n\u003cp\u003e\nAfter falling short in his first two matches of the season, Blockx played himself into form at last month’s Oeiras, Portugal Challenger, where he returned to the winner’s circle and became the youngest Belgian to earn multiple trophies at that level.\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/alexander-blockx/b0pg/overview\u0026#39;\u0026gt;Alexander Blockx\u0026lt;/a\u0026gt; is crowned champion at the Oeiras Challenger.\" src=\"https://www.atptour.com/-/media/images/news/2025/01/27/21/47/blockx-oeirasch-2025-trophy.jpg\"/\u003e\u003cbr/\u003e\u003cem\u003e\u003csup\u003e\u003ca href=\"https://www.atptour.com/en/players/alexander-blockx/b0pg/overview\"\u003eAlexander Blockx\u003c/a\u003e is crowned champion at the Oeiras Challenger. Credit: Beatriz Ruivo/FPT\u003c/sup\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\n“Every time you get through these matches, it gives you a boost that you can beat those guys,” Blockx said. “I wasn’t at my best level for the first two matches, but I told myself, ‘It’s a very good thing that I can beat these guys when I’m not playing my very best.’”\u003c/p\u003e\n\u003cp\u003e\nBorn to Ukrainian parents who were both professional athletes, Blockx’s father, Oleg, was a track athlete specialising in hurdle races, while his mother, Natalia, was a swimmer. Despite this diverse sporting background, Blockx has never played any sport besides tennis.\u003c/p\u003e\n\n\u003cp\u003e\nBlockx is under the guidance of \u003ca href=\"https://www.atptour.com/en/players/philippe-cassiers/c732/overview\"\u003ePhilippe Cassiers\u003c/a\u003e, who has coached the rising star since the 6’4” Antwerp native was aged four. A highlight of their partnership came in 2023, when Blockx became the junior No. 1 in singles and doubles. Now aiming to establish himself at the highest levels of the sport, Blockx sees the \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e as a key stepping stone in his journey.\u003c/p\u003e\n\u003cp\u003e\n“I think it would be a dream to play there and also to see where you are compared to your other opponents of your age group,” said Blockx, who is fifth in the PIF ATP Live Race To Jeddah.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
