{
  "id": "1401b201-ecdd-4e4a-a9aa-49b8cd33641c",
  "title": "To serve or to receive? The ultimate decision for any pro tennis player",
  "link": "https://www.espn.com/tennis/story/_/id/45437655/2025-french-open-coin-toss-djokovic-serve-receive",
  "description": "The coin toss winner in a tennis match gets the choice: to receive or serve first. And the pro players are surprisingly divided on it.",
  "author": "Simon Cambers",
  "published": "Mon, 2 Jun 2025 16:43:00 EST",
  "source": "https://www.espn.com/espn/rss/tennis/news",
  "categories": null,
  "byline": "Simon Cambers",
  "length": 6819,
  "excerpt": "The coin toss winner in a tennis match gets the choice: to receive or serve first. And the pro players are surprisingly divided on it.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Simon CambersJun 2, 2025, 04:43 PM ETPARIS -- There is one part of tennis that has retained its simplicity: the coin toss.Though some events do it digitally, most tournaments still bring out the real thing to decide who serves first and which end the other player chooses. Heads or tails, serve or receive, it's as simple as that.Well, almost.In his book \"Winning Ugly,\" Brad Gilbert says receiving is the wise choice, psychologically. According to Gilbert, who reached world No. 4 as a player and found renewed fame as the coach to Andre Agassi, Andy Roddick and most recently Coco Gauff, if someone chooses to serve and is broken, they are immediately on the back foot. If they choose to receive and don't break, they have lost nothing and have a game under their belt before serving themselves.Weather conditions, how players match up against each other, court surface and how a player feels on any given day can all play a role in the choice. Some players choose an end of the court rather than to serve or receive.Novak Djokovic said his instinct has changed over the years.\"At the beginning of my career, even though I really liked my chances when I'm serving, I was relying more on the return. So if I got the coin toss, I would always choose to return,\" Djokovic said at Roland Garros on Monday. \"But the last, I don't know, 10 years, I would be only choosing to serve.\"I just feel that sets a tone in some way. You also send a message to your opponent like, 'Hey, I'm not afraid to start serving,' start the match with this kind of a right statement. Sometimes I start slow, and I lose my first service games, and then you start to question your decision-making. But regardless of that, I still feel like it's important. It's important for your own confidence and to send the message to your opponent as well.\"British player Jodie Burrage said the coin toss was a \"big conversation among players.\"\"I always choose tails. I used to serve, but now receive,\" she said. \"I just think it gives me a game to get into things. I can hurt them first game if they start a little slow. If I start a little slow, it gives me a game to get into my serve.Better servers, like Djokovic, tend to serve first, knowing that if they hold and then break quickly, they can race to a 3-0 lead.\"It depends on the opponent [but] I preferably choose serve,\" Greece's Stefanos Tsitsipas told ESPN. \"When I start a match, I want to serve. But there are also times where if I see the body language of my opponent, if he's slightly stressed, or if I feel much nicer with my return game in that particular part of the year, I'll probably choose return.\"I don't think it actually decides a match, in my opinion. Of course, if you think about it from a mathematical way, if you manage to break on the second game of the match, you have higher chances of going 3-0 up then than if you actually start the match by receiving, which would end up in a 2-1 lead, so mathematically, you're just closer to a set if you start serving.\"Analysis of the first two Grand Slam events of the year suggest that in the first round, at least, the vast majority of players who win the toss choose to receive.In the first round of the women's singles at the Australian Open, 43 players chose to receive and 21 decided to serve. Of the 21 who served, nine were broken. Of the 43 who received, 12 broke serve.In the men's event, 43 received and 21 served first -- the same breakdown as the women -- but of those who chose to serve, only four were broken and of the 43 who received, just three broke serve.At this year's French Open, the numbers have been eerily similar. In the first round of the men's event, 19 players won the toss and chose to serve (six were broken), while 43 opted to receive (six broke serve). In the women's event, 21 players served first (11 were broken) and 41 received (21 broke serve).Interestingly, as the tournament progresses, the ratio of players choosing to serve first to those opting to receive narrows considerably. In Australia, the numbers in Rounds 2, 3 and 4 were almost equal. In Paris, the numbers were almost equal in Round 2 and though more men received in Round 3, perhaps because of the surface, it was close again in Round 4. In the last 16 of the women's event at Roland Garros, six of the eight women who won the toss chose to serve.Some big servers defer, perhaps believing they will win their serve anyway, so why not try to catch their opponent cold? Reilly Opelka, at 6-foot-11 one of the tallest players on the tour, chose to receive in both his matches this year at Roland Garros.Aryna Sabalenka and Gauff, who have struggled on serve at times in their careers, choose to serve first as a rule. Madison Keys, who won her first Grand Slam title at the Australian Open this year, generally chooses to receive, although she's flexible.\"Sometimes I like to receive just because I think coming out and serving first, sometimes there's some nerves,\" she said. \"I think there's a lot of opportunity that you can get up an early break, potentially.\"[But] honestly, it kind of just depends. I've served first [as in the fourth-round win at Roland Garros on Monday], I've returned first. It doesn't truly matter. But I think sometimes I kind of like the opportunity to just really get some good swings and some good hits before I have to serve first.\"Australian Sam Stosur, the former US Open champion whose serve was a huge part of her game, said she would always play to her strengths. \"I served first for 99 percent of my career,\" she said. \"It was only the last maybe year or so where I was like, 'Oh, maybe I should change things up and return every now and then.' It depended on the day, the opponent, how I was feeling. But usually I never ever entertained not serving first.\"Daria Kasatkina, who reached the last 16 at Roland Garros in her first major since changing allegiance from Russia to Australia earlier this year, said she almost always returns serve. Alex de Minaur, Australia's top-ranked men's player, does the same.\"I normally always choose to receive just to apply pressure from the very first game,\" De Minaur said. \"But since I know it's very common among players, especially on the clay [to receive], I also make sure whenever I can in practice matches to serve first sometimes just to make sure I'm used to it.\"There is one other choice that's not as widely known or used: to let the other player choose instead, something Croatian Marin Cilic tried in his first-round match against Flavio Cobolli at Roland Garros. In that case, Cobolli chose to receive and Cilic held serve anyway.It's a psychological move and one that Burrage said would freak her out.\"I think if someone would give me the choice, I'd be like, 'Wow,'\" the Briton said. \"No, no. I've never had that happen to me, thankfully.\"",
  "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0602%2Fr1501691_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eSimon Cambers\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eJun 2, 2025, 04:43 PM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003ePARIS -- There is one part of tennis that has retained its simplicity: the coin toss.\u003c/p\u003e\u003cp\u003eThough some events do it digitally, most tournaments still bring out the real thing to decide who serves first and which end the other player chooses. Heads or tails, serve or receive, it\u0026#39;s as simple as that.\u003c/p\u003e\u003cp\u003eWell, almost.\u003c/p\u003e\u003cp\u003eIn his book \u0026#34;Winning Ugly,\u0026#34; Brad Gilbert says receiving is the wise choice, psychologically. According to Gilbert, who reached world No. 4 as a player and found renewed fame as the coach to Andre Agassi, \u003ca data-player-guid=\"ebc04204-2740-0ce3-2aaf-4a33d11ec0c8\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=436\"\u003eAndy Roddick\u003c/a\u003e and most recently \u003ca data-player-guid=\"ca44c2b0-9dea-ab40-2541-b50a4442ff8e\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=3626\"\u003eCoco Gauff\u003c/a\u003e, if someone chooses to serve and is broken, they are immediately on the back foot. If they choose to receive and don\u0026#39;t break, they have lost nothing and have a game under their belt before serving themselves.\u003c/p\u003e\u003cp\u003eWeather conditions, how players match up against each other, court surface and how a player feels on any given day can all play a role in the choice. Some players choose an end of the court rather than to serve or receive.\u003c/p\u003e\u003cp\u003e\u003ca data-player-guid=\"4a27bb1c-2422-55c3-208b-9e9d8c1f30af\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=296\"\u003eNovak Djokovic\u003c/a\u003e said his instinct has changed over the years.\u003c/p\u003e\u003cp\u003e\u0026#34;At the beginning of my career, even though I really liked my chances when I\u0026#39;m serving, I was relying more on the return. So if I got the coin toss, I would always choose to return,\u0026#34; Djokovic said at Roland Garros on Monday. \u0026#34;But the last, I don\u0026#39;t know, 10 years, I would be only choosing to serve.\u003c/p\u003e\u003cp\u003e\u0026#34;I just feel that sets a tone in some way. You also send a message to your opponent like, \u0026#39;Hey, I\u0026#39;m not afraid to start serving,\u0026#39; start the match with this kind of a right statement. Sometimes I start slow, and I lose my first service games, and then you start to question your decision-making. But regardless of that, I still feel like it\u0026#39;s important. It\u0026#39;s important for your own confidence and to send the message to your opponent as well.\u0026#34;\u003c/p\u003e\u003cp\u003eBritish player \u003ca data-player-guid=\"d431ddc2-e490-b5b9-9a70-cf996d8d5016\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=2747\"\u003eJodie Burrage\u003c/a\u003e said the coin toss was a \u0026#34;big conversation among players.\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;I always choose tails. I used to serve, but now receive,\u0026#34; she said. \u0026#34;I just think it gives me a game to get into things. I can hurt them first game if they start a little slow. If I start a little slow, it gives me a game to get into my serve.\u003c/p\u003e\u003cp\u003eBetter servers, like Djokovic, tend to serve first, knowing that if they hold and then break quickly, they can race to a 3-0 lead.\u003c/p\u003e\u003cp\u003e\u0026#34;It depends on the opponent [but] I preferably choose serve,\u0026#34; Greece\u0026#39;s \u003ca data-player-guid=\"eeae43af-cdf0-43b4-7dd4-2475555a445e\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=2869\"\u003eStefanos Tsitsipas\u003c/a\u003e told ESPN. \u0026#34;When I start a match, I want to serve. But there are also times where if I see the body language of my opponent, if he\u0026#39;s slightly stressed, or if I feel much nicer with my return game in that particular part of the year, I\u0026#39;ll probably choose return.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t think it actually decides a match, in my opinion. Of course, if you think about it from a mathematical way, if you manage to break on the second game of the match, you have higher chances of going 3-0 up then than if you actually start the match by receiving, which would end up in a 2-1 lead, so mathematically, you\u0026#39;re just closer to a set if you start serving.\u0026#34;\u003c/p\u003e\u003cp\u003eAnalysis of the first two Grand Slam events of the year suggest that in the first round, at least, the vast majority of players who win the toss choose to receive.\u003c/p\u003e\u003cp\u003eIn the first round of the women\u0026#39;s singles at the Australian Open, 43 players chose to receive and 21 decided to serve. Of the 21 who served, nine were broken. Of the 43 who received, 12 broke serve.\u003c/p\u003e\u003cp\u003eIn the men\u0026#39;s event, 43 received and 21 served first -- the same breakdown as the women -- but of those who chose to serve, only four were broken and of the 43 who received, just three broke serve.\u003c/p\u003e\u003cp\u003eAt this year\u0026#39;s French Open, the numbers have been eerily similar. In the first round of the men\u0026#39;s event, 19 players won the toss and chose to serve (six were broken), while 43 opted to receive (six broke serve). In the women\u0026#39;s event, 21 players served first (11 were broken) and 41 received (21 broke serve).\u003c/p\u003e\u003cp\u003eInterestingly, as the tournament progresses, the ratio of players choosing to serve first to those opting to receive narrows considerably. In Australia, the numbers in Rounds 2, 3 and 4 were almost equal. In Paris, the numbers were almost equal in Round 2 and though more men received in Round 3, perhaps because of the surface, it was close again in Round 4. In the last 16 of the women\u0026#39;s event at Roland Garros, six of the eight women who won the toss chose to serve.\u003c/p\u003e\u003cp\u003eSome big servers defer, perhaps believing they will win their serve anyway, so why not try to catch their opponent cold? \u003ca data-player-guid=\"59785389-c37d-e25a-2d8d-2b92f427085e\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=2952\"\u003eReilly Opelka\u003c/a\u003e, at 6-foot-11 one of the tallest players on the tour, chose to receive in both his matches this year at Roland Garros.\u003c/p\u003e\u003cp\u003e\u003ca data-player-guid=\"c91d133a-526a-ea8d-654c-7ef6915ad63b\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=3038\"\u003eAryna Sabalenka\u003c/a\u003e and Gauff, who have struggled on serve at times in their careers, choose to serve first as a rule. \u003ca data-player-guid=\"63d63db4-882a-e1c0-6866-76a42b089c46\" href=\"http://www.espn.com/sports/tennis/players/profile?playerId=1556\"\u003eMadison Keys\u003c/a\u003e, who won her first Grand Slam title at the Australian Open this year, generally chooses to receive, although she\u0026#39;s flexible.\u003c/p\u003e\u003cp\u003e\u0026#34;Sometimes I like to receive just because I think coming out and serving first, sometimes there\u0026#39;s some nerves,\u0026#34; she said. \u0026#34;I think there\u0026#39;s a lot of opportunity that you can get up an early break, potentially.\u003c/p\u003e\u003cp\u003e\u0026#34;[But] honestly, it kind of just depends. I\u0026#39;ve served first [as in the fourth-round win at Roland Garros on Monday], I\u0026#39;ve returned first. It doesn\u0026#39;t truly matter. But I think sometimes I kind of like the opportunity to just really get some good swings and some good hits before I have to serve first.\u0026#34;\u003c/p\u003e\u003cp\u003eAustralian \u003ca href=\"https://www.espn.com/tennis/player/_/id/214/samantha-stosur\"\u003eSam Stosur\u003c/a\u003e, the former US Open champion whose serve was a huge part of her game, said she would always play to her strengths. \u0026#34;I served first for 99 percent of my career,\u0026#34; she said. \u0026#34;It was only the last maybe year or so where I was like, \u0026#39;Oh, maybe I should change things up and return every now and then.\u0026#39; It depended on the day, the opponent, how I was feeling. But usually I never ever entertained not serving first.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ca data-player-guid=\"dc08ff13-644e-fa3a-32ee-fc27a300b90a\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=2191\"\u003eDaria Kasatkina\u003c/a\u003e, who reached the last 16 at Roland Garros in her first major since changing allegiance from Russia to Australia earlier this year, said she almost always returns serve. \u003ca href=\"https://www.espn.com/tennis/player/_/id/2651/alex-de-minaur\"\u003eAlex de Minaur\u003c/a\u003e, Australia\u0026#39;s top-ranked men\u0026#39;s player, does the same.\u003c/p\u003e\u003cp\u003e\u0026#34;I normally always choose to receive just to apply pressure from the very first game,\u0026#34; De Minaur said. \u0026#34;But since I know it\u0026#39;s very common among players, especially on the clay [to receive], I also make sure whenever I can in practice matches to serve first sometimes just to make sure I\u0026#39;m used to it.\u0026#34;\u003c/p\u003e\u003cp\u003eThere is one other choice that\u0026#39;s not as widely known or used: to let the other player choose instead, something Croatian \u003ca data-player-guid=\"d24f948a-481d-75c9-9c3c-855364317760\" href=\"https://www.espn.com/sports/tennis/players/profile?playerId=464\"\u003eMarin Cilic\u003c/a\u003e tried in his first-round match against \u003ca href=\"https://www.espn.com/tennis/player/_/id/7602/flavio-cobolli\"\u003eFlavio Cobolli\u003c/a\u003e at Roland Garros. In that case, Cobolli chose to receive and Cilic held serve anyway.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s a psychological move and one that Burrage said would freak her out.\u003c/p\u003e\u003cp\u003e\u0026#34;I think if someone would give me the choice, I\u0026#39;d be like, \u0026#39;Wow,\u0026#39;\u0026#34; the Briton said. \u0026#34;No, no. I\u0026#39;ve never had that happen to me, thankfully.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-02T20:43:00Z",
  "modifiedTime": null
}
