{
  "id": "14702822-c8ef-453e-9316-9e1964d0d07d",
  "title": "Gauff beats Swiatek as US win United Cup",
  "link": "https://www.bbc.com/sport/tennis/articles/c3wevn18pezo",
  "description": "Coco Gauff and Taylor Fritz clinch victory for the United States over Poland in the United Cup final in Sydney.",
  "author": "",
  "published": "Sun, 05 Jan 2025 11:56:56 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 1603,
  "excerpt": "Coco Gauff and Taylor Fritz clinch victory for the United States over Poland in the United Cup final in Sydney.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Taylor Fritz got the better of Poland's Hubert Hurkacz in a third-set tie-break to clinch victory for the United States in the United Cup final in Sydney.The 6-4 5-7 7-6 (7-4) success for the world number four followed a straight-set win for Coco Gauff over Iga Swiatek in the opening women's singles match.It is the second win for the US in the mixed team event after they took the inaugural title in 2023.Gauff, the world number three, claimed a second successive win over Swiatek after beating the former world number one on her way to the WTA Finals title in Riyadh in November.The Pole, who is now world number two, took a medical timeout at 5-4 down in the second set to have strapping put on her left thigh, which has bothered her all week, and after the 6-4 6-4 defeat she left the court in tears, walking gingerly.The win continued a perfect week for Gauff, 20, who had won all six of her previous singles and doubles matches at the event as she continues her preparations for the Australian Open, which begins on 12 January in Melbourne.\"I think I have the belief that I am one of the best players in the world, and when I play good tennis, it's hard for me to be beaten,\" said Gauff, who has not lost a singles match since a defeat in October by world number one Aryna Sabalenka in the Wuhan semi-finals.\"Today I think I played great tennis, and I'm happy to get a point for my team on the board,\" she said. \"It was tough today. I'm not gonna lie.\"The second rubber proved tense but Fritz raised his level at 3-3 in the tie-break of the decider to see off his opponent and spark celebrations.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe7e/live/a5089e90-cb5c-11ef-93a8-6966a864daf4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eTaylor Fritz got the better of Poland\u0026#39;s Hubert Hurkacz in a third-set tie-break to clinch victory for the United States in the United Cup final in Sydney.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe 6-4 5-7 7-6 (7-4) success for the world number four followed a straight-set win for Coco Gauff over Iga Swiatek in the opening women\u0026#39;s singles match.\u003c/p\u003e\u003cp\u003eIt is the second win for the US in the mixed team event after they took the inaugural title in 2023.\u003c/p\u003e\u003cp\u003eGauff, the world number three, claimed a second successive win over Swiatek after beating the former world number one on her way to the WTA Finals title in Riyadh in November.\u003c/p\u003e\u003cp\u003eThe Pole, who is now world number two, took a medical timeout at 5-4 down in the second set to have strapping put on her left thigh, which has bothered her all week, and after the 6-4 6-4 defeat she left the court in tears, walking gingerly.\u003c/p\u003e\u003cp\u003eThe win continued a perfect week for Gauff, 20, who had won all six of her previous singles and doubles matches at the event as she continues her preparations for the Australian Open, which begins on 12 January in Melbourne.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;I think I have the belief that I am one of the best players in the world, and when I play good tennis, it\u0026#39;s hard for me to be beaten,\u0026#34; said Gauff, who has not lost a singles match since a defeat in October by world number one Aryna Sabalenka in the Wuhan semi-finals.\u003c/p\u003e\u003cp\u003e\u0026#34;Today I think I played great tennis, and I\u0026#39;m happy to get a point for my team on the board,\u0026#34; she said. \u0026#34;It was tough today. I\u0026#39;m not gonna lie.\u0026#34;\u003c/p\u003e\u003cp\u003eThe second rubber proved tense but Fritz raised his level at 3-3 in the tie-break of the decider to see off his opponent and spark celebrations.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-05T11:56:56.952Z",
  "modifiedTime": null
}
