{
  "id": "1b329d0d-613e-495b-b382-2cfcce381d89",
  "title": "How can Raducanu stun the 'Queen of Clay'?",
  "link": "https://www.bbc.com/sport/tennis/articles/c5y6dm133evo",
  "description": "Emma Raducanu has never beaten Iga Swiatek. How does she go about shocking the 'Queen of Clay' in the French Open second round?",
  "author": "",
  "published": "Tue, 27 May 2025 17:18:15 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 5075,
  "excerpt": "Emma Raducanu has never beaten Iga Swiatek. How does she go about shocking the 'Queen of Clay' in the French Open second round?",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "How can Raducanu stun the 'Queen of Clay'?Image source, Getty ImagesImage caption, Emma Raducanu has lost all four of her previous matches against Iga SwiatekRaducanu v Swiatek - French Open 2025Date: 29 May Venue: Court Philippe Chatrier, Roland GarrosCoverage: Live radio commentary on 5 Live Sport and BBC Sounds, plus live text commentary on the BBC Sport website and appEyes were inevitably drawn to the possibility of Emma Raducanu facing four-time champion Iga Swiatek in the French Open second round when the draw was made last week.Even Britain's Raducanu admitted she could not avoid the talk of what might lie ahead.The 22-year-old showed physical and mental resilience to beat Wang Xinyu on Monday - but victory over Swiatek, nicknamed the 'Queen of Clay', in Paris is one of the toughest tasks in the women's game.\"It's a tall mountain to climb,\" said former British number one Annabel Croft, who will be covering the match for BBC Radio 5 Live.\"But it's not a foregone conclusion because Swiatek has suffered a lot of losses this year.\"Before the pair meet at about 15:30 BST on Wednesday, BBC Sport analyses how Raducanu can cause a shock against the world number five.Put Swiatek's forehand under pressureSince claiming her first French Open title as a teenager in 2020, Swiatek has built a formidable record on the Paris clay.She has won four of the past five tournaments - and the statistics underline her dominance:22 victories in a row36 wins in 38 French Open matchesZero defeats since 2021However, the 23-year-old's reign is under more threat than ever.Swiatek has not reached a final since her title triumph in Paris last year and had, by her high standards, a below-par clay-court swing.\"She has a real problem with her forehand down the line, and players know that,\" former Wimbledon champion Pat Cash told BBC Radio 5 Live before the tournament.\"She might be able to get away with it on clay because she's so fast and can keep pulling players out of position. \"But it is a real liability on other surfaces and now it's a problem on the clay.\"She'll hit one, miss one, hit one, miss one; you can't do that. You need to be hitting 20 points in a row before you make the mistake.\"Media caption, 'Her game is a mess' - How can Swiatek return to form?One of the biggest natural strengths in Raducanu's game has been her backhand, but the forehand has become an increasingly useful weapon.\"I think her forehand has developed into one of the best aspects of her game,\" Croft said.\"I really like the cross-court forehand - it has height, it travels and she is dangerous on the run with it.\"But against an athlete like Swiatek, more of them generally come back.\"Be aggressive and try to control the pointRaducanu, who has climbed up to 41st in the rankings after an encouraging few months, has previously had little joy against Swiatek.The 2021 US Open champion has lost all four of their previous meetings - twice on indoor clay in Stuttgart, and twice on hard courts at Indian Wells and this year's Australian Open.The 6-1 6-0 defeat in Melbourne was particularly chastening, with Swiatek's groundstrokes proving too powerful and precise for Raducanu.\"She gets really fired up when she plays me - I don't know why that is but she's always played really well,\" Raducanu told BBC Sport.\"I'm not sure if it is a me thing but every time we have played she has been high level.\"Raducanu has improved in the four months since they last met, but the way she was outclassed by world number two Coco Gauff on the Madrid clay showed the gap she still has to bridge.\"Against a top quality opponent who is not going to go away psychologically, that's where you are going to see where Raducanu's game is at,\" said Croft.\"She knows she has to come out and be aggressive against Swiatek. She won't get away with just pushing the ball around. \"She will need to get the first strike in and will also need to get depth – or angle - to try and control the point. \"If you start to play catch-up against Swiatek in a rally you will come out second best.\"Show her improved fitness and resilienceRaducanu was criticised earlier in her career for seemingly not being tough enough to get through matches when she was not feeling 100%.She has made encouraging strides with her fitness this season and developed greater trust in her body.That has provided the base for Raducanu to show more resilience in deciding sets, as she did successfully against Wang.\"I have had a lot more three-set matches this year and come out successful more than in the past, which gives me more confidence,\" Raducanu said.Raducanu woke up feeling \"sick\" before her first-round match and any hint she is lacking energy on Wednesday will be exposed by Swiatek.But she offered a reassuring update in her post-match news conference.\"I feel better. I had a good amount of food,\" added the former world number 10.\"I think it was also maybe just an earlier wake-up than usual for me. Maybe my body was just lagging a little bit.\"After a good feed and some rest, I think I'll probably be OK.\"More on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHow can Raducanu stun the \u0026#39;Queen of Clay\u0026#39;?\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Emma Raducanu and Iga Swiatek after their match at Indian Wells in 2023\" src=\"https://ichef.bbci.co.uk/ace/standard/2560/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/d2d3/live/3cf0e5d0-3afe-11f0-9a86-f7906cd4e14e.jpg 976w\" width=\"2560\" height=\"1439.3611615245009\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eEmma Raducanu has lost all four of her previous matches against Iga Swiatek\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRaducanu v Swiatek - French Open 2025\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDate:\u003c/b\u003e 29 May \u003cb\u003eVenue:\u003c/b\u003e Court Philippe Chatrier, Roland Garros\u003c/p\u003e\u003cp\u003e\u003cb\u003eCoverage:\u003c/b\u003e Live radio commentary on 5 Live Sport and BBC Sounds, plus live text commentary on the BBC Sport website and app\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEyes were inevitably drawn to the possibility of Emma Raducanu facing four-time champion Iga Swiatek in the French Open second round when the draw was made last week.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eEven Britain\u0026#39;s Raducanu admitted she could not avoid the talk of what might lie ahead.\u003c/p\u003e\u003cp\u003eThe 22-year-old showed physical and mental resilience to beat Wang Xinyu on Monday - but victory over Swiatek, nicknamed the \u0026#39;Queen of Clay\u0026#39;, in Paris is one of the toughest tasks in the women\u0026#39;s game.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a tall mountain to climb,\u0026#34; said former British number one Annabel Croft, who will be covering the match for BBC Radio 5 Live.\u003c/p\u003e\u003cp\u003e\u0026#34;But it\u0026#39;s not a foregone conclusion because Swiatek has suffered a lot of losses this year.\u0026#34;\u003c/p\u003e\u003cp\u003eBefore the pair meet at about 15:30 BST on Wednesday, BBC Sport analyses how Raducanu can cause a shock against the world number five.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Put-Swiateks-forehand-under-pressure\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003ePut Swiatek\u0026#39;s forehand under pressure\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSince claiming her first French Open title as a teenager in 2020, Swiatek has built a formidable record on the Paris clay.\u003c/p\u003e\u003cp\u003eShe has won four of the past five tournaments - and the statistics underline her dominance:\u003c/p\u003e\u003cdiv\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003e22 victories in a row\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003e36 wins in 38 French Open matches\u003c/p\u003e\u003c/li\u003e\u003cli\u003e\u003cp\u003eZero defeats since 2021\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eHowever, the 23-year-old\u0026#39;s reign is \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cx262jd2x83o\"\u003eunder more threat than ever.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eSwiatek has not reached a final since her title triumph in Paris last year and had, by her high standards, a below-par clay-court swing.\u003c/p\u003e\u003cp\u003e\u0026#34;She has a real problem with her forehand down the line, and players know that,\u0026#34; former Wimbledon champion Pat Cash told BBC Radio 5 Live before the tournament.\u003c/p\u003e\u003cp\u003e\u0026#34;She might be able to get away with it on clay because she\u0026#39;s so fast and can keep pulling players out of position. \u003c/p\u003e\u003cp\u003e\u0026#34;But it is a real liability on other surfaces and now it\u0026#39;s a problem on the clay.\u003c/p\u003e\u003cp\u003e\u0026#34;She\u0026#39;ll hit one, miss one, hit one, miss one; you can\u0026#39;t do that. You need to be hitting 20 points in a row before you make the mistake.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"media-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;Her game is a mess\u0026#39; - How can Swiatek return to form?\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOne of the biggest natural strengths in Raducanu\u0026#39;s game has been her backhand, but the forehand has become an increasingly useful weapon.\u003c/p\u003e\u003cp\u003e\u0026#34;I think her forehand has developed into one of the best aspects of her game,\u0026#34; Croft said.\u003c/p\u003e\u003cp\u003e\u0026#34;I really like the cross-court forehand - it has height, it travels and she is dangerous on the run with it.\u003c/p\u003e\u003cp\u003e\u0026#34;But against an athlete like Swiatek, more of them generally come back.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Be-aggressive-and-try-to-control-the-point\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eBe aggressive and try to control the point\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRaducanu, who has climbed up to 41st in the rankings after an encouraging few months, has previously had little joy against Swiatek.\u003c/p\u003e\u003cp\u003eThe 2021 US Open champion has lost all four of their previous meetings - twice on indoor clay in Stuttgart, and twice on hard courts at Indian Wells and this year\u0026#39;s Australian Open.\u003c/p\u003e\u003cp\u003eThe 6-1 6-0 defeat in Melbourne was particularly chastening, with Swiatek\u0026#39;s groundstrokes proving too powerful and precise for Raducanu.\u003c/p\u003e\u003cp\u003e\u0026#34;She gets really fired up when she plays me - I don\u0026#39;t know why that is but she\u0026#39;s always played really well,\u0026#34; Raducanu told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m not sure if it is a me thing but every time we have played she has been high level.\u0026#34;\u003c/p\u003e\u003cp\u003eRaducanu has improved in the four months since they last met, but the way she was outclassed by world number two Coco Gauff on the Madrid clay showed the gap she still has to bridge.\u003c/p\u003e\u003cp\u003e\u0026#34;Against a top quality opponent who is not going to go away psychologically, that\u0026#39;s where you are going to see where Raducanu\u0026#39;s game is at,\u0026#34; said Croft.\u003c/p\u003e\u003cp\u003e\u0026#34;She knows she has to come out and be aggressive against Swiatek. She won\u0026#39;t get away with just pushing the ball around.  \u003c/p\u003e\u003cp\u003e\u0026#34;She will need to get the first strike in and will also need to get depth – or angle - to try and control the point. \u003c/p\u003e\u003cp\u003e\u0026#34;If you start to play catch-up against Swiatek in a rally you will come out second best.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Show-her-improved-fitness-and-resilience\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eShow her improved fitness and resilience\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRaducanu was criticised earlier in her career for seemingly not being tough enough to get through matches when she was not feeling 100%.\u003c/p\u003e\u003cp\u003eShe has made encouraging strides with her fitness this season and developed greater trust in her body.\u003c/p\u003e\u003cp\u003eThat has provided the base for Raducanu to show more resilience in deciding sets, as she did successfully against Wang.\u003c/p\u003e\u003cp\u003e\u0026#34;I have had a lot more three-set matches this year and come out successful more than in the past, which gives me more confidence,\u0026#34; Raducanu said.\u003c/p\u003e\u003cp\u003eRaducanu woke up feeling \u0026#34;sick\u0026#34; before her first-round match and any hint she is lacking energy on Wednesday will be exposed by Swiatek.\u003c/p\u003e\u003cp\u003eBut she offered a reassuring update in her post-match news conference.\u003c/p\u003e\u003cp\u003e\u0026#34;I feel better. I had a good amount of food,\u0026#34; added the former world number 10.\u003c/p\u003e\u003cp\u003e\u0026#34;I think it was also maybe just an earlier wake-up than usual for me. Maybe my body was just lagging a little bit.\u003c/p\u003e\u003cp\u003e\u0026#34;After a good feed and some rest, I think I\u0026#39;ll probably be OK.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003c/li\u003e\u003cli\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-27T17:18:15.214Z",
  "modifiedTime": null
}
