{
  "id": "345fb563-9147-4994-b7c3-14df72e3928f",
  "title": "Skupski honoured in front of more than 100,000 fans at LSU football game",
  "link": "https://www.atptour.com/en/news/skupski-lsu-november-2024",
  "description": "Although Neal Skupski has reached lofty heights in the sport, he does not have difficulty remembering where his tennis journey gathered pace: at Louisiana State University. The Briton, who earned three All-American honors during his time at college, returned to LSU on Saturday. Skupski was commended for his efforts at LSU's home football game against Vanderbilt. With 102,086 fans in attendance, Skupski also blasted t-shirts into the crowd. “The ceremony has been amazing,” Skupski said. “This is my first time being on the field at LSU. To come back to LSU and celebrate me getting to World No. 1 and winning Wimbledon three times, it is really nice to be back. I saw family and friends and the tennis team.\" Neal Skupski fires off t-shirts to LSU fans Saturday. Credit: Gianpaolo Nicolosi Skupski, the former No. 1 in the PIF ATP Doubles Rankings, partnered American Desirae Krawczyk to win the Wimbledon mixed doubles title in 2021 and 2022. Skupski and Wesley Koolhof won the Wimbledon men's doubles crown in 2023. Having partnered fellow LSU alumnus Michael Venus to two ATP Tour titles this season, Skupski will join forces with countryman Joe Salisbury for the 2025 campaign. \"We are looking forward to 2025 and the new partnership with Joe Salisbury,” Skupski added. “I think it is going to be good. We are good friends. We’ve known each other for a long time and I think it has been a partnership in the making. Looking forward to getting started down in Australia in January and see what happens.”   [NEWSLETTER FORM]",
  "author": "",
  "published": "Tue, 26 Nov 2024 19:53:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Player News",
    "2024",
    "Neal Skupski",
    "Doubles"
  ],
  "byline": "",
  "length": 1761,
  "excerpt": "Although Neal Skupski has reached lofty heights in the sport, he doesn’t have difficulty remembering where it all began for him at Louisiana State University.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Player News Former No. 1 in the PIF ATP Doubles rankings commended on field November 26, 2024 Gianpaolo Nicolosi Neal Skupski honoured at the LSU football game Saturday night. By ATP Staff Although Neal Skupski has reached lofty heights in the sport, he does not have difficulty remembering where his tennis journey gathered pace: at Louisiana State University. The Briton, who earned three All-American honors during his time at college, returned to LSU on Saturday. Skupski was commended for his efforts at LSU's home football game against Vanderbilt. With 102,086 fans in attendance, Skupski also blasted t-shirts into the crowd. “The ceremony has been amazing,” Skupski said. “This is my first time being on the field at LSU. To come back to LSU and celebrate me getting to World No. 1 and winning Wimbledon three times, it is really nice to be back. I saw family and friends and the tennis team.\" Neal Skupski fires off t-shirts to LSU fans Saturday. Credit: Gianpaolo Nicolosi Skupski, the former No. 1 in the PIF ATP Doubles Rankings, partnered American Desirae Krawczyk to win the Wimbledon mixed doubles title in 2021 and 2022. Skupski and Wesley Koolhof won the Wimbledon men's doubles crown in 2023. Having partnered fellow LSU alumnus Michael Venus to two ATP Tour titles this season, Skupski will join forces with countryman Joe Salisbury for the 2025 campaign. \"We are looking forward to 2025 and the new partnership with Joe Salisbury,” Skupski added. “I think it is going to be good. We are good friends. We’ve known each other for a long time and I think it has been a partnership in the making. Looking forward to getting started down in Australia in January and see what happens.”",
  "image": "https://www.atptour.com/-/media/images/news/2024/11/26/19/40/skupski-lsu-2024-november.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003ePlayer News\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eFormer No. 1 in the PIF ATP Doubles rankings commended on field\u003c/p\u003e\n    \u003cp\u003eNovember 26, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/11/26/19/40/skupski-lsu-2024-november.jpg\" alt=\"Neal Skupski honoured at the LSU football game Saturday night.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eGianpaolo Nicolosi\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eNeal Skupski honoured at the LSU football game Saturday night.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eAlthough \u003ca href=\"https://www.atptour.com/en/players/neal-skupski/sl22/overview\"\u003eNeal Skupski\u003c/a\u003e has reached lofty heights in the sport, he does not have difficulty remembering where his tennis journey gathered pace: at Louisiana State University.\u003c/p\u003e\n\u003cp\u003eThe Briton, who earned three All-American honors during his time at college, returned to LSU on Saturday. Skupski was commended for his efforts at LSU\u0026#39;s home football game against Vanderbilt. With 102,086 fans in attendance, Skupski also blasted t-shirts into the crowd.\u003c/p\u003e\n\u003cp\u003e“The ceremony has been amazing,” Skupski said. “This is my first time being on the field at LSU. To come back to LSU and celebrate me getting to World No. 1 and winning \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e three times, it is really nice to be back. I saw family and friends and the tennis team.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/neal-skupski/sl22/overview\u0026#39;\u0026gt;Neal Skupski\u0026lt;/a\u0026gt; fires off t-shirts to LSU fans.\" src=\"https://www.atptour.com/-/media/images/news/2024/11/26/19/41/skupski-lsu-2024-november-tshirtgun.jpg\"/\u003e\u003cbr/\u003e\u003cem\u003e\u003csup\u003e\u003ca href=\"https://www.atptour.com/en/players/neal-skupski/sl22/overview\"\u003eNeal Skupski\u003c/a\u003e fires off t-shirts to LSU fans Saturday. Credit: Gianpaolo Nicolosi\u003c/sup\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eSkupski, the former No. 1 in the PIF ATP Doubles Rankings, partnered American Desirae Krawczyk to win the \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e mixed doubles title in 2021 and 2022. Skupski and \u003ca href=\"https://www.atptour.com/en/players/wesley-koolhof/kc41/overview\"\u003eWesley Koolhof\u003c/a\u003e won the \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e men\u0026#39;s doubles crown in 2023.\u003c/p\u003e\n\u003cp\u003eHaving partnered fellow LSU alumnus \u003ca href=\"https://www.atptour.com/en/players/michael-venus/v576/overview\"\u003eMichael Venus\u003c/a\u003e to two ATP Tour titles this season, Skupski will join forces with countryman \u003ca href=\"https://www.atptour.com/en/players/joe-salisbury/so70/overview\"\u003eJoe Salisbury\u003c/a\u003e for the 2025 campaign.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We are looking forward to 2025 and the new partnership with \u003ca href=\"https://www.atptour.com/en/players/joe-salisbury/so70/overview\"\u003eJoe Salisbury\u003c/a\u003e,” Skupski added. “I think it is going to be good. We are good friends. We’ve known each other for a long time and I think it has been a partnership in the making. Looking forward to getting started down in Australia in January and see what happens.”\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
