{
  "id": "53465ecf-9880-491d-b76d-28069a7a94ff",
  "title": "Hurkacz propels Poland to verge of United Cup final",
  "link": "https://www.atptour.com/en/news/poland-kazakhstan-united-cup-2025-sf",
  "description": "Hubert Hurkacz continued his short and long-term redemption at the United Cup in Sydney Saturday, dismissing Alexander Shevchenko 6-3, 6-2 to take Poland to the cusp of its second consecutive final. After losing both his singles matches in group play to Casper Ruud and Tomas Machac, Hurkacz backed up his quarter-final win over Billy Harris with a 58-minute victory over the Kazakhstani to set things up for World No. 2 teammate Iga Swiatek, who now plays former Wimbledon champion Elena Rybakina. Hurkacz last year held two championship points in the tournament final against Alexander Zverev only to see the current World No. 2 rally to a comeback win and then team with Laura Siegemund to beat him and Swiatek in the deciding mixed doubles. “The last match here gave me a little bit of confidence and I’ve been playing better with every single match,” Hurkacz said. [ATP APP] After struggling against the weight of shot in his defeats to Ruud and Machac, World No. 16 Hurkacz was the one to dictate from the baseline against Shevchenko. He was also dominated on serve, putting 76 per cent of his first deliveries into play, winning 80 per cent of first-serve points and 73 per cent of second-serve points.   Shevchenko played his best tennis early in the second set when he had more success moving Hurkacz out of the centre of the court, but after missing a 30-all opportunity in the fourth game, he made three unforced errors to get broken to love in the following game and never recovered. Hurkacz now leads Shevchenko 4-0 in their Lexus ATP Head2Head series.   [NEWSLETTER FORM]",
  "author": "",
  "published": "Sat, 04 Jan 2025 00:04:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "United Cup",
    "2025",
    "Hubert Hurkacz"
  ],
  "byline": "",
  "length": 1862,
  "excerpt": "United Cup",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "United Cup Swiatek has chance to book Poles' ticket to Sunday's final January 04, 2025 Peter Staples/ATP Tour Hubert Hurkacz drops just five games in a commanding win over Alexander Shevchenko in the United Cup semi-finals. By ATP/WTA Staff Hubert Hurkacz continued his short and long-term redemption at the United Cup in Sydney Saturday, dismissing Alexander Shevchenko 6-3, 6-2 to take Poland to the cusp of its second consecutive final. After losing both his singles matches in group play to Casper Ruud and Tomas Machac, Hurkacz backed up his quarter-final win over Billy Harris with a 58-minute victory over the Kazakhstani to set things up for World No. 2 teammate Iga Swiatek, who now plays former Wimbledon champion Elena Rybakina. Hurkacz last year held two championship points in the tournament final against Alexander Zverev only to see the current World No. 2 rally to a comeback win and then team with Laura Siegemund to beat him and Swiatek in the deciding mixed doubles. “The last match here gave me a little bit of confidence and I’ve been playing better with every single match,” Hurkacz said. After struggling against the weight of shot in his defeats to Ruud and Machac, World No. 16 Hurkacz was the one to dictate from the baseline against Shevchenko. He was also dominated on serve, putting 76 per cent of his first deliveries into play, winning 80 per cent of first-serve points and 73 per cent of second-serve points. Shevchenko played his best tennis early in the second set when he had more success moving Hurkacz out of the centre of the court, but after missing a 30-all opportunity in the fourth game, he made three unforced errors to get broken to love in the following game and never recovered. Hurkacz now leads Shevchenko 4-0 in their Lexus ATP Head2Head series.",
  "image": "https://www.atptour.com/-/media/images/news/2025/01/04/00/50/hurkacz-sydney-2025-saturday-2a.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eUnited Cup\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eSwiatek has chance to book Poles\u0026#39; ticket to Sunday\u0026#39;s final\u003c/p\u003e\n    \u003cp\u003eJanuary 04, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/01/04/00/50/hurkacz-sydney-2025-saturday-2a.jpg\" alt=\"Hubert Hurkacz drops just five games in a commanding win over Alexander Shevchenko in the United Cup semi-finals.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003ePeter Staples/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eHubert Hurkacz drops just five games in a commanding win over Alexander Shevchenko in the United Cup semi-finals.\u003c/span\u003e\n        \u003cspan\u003eBy ATP/WTA Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/hubert-hurkacz/hb71/overview\"\u003eHubert Hurkacz\u003c/a\u003e continued his short and long-term redemption at the \u003ca href=\"https://www.atptour.com/en/scores/archive/perth-sydney/9900/2024/results\"\u003eUnited Cup\u003c/a\u003e in Sydney Saturday, dismissing \u003ca href=\"https://www.atptour.com/en/players/alexander-shevchenko/s0h2/overview\"\u003eAlexander Shevchenko\u003c/a\u003e 6-3, 6-2 to take Poland to the cusp of its second consecutive final.\u003c/p\u003e\n\u003cp\u003eAfter losing both his singles matches in group play to \u003ca href=\"https://www.atptour.com/en/players/casper-ruud/rh16/overview\"\u003eCasper Ruud\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/tomas-machac/m0fh/overview\"\u003eTomas Machac\u003c/a\u003e, Hurkacz backed up his quarter-final win over \u003ca href=\"https://www.atptour.com/en/players/billy-harris/hd68/overview\"\u003eBilly Harris\u003c/a\u003e with a 58-minute victory over the Kazakhstani to set things up for World No. 2 teammate Iga Swiatek, who now plays former \u003ca href=\"https://www.atptour.com/en/scores/archive/wimbledon/540/2024/results\"\u003eWimbledon\u003c/a\u003e champion Elena Rybakina.\u003c/p\u003e\n\u003cp\u003eHurkacz last year held two championship points in the tournament final against \u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e only to see the current World No. 2 rally to a comeback win and then team with Laura Siegemund to beat him and Swiatek in the deciding mixed doubles.\u003c/p\u003e\n\u003cp\u003e“The last match here gave me a little bit of confidence and I’ve been playing better with every single match,” Hurkacz said.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAfter struggling against the weight of shot in his defeats to Ruud and Machac, World No. 16 Hurkacz was the one to dictate from the baseline against Shevchenko. He was also dominated on serve, putting 76 per cent of his first deliveries into play, winning 80 per cent of first-serve points and 73 per cent of second-serve points.\u003c/p\u003e\n\n\n\u003cp\u003eShevchenko played his best tennis early in the second set when he had more success moving Hurkacz out of the centre of the court, but after missing a 30-all opportunity in the fourth game, he made three unforced errors to get broken to love in the following game and never recovered.\u003c/p\u003e\n\u003cp\u003eHurkacz now leads Shevchenko 4-0 in their Lexus ATP Head2Head series.\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
