{
  "id": "6e00aee4-f20b-4eda-a548-776e425aca63",
  "title": "Alcaraz, Djokovic eager for eighth career meeting in AO QFs",
  "link": "https://www.atptour.com/en/news/alcaraz-djokovic-rivalry-australian-open-2025",
  "description": "Carlos Alcaraz will look to claim his first hard-court win over Novak Djokovic when the rivals meet in the quarter-finals of the Australian Open on Tuesday. Alcaraz has three wins in seven career Lexus ATP Head2Head meetings against his fellow former World No. 1, but is 0-2 in meetings on hard. The most memorable of those two meetings came in the final of the Cincinnati Open in 2023, when Djokovic saved a championship point to win 5-7, 7-6(7), 7-6(7) in a draining three hours and 49 minutes, the longest best-of-three-set final in ATP Masters 1000 history (since 1990). \"Definitely one of the toughest matches I have played in my life,\" said the Serbian, who avenged his five-set loss to Alcaraz in the Wimbledon final. \"This rivalry just keeps getting better and better.\" Tuesday’s quarter-final on Rod Laver Arena will be their first meeting before the semi-finals at any tournament and first hard-court clash at a major. It will also be a remarkable moment for the ATP No. 1 Club, with former No. 1s Andy Murray and Juan Carlos Ferrero coaching Djokovic and Alcaraz respectively. Alcaraz, 21, and Djokovic, 37, split their two meetings last year, the Spaniard winning on grass in the Wimbledon final for the second consecutive year before Djokovic had his revenge on clay in the final of the Paris Olympics, his lone title of the year. Asked if his game plan against Djokovic altered significantly between clay, grass and hard, Alcaraz said, \"Not really. I change my game a little bit. It's not going to be the same game style when I'm playing on grass or clay court obviously. “I think everybody has their weakness. It doesn't matter if we we’re playing one surface or another, we are going to still having the same weakness. What weakness Novak has? Just few or none. I know what I have to do on clay, on hard court, on grass. This is going to be the first time that I am playing against him in a Grand Slam on hard court, so let's see.” Alcaraz has never tasted successive wins against Djokovic; the Serbian claimed back-to-back victories once: in Cincinnati and the Nitto ATP Finals in 2023. The 24-time Grand Slam champion, who is chasing his 100th title at the Australian Open, said that adding another victory to his win column against Alcaraz will not be easy. \"I'm expecting a big battle, as it's the case in most of our matches where we faced each other,\" Djokovic said. \"Maybe just couple times it was quite one-sided. Wimbledon finals last year, he was the dominant force on the court. I had a really good match against him in the [Nitto ATP Finals] in 2023. \"Other than that, we had some long battles, long exchanges kind of matches that I played against him. Remind me of my matchups versus Nadal in terms of the intensity and the energy on the court. \"He's very dynamic, explosive player. Incredibly talented. Charismatic player. Great to watch; not that great to play against (smiling). \"I look forward to it. I think when the draw was out, a lot of the people were looking forward to potential matchup in quarter-finals, Alcaraz versus me. So here we are. I think we both are hitting the ball pretty well this tournament. I like the way I'm playing and the way I'm feeling last couple matches. I'm excited about that challenge.\"   [NEWSLETTER FORM]",
  "author": "",
  "published": "Sun, 19 Jan 2025 13:09:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Australian Open",
    "Rivalries",
    "2025",
    "Novak Djokovic",
    "Carlos Alcaraz"
  ],
  "byline": "",
  "length": 3588,
  "excerpt": "Carlos Alcaraz will look to claim his first hard-court win over Novak Djokovic when the rivals meet in the quarter-finals of the Australian Open on Tuesday.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Australian Open Spaniard seeks his first win on hard court against his fellow former World No. 1. January 19, 2025 Peter Staples/ATP Tour Novak Djokovic has won four of seven career meetings against Carlos Alcaraz, including both clashes on hard court. By ATP Staff Carlos Alcaraz will look to claim his first hard-court win over Novak Djokovic when the rivals meet in the quarter-finals of the Australian Open on Tuesday. Alcaraz has three wins in seven career Lexus ATP Head2Head meetings against his fellow former World No. 1, but is 0-2 in meetings on hard. The most memorable of those two meetings came in the final of the Cincinnati Open in 2023, when Djokovic saved a championship point to win 5-7, 7-6(7), 7-6(7) in a draining three hours and 49 minutes, the longest best-of-three-set final in ATP Masters 1000 history (since 1990). \"Definitely one of the toughest matches I have played in my life,\" said the Serbian, who avenged his five-set loss to Alcaraz in the Wimbledon final. \"This rivalry just keeps getting better and better.\" Tuesday’s quarter-final on Rod Laver Arena will be their first meeting before the semi-finals at any tournament and first hard-court clash at a major. It will also be a remarkable moment for the ATP No. 1 Club, with former No. 1s Andy Murray and Juan Carlos Ferrero coaching Djokovic and Alcaraz respectively. Alcaraz, 21, and Djokovic, 37, split their two meetings last year, the Spaniard winning on grass in the Wimbledon final for the second consecutive year before Djokovic had his revenge on clay in the final of the Paris Olympics, his lone title of the year. Asked if his game plan against Djokovic altered significantly between clay, grass and hard, Alcaraz said, \"Not really. I change my game a little bit. It's not going to be the same game style when I'm playing on grass or clay court obviously. “I think everybody has their weakness. It doesn't matter if we we’re playing one surface or another, we are going to still having the same weakness. What weakness Novak has? Just few or none. I know what I have to do on clay, on hard court, on grass. This is going to be the first time that I am playing against him in a Grand Slam on hard court, so let's see.” Alcaraz has never tasted successive wins against Djokovic; the Serbian claimed back-to-back victories once: in Cincinnati and the Nitto ATP Finals in 2023. The 24-time Grand Slam champion, who is chasing his 100th title at the Australian Open, said that adding another victory to his win column against Alcaraz will not be easy. \"I'm expecting a big battle, as it's the case in most of our matches where we faced each other,\" Djokovic said. \"Maybe just couple times it was quite one-sided. Wimbledon finals last year, he was the dominant force on the court. I had a really good match against him in the [Nitto ATP Finals] in 2023. \"Other than that, we had some long battles, long exchanges kind of matches that I played against him. Remind me of my matchups versus Nadal in terms of the intensity and the energy on the court. \"He's very dynamic, explosive player. Incredibly talented. Charismatic player. Great to watch; not that great to play against (smiling). \"I look forward to it. I think when the draw was out, a lot of the people were looking forward to potential matchup in quarter-finals, Alcaraz versus me. So here we are. I think we both are hitting the ball pretty well this tournament. I like the way I'm playing and the way I'm feeling last couple matches. I'm excited about that challenge.\"",
  "image": "https://www.atptour.com/-/media/images/news/2025/01/19/10/18/djokovic-alcaraz-rivalry-ao-2025.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eAustralian Open\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eSpaniard seeks his first win on hard court against his fellow former World No. 1.\u003c/p\u003e\n    \u003cp\u003eJanuary 19, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/01/19/10/18/djokovic-alcaraz-rivalry-ao-2025.jpg\" alt=\"Novak Djokovic has won four of seven career meetings against Carlos Alcaraz, including both clashes on hard court.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003ePeter Staples/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eNovak Djokovic has won four of seven career meetings against Carlos Alcaraz, including both clashes on hard court.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e will look to claim his first hard-court win over \u003ca href=\"https://www.atptour.com/en/players/novak-djokovic/d643/overview\"\u003eNovak Djokovic\u003c/a\u003e when the rivals meet in the quarter-finals of the \u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e on Tuesday.\u003c/p\u003e\n\u003cp\u003eAlcaraz has three wins in seven career Lexus ATP Head2Head meetings against his fellow former World No. 1, but is 0-2 in meetings on hard. \u003c/p\u003e\n\u003cp\u003eThe most memorable of those two meetings came in the final of the \u003ca href=\"https://www.atptour.com/en/tournaments/cincinnati/422/overview\"\u003eCincinnati Open\u003c/a\u003e in 2023, when Djokovic saved a championship point to win 5-7, 7-6(7), 7-6(7) in a draining three hours and 49 minutes, the longest best-of-three-set final in ATP Masters 1000 history (since 1990).\u003c/p\u003e\n\u003cp\u003e\u0026#34;Definitely one of the toughest matches I have played in my life,\u0026#34; said the Serbian, who avenged his five-set loss to Alcaraz in the \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e final. \u0026#34;This rivalry just keeps getting better and better.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/news/it-all-adds-up-hub\" target=\"_blank\"\u003e\u003cimg alt=\"It All Adds Up\" src=\"https://www.atptour.com/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026amp;hash=31EE1C2D1B04C8D5532DFFA763CBA0FF\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eTuesday’s quarter-final on \u003ca href=\"https://www.atptour.com/en/players/rod-laver/l058/overview\"\u003eRod Laver\u003c/a\u003e Arena will be their first meeting before the semi-finals at any tournament and first hard-court clash at a major. It will also be a remarkable moment for the ATP No. 1 Club, with former No. 1s \u003ca href=\"https://www.atptour.com/en/players/andy-murray/mc10/overview\"\u003eAndy Murray\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/juan-carlos-ferrero/f316/overview\"\u003eJuan Carlos Ferrero\u003c/a\u003e coaching Djokovic and Alcaraz respectively.\u003c/p\u003e\n\u003cp\u003eAlcaraz, 21, and Djokovic, 37, split their two meetings last year, the Spaniard winning on grass in the \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e final for the second consecutive year before Djokovic had his revenge on clay in the final of the \u003ca href=\"https://www.atptour.com/en/scores/archive/paris/96/2024/results\"\u003eParis Olympics\u003c/a\u003e, his lone title of the year.\u003c/p\u003e\n\n\u003cp\u003eAsked if his game plan against Djokovic altered significantly between clay, grass and hard, Alcaraz said, \u0026#34;Not really. I change my game a little bit. It\u0026#39;s not going to be the same game style when I\u0026#39;m playing on grass or clay court obviously.\u003c/p\u003e\n\u003cp\u003e“I think everybody has their weakness. It doesn\u0026#39;t matter if we we’re playing one surface or another, we are going to still having the same weakness. What weakness Novak has? Just few or none. I know what I have to do on clay, on hard court, on grass. This is going to be the first time that I am playing against him in a Grand Slam on hard court, so let\u0026#39;s see.”\u003c/p\u003e\n\u003cp\u003eAlcaraz has never tasted successive wins against Djokovic; the Serbian claimed back-to-back victories once: in Cincinnati and the \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e in 2023. The 24-time Grand Slam champion, who is chasing his 100th title at the \u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e, said that adding another victory to his win column against Alcaraz will not be easy.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;m expecting a big battle, as it\u0026#39;s the case in most of our matches where we faced each other,\u0026#34; Djokovic said. \u0026#34;Maybe just couple times it was quite one-sided. \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e finals last year, he was the dominant force on the court. I had a really good match against him in the [\u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e]  in 2023. \u003c/p\u003e\n\u003cp\u003e\u0026#34;Other than that, we had some long battles, long exchanges kind of matches that I played against him. Remind me of my matchups versus Nadal in terms of the intensity and the energy on the court. \u003c/p\u003e\n\u003cp\u003e\u0026#34;He\u0026#39;s very dynamic, explosive player. Incredibly talented. Charismatic player. Great to watch; not that great to play against (smiling). \u003c/p\u003e\n\u003cp\u003e\u0026#34;I look forward to it. I think when the draw was out, a lot of the people were looking forward to potential matchup in quarter-finals, Alcaraz versus me. So here we are. I think we both are hitting the ball pretty well this tournament. I like the way I\u0026#39;m playing and the way I\u0026#39;m feeling last couple matches. I\u0026#39;m excited about that challenge.\u0026#34;\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
