{
  "id": "8230ac4e-ea25-4554-b64c-75b6fc5d70f7",
  "title": "Teenager Tien stuns Medvedev in late five-set thriller",
  "link": "https://www.bbc.com/sport/tennis/articles/cgj260386zeo",
  "description": "Fifth seed Daniil Medvedev is out of the Australian Open after losing a five-set thriller to teenager Learner Tien in the biggest upset of the tournament so far.",
  "author": "",
  "published": "Thu, 16 Jan 2025 17:03:16 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 4473,
  "excerpt": "Fifth seed Daniil Medvedev is out of the Australian Open after losing a five-set thriller to teenager Learner Tien in the biggest upset of the tournament so far.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Australian Open 2025Dates: 12-26 January Venue: Melbourne ParkCoverage: Live radio commentary on Tennis Breakfast from 07:00 GMT on BBC 5 Sports Extra, plus live text commentaries on the BBC Sport website and appFifth seed Daniil Medvedev is out of the Australian Open after losing a five-set thriller to teenager Learner Tien in the biggest upset of the tournament so far.Medvedev, a three-time finalist in Melbourne, saved match point in the third set and forced a decider, but ultimately fell to a 6-3 7-6 (7-4) 6-7 (8-10) 1-6 7-6 (10-7) defeat by the 19-year-old qualifier.American Tien, ranked 121st in the world, celebrated in front of a largely empty Margaret Court Arena after wrapping up the win at 02:54 local time in Melbourne.\"I was definitely hoping it wasn't going to a fifth-set breaker but either way I'm just really happy to get the win,\" Tien said after four hours and 49 minutes on court.\"I know I made it a lot harder than what it could have been but, you know, whatever.\"Before this week's tournament Tien had never won a Grand Slam match, losing in the first round in all three of his US Open appearances.Medvedev, who lost to Jannik Sinner in last year's final, seemed like the clear favourite to win the match after steamrolling his way through the fourth set in 27 minutes, with Tien looking fatigued.But, after a brief rain delay, the left-handed Californian dug deep to break back in the decider and force a 10-point tie-break.\"Losing the third [set] was tough after playing for that long. I had a match point so that was a little disappointing to see a fourth [set],\" Tien said.\"In the fourth set I just had to pee so bad, so I was trying to finish it up fairly quick.\"I also wanted to start the fifth [set] serving first so I scrapped out that game at 0-5 and it all worked out.\"He is the third teenager this week, after Joao Fonseca and Jakub Mensik, to have beaten a top-10 player.Fonseca stole the headlines with his first-round win over ninth seed Andrey Rublev, but it is Tien, who finished runner-up to the Brazilian in December's Next Gen ATP Finals, that has gone further of the two in Melbourne.Tien will face France's Corentin Moutet, ranked 69th, in the third round.Jannik Sinner recovered from a slow start against world number 173 Tristan Schoolkate to keep his title defence on track.Sinner, who claimed his first major title in Melbourne last year, had not dropped a set since October's Shanghai Masters.But Australian Schoolkate thrilled a partisan crowd on Rod Laver Arena when he struck at 5-4 to win the opener and end Sinner's 29-set winning streak.However, the wildcard could not keep pace with the top seed as Sinner sped through the gears to grab a 4-6 6-4 6-1 6-3 victory and a place in the third round.The 23-year-old is the youngest player to win nine successive men's singles matches at the Australian Open since Novak Djokovic between 2008 and 2009.Asked how this year felt different to his title-winning run, Sinner said: \"It's a different feeling but so many beautiful moments, on and off the court, have happened to me here. It's different but I take it as a chance to do it again.\"It's still a very, very long way to go. We go day by day. Seeing my level today we know that I can improve.\"Sinner is competing at the Australian Open for the first time since he failed two doping tests in March.His doping case will be heard at the Court of Arbitration for Sport (Cas) in April after the World Anti-Doping Agency appealed appealed against the decision to clear him.Elsewhere on Thursday, there were upsets for Frances Tiafoe and Hubert Hurkacz. Tiafoe, the American 17th seed, fell to a 6-7 (3-7) 6-4 3-6 6-4 6-1 defeat by Hungary's Fabian Marozsan, ranked 59th, while world number 51 Miomir Kecmanovic moved past 18th seed Hurkacz with a 6-4 6-4 6-2 victory.Meanwhile, Fonseca's impressive Grand Slam debut came to an end as the teenage sensation lost in five sets to Italy's Lorenzo Sonego.The 18-year-old, who Carlos Alcaraz said would be on a \"list of the best players in the world\", lost 6-7 (6-8) 6-3 6-1 3-6 6-3 to world number 55 Sonego.Australian home favourite Alex de Minaur claimed a straight-set win over American qualifier Tristan Boyer, while fourth seed Taylor Fritz needed just 82 minutes to beat Chilean qualifier Cristian Garin, dropping just three games during an impressive showing.Danish 13th seed Holger Rune battled past Italy's Matteo Berrettini with a 7-6 (7-3) 2-6 6-3 7-6 (8-6) victory.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5048/live/1243eff0-d427-11ef-943c-b5e53c85fbbb.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAustralian Open 2025\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDates:\u003c/b\u003e 12-26 January \u003cb\u003eVenue:\u003c/b\u003e Melbourne Park\u003c/p\u003e\u003cp\u003e\u003cb\u003eCoverage: \u003c/b\u003eLive radio commentary on Tennis Breakfast from 07:00 GMT on BBC 5 Sports Extra, plus live text commentaries on the BBC Sport website and app\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eFifth seed Daniil Medvedev is out of the Australian Open after losing a five-set thriller to teenager Learner Tien in the biggest upset of the tournament so far.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eMedvedev, a three-time finalist in Melbourne, saved match point in the third set and forced a decider, but ultimately fell to a 6-3 7-6 (7-4) 6-7 (8-10) 1-6 7-6 (10-7) defeat by the 19-year-old qualifier.\u003c/p\u003e\u003cp\u003eAmerican Tien, ranked 121st in the world, celebrated in front of a largely empty Margaret Court Arena after wrapping up the win at 02:54 local time in Melbourne.\u003c/p\u003e\u003cp\u003e\u0026#34;I was definitely hoping it wasn\u0026#39;t going to a fifth-set breaker but either way I\u0026#39;m just really happy to get the win,\u0026#34; Tien said after four hours and 49 minutes on court.\u003c/p\u003e\u003cp\u003e\u0026#34;I know I made it a lot harder than what it could have been but, you know, whatever.\u0026#34;\u003c/p\u003e\u003cp\u003eBefore this week\u0026#39;s tournament Tien had never won a Grand Slam match, losing in the first round in all three of his US Open appearances.\u003c/p\u003e\u003cp\u003eMedvedev, who lost to Jannik Sinner in last year\u0026#39;s final, seemed like the clear favourite to win the match after steamrolling his way through the fourth set in 27 minutes, with Tien looking fatigued.\u003c/p\u003e\u003cp\u003eBut, after a brief rain delay, the left-handed Californian dug deep to break back in the decider and force a 10-point tie-break.\u003c/p\u003e\u003cp\u003e\u0026#34;Losing the third [set] was tough after playing for that long. I had a match point so that was a little disappointing to see a fourth [set],\u0026#34; Tien said.\u003c/p\u003e\u003cp\u003e\u0026#34;In the fourth set I just had to pee so bad, so I was trying to finish it up fairly quick.\u003c/p\u003e\u003cp\u003e\u0026#34;I also wanted to start the fifth [set] serving first so I scrapped out that game at 0-5 and it all worked out.\u0026#34;\u003c/p\u003e\u003cp\u003eHe is the third teenager this week, after Joao Fonseca and Jakub Mensik, to have beaten a top-10 player.\u003c/p\u003e\u003cp\u003eFonseca stole the headlines with his first-round \u003ca href=\"https://www.bbc.com/sport/tennis/articles/c75zl9x99zqo\"\u003ewin over ninth seed Andrey Rublev\u003c/a\u003e, but it is Tien, who finished runner-up to the Brazilian in December\u0026#39;s Next Gen ATP Finals, that has gone further of the two in Melbourne.\u003c/p\u003e\u003cp\u003eTien will face France\u0026#39;s Corentin Moutet, ranked 69th, in the third round.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eJannik Sinner recovered from a slow start against world number 173 Tristan Schoolkate to keep his title defence on track.\u003c/p\u003e\u003cp\u003eSinner, who claimed his first major title in Melbourne last year, had not dropped a set since October\u0026#39;s Shanghai Masters.\u003c/p\u003e\u003cp\u003eBut Australian Schoolkate thrilled a partisan crowd on Rod Laver Arena when he struck at 5-4 to win the opener and end Sinner\u0026#39;s 29-set winning streak.\u003c/p\u003e\u003cp\u003eHowever, the wildcard could not keep pace with the top seed as Sinner sped through the gears to grab a 4-6 6-4 6-1 6-3 victory and a place in the third round.\u003c/p\u003e\u003cp\u003eThe 23-year-old is the youngest player to win nine successive men\u0026#39;s singles matches at the Australian Open since Novak Djokovic between 2008 and 2009.\u003c/p\u003e\u003cp\u003eAsked how this year felt different to his title-winning run, Sinner said: \u0026#34;It\u0026#39;s a different feeling but so many beautiful moments, on and off the court, have happened to me here. It\u0026#39;s different but I take it as a chance to do it again.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s still a very, very long way to go. We go day by day. Seeing my level today we know that I can improve.\u0026#34;\u003c/p\u003e\u003cp\u003eSinner is competing at the Australian Open for the first time since he failed two doping tests in March.\u003c/p\u003e\u003cp\u003eHis doping case will be \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cg7z9jv9x5ro\"\u003eheard at the Court of Arbitration for Sport (Cas)\u003c/a\u003e in April after the World Anti-Doping Agency appealed appealed against the decision to clear him.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eElsewhere on Thursday, there were upsets for Frances Tiafoe and Hubert Hurkacz. \u003c/p\u003e\u003cp\u003eTiafoe, the American 17th seed, fell to a 6-7 (3-7) 6-4 3-6 6-4 6-1 defeat by Hungary\u0026#39;s Fabian Marozsan, ranked 59th, while world number 51 Miomir Kecmanovic moved past 18th seed Hurkacz with a 6-4 6-4 6-2 victory.\u003c/p\u003e\u003cp\u003eMeanwhile, Fonseca\u0026#39;s impressive Grand Slam debut came to an end as the teenage sensation lost in five sets to Italy\u0026#39;s Lorenzo Sonego.\u003c/p\u003e\u003cp\u003eThe 18-year-old, who Carlos Alcaraz said would be on a \u003ca href=\"https://www.bbc.com/sport/tennis/articles/c75zl9x99zqo\"\u003e\u0026#34;list of the best players in the world\u0026#34;\u003c/a\u003e, lost 6-7 (6-8) 6-3 6-1 3-6 6-3 to world number 55 Sonego.\u003c/p\u003e\u003cp\u003eAustralian home favourite Alex de Minaur claimed a straight-set win over American qualifier Tristan Boyer, while fourth seed Taylor Fritz needed just 82 minutes to beat Chilean qualifier Cristian Garin, dropping just three games during an impressive showing.\u003c/p\u003e\u003cp\u003eDanish 13th seed Holger Rune battled past Italy\u0026#39;s Matteo Berrettini with a 7-6 (7-3) 2-6 6-3 7-6 (8-6) victory.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-01-16T11:52:03.968Z",
  "modifiedTime": null
}
