{
  "id": "8337bbf0-3d04-4eda-8558-f20f8f1b06c9",
  "title": "Schwaerzler's historic title leads five Challenger moments to remember in 2024",
  "link": "https://www.atptour.com/en/news/challenger-2024-moments-to-remember",
  "description": "To mark the end of the 2024 season, ATPTour.com highlights five moments to remember from the ATP Challenger Tour season. Schwaerzler’s historic ‘surprise’ #NextGenATP Joel Schwaerzler entered the record books at the Macedonian Open, where he became just the fourth player to win a title at that level while holding the junior No. 1 ranking. Nick Kyrgios, Taylor Fritz and Wu Yibing also accomplished the feat. “I was kind of surprised,” Schwaerzler said. “I knew I could win matches there but to actually win the tournament is something different.” The 18-year-old, who won this year’s Roland Garros boys’ doubles event alongside Norway’s Nicolai Budkov Kjaer, finished the season at No. 330 in the PIF ATP Rankings. Schwaerzler is the fourth-youngest Austrian winner in ATP Challenger Tour history. Mejia wins Challenger title in memory of late father Nearly seven years on since his father’s passing, Mejia celebrated a career milestone in April, when he won his maiden ATP Challenger Tour title in San Luis Potosi, Mexico. Following his triumph, Mejia was enthusiastic, yet emotional, as he pointed to the sky. \"Papá, papá,\" he uttered. “Every single day that goes by, I mention him, I think about him, I dream about him in my sleep because I think about him the whole time,” said the No. 219 player in the PIF ATP Rankings. “It's been the toughest battle for me to realise and know that he is physically gone forever. I feel that he's close to me every single day of my life. That's one thing that will keep me going forever because that strength he gave me is unconditional. “I think when I lifted the trophy, I was also looking to the sky as a sign of relief… I wanted to look at my dad, obviously pointing the trophy to him.” Read ATPTour.com's feature: Mejia wins Challenger title in memory of late father: ‘The pain never goes away’. Nicolas Mejia at age eight alongside his father Gustavo. Credit: Mejia Family Rwanda Challenger reflects hope \u0026 healing of a nation This year marked 30 years since the Rwanda genocide, an atrocity that claimed an estimated 500,000 to 800,000 lives. As the central African country continues to recover and rebuild, tennis is playing a small but important part of the healing process. The ATP Challenger Tour spent two weeks (26 February-10 March) in the capital city Kigali, making Rwanda the seventh African country to host an event at that level. Rather than trying to erase the dark chapter from history, the tournament adopted an alternative approach: promoting education and honouring the fallen through visits to the Kigali Genocide Memorial. More than 20 players visited the memorial. “Rwanda took a risk to organise the first big tournament in this part of the world,” tournament director Arzel Mevellec said. “It’s a very important symbol. Rwanda is a small country but with big events now. Soccer, NBA Academy Africa, and now Rwanda is on the world map of tennis and I think that’s the beginning of something huge. Rwanda can be proud about that.” Rwanda is the seventh African country to host an ATP Challenger Tour event. Credit: Rwanda Tennis Federation Champions hailing from college ranks The college pathway continues to be a vital stepping stone for many players to find success on the ATP Challenger Tour and beyond. A single-season record 27 different players with college tennis experience won titles this year, led by four-time winner Jacob Fearnley, who helped TCU capture the 2024 NCAA D1 men’s tennis championship in May before making quick progress on the Challenger Tour. The four-time ITA All-American finished the season at No. 99 in the PIF ATP Rankings, a vast improvement upon his No. 646 ranking at the start of the year. The 2023 NCAA singles champion Ethan Quinn captured his maiden Challenger title in Champaign, his final tournament of the year. Tristan Boyer (Stanford), Federico Agustin Gomez (Louisville), Alexander Ritschard (Virginia), Learner Tien (USC) and Valentin Vacherot (Texas A\u0026M) all claimed three Challenger titles. [ATP APP] Vacherot’s dominant start to season Vacherot started the season on one of the hottest Challenger runs in recent memory. The 26-year-old won his first 15 Challenger-level matches of the year, claiming three titles. It was the longest winning streak to start a Challenger season since 2017. Vacherot was crowned champion in back-to-back weeks in Nonthaburi, Thailand and triumphed a month later in Pune, India. A shoulder injury unfortunately hindered Vacherot’s standout season in which he did not compete in any tournaments after the US Open. Vacherot tallied a 21-3 season record (Challenger level) and held the second-highest winning percentage on the ATP Challenger Tour this year (87.5 per cent), only behind Fearnley (27-3, 90 per cent). [NEWSLETTER FORM]",
  "author": "",
  "published": "Sat, 14 Dec 2024 16:38:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Challenger",
    "2024",
    "Joel Schwaerzler"
  ],
  "byline": "",
  "length": 5091,
  "excerpt": "To mark the end of the 2024 season, ATPTour.com highlights five moments to remember from the ATP Challenger Tour season, including Joel Schwaerzler's title in Skopje.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Challenger A single-season record 27 different players with college tennis experience won Challenger titles December 14, 2024 Macedonian Open Joel Schwaerzler became the fourth player to win a Challenger title while holding the junior No. 1 ranking. By ATP Staff To mark the end of the 2024 season, ATPTour.com highlights five moments to remember from the ATP Challenger Tour season. Schwaerzler’s historic ‘surprise’ #NextGenATP Joel Schwaerzler entered the record books at the Macedonian Open, where he became just the fourth player to win a title at that level while holding the junior No. 1 ranking. Nick Kyrgios, Taylor Fritz and Wu Yibing also accomplished the feat. “I was kind of surprised,” Schwaerzler said. “I knew I could win matches there but to actually win the tournament is something different.” The 18-year-old, who won this year’s Roland Garros boys’ doubles event alongside Norway’s Nicolai Budkov Kjaer, finished the season at No. 330 in the PIF ATP Rankings. Schwaerzler is the fourth-youngest Austrian winner in ATP Challenger Tour history. Mejia wins Challenger title in memory of late father Nearly seven years on since his father’s passing, Mejia celebrated a career milestone in April, when he won his maiden ATP Challenger Tour title in San Luis Potosi, Mexico. Following his triumph, Mejia was enthusiastic, yet emotional, as he pointed to the sky. \"Papá, papá,\" he uttered. “Every single day that goes by, I mention him, I think about him, I dream about him in my sleep because I think about him the whole time,” said the No. 219 player in the PIF ATP Rankings. “It's been the toughest battle for me to realise and know that he is physically gone forever. I feel that he's close to me every single day of my life. That's one thing that will keep me going forever because that strength he gave me is unconditional. “I think when I lifted the trophy, I was also looking to the sky as a sign of relief… I wanted to look at my dad, obviously pointing the trophy to him.” Read ATPTour.com's feature: Mejia wins Challenger title in memory of late father: ‘The pain never goes away’. Nicolas Mejia at age eight alongside his father Gustavo. Credit: Mejia Family Rwanda Challenger reflects hope \u0026 healing of a nation This year marked 30 years since the Rwanda genocide, an atrocity that claimed an estimated 500,000 to 800,000 lives. As the central African country continues to recover and rebuild, tennis is playing a small but important part of the healing process. The ATP Challenger Tour spent two weeks (26 February-10 March) in the capital city Kigali, making Rwanda the seventh African country to host an event at that level. Rather than trying to erase the dark chapter from history, the tournament adopted an alternative approach: promoting education and honouring the fallen through visits to the Kigali Genocide Memorial. More than 20 players visited the memorial. “Rwanda took a risk to organise the first big tournament in this part of the world,” tournament director Arzel Mevellec said. “It’s a very important symbol. Rwanda is a small country but with big events now. Soccer, NBA Academy Africa, and now Rwanda is on the world map of tennis and I think that’s the beginning of something huge. Rwanda can be proud about that.” Rwanda is the seventh African country to host an ATP Challenger Tour event. Credit: Rwanda Tennis Federation Champions hailing from college ranks The college pathway continues to be a vital stepping stone for many players to find success on the ATP Challenger Tour and beyond. A single-season record 27 different players with college tennis experience won titles this year, led by four-time winner Jacob Fearnley, who helped TCU capture the 2024 NCAA D1 men’s tennis championship in May before making quick progress on the Challenger Tour. The four-time ITA All-American finished the season at No. 99 in the PIF ATP Rankings, a vast improvement upon his No. 646 ranking at the start of the year. The 2023 NCAA singles champion Ethan Quinn captured his maiden Challenger title in Champaign, his final tournament of the year. Tristan Boyer (Stanford), Federico Agustin Gomez (Louisville), Alexander Ritschard (Virginia), Learner Tien (USC) and Valentin Vacherot (Texas A\u0026M) all claimed three Challenger titles. Vacherot’s dominant start to season Vacherot started the season on one of the hottest Challenger runs in recent memory. The 26-year-old won his first 15 Challenger-level matches of the year, claiming three titles. It was the longest winning streak to start a Challenger season since 2017. Vacherot was crowned champion in back-to-back weeks in Nonthaburi, Thailand and triumphed a month later in Pune, India. A shoulder injury unfortunately hindered Vacherot’s standout season in which he did not compete in any tournaments after the US Open. Vacherot tallied a 21-3 season record (Challenger level) and held the second-highest winning percentage on the ATP Challenger Tour this year (87.5 per cent), only behind Fearnley (27-3, 90 per cent).",
  "image": "https://www.atptour.com/-/media/images/news/2024/12/13/01/04/schwaerzler-skopjech-2024-slide.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eChallenger\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eA single-season record 27 different players with college tennis experience won Challenger titles\u003cbr/\u003e\u003c/p\u003e\n    \u003cp\u003eDecember 14, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/12/13/01/04/schwaerzler-skopjech-2024-slide.jpg\" alt=\"Joel Schwaerzler became the fourth player to win a Challenger title while holding the junior No. 1 ranking.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eMacedonian Open\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJoel Schwaerzler became the fourth player to win a Challenger title while holding the junior No. 1 ranking.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eTo mark the end of the 2024 season, ATPTour.com highlights five moments to remember from the ATP Challenger Tour season.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSchwaerzler’s historic ‘surprise’\u003c/strong\u003e\u003cbr/\u003e\n#NextGenATP \u003ca href=\"https://www.atptour.com/en/players/joel-schwaerzler/s0wt/overview\"\u003eJoel Schwaerzler\u003c/a\u003e entered the record books at the \u003ca href=\"https://www.atptour.com/en/scores/archive/skopje/2869/2024/results\"\u003eMacedonian Open\u003c/a\u003e, where he became just the fourth player to win a title at that level while holding the junior No. 1 ranking. \u003ca href=\"https://www.atptour.com/en/players/nick-kyrgios/ke17/overview\"\u003eNick Kyrgios\u003c/a\u003e, \u003ca href=\"https://www.atptour.com/en/players/taylor-fritz/fb98/overview\"\u003eTaylor Fritz\u003c/a\u003e and Wu Yibing also accomplished the feat.\u003c/p\u003e\n\u003cp\u003e“I was kind of surprised,” Schwaerzler said. “I knew I could win matches there but to actually win the tournament is something different.”\u003c/p\u003e\n\u003cp\u003eThe 18-year-old, who won this year’s \u003ca href=\"https://www.atptour.com/en/tournaments/roland-garros/520/overview\"\u003eRoland Garros\u003c/a\u003e boys’ doubles event alongside Norway’s \u003ca href=\"https://www.atptour.com/en/players/nicolai-budkov-kjaer/b0u4/overview\"\u003eNicolai Budkov Kjaer\u003c/a\u003e, finished the season at No. 330 in the PIF ATP Rankings. Schwaerzler is the fourth-youngest Austrian winner in ATP Challenger Tour history.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMejia wins Challenger title in memory of late father\u003c/strong\u003e\u003cbr/\u003e\nNearly seven years on since his father’s passing, Mejia celebrated a career milestone in April, when he won his maiden ATP Challenger Tour title in San Luis Potosi, Mexico. Following his triumph, Mejia was enthusiastic, yet emotional, as he pointed to the sky. \u0026#34;Papá, papá,\u0026#34; he uttered.\u003c/p\u003e\n\u003cp\u003e\n“Every single day that goes by, I mention him, I think about him, I dream about him in my sleep because I think about him the whole time,” said the No. 219 player in the PIF ATP Rankings. “It\u0026#39;s been the toughest battle for me to realise and know that he is physically gone forever. I feel that he\u0026#39;s close to me every single day of my life. That\u0026#39;s one thing that will keep me going forever because that strength he gave me is unconditional.\u003c/p\u003e\n\u003cp\u003e\n“I think when I lifted the trophy, I was also looking to the sky as a sign of relief… I wanted to look at my dad, obviously pointing the trophy to him.” Read ATPTour.com\u0026#39;s feature: \u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com//en/news/mejia-challenger-feature-2024-april\" target=\"_blank\"\u003eMejia wins Challenger title in memory of late father: ‘The pain never goes away’.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/nicolas-mejia/m0aw/overview\u0026#39;\u0026gt;Nicolas Mejia\u0026lt;/a\u0026gt; at age eight alongside his father Gustavo.\" src=\"https://www.atptour.com/-/media/images/news/2024/04/03/18/18/mejia-gustavo-1-2024.jpg\"/\u003e\u003cbr/\u003e\u003cem\u003e\u003csup\u003e\u003ca href=\"https://www.atptour.com/en/players/nicolas-mejia/m0aw/overview\"\u003eNicolas Mejia\u003c/a\u003e at age eight alongside his father Gustavo. Credit: Mejia Family\u003c/sup\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\n\u003cstrong\u003e\u003ca href=\"https://www.atptour.com/en/scores/archive/kigali/2913/2024/results\"\u003eRwanda Challenger\u003c/a\u003e reflects hope \u0026amp; healing of a nation\u003c/strong\u003e\u003cbr/\u003e\nThis year marked 30 years since the Rwanda genocide, an atrocity that claimed an estimated 500,000 to 800,000 lives. As the central African country continues to recover and rebuild, tennis is playing a small but important part of the healing process. The ATP Challenger Tour spent two weeks (26 February-10 March) in the capital city Kigali, making Rwanda the seventh African country to host an event at that level.\u003c/p\u003e\n\u003cp\u003e\nRather than trying to erase the dark chapter from history, the tournament adopted an alternative approach: promoting education and honouring the fallen through visits to the Kigali Genocide Memorial. More than 20 players visited the memorial. \u003c/p\u003e\n\u003cp\u003e\n“Rwanda took a risk to organise the first big tournament in this part of the world,” tournament director Arzel Mevellec said. “It’s a very important symbol. Rwanda is a small country but with big events now. Soccer, NBA Academy Africa, and now Rwanda is on the world map of tennis and I think that’s the beginning of something huge. Rwanda can be proud about that.”\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"Rwanda is the seventh African country to host an ATP Challenger Tour event.\" src=\"https://www.atptour.com/-/media/images/news/2024/03/07/16/42/kigali-rwanda-challenger-feature-2024-march.jpg\"/\u003e\u003cbr/\u003e\u003cem\u003e\u003csup\u003eRwanda is the seventh African country to host an ATP Challenger Tour event. Credit: Rwanda Tennis Federation\u003c/sup\u003e\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003e\n\u003cstrong\u003eChampions hailing from college ranks\u003c/strong\u003e\u003cbr/\u003e\nThe college pathway continues to be a vital stepping stone for many players to find success on the ATP Challenger Tour and beyond.\u003c/p\u003e\n\u003cp\u003e\nA single-season record 27 different players with college tennis experience won titles this year, led by four-time winner \u003ca href=\"https://www.atptour.com/en/players/jacob-fearnley/f0by/overview\"\u003eJacob Fearnley\u003c/a\u003e, who helped TCU capture the 2024 NCAA D1 men’s tennis championship in May before making quick progress on the Challenger Tour. The four-time ITA All-American finished the season at No. 99 in the PIF ATP Rankings, a vast improvement upon his No. 646 ranking at the start of the year.\u003c/p\u003e\u003cp\u003e The 2023 NCAA singles champion \u003ca href=\"https://www.atptour.com/en/players/ethan-quinn/q02l/overview\"\u003eEthan Quinn\u003c/a\u003e captured his maiden Challenger title in Champaign, his final tournament of the year. \u003ca href=\"https://www.atptour.com/en/players/tristan-boyer/b0ej/overview\"\u003eTristan Boyer\u003c/a\u003e (Stanford), \u003ca href=\"https://www.atptour.com/en/players/federico-agustin-gomez/gj16/overview\"\u003eFederico Agustin Gomez\u003c/a\u003e (Louisville), \u003ca href=\"https://www.atptour.com/en/players/alexander-ritschard/rc04/overview\"\u003eAlexander Ritschard\u003c/a\u003e (Virginia), \u003ca href=\"https://www.atptour.com/en/players/learner-tien/t0ha/overview\"\u003eLearner Tien\u003c/a\u003e (USC) and \u003ca href=\"https://www.atptour.com/en/players/valentin-vacherot/va25/overview\"\u003eValentin Vacherot\u003c/a\u003e (Texas A\u0026amp;M) all claimed three Challenger titles.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\n\u003cstrong\u003eVacherot’s dominant start to season\u003c/strong\u003e\u003cbr/\u003e\nVacherot started the season on one of the hottest Challenger runs in recent memory. The 26-year-old won his first 15 Challenger-level matches of the year, claiming three titles. It was the longest winning streak to start a Challenger season since 2017. Vacherot was crowned champion in back-to-back weeks in Nonthaburi, Thailand and triumphed a month later in Pune, India.\u003c/p\u003e\n\u003cp\u003e\nA shoulder injury unfortunately hindered Vacherot’s standout season in which he did not compete in any tournaments after the \u003ca href=\"https://www.atptour.com/en/tournaments/us-open/560/overview\"\u003eUS Open\u003c/a\u003e. Vacherot tallied a 21-3 season record (Challenger level) and held the second-highest winning percentage on the ATP Challenger Tour this year (87.5 per cent), only behind Fearnley (27-3, 90 per cent).\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
