{
  "id": "835daf8f-0098-4785-b733-5f8681debe9a",
  "title": "The Queen of Clay's reign ends - but Swiatek 'will be back'",
  "link": "https://www.bbc.com/sport/tennis/articles/c4ge9x11n5do",
  "description": "Iga Swiatek's French Open title defence always felt under threat from Aryna Sabalenka - but there are positives for the Pole.",
  "author": "",
  "published": "Thu, 05 Jun 2025 18:51:27 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 4257,
  "excerpt": "Iga Swiatek's French Open title defence always felt under threat from Aryna Sabalenka - but there are positives for the Pole.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "French Open 2025Dates: 25 May-8 June Venue: Roland GarrosCoverage: Live radio commentaries across 5 Live Sport and BBC Sounds, plus live text commentaries on the BBC Sport website and appLosing at the French Open is not something Iga Swiatek is accustomed to.Having won four of the past five titles at Roland Garros, the 24-year-old has become known as the 'Queen of Clay' - but her reign always felt under threat coming into this year's tournament.Swiatek's current frailties were exposed by world number one Aryna Sabalenka in a blockbuster semi-final on Thursday.Swiatek's serve was obliterated by Belarus' Sabalenka, who converted eight break points to end Swiatek's 26-match winning streak on the Paris clay.\"Iga will be back and she will be better,\" said former world number nine Andrea Petkovic, who analysed the match for BBC Radio 5 Live.\"I did think this year's tournament was a huge step forward for her in terms of form.\"In the eyes of many seasoned observers, Swiatek was the third favourite for the title behind Sabalenka and American second seed Gauff, who beat French wildcard Lois Boisson in Thursday's second semi-final.Swiatek has been nowhere near her dominant best over the past year, failing to reach a final since last year's French Open triumph and slipping to her lowest ranking since March 2022.After a chastening defeat in the Italian Open third round, Swiatek's return to Paris offered positivity.\"I think I already changed my mindset before this tournament,\" said Swiatek shortly after her first French Open defeat since 2021.\"Losing early in Rome gave me some time and perspective.\"The former long-time world number one looked more like her old self as she rolled through her opening three matches without dropping a set.When a tougher test arrived against Elena Rybakina in the last 16, Swiatek fought back from losing the opening set 6-1 and answered more of the lingering questions around her form.She showed similar resilience in the opening set against Sabalenka, recovering from 4-1 down to force the set back on serve.Altering her return position helped Swiatek fight back from a poor start, where she was overwhelmed by Sabalenka's power, and take the match into a decider.However, the fifth seed did not have the capability - or perhaps belief - to sustain her level and rolled over in a 22-minute third set.Overall, though, Swiatek felt she had positives to take from the past fortnight.\"I played some quality matches,\" said Swiatek, who has still won 32 of her 42 matches this season.\"Now it's probably not the best time to look at the wider perspective. \"Probably it wasn't a bad tournament, but obviously not the result I wanted.\"There are a mixture of reasons - on and off the court - as to why Swiatek's level has dipped.Losing in the Olympics semi-finals in Paris last summer was a bitter blow, with Swiatek saying she cried for \"six hours\" afterwards.But later came a bigger bombshell - Swiatek had failed a doping test.It was announced in November she had tested positive for heart medication trimetazidine (TMZ) in an out-of-competition sample. She was subsequently given a one-month ban after the International Tennis Integrity Agency (ITIA) accepted the result was caused by contamination.Swiatek decided to switch coach at the end of last year, replacing Tomas Wiktorowski with Wim Fissette, and it is taking time for the changes she is making to bed in.The destructive forehand - her most effective tool on the clay - has lost some of its reliability, while her service game has been picked apart by big-hitting opponents.\"Maybe she lost a little bit of a confidence, so that's why sometimes you see her missing balls that she shouldn't be missing,\" said Sabalenka.\"But overall, I think it was a really high-level match and she played really great tennis.\"Sabalenka's victory emphasised her position as the runaway leader on the WTA Tour and it is hard to see Swiatek challenging her on the Wimbledon grass next month.Sabalenka's powerful game transfers well onto the faster surface, while Swiatek has never gone past the SW19 quarter-finals.\"We know Iga doesn't love that surface so I'm interested to see where she goes from here,\" added Petkovic.\"I think that is going to be very fascinating to watch.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd8a/live/536c3400-4237-11f0-b24e-5322b99b4bd8.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eFrench Open 2025\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eDates: \u003c/b\u003e25 May-8 June \u003cb\u003eVenue:\u003c/b\u003e Roland Garros\u003c/p\u003e\u003cp\u003e\u003cb\u003eCoverage:\u003c/b\u003e Live radio commentaries across 5 Live Sport and BBC Sounds, plus live text commentaries on the BBC Sport website and app\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eLosing at the French Open is not something Iga Swiatek is accustomed to.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eHaving won four of the past five titles at Roland Garros, the 24-year-old has become known as the \u0026#39;Queen of Clay\u0026#39; - but her reign always felt under threat coming into this year\u0026#39;s tournament.\u003c/p\u003e\u003cp\u003eSwiatek\u0026#39;s current frailties were exposed by world number one Aryna Sabalenka in a blockbuster semi-final on Thursday.\u003c/p\u003e\u003cp\u003eSwiatek\u0026#39;s serve was obliterated by Belarus\u0026#39; Sabalenka, who converted eight break points to end Swiatek\u0026#39;s 26-match winning streak on the Paris clay.\u003c/p\u003e\u003cp\u003e\u0026#34;Iga will be back and she will be better,\u0026#34; said former world number nine Andrea Petkovic, who analysed the match for BBC Radio 5 Live.\u003c/p\u003e\u003cp\u003e\u0026#34;I did think this year\u0026#39;s tournament was a huge step forward for her in terms of form.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn the eyes of many seasoned observers, Swiatek was the third favourite for the title behind Sabalenka and American second seed Gauff, who beat French wildcard Lois Boisson in Thursday\u0026#39;s second semi-final.\u003c/p\u003e\u003cp\u003eSwiatek has been nowhere near her dominant best over the past year, failing to reach a final since last year\u0026#39;s French Open triumph and slipping to her lowest ranking since March 2022.\u003c/p\u003e\u003cp\u003eAfter a chastening defeat in the Italian Open third round, Swiatek\u0026#39;s return to Paris offered positivity.\u003c/p\u003e\u003cp\u003e\u0026#34;I think I already changed my mindset before this tournament,\u0026#34; said Swiatek shortly after her first French Open defeat since 2021.\u003c/p\u003e\u003cp\u003e\u0026#34;Losing early in Rome gave me some time and perspective.\u0026#34;\u003c/p\u003e\u003cp\u003eThe former long-time world number one looked more like her old self as she rolled through her opening three matches without dropping a set.\u003c/p\u003e\u003cp\u003eWhen a tougher test arrived against Elena Rybakina in the last 16, Swiatek fought back from losing the opening set 6-1 and answered more of the lingering questions around her form.\u003c/p\u003e\u003cp\u003eShe showed similar resilience in the opening set against Sabalenka, recovering from 4-1 down to force the set back on serve.\u003c/p\u003e\u003cp\u003eAltering her return position helped Swiatek fight back from a poor start, where she was overwhelmed by Sabalenka\u0026#39;s power, and take the match into a decider.\u003c/p\u003e\u003cp\u003eHowever, the fifth seed did not have the capability - or perhaps belief - to sustain her level and rolled over in a 22-minute third set.\u003c/p\u003e\u003cp\u003eOverall, though, Swiatek felt she had positives to take from the past fortnight.\u003c/p\u003e\u003cp\u003e\u0026#34;I played some quality matches,\u0026#34; said Swiatek, who has still won 32 of her 42 matches this season.\u003c/p\u003e\u003cp\u003e\u0026#34;Now it\u0026#39;s probably not the best time to look at the wider perspective. \u003c/p\u003e\u003cp\u003e\u0026#34;Probably it wasn\u0026#39;t a bad tournament, but obviously not the result I wanted.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere are a mixture of reasons - on and off the court - as to why Swiatek\u0026#39;s level has dipped.\u003c/p\u003e\u003cp\u003eLosing in the Olympics semi-finals in Paris last summer was a bitter blow, with Swiatek saying she cried for \u0026#34;six hours\u0026#34; afterwards.\u003c/p\u003e\u003cp\u003eBut later came a bigger bombshell - Swiatek had failed a doping test.\u003c/p\u003e\u003cp\u003eIt was announced in November she had tested positive for heart medication trimetazidine (TMZ) in an out-of-competition sample. She was subsequently given a one-month ban after the International Tennis Integrity Agency (ITIA) accepted the result was caused by contamination.\u003c/p\u003e\u003cp\u003eSwiatek decided to switch coach at the end of last year, replacing Tomas Wiktorowski with Wim Fissette, and it is taking time for the changes she is making to bed in.\u003c/p\u003e\u003cp\u003eThe destructive forehand - her most effective tool on the clay - has lost some of its reliability, while her service game has been picked apart by big-hitting opponents.\u003c/p\u003e\u003cp\u003e\u0026#34;Maybe she lost a little bit of a confidence, so that\u0026#39;s why sometimes you see her missing balls that she shouldn\u0026#39;t be missing,\u0026#34; said Sabalenka.\u003c/p\u003e\u003cp\u003e\u0026#34;But overall, I think it was a really high-level match and she played really great tennis.\u0026#34;\u003c/p\u003e\u003cp\u003eSabalenka\u0026#39;s victory emphasised her position as the runaway leader on the WTA Tour and it is hard to see Swiatek challenging her on the Wimbledon grass next month.\u003c/p\u003e\u003cp\u003eSabalenka\u0026#39;s powerful game transfers well onto the faster surface, while Swiatek has never gone past the SW19 quarter-finals.\u003c/p\u003e\u003cp\u003e\u0026#34;We know Iga doesn\u0026#39;t love that surface so I\u0026#39;m interested to see where she goes from here,\u0026#34; added Petkovic.\u003c/p\u003e\u003cp\u003e\u0026#34;I think that is going to be very fascinating to watch.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-05T18:51:27.002Z",
  "modifiedTime": null
}
