{
  "id": "975658c2-ae3b-45cf-a27e-5be7fbacf40a",
  "title": "Turin SF Preview: Sinner vs. Ruud, Zverev vs. Fritz",
  "link": "https://www.atptour.com/en/news/sinner-ruud-fritz-zverev-turin-2024-sf-preview",
  "description": "After six days of elite group-stage action at the 2024 Nitto ATP Finals, Saturday begins the knockout rounds in Turin. Home favourite Jannik Sinner, the No. 1 in the PIF ATP Rankings, will seek to continue his perfect week when he takes on Casper Ruud in the Inalpi Arena. World No. 2 Alexander Zverev, who also posted a 3-0 round-robin record, will meet Taylor Fritz. In doubles action, Aussies Max Purcell and Jordan Thompson take on Germans Kevin Krawietz and Tim Puetz before top seeds Marcelo Arevalo and Mate Pavic play Harri Heliovaara and Henry Patten. [ATP AWARDS] [1] Jannik Sinner (ITA) vs. [6] Casper Ruud (NOR) Playing on home soil for the first time this year — and for the first time as World No. 1 — Sinner has soared into the semis without dropping a set. The Italian has not lost more than four games in a single frame and was broken just twice on four break chances combined against De Minaur, Fritz and Medvedev. \"The atmosphere here is amazing, so I’m just trying to play some good tennis this week,\" Sinner said after completing his undefeated group-stage campaign. His perfect start on the Inalpi Arena's indoor hard court continues a brilliant season highlighted by a tour-leading seven titles. Six of those trophies have come on hard courts, including his first two Grand Slam titles (Australian Open, US Open) and three ATP Masters 1000s crowns (Miami, Cincinnati, Shanghai). \"I know what I have achieved during this year, so I try to step on court with a good mindset,\" he said of his continued success. \"I have beautiful people around me who support me daily, which for me is really important. I try to enjoy my time on the court.\"   Ruud, whose two 2024 titles came on the clay of Barcelona and Geneva, has the unenviable task of trying to slow Sinner's roll on the pavement. He has yet to take a set off the Italian in two previous Lexus ATP Head2Head meetings. Both of those matchups came on indoor hard courts in Vienna, but it's been more than three years since their last encounter. The Norwegian could have no better preparation for the World No. 1 than the gauntlet he faced to reach the semis. After beating Alcaraz, the No. 3 man in the PIF ATP Rankings, Ruud allowed just one break point in a tight defeat to World No. 2 Zverev. Knowing he needed to win a set against Andrey Rublev to secure his semi-final place, he went one better and won the match to wrap his group campaign at 2-1. The task will only get tougher on Saturday, when he will have to handle both a red-hot Sinner and the Italian crowd. \"He is the best player in the world all year and is playing at home and has not dropped a set all week,\" Ruud said. \"He is the player to beat this year and I am going to do my best. It seems like this guy almost forgot how to lose. I will see if I can come up with something to challenge here. I will be prepared for probably the toughest match of the year.\" [2] Alexander Zverev (GER) vs. [5] Taylor Fritz (USA) Zverev and Fritz have been among the busiest players on the ATP Tour this season. They are two of just five men with more than 50 match wins on the year, joining fellow Turin competitors Sinner, Carlos Alcaraz and Ruud. With the Nitto ATP Finals title on the line, both men will have plenty more in the tank. \"I think a lot of us are pretty beat up,\" Fritz said after his three-set win against Alex de Minaur on Thursday. \"But if I’m in the semis of the [Nitto ATP Finals], I’ve got energy to give.\" Their semi-final meeting will be Zverev's 90th match of 2024 (69-20) and Fritz's 74th (51-22). It will also be their fifth Lexus ATP Head2Head meeting of 2024. \"I’m happy with being 3-0 in the group for sure, but I think now the semi-final is going to be very difficult,\" said Zverev, who trails Fritz 5-6 in their rivalry. \"[Taylor] beat me the past few times at the Slams, so I’m looking forward to that match.\"   Zverev defeated the American this year in the Rome quarter-finals, but Fritz prevailed at Wimbledon in five sets, at the US Open in four and at Laver Cup in two. Fritz's three-match winning streak against Zverev marks the first time either man has beaten the other three times in a row. But the German's form — and his status as year-end No. 2 in the PIF ATP Rankings — makes him the slight favourite in Turin. Fritz nearly pulled off the upset against Sinner in the round-robin stage, giving the home favourite all he could handle in two tight sets before being broken in the final game of each. He then dropped the opening set against Alex de Minaur before finding his serve to turn that match around and, ultimately, seal his semi-final place. In this Saturday showdown, both men will look to use their big serves to set the tone. The ideal formula is a simple one: dominate service games and pile on the pressure when returning. But nothing is simple at the Nitto ATP Finals. Doubles SFs Thursday's results meant Arevalo and Pavic clinched Year-End ATP Doubles No. 1 presented by PIF honours as a team for the first time. On Friday, the Turin top seeds beat home favourites Bolelli and Vavassori to seal their place in the semi-finals. The Salvadoran/Croatian pair will hope to continue their positive streak against the in-form team of the tournament, Heliovaara and Patten. Exceeding their billing as seventh seeds, the British/Finnish team was the lone doubles duo to post a 3-0 group record this week. The opposite semi-final will see two pairs of countrymen square off as fifth-seeded Aussies Purcell and Thompson take on eighth-seeded Germans Krawietz and Puetz. Both teams finished round-robin play at 2-1. The Aussies finished second in the Mike Bryan Group while the Germans topped the Bob Bryan group thanks to their 5-2 set record. [NEWSLETTER FORM]",
  "author": "",
  "published": "Fri, 15 Nov 2024 22:12:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Match Preview",
    "Nitto ATP Finals",
    "Alexander Zverev",
    "Taylor Fritz",
    "Jannik Sinner",
    "Casper Ruud",
    "2024"
  ],
  "byline": "",
  "length": 6025,
  "excerpt": "Italy's Jannik Sinner and Germany's Alexander Zverev look to build on their perfect 3-0 group-stage records when they take on Casper Ruud and Taylor Fritz, respectively, in Saturday's Turin semi-finals.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Match Preview Sinner, Zverev posted perfect 3-0 records in group stage November 15, 2024 ATP Jannik Sinner leads Casper Ruud 2-0 in their Lexus ATP Head2Head series, but the Turin semi-final opponents have not squared off since 2021. By Arthur Kapetanakis After six days of elite group-stage action at the 2024 Nitto ATP Finals, Saturday begins the knockout rounds in Turin. Home favourite Jannik Sinner, the No. 1 in the PIF ATP Rankings, will seek to continue his perfect week when he takes on Casper Ruud in the Inalpi Arena. World No. 2 Alexander Zverev, who also posted a 3-0 round-robin record, will meet Taylor Fritz. In doubles action, Aussies Max Purcell and Jordan Thompson take on Germans Kevin Krawietz and Tim Puetz before top seeds Marcelo Arevalo and Mate Pavic play Harri Heliovaara and Henry Patten. [1] Jannik Sinner (ITA) vs. [6] Casper Ruud (NOR) Playing on home soil for the first time this year — and for the first time as World No. 1 — Sinner has soared into the semis without dropping a set. The Italian has not lost more than four games in a single frame and was broken just twice on four break chances combined against De Minaur, Fritz and Medvedev. \"The atmosphere here is amazing, so I’m just trying to play some good tennis this week,\" Sinner said after completing his undefeated group-stage campaign. His perfect start on the Inalpi Arena's indoor hard court continues a brilliant season highlighted by a tour-leading seven titles. Six of those trophies have come on hard courts, including his first two Grand Slam titles (Australian Open, US Open) and three ATP Masters 1000s crowns (Miami, Cincinnati, Shanghai). \"I know what I have achieved during this year, so I try to step on court with a good mindset,\" he said of his continued success. \"I have beautiful people around me who support me daily, which for me is really important. I try to enjoy my time on the court.\" Ruud, whose two 2024 titles came on the clay of Barcelona and Geneva, has the unenviable task of trying to slow Sinner's roll on the pavement. He has yet to take a set off the Italian in two previous Lexus ATP Head2Head meetings. Both of those matchups came on indoor hard courts in Vienna, but it's been more than three years since their last encounter. The Norwegian could have no better preparation for the World No. 1 than the gauntlet he faced to reach the semis. After beating Alcaraz, the No. 3 man in the PIF ATP Rankings, Ruud allowed just one break point in a tight defeat to World No. 2 Zverev. Knowing he needed to win a set against Andrey Rublev to secure his semi-final place, he went one better and won the match to wrap his group campaign at 2-1. The task will only get tougher on Saturday, when he will have to handle both a red-hot Sinner and the Italian crowd. \"He is the best player in the world all year and is playing at home and has not dropped a set all week,\" Ruud said. \"He is the player to beat this year and I am going to do my best. It seems like this guy almost forgot how to lose. I will see if I can come up with something to challenge here. I will be prepared for probably the toughest match of the year.\" [2] Alexander Zverev (GER) vs. [5] Taylor Fritz (USA) Zverev and Fritz have been among the busiest players on the ATP Tour this season. They are two of just five men with more than 50 match wins on the year, joining fellow Turin competitors Sinner, Carlos Alcaraz and Ruud. With the Nitto ATP Finals title on the line, both men will have plenty more in the tank. \"I think a lot of us are pretty beat up,\" Fritz said after his three-set win against Alex de Minaur on Thursday. \"But if I’m in the semis of the [Nitto ATP Finals], I’ve got energy to give.\" Their semi-final meeting will be Zverev's 90th match of 2024 (69-20) and Fritz's 74th (51-22). It will also be their fifth Lexus ATP Head2Head meeting of 2024. \"I’m happy with being 3-0 in the group for sure, but I think now the semi-final is going to be very difficult,\" said Zverev, who trails Fritz 5-6 in their rivalry. \"[Taylor] beat me the past few times at the Slams, so I’m looking forward to that match.\" Zverev defeated the American this year in the Rome quarter-finals, but Fritz prevailed at Wimbledon in five sets, at the US Open in four and at Laver Cup in two. Fritz's three-match winning streak against Zverev marks the first time either man has beaten the other three times in a row. But the German's form — and his status as year-end No. 2 in the PIF ATP Rankings — makes him the slight favourite in Turin. Fritz nearly pulled off the upset against Sinner in the round-robin stage, giving the home favourite all he could handle in two tight sets before being broken in the final game of each. He then dropped the opening set against Alex de Minaur before finding his serve to turn that match around and, ultimately, seal his semi-final place. In this Saturday showdown, both men will look to use their big serves to set the tone. The ideal formula is a simple one: dominate service games and pile on the pressure when returning. But nothing is simple at the Nitto ATP Finals. Doubles SFs Thursday's results meant Arevalo and Pavic clinched Year-End ATP Doubles No. 1 presented by PIF honours as a team for the first time. On Friday, the Turin top seeds beat home favourites Bolelli and Vavassori to seal their place in the semi-finals. The Salvadoran/Croatian pair will hope to continue their positive streak against the in-form team of the tournament, Heliovaara and Patten. Exceeding their billing as seventh seeds, the British/Finnish team was the lone doubles duo to post a 3-0 group record this week. The opposite semi-final will see two pairs of countrymen square off as fifth-seeded Aussies Purcell and Thompson take on eighth-seeded Germans Krawietz and Puetz. Both teams finished round-robin play at 2-1. The Aussies finished second in the Mike Bryan Group while the Germans topped the Bob Bryan group thanks to their 5-2 set record.",
  "image": "https://www.atptour.com/-/media/images/news/2024/11/15/22/06/sinner-ruud-h2h-turin-2024-sf.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eMatch Preview\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eSinner, Zverev posted perfect 3-0 records in group stage\u003c/p\u003e\n    \u003cp\u003eNovember 15, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/11/15/22/06/sinner-ruud-h2h-turin-2024-sf.jpg\" alt=\"Jannik Sinner leads Casper Ruud 2-0 in their Lexus ATP Head2Head series, but the Turin semi-final opponents have not squared off since 2021.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eATP\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJannik Sinner leads Casper Ruud 2-0 in their Lexus ATP Head2Head series, but the Turin semi-final opponents have not squared off since 2021.\u003c/span\u003e\n        \u003cspan\u003eBy Arthur Kapetanakis\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eAfter six days of elite group-stage action at the 2024 \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e, Saturday begins the knockout rounds in Turin.\u003c/p\u003e\n\u003cp\u003eHome favourite \u003ca href=\"https://www.atptour.com/en/players/jannik-sinner/s0ag/overview\"\u003eJannik Sinner\u003c/a\u003e, the No. 1 in the PIF ATP Rankings, will seek to continue his perfect week when he takes on \u003ca href=\"https://www.atptour.com/en/players/casper-ruud/rh16/overview\"\u003eCasper Ruud\u003c/a\u003e in the Inalpi Arena. World No. 2 \u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e, who also posted a 3-0 round-robin record, will meet \u003ca href=\"https://www.atptour.com/en/players/taylor-fritz/fb98/overview\"\u003eTaylor Fritz\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn doubles action, Aussies \u003ca href=\"https://www.atptour.com/en/players/max-purcell/ph71/overview\"\u003eMax Purcell\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/jordan-thompson/tc61/overview\"\u003eJordan Thompson\u003c/a\u003e take on Germans \u003ca href=\"https://www.atptour.com/en/players/kevin-krawietz/kb92/overview\"\u003eKevin Krawietz\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/tim-puetz/pc68/overview\"\u003eTim Puetz\u003c/a\u003e before top seeds \u003ca href=\"https://www.atptour.com/en/players/marcelo-arevalo/a853/overview\"\u003eMarcelo Arevalo\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/mate-pavic/pf00/overview\"\u003eMate Pavic\u003c/a\u003e play \u003ca href=\"https://www.atptour.com/en/players/harri-heliovaara/h808/overview\"\u003eHarri Heliovaara\u003c/a\u003e and \u003ca href=\"https://www.atptour.com/en/players/henry-patten/p0g6/overview\"\u003eHenry Patten\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/news/atp-awards-2024-fans-favourite\" target=\"_blank\"\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/11/14/01/14/atp-awards-2024_fans-favourite_728x90.gif\" alt=\"Who\u0026#39;s your favourite tennis player? Vote now in 2024 ATP Awards\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e[1] \u003ca href=\"https://www.atptour.com/en/players/jannik-sinner/s0ag/overview\"\u003eJannik Sinner\u003c/a\u003e (ITA) vs. [6] \u003ca href=\"https://www.atptour.com/en/players/casper-ruud/rh16/overview\"\u003eCasper Ruud\u003c/a\u003e (NOR)\u003cbr/\u003e\n\u003c/strong\u003ePlaying on home soil for the first time this year — and for the first time as World No. 1 — Sinner has soared into the semis without dropping a set. The Italian has not lost more than four games in a single frame and was broken just twice on four break chances combined against De Minaur, Fritz and Medvedev.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The atmosphere here is amazing, so I’m just trying to play some good tennis this week,\u0026#34; Sinner said after completing his undefeated group-stage campaign.\u003c/p\u003e\n\u003cp\u003eHis perfect start on the Inalpi Arena\u0026#39;s indoor hard court continues a brilliant season highlighted by a tour-leading seven titles. Six of those trophies have come on hard courts, including his first two Grand Slam titles (\u003ca href=\"https://www.atptour.com/en/tournaments/australian-open/580/overview\"\u003eAustralian Open\u003c/a\u003e, \u003ca href=\"https://www.atptour.com/en/tournaments/us-open/560/overview\"\u003eUS Open\u003c/a\u003e) and three ATP Masters 1000s crowns (Miami, Cincinnati, Shanghai).\u003c/p\u003e\n\u003cp\u003e\u0026#34;I know what I have achieved during this year, so I try to step on court with a good mindset,\u0026#34; he said of his continued success. \u0026#34;I have beautiful people around me who support me daily, which for me is really important. I try to enjoy my time on the court.\u0026#34;\u003c/p\u003e\n\n\n\u003cp\u003eRuud, whose two 2024 titles came on the clay of Barcelona and Geneva, has the unenviable task of trying to slow Sinner\u0026#39;s roll on the pavement. He has yet to take a set off the Italian in two previous Lexus ATP Head2Head meetings. Both of those matchups came on indoor hard courts in Vienna, but it\u0026#39;s been more than three years since their last encounter.\u003c/p\u003e\n\u003cp\u003eThe Norwegian could have no better preparation for the World No. 1 than the gauntlet he faced to reach the semis. After beating Alcaraz, the No. 3 man in the PIF ATP Rankings, Ruud allowed just one break point in a tight defeat to World No. 2 Zverev. Knowing he needed to win a set against \u003ca href=\"https://www.atptour.com/en/players/andrey-rublev/re44/overview\"\u003eAndrey Rublev\u003c/a\u003e to secure his semi-final place, he went one better and won the match to wrap his group campaign at 2-1.\u003c/p\u003e\n\u003cp\u003eThe task will only get tougher on Saturday, when he will have to handle both a red-hot Sinner and the Italian crowd.\u003c/p\u003e\n\u003cp\u003e\u0026#34;He is the best player in the world all year and is playing at home and has not dropped a set all week,\u0026#34; Ruud said. \u0026#34;He is the player to beat this year and I am going to do my best. It seems like this guy almost forgot how to lose. I will see if I can come up with something to challenge here. I will be prepared for probably the toughest match of the year.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/alexander-zverev/z355/overview\u0026#39;\u0026gt;Alexander Zverev\u0026lt;/a\u0026gt;, \u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/taylor-fritz/fb98/overview\u0026#39;\u0026gt;Taylor Fritz\u0026lt;/a\u0026gt;\" src=\"https://www.atptour.com/-/media/images/news/2024/11/15/18/05/zverev-fritz-turin-2024-sf-h2h.jpg\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e[2] \u003ca href=\"https://www.atptour.com/en/players/alexander-zverev/z355/overview\"\u003eAlexander Zverev\u003c/a\u003e (GER) vs. [5] \u003ca href=\"https://www.atptour.com/en/players/taylor-fritz/fb98/overview\"\u003eTaylor Fritz\u003c/a\u003e (USA)\u003cbr/\u003e\n\u003c/strong\u003e Zverev and Fritz have been among the busiest players on the ATP Tour this season. They are two of just five men with more than 50 match wins on the year, joining fellow Turin competitors Sinner, \u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e and Ruud.\u003c/p\u003e\n\u003cp\u003eWith the \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e title on the line, both men will have plenty more in the tank.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I think a lot of us are pretty beat up,\u0026#34; Fritz said after his three-set win against \u003ca href=\"https://www.atptour.com/en/players/alex-de-minaur/dh58/overview\"\u003eAlex de Minaur\u003c/a\u003e on Thursday. \u0026#34;But if I’m in the semis of the [\u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e], I’ve got energy to give.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTheir semi-final meeting will be Zverev\u0026#39;s 90th match of 2024 (69-20) and Fritz\u0026#39;s 74th (51-22). It will also be their fifth Lexus ATP Head2Head meeting of 2024.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I’m happy with being 3-0 in the group for sure, but I think now the semi-final is going to be very difficult,\u0026#34; said Zverev, who trails Fritz 5-6 in their rivalry. \u0026#34;[Taylor] beat me the past few times at the Slams, so I’m looking forward to that match.\u0026#34;\u003c/p\u003e\n\n\n\u003cp\u003eZverev defeated the American this year in the Rome quarter-finals, but Fritz prevailed at \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e in five sets, at the \u003ca href=\"https://www.atptour.com/en/tournaments/us-open/560/overview\"\u003eUS Open\u003c/a\u003e in four and at \u003ca href=\"https://www.atptour.com/en/tournaments/laver-cup/9210/overview\"\u003eLaver Cup\u003c/a\u003e in two. Fritz\u0026#39;s three-match winning streak against Zverev marks the first time either man has beaten the other three times in a row. But the German\u0026#39;s form — and his status as year-end No. 2 in the PIF ATP Rankings — makes him the slight favourite in Turin.\u003c/p\u003e\n\u003cp\u003eFritz nearly pulled off the upset against Sinner in the round-robin stage, giving the home favourite all he could handle in two tight sets before being broken in the final game of each. He then dropped the opening set against \u003ca href=\"https://www.atptour.com/en/players/alex-de-minaur/dh58/overview\"\u003eAlex de Minaur\u003c/a\u003e before finding his serve to turn that match around and, ultimately, seal his semi-final place.\u003c/p\u003e\n\u003cp\u003eIn this Saturday showdown, both men will look to use their big serves to set the tone. The ideal formula is a simple one: dominate service games and pile on the pressure when returning. But nothing is simple at the \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDoubles SFs\u003cbr/\u003e\n\u003c/strong\u003eThursday\u0026#39;s results meant Arevalo and Pavic clinched Year-End ATP Doubles No. 1 presented by PIF honours as a team for the first time. On Friday, the Turin top seeds beat home favourites Bolelli and Vavassori to seal their place in the semi-finals.\u003c/p\u003e\n\u003cp\u003eThe Salvadoran/Croatian pair will hope to continue their positive streak against the in-form team of the tournament, Heliovaara and Patten. Exceeding their billing as seventh seeds, the British/Finnish team was the lone doubles duo to post a 3-0 group record this week.\u003c/p\u003e\n\u003cp\u003eThe opposite semi-final will see two pairs of countrymen square off as fifth-seeded Aussies Purcell and Thompson take on eighth-seeded Germans Krawietz and Puetz. Both teams finished round-robin play at 2-1. The Aussies finished second in the \u003ca href=\"https://www.atptour.com/en/players/mike-bryan/b589/overview\"\u003eMike Bryan\u003c/a\u003e Group while the Germans topped the \u003ca href=\"https://www.atptour.com/en/players/bob-bryan/b588/overview\"\u003eBob Bryan\u003c/a\u003e group thanks to their 5-2 set record.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": null,
  "modifiedTime": null
}
