{
  "id": "a1e8e6e8-4cdb-40fc-9797-d5f2e0f15a8c",
  "title": "Set to take flight in Jeddah, Mensik recalls childhood airport mishap",
  "link": "https://www.atptour.com/en/news/mensik-jeddah-2024-media-day",
  "description": "Jakub Mensik earned his debut at the Next Gen ATP Finals presented by PIF with a breakout season that included four Top 10 wins. One of four Jeddah competitors inside the Top 50 of the PIF ATP Rankings — alongside Arthur Fils, Alex Michelsen and Shang Juncheng — Mensik knew before the 2024 season started that he wanted to end it at the 20-and-under showcase event. \"It was one of my biggest goals to reach this event before the season,\" he said this week. \"I'm glad to be here. So far it's amazing, the facilities and everything that they did for us. You can feel really that you're one of the best younger players in the world.\" [ATP APP] Throughout his rise, Mensik has always been able to count on the unwavering support of his parents, Michal and Katerina. Both his parents are in Jeddah, and they have regularly travelled with Mensik since his junior tennis days. The family are frequent flyers now, but they recalled an airport mishap years ago, long before Mensik grew accustomed to the nomadic life. When he was nine, the family was waiting at baggage claim when Mensik became distracted by a cat. After going over to investigate, he lost track of his parents, who left the baggage area before realising their son had gone missing. Mensik remembers a scary wait until his father returned: \"From nowhere, my dad appeared after 30, 45 minutes, and everything was good,\" he said with a laugh. It will be hard to lose sight of Mensik this week as he competes under the spotlight of the Next Gen ATP Finals presented by PIF. While Mensik exceeded all outside expectations this year on the ATP Tour, the 19-year-old is not putting himself under any undue pressure in Jeddah. As the third seed, he will open his campaign against Learner Tien on Wednesday. \"I never have expectations,\" he explained. \"Obviously just to enjoy this beautiful tournament. Of course I would be happy to win a couple of matches and of course I'm going here to win it.\" Mensik took a similar approach at his first ATP Tour tournament this February in Doha, where he beat Andrey Rublev en route to the final. He also beat Rublev on his way to the quarter-finals at the Rolex Shanghai Masters, where he pushed his idol Novak Djokovic to three sets. Mensik lists those two weeks as the highlights of his year, along with representing Czechia at the Olympics and Davis Cup.  He'll hope to end his 2024 campaign with another week to remember in Jeddah. [NEWSLETTER FORM]",
  "author": "",
  "published": "Tue, 17 Dec 2024 20:31:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Next Gen ATP Finals",
    "Jakub Mensik",
    "2024"
  ],
  "byline": "",
  "length": 2661,
  "excerpt": "Jakub Mensik knew before this season started that he wanted to end it at the 2024 Next Gen ATP Finals presented by PIF in Jeddah.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Next Gen ATP Finals Czech primed for Jeddah debut December 17, 2024 Corinne Dubreuil/ATP Tour Jakub Mensik opens his Jeddah campaign Wednesday against Learner Tien. By ATP Staff Jakub Mensik earned his debut at the Next Gen ATP Finals presented by PIF with a breakout season that included four Top 10 wins. One of four Jeddah competitors inside the Top 50 of the PIF ATP Rankings — alongside Arthur Fils, Alex Michelsen and Shang Juncheng — Mensik knew before the 2024 season started that he wanted to end it at the 20-and-under showcase event. \"It was one of my biggest goals to reach this event before the season,\" he said this week. \"I'm glad to be here. So far it's amazing, the facilities and everything that they did for us. You can feel really that you're one of the best younger players in the world.\" Throughout his rise, Mensik has always been able to count on the unwavering support of his parents, Michal and Katerina. Both his parents are in Jeddah, and they have regularly travelled with Mensik since his junior tennis days. The family are frequent flyers now, but they recalled an airport mishap years ago, long before Mensik grew accustomed to the nomadic life. When he was nine, the family was waiting at baggage claim when Mensik became distracted by a cat. After going over to investigate, he lost track of his parents, who left the baggage area before realising their son had gone missing. Mensik remembers a scary wait until his father returned: \"From nowhere, my dad appeared after 30, 45 minutes, and everything was good,\" he said with a laugh. It will be hard to lose sight of Mensik this week as he competes under the spotlight of the Next Gen ATP Finals presented by PIF. While Mensik exceeded all outside expectations this year on the ATP Tour, the 19-year-old is not putting himself under any undue pressure in Jeddah. As the third seed, he will open his campaign against Learner Tien on Wednesday. \"I never have expectations,\" he explained. \"Obviously just to enjoy this beautiful tournament. Of course I would be happy to win a couple of matches and of course I'm going here to win it.\" Mensik took a similar approach at his first ATP Tour tournament this February in Doha, where he beat Andrey Rublev en route to the final. He also beat Rublev on his way to the quarter-finals at the Rolex Shanghai Masters, where he pushed his idol Novak Djokovic to three sets. Mensik lists those two weeks as the highlights of his year, along with representing Czechia at the Olympics and Davis Cup.  He'll hope to end his 2024 campaign with another week to remember in Jeddah.",
  "image": "https://www.atptour.com/-/media/images/news/2024/12/17/20/26/mensik-jeddah-preview-2024.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eNext Gen ATP Finals\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eCzech primed for Jeddah debut\u003c/p\u003e\n    \u003cp\u003eDecember 17, 2024\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2024/12/17/20/26/mensik-jeddah-preview-2024.jpg\" alt=\"Jakub Mensik opens his Jeddah campaign Wednesday against Learner Tien.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eCorinne Dubreuil/ATP Tour\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eJakub Mensik opens his Jeddah campaign Wednesday against Learner Tien.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003e\u003ca href=\"https://www.atptour.com/en/players/jakub-mensik/m0ni/overview\"\u003eJakub Mensik\u003c/a\u003e earned his debut at the \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e with a breakout season that included four Top 10 wins. One of four Jeddah competitors inside the Top 50 of the PIF ATP Rankings — alongside \u003ca href=\"https://www.atptour.com/en/players/arthur-fils/f0f1/overview\"\u003eArthur Fils\u003c/a\u003e, \u003ca href=\"https://www.atptour.com/en/players/alex-michelsen/m0qi/overview\"\u003eAlex Michelsen\u003c/a\u003e and Shang Juncheng — Mensik knew before the 2024 season started that he wanted to end it at the 20-and-under showcase event.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It was one of my biggest goals to reach this event before the season,\u0026#34; he said this week. \u0026#34;I\u0026#39;m glad to be here. So far it\u0026#39;s amazing, the facilities and everything that they did for us. You can feel really that you\u0026#39;re one of the best younger players in the world.\u0026#34;\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThroughout his rise, Mensik has always been able to count on the unwavering support of his parents, Michal and Katerina. Both his parents are in Jeddah, and they have regularly travelled with Mensik since his junior tennis days.\u003c/p\u003e\n\u003cp\u003eThe family are frequent flyers now, but they recalled an airport mishap years ago, long before Mensik grew accustomed to the nomadic life. When he was nine, the family was waiting at baggage claim when Mensik became distracted by a cat. After going over to investigate, he lost track of his parents, who left the baggage area before realising their son had gone missing.\u003c/p\u003e\n\u003cp\u003eMensik remembers a scary wait until his father returned: \u0026#34;From nowhere, my dad appeared after 30, 45 minutes, and everything was good,\u0026#34; he said with a laugh.\u003c/p\u003e\n\u003cp\u003eIt will be hard to lose sight of Mensik this week as he competes under the spotlight of the \u003ca href=\"https://www.atptour.com/en/tournaments/next-gen-atp-finals/7696/overview\"\u003eNext Gen ATP Finals presented by PIF\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eWhile Mensik exceeded all outside expectations this year on the ATP Tour, the 19-year-old is not putting himself under any undue pressure in Jeddah. As the third seed, he will open his campaign against \u003ca href=\"https://www.atptour.com/en/players/learner-tien/t0ha/overview\"\u003eLearner Tien\u003c/a\u003e on Wednesday.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I never have expectations,\u0026#34; he explained. \u0026#34;Obviously just to enjoy this beautiful tournament. Of course I would be happy to win a couple of matches and of course I\u0026#39;m going here to win it.\u0026#34;\u003c/p\u003e\n\u003cp\u003eMensik took a similar approach at his first ATP Tour tournament this February in Doha, where he beat \u003ca href=\"https://www.atptour.com/en/players/andrey-rublev/re44/overview\"\u003eAndrey Rublev\u003c/a\u003e en route to the final. He also beat Rublev on his way to the quarter-finals at the \u003ca href=\"https://www.atptour.com/en/tournaments/shanghai/5014/overview\"\u003eRolex Shanghai Masters\u003c/a\u003e, where he pushed his idol \u003ca href=\"https://www.atptour.com/en/players/novak-djokovic/d643/overview\"\u003eNovak Djokovic\u003c/a\u003e to three sets. Mensik lists those two weeks as the highlights of his year, along with representing Czechia at the Olympics and Davis Cup. \u003c/p\u003e\n\u003cp\u003eHe\u0026#39;ll hope to end his 2024 campaign with another week to remember in Jeddah.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
