{
  "id": "bfbd7d7c-cd2a-44d5-b946-ea37c70dc5d7",
  "title": "Raducanu powers into Miami Open quarter-finals",
  "link": "https://www.bbc.com/sport/tennis/articles/c2d46lpw74go",
  "description": "Emma Raducanu is through to her first WTA 1,000 quarter-final after a blistering straight-set win over 17th seed Amanda Anisimova in Miami.",
  "author": "",
  "published": "Mon, 24 Mar 2025 21:03:27 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Sam Drury",
  "length": 3593,
  "excerpt": "Emma Raducanu is through to her first WTA 1,000 quarter-final after a blistering straight-set win over 17th seed Amanda Anisimova in Miami.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Emma Raducanu is through to her first WTA 1,000 quarter-final after a blistering straight-set win over 17th seed Amanda Anisimova in Miami.The Briton was in brilliant form from the off against her American opponent and needed just 24 minutes to secure the first set on her way to a 6-1 6-3 victory.It is the first time since her US Open triumph in 2021 that Raducanu has won four WTA main-draw matches in a row, and she was dominant in sweeping Anisimova aside.Prior to this tournament, Raducanu had lost five of six matches since the Australian Open - and last week ended her partnership with coach Vladimir Platenik after just two weeks.\"I've come a long way in the last week since Indian Wells, I wasn't necessarily feeling great about my tennis, about everything,\" the 22-year-old told Sky Sports.\"This week I have some really good people around me who I trust and who I have fun with off the court as well. That's extremely important.\"When I play my best I am definitely authentic, true to myself and creative. I feel when I am boxed into a regimented way then I am not able to express myself in the same way. So I'm happy with how I realised that this week.\"Raducanu broke in the opening game of the match and raced through the opening set without losing a point on her own serve.It was her returning that most impressed, though, as she continually put pressure on the Anisimova serve.The American grew increasingly angry as the first set went on and appeared to be struggling with a right wrist issue.Following a medical timeout between sets, she was much improved but could still not prevent Raducanu breaking to go 3-1 up in the second.Anisimova broke straight back but Raducanu once again demonstrated the resilience she has shown this week, breaking again before confidently serving out for the match.\"I just knew I had to dig every ball that I could and make it as physical as possible because I backed myself in that regard,\" the British number two added.\"I was happy with how I moved, how I extended the rallies from the first game, the first points and kind of just got in my opponent's head.\"Raducanu will play world number four Jessica Pegula in the last eight after the American beat Ukraine's Marta Kostyuk 6-2 6-3.Elsewhere, world number one Aryna Sabalenka is also through to the quarter-finals after a 6-4 6-4 win over defending champion Danielle Collins of the USA.The Belarusian secured the only break of the first set at 3-3 and, after breaking in the opening game of the second, went on to complete the victory in an hour and 19 minutes.Italy's Jasmine Paolini came from a set down to overcome four-time Grand Slam champion Naomi Osaka.The world number seven faced 15 break points to Osaka's five but battled through to progress 3-6 6-4 6-4.There was disappointment for world number three Coco Gauff who was beaten in straight sets by Poland's Magda Linette - 6-4 6-4.Meanwhile, Filipino teenager Alexandra Eala's eye-catching run will continue into her first WTA quarter-final after her fourth-round opponent, 10th seed Paula Badosa, withdrew before the match because of a lower back injury.In the men's singles, Alexander Zverev overcame a slow start to beat Australia's Jordan Thompson 7-5 6-4.The German was 4-1 down in the first set before fighting back to win eight of the next nine games and set up a fourth-round tie against Frances Tiafoe, who beat France's Arthur Fils. Taylor Fritz also advanced with a 7-5 6-3 win against Canada's Denis Shapovalov, but his American compatriot Tommy Paul suffered a 6-2 7-6 (7-4) defeat by Argentina's Francisco Cerundolo.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/645f/live/eeed2b70-08ec-11f0-abbf-a9351debc78d.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEmma Raducanu is through to her first WTA 1,000 quarter-final after a blistering straight-set win over 17th seed Amanda Anisimova in Miami.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe Briton was in brilliant form from the off against her American opponent and needed just 24 minutes to secure the first set on her way to a 6-1 6-3 victory.\u003c/p\u003e\u003cp\u003eIt is the first time since her US Open triumph in 2021 that Raducanu has won four WTA main-draw matches in a row, and she was dominant in sweeping Anisimova aside.\u003c/p\u003e\u003cp\u003ePrior to this tournament, Raducanu had lost five of six matches since the Australian Open - and last week \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cj4nggpk247o\"\u003eended her partnership with coach Vladimir Platenik\u003c/a\u003e after just two weeks.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve come a long way in the last week since Indian Wells, I wasn\u0026#39;t necessarily feeling great about my tennis, about everything,\u0026#34; the 22-year-old told Sky Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;This week I have some really good people around me who I trust and who I have fun with off the court as well. That\u0026#39;s extremely important.\u003c/p\u003e\u003cp\u003e\u0026#34;When I play my best I am definitely authentic, true to myself and creative. I feel when I am boxed into a regimented way then I am not able to express myself in the same way. So I\u0026#39;m happy with how I realised that this week.\u0026#34;\u003c/p\u003e\u003cp\u003eRaducanu broke in the opening game of the match and raced through the opening set without losing a point on her own serve.\u003c/p\u003e\u003cp\u003eIt was her returning that most impressed, though, as she continually put pressure on the Anisimova serve.\u003c/p\u003e\u003cp\u003eThe American grew increasingly angry as the first set went on and appeared to be struggling with a right wrist issue.\u003c/p\u003e\u003cp\u003eFollowing a medical timeout between sets, she was much improved but could still not prevent Raducanu breaking to go 3-1 up in the second.\u003c/p\u003e\u003cp\u003eAnisimova broke straight back but Raducanu once again demonstrated the resilience she has shown this week, breaking again before confidently serving out for the match.\u003c/p\u003e\u003cp\u003e\u0026#34;I just knew I had to dig every ball that I could and make it as physical as possible because I backed myself in that regard,\u0026#34; the British number two added.\u003c/p\u003e\u003cp\u003e\u0026#34;I was happy with how I moved, how I extended the rallies from the first game, the first points and kind of just got in my opponent\u0026#39;s head.\u0026#34;\u003c/p\u003e\u003cp\u003eRaducanu will play world number four Jessica Pegula in the last eight after the American beat Ukraine\u0026#39;s Marta Kostyuk 6-2 6-3.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eElsewhere, world number one Aryna Sabalenka is also through to the quarter-finals after a 6-4 6-4 win over defending champion Danielle Collins of the USA.\u003c/p\u003e\u003cp\u003eThe Belarusian secured the only break of the first set at 3-3 and, after breaking in the opening game of the second, went on to complete the victory in an hour and 19 minutes.\u003c/p\u003e\u003cp\u003eItaly\u0026#39;s Jasmine Paolini came from a set down to overcome four-time Grand Slam champion Naomi Osaka.\u003c/p\u003e\u003cp\u003eThe world number seven faced 15 break points to Osaka\u0026#39;s five but battled through to progress 3-6 6-4 6-4.\u003c/p\u003e\u003cp\u003eThere was disappointment for world number three Coco Gauff who was beaten in straight sets by Poland\u0026#39;s Magda Linette - 6-4 6-4.\u003c/p\u003e\u003cp\u003eMeanwhile, Filipino teenager Alexandra Eala\u0026#39;s eye-catching run will continue into her first WTA quarter-final after her fourth-round opponent, 10th seed Paula Badosa, withdrew before the match because of a lower back injury.\u003c/p\u003e\u003cp\u003eIn the men\u0026#39;s singles, Alexander Zverev overcame a slow start to beat Australia\u0026#39;s Jordan Thompson 7-5 6-4.\u003c/p\u003e\u003cp\u003eThe German was 4-1 down in the first set before fighting back to win eight of the next nine games and set up a fourth-round tie against Frances Tiafoe, who beat France\u0026#39;s Arthur Fils. \u003c/p\u003e\u003cp\u003eTaylor Fritz also advanced with a 7-5 6-3 win against Canada\u0026#39;s Denis Shapovalov, but his American compatriot Tommy Paul suffered a 6-2 7-6 (7-4) defeat by Argentina\u0026#39;s Francisco Cerundolo. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-03-24T21:03:27.673Z",
  "modifiedTime": null
}
