{
  "id": "c6a39868-6a13-478e-b0ce-4aeff15113ab",
  "title": "Raducanu 'didn't feel anxious' in Indian Wells loss",
  "link": "https://www.bbc.com/sport/tennis/articles/ckgnjwgwjyzo",
  "description": "Emma Raducanu struggles in a testing Indian Wells wind as she loses in her first appearance since being targeted by a stalker during a match.",
  "author": "",
  "published": "Thu, 06 Mar 2025 23:30:10 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 3420,
  "excerpt": "Emma Raducanu struggles in a testing Indian Wells wind as she loses in her first appearance since being targeted by a stalker during a match.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Emma Raducanu struggled in a testing Indian Wells wind as she was beaten on her first appearance since being targeted by a stalker during a match.The 22-year-old Briton was unsure if she was going to even play in the California tournament following the incident at the Dubai Tennis Championships on 18 February, where she spotted a man who she had reported for what WTA officials described as \"exhibiting fixated behaviour\".After deliberating whether to take an extended break from the WTA Tour, Raducanu decided to make the journey to Indian Wells - one of the biggest events outside of the four majors.However, the world number 55 was out of sorts as she lost 6-3 6-2 to Japan's Moyuka Uchijima in the first round of the BNP Paribas Open.\"I didn't feel anxious about any of the scenarios that have happened recently,\" Raducanu told BBC Sport.\"I think I had a good preparation with good people around.\"Raducanu, who has been given increased security at the WTA event in California, walked on court with a solemn expression and glanced several times around the vast arena.Throughout the match she showed little emotion and, unsurprisingly given the defeat, quickly left with a despondent look.Later, speaking in her post-match news conference, she added: \"I didn't have what happened in Dubai in my head at all today.\"I think today was just a bit of a curveball. I guess it's just nice, I'm just going to move on.\"In tricky conditions created by a brisk wind in the Californian desert, Raducanu looked uncomfortable throughout.The 2021 US Open champion made a host of errors to allow Uchijima, a tenacious opponent who adapted to the breeze quickly, to come out on top of the often scrappy rallies.Raducanu faced break points in her opening six service games as a result of the pressure created by the mistakes caused by her lack of accuracy.Five of those games ended in Raducanu losing serve as she trailed by a set and a break to the 52nd-ranked Uchijima.The Briton cut a subdued figure after she could not convert any of three chances to break back for 3-3.After Uchijima dug deep to hold, Raducanu did not win another point and trudged off court having lost for a sixth time in her nine matches this year.Raducanu was watched from the stands by Slovakian coach Vladimir Platenik, who has linked up with the British number two on a trial basis.Platenik, 49, was coaching New Zealand qualifier Lulu Sun when she beat Raducanu at Wimbledon last year, while he has also worked with top-10 players Dominika Cibulkova, Daria Kasatkina and Veronika Kudermetova.When asked which areas of her game she wanted to work on with Platenik, Raducanu smiled and said \"everything\".\"I'll need to improve starting the point. That's a big part of tennis. I can do that a lot better,\" she added.\"I could improve being more aggressive and having a better quality of shot going forward into the court.\"I could improve every area of my game after today's performance.\"British number three Sonay Kartal did move into the second round, making the most of being given a 'lucky loser' spot having lost in qualifying.Given a reprieve by a space opening up in the main draw, Kartal won 7-6 (8-6) 6-2 against 38-year-old American qualifier Varvara Lepchenko and faces Brazilian 16th seed Beatriz Haddad Maia next.In the men's draw, Jacob Fearnley was unable to set up an all-British clash with Jack Draper after losing to rising star Joao Fonseca.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ad05/live/80af11b0-fae0-11ef-abbc-0b14642f1f80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eEmma Raducanu struggled in a testing Indian Wells wind as she was beaten on her first appearance since \u003c/b\u003e\u003ca href=\"https://www.bbc.com/sport/tennis/articles/cp3yk4w4z37o\"\u003e\u003cb\u003ebeing targeted by a stalker\u003c/b\u003e\u003c/a\u003e\u003cb\u003e during a match.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe 22-year-old Briton was unsure if she was going to even play in the California tournament following the incident at the Dubai Tennis Championships on 18 February, where she spotted a man who she had reported for what WTA officials described as \u0026#34;exhibiting fixated behaviour\u0026#34;.\u003c/p\u003e\u003cp\u003eAfter deliberating whether to take an extended break from the WTA Tour, Raducanu decided to make the journey to Indian Wells - one of the biggest events outside of the four majors.\u003c/p\u003e\u003cp\u003eHowever, the world number 55 was out of sorts as she lost 6-3 6-2 to Japan\u0026#39;s Moyuka Uchijima in the first round of the BNP Paribas Open.\u003c/p\u003e\u003cp\u003e\u0026#34;I didn\u0026#39;t feel anxious about any of the scenarios that have happened recently,\u0026#34; Raducanu told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;I think I had a good preparation with good people around.\u0026#34;\u003c/p\u003e\u003cp\u003eRaducanu, who has been given increased security at the WTA event in California, walked on court with a solemn expression and glanced several times around the vast arena.\u003c/p\u003e\u003cp\u003eThroughout the match she showed little emotion and, unsurprisingly given the defeat, quickly left with a despondent look.\u003c/p\u003e\u003cp\u003eLater, speaking in her post-match news conference, she added: \u0026#34;I didn\u0026#39;t have what happened in Dubai in my head at all today.\u003c/p\u003e\u003cp\u003e\u0026#34;I think today was just a bit of a curveball. I guess it\u0026#39;s just nice, I\u0026#39;m just going to move on.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn tricky conditions created by a brisk wind in the Californian desert, Raducanu looked uncomfortable throughout.\u003c/p\u003e\u003cp\u003eThe 2021 US Open champion made a host of errors to allow Uchijima, a tenacious opponent who adapted to the breeze quickly, to come out on top of the often scrappy rallies.\u003c/p\u003e\u003cp\u003eRaducanu faced break points in her opening six service games as a result of the pressure created by the mistakes caused by her lack of accuracy.\u003c/p\u003e\u003cp\u003eFive of those games ended in Raducanu losing serve as she trailed by a set and a break to the 52nd-ranked Uchijima.\u003c/p\u003e\u003cp\u003eThe Briton cut a subdued figure after she could not convert any of three chances to break back for 3-3.\u003c/p\u003e\u003cp\u003eAfter Uchijima dug deep to hold, Raducanu did not win another point and trudged off court having lost for a sixth time in her nine matches this year.\u003c/p\u003e\u003cp\u003eRaducanu was watched from the stands by Slovakian coach Vladimir Platenik, who has linked up with the British number two on a trial basis.\u003c/p\u003e\u003cp\u003ePlatenik, 49, was coaching New Zealand qualifier Lulu Sun when she beat Raducanu at Wimbledon last year, while he has also worked with top-10 players Dominika Cibulkova, Daria Kasatkina and Veronika Kudermetova.\u003c/p\u003e\u003cp\u003eWhen asked which areas of her game she wanted to work on with Platenik, Raducanu smiled and said \u0026#34;everything\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ll need to improve starting the point. That\u0026#39;s a big part of tennis. I can do that a lot better,\u0026#34; she added.\u003c/p\u003e\u003cp\u003e\u0026#34;I could improve being more aggressive and having a better quality of shot going forward into the court.\u003c/p\u003e\u003cp\u003e\u0026#34;I could improve every area of my game after today\u0026#39;s performance.\u0026#34;\u003c/p\u003e\u003cp\u003eBritish number three Sonay Kartal did move into the second round, making the most of being given a \u0026#39;lucky loser\u0026#39; spot having lost in qualifying.\u003c/p\u003e\u003cp\u003eGiven a reprieve by a space opening up in the main draw, Kartal won 7-6 (8-6) 6-2 against 38-year-old American qualifier Varvara Lepchenko and faces Brazilian 16th seed Beatriz Haddad Maia next.\u003c/p\u003e\u003cp\u003eIn the men\u0026#39;s draw, Jacob Fearnley was unable to set up an all-British clash with Jack Draper after \u003ca href=\"https://www.bbc.com/sport/tennis/articles/c17qnvr5ezlo\"\u003elosing to rising star Joao Fonseca.\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-06T23:30:10.257Z",
  "modifiedTime": null
}
