{
  "id": "e8317eb9-9d09-42b8-b3a6-d37ab74f3a63",
  "title": "Boulter breaks new ground with first WTA clay win",
  "link": "https://www.bbc.com/sport/tennis/articles/c74nwyeldn3o",
  "description": "British number one Katie Boulter earns the first WTA Tour clay-court win of her career at the age of 28.",
  "author": "",
  "published": "Tue, 22 Apr 2025 18:31:51 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 3475,
  "excerpt": "British number one Katie Boulter earns the first WTA Tour clay-court win of her career at the age of 28.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "British number one Katie Boulter has broken new ground by earning the first WTA Tour clay-court win of her career at the age of 28.Boulter moved into the Madrid Open second round with a 4-6 6-2 6-1 victory over Czech opponent Katerina Siniakova.Despite being established at the top end of the game, Boulter’s experience and exposure on the red dirt has been limited.The world number 40’s appearance at the WTA 1,000 tournament in the Spanish capital - an important event in the build-up to next month’s French Open - is only the fifth time she has competed in the main draw of a tour-level clay event.\"I've always known clay is going to be my toughest surface but I never really gave myself the chance to play well on it and build on it,\" she told BBC Sport.\"With injuries, and the timing of them, last year was my first clay-court season. \"I felt my level last year was really improving. I got unlucky not to beat [Paula] Badosa in the first round of the French Open - and I felt I deserved more from last season.\"Boulter's reward is a second-round match against Italian sixth seed Jasmine Paolini, who reached the French Open final last year.\"I hope I can show that - even if not this week or next week - I can play well on clay,\" she added.\"You see a lot of big ball-strikers playing well and I asked myself why it can't be me.\"Meanwhile, British number five Francesca Jones moved into the main draw after winning her second qualifying match.Jones, playing in her second event since collapsing on court this month, won 7-6 (7-3) 3-6 6-1 against Spain's Cristina Bucsa.It will be the first time the 24-year-old plays in the main draw of a WTA 1000 tournament - the most prestigious outside of the four majors.Victory for Boulter comes as she battles to keep the British number one ranking with Emma Raducanu and Sonay Kartal closing in.Boulter has been the nation's leading women's player since June 2023, but has dropped down the world rankings in a stop-start season.Raducanu is up to 49th after reaching the Miami quarter-finals last month, while Kartal's rapid rise has moved her up to 60th.Both play their Madrid first-round matches on Wednesday.\"I don't feel any pressure at all,\" Boulter told BBC Sport before beating Siniakova.\"I'm very comfortable in the seat that I am and I know that every single person has a different journey and my journey is not going to be compared to anyone else's - I'm proud of that.\"I've been the British number one for two years, it's been a fair while now. It's something which I'm quite used to.\"After winning one and losing one of her Billie Jean King Cup singles matches last week on indoor clay in the Netherlands, Boulter went to Alicante - where her fiance Alex de Minaur has long been based - for a training week.She decided that was the sensible option - instead of squeezing in another WTA clay-court event before Madrid - as she continues to manage a foot injury.The issue has left her only able to play five tournaments this season, missing almost two months of the WTA Tour between the Australian Open in January and Indian Wells in March.\"I want to see the girls going higher and higher [in the rankings], but personally I have my own goals and try to focus on those a lot,\" added Boulter, who secured GB's place in the Billie Jean King Cup Finals alongside Jodie Burrage in the deciding doubles.\"For me I just need to try and stay healthy. That's that most important thing and then the ranking will take care of itself.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e31c/live/4d598fc0-1fa7-11f0-a3dc-e9948827737f.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eBritish number one Katie Boulter has broken new ground by earning the first WTA Tour clay-court win of her career at the age of 28.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBoulter moved into the Madrid Open second round with a 4-6 6-2 6-1 victory over Czech opponent Katerina Siniakova.\u003c/p\u003e\u003cp\u003eDespite being established at the top end of the game, Boulter’s experience and exposure on the red dirt has been limited.\u003c/p\u003e\u003cp\u003eThe world number 40’s appearance at the WTA 1,000 tournament in the Spanish capital - an important event in the build-up to next month’s French Open - is only the fifth time she has competed in the main draw of a tour-level clay event.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve always known clay is going to be my toughest surface but I never really gave myself the chance to play well on it and build on it,\u0026#34; she told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;With injuries, and the timing of them, last year was my first clay-court season. \u003c/p\u003e\u003cp\u003e\u0026#34;I felt my level last year was really improving. I got unlucky not to beat [Paula] Badosa in the first round of the French Open - and I felt I deserved more from last season.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eBoulter\u0026#39;s reward is a second-round match against Italian sixth seed Jasmine Paolini, who reached the French Open final last year.\u003c/p\u003e\u003cp\u003e\u0026#34;I hope I can show that - even if not this week or next week - I can play well on clay,\u0026#34; she added.\u003c/p\u003e\u003cp\u003e\u0026#34;You see a lot of big ball-strikers playing well and I asked myself why it can\u0026#39;t be me.\u0026#34;\u003c/p\u003e\u003cp\u003eMeanwhile, British number five \u003cb\u003eFrancesca Jones\u003c/b\u003e moved into the main draw after winning her second qualifying match.\u003c/p\u003e\u003cp\u003eJones, playing in her second event since \u003ca href=\"https://www.bbc.com/sport/tennis/articles/c1lmg50vz1mo\"\u003ecollapsing on court\u003c/a\u003e this month, won 7-6 (7-3) 3-6 6-1 against Spain\u0026#39;s Cristina Bucsa.\u003c/p\u003e\u003cp\u003eIt will be the first time the 24-year-old plays in the main draw of a WTA 1000 tournament - the most prestigious outside of the four majors.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eVictory for Boulter comes as she battles to keep the British number one ranking with Emma Raducanu and Sonay Kartal closing in.\u003c/p\u003e\u003cp\u003eBoulter has been the nation\u0026#39;s leading women\u0026#39;s player since June 2023, but has dropped down the world rankings in a stop-start season.\u003c/p\u003e\u003cp\u003eRaducanu is up to 49th after reaching the Miami quarter-finals last month, while Kartal\u0026#39;s rapid rise has moved her up to 60th.\u003c/p\u003e\u003cp\u003eBoth play their Madrid first-round matches on Wednesday.\u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t feel any pressure at all,\u0026#34; Boulter told BBC Sport before beating Siniakova.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m very comfortable in the seat that I am and I know that every single person has a different journey and my journey is not going to be compared to anyone else\u0026#39;s - I\u0026#39;m proud of that.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve been the British number one for two years, it\u0026#39;s been a fair while now. It\u0026#39;s something which I\u0026#39;m quite used to.\u0026#34;\u003c/p\u003e\u003cp\u003eAfter winning one and losing one of her Billie Jean King Cup singles matches last week on indoor clay in the Netherlands, Boulter went to Alicante - where her fiance Alex de Minaur has long been based - for a training week.\u003c/p\u003e\u003cp\u003eShe decided that was the sensible option - instead of squeezing in another WTA clay-court event before Madrid - as she continues to manage a foot injury.\u003c/p\u003e\u003cp\u003eThe issue has left her only able to play five tournaments this season, missing almost two months of the WTA Tour between the Australian Open in January and Indian Wells in March.\u003c/p\u003e\u003cp\u003e\u0026#34;I want to see the girls going higher and higher [in the rankings], but personally I have my own goals and try to focus on those a lot,\u0026#34; added Boulter, who \u003ca href=\"https://www.bbc.com/sport/tennis/articles/cwy0k7kwnxlo\"\u003esecured GB\u0026#39;s place in the Billie Jean King Cup Finals\u003c/a\u003e alongside Jodie Burrage in the deciding doubles.\u003c/p\u003e\u003cp\u003e\u0026#34;For me I just need to try and stay healthy. That\u0026#39;s that most important thing and then the ranking will take care of itself.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-22T08:49:04.824Z",
  "modifiedTime": null
}
