{
  "id": "eb3a652f-6083-44b4-b38d-6996a4068140",
  "title": "Rune on Agassi Collab: ‘I've never met a guy who sees the game this way’",
  "link": "https://www.atptour.com/en/news/rune-agassi-collab-washington-2025",
  "description": "It started with a text message, was followed by a phone call and culminated in a three-day training block in Washington D.C. ahead of the start of the Mubadala Citi DC Open. World No. 8 Holger Rune, looking for an edge coming into the pivotal US summer hard-court swing, reached out to Andre Agassi to help hone his game at the very venue at which the two-time US Open champion won five of his 60 career titles. “It was nice. We've been in touch for a while and we did a couple of days together here in Washington, where he was helping me with a few things, giving his opinion,” said the 22-year-old Dane, who will open his Washington campaign against Frenchman Alexandre Muller or a qualifier. “It was really a big pleasure. He’s a very, very wise man. I've never met a guy who sees the game this way.” Rune said that despite the short partnership, he feels that he emerged stronger for it. “Obviously he had an amazing return himself and I also return well and he had a few tips there and how I can be slightly better there and then in general about the game,” he said. “It was a really short period but definitely he gave me an insight of where he sees me in the future, where he sees me now and obviously there's a lot of things to improve. He helped me to get my focus and my eyes on the right things, together with my coach Lars [Christensen]. It was really cool to spend some days with him. “I’ve watched a lot of him on YouTube and his style and the way of playing was amazing. His career speaks for itself.” Asked if he might collab with Agassi in the future, the former World No. 4 said, “He’s a great man, so I would definitely like that.” [ATP APP] Rune is 13th in the PIF ATP Live Race to Turin after going 22-14 through Wimbledon. He defeated Carlos Alcaraz to win the ATP 500 title in Barcelona and reached the ATP Masters 1000 final in Indian Wells  (l. to Draper). But there have also been six opening-round losses this season, including in his last start at Wimbledon, where he fell in five sets to Nicolas Jarry. “I've had a little bit of an up-and-down down year,” he said. ”I’ve had some good weeks, some bad weeks and that’s what I'm trying to change. I’m thankful to be here in Washington to be able to start my US swing earlier to get matches and to get the rhythm and hopefully do some damage. “I’m already thinking about Turin with the big weeks coming ahead. It’s a golden swing for me in which I don’t have a lot of points to defend.” Rune has a 161-99 career record according to the Infosys ATP Win/Loss Index. He has split four Lexus ATP Head2Head meetings with Alcaraz and has won two of five meetings with Jannik Sinner, but has watched on as the game’s dominant duo has shared the past seven Grand Slam titles, while he is yet to contest a major final. “There is definitely a gap at the moment,” he said. “Obviously there are players including myself that can beat them. But it's all about being in those Grand Slam finals and those Masters 1000 finals playing against them and I think there is space for one more person.” Rune won the Rolex Paris Masters in 2022 when he defeated five Top 10 players, a feat that saw him qualify for the Nitto ATP Finals. Since then he has added two titles: Munich in 2023 and Barcelona this year. [NEWSLETTER FORM]",
  "author": "",
  "published": "Mon, 21 Jul 2025 01:20:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Washington",
    "Holger Rune",
    "2025"
  ],
  "byline": "",
  "length": 3888,
  "excerpt": "Former World No.. 4 Holger Rune turns to Andre Agassi for inspiration ahead of the Mubadala Citi DC Open.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Washington World No. 8 teamed up with Agassi on the eve of the Mubadala Citi DC Open July 21, 2025 2025 Jessie Alcheh/Wick Photography Holger Rune enlisted Andre Agassi to help with his preparation for the Mubadala Citi DC Open. By Paul Macpherson It started with a text message, was followed by a phone call and culminated in a three-day training block in Washington D.C. ahead of the start of the Mubadala Citi DC Open. World No. 8 Holger Rune, looking for an edge coming into the pivotal US summer hard-court swing, reached out to Andre Agassi to help hone his game at the very venue at which the two-time US Open champion won five of his 60 career titles. “It was nice. We've been in touch for a while and we did a couple of days together here in Washington, where he was helping me with a few things, giving his opinion,” said the 22-year-old Dane, who will open his Washington campaign against Frenchman Alexandre Muller or a qualifier. “It was really a big pleasure. He’s a very, very wise man. I've never met a guy who sees the game this way.” Rune said that despite the short partnership, he feels that he emerged stronger for it. “Obviously he had an amazing return himself and I also return well and he had a few tips there and how I can be slightly better there and then in general about the game,” he said. “It was a really short period but definitely he gave me an insight of where he sees me in the future, where he sees me now and obviously there's a lot of things to improve. He helped me to get my focus and my eyes on the right things, together with my coach Lars [Christensen]. It was really cool to spend some days with him. “I’ve watched a lot of him on YouTube and his style and the way of playing was amazing. His career speaks for itself.” Asked if he might collab with Agassi in the future, the former World No. 4 said, “He’s a great man, so I would definitely like that.” Rune is 13th in the PIF ATP Live Race to Turin after going 22-14 through Wimbledon. He defeated Carlos Alcaraz to win the ATP 500 title in Barcelona and reached the ATP Masters 1000 final in Indian Wells  (l. to Draper). But there have also been six opening-round losses this season, including in his last start at Wimbledon, where he fell in five sets to Nicolas Jarry. “I've had a little bit of an up-and-down down year,” he said. ”I’ve had some good weeks, some bad weeks and that’s what I'm trying to change. I’m thankful to be here in Washington to be able to start my US swing earlier to get matches and to get the rhythm and hopefully do some damage. “I’m already thinking about Turin with the big weeks coming ahead. It’s a golden swing for me in which I don’t have a lot of points to defend.” Rune has a 161-99 career record according to the Infosys ATP Win/Loss Index. He has split four Lexus ATP Head2Head meetings with Alcaraz and has won two of five meetings with Jannik Sinner, but has watched on as the game’s dominant duo has shared the past seven Grand Slam titles, while he is yet to contest a major final. “There is definitely a gap at the moment,” he said. “Obviously there are players including myself that can beat them. But it's all about being in those Grand Slam finals and those Masters 1000 finals playing against them and I think there is space for one more person.” {{player.PlayerCountryCode}} {{player.Record}} {{opponent.Record}} {{opponent.PlayerCountryCode}} Rune won the Rolex Paris Masters in 2022 when he defeated five Top 10 players, a feat that saw him qualify for the Nitto ATP Finals. Since then he has added two titles: Munich in 2023 and Barcelona this year.",
  "image": "https://www.atptour.com/-/media/images/news/2025/07/21/01/13/rune-agassi-washington-2025-2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eWashington\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eWorld No. 8 teamed up with Agassi on the eve of the Mubadala Citi DC Open\u003c/p\u003e\n    \u003cp\u003eJuly 21, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/07/21/01/13/rune-agassi-washington-2025-2.jpg\" alt=\"Holger Rune enlisted Andre Agassi to help with his preparation for the Mubadala Citi DC Open.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003e2025 Jessie Alcheh/Wick Photography\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eHolger Rune enlisted Andre Agassi to help with his preparation for the Mubadala Citi DC Open.\u003c/span\u003e\n        \u003cspan\u003eBy Paul Macpherson\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIt started with a text message, was followed by a phone call and culminated in a three-day training block in Washington D.C. ahead of the start of the \u003ca href=\"https://www.atptour.com/en/tournaments/washington/418/overview\"\u003eMubadala Citi DC Open\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWorld No. 8 \u003ca href=\"https://www.atptour.com/en/players/holger-rune/r0dg/overview\"\u003eHolger Rune\u003c/a\u003e, looking for an edge coming into the pivotal US summer hard-court swing, reached out to \u003ca href=\"https://www.atptour.com/en/players/andre-agassi/a092/overview\"\u003eAndre Agassi\u003c/a\u003e to help hone his game at the very venue at which the two-time \u003ca href=\"https://www.atptour.com/en/tournaments/us-open/560/overview\"\u003eUS Open\u003c/a\u003e champion won five of his 60 career titles.\u003c/p\u003e\n\u003cp\u003e“It was nice. We\u0026#39;ve been in touch for a while and we did a couple of days together here in Washington, where he was helping me with a few things, giving his opinion,” said the 22-year-old Dane, who will open his Washington campaign against Frenchman \u003ca href=\"https://www.atptour.com/en/players/alexandre-muller/mp20/overview\"\u003eAlexandre Muller\u003c/a\u003e or a qualifier.\u003c/p\u003e\n\u003cp\u003e“It was really a big pleasure. He’s a very, very wise man. I\u0026#39;ve never met a guy who sees the game this way.”\u003c/p\u003e\n\u003cp\u003eRune said that despite the short partnership, he feels that he emerged stronger for it.\u003c/p\u003e\n\u003cp\u003e“Obviously he had an amazing return himself and I also return well and he had a few tips there and how I can be slightly better there and then in general about the game,” he said. \u003c/p\u003e\n\u003cp\u003e“It was a really short period but definitely he gave me an insight of where he sees me in the future, where he sees me now and obviously there\u0026#39;s a lot of things to improve. He helped me to get my focus and my eyes on the right things, together with my coach Lars [Christensen]. It was really cool to spend some days with him.\u003c/p\u003e\n\u003cp\u003e“I’ve watched a lot of him on YouTube and his style and the way of playing was amazing. His career speaks for itself.”\u003c/p\u003e\n\u003cp\u003eAsked if he might collab with Agassi in the future, the former World No. 4 said, “He’s a great man, so I would definitely like that.”\u003c/p\u003e\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/apps?utm_source=atp\u0026amp;utm_medium=article\u0026amp;utm_campaign=app_banner\" target=\"_blank\"\u003e\u003cimg src=\"-/media/\n9333ed00493246e6a2ad692fa18710b7.ashx\" alt=\"The Official App Of Tennis | Download ATP WTA Live App\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eRune is 13th in the PIF ATP Live Race to Turin after going 22-14 through \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e. He defeated \u003ca href=\"https://www.atptour.com/en/players/carlos-alcaraz/a0e2/overview\"\u003eCarlos Alcaraz\u003c/a\u003e to win the ATP 500 title in Barcelona and reached the ATP Masters 1000 final in Indian Wells  (l. to Draper). But there have also been six opening-round losses this season, including in his last start at \u003ca href=\"https://www.atptour.com/en/tournaments/wimbledon/540/overview\"\u003eWimbledon\u003c/a\u003e, where he fell in five sets to \u003ca href=\"https://www.atptour.com/en/players/nicolas-jarry/j551/overview\"\u003eNicolas Jarry\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e“I\u0026#39;ve had a little bit of an up-and-down down year,” he said. ”I’ve had some good weeks, some bad weeks and that’s what I\u0026#39;m trying to change. I’m thankful to be here in Washington to be able to start my US swing earlier to get matches and to get the rhythm and hopefully do some damage.\u003c/p\u003e\n\u003cp\u003e“I’m already thinking about Turin with the big weeks coming ahead. It’s a golden swing for me in which I don’t have a lot of points to defend.”\u003c/p\u003e\n\u003cp\u003e\u003cimg alt=\"\u0026lt;a href=\u0026#39;https://www.atptour.com/en/players/holger-rune/r0dg/overview\u0026#39;\u0026gt;Holger Rune\u0026lt;/a\u0026gt; is the third seed at the \u0026lt;a href=\u0026#39;https://www.atptour.com/en/tournaments/washington/418/overview\u0026#39;\u0026gt;Mubadala Citi DC Open\u0026lt;/a\u0026gt;.\" src=\"https://www.atptour.com/-/media/images/news/2025/07/20/21/03/rune-washington-2025-agassi.jpg\"/\u003e\n\u003c/p\u003e\u003cp\u003eRune has a 161-99 career record according to the Infosys ATP Win/Loss Index. He has split four Lexus ATP Head2Head meetings with Alcaraz and has won two of five meetings with \u003ca href=\"https://www.atptour.com/en/players/jannik-sinner/s0ag/overview\"\u003eJannik Sinner\u003c/a\u003e, but has watched on as the game’s dominant duo has shared the past  seven Grand Slam titles, while he is yet to contest a major final.\u003c/p\u003e\n\n\u003cp\u003e“There is definitely a gap at the moment,” he said. “Obviously there are players including myself that can beat them. But it\u0026#39;s all about being in those Grand Slam finals and those Masters 1000 finals playing against them and I think there is space for one more person.”\u003c/p\u003e\n\u003cdiv v-else=\"\" v-cloak=\"\"\u003e\n            \u003cdiv v-if=\"!isDouble\"\u003e\n                        \u003cflag :country=\"player.PlayerCountryCode.toLowerCase()\"\u003e\u003c/flag\u003e \u003cp\u003e\u003cspan\u003e{{player.PlayerCountryCode}}\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n            \u003cdiv\u003e\n                    \u003cp\u003e{{player.Record}}\u003c/p\u003e\n                    \n                    \u003cp\u003e{{opponent.Record}}\u003c/p\u003e\n                \u003c/div\u003e\n            \u003cdiv v-if=\"!isDouble\"\u003e\n                        \u003cflag :country=\"opponent.PlayerCountryCode.toLowerCase()\"\u003e\u003c/flag\u003e \u003cp\u003e\u003cspan\u003e{{opponent.PlayerCountryCode}}\u003c/span\u003e\n                    \u003c/p\u003e\u003c/div\u003e\n        \u003c/div\u003e\n\n\u003cp\u003eRune won the \u003ca href=\"https://www.atptour.com/en/tournaments/paris/352/overview\"\u003eRolex Paris Masters\u003c/a\u003e in 2022 when he defeated five Top 10 players, a feat that saw him qualify for the \u003ca href=\"https://www.atptour.com/en/tournaments/nitto-atp-finals/605/overview\"\u003eNitto ATP Finals\u003c/a\u003e. Since then he has added two titles: Munich in 2023 and Barcelona this year.\u003c/p\u003e\n\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
