{
  "id": "f9816938-58ac-4c66-a02b-a83df7635c6b",
  "title": "Qualifiers Harrison \u0026 King triumph in Dallas for first ATP title",
  "link": "https://www.atptour.com/en/news/dallas-2025-doubles-final",
  "description": "In just their second ATP Tour event as a team, Christian Harrison and Evan King earned glory on Sunday. The Americans defeated Uruguayan Ariel Behar and American Robert Galloway 7-6(4), 7-6(4) to win the Dallas Open. The qualifiers did not lose a set in six matches en route to the ATP 500 trophy. Thanks everybody for coming. Guys, congrats on the final. I’ve known you guys for a long time, you guys have been doing a lot of winning, so it was a good match today. Congrats on the week,” Harrison said to Behar and Galloway during the trophy ceremony. “Thanks to all my friends and family. I’ve got a big crowd over there, thanks for coming out. All the ball kids, everybody involved in the tournament, the Cowboys, this facility is unreal. I think we had a great time all week. “Also thanks to my partner. It was a lot of fun playing with you the whole week. Looking forward to the future, thanks for having my back on the court the whole time.” Harrison and King debuted together last November at an ATP Challenger Tour event in Sao Paulo, Brazil, making the final. That start was a sign of things to come. The champions did not play a tie-break en route to the championship clash, which proved their toughest test of the week. King served for the title at 5-4 in the second set, but was unable to convert. The qualifiers did not panic, though. King played a tremendous point to close out the tournament. The lefty hit a perfectly placed backhand lob to reset the point at 6/4 and then poached to put away a final volley for the trophy. The winners saved seven of the eight break points they faced according to Infosys ATP Stats. Although they were on opposite sides of the net, it was a special match for King and Galloway, who played six tournaments together in 2017. ”Congrats to Rob and Ari. I think it’s honestly surreal. We played Futures together, we’ve run Greyhounds in Bosnia to tournaments… to be on this stage, it’s crazy,” King said. “Christian, thanks for playing, really appreciate it. Had a good time this week.” Harrison had reached two previous finals, including one earlier this year in Auckland with Rajeev Ram. He also made the final in Delray Beach four years ago with brother Ryan Harrison. King had never played for an ATP Tour crown. The Dallas titlists climbed to seventh in the PIF ATP Live Doubles Teams Rankings. Behar and Galloway are tied for 11th. [NEWSLETTER FORM]",
  "author": "",
  "published": "Sun, 09 Feb 2025 23:47:00 Z",
  "source": "https://www.atptour.com/en/media/rss-feed/xml-feed",
  "categories": [
    "Doubles",
    "Dallas",
    "Match Report",
    "Story of the Season",
    "Christian Harrison",
    "Evan King"
  ],
  "byline": "",
  "length": 2666,
  "excerpt": "In just their second ATP Tour event as a team, Christian Harrison and Evan King earned glory on Sunday. The Americans defeated Uruguayan Ariel Behar and American Robert Galloway 7-6(4), 7-6(4) to win the Dallas Open.",
  "siteName": "ATP Tour",
  "favicon": "",
  "text": "Doubles Americans do not lose a set en route to ATP 500 glory February 09, 2025 Sam Hodde/Getty Images Evan King and Christian Harrison defeat Ariel Behar and Robert Galloway Sunday to win the Dallas title. By ATP Staff In just their second ATP Tour event as a team, Christian Harrison and Evan King earned glory on Sunday. The Americans defeated Uruguayan Ariel Behar and American Robert Galloway 7-6(4), 7-6(4) to win the Dallas Open. The qualifiers did not lose a set in six matches en route to the ATP 500 trophy. Thanks everybody for coming. Guys, congrats on the final. I’ve known you guys for a long time, you guys have been doing a lot of winning, so it was a good match today. Congrats on the week,” Harrison said to Behar and Galloway during the trophy ceremony. “Thanks to all my friends and family. I’ve got a big crowd over there, thanks for coming out. All the ball kids, everybody involved in the tournament, the Cowboys, this facility is unreal. I think we had a great time all week. “Also thanks to my partner. It was a lot of fun playing with you the whole week. Looking forward to the future, thanks for having my back on the court the whole time.” Harrison and King debuted together last November at an ATP Challenger Tour event in Sao Paulo, Brazil, making the final. That start was a sign of things to come. The champions did not play a tie-break en route to the championship clash, which proved their toughest test of the week. King served for the title at 5-4 in the second set, but was unable to convert. The qualifiers did not panic, though. King played a tremendous point to close out the tournament. The lefty hit a perfectly placed backhand lob to reset the point at 6/4 and then poached to put away a final volley for the trophy. The winners saved seven of the eight break points they faced according to Infosys ATP Stats. Although they were on opposite sides of the net, it was a special match for King and Galloway, who played six tournaments together in 2017. ”Congrats to Rob and Ari. I think it’s honestly surreal. We played Futures together, we’ve run Greyhounds in Bosnia to tournaments… to be on this stage, it’s crazy,” King said. “Christian, thanks for playing, really appreciate it. Had a good time this week.” Harrison had reached two previous finals, including one earlier this year in Auckland with Rajeev Ram. He also made the final in Delray Beach four years ago with brother Ryan Harrison. King had never played for an ATP Tour crown. The Dallas titlists climbed to seventh in the PIF ATP Live Doubles Teams Rankings. Behar and Galloway are tied for 11th.",
  "image": "https://www.atptour.com/-/media/images/news/2025/02/09/23/42/king-harrison-dallas-2025-final.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n    \n\n\n        \u003cp\u003e\u003cspan\u003eDoubles\u003c/span\u003e\u003c/p\u003e\n    \u003cp\u003eAmericans do not lose a set en route to ATP 500 glory\u003c/p\u003e\n    \u003cp\u003eFebruary 09, 2025\u003c/p\u003e\n\n        \u003cp\u003e\u003cimg src=\"https://www.atptour.com/-/media/images/news/2025/02/09/23/42/king-harrison-dallas-2025-final.jpg\" alt=\"Evan King and Christian Harrison defeat Ariel Behar and Robert Galloway Sunday to win the Dallas title.\"/\u003e\n        \u003c/p\u003e\n\n    \u003cdiv\u003e\n        \u003cp\u003eSam Hodde/Getty Images\u003c/p\u003e\n        \u003cp\u003e\u003cspan\u003eEvan King and Christian Harrison defeat Ariel Behar and Robert Galloway Sunday to win the Dallas title.\u003c/span\u003e\n        \u003cspan\u003eBy ATP Staff\u003c/span\u003e\n    \u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eIn just their second ATP Tour event as a team, Christian Harrison and Evan King earned glory on Sunday.\u003c/p\u003e\n\u003cp\u003eThe Americans defeated Uruguayan Ariel Behar and American Robert Galloway 7-6(4), 7-6(4) to win the Dallas Open. The qualifiers did not lose a set in six matches en route to the ATP 500 trophy.\u003c/p\u003e\n\u003cp\u003eThanks everybody for coming. Guys, congrats on the final. I’ve known you guys for a long time, you guys have been doing a lot of winning, so it was a good match today. Congrats on the week,” Harrison said to Behar and Galloway during the trophy ceremony. “Thanks to all my friends and family. I’ve got a big crowd over there, thanks for coming out. All the ball kids, everybody involved in the tournament, the Cowboys, this facility is unreal. I think we had a great time all week.\u003c/p\u003e\n\u003cp\u003e“Also thanks to my partner. It was a lot of fun playing with you the whole week. Looking forward to the future, thanks for having my back on the court the whole time.”\u003c/p\u003e\n\u003cp\u003eHarrison and King debuted together last November at an ATP Challenger Tour event in Sao Paulo, Brazil, making the final. That start was a sign of things to come.\u003c/p\u003e\n\u003cp\u003eThe champions did not play a tie-break en route to the championship clash, which proved their toughest test of the week. King served for the title at 5-4 in the second set, but was unable to convert.\u003c/p\u003e\n\u003cp\u003e\u003ca rel=\"noopener noreferrer\" href=\"https://www.atptour.com/en/news/it-all-adds-up-hub\" target=\"_blank\"\u003e\u003cimg alt=\"It All Adds Up\" src=\"https://www.atptour.com/-/media/images/news/2025/01/07/03/30/it-all-adds-up-banner.jpg?w=100%25\u0026amp;hash=31EE1C2D1B04C8D5532DFFA763CBA0FF\"/\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe qualifiers did not panic, though. King played a tremendous point to close out the tournament. The lefty hit a perfectly placed backhand lob to reset the point at 6/4 and then poached to put away a final volley for the trophy. The winners saved seven of the eight break points they faced according to Infosys ATP Stats.\u003c/p\u003e\n\u003cp\u003eAlthough they were on opposite sides of the net, it was a special match for King and Galloway, who played six tournaments together in 2017.\u003c/p\u003e\n\u003cp\u003e”Congrats to Rob and Ari. I think it’s honestly surreal. We played Futures together, we’ve run Greyhounds in Bosnia to tournaments… to be on this stage, it’s crazy,” King said. “Christian, thanks for playing, really appreciate it. Had a good time this week.”\u003c/p\u003e\n\u003cp\u003eHarrison had reached two previous finals, including one earlier this year in Auckland with Rajeev Ram. He also made the final in Delray Beach four years ago with brother Ryan Harrison. King had never played for an ATP Tour crown.\u003c/p\u003e\n\n\u003cp\u003eThe Dallas titlists climbed to seventh in the PIF ATP Live Doubles Teams Rankings. Behar and Galloway are tied for 11th.\u003c/p\u003e\n\n    \n\n\n\n\n    \n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
