{
  "id": "fad0b767-edb7-4ac9-970b-f55d097e8a33",
  "title": "Flag error could have 'strong implications' for Kasatkina",
  "link": "https://www.bbc.com/sport/tennis/articles/cx2pl3z6y0no",
  "description": "Russia's Daria Kasatkina's management say a flag error could have \"strong implications\" for the player after she was wrongly listed as representing Spain at a WTA Tour draw ceremony - leading to suggestions she had switched allegiance.",
  "author": "",
  "published": "Sun, 02 Feb 2025 16:02:28 GMT",
  "source": "http://feeds.bbci.co.uk/sport/tennis/rss.xml",
  "categories": null,
  "byline": "Jonathan Jurejko",
  "length": 2208,
  "excerpt": "Russia's Daria Kasatkina's management say a flag error could have \"strong implications\" for the player after she was wrongly listed as representing Spain at a WTA Tour draw ceremony - leading to suggestions she had switched allegiance.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Russia's Daria Kasatkina's management say a flag error could have \"strong implications\" for the player after she was wrongly listed as representing Spain at a WTA Tour draw ceremony - leading to suggestions she had switched allegiance.BBC Sport has been told Kasatkina, who has criticised Russia's LGBT rules and opposed the war in Ukraine, has not switched allegiance.The appearance of the Spanish flag next to the world number 11's name during the Abu Dhabi Open draw attracted attention, sparking online discussion that she had decided to stop representing Russia.\"It is incorrect and we can categorically deny she is switching to Spain,\" Kasatkina's management told BBC Sport.Later on Sunday, tournament organisers apologised to 27-year-old Kasatkina for the error.\"This was an entirely administrative mistake and has now been corrected,\" they said.Kasatkina, who is one of a few openly gay players on the WTA Tour, publicly came out in a video interview, external with Russian blogger Vitya Kravchenko in July 2022.In the same video, the 2022 French Open semi-finalist called for an end to Russia's invasion of neighbouring Ukraine. She described the war as \"a complete nightmare\".Kasatkina's management said it had been \"difficult\" for the player since openly discussing her sexuality and opposition to the war.Kasatkina, who lives in Dubai and sometimes trains in Spain, has not been to Russia in the past two and a half years.Her management said the Abu Dhabi error was \"potentially quite harmful\" to her.They added: \"This carries some strong implications for Daria if the Russian authorities feel she is trying to switch - which she is not.\"In 2023, Russia's Supreme Court ruled the \"international LGBT movement\" was an \"extremist organisation\".Human rights activists said, external the ruling \"jeopardised\" LGBT rights and increased the risk of activists being prosecuted.In the aftermath of Kasatkina's risk-taking interview, one Russian politician unsuccessfully called for her to be listed as a 'foreign agent' - someone deemed by the Russian authorities to be acting against the nation's interests.Last year, Kasatkina told ESPN, external she was expecting \"consequences\" following her actions.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/673a/live/cb266d00-e16e-11ef-8025-b72deb72247c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRussia\u0026#39;s Daria Kasatkina\u0026#39;s management say a flag error could have \u0026#34;strong implications\u0026#34; for the player after she was wrongly listed as representing Spain at a WTA Tour draw ceremony - leading to suggestions she had switched allegiance.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eBBC Sport has been told Kasatkina, who has criticised Russia\u0026#39;s LGBT rules and opposed the war in Ukraine, has not switched allegiance.\u003c/p\u003e\u003cp\u003eThe appearance of the Spanish flag next to the world number 11\u0026#39;s name during the Abu Dhabi Open draw attracted attention, sparking online discussion that she had decided to stop representing Russia.\u003c/p\u003e\u003cp\u003e\u0026#34;It is incorrect and we can categorically deny she is switching to Spain,\u0026#34; Kasatkina\u0026#39;s management told BBC Sport.\u003c/p\u003e\u003cp\u003eLater on Sunday, tournament organisers apologised to 27-year-old Kasatkina for the error.\u003c/p\u003e\u003cp\u003e\u0026#34;This was an entirely administrative mistake and has now been corrected,\u0026#34; they said.\u003c/p\u003e\u003cp\u003eKasatkina, who is one of a few openly gay players on the WTA Tour, publicly came out \u003ca href=\"https://www.youtube.com/watch?v=bFNAndV99Rc\"\u003ein a video interview\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e with Russian blogger Vitya Kravchenko in July 2022.\u003c/p\u003e\u003cp\u003eIn the same video, the 2022 French Open semi-finalist called for an end to Russia\u0026#39;s invasion of neighbouring Ukraine. She described the war as \u0026#34;a complete nightmare\u0026#34;.\u003c/p\u003e\u003cp\u003eKasatkina\u0026#39;s management said it had been \u0026#34;difficult\u0026#34; for the player since openly discussing her sexuality and opposition to the war.\u003c/p\u003e\u003cp\u003eKasatkina, who lives in Dubai and sometimes trains in Spain, has not been to Russia in the past two and a half years.\u003c/p\u003e\u003cp\u003eHer management said the Abu Dhabi error was \u0026#34;potentially quite harmful\u0026#34; to her.\u003c/p\u003e\u003cp\u003eThey added: \u0026#34;This carries some strong implications for Daria if the Russian authorities feel she is trying to switch - which she is not.\u0026#34;\u003c/p\u003e\u003cp\u003eIn 2023, Russia\u0026#39;s Supreme Court ruled the \u0026#34;international LGBT movement\u0026#34; was an \u0026#34;extremist organisation\u0026#34;.\u003c/p\u003e\u003cp\u003eHuman rights activists \u003ca href=\"https://www.hrw.org/news/2023/11/30/russia-supreme-court-bans-lgbt-movement-extremist\"\u003esaid\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e the ruling \u0026#34;jeopardised\u0026#34; LGBT rights and increased the risk of activists being prosecuted.\u003c/p\u003e\u003cp\u003eIn the aftermath of Kasatkina\u0026#39;s risk-taking interview, one Russian politician unsuccessfully called for her to be listed as a \u0026#39;foreign agent\u0026#39; - someone deemed by the Russian authorities to be acting against the nation\u0026#39;s interests.\u003c/p\u003e\u003cp\u003eLast year, Kasatkina \u003ca href=\"https://www.espn.com/tennis/story/_/id/39754810/russian-tennis-player-daria-kasatkina-lgbtq+-rights-youtube-channel\"\u003etold ESPN\u003cspan\u003e, external\u003c/span\u003e\u003c/a\u003e she was expecting \u0026#34;consequences\u0026#34; following her actions.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-02T16:02:28.184Z",
  "modifiedTime": null
}
