{
  "id": "1590b40a-f7d7-4130-8c03-d57c7eabc275",
  "title": "GB win first world figure skating medal since 1984",
  "link": "https://www.bbc.com/sport/articles/c1egp8qgppwo",
  "description": "Lilah Fear and Lewis Gibson win GB's first figure skating World Championship medal since Torvill and Dean in 1984 with ice dance bronze in Boston.",
  "author": "",
  "published": "Sat, 29 Mar 2025 21:23:32 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 1407,
  "excerpt": "Lilah Fear and Lewis Gibson win GB's first figure skating World Championship medal since Torvill and Dean in 1984 with ice dance bronze in Boston.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "Lilah Fear and Lewis Gibson won Great Britain's first figure skating World Championship medal in more than 40 years with ice dance bronze in Boston.Not since 1984, when Jayne Torvill and Christopher Dean won their fourth and final global title, have British skaters stood on a world podium in any discipline.But Fear, 25, and Gibson, 30, finally ended that wait on Saturday with a total score of 207.11 points, having finished fourth at the previous two World Championships.American favourites Madison Chock and Evan Bates defended their title while Canada's Piper Gilles and Paul Poirier took silver.\"I can't even describe my feelings, I'm still shaking,\" said Fear. \"I'm in disbelief.\"Gibson added: \"It's a dream come true.\"Olympians Fear and Gibson are three-time European medallists and earlier this season claimed Britain's first ever medal at the Grand Prix final. In Boston, they had placed third after Friday's rhythm dance but while their free dance routine - soundtracked by a trio of Beyonce hits - was judged the sixth best on Saturday, their combined score was enough to land them the greatest success of their careers to date.Fellow Britons Phebe Bekker and James Hernandez placed 17th.Earlier this month, Torvill said Fear and Gibson had \"taken ice dancing in Great Britain to another level\".The World Championships is a qualifying event for next year's Winter Olympic Games in Milan-Cortina.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6176/live/86cefd20-0ced-11f0-b234-07dc7691c360.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eLilah Fear and Lewis Gibson won Great Britain\u0026#39;s first figure skating World Championship medal in more than 40 years with ice dance bronze in Boston.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eNot since 1984, when Jayne Torvill and Christopher Dean won their fourth and final global title, have British skaters stood on a world podium in any discipline.\u003c/p\u003e\u003cp\u003eBut Fear, 25, and Gibson, 30, finally ended that wait on Saturday with a total score of 207.11 points, having finished fourth at the previous two World Championships.\u003c/p\u003e\u003cp\u003eAmerican favourites Madison Chock and Evan Bates defended their title while Canada\u0026#39;s Piper Gilles and Paul Poirier took silver.\u003c/p\u003e\u003cp\u003e\u0026#34;I can\u0026#39;t even describe my feelings, I\u0026#39;m still shaking,\u0026#34; said Fear. \u0026#34;I\u0026#39;m in disbelief.\u0026#34;\u003c/p\u003e\u003cp\u003eGibson added: \u0026#34;It\u0026#39;s a dream come true.\u0026#34;\u003c/p\u003e\u003cp\u003eOlympians Fear and Gibson are three-time European medallists and earlier this season claimed Britain\u0026#39;s first ever medal at the Grand Prix final. \u003c/p\u003e\u003cp\u003eIn Boston, they had placed third after Friday\u0026#39;s rhythm dance but while their free dance routine - soundtracked by a trio of Beyonce hits - was judged the sixth best on Saturday, their combined score was enough to land them the greatest success of their careers to date.\u003c/p\u003e\u003cp\u003eFellow Britons Phebe Bekker and James Hernandez placed 17th.\u003c/p\u003e\u003cp\u003eEarlier this month, Torvill said Fear and Gibson had \u003ca href=\"https://www.bbc.com/sport/articles/cj92gn3zlk4o\"\u003e\u0026#34;taken ice dancing in Great Britain to another level\u0026#34;\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe World Championships is a qualifying event for next year\u0026#39;s Winter Olympic Games in Milan-Cortina.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-03-29T21:23:32.643Z",
  "modifiedTime": null
}
