{
  "id": "2b8d4af5-14b4-4c5f-91c8-a44d4bbe2c31",
  "title": "From world's best to Wales' worst - Gatland shows danger of going back",
  "link": "https://www.bbc.com/sport/rugby-union/articles/cg57nqegll9o",
  "description": "From world's best to Wales' worst, Warren Gatland may have proved why you should never go back as his second stint as Wales head coach ends.",
  "author": "",
  "published": "Tue, 11 Feb 2025 20:28:18 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Gareth Griffiths",
  "length": 9801,
  "excerpt": "From world's best to Wales' worst, Warren Gatland may have proved why you should never go back as his second stint as Wales head coach ends.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Gatland's Wales tale shows dangers of going back Image source, Huw Evans Picture AgencyImage caption, Warren Gatland has been head coach of the British and Irish Lions on three occasionsThey say never go back. Or if you do go back, then know how long for.When Warren Gatland became Wales head coach for a second time in December 2022, he acknowledged he was putting his reputation and legacy on the line.Gatland had been Wales' most successful and longest-serving coach in his first 12-year spell in charge. He even had a set of gates named after him outside the Principality Stadium. Now he has gone, in another remarkable day in the troubled world of Welsh rugby.Gatland's return, a month in France during the 2023 World Cup aside, has not worked out as hoped.His overall record stands at 151 matches with 76 wins, 73 defeats and two draws. The two spells at the helm could not be more contrasting. During his first stint in charge, Gatland recorded 70 wins in 125 games with 53 defeats and two draws, a success rate of 56%.He guided Wales to three Grand Slams and two World Cup semi-finals, while taking sabbaticals to lead the British and Irish Lions to a series victory against Australia in 2013 and a draw against the All Blacks four years later.Wales even briefly topped the world rankings in August 2019 after a record 14-match unbeaten run.In stark contrast, Gatland has now presided over statistically the worst Wales side in their 144-year international rugby history, with 14 successive Test losses. In his second spell as Wales head coach, there were six wins and 20 losses in 26 matches, a success rate of less than 25%.From the world's best to Wales' worst - what went wrong?Return of the GatImage source, Huw Evans Picture AgencyImage caption, Gatland's Gates were officially unveiled in November 2019 when he led the Barbarians against WalesIt was only three years ago that Gatland's fellow New Zealander Wayne Pivac was struggling in the Wales head coach role.Despite brief highs of a 2021 Six Nations title and a first men's Test win in South Africa the following year, Pivac's fate was sealed following a poor autumn series in 2022 which included defeats against New Zealand, Georgia and Australia.It was the Georgia humbling that proved the breaking point, occurring as it did in the same year Wales lost against Italy at home for the first time.Wales won only three of 12 games in 2022, with Pivac's three-year tenure seeing them slip to ninth in the world rankings.Gatland's shadow had been looming over Pivac, almost literally, as he stood ominously on the Principality Stadium pitch in his role as a television pundit.With the World Cup looming, Welsh Rugby Union (WRU) chief executive Steve Phillips decided to make a change and Pivac departed.Despite talk of interest in Gatland from England, the change was completed quickly and he was in place for the 2023 Six Nations.Walking into a storm and strike threatImage source, Huw Evans Picture AgencyImage caption, Warren Gatland was Wales head coach from 2007 to 2019 before returning for a second spell in December 2022Gatland ended his first Welsh tenure following a fourth-place finish in the 2019 World Cup in Japan, stating on his farewell it would \"break my heart if Wales went back into the doldrums\".With Covid striking, Gatland had an unsuccessful stint as Waikato Chiefs head coach before the Lions employed him for a third time for the Test series against South Africa in 2021, which the Springboks won 2-1.Gatland returned to Chiefs as director of rugby before Wales came calling again.He immediately changed the backroom staff by replacing former players Stephen Jones and Gethin Jenkins with Alex King and Mike Forshaw. No room for sentiment.But Gatland walked into a storm even before a ball was kicked. In January 2023, allegations surfaced in a BBC Wales Investigates programme of sexism and misogyny at the WRU, which ultimately led to Phillips' resignation and his £480,000 pay-off.A month later, the Wales squad threatened to strike for the Six Nations match against England in Cardiff because of disputes over player contracts.The issue was resolved three days before the game but left a stain on the Welsh game, with captain Ken Owens warning the nation had become the \"laughing stock of world rugby\".It was later to emerge elements of Gatland's conduct during those tricky times had left some players - most notably fly-half Dan Biggar - unimpressed.Wales managed one victory in the tournament, in Italy. In June that year, Gatland commented he might not have returned to the Wales job had he known the true scale of the problems facing Welsh rugby.'Judge me on the World Cup'Image source, Getty ImagesImage caption, Warren Gatland led Wales to a famous win over Australia at the 2023 Rugby World CupGatland has always believed he can bring success when he spends time with players, which World Cup preparation allows.After naming a 54-man training squad, he had to cope with the international retirements of legends Alun Wyn Jones and Justin Tipuric, while Owens was unavailable because of injury.Gatland's man-management skills were under scrutiny as prop Rhys Carre was brutally released from the squad for \"failing to meet individual performance targets\".Intense training camps in Switzerland and Turkey appeared to have worked as Wales stormed to World Cup pool success, with victories against Fiji, Portugal, Australia and Georgia.The 40-6 hammering of Eddie Jones' Wallabies side in Lyon proved the undoubted highlight of Gatland's second spell in charge.Wales suffered quarter-final defeat against Argentina in Marseille. It was a match Gatland felt they should have won, but pride had been restored to Welsh rugby.Here is when history could have been different. With a new four-year World Cup cycle starting, Gatland and the WRU could have said their farewells after he had completed a short-term job.WRU executive director of rugby Nigel Walker stated before the tournament in France he was backing Gatland to lead Wales to the 2027 World Cup, labelling him \"one of the best coaches in the world\".So Gatland stayed on, but some of his finest players did not. Biggar and Leigh Halfpenny retired from international rugby, Tomas Francis left Wales for a new life in France, Owens hung up his boots and George North quit the Test arena after the 2024 Six Nations.Gatland was left with an inexperienced squad and had to use young players, a situation that saw Wales slump to a first Six Nations wooden spoon in 21 years.Gatland says he offered to resign in the changing room following the defeat by Italy in March 2024 which condemned Wales to a clean sweep of Six Nations losses, but the offer was turned down by WRU chief executive Abi Tierney.He also made headlines again when he stated Welsh rugby sometimes felt like a \"sinking ship\".Annus horribilisMedia caption, Warren Gatland: Wales boss 'didn't think there'd be this much pain'A predictable summer loss to South Africa at Twickenham was followed by a 2-0 summer series defeat in Australia.This took Wales to nine successive Test losses, but an opening autumn match against Fiji offered a chance to avoid a record-equalling 10th straight defeat.But a 24-19 loss - Wales' first home loss to Fiji in their history - changed the landscape.Gatland found himself under scrutiny like no other time during his coaching career. There was criticism from former players such as Mike Phillips, Tom Shanklin, Biggar and Jamie Roberts, also a WRU board member. Ex-Wales captain Gwyn Jones accused Gatland of having checked out of his role.The focus intensified when Australia produced a record win in Cardiff to inflict that record 11th successive defeat. Gatland looked a broken man and stated he would leave his post if it was in the best interests of Welsh rugby. He stayed but an inevitable heavy loss against world champions South Africa followed to complete the worst statistical year in Welsh rugby history.Tierney said Gatland's position was \"on the line\" as an independent review into the miserable autumn campaign was held.Anonymous testimony from players followed with criticism aimed at the coaching staff but Gatland was given the green light to continue for the 2025 Six Nations.New depths were plumbed as his side suffered a record 43-0 loss to France to Paris in the opening game, the first time Wales had failed to score a point under Gatland.Then came the limp performance in Rome in the 22-15 defeat by Italy. That was to prove the final curtain.Welsh rugby woesMedia caption, 'It's a golden generation of Welsh pundits, not Welsh players'While Gatland did not have the same standard of players at his disposal in his second spell compared to his first, he was also unable to get the best out of the group in the last 12 months.His selection was muddled, there was a coaching staleness and his style of play has not evolved.His popularity has not waned too much among some fans, with his backers arguing nobody else could have achieved any more.Gatland cannot be blamed for Welsh rugby's deep-rooted problems.There has been no coherent strategy in place, with the WRU and four professional sides only very recently agreeing terms of a new deal.A new coach will inherit the same issues. There will be no quick fix for Gatland's successor, but a fresh face might lift the negativity.Gatland's positive effect on Welsh rugby in that first stint should be applauded and remembered for the glory days he brought. His teams provided magical moments that will struggle to be topped. His original Wales legacy, though, has been dented by his return. Gatland will go down in history as Wales' best and worst head coach.Never go back, they say. If you do, know how long to go back for. Ultimately, the sequel is never better than the original.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eGatland\u0026#39;s Wales tale shows dangers of going back \u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Warren Gatland in Wales training kit\" src=\"https://ichef.bbci.co.uk/ace/standard/1680/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/020e/live/aaa31010-acc6-11ef-8c4f-d52b39c994e1.jpg 976w\" width=\"1680\" height=\"945\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eHuw Evans Picture Agency\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eWarren Gatland has been head coach of the British and Irish Lions on three occasions\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eThey say never go back. Or if you do go back, then know how long for.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eWhen Warren Gatland became Wales head coach for a second time in December 2022, he acknowledged he was putting his reputation and legacy on the line.\u003c/p\u003e\u003cp\u003eGatland had been Wales\u0026#39; most successful and longest-serving coach in his first 12-year spell in charge. \u003c/p\u003e\u003cp\u003eHe even had a set of gates named after him outside the Principality Stadium. Now he has gone, in another remarkable day in the troubled world of Welsh rugby.\u003c/p\u003e\u003cp\u003eGatland\u0026#39;s return, a month in France during the 2023 World Cup aside, has not worked out as hoped.\u003c/p\u003e\u003cp\u003eHis overall record stands at 151 matches with 76 wins, 73 defeats and two draws. The two spells at the helm could not be more contrasting. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDuring his first stint in charge, Gatland recorded 70 wins in 125 games with 53 defeats and two draws, a success rate of 56%.\u003c/p\u003e\u003cp\u003eHe guided Wales to three Grand Slams and two World Cup semi-finals, while taking sabbaticals to lead the British and Irish Lions to a series victory against Australia in 2013 and a draw against the All Blacks four years later.\u003c/p\u003e\u003cp\u003eWales even briefly topped the world rankings in August 2019 after a record 14-match unbeaten run.\u003c/p\u003e\u003cp\u003eIn stark contrast, Gatland has now presided over statistically the worst Wales side in their 144-year international rugby history, with 14 successive Test losses. In his second spell as Wales head coach, there were six wins and 20 losses in 26 matches, a success rate of less than 25%.\u003c/p\u003e\u003cp\u003eFrom the world\u0026#39;s best to Wales\u0026#39; worst - what went wrong?\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Return-of-the-Gat\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eReturn of the Gat\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Warren Gatland pictured alongside Gatland\u0026#39;s Gates \" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/e3d4/live/0b9349e0-aca8-11ef-bdf5-b7cb2fa86e10.jpg 976w\" width=\"3840\" height=\"2450.7076923076925\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eHuw Evans Picture Agency\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eGatland\u0026#39;s Gates were officially unveiled in November 2019 when he led the Barbarians against Wales\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt was only three years ago that Gatland\u0026#39;s fellow New Zealander Wayne Pivac was struggling in the Wales head coach role.\u003c/p\u003e\u003cp\u003eDespite brief highs of a 2021 Six Nations title and a first men\u0026#39;s Test win in South Africa the following year, Pivac\u0026#39;s fate was sealed following a poor autumn series in 2022 which included defeats against New Zealand, Georgia and Australia.\u003c/p\u003e\u003cp\u003eIt was the Georgia humbling that proved the breaking point, occurring as it did in the same year Wales lost against Italy at home for the first time.\u003c/p\u003e\u003cp\u003eWales won only three of 12 games in 2022, with Pivac\u0026#39;s three-year tenure seeing them slip to ninth in the world rankings.\u003c/p\u003e\u003cp\u003eGatland\u0026#39;s shadow had been looming over Pivac, almost literally, as he stood ominously on the Principality Stadium pitch in his role as a television pundit.\u003c/p\u003e\u003cp\u003eWith the World Cup looming, Welsh Rugby Union (WRU) chief executive Steve Phillips decided to make a change and Pivac departed.\u003c/p\u003e\u003cp\u003eDespite talk of interest in Gatland from England, the change was completed quickly and he was in place for the 2023 Six Nations.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Walking-into-a-storm-and-strike-threat\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWalking into a storm and strike threat\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Warren Gatland walks out of the Principality Stadium tunnel ahead of Wales v Italy in the 2024 Six Nations\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/6af2/live/8784cce0-a424-11ef-83a2-976bfe49a4d1.jpg 976w\" width=\"3840\" height=\"2160.748596381784\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eHuw Evans Picture Agency\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eWarren Gatland was Wales head coach from 2007 to 2019 before returning for a second spell in December 2022\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eGatland ended his first Welsh tenure following a fourth-place finish in the 2019 World Cup in Japan, stating on his farewell it would \u0026#34;break my heart if Wales went back into the doldrums\u0026#34;.\u003c/p\u003e\u003cp\u003eWith Covid striking, Gatland had an unsuccessful stint as Waikato Chiefs head coach before the Lions employed him for a third time for the Test series against South Africa in 2021, which the Springboks won 2-1.\u003c/p\u003e\u003cp\u003eGatland returned to Chiefs as director of rugby before Wales came calling again.\u003c/p\u003e\u003cp\u003eHe immediately changed the backroom staff by replacing former players Stephen Jones and Gethin Jenkins with Alex King and Mike Forshaw. No room for sentiment.\u003c/p\u003e\u003cp\u003eBut Gatland walked into a storm even before a ball was kicked. \u003c/p\u003e\u003cp\u003eIn January 2023, allegations surfaced in a BBC Wales Investigates programme of sexism and misogyny at the WRU, which ultimately led to Phillips\u0026#39; resignation and his £480,000 pay-off.\u003c/p\u003e\u003cp\u003eA month later, the Wales squad threatened to strike for the Six Nations match against England in Cardiff because of disputes over player contracts.\u003c/p\u003e\u003cp\u003eThe issue was resolved three days before the game but left a stain on the Welsh game, with captain Ken Owens warning the nation had become the \u0026#34;laughing stock of world rugby\u0026#34;.\u003c/p\u003e\u003cp\u003eIt was later to emerge elements of Gatland\u0026#39;s conduct during those tricky times had left some players - most notably fly-half Dan Biggar - unimpressed.\u003c/p\u003e\u003cp\u003eWales managed one victory in the tournament, in Italy. In June that year, Gatland commented he might not have returned to the Wales job had he known the true scale of the problems facing Welsh rugby.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Judge-me-on-the-World-Cup\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Judge me on the World Cup\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg.webp 800w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Warren Gatland in a team huddle after Wales beat Australia in the Rugby World Cup\" loading=\"lazy\" src=\"https://ichef.bbci.co.uk/ace/standard/953/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/f489/live/02735010-acbe-11ef-8c4f-d52b39c994e1.jpg 800w\" width=\"953\" height=\"535\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eWarren Gatland led Wales to a famous win over Australia at the 2023 Rugby World Cup\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eGatland has always believed he can bring success when he spends time with players, which World Cup preparation allows.\u003c/p\u003e\u003cp\u003eAfter naming a 54-man training squad, he had to cope with the international retirements of legends Alun Wyn Jones and Justin Tipuric, while Owens was unavailable because of injury.\u003c/p\u003e\u003cp\u003eGatland\u0026#39;s man-management skills were under scrutiny as prop Rhys Carre was brutally released from the squad for \u0026#34;failing to meet individual performance targets\u0026#34;.\u003c/p\u003e\u003cp\u003eIntense training camps in Switzerland and Turkey appeared to have worked as Wales stormed to World Cup pool success, with victories against Fiji, Portugal, Australia and Georgia.\u003c/p\u003e\u003cp\u003eThe 40-6 hammering of Eddie Jones\u0026#39; Wallabies side in Lyon proved the undoubted highlight of Gatland\u0026#39;s second spell in charge.\u003c/p\u003e\u003cp\u003eWales suffered quarter-final defeat against Argentina in Marseille. It was a match Gatland felt they should have won, but pride had been restored to Welsh rugby.\u003c/p\u003e\u003cp\u003eHere is when history could have been different. With a new four-year World Cup cycle starting, Gatland and the WRU could have said their farewells after he had completed a short-term job.\u003c/p\u003e\u003cp\u003eWRU executive director of rugby Nigel Walker stated before the tournament in France he was backing Gatland to lead Wales to the 2027 World Cup, labelling him \u0026#34;one of the best coaches in the world\u0026#34;.\u003c/p\u003e\u003cp\u003eSo Gatland stayed on, but some of his finest players did not. Biggar and Leigh Halfpenny retired from international rugby, Tomas Francis left Wales for a new life in France, Owens hung up his boots and George North quit the Test arena after the 2024 Six Nations.\u003c/p\u003e\u003cp\u003eGatland was left with an inexperienced squad and had to use young players, a situation that saw Wales slump to a first Six Nations wooden spoon in 21 years.\u003c/p\u003e\u003cp\u003eGatland says he offered to resign in the changing room following the defeat by Italy in March 2024 which condemned Wales to a clean sweep of Six Nations losses, but the offer was turned down by WRU chief executive Abi Tierney.\u003c/p\u003e\u003cp\u003eHe also made headlines again when he stated Welsh rugby sometimes felt like a \u0026#34;sinking ship\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Annus-horribilis\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eAnnus horribilis\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eWarren Gatland: Wales boss \u0026#39;didn\u0026#39;t think there\u0026#39;d be this much pain\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA predictable summer loss to South Africa at Twickenham was followed by a 2-0 summer series defeat in Australia.\u003c/p\u003e\u003cp\u003eThis took Wales to nine successive Test losses, but an opening autumn match against Fiji offered a chance to avoid a record-equalling 10th straight defeat.\u003c/p\u003e\u003cp\u003eBut a 24-19 loss - Wales\u0026#39; first home loss to Fiji in their history - changed the landscape.\u003c/p\u003e\u003cp\u003eGatland found himself under scrutiny like no other time during his coaching career. There was criticism from former players such as Mike Phillips, Tom Shanklin, Biggar and Jamie Roberts, also a WRU board member. Ex-Wales captain Gwyn Jones accused Gatland of having checked out of his role.\u003c/p\u003e\u003cp\u003eThe focus intensified when Australia produced a record win in Cardiff to inflict that record 11th successive defeat. \u003c/p\u003e\u003cp\u003eGatland looked a broken man and stated he would leave his post if it was in the best interests of Welsh rugby. \u003c/p\u003e\u003cp\u003eHe stayed but an inevitable heavy loss against world champions South Africa followed to complete the worst statistical year in Welsh rugby history.\u003c/p\u003e\u003cp\u003eTierney said Gatland\u0026#39;s position was \u0026#34;on the line\u0026#34; as an independent review into the miserable autumn campaign was held.\u003c/p\u003e\u003cp\u003eAnonymous testimony from players followed with criticism aimed at the coaching staff but Gatland was given the green light to continue for the 2025 Six Nations.\u003c/p\u003e\u003cp\u003eNew depths were plumbed as his side suffered a record 43-0 loss to France to Paris in the opening game, the first time Wales had failed to score a point under Gatland.\u003c/p\u003e\u003cp\u003eThen came the limp performance in Rome in the 22-15 defeat by Italy. That was to prove the final curtain.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Welsh-rugby-woes\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWelsh rugby woes\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003e\u0026#39;It\u0026#39;s a golden generation of Welsh pundits, not Welsh players\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhile Gatland did not have the same standard of players at his disposal in his second spell compared to his first, he was also unable to get the best out of the group in the last 12 months.\u003c/p\u003e\u003cp\u003eHis selection was muddled, there was a coaching staleness and his style of play has not evolved.\u003c/p\u003e\u003cp\u003eHis popularity has not waned too much among some fans, with his backers arguing nobody else could have achieved any more.\u003c/p\u003e\u003cp\u003eGatland cannot be blamed for Welsh rugby\u0026#39;s deep-rooted problems.\u003c/p\u003e\u003cp\u003eThere has been no coherent strategy in place, with the WRU and four professional sides only very recently agreeing terms of a new deal.\u003c/p\u003e\u003cp\u003eA new coach will inherit the same issues. There will be no quick fix for Gatland\u0026#39;s successor, but a fresh face might lift the negativity.\u003c/p\u003e\u003cp\u003eGatland\u0026#39;s positive effect on Welsh rugby in that first stint should be applauded and remembered for the glory days he brought. His teams provided magical moments that will struggle to be topped. \u003c/p\u003e\u003cp\u003eHis original Wales legacy, though, has been dented by his return. Gatland will go down in history as Wales\u0026#39; best and worst head coach.\u003c/p\u003e\u003cp\u003eNever go back, they say. If you do, know how long to go back for. \u003c/p\u003e\u003cp\u003eUltimately, the sequel is never better than the original.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2025-02-11T20:28:18.48Z",
  "modifiedTime": null
}
