{
  "id": "2fee545b-8579-4ac5-bbae-ad2c7795ecb5",
  "title": "Rangers condemn incident in which Engels hit by coin",
  "link": "https://www.bbc.com/sport/football/articles/cn4xnn3jk7lo",
  "description": "Rangers condemn \"in the strongest possible terms\" an incident in which Celtic's Arne Engels was struck by a coin during Thursday's Old Firm game.",
  "author": "",
  "published": "Thu, 02 Jan 2025 22:30:28 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 1182,
  "excerpt": "Rangers condemn \"in the strongest possible terms\" an incident in which Celtic's Arne Engels was struck by a coin during Thursday's Old Firm game.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Rangers have condemned \"in the strongest possible terms\" an incident in which Celtic's Arne Engels was struck by a coin during Thursday's Old Firm game.The substitute fell to the ground and needed treatment after being hit when going to take a corner towards the end of Rangers' 3-0 win.There were no Celtic fans inside Ibrox because of the ongoing dispute about away ticket allocations and Rangers said they will assist police with their investigation. Celtic said they believe Police Scotland are investigating two separate incidents.They added: \"The repeated targeting of our players and staff with missiles is quite appalling and completely unacceptable.\"Celtic manager Brendan Rodgers confirmed that Engels was \"OK\" but added that \"an inch lower, he would have been [hit] right in the eye\".The incident came near the conclusion of a derby that cut Celtic's lead at the top of the Scottish Premiership to 11 points and could leave Rangers facing punishment.Celtic defender Alistair Johnston saw Engels being hit and cautioned \"everyone to be smart\" when at matches.\"It's humans out there, someone's son, so let's refrain from chucking things at guys' heads,\" the defender added.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b255/live/9b3218a0-c946-11ef-8e66-d3e88529495c.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRangers have condemned \u0026#34;in the strongest possible terms\u0026#34; an incident in which Celtic\u0026#39;s Arne Engels was struck by a coin during Thursday\u0026#39;s Old Firm game.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe substitute fell to the ground and needed treatment after being hit when going to take a corner towards the end of Rangers\u0026#39; 3-0 win.\u003c/p\u003e\u003cp\u003eThere were no Celtic fans inside Ibrox because of the ongoing dispute about away ticket allocations and Rangers said they will assist police with their investigation. \u003c/p\u003e\u003cp\u003eCeltic said they believe Police Scotland are investigating two separate incidents.\u003c/p\u003e\u003cp\u003eThey added: \u0026#34;The repeated targeting of our players and staff with missiles is quite appalling and completely unacceptable.\u0026#34;\u003c/p\u003e\u003cp\u003eCeltic manager Brendan Rodgers confirmed that Engels was \u0026#34;OK\u0026#34; but added that \u0026#34;an inch lower, he would have been [hit] right in the eye\u0026#34;.\u003c/p\u003e\u003cp\u003eThe incident came near the conclusion of a derby that cut Celtic\u0026#39;s lead at the top of the Scottish Premiership to 11 points and could leave Rangers facing punishment.\u003c/p\u003e\u003cp\u003eCeltic defender Alistair Johnston saw Engels being hit and cautioned \u0026#34;everyone to be smart\u0026#34; when at matches.\u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s humans out there, someone\u0026#39;s son, so let\u0026#39;s refrain from chucking things at guys\u0026#39; heads,\u0026#34; the defender added.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-02T20:18:29.897Z",
  "modifiedTime": null
}
