{
  "id": "42c656e5-7f1a-4557-981c-1312783e7911",
  "title": "'Humble \u0026 popular but no plan B' - The inside story of Rooney at Plymouth",
  "link": "https://www.bbc.com/sport/football/articles/c24ny6m2741o",
  "description": "As Wayne Rooney leaves his latest managerial role with Plymouth, BBC Sport looks at where it went wrong for the legendary striker.",
  "author": "",
  "published": "Tue, 31 Dec 2024 18:17:26 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "James Law",
  "length": 8793,
  "excerpt": "As Wayne Rooney leaves his latest managerial role with Plymouth, BBC Sport looks at where it went wrong for the legendary striker.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "'Humble \u0026 popular but no plan B' - The inside story of Rooney at PlymouthImage source, Getty ImagesImage caption, Wayne Rooney won four of his 23 Championship matches in charge of PlymouthFormer England and Manchester United forward Wayne Rooney has left Championship side Plymouth Argyle after seven months in charge, with the club bottom of the table and four points from safety.It brings the 39-year-old's fourth managerial role to an end, after challenging spells in the second tier with Birmingham City and Derby County, as well as in the United States with DC United.So where did it go wrong for the legendary striker at Plymouth? What was he like to deal with? And how did the players feel about him? BBC Sport delves into some key themes.The style of play: 'He tried to be progressive, but it didn't work'Rooney appeared to come from the Pep Guardiola school of tactics.A goalkeeper who could initiate attacks, full-backs who would invert into midfield and playing through the thirds.And this style of play, in home games, often entertained - there was a 3-2 win over high-flying Sunderland and two 3-3 draws, with five stoppage-time goals scored at Home Park to gain six crucial points.However, the last-gasp heroics were papering over the cracks of what were often patchy performances.While Argyle's 48.6% possession average ranks them a respectable 16th in the Championship, they are bottom for expected goals (19.39) and above only Portsmouth for shots on target (78) - with a league-worst xG against (44.03) and shots on target faced (141).\"He was trying to be progressive and building from the back but it often didn't work because they weren't great at dealing with the press,\" said BBC Radio Devon sports reporter Alan Richardson.\"I think other teams sussed them out and there was no plan B, and he wasn't helped by the fact he didn't have the best team anyway.\"Plymouth have to travel further than any other English Football League club, and their away form has often historically been bad, but under Rooney things reached a new low.From 13 away league matches the Pilgrims have managed no wins, two points and only three goals, while conceding a staggering 35 times.The players: 'He was popular, there was no loss of the dressing room'After Plymouth's thrashing by Norwich, Rooney claimed the club's under-18s side could have done a better job, while after their 4-0 opening weekend defeat at Sheffield Wednesday he warned his players they would not play for him again if they put in a repeat performance.Despite the occasional public criticism of his squad, both the players and board seemed completely behind him until the end.\"There was no loss of the dressing room, I get the impression they would run through brick walls for him,\" said Richardson.\"He was very popular and well liked, and always had time for all members of the staff.\"There was some upheaval earlier this month when Rooney's long-time assistant Pete Shuttleworth left by mutual consent, with Mike Phelan - number two to Alex Ferguson at Manchester United - replacing him in what seemed a coup.But that only brought about a brief uplift in performances, with Phelan also leaving Home Park after just 23 days in post.Image source, Getty ImagesImage caption, Rooney was always very forthright with the media and did not duck any questionsAs a global star coming to a geographical outpost, Rooney could perhaps have been forgiven for wanting to be the main attraction at Home Park.But that could not have been further from the truth.\"He was always affable, humble, approachable and didn't have any airs or graces,\" Richardson told BBC Sport.\"He was one of the most easy-going managers I've had to deal with.\"Rooney's Plymouth were beaten by a margin of three goals or more on six occasions, leading to some difficult post-match interviews.However, he never seemed to shirk responsibility.\"He missed one press conference but otherwise was always there, there was never any suggestion of him not being in Plymouth when he should be - something that was levelled towards some previous managers,\" added Richardson.\"I thought he was always very honest with the press, perhaps too honest at times.\"The fans: Rooney was 'absolutely brilliant' with supportersMedia caption, Plymouth Job was an easy decision to make - Wayne RooneyWhen news of Rooney's impending appointment leaked out, the reaction among the Plymouth faithful was one of pure disbelief.\"It took a couple days for us to actually realise it was happening, it was all a bit of a shock,\" podcaster Joe Bell told BBC Radio 5 Live.\"His track record didn't suggest he was up to the job but then the star-struck nature set in and we were all like, 'hang on a minute, England's greatest ever goalscorer is now our manager'.\"However, many of those who doubted the move were soon won over by Rooney's charm - it was clear he was not motivated by money, he had moved himself to the far south-west and was often seen out and about in the city.\"He was used to being mobbed by the fans,\" Richardson said.\"Early on he said he would always stop and sign autographs, and he was absolutely brilliant at that sort of thing.\"It was often a feeding frenzy with fans when he came out of a dressing room, yet he didn't seem to mind and it was just part of his life.\"That relationship perhaps bought Rooney more time with both Plymouth supporters and the club's board.But defeat at Oxford United on 29 December took the club's form to one win in 14 games - a step too far.\"We really wanted it to work - as a fanbase I think we've tried to give Wayne as much of a chance as we can,\" added Bell.\"It was only actually on Sunday that the dissenting voices took to the stands and started calling for the manager to go.\"The reality: 'It's tricky keeping Plymouth in the Championship'There were some mitigating factors to Rooney's demise at Plymouth - some avoidable, some not so.As head coach, rather than manager, he could not be held solely responsible for transfers, though his reputation in the game played a part in some players opting to join.However, it was clear the signing of experienced Iceland defender Victor Palsson - who played under Rooney at DC United - was one he had pushed for.The former Liverpool academy player managed just eight appearances under Rooney, struggling with form and injury, and with the January transfer window now opening it did not inspire confidence in his eye for a player.\"To be fair to Wayne he's been dealt a tricky hand - we have the smallest budget in the division, we're a small fish in an incredibly large pond, we're consistently punching above our weight and he had to come in and overachieve,\" Bell said.\"I do feel for Wayne because it is a difficult job - it is tricky to try and keep Plymouth Argyle in the Championship. We did it by the skin of our teeth last year and unfortunately, as much as I'd like an easier season, I think we'll probably have to do it the same way again this year.\"One thing Rooney could certainly not be blamed for was Argyle's crippling injury list.He has been without the spine of his team, including captain Joe Edwards - now caretaker manager - on-loan Toulouse livewire Ibrahim Cissoko and Morgan Whittaker, who scored 20 goals last season and was the subject of a multimillion-pound bid from Italian giants Lazio last January.It meant 16-year-old academy product Tegan Finn had to start their 4-0 defeat at Coventry on Boxing Day.\"Unfortunately, despite having an injury list the length of anybody's arm, it's not worked out for Wayne and the time had to come.\"A lot of people in defence of Wayne have asked: 'Who could have done better?'\"\"The simple fact is we don't know, we'll only find out now.\"What next: 'He will think 'is this really for me?''Questions will now turn to whether Rooney will ever manage again, after some frustrating spells in the dugout.Former Chelsea and Scotland winger Pat Nevin thinks his fellow ex-Everton attacker will now have a period of self-reflection before deciding on his future.\"It was a tough job to take in. But that's the good thing about Wayne Rooney - he's not been afraid to take on tough jobs,\" he told BBC Radio 5 Live.\"None of the jobs have gone particularly well for him, so the question is does he really fancy it from here on in?\"The one thing I would say is he obviously loves the game that much. I know this because I don't love it that much to go through that sort of pain, stress and abuse.\"I think Wayne will sit down after this and think: 'Is this really for me? Do I want to be in coaching? Do I love the game enough?' There's nothing wrong with going back into coaching or being assistant, but what are you building to? Because when you go through that route that can take 10-15 years. Do you need that? Certainly financially he doesn't.\"",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Humble \u0026amp; popular but no plan B\u0026#39; - The inside story of Rooney at Plymouth\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Wayne Rooney graphic\" loading=\"eager\" src=\"https://ichef.bbci.co.uk/ace/standard/2048/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/10ae/live/20a61550-c793-11ef-94cb-5f844ceb9e30.png 976w\" width=\"2048\" height=\"1152\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eWayne Rooney won four of his 23 Championship matches in charge of Plymouth\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eFormer England and Manchester United forward Wayne Rooney has \u003c/b\u003e\u003ca href=\"https://www.bbc.com/sport/football/articles/c0mvy4w3nnlo\"\u003e\u003cb\u003eleft Championship side Plymouth Argyle\u003c/b\u003e\u003c/a\u003e\u003cb\u003e after seven months in charge, with the club bottom of the table and four points from safety.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eIt brings the 39-year-old\u0026#39;s fourth managerial role to an end, after challenging spells in the second tier with Birmingham City and Derby County, as well as in the United States with DC United.\u003c/p\u003e\u003cp\u003eSo where did it go wrong for the legendary striker at Plymouth? What was he like to deal with? And how did the players feel about him? BBC Sport delves into some key themes.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"The-style-of-play-He-tried-to-be-progressive-but-it-didnt-work\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eThe style of play: \u0026#39;He tried to be progressive, but it didn\u0026#39;t work\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eRooney appeared to come from the Pep Guardiola school of tactics.\u003c/p\u003e\u003cp\u003eA goalkeeper who could initiate attacks, full-backs who would invert into midfield and playing through the thirds.\u003c/p\u003e\u003cp\u003eAnd this style of play, in home games, often entertained - there was a 3-2 win over high-flying Sunderland and two 3-3 draws, with five stoppage-time goals scored at Home Park to gain six crucial points.\u003c/p\u003e\u003cp\u003eHowever, the last-gasp heroics were papering over the cracks of what were often patchy performances.\u003c/p\u003e\u003cp\u003eWhile Argyle\u0026#39;s 48.6% possession average ranks them a respectable 16th in the Championship, they are bottom for expected goals (19.39) and above only Portsmouth for shots on target (78) - with a league-worst xG against (44.03) and shots on target faced (141).\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;He was trying to be progressive and building from the back but it often didn\u0026#39;t work because they weren\u0026#39;t great at dealing with the press,\u0026#34; said BBC Radio Devon sports reporter Alan Richardson.\u003c/p\u003e\u003cp\u003e\u0026#34;I think other teams sussed them out and there was no plan B, and he wasn\u0026#39;t helped by the fact he didn\u0026#39;t have the best team anyway.\u0026#34;\u003c/p\u003e\u003cp\u003ePlymouth have to travel further than any other English Football League club, and their away form has often historically been bad, but under Rooney things reached a new low.\u003c/p\u003e\u003cp\u003eFrom 13 away league matches the Pilgrims have managed no wins, two points and only three goals, while conceding a staggering 35 times.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"The-players-He-was-popular-there-was-no-loss-of-the-dressing-room\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eThe players: \u0026#39;He was popular, there was no loss of the dressing room\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAfter Plymouth\u0026#39;s thrashing by Norwich, Rooney claimed the club\u0026#39;s under-18s side \u003ca href=\"https://www.bbc.com/sport/football/articles/cvgkxvx4z2go\"\u003ecould have done a better job,\u003c/a\u003e while after their 4-0 opening weekend defeat at Sheffield Wednesday he warned his players \u003ca href=\"https://www.bbc.com/sport/football/articles/cewlxr1drw8o\"\u003ethey would not play for him again\u003c/a\u003e if they put in a repeat performance.\u003c/p\u003e\u003cp\u003eDespite the occasional public criticism of his squad, both the players and board seemed completely behind him until the end.\u003c/p\u003e\u003cp\u003e\u0026#34;There was no loss of the dressing room, I get the impression they would run through brick walls for him,\u0026#34; said Richardson.\u003c/p\u003e\u003cp\u003e\u0026#34;He was very popular and well liked, and always had time for all members of the staff.\u0026#34;\u003c/p\u003e\u003cp\u003eThere was some upheaval earlier this month when Rooney\u0026#39;s long-time assistant Pete Shuttleworth left by mutual consent, with Mike Phelan - number two to Alex Ferguson at Manchester United - replacing him in what seemed a coup.\u003c/p\u003e\u003cp\u003eBut that only brought about a brief uplift in performances, with Phelan also leaving Home Park after just 23 days in post.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eRooney was always very forthright with the media and did not duck any questions\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAs a global star coming to a geographical outpost, Rooney could perhaps have been forgiven for wanting to be the main attraction at Home Park.\u003c/p\u003e\u003cp\u003eBut that could not have been further from the truth.\u003c/p\u003e\u003cp\u003e\u0026#34;He was always affable, humble, approachable and didn\u0026#39;t have any airs or graces,\u0026#34; Richardson told BBC Sport.\u003c/p\u003e\u003cp\u003e\u0026#34;He was one of the most easy-going managers I\u0026#39;ve had to deal with.\u0026#34;\u003c/p\u003e\u003cp\u003eRooney\u0026#39;s Plymouth were beaten by a margin of three goals or more on six occasions, leading to some difficult post-match interviews.\u003c/p\u003e\u003cp\u003eHowever, he never seemed to shirk responsibility.\u003c/p\u003e\u003cp\u003e\u0026#34;He missed one press conference but otherwise was always there, there was never any suggestion of him not being in Plymouth when he should be - something that was levelled towards some previous managers,\u0026#34; added Richardson.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought he was always very honest with the press, perhaps too honest at times.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"The-fans-Rooney-was-absolutely-brilliant-with-supporters\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eThe fans: Rooney was \u0026#39;absolutely brilliant\u0026#39; with supporters\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003ePlymouth Job was an easy decision to make - Wayne Rooney\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eWhen news of Rooney\u0026#39;s impending appointment leaked out, the reaction among the Plymouth faithful was one of pure disbelief.\u003c/p\u003e\u003cp\u003e\u0026#34;It took a couple days for us to actually realise it was happening, it was all a bit of a shock,\u0026#34; podcaster Joe Bell told BBC Radio 5 Live.\u003c/p\u003e\u003cp\u003e\u0026#34;His track record didn\u0026#39;t suggest he was up to the job but then the star-struck nature set in and we were all like, \u0026#39;hang on a minute, England\u0026#39;s greatest ever goalscorer is now our manager\u0026#39;.\u0026#34;\u003c/p\u003e\u003cp\u003eHowever, many of those who doubted the move were soon won over by Rooney\u0026#39;s charm - it was clear he was not motivated by money, he had moved himself to the far south-west and was often seen out and about in the city.\u003c/p\u003e\u003cp\u003e\u0026#34;He was used to being mobbed by the fans,\u0026#34; Richardson said.\u003c/p\u003e\u003cp\u003e\u0026#34;Early on he said he would always stop and sign autographs, and he was absolutely brilliant at that sort of thing.\u003c/p\u003e\u003cp\u003e\u0026#34;It was often a feeding frenzy with fans when he came out of a dressing room, yet he didn\u0026#39;t seem to mind and it was just part of his life.\u0026#34;\u003c/p\u003e\u003cp\u003eThat relationship perhaps bought Rooney more time with both Plymouth supporters and the club\u0026#39;s board.\u003c/p\u003e\u003cp\u003eBut defeat at Oxford United on 29 December took the club\u0026#39;s form to one win in 14 games - a step too far.\u003c/p\u003e\u003cp\u003e\u0026#34;We really wanted it to work - as a fanbase I think we\u0026#39;ve tried to give Wayne as much of a chance as we can,\u0026#34; added Bell.\u003c/p\u003e\u003cp\u003e\u0026#34;It was only actually on Sunday that the dissenting voices took to the stands and started calling for the manager to go.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"The-reality-Its-tricky-keeping-Plymouth-in-the-Championship\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eThe reality: \u0026#39;It\u0026#39;s tricky keeping Plymouth in the Championship\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThere were some mitigating factors to Rooney\u0026#39;s demise at Plymouth - some avoidable, some not so.\u003c/p\u003e\u003cp\u003eAs head coach, rather than manager, he could not be held solely responsible for transfers, though his reputation in the game played a part in some players opting to join.\u003c/p\u003e\u003cp\u003eHowever, it was clear the signing of experienced Iceland defender Victor Palsson - who played under Rooney at DC United - was one he had pushed for.\u003c/p\u003e\u003cp\u003eThe former Liverpool academy player managed just eight appearances under Rooney, struggling with form and injury, and with the January transfer window now opening it did not inspire confidence in his eye for a player.\u003c/p\u003e\u003cp\u003e\u0026#34;To be fair to Wayne he\u0026#39;s been dealt a tricky hand - we have the smallest budget in the division, we\u0026#39;re a small fish in an incredibly large pond, we\u0026#39;re consistently punching above our weight and he had to come in and overachieve,\u0026#34; Bell said.\u003c/p\u003e\u003cp\u003e\u0026#34;I do feel for Wayne because it is a difficult job - it is tricky to try and keep Plymouth Argyle in the Championship. We did it by the skin of our teeth last year and unfortunately, as much as I\u0026#39;d like an easier season, I think we\u0026#39;ll probably have to do it the same way again this year.\u0026#34;\u003c/p\u003e\u003cp\u003eOne thing Rooney could certainly not be blamed for was Argyle\u0026#39;s crippling injury list.\u003c/p\u003e\u003cp\u003eHe has been without the spine of his team, including captain Joe Edwards - now caretaker manager - on-loan Toulouse livewire Ibrahim Cissoko and Morgan Whittaker, who scored 20 goals last season and was the subject of a multimillion-pound bid from Italian giants Lazio last January.\u003c/p\u003e\u003cp\u003eIt meant 16-year-old academy product Tegan Finn had to start their 4-0 defeat at Coventry on Boxing Day.\u003c/p\u003e\u003cp\u003e\u0026#34;Unfortunately, despite having an injury list the length of anybody\u0026#39;s arm, it\u0026#39;s not worked out for Wayne and the time had to come.\u003c/p\u003e\u003cp\u003e\u0026#34;A lot of people in defence of Wayne have asked: \u0026#39;Who could have done better?\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003e\u0026#34;The simple fact is we don\u0026#39;t know, we\u0026#39;ll only find out now.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-next-He-will-think-is-this-really-for-me\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat next: \u0026#39;He will think \u0026#39;is this really for me?\u0026#39;\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eQuestions will now turn to whether Rooney will ever manage again, after some frustrating spells in the dugout.\u003c/p\u003e\u003cp\u003eFormer Chelsea and Scotland winger Pat Nevin thinks his fellow ex-Everton attacker will now have a period of self-reflection before deciding on his future.\u003c/p\u003e\u003cp\u003e\u0026#34;It was a tough job to take in. But that\u0026#39;s the good thing about Wayne Rooney - he\u0026#39;s not been afraid to take on tough jobs,\u0026#34; he told BBC Radio 5 Live.\u003c/p\u003e\u003cp\u003e\u0026#34;None of the jobs have gone particularly well for him, so the question is does he really fancy it from here on in?\u003c/p\u003e\u003cp\u003e\u0026#34;The one thing I would say is he obviously loves the game that much. I know this because I don\u0026#39;t love it that much to go through that sort of pain, stress and abuse.\u003c/p\u003e\u003cp\u003e\u0026#34;I think Wayne will sit down after this and think: \u0026#39;Is this really for me? Do I want to be in coaching? Do I love the game enough?\u0026#39; \u003c/p\u003e\u003cp\u003eThere\u0026#39;s nothing wrong with going back into coaching or being assistant, but what are you building to? Because when you go through that route that can take 10-15 years. Do you need that? Certainly financially he doesn\u0026#39;t.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-12-31T18:17:26.901Z",
  "modifiedTime": null
}
