{
  "id": "43757a81-cd5d-40b8-8f2b-e0f8f43d3844",
  "title": "How Postecoglou abandoned 'Ange-ball' to win Europa League",
  "link": "https://www.bbc.com/sport/football/articles/czely53z689o",
  "description": "From all-out attack to parking the bus - how Ange Postecoglou changed his style in order to guide Tottenham to Europa League glory.",
  "author": "",
  "published": "Wed, 21 May 2025 23:15:48 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Gary Rose",
  "length": 5417,
  "excerpt": "From all-out attack to parking the bus - how Ange Postecoglou changed his style in order to guide Tottenham to Europa League glory.",
  "siteName": "BBC Sport",
  "favicon": "https://static.files.bbci.co.uk/core/website/assets/static/icons/touch/sport/touch-icon-512.239d26b83e.png",
  "text": "\"It's just who we are mate - it's who we are and who we will be for as long as I am here. If we go down to five men we will have a go.\"When Ange Postecoglou defended his decision to not abandon his attacking principles after a 4-1 loss to Chelsea in November 2023 - despite Spurs going down to nine men - it drew a mixture of responses.There were those who admired his stance, and those who felt it foolish not to be more flexible.In the main, Postecoglou continued to stick by those principles, but for the biggest game of his Spurs reign - and the club's recent history - he abandoned them.In Wednesday's Europa League final they ground out a 1-0 win against Manchester United, spending almost the entire second half defending as Spurs won their first trophy in 17 years.\"Ange Postecoglou said that he doesn't change his tactics - what made him do it?\" asked former Tottenham midfielder Michael Brown on BBC Radio 5 Live.\"I was sat there thinking 'Is he really doing this [defending deep] so early?' He's changed his way and got success.\"Europa League success, and with it passage to next season's Champions League, means Tottenham can rightly laud this season as a triumph, despite the club's torrid domestic form.They are currently in danger of finishing one place outside the Premier League relegation zone after losing 21 of their 37 league games with one fixture remaining.That form means uncertainty remains over Postecoglou's future, even after this Europa League win.Therefore there was possibly an element of the Tottenham boss having nothing to lose in terms of how he approached Wednesday's final.Spurs had already played Manchester United three times this season and won all three, scoring eight goals and conceding three - underlining Postecoglou's high-pressing and swashbuckling style of play.But there were hints he was preparing to take a more pragmatic approach for this fourth fixture against the Red Devils in the second leg of their Europa League semi-final against Bodo/Glimt.At the home of the Norwegians, Spurs had just 31.6% possession. Against Manchester United they had 27.7%. Both are the lowest amount of possession Spurs have had in games they have won under Postecoglou.Neither side were brilliant or particularly adventurous in a dull first half, but it was Tottenham who got the breakthrough when Brennan Johnson bundled in from close range.After that it was all about defending what they had.In the second half they had just one touch inside the opposition box, did not have a shot on or off target, and just 19.8% possession.And in uncharacteristic fashion Postecoglou sacrificed an attacking player for a defensive one when Johnson was replaced by centre-back Kevin Danso.Former Tottenham goalkeeper Paul Robinson said: \"It was a poor watch, it really was an awful game, but Tottenham ruined it. They spoiled the game. That was the game plan.\"It was not what we are used to seeing from Ange Postecoglou. It was a gritty, horrible, defensive, determined, rugged performance.\"Tottenham certainly rode their luck at times and also needed some big individual performances as Micky van de Ven made an incredible goalline clearance from Rasmus Hojlund, while goalkeeper Guglielmo Vicario made a big save from Luke Shaw late on.Overall Spurs had three shots, just 27.7% possession and completed 115 passes, all the lowest figures Opta has on record by any team in a major European final (since 2009-10).\"This showed there is a plan B,\" former Tottenham forward Gareth Bale said on TNT Sports.\"I guess as a manager if Ange Postecoglou also matures, and brings that type of defensive side to his teams, of course he can still have great success here.\"Ex-Leicester midfielder Robbie Savage added on BBC Radio 5 Live: \"He's adapted, big Ange.\"He hasn't gone a full press, he hasn't gone with a high line. He sat deep and won the game because he adapted.\"Image gallerySkip image galleryImage caption, Back in September Tottenham faced Arsenal in the North London Derby. They had 63.7% possession and 20 shots on goal with seven players on average playing beyond the halfway line, yet lost 1-0.Slide 1 of 2, Average position graphic for Tottenham's game against Arsenal back in September , Back in September Tottenham faced Arsenal in the North London Derby. They had 63.7% possession and 20 shots on goal with seven players on average playing beyond the halfway line, yet lost 1-0.So did Postecoglou completely abandon his approach to football? According to the man himself, no - as he said the Europa League requires a different approach to Premier League football.\"I've always felt that knockout football is different from your league football,\" Postecoglou said.\"When you're in that situation, it comes down really to good organisation, belief, having a good game plan and then moments; if you can minimise the moments the opposition have by having a really strong foundation.\"I always felt comfortable that if we got ahead, we could negate most of what Manchester United were going to throw at us.\"Uncertainty remains over Postecoglou's long-term future at Spurs, but he is determined to stay at the club and, as he puts it, \"complete the job\".While 'Ange-ball' is unlikely to go away completely, the flexibility shown by Postecoglou to change his approach and secure a first European trophy in 41 years for Spurs may convince the club's fans that there could be even better times ahead.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae99/live/9d48e5c0-3696-11f0-96c3-cf669419a2b0.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003e\u0026#34;It\u0026#39;s just who we are mate - it\u0026#39;s who we are and who we will be for as long as I am here. If we go down to five men we will have a go.\u0026#34;\u003c/b\u003e\u003c/p\u003e\u003cp\u003eWhen Ange Postecoglou defended his decision to not abandon his attacking principles after a \u003ca href=\"https://www.bbc.com/sport/football/67258895\"\u003e4-1 loss to Chelsea\u003c/a\u003e in November 2023 - despite Spurs going down to nine men - it drew a mixture of responses.\u003c/p\u003e\u003cp\u003eThere were those who admired his stance, and those who felt it foolish not to be more flexible.\u003c/p\u003e\u003cp\u003eIn the main, Postecoglou continued to stick by those principles, but for the biggest game of his Spurs reign - and the club\u0026#39;s recent history - he abandoned them.\u003c/p\u003e\u003cp\u003eIn Wednesday\u0026#39;s Europa League final they \u003ca href=\"https://www.bbc.com/sport/football/live/cz9yney9391t\"\u003eground out a 1-0 win against Manchester United,\u003c/a\u003e spending almost the entire second half defending as Spurs won their first trophy in 17 years.\u003c/p\u003e\u003cp\u003e\u0026#34;Ange Postecoglou said that he doesn\u0026#39;t change his tactics - what made him do it?\u0026#34; asked former Tottenham midfielder Michael Brown on BBC Radio 5 Live.\u003c/p\u003e\u003cp\u003e\u0026#34;I was sat there thinking \u0026#39;Is he really doing this [defending deep] so early?\u0026#39; He\u0026#39;s changed his way and got success.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEuropa League success, and with it passage to next season\u0026#39;s Champions League, means Tottenham can rightly laud this season as a triumph, despite the club\u0026#39;s torrid domestic form.\u003c/p\u003e\u003cp\u003eThey are currently in danger of finishing one place outside the Premier League relegation zone after losing 21 of their 37 league games with one fixture remaining.\u003c/p\u003e\u003cp\u003eThat form means uncertainty remains over Postecoglou\u0026#39;s future, even after this Europa League win.\u003c/p\u003e\u003cp\u003eTherefore there was possibly an element of the Tottenham boss having nothing to lose in terms of how he approached Wednesday\u0026#39;s final.\u003c/p\u003e\u003cp\u003eSpurs had already played Manchester United three times this season and won all three, scoring eight goals and conceding three - underlining Postecoglou\u0026#39;s high-pressing and swashbuckling style of play.\u003c/p\u003e\u003cp\u003eBut there were hints he was preparing to take a more pragmatic approach for this fourth fixture against the Red Devils in the second leg of their Europa League semi-final against Bodo/Glimt.\u003c/p\u003e\u003cp\u003eAt the home of the Norwegians, Spurs had just 31.6% possession. Against Manchester United they had 27.7%. Both are the lowest amount of possession Spurs have had in games they have won under Postecoglou.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eNeither side were brilliant or particularly adventurous in a dull first half, but it was Tottenham who got the breakthrough when Brennan Johnson bundled in from close range.\u003c/p\u003e\u003cp\u003eAfter that it was all about defending what they had.\u003c/p\u003e\u003cp\u003eIn the second half they had just one touch inside the opposition box, did not have a shot on or off target, and just 19.8% possession.\u003c/p\u003e\u003cp\u003eAnd in uncharacteristic fashion Postecoglou sacrificed an attacking player for a defensive one when Johnson was replaced by centre-back Kevin Danso.\u003c/p\u003e\u003cp\u003eFormer Tottenham goalkeeper Paul Robinson said: \u0026#34;It was a poor watch, it really was an awful game, but Tottenham ruined it. They spoiled the game. That was the game plan.\u003c/p\u003e\u003cp\u003e\u0026#34;It was not what we are used to seeing from Ange Postecoglou. It was a gritty, horrible, defensive, determined, rugged performance.\u0026#34;\u003c/p\u003e\u003cp\u003eTottenham certainly rode their luck at times and also needed some big individual performances as Micky van de Ven made an incredible goalline clearance from Rasmus Hojlund, while goalkeeper Guglielmo Vicario made a big save from Luke Shaw late on.\u003c/p\u003e\u003cp\u003eOverall Spurs had three shots, just 27.7% possession and completed 115 passes, all the lowest figures Opta has on record by any team in a major European final (since 2009-10).\u003c/p\u003e\u003cp\u003e\u0026#34;This showed there is a plan B,\u0026#34; former Tottenham forward Gareth Bale said on TNT Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;I guess as a manager if Ange Postecoglou also matures, and brings that type of defensive side to his teams, of course he can still have great success here.\u0026#34;\u003c/p\u003e\u003cp\u003eEx-Leicester midfielder Robbie Savage added on BBC Radio 5 Live: \u0026#34;He\u0026#39;s adapted, big Ange.\u003c/p\u003e\u003cp\u003e\u0026#34;He hasn\u0026#39;t gone a full press, he hasn\u0026#39;t gone with a high line. He sat deep and won the game because he adapted.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection aria-labelledby=\"storyboard-11-image-gallery\" data-component=\"storyboard-block\"\u003e\u003cspan id=\"storyboard-11-image-gallery\"\u003eImage gallery\u003c/span\u003e\u003cspan\u003e\u003ca href=\"#storyboard-11-end-of-image-gallery\"\u003eSkip image gallery\u003c/a\u003e\u003c/span\u003e\u003col tabindex=\"0\"\u003e\u003cli aria-hidden=\"false\" data-testid=\"storyboard-11-slide0\"\u003e\u003cdiv\u003e\u003cfigure\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003cpicture\u003e\u003csource srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png.webp 976w\" type=\"image/webp\"/\u003e\u003cimg alt=\"Average position graphic for Tottenham\u0026#39;s game against Arsenal back in September \" src=\"https://ichef.bbci.co.uk/ace/standard/1056/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/5c95/live/fc7e46d0-3690-11f0-8947-7d6241f9fce9.png 976w\" width=\"1056\" height=\"1320\"/\u003e\u003c/picture\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eBack in September Tottenham faced Arsenal in the North London Derby. They had 63.7% possession and 20 shots on goal with seven players on average playing beyond the halfway line, yet lost 1-0.\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ol\u003e\u003cspan data-testid=\"storyboard-11-live-region\" id=\"storyboard-11-live-region\" aria-live=\"polite\" aria-atomic=\"true\"\u003e\u003cspan role=\"text\"\u003eSlide 1 of 2, Average position graphic for Tottenham\u0026#39;s game against Arsenal back in September , Back in September Tottenham faced Arsenal in the North London Derby. They had 63.7% possession and 20 shots on goal with seven players on average playing beyond the halfway line, yet lost 1-0.\u003c/span\u003e\u003c/span\u003e\u003c/section\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSo did Postecoglou completely abandon his approach to football? \u003c/p\u003e\u003cp\u003eAccording to the man himself, no - as he said the Europa League requires a different approach to Premier League football.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve always felt that knockout football is different from your league football,\u0026#34; Postecoglou said.\u003c/p\u003e\u003cp\u003e\u0026#34;When you\u0026#39;re in that situation, it comes down really to good organisation, belief, having a good game plan and then moments; if you can minimise the moments the opposition have by having a really strong foundation.\u003c/p\u003e\u003cp\u003e\u0026#34;I always felt comfortable that if we got ahead, we could negate most of what Manchester United were going to throw at us.\u0026#34;\u003c/p\u003e\u003cp\u003eUncertainty remains over Postecoglou\u0026#39;s long-term future at Spurs, but he is determined to stay at the club and, as he puts it, \u0026#34;complete the job\u0026#34;.\u003c/p\u003e\u003cp\u003eWhile \u0026#39;Ange-ball\u0026#39; is unlikely to go away completely, the flexibility shown by Postecoglou to change his approach and secure a first European trophy in 41 years for Spurs may convince the club\u0026#39;s fans that there could be even better times ahead.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-21T23:15:48.456Z",
  "modifiedTime": null
}
