{
  "id": "4a148572-d269-47a0-9aeb-98d332dd7c80",
  "title": "Scheffler to miss start of season after Christmas dinner injury",
  "link": "https://www.bbc.com/sport/golf/articles/cly2x1zdwywo",
  "description": "World number one Scottie Scheffler will miss the first two weeks of the 2025 PGA Tour season after undergoing surgery on a hand injury sustained cooking Christmas dinner.",
  "author": "",
  "published": "Fri, 27 Dec 2024 23:51:05 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 1481,
  "excerpt": "World number one Scottie Scheffler will miss the first two weeks of the 2025 PGA Tour season after undergoing surgery on a hand injury sustained cooking Christmas dinner.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "World number one Scottie Scheffler will miss the first two weeks of the 2025 PGA Tour season after undergoing surgery on a hand injury sustained cooking Christmas dinner.The American, 28, has withdrawn from the opening tournament of the campaign at The Sentry next week. Scheffler is then expected to miss the Sony Open, also being played in Hawaii, before returning to action at The American Express Championship in California, being held between 16-19 January. The news was announced in a statement released on Friday by Scheffler's manager, Blake Smith, who said: \"On Christmas Day while preparing dinner, Scottie sustained a puncture wound to the palm of his right hand from a broken glass.\"Small glass fragments remained in the palm which required surgery. He has been told that he should be back to 100% in three to four weeks.\"His next scheduled tournament is The American Express.\"Scheffler was recently named the PGA Tour's Player of the Year for a third consecutive season. He won nine titles, with seven coming on the main tour in the United States including triumphing for the second occasion at both the Players Championship and The Masters. Scheffler also earned an Olympic gold medal in Paris and his victory at the Tour Championship secured a first FedEx Cup success in an eventful season that also saw him warm up for the second round of the US PGA Championship in a jail cell after being arrested on his way into Valhalla Golf Club.All charges were later dropped.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4caa/live/428726e0-c4ab-11ef-a5bf-6b8a37bd3839.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWorld number one Scottie Scheffler will miss the first two weeks of the 2025 PGA Tour season after undergoing surgery on a hand injury sustained cooking Christmas dinner.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe American, 28, has withdrawn from the opening tournament of the campaign at The Sentry next week. \u003c/p\u003e\u003cp\u003eScheffler is then expected to miss the Sony Open, also being played in Hawaii, before returning to action at The American Express Championship in California, being held between 16-19 January. \u003c/p\u003e\u003cp\u003eThe news was announced in a statement released on Friday by Scheffler\u0026#39;s manager, Blake Smith, who said: \u0026#34;On Christmas Day while preparing dinner, Scottie sustained a puncture wound to the palm of his right hand from a broken glass.\u003c/p\u003e\u003cp\u003e\u0026#34;Small glass fragments remained in the palm which required surgery. He has been told that he should be back to 100% in three to four weeks.\u003c/p\u003e\u003cp\u003e\u0026#34;His next scheduled tournament is The American Express.\u0026#34;\u003c/p\u003e\u003cp\u003eScheffler was recently named the PGA Tour\u0026#39;s Player of the Year for a third consecutive season. \u003c/p\u003e\u003cp\u003eHe won nine titles, with seven coming on the main tour in the United States including triumphing for the second occasion at both the Players Championship and The Masters. \u003c/p\u003e\u003cp\u003eScheffler also earned an Olympic gold medal in Paris and his victory at the Tour Championship secured a first FedEx Cup success in an eventful season that also saw him warm up for the second round of the US PGA Championship \u003ca href=\"https://www.bbc.com/sport/golf/articles/c977gnrnyqpo\"\u003ein a jail cell after being arrested\u003c/a\u003e on his way into Valhalla Golf Club.\u003c/p\u003e\u003cp\u003eAll charges were later dropped.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2024-12-27T23:51:05.577Z",
  "modifiedTime": null
}
