{
  "id": "4a96a668-5b02-420e-b131-242473f3ee08",
  "title": "UCLA lands NCAA's No. 1 overall women's seed",
  "link": "https://www.espn.com/womens-college-basketball/story/_/id/44282580/ucla-south-carolina-usc-texas-ncaa-tournament-no-1-seeds",
  "description": "UCLA, South Carolina, Texas, who all had a turn at No. 1 this season in the Associated Press poll, joined USC Sunday as the four top seeds in the NCAA's women's basketball tournament, which begins this week and will conclude with the Final Four in Tampa.",
  "author": "ESPN News Services",
  "published": "Sun, 16 Mar 2025 21:00:13 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Alexa Philippou, +3 More",
  "length": 2983,
  "excerpt": "UCLA, South Carolina, Texas, who all had a turn at No. 1 this season in the Associated Press poll, joined USC Sunday as the four top seeds in the NCAA's women's basketball tournament, which begins this week and will conclude with the Final Four in Tampa.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "ESPN News ServicesMar 16, 2025, 08:18 PM ETUCLA, South Carolina and Texas, programs that all had a turn at No. 1 this season in the Associated Press Top 25 poll, joined USC Sunday as the four top seeds in the NCAA's women's basketball tournament, which begins this week and will conclude with the Final Four in Tampa.UCLA received the No. 1 overall seed a week after securing the Big Ten tournament championship in Indianapolis. In that tourney, the Bruins topped the rival Trojans at Gainbridge Fieldhouse in both schools' inaugural season in the league.UCLA had lost by double digits in the previous two regular-season meetings vs. USC, the Bruins' only two losses. The competition between them has seemed to strengthen the mutual respect while making the specter of another meeting more real. And now, for them to meet again in the NCAA tournament, it would have to be under the bright lights in Tampa.Derita Dawkins, the chair of the selection committee, and the assistant vice chancellor and deputy director of athletics at Arkansas, spoke with ESPN's Holly Rowe after the full bracket was announced, and was asked immediately about the decision to place the Bruins over the Gamecocks at No. 1 overall.\"There were two key factors between UCLA and South Carolina,\" Dawkins said with regards to the No. 1 overall seed. \"One wad the head to head matchup. And the other was one of our criteria, which is competitive in losses. And South Carolina suffered a 29-point loss to UConn.\"The Gamecocks still secured a No. 1 seed after a season in which they posted a 30-3 record that culminated with a win over the Longhorns in the SEC tournament title game last week. Headed into that tournament, South Carolina was ranked fifth in the country and projected to be a No. 2 seed.Though Texas lost that title game to the Gamecocks, the Longhorns did secure a share of the regular-season title in their first season in the SEC. They, too, are 31-3 and finished 15-1 in the conference's regular season.Perennial power UConn, which won the Big East tournament convincingly last week, is a No. 2 seed after a regular season in which the Huskies went 18-0 in league, and closed with a 10-game winning streak.\"I think fans want to see good basketball,\" Dawkins said when asked about the potential for the four No. 1s to converge on Tampa. \"And they're going to see that. I think the teams deserve to be seeded and bracketed according to the work they've done all year on the court. And that's what we did.\"For the first time in NCAA history, there will be a financial incentive for women's teams. They will finally get paid for playing games in the NCAA Tournament just like the men have for years.So-called performance units, which represent revenue, will be given to women's teams for each win they get. A team that reaches the Final Four could bring its conference roughly $1.26 million over the next three years in financial performance rewards.The Associated Press contributed to this report.",
  "image": "https://a4.espncdn.com/combiner/i?img=%2Fi%2Fteamlogos%2Fncaa%2F500%2F2579.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003eESPN News Services\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eMar 16, 2025, 08:18 PM ET\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003eUCLA, South Carolina and Texas, programs that all had a turn at No. 1 this season in the Associated Press Top 25 poll, joined USC Sunday as the four top seeds in the NCAA\u0026#39;s women\u0026#39;s basketball tournament, which begins this week and will conclude with the Final Four in Tampa.\u003c/p\u003e\u003cp\u003eUCLA received the No. 1 overall seed a week after securing the Big Ten tournament championship in Indianapolis. In that tourney, the Bruins topped the rival Trojans at Gainbridge Fieldhouse in both schools\u0026#39; inaugural season in the league.\u003c/p\u003e\u003cp\u003eUCLA had lost by double digits in the previous two regular-season meetings vs. USC, the Bruins\u0026#39; only two losses. The competition between them has seemed to strengthen the mutual respect while making the specter of another meeting more real. And now, for them to meet again in the NCAA tournament, it would have to be under the bright lights in Tampa.\u003c/p\u003e\u003cp\u003eDerita Dawkins, the chair of the selection committee, and the assistant vice chancellor and deputy director of athletics at Arkansas, spoke with ESPN\u0026#39;s Holly Rowe after the full bracket was announced, and was asked immediately about the decision to place the Bruins over the Gamecocks at No. 1 overall.\u003c/p\u003e\u003cp\u003e\u0026#34;There were two key factors between UCLA and South Carolina,\u0026#34; Dawkins said with regards to the No. 1 overall seed. \u0026#34;One wad the head to head matchup. And the other was one of our criteria, which is competitive in losses. And South Carolina suffered a 29-point loss to UConn.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Gamecocks still secured a No. 1 seed after a season in which they posted a 30-3 record that culminated with a win over the Longhorns in the SEC tournament title game last week. Headed into that tournament, South Carolina was ranked fifth in the country and projected to be a No. 2 seed.\u003c/p\u003e\u003cp\u003eThough Texas lost that title game to the Gamecocks, the Longhorns did secure a share of the regular-season title in their first season in the SEC. They, too, are 31-3 and finished 15-1 in the conference\u0026#39;s regular season.\u003c/p\u003e\u003cp\u003ePerennial power UConn, which won the Big East tournament convincingly last week, is a No. 2 seed after a regular season in which the Huskies went 18-0 in league, and closed with a 10-game winning streak.\u003c/p\u003e\u003cp\u003e\u0026#34;I think fans want to see good basketball,\u0026#34; Dawkins said when asked about the potential for the four No. 1s to converge on Tampa. \u0026#34;And they\u0026#39;re going to see that. I think the teams deserve to be seeded and bracketed according to the work they\u0026#39;ve done all year on the court. And that\u0026#39;s what we did.\u0026#34;\u003c/p\u003e\u003cp\u003eFor the first time in NCAA history, there will be a financial incentive for women\u0026#39;s teams. They will finally get paid for playing games in the NCAA Tournament just like the men have for years.\u003c/p\u003e\u003cp\u003eSo-called performance units, which represent revenue, will be given to women\u0026#39;s teams for each win they get. A team that reaches the Final Four could bring its conference roughly $1.26 million over the next three years in financial performance rewards.\u003c/p\u003e\u003cp\u003e\u003cem\u003eThe Associated Press contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-03-17T00:18:00Z",
  "modifiedTime": null
}
