{
  "id": "6618553b-65de-40dd-8c46-2926de16f4ca",
  "title": "SEC's Sankey: Not settled on preferred CFP format",
  "link": "https://www.espn.com/college-football/story/_/id/45336174/greg-sankey-says-sec-not-settled-preferred-cfp-format",
  "description": "SEC commissioner Greg Sankey said Monday at the league's annual meetings that he's open-minded about the format of the College Football Playoff, while leaving some breadcrumbs about what he thinks are priorities in the conference's decision-making.",
  "author": "Pete Thamel",
  "published": "Mon, 26 May 2025 21:08:41 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Pete Thamel",
  "length": 4910,
  "excerpt": "SEC commissioner Greg Sankey said Monday at the league's annual meetings that he's open-minded about the format of the College Football Playoff, while leaving some breadcrumbs about what he thinks are priorities in the conference's decision-making.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Heather Dinich tells McAfee why CFP is moving to straight seeding (1:24)Heather Dinich joins Pat McAfee to break down the news that the College Football Playoff will be moving to a straight seeding model. (1:24)DESTIN, Fla. -- SEC commissioner Greg Sankey opened the league's annual meetings Monday by saying he's open-minded about the format of the College Football Playoff, while leaving some breadcrumbs about what he thinks are priorities in the conference's decision-making.With SEC athletic directors, presidents and coaches converging in Destin this week, the future of the College Football Playoff in 2026 and beyond is one of the central issues facing the league.That's in part because the playoff format decision is kinetic, as it impacts the SEC's football schedule going to nine games and some type of down-the-road scheduling partnership with the Big Ten.\"We're not committed to any particular format,\" Sankey said.With conversations among CFP leaders about format having appeared to splinter off to just the four power conference commissioners, a 16-team model looms as the most likely for the future of the sport. Sankey remains noncommittal on how the SEC thinks that should work, as college football enters the final year of its current postseason format.The most discussed model has been one where the Big Ten and SEC would get four automatic bids each, and the ACC and Big 12 two each.But Sankey stressed that the so-called 4-4-2-2-1-3 model, which distributes one automatic bid to the non-power leagues and three available at-large -- potentially for Notre Dame -- has not been decided on in his room.\"We'll see how that conversation manifests itself this week and we'll look a little bit more deeply at different ideas,\" he said, \"which will put me at some point in a better position to answer those questions.\"Sankey did dive into some traits in the CFP system that he'd like to see, including a prioritization of the regular season -- and games like Nebraska's recently cancelled series with Tennessee -- while keeping postseason hopes alive for a swath of teams deep into the season.\"I think the word 'hope' is at the center, too,\" Sankey said. \"How do you bring people into the conversation late in the season in a changing environment, and so the idea of, 'Could you have play-in-type games?' continues to populate itself before you're in the CFP selection. That's about building interest and giving hope.\"Whether that's the ultimate destination, we'll see.\"The Big Ten and commissioner Tony Petitti have been more bullish on the four automatic bids, according to sources. Sankey has spoken about them but remains more guarded in his support.Last week at the Big Ten meetings in California, the league came away still in support of the 4-4-2-2-1-3 model for the playoff, sources said. The Big Ten remains open to other ideas, but that model is at the forefront.Sankey's guarded stance stayed true Monday evening: \"We're trying to find a format to determine, whatever number it is, the best teams in college football, and I think where we are right now is we have used a political process inside a room to come to decisions about football. We should be using football information to come to football decisions.\"Sankey did make clear his disappointment in the reactions of the ACC and Big 12 commissioners to the move to a straight seeding model announced last week. Both commissioners referenced the macro good of the game in separate statements, with the ACC's Jim Phillips saying that's a \"responsibility I take very seriously\" and the Big 12's Brett Yormark saying he hopes what's best for college football is \"the priority\" in discussions moving forward.Sankey felt those separate responses from the leagues were coordinated -- although they were not formally -- and remarked: \"I don't need lectures from others about 'good of the game.' I don't lecture others about 'good of the game' and coordinating press releases about good of the game. Okay, you can issue your press statement, but I'm actually looking for ideas to move us forward.\"He did add that the Big 12 and ACC did eventually bring some CFP ideas, but they don't appear to have gained traction as they involved more bids -- or bids with thresholds -- for the ACC and Big 12.Sankey said displacement of SEC teams would loom as such a big issue if those models were accepted that he'd likely lose his job.\"That's tough\" he said, walking through a series of potential displacement scenarios for his members. \"I don't think it'd be me at the podium in the future if some of those ideas (came to fruition).\"The other issue looming over meetings is the potential for the settlement of the House case this week. He remains hopeful a decision comes.\"We have a responsibility for implementation,\" he said, \"so does it pivot what we say this week? Yep. Does it mean we're going to keep preparing? We're going to keep preparing.\"",
  "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0527%2Fr1498811_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,45272200,url-https://watch.auth.api.espn.com/video/auth/brightcove/189e3a50-7b61-4c24-ab63-2698a9723dba/asset?UMADPARAMreferer=https://www.espn.com/video/clip?id=45272200,poster-https://media.video-cdn.espn.com/motion/2025/0522/dm_250522_dinich_cfp/dm_250522_dinich_cfp.jpg\" data-cerebro-id=\"682f75dc7ac03e4755d198b5\" data-title=\"Heather Dinich tells McAfee why CFP is moving to straight seeding\" data-video-mobile-bloom=\"true\" data-source=\"espn\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eHeather Dinich tells McAfee why CFP is moving to straight seeding (1:24)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eHeather Dinich joins Pat McAfee to break down the news that the College Football Playoff will be moving to a straight seeding model. (1:24)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/thamel_pete.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eDESTIN, Fla. -- SEC commissioner Greg Sankey opened the league\u0026#39;s annual meetings Monday by saying he\u0026#39;s open-minded about the format of the College Football Playoff, while leaving some breadcrumbs about what he thinks are priorities in the conference\u0026#39;s decision-making.\u003c/p\u003e\u003cp\u003eWith SEC athletic directors, presidents and coaches converging in Destin this week, the future of the College Football Playoff in 2026 and beyond is one of the central issues facing the league.\u003c/p\u003e\u003cp\u003eThat\u0026#39;s in part because the playoff format decision is kinetic, as it impacts the SEC\u0026#39;s football schedule going to nine games and some type of down-the-road scheduling partnership with the Big Ten.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;re not committed to any particular format,\u0026#34; Sankey said.\u003c/p\u003e\u003cp\u003eWith conversations among CFP leaders about format having appeared to splinter off to just the four power conference commissioners, a 16-team model looms as the most likely for the future of the sport. Sankey remains noncommittal on how the SEC thinks that should work, as college football enters the final year of its current postseason format.\u003c/p\u003e\u003cp\u003eThe most discussed model has been one where the Big Ten and SEC would get four automatic bids each, and the ACC and Big 12 two each.\u003c/p\u003e\u003cp\u003eBut Sankey stressed that the so-called 4-4-2-2-1-3 model, which distributes one automatic bid to the non-power leagues and three available at-large -- potentially for \u003ca data-clubhouse-guid=\"ebc2999c-2ff4-8435-ca46-9641e9f9ea10\" href=\"https://www.espn.com/college-football/team/_/id/87/notre-dame-fighting-irish\"\u003eNotre Dame\u003c/a\u003e -- has not been decided on in his room.\u003c/p\u003e\u003cp\u003e\u0026#34;We\u0026#39;ll see how that conversation manifests itself this week and we\u0026#39;ll look a little bit more deeply at different ideas,\u0026#34; he said, \u0026#34;which will put me at some point in a better position to answer those questions.\u0026#34;\u003c/p\u003e\u003cp\u003eSankey did dive into some traits in the CFP system that he\u0026#39;d like to see, including a prioritization of the regular season -- and games like \u003ca data-clubhouse-guid=\"e9635416-dfc2-d9d6-ff1c-3e0f70ab2d8c\" href=\"https://www.espn.com/college-football/team/_/id/158/nebraska-cornhuskers\"\u003eNebraska\u003c/a\u003e\u0026#39;s recently cancelled series with \u003ca data-clubhouse-guid=\"de276cc4-dc02-159f-0c1c-67ddaf02a9ea\" href=\"https://www.espn.com/college-football/team/_/id/2633/tennessee-volunteers\"\u003eTennessee\u003c/a\u003e -- while keeping postseason hopes alive for a swath of teams deep into the season.\u003c/p\u003e\u003cp\u003e\u0026#34;I think the word \u0026#39;hope\u0026#39; is at the center, too,\u0026#34; Sankey said. \u0026#34;How do you bring people into the conversation late in the season in a changing environment, and so the idea of, \u0026#39;Could you have play-in-type games?\u0026#39; continues to populate itself before you\u0026#39;re in the CFP selection. That\u0026#39;s about building interest and giving hope.\u003c/p\u003e\u003cp\u003e\u0026#34;Whether that\u0026#39;s the ultimate destination, we\u0026#39;ll see.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Big Ten and commissioner Tony Petitti have been more bullish on the four automatic bids, according to sources. Sankey has spoken about them but remains more guarded in his support.\u003c/p\u003e\u003cp\u003eLast week at the Big Ten meetings in California, the league came away still in support of the 4-4-2-2-1-3 model for the playoff, sources said. The Big Ten remains open to other ideas, but that model is at the forefront.\u003c/p\u003e\u003cp\u003eSankey\u0026#39;s guarded stance stayed true Monday evening: \u0026#34;We\u0026#39;re trying to find a format to determine, whatever number it is, the best teams in college football, and I think where we are right now is we have used a political process inside a room to come to decisions about football. We should be using football information to come to football decisions.\u0026#34;\u003c/p\u003e\u003cp\u003eSankey did make clear his disappointment in the reactions of the ACC and Big 12 commissioners to the move to a \u003ca href=\"https://www.espn.com/college-football/story/_/id/45271767/sources-college-football-playoff-moving-straight-seeding\" target=\"_blank\"\u003estraight seeding model\u003c/a\u003e announced last week. Both commissioners referenced the macro good of the game in separate statements, with the ACC\u0026#39;s Jim Phillips saying that\u0026#39;s a \u0026#34;responsibility I take very seriously\u0026#34; and the Big 12\u0026#39;s Brett Yormark saying he hopes what\u0026#39;s best for college football is \u0026#34;the priority\u0026#34; in discussions moving forward.\u003c/p\u003e\u003cp\u003eSankey felt those separate responses from the leagues were coordinated -- although they were not formally -- and remarked: \u0026#34;I don\u0026#39;t need lectures from others about \u0026#39;good of the game.\u0026#39; I don\u0026#39;t lecture others about \u0026#39;good of the game\u0026#39; and coordinating press releases about good of the game. Okay, you can issue your press statement, but I\u0026#39;m actually looking for ideas to move us forward.\u0026#34;\u003c/p\u003e\u003cp\u003eHe did add that the Big 12 and ACC did eventually bring some CFP ideas, but they don\u0026#39;t appear to have gained traction as they involved more bids -- or bids with thresholds -- for the ACC and Big 12.\u003c/p\u003e\u003cp\u003eSankey said displacement of SEC teams would loom as such a big issue if those models were accepted that he\u0026#39;d likely lose his job.\u003c/p\u003e\u003cp\u003e\u0026#34;That\u0026#39;s tough\u0026#34; he said, walking through a series of potential displacement scenarios for his members. \u0026#34;I don\u0026#39;t think it\u0026#39;d be me at the podium in the future if some of those ideas (came to fruition).\u0026#34;\u003c/p\u003e\u003cp\u003eThe other issue looming over meetings is the potential for the settlement of the House case this week. He remains hopeful a decision comes.\u003c/p\u003e\u003cp\u003e\u0026#34;We have a responsibility for implementation,\u0026#34; he said, \u0026#34;so does it pivot what we say this week? Yep. Does it mean we\u0026#39;re going to keep preparing? We\u0026#39;re going to keep preparing.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-27T01:00:00Z",
  "modifiedTime": null
}
