{
  "id": "97487f30-b66b-4325-a857-b2c543c33c0f",
  "title": "Nuggets fire coach Malone, also won't extend GM",
  "link": "https://www.espn.com/nba/story/_/id/44588997/nuggets-fire-coach-michael-malone-stunner",
  "description": "The Nuggets, in fourth place in the West, fired coach Michael Malone and said they will not extend GM Calvin Booth's contract.",
  "author": "Ohm Youngmisuk",
  "published": "Tue, 8 Apr 2025 20:40:49 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Ohm Youngmisuk",
  "length": 4171,
  "excerpt": "The Nuggets, in fourth place in the West, fired coach Michael Malone and said they will not extend GM Calvin Booth's contract.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Shams: Nuggets moving on from Malone, Booth is 'stunning' (1:08)Shams Charania explains why Nuggets ownership moved on from head coach Michael Malone and general manager Calvin Booth. (1:08)Ohm YoungmisukApr 8, 2025, 01:34 PM ETCloseOhm Youngmisuk has covered the Giants, Jets and the NFL since 2006. Prior to that, he covered the Nets, Knicks and the NBA for nearly a decade. He joined ESPNNewYork.com after working at the New York Daily News for almost 12 years and is a graduate of Michigan State University. Follow him on Twitter »  Ohm's chat archive »The Denver Nuggets fired head coach Michael Malone and said they would not extend general manager Calvin Booth's contract Tuesday, just days before the end of the regular season.David Adelman, the Nuggets' lead assistant, will take over as head coach for the remainder of the season.The shocking decision to fire the coach and eventually part ways with the general manager who won a championship in 2023 comes at a time when the Nuggets (47-32) have lost four straight games and are in danger of falling into the play-in. It has been a frustrating stretch for the Nuggets as three-time MVP and current MVP candidate Nikola Jokic has tried to keep things together while Jamal Murray has been out for five straight games with a hamstring injury.There have been moments when players have shown emotions on the sideline, with even normally calm Jokic displaying rare frustration recently while on the bench trying to sort out the Nuggets' struggles. The Nuggets have gone 11-13 since the All-Star break.When the Nuggets entered this season, sources told ESPN that there was growing tension between Malone and Booth that grew into a \"cold war.\" Since the team won the championship, the Nuggets have gone with younger role players such as Christian Braun and Peyton Watson around the team's core of Jokic, Murray and Aaron Gordon. Veterans such as Kentavious Caldwell-Pope and Bruce Brown left in previous summers during free agency to sign bigger deals elsewhere.Malone had been with the team for 10 seasons, leading the Nuggets to their lone NBA championship. He had a 471-327 record.Josh Kroenke, vice chairman of Kroenke Sports and Entertainment, said the decision to fire Malone wasn't made as a reaction to any one thing.\"There were certain trends that were very worrisome to me at different points in time,\" Kroenke told Altitude TV. \"But they would get masked by a few wins here and there and in the world of professional sports, when winning and losing is your currency, winning can mask a lot of things.\"The Nuggets entered the All-Star break on an eight-game winning streak but have gone just 11-13 since. Kroenke called the timing of the decision \"unfortunate\" but hopes the change may spark something in the team heading into the playoffs.\"I think there's more to [the team] than has been accomplished so far,\" he said. \"How much more is in that group? I don't think that I know the answer to that, I don't think anyone knows the answer to that. But I think I have a belief that there's more in that group that can be accomplished and I look forward to seeing what they can do.\"Booth was promoted to be the Nuggets' GM for the past three seasons after Tim Connelly left for the Minnesota Timberwolves. Booth's first season was Denver's championship season in 2022-23.In separate statements Tuesday, Kroenke thanked both Malone and Booth for helping deliver the team's lone championship.Adelman, a son of former head coach Rick Adelman, has been an assistant by Malone's side for eight seasons. He interviewed for head coaching vacancies with the Los Angeles Lakers and Cleveland Cavaliers last summer.Jokic now moves forward without the only head coach he has had for his entire career.\"There is no amount of gratitude that we can properly convey to his contributions since he joined our franchise in 2015,\" Kroenke said of Malone in the statement. \"It is with our utmost respect that we would like to thank Coach Malone for the most successful decade in Nuggets history, setting the all-time wins record and helping deliver Denver our first championship.\"ESPN's Shams Charania contributed to this report.",
  "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0505%2Fr1328941_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-video=\"watch,640,360,44589614,whitelist-LR|TG|TC|KY|HN|GB|UK|ZW|GU|BR|KN|US|AS|MP|PR|VI|UM|AO|MQ|GP|CM|SZ|GY|PW|FM|BM|AW|ER|LS|RE|CU|GA|TZ|MU|VG|BJ|BW|SV|GW|CR|SN|PA|BZ|CF|KM|GN|EC|AM|MZ|ZM|MX|UY|VC|TT|ML|SS|NE|AG|LC|CI|MF|CD|ZA|BS|NI|CL|DO|GF|FJ|SL|MW|NA|JM|RW|MH|PY|BB|GD|MS|CV|ET|CO|NG|VE|HT|KE|NZ|BF|CG|BQ|GH|ST|GQ|AI|BI|MG|GT|UG|AU|GM|SR|SC|BO|PE|SX|\" data-cerebro-id=\"67f566d76dab5f2c1d19c73d\" data-title=\"Shams: Nuggets moving on from Malone, Booth is \u0026#39;stunning\u0026#39;\" data-source=\"espn\"\u003e\u003cfigcaption\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eShams: Nuggets moving on from Malone, Booth is \u0026#39;stunning\u0026#39; (1:08)\u003c/span\u003e\u003c/p\u003e\u003cp\u003eShams Charania explains why Nuggets ownership moved on from head coach Michael Malone and general manager Calvin Booth. (1:08)\u003c/p\u003e\u003c/div\u003e\u003c/figcaption\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/youngmisuk_ohm.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eOhm Youngmisuk\u003cspan\u003eApr 8, 2025, 01:34 PM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eOhm Youngmisuk has covered the Giants, Jets and the NFL since 2006. Prior to that, he covered the Nets, Knicks and the NBA for nearly a decade. He joined ESPNNewYork.com after working at the New York Daily News for almost 12 years and is a graduate of Michigan State University. \n\u003cbr/\u003e\n\u003ca href=\"http://twitter.com/NotoriousOHM\"\u003eFollow him on Twitter »\u003c/a\u003e  \u003ca href=\"http://www.espn.com/sportsnation/chat/archive/_/id/380/name/ohm-youngmisuk\"\u003eOhm\u0026#39;s chat archive »\u003c/a\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003eThe \u003ca data-clubhouse-guid=\"c4aceb39-0eb9-a30b-1120-9cb5b12b677a\" href=\"https://www.espn.com/nba/team/_/name/den/denver-nuggets\"\u003eDenver Nuggets\u003c/a\u003e fired head coach Michael Malone and said they would not extend general manager Calvin Booth\u0026#39;s contract Tuesday, just days before the end of the regular season.\u003c/p\u003e\u003cp\u003eDavid Adelman, the Nuggets\u0026#39; lead assistant, will take over as head coach for the remainder of the season.\u003c/p\u003e\u003cp\u003eThe shocking decision to fire the coach and eventually part ways with the general manager who won a championship in 2023 comes at a time when the Nuggets (47-32) have lost four straight games and are in danger of falling into the play-in. It has been a frustrating stretch for the Nuggets as three-time MVP and current MVP candidate \u003ca data-player-guid=\"22f57511-06ae-1587-f01b-33965365ce0d\" href=\"https://www.espn.com/nba/player/_/id/3112335/nikola-jokic\"\u003eNikola Jokic\u003c/a\u003e has tried to keep things together while \u003ca data-player-guid=\"153b92a9-8489-74e3-c524-6527eb991e84\" href=\"https://www.espn.com/nba/player/_/id/3936299/jamal-murray\"\u003eJamal Murray\u003c/a\u003e has been out for five straight games with a hamstring injury.\u003c/p\u003e\u003cp\u003eThere have been moments when players have shown emotions on the sideline, with even normally calm Jokic displaying rare frustration recently while on the bench trying to sort out the Nuggets\u0026#39; struggles. The Nuggets have gone 11-13 since the All-Star break.\u003c/p\u003e\u003cp\u003eWhen the Nuggets entered this season, sources told ESPN that there was growing tension between Malone and Booth that grew into a \u0026#34;cold war.\u0026#34; Since the team won the championship, the Nuggets have gone with younger role players such as \u003ca data-player-guid=\"44c766da-e62b-549a-0575-18b1efc537a1\" href=\"https://www.espn.com/nba/player/_/id/4431767/christian-braun\"\u003eChristian Braun\u003c/a\u003e and \u003ca data-player-guid=\"657d52d7-47ba-335d-b936-531e62eced90\" href=\"https://www.espn.com/nba/player/_/id/4576087/peyton-watson\"\u003ePeyton Watson\u003c/a\u003e around the team\u0026#39;s core of Jokic, Murray and \u003ca data-player-guid=\"d6c22a9f-fbe3-1566-e175-c86137d057a5\" href=\"https://www.espn.com/nba/player/_/id/3064290/aaron-gordon\"\u003eAaron Gordon\u003c/a\u003e. Veterans such as \u003ca data-player-guid=\"171eb159-a032-0148-a7ab-946354f6991a\" href=\"https://www.espn.com/nba/player/_/id/2581018/kentavious-caldwell-pope\"\u003eKentavious Caldwell-Pope\u003c/a\u003e and \u003ca data-player-guid=\"58b07122-067e-1153-355b-9bb5309d7624\" href=\"https://www.espn.com/nba/player/_/id/4065670/bruce-brown\"\u003eBruce Brown\u003c/a\u003e left in previous summers during free agency to sign bigger deals elsewhere.\u003c/p\u003e\u003cp\u003eMalone had been with the team for 10 seasons, leading the Nuggets to their lone NBA championship. He had a 471-327 record.\u003c/p\u003e\u003cp\u003eJosh Kroenke, vice chairman of Kroenke Sports and Entertainment, said the decision to fire Malone wasn\u0026#39;t made as a reaction to any one thing.\u003c/p\u003e\u003cp\u003e\u0026#34;There were certain trends that were very worrisome to me at different points in time,\u0026#34; Kroenke told Altitude TV. \u0026#34;But they would get masked by a few wins here and there and in the world of professional sports, when winning and losing is your currency, winning can mask a lot of things.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Nuggets entered the All-Star break on an eight-game winning streak but have gone just 11-13 since. Kroenke called the timing of the decision \u0026#34;unfortunate\u0026#34; but hopes the change may spark something in the team heading into the playoffs.\u003c/p\u003e\u003cp\u003e\u0026#34;I think there\u0026#39;s more to [the team] than has been accomplished so far,\u0026#34; he said. \u0026#34;How much more is in that group? I don\u0026#39;t think that I know the answer to that, I don\u0026#39;t think anyone knows the answer to that. But I think I have a belief that there\u0026#39;s more in that group that can be accomplished and I look forward to seeing what they can do.\u0026#34;\u003c/p\u003e\u003cp\u003eBooth was promoted to be the Nuggets\u0026#39; GM for the past three seasons after Tim Connelly left for the \u003ca data-clubhouse-guid=\"13f727cb-254d-b484-a337-93fcc0047add\" href=\"https://www.espn.com/nba/team/_/name/min/minnesota-timberwolves\"\u003eMinnesota Timberwolves\u003c/a\u003e. Booth\u0026#39;s first season was Denver\u0026#39;s championship season in 2022-23.\u003c/p\u003e\u003cp\u003eIn separate statements Tuesday, Kroenke thanked both Malone and Booth for helping deliver the team\u0026#39;s lone championship.\u003c/p\u003e\u003cp\u003eAdelman, a son of former head coach Rick Adelman, has been an assistant by Malone\u0026#39;s side for eight seasons. He interviewed for head coaching vacancies with the \u003ca data-clubhouse-guid=\"2876e98b-b9bc-2920-4319-46e6943f8be4\" href=\"https://www.espn.com/nba/team/_/name/lal/los-angeles-lakers\"\u003eLos Angeles Lakers\u003c/a\u003e and \u003ca data-clubhouse-guid=\"ec79ad1f-e6d2-7762-a2db-7fe97d35126b\" href=\"https://www.espn.com/nba/team/_/name/cle/cleveland-cavaliers\"\u003eCleveland Cavaliers\u003c/a\u003e last summer.\u003c/p\u003e\u003cp\u003eJokic now moves forward without the only head coach he has had for his entire career.\u003c/p\u003e\u003cp\u003e\u0026#34;There is no amount of gratitude that we can properly convey to his contributions since he joined our franchise in 2015,\u0026#34; Kroenke said of Malone in the statement. \u0026#34;It is with our utmost respect that we would like to thank Coach Malone for the most successful decade in Nuggets history, setting the all-time wins record and helping deliver Denver our first championship.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cem\u003eESPN\u0026#39;s Shams Charania contributed to this report.\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-04-08T17:34:00Z",
  "modifiedTime": null
}
