{
  "id": "97c46f1b-a5b8-4f86-92cf-ff29ec6d6f5a",
  "title": "Champions League set for dramatic finale - how it stands",
  "link": "https://www.bbc.com/sport/football/articles/c4gz2n3pvn8o",
  "description": "The inaugural Champions League league phase is set for an exciting final day with 25 of the 36 teams still awaiting their fate.",
  "author": "",
  "published": "Tue, 28 Jan 2025 16:26:02 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 9001,
  "excerpt": "The inaugural Champions League league phase is set for an exciting final day with 25 of the 36 teams still awaiting their fate.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Champions League set for dramatic finale - how it standsMedia caption, A 'new era' of the Champions League - all you need to knowThe Champions League's inaugural league phase is set for an exciting final day with 25 of the 36 teams still awaiting their fate.All 18 games will be played at the same time - at 20:00 GMT on Wednesday, with 16 matches having something on the line.Manchester City are in major danger of elimination after last week's 4-2 defeat at Paris St-Germain, while Liverpool are through, Arsenal are almost there and Aston Villa and Celtic - who meet - are somewhere in between.The 'as it stands' table will be constantly updating with teams' hopes potentially relying on other results.It marks the first season of the new format, a change from the old four-team groups with two going through from each - where sometimes there was nothing to play for by the end. \"It's been brilliant, instead of the borefest we've had for years on the last matchday,\" wrote ex-Liverpool defender Jamie Carragher on social media.How to follow on the BBCHighlights of all the games will be on the BBC Sport website for UK users from 22:00 GMT, with a Match of the Day: Champions League highlights show on BBC One and iPlayer from 22:40 GMT.From 19:00 GMT, there will also be build-up and live BBC Radio 5 live commentary on Manchester City v Club Brugge, with full Aston Villa v Celtic commentary on Radio 5 Sports Extra.You can also follow all the build-up, team news and match action via live text commentary on the BBC Sport website from 18:00. How many teams qualify for the knockout phase?First, here's a reminder of what the 36 league-phase teams are aiming for.Those finishing in the top eight automatically progress to the last 16, where they will be seeded.They will await the winners of eight two-legged knockout play-off ties featuring the clubs ranked from ninth to 24th.Those finishing between ninth and 16th will be seeded and face a team placed 17th to 24th, with the advantage of playing the second leg at home.The clubs 25th or lower are eliminated and do not gain entry to the Europa League.The play-off ties take place in mid-February, with the last-16 matches in the first two weeks of March.Which teams have qualified - and who is out?Top-eight guaranteed: Liverpool, BarcelonaTop-24 guaranteed (at least): Arsenal, Inter Milan, Atletico Madrid, AC Milan, Atalanta, Bayer Leverkusen, Aston Villa, Monaco, Feyenoord, Lille, Brest, Borussia Dortmund, Bayern Munich, Real Madrid, Juventus, CelticUncertain of progression: PSV, Club Brugge, Benfica, PSG, Sporting, Stuttgart, Manchester City, Dinamo Zagreb, Shakhtar DonetskEliminated: Bologna, Sparta Prague, Leipzig, Girona, Red Star Belgrade, Sturm Graz, Salzburg, Slovan Bratislava, Young BoysWhat do the British teams need to go through?Manchester City have a very simple permutation. If they beat Club Brugge at home they will go into the play-off round. If they fail to win, they will be eliminated.They cannot reach the last 16 automatically.Aston Villa are guaranteed at least a play-off place. A win at home to Celtic would give them a good chance of finishing in the top eight, though they would need one of five teams above them to slip up. But even if they win, Villa could be overtaken by a big victory for any of the four sides currently below them on goal difference.Celtic are only one point behind Villa so could conceivably finish in the top eight, but they would need to win and for a lot of things to happen above them.Arsenal - away at Girona - are all but in the last 16 as they sit three points clear of the play-offs with a much better goal difference than any team on 13 points.Liverpool are one of two teams, along with Barcelona, who know they are in the last 16 already, and will be guaranteed a top-two place.Bayern Munich and Real Madrid are among the giants in the positions between ninth and 24th hoping for things to go their way to end up in the top eight.Media caption, Are Man City short on Champions League game-changers?Does it matter where you finish in top eight?Definitely.Where a team finishes in the league table determines which opponents they face and when they can face them in the knockout stage. Take Liverpool, for example. The Reds are now guaranteed a top-two finish, which gives them a seeded route through to the last 16.That means the Reds will face a team who finished 15th, 16th, 17th or 18th in the last 16. The identity of the team will not be known until after the play-offs, but the pre-determined draw means it will be the winner of the ties involving teams that finish in those four places.Liverpool cannot face the team who finishes second in the league phase - or whoever finishes top if they are overtaken on the final matchday - until the final. By contrast, a team who finish seventh or eighth could face a side that had finished just below them in the league phase - in ninth or 10th. For more on who faces who in the play-offs, keep reading... What is the difference between finishing ninth and 24th?Teams that finish between ninth and 16th will be seeded in the knockout phase play-off draw.It means they will face a team that finishes between 17th to 24th.Who the seeded teams will face will be determined by a draw but clubs will only have two possible opponents.For example, the teams who finish 11th and 12th are paired together and will play a team that finishes 21st or 22nd. Another bracket will pair the teams who finish ninth and 10th in the table, playing either the team that was 23rd or 24th. The two pairs of fixtures will be drawn into opposite halves of the overall draw and the seeded teams will play the second leg of the play-off at home as a reward for finishing higher than their opponent in the league phase. Unlike in previous years, teams eliminated from the Champions League - either in the group phase or via losing a play-off - will not drop into the Europa League. The draw for the play-off round is on Friday at 11:00 GMT. Who has the best chance of qualifying?Opta has given its predictions for who will reach the play-offs and the last 16. It uses computer modelling software to look at form, opponents and potential seedings to come up with percentage chances. The table makes interesting reading. Celtic, for example, are regarded as 100% likely to finish in the play-offs - the Opta computer ruling they will not beat Aston Villa by the required goal difference to finish higher. Real Madrid are given a lower likelihood of finishing in the play-offs than Celtic - as Opta believes they could still force their way into the top eight.Has this format worked?Media caption, BBC pundits' verdict on new Champions League formatOne of Uefa's reasons for changing to this format was so \"every game counts\". It said the format \"will ensure that any result has the potential to dramatically change a team's position, right up to and including the very last matchday\".And so it has panned out with only two dead rubbers (Sturm Graz v Leipzig and Young Boys v Red Star Belgrade) and 16 games with something on the line.There are several games where both clubs are battling for the same goal, like Manchester City v Club Brugge, Stuttgart v PSG, Brest v Real Madrid and Inter Milan v Monaco.It could lead to enjoyable mayhem for fans with some teams potentially being affected by more than 10 other games. Aston Villa, for example, could overtake six teams or be overtaken by 15 teams (albeit not all 15) - including opponents Celtic.Uefa also wanted more matches between the top teams in the initial stages of the tournament.This year, Real Madrid have played Borussia Dortmund and Liverpool in repeats of three recent finals, Barcelona have taken on Bayern Munich, while Paris St-Germain have faced Arsenal, Atletico Madrid, Bayern Munich and Manchester City.What is financial impact of finishing where?Failing to qualify for the next round means taking a financial hit.Every club in the league phase gets 18.62m euros (£15.6m) for participating, with performance bonuses of 2.1m euros (£1.8m) per win and 700,000 euros (£587,000) per draw.Each position in the table is worth 275,000 euros (£231,000) too. So the team that finishes 36th earns that much, 35th claims 550,000 euros (£461,000), and so on through to 9.9m euros (£8.3m) for the table-toppers.Teams finishing first to eighth also earn a 2m euro (£1.7m) bonus, with teams finishing ninth to 16th getting 1m euros (£840,000).The prize money for reaching each knockout round is shown below.Uefa has also introduced a \"value pillar\" that splits the broadcast revenue. This again increases depending on your finishing position in the league phase.That is before matchday revenue and other factors are taken into account.In other words, it is fairly costly to be eliminated early.Champions League knockouts prize moneyStagePrize money (per club)Knockout round play-offs£840,000Last-16£9.3mQuarter-finals£10.6mSemi-finals£12.7mRunner-up£15.6mWinner£21.1mSource: UefaMore on this story",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc69/live/1967c3e0-dd8e-11ef-bc01-8f2c83dad217.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eChampions League set for dramatic finale - how it stands\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eA \u0026#39;new era\u0026#39; of the Champions League - all you need to know\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eThe Champions League\u0026#39;s inaugural league phase is set for an exciting final day with 25 of the 36 teams still awaiting their fate.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eAll 18 games will be played at the same time - at 20:00 GMT on Wednesday, with 16 matches having something on the line.\u003c/p\u003e\u003cp\u003eManchester City are in major danger of elimination after \u003ca href=\"https://www.bbc.com/sport/football/live/ckgrrpm0vp8t\"\u003elast week\u0026#39;s 4-2 defeat at Paris St-Germain\u003c/a\u003e, while Liverpool are through, Arsenal are almost there and Aston Villa and Celtic - who meet - are somewhere in between.\u003c/p\u003e\u003cp\u003eThe \u0026#39;as it stands\u0026#39; table will be constantly updating with teams\u0026#39; hopes potentially relying on other results.\u003c/p\u003e\u003cp\u003eIt marks the first season of the new format, a change from the old four-team groups with two going through from each - where sometimes there was nothing to play for by the end. \u003c/p\u003e\u003cp\u003e\u0026#34;It\u0026#39;s been brilliant, instead of the borefest we\u0026#39;ve had for years on the last matchday,\u0026#34; wrote ex-Liverpool defender Jamie Carragher on social media.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"How-to-follow-on-the-BBC\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHow to follow on the BBC\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eHighlights of all the games will be on the BBC Sport website for UK users from 22:00 GMT, with a Match of the Day: Champions League highlights show on BBC One and iPlayer from 22:40 GMT.\u003c/p\u003e\u003cp\u003eFrom 19:00 GMT, there will also be build-up and live BBC Radio 5 live commentary on Manchester City v Club Brugge, with full Aston Villa v Celtic commentary on Radio 5 Sports Extra.\u003c/p\u003e\u003cp\u003eYou can also follow all the build-up, team news and match action via live text commentary on the BBC Sport website from 18:00. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"How-many-teams-qualify-for-the-knockout-phase\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHow many teams qualify for the knockout phase?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFirst, here\u0026#39;s a reminder of what the 36 league-phase teams are aiming for.\u003c/p\u003e\u003cp\u003eThose finishing in the top eight automatically progress to the last 16, where they will be seeded.\u003c/p\u003e\u003cp\u003eThey will await the winners of eight two-legged knockout play-off ties featuring the clubs ranked from ninth to 24th.\u003c/p\u003e\u003cp\u003eThose finishing between ninth and 16th will be seeded and face a team placed 17th to 24th, with the advantage of playing the second leg at home.\u003c/p\u003e\u003cp\u003eThe clubs 25th or lower are eliminated and do not gain entry to the Europa League.\u003c/p\u003e\u003cp\u003eThe play-off ties take place in mid-February, with the last-16 matches in the first two weeks of March.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Which-teams-have-qualified-and-who-is-out\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhich teams have qualified - and who is out?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eTop-eight guaranteed: \u003c/b\u003eLiverpool, Barcelona\u003c/p\u003e\u003cp\u003e\u003cb\u003eTop-24 guaranteed (at least):\u003c/b\u003e Arsenal, Inter Milan, Atletico Madrid, AC Milan, Atalanta, Bayer Leverkusen, Aston Villa, Monaco, Feyenoord, Lille, Brest, Borussia Dortmund, Bayern Munich, Real Madrid, Juventus, Celtic\u003c/p\u003e\u003cp\u003e\u003cb\u003eUncertain of progression: \u003c/b\u003ePSV, Club Brugge, Benfica, PSG, Sporting, Stuttgart, Manchester City, Dinamo Zagreb, Shakhtar Donetsk\u003c/p\u003e\u003cp\u003e\u003cb\u003eEliminated: \u003c/b\u003eBologna, Sparta Prague, Leipzig, Girona, Red Star Belgrade, Sturm Graz, Salzburg, Slovan Bratislava, Young Boys\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-do-the-British-teams-need-to-go-through\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat do the British teams need to go through?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eManchester City\u003c/b\u003e have a very simple permutation. If they beat Club Brugge at home they will go into the play-off round. If they fail to win, they will be eliminated.\u003c/p\u003e\u003cp\u003eThey cannot reach the last 16 automatically.\u003c/p\u003e\u003cp\u003e\u003cb\u003eAston Villa\u003c/b\u003e are guaranteed at least a play-off place. \u003c/p\u003e\u003cp\u003eA win at home to Celtic would give them a good chance of finishing in the top eight, though they would need one of five teams above them to slip up. \u003c/p\u003e\u003cp\u003eBut even if they win, Villa could be overtaken by a big victory for any of the four sides currently below them on goal difference.\u003c/p\u003e\u003cp\u003e\u003cb\u003eCeltic\u003c/b\u003e are only one point behind Villa so could conceivably finish in the top eight, but they would need to win and for a lot of things to happen above them.\u003c/p\u003e\u003cp\u003e\u003cb\u003eArsenal\u003c/b\u003e - away at Girona - are all but in the last 16 as they sit three points clear of the play-offs with a much better goal difference than any team on 13 points.\u003c/p\u003e\u003cp\u003e\u003cb\u003eLiverpool\u003c/b\u003e are one of two teams, along with Barcelona, who know they are in the last 16 already, and will be guaranteed a top-two place.\u003c/p\u003e\u003cp\u003eBayern Munich and Real Madrid are among the giants in the positions between ninth and 24th hoping for things to go their way to end up in the top eight.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eAre Man City short on Champions League game-changers?\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Does-it-matter-where-you-finish-in-top-eight\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eDoes it matter where you finish in top eight?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eDefinitely.\u003c/p\u003e\u003cp\u003eWhere a team finishes in the league table determines which opponents they face and when they can face them in the knockout stage. \u003c/p\u003e\u003cp\u003eTake Liverpool, for example. The Reds are now guaranteed a top-two finish, which gives them a seeded route through to the last 16.\u003c/p\u003e\u003cp\u003eThat means the Reds will face a team who finished 15th, 16th, 17th or 18th in the last 16. \u003c/p\u003e\u003cp\u003eThe identity of the team will not be known until after the play-offs, but the pre-determined draw means it will be the winner of the ties involving teams that finish in those four places.\u003c/p\u003e\u003cp\u003eLiverpool cannot face the team who finishes second in the league phase - or whoever finishes top if they are overtaken on the final matchday - until the final. \u003c/p\u003e\u003cp\u003eBy contrast, a team who finish seventh or eighth could face a side that had finished just below them in the league phase - in ninth or 10th. \u003c/p\u003e\u003cp\u003eFor more on who faces who in the play-offs, keep reading... \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-is-the-difference-between-finishing-ninth-and-24th\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat is the difference between finishing ninth and 24th?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eTeams that finish between ninth and 16th will be seeded in the knockout phase play-off draw.\u003c/p\u003e\u003cp\u003eIt means they will face a team that finishes between 17th to 24th.\u003c/p\u003e\u003cp\u003eWho the seeded teams will face will be determined by a draw but clubs will only have two possible opponents.\u003c/p\u003e\u003cp\u003eFor example, the teams who finish 11th and 12th are paired together and will play a team that finishes 21st or 22nd. \u003c/p\u003e\u003cp\u003eAnother bracket will pair the teams who finish ninth and 10th in the table, playing either the team that was 23rd or 24th. \u003c/p\u003e\u003cp\u003eThe two pairs of fixtures will be drawn into opposite halves of the overall draw and the seeded teams will play the second leg of the play-off at home as a reward for finishing higher than their opponent in the league phase. \u003c/p\u003e\u003cp\u003eUnlike in previous years, teams eliminated from the Champions League - either in the group phase or via losing a play-off - will not drop into the Europa League. \u003c/p\u003e\u003cp\u003eThe draw for the play-off round is on Friday at 11:00 GMT. \u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Who-has-the-best-chance-of-qualifying\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWho has the best chance of qualifying?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOpta has given its predictions for who will reach the play-offs and the last 16. \u003c/p\u003e\u003cp\u003eIt uses computer modelling software to look at form, opponents and potential seedings to come up with percentage chances. \u003c/p\u003e\u003cp\u003eThe table makes interesting reading. Celtic, for example, are regarded as 100% likely to finish in the play-offs - the Opta computer ruling they will not beat Aston Villa by the required goal difference to finish higher. \u003c/p\u003e\u003cp\u003eReal Madrid are given a lower likelihood of finishing in the play-offs than Celtic - as Opta believes they could still force their way into the top eight.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Has-this-format-worked\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHas this format worked?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eBBC pundits\u0026#39; verdict on new Champions League format\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOne of Uefa\u0026#39;s reasons for changing to this format was so \u0026#34;every game counts\u0026#34;. \u003c/p\u003e\u003cp\u003eIt said the format \u0026#34;will ensure that any result has the potential to dramatically change a team\u0026#39;s position, right up to and including the very last matchday\u0026#34;.\u003c/p\u003e\u003cp\u003eAnd so it has panned out with only two dead rubbers (Sturm Graz v Leipzig and Young Boys v Red Star Belgrade) and 16 games with something on the line.\u003c/p\u003e\u003cp\u003eThere are several games where both clubs are battling for the same goal, like Manchester City v Club Brugge, Stuttgart v PSG, Brest v Real Madrid and Inter Milan v Monaco.\u003c/p\u003e\u003cp\u003eIt could lead to enjoyable mayhem for fans with some teams potentially being affected by more than 10 other games. Aston Villa, for example, could overtake six teams or be overtaken by 15 teams (albeit not all 15) - including opponents Celtic.\u003c/p\u003e\u003cp\u003eUefa also wanted more matches between the top teams in the initial stages of the tournament.\u003c/p\u003e\u003cp\u003eThis year, Real Madrid have played Borussia Dortmund and Liverpool in repeats of three recent finals, Barcelona have taken on Bayern Munich, while Paris St-Germain have faced Arsenal, Atletico Madrid, Bayern Munich and Manchester City.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"What-is-financial-impact-of-finishing-where\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eWhat is financial impact of finishing where?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eFailing to qualify for the next round means taking a financial hit.\u003c/p\u003e\u003cp\u003eEvery club in the league phase gets 18.62m euros (£15.6m) for participating, with performance bonuses of 2.1m euros (£1.8m) per win and 700,000 euros (£587,000) per draw.\u003c/p\u003e\u003cp\u003eEach position in the table is worth 275,000 euros (£231,000) too. So the team that finishes 36th earns that much, 35th claims 550,000 euros (£461,000), and so on through to 9.9m euros (£8.3m) for the table-toppers.\u003c/p\u003e\u003cp\u003eTeams finishing first to eighth also earn a 2m euro (£1.7m) bonus, with teams finishing ninth to 16th getting 1m euros (£840,000).\u003c/p\u003e\u003cp\u003eThe prize money for reaching each knockout round is shown below.\u003c/p\u003e\u003cp\u003eUefa has also introduced a \u0026#34;value pillar\u0026#34; that splits the broadcast revenue. This again increases depending on your finishing position in the league phase.\u003c/p\u003e\u003cp\u003eThat is before matchday revenue and other factors are taken into account.\u003c/p\u003e\u003cp\u003eIn other words, it is fairly costly to be eliminated early.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"idt-block\"\u003e\u003cdiv data-graphicuuid=\"442c0a52-67db-49bc-bb92-c0391743da2b\" dir=\"ltr\" data-component=\"include-html\" data-idt-type=\"idt-table\"\u003e\u003ch2\u003eChampions League knockouts prize money\u003c/h2\u003e\u003cdiv\u003e\u003ctable\u003e\u003cthead\u003e\u003ctr\u003e\u003cth scope=\"col\"\u003eStage\u003c/th\u003e\u003cth scope=\"col\"\u003ePrize money (per club)\u003c/th\u003e\u003c/tr\u003e\u003c/thead\u003e\u003ctbody\u003e\u003ctr\u003e\u003ctd\u003eKnockout round play-offs\u003c/td\u003e\u003ctd\u003e£840,000\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eLast-16\u003c/td\u003e\u003ctd\u003e£9.3m\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eQuarter-finals\u003c/td\u003e\u003ctd\u003e£10.6m\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eSemi-finals\u003c/td\u003e\u003ctd\u003e£12.7m\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eRunner-up\u003c/td\u003e\u003ctd\u003e£15.6m\u003c/td\u003e\u003c/tr\u003e\u003ctr\u003e\u003ctd\u003eWinner\u003c/td\u003e\u003ctd\u003e£21.1m\u003c/td\u003e\u003c/tr\u003e\u003c/tbody\u003e\u003c/table\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003cp\u003eSource: Uefa\u003c/p\u003e\u003csvg height=\"15\" width=\"45\" xmlns=\"http://www.w3.org/2000/svg\" aria-label=\"BBCLogo\" viewBox=\"0 0 45 15\" rtl=\"ltr\"\u003e\u003cg fill-rule=\"evenodd\"\u003e\u003cdefs\u003e\u003cpath id=\"SVGID_1_\" d=\"M0 0h45v15H0z\"\u003e\u003c/path\u003e\u003c/defs\u003e\u003cclipPath id=\"SVGID_2_\"\u003e\u003cuse xlink:href=\"#SVGID_1_\" overflow=\"visible\"\u003e\u003c/use\u003e\u003c/clipPath\u003e\u003cpath d=\"M0,0 L0,12.8571429 L12.8571429,12.8571429 L12.8571429,0 L0,0 Z M8.96484375,9.07533482 C8.74386161,9.38671875 8.43247768,9.62276786 8.02566964,9.79352679 C7.61886161,9.96428571 7.13169643,10.0446429 6.55915179,10.0446429 L3.67633929,10.0446429 L3.67633929,2.8125 L6.38839286,2.8125 C7.18694196,2.8125 7.80970982,2.97321429 8.24665179,3.29464286 C8.68359375,3.61607143 8.90457589,4.07310268 8.90457589,4.67578125 C8.90457589,5.01729911 8.82421875,5.31863839 8.66852679,5.56975446 C8.51283482,5.82087054 8.27678571,6.02176339 7.97042411,6.17243304 C8.39732143,6.31305804 8.72377232,6.5390625 8.94977679,6.84542411 C9.17578125,7.15178571 9.29129464,7.5234375 9.29129464,7.96540179 C9.29631696,8.39229911 9.18582589,8.76395089 8.96484375,9.07533482 Z M7.12667411,5.53962054 C7.32756696,5.37388393 7.42801339,5.14285714 7.42801339,4.84654018 C7.42801339,4.27399554 7.03627232,3.98772321 6.2578125,3.98772321 L5.14787946,3.98772321 L5.14787946,5.78571429 L6.2578125,5.78571429 C6.63950893,5.78571429 6.92578125,5.70535714 7.12667411,5.53962054 Z M6.44363839,6.92075893 L5.14787946,6.92075893 L5.14787946,8.87444196 L6.42857143,8.87444196 C6.86551339,8.87444196 7.20703125,8.79408482 7.44308036,8.62834821 C7.67912946,8.46261161 7.79464286,8.2265625 7.79464286,7.91517857 C7.78962054,7.24720982 7.34263393,6.92075893 6.44363839,6.92075893 Z\"\u003e\u003c/path\u003e\u003cpath d=\"M16.0714286,0 L16.0714286,12.8571429 L28.9285714,12.8571429 L28.9285714,0 L16.0714286,0 Z M25.0362723,9.07533482 C24.8152902,9.38671875 24.5039062,9.62276786 24.0970982,9.79352679 C23.6902902,9.96428571 23.203125,10.0446429 22.6305804,10.0446429 L19.7477679,10.0446429 L19.7477679,2.8125 L22.4598214,2.8125 C23.2583705,2.8125 23.8811384,2.97321429 24.3180804,3.29464286 C24.7550223,3.61607143 24.9760045,4.07310268 24.9760045,4.67578125 C24.9760045,5.01729911 24.8956473,5.31863839 24.7399554,5.56975446 C24.5842634,5.82087054 24.3482143,6.02176339 24.0418527,6.17243304 C24.46875,6.31305804 24.7952009,6.5390625 25.0212054,6.84542411 C25.2472098,7.15178571 25.3627232,7.5234375 25.3627232,7.96540179 C25.3677455,8.39229911 25.2572545,8.76395089 25.0362723,9.07533482 Z M23.1981027,5.53962054 C23.3989955,5.37388393 23.499442,5.14285714 23.499442,4.84654018 C23.499442,4.27399554 23.1077009,3.98772321 22.3292411,3.98772321 L21.219308,3.98772321 L21.219308,5.78571429 L22.3292411,5.78571429 C22.7109375,5.78571429 22.9972098,5.70535714 23.1981027,5.53962054 Z M22.515067,6.92075893 L21.219308,6.92075893 L21.219308,8.87444196 L22.5,8.87444196 C22.936942,8.87444196 23.2784598,8.79408482 23.5145089,8.62834821 C23.750558,8.46261161 23.8660714,8.2265625 23.8660714,7.91517857 C23.8610491,7.24720982 23.4140625,6.92075893 22.515067,6.92075893 Z\"\u003e\u003c/path\u003e\u003cpath d=\"M32.1428571,12.8571429 L45,12.8571429 L45,0 L32.1428571,0 L32.1428571,12.8571429 Z M41.3789062,9.58761161 C41.077567,9.75334821 40.7310268,9.88392857 40.3392857,9.97935268 C39.9425223,10.0747768 39.530692,10.125 39.09375,10.125 C38.516183,10.125 37.9938616,10.0396205 37.531808,9.87388393 C37.0697545,9.703125 36.6780134,9.46205357 36.3565848,9.14564732 C36.0351562,8.82924107 35.7940848,8.44252232 35.6233259,7.98046875 C35.452567,7.5234375 35.3671875,7.00613839 35.3671875,6.42857143 C35.3671875,5.86607143 35.4575893,5.35881696 35.6333705,4.90680804 C35.8091518,4.45479911 36.0652902,4.06808036 36.3967634,3.74162946 C36.7282366,3.42020089 37.1300223,3.16908482 37.5970982,2.99832589 C38.0641741,2.82756696 38.5864955,2.7421875 39.1640625,2.7421875 C39.5658482,2.7421875 39.9425223,2.78236607 40.3041295,2.86774554 C40.6607143,2.94810268 40.9921875,3.06863839 41.2985491,3.22935268 L41.2985491,4.63560268 C41.0172991,4.44977679 40.7159598,4.30915179 40.3895089,4.21372768 C40.063058,4.11830357 39.7215402,4.06808036 39.359933,4.06808036 C38.8627232,4.06808036 38.4408482,4.15848214 38.0892857,4.34430804 C37.7377232,4.53013393 37.4715402,4.79631696 37.280692,5.14787946 C37.0948661,5.49944196 36.999442,5.92633929 36.999442,6.42857143 C36.999442,6.93080357 37.0898437,7.35770089 37.2706473,7.71428571 C37.4514509,8.06584821 37.7126116,8.33705357 38.0541295,8.52287946 C38.3956473,8.70870536 38.8125,8.79910714 39.3046875,8.79910714 C40.0530134,8.79910714 40.7460937,8.60323661 41.3789062,8.21651786 L41.3789062,9.58761161 L41.3789062,9.58761161 Z\"\u003e\u003c/path\u003e\u003c/g\u003e\u003c/svg\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cimg alt=\"Champions League knockouts prize money. .  .\" src=\"https://ichef.bbci.co.uk/news/920/idt2/idt2/442c0a52-67db-49bc-bb92-c0391743da2b/image/460\" srcset=\"https://ichef.bbci.co.uk/news/920/idt2/idt2/442c0a52-67db-49bc-bb92-c0391743da2b/image/460 920w,https://ichef.bbci.co.uk/news/1280/idt2/idt2/442c0a52-67db-49bc-bb92-c0391743da2b/image/640 1280w,https://ichef.bbci.co.uk/news/1632/idt2/idt2/442c0a52-67db-49bc-bb92-c0391743da2b/image/816 1632w\"/\u003e\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-01-28T16:26:02.967Z",
  "modifiedTime": null
}
