{
  "id": "99fff389-2737-49d4-b5fd-00aa6c7dcb30",
  "title": "'The impact of defeat is massive' - what to look out for in Liverpool v Man City",
  "link": "https://www.bbc.com/sport/football/articles/c629p8v41l0o",
  "description": "BBC Sport previews Sunday's massive Premier League title game between Liverpool and Manchester City at Anfield.",
  "author": "",
  "published": "Sun, 01 Dec 2024 00:01:09 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Emlyn Begley",
  "length": 11868,
  "excerpt": "BBC Sport previews Sunday's massive Premier League title game between Liverpool and Manchester City at Anfield.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "'The impact of defeat is massive' - what to look out for in Liverpool v Man CityMedia caption, The Football News Show: Why a settled defence won't cure Manchester City's poor formLiverpool and Manchester City meet on Sunday in a game which could have a huge impact on the Premier League title.The gap between the rivals could be 11 points if the game at Anfield goes to the form book.Leaders Liverpool have won 17 of their 19 games under Arne Slot, while struggling City - now down to fourth in the table - had lost five in a row before blowing a 3-0 lead to draw with Feyenoord in their midweek Champions League encounter.\"Considering they were first and second going into the weekend, the unique thing about Sunday's game, really, is that all the pressure is on City,\" said BBC pundit Danny Murphy.\"For City, the impact of a defeat is massive, but so would be the impact of a win. All of a sudden the champions would be back, and there would be a huge shift in confidence and belief for them, because it keeps their season alive. It is massive for them.\"For Liverpool, if you break it down, while it will be another great result if they win, and disappointing if they lose, this is actually one of those weird occasions where it is almost like a free hit, and they can almost enjoy it.\"BBC Sport has a look at some of the talking points going into the game.How big could game be in title race?Liverpool are currently eight points clear of Manchester City and could end the weekend 11 in front of the defending champions if they win.Only three teams have ever lifted the Premier League after trailing the leaders by that many points or more - Manchester United in 1992-93 and 1995-96, and Arsenal in 1997-98.But if City can claim a crucial success, that gap would be down to five points and suddenly only be a bad week from Liverpool off the number one spot they have occupied for so much of the past six seasons.Even if they lose, you can never entirely write off a side that has only lost four Premier League games after Christmas across the past three seasons combined.However, there are few signs from Pep Guardiola's current charges that they are capable of going on one of those juggernaut runs where they destroy everyone in their path.\"If Manchester City lose at Anfield on Sunday, they would leave themselves the biggest mountain they've ever had to climb to win the title,\" said ex-Liverpool midfielder Murphy.\"Pep Guardiola's side have been the one team in recent years who have been capable of clawing back big deficits to become champions but, this time, from what we have seen from them recently, I think 11 points would be too much for them to make up.\"A Liverpool victory will also take them nine clear of Arsenal, who moved up to second place with an impressive 5-2 win at West Ham on Saturday. Chelsea will join the Gunners on 25 points should they beat Aston Villa in Sunday's earlier game.\"If Liverpool win, although it makes them favourites for the title, it is no way decisive at this stage,\" continued Murphy. \"They are under a new manager and, at the moment, things are going well and they have had no serious injuries to contend with. But there might be a spell later in the season where they do have a little wobble.\"While City are bidding for a fifth title in a row, Liverpool are aiming for only their second in the Premier League era.The Reds have won just one of their past nine Premier League games against City, but Guardiola has only ever tasted victory at Anfield once, back in February 2021 when no fans were present due to Covid-19 restrictions.Salah flying, Haaland not so muchImage source, Getty ImagesImage caption, Liverpool fans want Mohamed Salah to be given a new contractEffectively all of Liverpool's players are in form - and all of City's players are out of it.City striker Erling Haaland is the Premier League's top scorer with 12 goals, but only two of those have come in his past seven league games. He did, though, manage two in the 3-3 draw against Feyenoord on Tuesday.Not many of his team-mates are pulling up trees either as their struggles without talismanic midfielder Rodri continue.His deputy Mateo Kovacic is injured too.Unlike Haaland, Mohamed Salah is bang in form - despite all the uncertainty over his future with his contract expiring next summer.The club legend - like Virgil van Dijk and Trent Alexander-Arnold - is able to discuss a pre-contract with other teams in just over four weeks.But Salah, who created headlines when he said he has not been offered a new deal yet, has scored seven goals in his last seven Premier League games. \"I don't see any panic at all,\" said ex-Manchester City defender Nedum Onuoha on the BBC's Planet Premier League podcast.\"Maybe he's trying to play an elaborate game, but he's putting the work in and he's enjoying the moments for Liverpool. \"Salah, Van Dijk and Alexander-Arnold don't look like players that have insecurity and, as a consequence, they are playing the best football in the country right now.\"'They'll have to try something different' - how could Man City line up?Media caption, Pep Guardiola 'I have to prove myself now'One of the things City have not got right this season is how to replace Rodri in the number six role.Kovacic, Rico Lewis, Matheus Nunes, Bernardo Silva and Ilkay Gundogan have all had a go.\"My gut feeling is, because of where their form is at, and with Liverpool flying at the moment, for once City might have to give them a bit of respect and try something a bit different on Sunday,\" said Murphy.\"If Ruben Dias is fit to start, alongside maybe Nathan Ake, then I would be tempted to play [defender] Manuel Akanji in that midfield holding role, as John Stones has done before.\"I am not sure if Pep will do that, but maybe this time, his priority might not be about how City are going to make chances and score goals against this great Liverpool defence, because he trusts his players to do that.\"We should remember they are serial winners and we are talking about a team with some of the best players in the world, but one of the key factors to them having any success at Anfield is for them to be much better defensively than they have been recently.\"It could be damaging for City to go to Anfield with their usual system, where Rico Lewis is at right-back and drifts into midfield, which would leave their back three against Liverpool's front three.\"Murphy thinks the visitors will start Kevin de Bruyne, who has recently returned from injury, and one of Gundogan or Silva - plus a more defensive-minded player like Akanji or Lewis in midfield.\"I would be really surprised if he decides to play, say, Gundogan and Silva in there on their own, with Phil Foden behind Erling Haaland again,\" said the former England midfielder.\"Although it is great to have belief in yourself, when you are conceding goals like City are, you have to play the moment.\"Murphy said he is \"certainly not trying to suggest that City should park the bus and not believe in themselves\" - but did suggest two options for Guardiola.\"Liverpool play a front three, and they are very good - so City should play a four [at the back]. City are conceding a lot of goals, so maybe their back four should concentrate on stopping Liverpool's front three,\" he added.\"And then Liverpool's midfield is very good at the moment, so maybe City should play three midfielders in there who are suited to that battle, rather than two midfielders and one forward.\"'More of the same' for Liverpool?Image source, Getty ImagesImage caption, Ryan Gravenberch is playing well under his fellow Dutchman Arne SlotLiverpool have excelled this season since Arne Slot replaced club icon Jurgen Klopp and has brought a more measured approach to their game.And it has worked to record-breaking levels with 17 wins and a draw in their first 19 games under the Dutchman, who had never worked in English football before.Goalkeeper Alisson is likely to remain out with a hamstring injury, but Republic of Ireland international Caoimhin Kelleher has been a more than capable deputy - saving three penalties in the past three weeks for club and country.Right-back Conor Bradley and centre-back Ibrahima Konate both picked up injuries in the impressive 2-0 Champions League win over Real Madrid in midweek, but the fit-again Trent Alexander-Arnold could return at full-back.Liverpool failed to sign a defensive midfielder this summer but Dutchman Ryan Gravenberch - not a regular starter last season - has ended up being outstanding in that role.\"From Liverpool's perspective, it's quite an easy one to say what they will try to do because it is just more of the same really,\" said Murphy. \"They have got a system they are so used to playing, and they are full of confidence.\"With Konate missing, whoever plays at right-back might be a little bit more cautious in their play because of someone new coming in at centre-half.\"That's not because Konate's replacement would not be capable – I would probably go for Joe Gomez in his place – but Konate has been playing the best football of his career and his wonderful strength and athleticism gives you reassurance as a full-back that you can be braver going forward, knowing that he has got your back.\"That is the only little doubt Liverpool have going into this game because I have been so impressed by Konate, and his partnership with Virgil van Dijk this season has been the best in the Premier League.\"Sometimes Alexis Mac Allister will sit in, for Ryan Gravenberch to go ahead and go on his little runs forward, or Curtis Jones will sometimes drop in and get it off the back players. \"The same happens when Dominik Szoboszlai comes into the team - and it would be a big ask for Ilkay Gundogan and Bernardo Silva to match their running.\"Forget talking tactics - could it all just come down to confidence?Media caption, Manchester City trip to Liverpool 'hardest they have to face'Manchester City's squad has been there and done that... but it's not going to plan this term.This poor run is basically unheard of in modern times at the club.Guardiola had never lost five games in a row before as a manager and City have now conceded two or more goals in six successive matches for the first time since 1963.It was not just that it was five defeats, but the manner of the last one specifically - a 4-0 home league loss to Tottenham.And the game to snap that losing run felt like a defeat too - as they led Feyenoord by three goals going into the 74th minute and drew 3-3 when the visitors staged a dramatic late fightback.\"I think it might be their biggest problem because I don't think any of the players have been through it,\" said ex-City defender Joleon Lescott on the BBC's Planet Premier League podcast.\"To go through this period and this lack of confidence when you're at the top, could potentially have a bigger detriment on your performance.\"If you're low on confidence, that is not the place you want to play - Anfield. Even when you're high on confidence, one missed control or one bad pass can derail you, so going there under the circumstances is probably the hardest they'll ever have to face.\"Guardiola has an ageing squad too - with three goalkeepers, Gundogan, Kyle Walker, De Bruyne, Kovacic, Stones and Silva in their 30s.Onuoha, who spent eight years at City after making his debut in 2004, added: \"Given how things have gone in recent times, especially from a defensive standpoint, imagine a world where City are 3-0 up at Anfield and then Liverpool score to make it 3-1 with 10 minutes to go.\"All of a sudden, a doubt that might never have previously existed through the last few years of us watching Man City... now, why would a team playing against Man City doubt they can come back in a game when they've seen weeks' worth of that going on recently?\"Danny Murphy was talking to BBC Sport's Chris BevanMore on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/2ff0/live/f6eef090-ae6c-11ef-bdf5-b7cb2fa86e10.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cmain id=\"main-content\" data-testid=\"main-content\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;The impact of defeat is massive\u0026#39; - what to look out for in Liverpool v Man City\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eThe Football News Show: Why a settled defence won\u0026#39;t cure Manchester City\u0026#39;s poor form\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eLiverpool and Manchester City meet on Sunday in a game which could have a huge impact on the Premier League title.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe gap between the rivals could be 11 points if the game at Anfield goes to the form book.\u003c/p\u003e\u003cp\u003eLeaders Liverpool have won 17 of their 19 games under Arne Slot, while struggling City - now down to fourth in the table - had lost five in a row before blowing a 3-0 lead to draw with Feyenoord in their midweek Champions League encounter.\u003c/p\u003e\u003cp\u003e\u0026#34;Considering they were first and second going into the weekend, the unique thing about Sunday\u0026#39;s game, really, is that all the pressure is on City,\u0026#34; said BBC pundit Danny Murphy.\u003c/p\u003e\u003cp\u003e\u0026#34;For City, the impact of a defeat is massive, but so would be the impact of a win. All of a sudden the champions would be back, and there would be a huge shift in confidence and belief for them, because it keeps their season alive. It is massive for them.\u003c/p\u003e\u003cp\u003e\u0026#34;For Liverpool, if you break it down, while it will be another great result if they win, and disappointing if they lose, this is actually one of those weird occasions where it is almost like a free hit, and they can almost enjoy it.\u0026#34;\u003c/p\u003e\u003cp\u003eBBC Sport has a look at some of the talking points going into the game.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"How-big-could-game-be-in-title-race\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eHow big could game be in title race?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLiverpool are currently eight points clear of Manchester City and could end the weekend 11 in front of the defending champions if they win.\u003c/p\u003e\u003cp\u003eOnly three teams have ever lifted the Premier League after trailing the leaders by that many points or more - Manchester United in 1992-93 and 1995-96, and Arsenal in 1997-98.\u003c/p\u003e\u003cp\u003eBut if City can claim a crucial success, that gap would be down to five points and suddenly only be a bad week from Liverpool off the number one spot they have occupied for so much of the past six seasons.\u003c/p\u003e\u003cp\u003eEven if they lose, you can never entirely write off a side that has only lost four Premier League games after Christmas across the past three seasons combined.\u003c/p\u003e\u003cp\u003eHowever, there are few signs from Pep Guardiola\u0026#39;s current charges that they are capable of going on one of those juggernaut runs where they destroy everyone in their path.\u003c/p\u003e\u003cp\u003e\u0026#34;If Manchester City lose at Anfield on Sunday, they would leave themselves the biggest mountain they\u0026#39;ve ever had to climb to win the title,\u0026#34; said ex-Liverpool midfielder Murphy.\u003c/p\u003e\u003cp\u003e\u0026#34;Pep Guardiola\u0026#39;s side have been the one team in recent years who have been capable of clawing back big deficits to become champions but, this time, from what we have seen from them recently, I think 11 points would be too much for them to make up.\u0026#34;\u003c/p\u003e\u003cp\u003eA Liverpool victory will also take them nine clear of Arsenal, who moved up to second place with an impressive 5-2 win at West Ham on Saturday. Chelsea will join the Gunners on 25 points should they beat Aston Villa in Sunday\u0026#39;s earlier game.\u003c/p\u003e\u003cp\u003e\u0026#34;If Liverpool win, although it makes them favourites for the title, it is no way decisive at this stage,\u0026#34; continued Murphy. \u0026#34;They are under a new manager and, at the moment, things are going well and they have had no serious injuries to contend with. But there might be a spell later in the season where they do have a little wobble.\u0026#34;\u003c/p\u003e\u003cp\u003eWhile City are bidding for a fifth title in a row, Liverpool are aiming for only their second in the Premier League era.\u003c/p\u003e\u003cp\u003eThe Reds have won just one of their past nine Premier League games against City, but Guardiola has only ever tasted victory at Anfield once, back in February 2021 when no fans were present due to Covid-19 restrictions.\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Salah-flying-Haaland-not-so-much\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eSalah flying, Haaland not so much\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eLiverpool fans want Mohamed Salah to be given a new contract\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEffectively all of Liverpool\u0026#39;s players are in form - and all of City\u0026#39;s players are out of it.\u003c/p\u003e\u003cp\u003eCity striker Erling Haaland is the Premier League\u0026#39;s top scorer with 12 goals, but only two of those have come in his past seven league games. He did, though, manage two in the 3-3 draw against Feyenoord on Tuesday.\u003c/p\u003e\u003cp\u003eNot many of his team-mates are pulling up trees either as their struggles without talismanic midfielder Rodri continue.\u003c/p\u003e\u003cp\u003eHis deputy Mateo Kovacic is injured too.\u003c/p\u003e\u003cp\u003eUnlike Haaland, Mohamed Salah is bang in form - despite all the uncertainty over his future with his contract expiring next summer.\u003c/p\u003e\u003cp\u003eThe club legend - like Virgil van Dijk and Trent Alexander-Arnold - is able to discuss a pre-contract with other teams in just over four weeks.\u003c/p\u003e\u003cp\u003eBut Salah, who created headlines when he said he has not been offered a new deal yet, has scored seven goals in his last seven Premier League games. \u003c/p\u003e\u003cp\u003e\u0026#34;I don\u0026#39;t see any panic at all,\u0026#34; said ex-Manchester City defender Nedum Onuoha on the \u003ca href=\"https://www.bbc.com/programmes/p0h4pzn4\"\u003eBBC\u0026#39;s Planet Premier League podcast.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;Maybe he\u0026#39;s trying to play an elaborate game, but he\u0026#39;s putting the work in and he\u0026#39;s enjoying the moments for Liverpool. \u003c/p\u003e\u003cp\u003e\u0026#34;Salah, Van Dijk and Alexander-Arnold don\u0026#39;t look like players that have insecurity and, as a consequence, they are playing the best football in the country right now.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Theyll-have-to-try-something-different-how-could-Man-City-line-up\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;They\u0026#39;ll have to try something different\u0026#39; - how could Man City line up?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003ePep Guardiola \u0026#39;I have to prove myself now\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eOne of the things City have not got right this season is how to replace Rodri in the number six role.\u003c/p\u003e\u003cp\u003eKovacic, Rico Lewis, Matheus Nunes, Bernardo Silva and Ilkay Gundogan have all had a go.\u003c/p\u003e\u003cp\u003e\u0026#34;My gut feeling is, because of where their form is at, and with Liverpool flying at the moment, for once City might have to give them a bit of respect and try something a bit different on Sunday,\u0026#34; said Murphy.\u003c/p\u003e\u003cp\u003e\u0026#34;If Ruben Dias is fit to start, alongside maybe Nathan Ake, then I would be tempted to play [defender] Manuel Akanji in that midfield holding role, as John Stones has done before.\u003c/p\u003e\u003cp\u003e\u0026#34;I am not sure if Pep will do that, but maybe this time, his priority might not be about how City are going to make chances and score goals against this great Liverpool defence, because he trusts his players to do that.\u003c/p\u003e\u003cp\u003e\u0026#34;We should remember they are serial winners and we are talking about a team with some of the best players in the world, but one of the key factors to them having any success at Anfield is for them to be much better defensively than they have been recently.\u003c/p\u003e\u003cp\u003e\u0026#34;It could be damaging for City to go to Anfield with their usual system, where Rico Lewis is at right-back and drifts into midfield, which would leave their back three against Liverpool\u0026#39;s front three.\u0026#34;\u003c/p\u003e\u003cp\u003eMurphy thinks the visitors will start Kevin de Bruyne, who has recently returned from injury, and one of Gundogan or Silva - plus a more defensive-minded player like Akanji or Lewis in midfield.\u003c/p\u003e\u003cp\u003e\u0026#34;I would be really surprised if he decides to play, say, Gundogan and Silva in there on their own, with Phil Foden behind Erling Haaland again,\u0026#34; said the former England midfielder.\u003c/p\u003e\u003cp\u003e\u0026#34;Although it is great to have belief in yourself, when you are conceding goals like City are, you have to play the moment.\u0026#34;\u003c/p\u003e\u003cp\u003eMurphy said he is \u0026#34;certainly not trying to suggest that City should park the bus and not believe in themselves\u0026#34; - but did suggest two options for Guardiola.\u003c/p\u003e\u003cp\u003e\u0026#34;Liverpool play a front three, and they are very good - so City should play a four [at the back]. City are conceding a lot of goals, so maybe their back four should concentrate on stopping Liverpool\u0026#39;s front three,\u0026#34; he added.\u003c/p\u003e\u003cp\u003e\u0026#34;And then Liverpool\u0026#39;s midfield is very good at the moment, so maybe City should play three midfielders in there who are suited to that battle, rather than two midfielders and one forward.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"More-of-the-same-for-Liverpool\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;More of the same\u0026#39; for Liverpool?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eRyan Gravenberch is playing well under his fellow Dutchman Arne Slot\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eLiverpool have excelled this season since Arne Slot replaced club icon Jurgen Klopp and has brought a more measured approach to their game.\u003c/p\u003e\u003cp\u003eAnd it has worked to record-breaking levels with 17 wins and a draw in their first 19 games under the Dutchman, who had never worked in English football before.\u003c/p\u003e\u003cp\u003eGoalkeeper Alisson is likely to remain out with a hamstring injury, but Republic of Ireland international Caoimhin Kelleher has been a more than capable deputy - saving three penalties in the past three weeks for club and country.\u003c/p\u003e\u003cp\u003eRight-back Conor Bradley and centre-back Ibrahima Konate both picked up injuries in the impressive 2-0 Champions League win over Real Madrid in midweek, but the fit-again Trent Alexander-Arnold could return at full-back.\u003c/p\u003e\u003cp\u003eLiverpool failed to sign a defensive midfielder this summer but Dutchman Ryan Gravenberch - not a regular starter last season - has ended up being outstanding in that role.\u003c/p\u003e\u003cp\u003e\u0026#34;From Liverpool\u0026#39;s perspective, it\u0026#39;s quite an easy one to say what they will try to do because it is just more of the same really,\u0026#34; said Murphy. \u0026#34;They have got a system they are so used to playing, and they are full of confidence.\u003c/p\u003e\u003cp\u003e\u0026#34;With Konate missing, whoever plays at right-back might be a little bit more cautious in their play because of someone new coming in at centre-half.\u003c/p\u003e\u003cp\u003e\u0026#34;That\u0026#39;s not because Konate\u0026#39;s replacement would not be capable – I would probably go for Joe Gomez in his place – but Konate has been playing the best football of his career and his wonderful strength and athleticism gives you reassurance as a full-back that you can be braver going forward, knowing that he has got your back.\u003c/p\u003e\u003cp\u003e\u0026#34;That is the only little doubt Liverpool have going into this game because I have been so impressed by Konate, and his partnership with Virgil van Dijk this season has been the best in the Premier League.\u003c/p\u003e\u003cp\u003e\u0026#34;Sometimes Alexis Mac Allister will sit in, for Ryan Gravenberch to go ahead and go on his little runs forward, or Curtis Jones will sometimes drop in and get it off the back players. \u003c/p\u003e\u003cp\u003e\u0026#34;The same happens when Dominik Szoboszlai comes into the team - and it would be a big ask for Ilkay Gundogan and Bernardo Silva to match their running.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Forget-talking-tactics-could-it-all-just-come-down-to-confidence\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003eForget talking tactics - could it all just come down to confidence?\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eManchester City trip to Liverpool \u0026#39;hardest they have to face\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eManchester City\u0026#39;s squad has been there and done that... but it\u0026#39;s not going to plan this term.\u003c/p\u003e\u003cp\u003eThis poor run is basically unheard of in modern times at the club.\u003c/p\u003e\u003cp\u003eGuardiola had never lost five games in a row before as a manager and City have now conceded two or more goals in six successive matches for the first time since 1963.\u003c/p\u003e\u003cp\u003eIt was not just that it was five defeats, but the manner of the last one specifically - a 4-0 home league loss to Tottenham.\u003c/p\u003e\u003cp\u003eAnd the game to snap that losing run felt like a defeat too - as they led Feyenoord by three goals going into the 74th minute and drew 3-3 when the visitors staged a dramatic late fightback.\u003c/p\u003e\u003cp\u003e\u0026#34;I think it might be their biggest problem because I don\u0026#39;t think any of the players have been through it,\u0026#34; said ex-City defender Joleon Lescott on the \u003ca href=\"https://www.bbc.com/programmes/p0h4pzn4\"\u003eBBC\u0026#39;s Planet Premier League podcast.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;To go through this period and this lack of confidence when you\u0026#39;re at the top, could potentially have a bigger detriment on your performance.\u003c/p\u003e\u003cp\u003e\u0026#34;If you\u0026#39;re low on confidence, that is not the place you want to play - Anfield. Even when you\u0026#39;re high on confidence, one missed control or one bad pass can derail you, so going there under the circumstances is probably the hardest they\u0026#39;ll ever have to face.\u0026#34;\u003c/p\u003e\u003cp\u003eGuardiola has an ageing squad too - with three goalkeepers, Gundogan, Kyle Walker, De Bruyne, Kovacic, Stones and Silva in their 30s.\u003c/p\u003e\u003cp\u003eOnuoha, who spent eight years at City after making his debut in 2004, added: \u0026#34;Given how things have gone in recent times, especially from a defensive standpoint, imagine a world where City are 3-0 up at Anfield and then Liverpool score to make it 3-1 with 10 minutes to go.\u003c/p\u003e\u003cp\u003e\u0026#34;All of a sudden, a doubt that might never have previously existed through the last few years of us watching Man City... now, why would a team playing against Man City doubt they can come back in a game when they\u0026#39;ve seen weeks\u0026#39; worth of that going on recently?\u0026#34;\u003c/p\u003e\u003cp\u003e\u003ci\u003eDanny Murphy was talking to BBC Sport\u0026#39;s Chris Bevan\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/main\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-12-01T00:01:09.994Z",
  "modifiedTime": null
}
