{
  "id": "b089c5b9-ba8d-4303-8dfe-71e099f52835",
  "title": "Wright knocks defending champion Humphries out of Worlds",
  "link": "https://www.bbc.com/sport/darts/articles/cnv3pmpdl16o",
  "description": "Defending champion Luke Humphries is knocked out of the PDC World Darts Championship in the fourth round by Peter Wright.",
  "author": "",
  "published": "Sun, 29 Dec 2024 23:04:14 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "Callum Matthews, Sam Drury",
  "length": 5415,
  "excerpt": "Defending champion Luke Humphries is knocked out of the PDC World Darts Championship in the fourth round by Peter Wright.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "Defending champion Luke Humphries is out of the PDC World Darts Championship in the fourth round after an astonishing performance from former winner Peter Wright. Humphries was far from his fluent best and was eventually beaten 4-1 by the 2020 and 2022 champion.Wright, who is seeded 17th, has endured a difficult year but said in the build-up that he was confident he could still match the levels of Humphries and teenage prodigy Luke Littler.And so it proved. He averaged 100.93 - slightly higher than Humphries' 99.23 - and had a staggering 70% success rate on the checkouts. Humphries had fought back in the pre-match words - saying if he won this year's event he would have matched everything Wright had achieved despite being 25 years his junior.His bare numbers were still at a reasonable level - he was at 56.3% on checkouts himself - but there was a flatness about his performance and he was not able to produce that consistent high-level of scoring that has propelled him to the world's best player.His ranking as world number one is safe because the PDC Order of Merit is done over two years and Humphries has won six PDC major finals in that time. For Wright this is a significant warning to others that he still has plenty of life left in him at 54.Earlier this year, he endured a torrid Premier League campaign, winning just two of 18 matches, as he finished bottom of the eight-player table. He will face the winner of eighth-seed Stephen Bunting against unseeded Luke Woodhouse in the last eight. \"Luke gave me a load of chances there, he didn't play like he can,\" Wright told Sky Sports.\"I've been struggling for form all year and it's so annoying because I know I can still play darts.\"I'm a double world champion and I want to win it for a third time. I'm not too old and you only have to play well for two or three weeks the whole year. These three weeks are all that matters and I'm in the quarter-finals.\"Humphries' exit, in theory, makes Littler's route to the final easier with Bunting now the highest-seeded player he could play before Friday's showpiece event. Meanwhile, 2021 champion Gerwyn Price is through to the last eight with a 4-2 win over number seven seed Jonny Clayton.Price, who is good friends with Clayton and plays alongside him for Wales in the World Cup of Darts, raced into a 2-0 lead with an impressive 107 average.As has been the case for much of the year, he was unable to produce that level for an entire game, with his average dropping by more than 10 as Clayton levelled at 2-2.Tenth seed Price found more rhythm to win the fifth and sixth set, and closed out the win to earn a place in the quarter-finals for the fifth time in the past six years.\"I thought the first two sets I blew him away, then I couldn't hit a barn door. I was trying too hard,\" Price told Sky Sports.\"It was a tough game in more senses than one. I wanted to win but he's a great friend, not that that matters because I'm here to win. I promise I will get better.\"He will face 15th seed Chris Dobey or the unseeded Kevin Doets in the quarter-finals.England's Callan Rydz put in a magnificent performance to stun 11th seed Dimitri van den Bergh and reach the fourth round.Rydz, a quarter-finalist in 2022, stormed to a 4-0 win over the 2020 World Matchplay champion as he recorded an impressive 105.31 average.That number was at 115.94 after a blistering first two sets in which Rydz hit six 180s and made six of his nine darts at double against a bewildered Van den Bergh.The Belgian attempted to force his way back into the contest but Rydz's level was such that any opportunities were soon snatched from Van den Bergh's grasp.\"I'm over the moon. I didn't give Dimi a sniff and I've got to do the same in the last 16,\" Rydz told Sky Sports. \"Buzzing with the result and can't wait to be back here.\"Dutchman Doets survived four match darts as he produced a stirring comeback to beat 31st seed Krzysztof Ratajski.Doets, who knocked out second seed Michael Smith in the last round, did not have a dart at double in the first set and found himself 2-0 down without winning a leg.However, he suddenly burst into life to win six of the next seven legs and level the match at 2-2 with a 106 checkout.Ratajski rallied in the fifth and had four darts to win the match in the sixth but failed to take them.That allowed Doets to level again before he took the lead for the first time at 2-1 in the seventh and won the next to seal it.Meanwhile, Sweden's Jeffrey de Graaf set up a last-16 tie with three-time champion Michael van Gerwen after a convincing 4-1 win over Paolo Nebrida.Filipino Nebrida took the first set but De Graaf won the next four on the bounce, finishing with a 10-darter, to progress from the third round of the World Championship for the first time.Afternoon SessionThird roundJeffrey de Graaf 4-1 Paolo NebridaKevin Doets 4-3 Krzysztof RatajskiDimitri van den Bergh 0-4 Callan RydzEvening Session (19:00)Third roundRicky Evans 2-4 Robert OwenFourth roundJonny Clayton 2-4 Gerwyn PriceLuke Humphries 1-4 Peter WrightAfternoon Session (12:30 GMT)Fourth roundKevin Doets v Chris DobeyRobert Owen v Callan RydzRicardo Pietreczko v Nathan AspinallEvening Session (19:00 GMT)Fourth roundStephen Bunting v Luke WoodhouseMichael van Gerwen v Jeffrey de GraafLuke Littler v Ryan JoyceThere will be live text commentary on the evening session from 18:45 GMT on the BBC Sport website and app.",
  "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f07/live/3af94700-c63b-11ef-9424-2faf2fb332a2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eDefending champion Luke Humphries is out of the PDC World Darts Championship in the fourth round after an astonishing performance from former winner Peter Wright. \u003c/b\u003e\u003c/p\u003e\u003cp\u003eHumphries was far from his fluent best and was eventually beaten 4-1 by the 2020 and 2022 champion.\u003c/p\u003e\u003cp\u003eWright, who is seeded 17th, has endured a difficult year but said in the build-up that he was confident he could still match the levels of Humphries and teenage prodigy Luke Littler.\u003c/p\u003e\u003cp\u003eAnd so it proved. He averaged 100.93 - slightly higher than Humphries\u0026#39; 99.23 - and had a staggering 70% success rate on the checkouts. \u003c/p\u003e\u003cp\u003eHumphries had fought back in the pre-match words - saying if he won this year\u0026#39;s event he would have matched everything Wright had achieved despite being 25 years his junior.\u003c/p\u003e\u003cp\u003eHis bare numbers were still at a reasonable level - he was at 56.3% on checkouts himself - but there was a flatness about his performance and he was not able to produce that consistent high-level of scoring that has propelled him to the world\u0026#39;s best player.\u003c/p\u003e\u003cp\u003eHis ranking as world number one is safe because the PDC Order of Merit is done over two years and Humphries has won six PDC major finals in that time. \u003c/p\u003e\u003cp\u003eFor Wright this is a significant warning to others that he still has plenty of life left in him at 54.\u003c/p\u003e\u003cp\u003eEarlier this year, he endured a torrid Premier League campaign, winning just two of 18 matches, as he finished bottom of the eight-player table. \u003c/p\u003e\u003cp\u003eHe will face the winner of eighth-seed Stephen Bunting against unseeded Luke Woodhouse in the last eight. \u003c/p\u003e\u003cp\u003e\u0026#34;Luke gave me a load of chances there, he didn\u0026#39;t play like he can,\u0026#34; Wright told Sky Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;ve been struggling for form all year and it\u0026#39;s so annoying because I know I can still play darts.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m a double world champion and I want to win it for a third time. I\u0026#39;m not too old and you only have to play well for two or three weeks the whole year. These three weeks are all that matters and I\u0026#39;m in the quarter-finals.\u0026#34;\u003c/p\u003e\u003cp\u003eHumphries\u0026#39; exit, in theory, makes Littler\u0026#39;s route to the final easier with Bunting now the highest-seeded player he could play before Friday\u0026#39;s showpiece event. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMeanwhile, 2021 champion Gerwyn Price is through to the last eight with a 4-2 win over number seven seed Jonny Clayton.\u003c/p\u003e\u003cp\u003ePrice, who is good friends with Clayton and plays alongside him for Wales in the World Cup of Darts, raced into a 2-0 lead with an impressive 107 average.\u003c/p\u003e\u003cp\u003eAs has been the case for much of the year, he was unable to produce that level for an entire game, with his average dropping by more than 10 as Clayton levelled at 2-2.\u003c/p\u003e\u003cp\u003eTenth seed Price found more rhythm to win the fifth and sixth set, and closed out the win to earn a place in the quarter-finals for the fifth time in the past six years.\u003c/p\u003e\u003cp\u003e\u0026#34;I thought the first two sets I blew him away, then I couldn\u0026#39;t hit a barn door. I was trying too hard,\u0026#34; Price told Sky Sports.\u003c/p\u003e\u003cp\u003e\u0026#34;It was a tough game in more senses than one. I wanted to win but he\u0026#39;s a great friend, not that that matters because I\u0026#39;m here to win. I promise I will get better.\u0026#34;\u003c/p\u003e\u003cp\u003eHe will face 15th seed Chris Dobey or the unseeded Kevin Doets in the quarter-finals.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEngland\u0026#39;s Callan Rydz put in a magnificent performance to stun 11th seed Dimitri van den Bergh and reach the fourth round.\u003c/p\u003e\u003cp\u003eRydz, a quarter-finalist in 2022, stormed to a 4-0 win over the 2020 World Matchplay champion as he recorded an impressive 105.31 average.\u003c/p\u003e\u003cp\u003eThat number was at 115.94 after a blistering first two sets in which Rydz hit six 180s and made six of his nine darts at double against a bewildered Van den Bergh.\u003c/p\u003e\u003cp\u003eThe Belgian attempted to force his way back into the contest but Rydz\u0026#39;s level was such that any opportunities were soon snatched from Van den Bergh\u0026#39;s grasp.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m over the moon. I didn\u0026#39;t give Dimi a sniff and I\u0026#39;ve got to do the same in the last 16,\u0026#34; Rydz told Sky Sports. \u0026#34;Buzzing with the result and can\u0026#39;t wait to be back here.\u0026#34;\u003c/p\u003e\u003cp\u003eDutchman Doets survived four match darts as he produced a stirring comeback to beat 31st seed Krzysztof Ratajski.\u003c/p\u003e\u003cp\u003eDoets, who knocked out second seed Michael Smith in the last round, did not have a dart at double in the first set and found himself 2-0 down without winning a leg.\u003c/p\u003e\u003cp\u003eHowever, he suddenly burst into life to win six of the next seven legs and level the match at 2-2 with a 106 checkout.\u003c/p\u003e\u003cp\u003eRatajski rallied in the fifth and had four darts to win the match in the sixth but failed to take them.\u003c/p\u003e\u003cp\u003eThat allowed Doets to level again before he took the lead for the first time at 2-1 in the seventh and won the next to seal it.\u003c/p\u003e\u003cp\u003eMeanwhile, Sweden\u0026#39;s Jeffrey de Graaf set up a last-16 tie with three-time champion Michael van Gerwen after a convincing 4-1 win over Paolo Nebrida.\u003c/p\u003e\u003cp\u003eFilipino Nebrida took the first set but De Graaf won the next four on the bounce, finishing with a 10-darter, to progress from the third round of the World Championship for the first time.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAfternoon Session\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eThird round\u003c/b\u003e\u003c/p\u003e\u003cp\u003eJeffrey de Graaf 4-1 Paolo Nebrida\u003c/p\u003e\u003cp\u003eKevin Doets 4-3 Krzysztof Ratajski\u003c/p\u003e\u003cp\u003eDimitri van den Bergh 0-4 Callan Rydz\u003c/p\u003e\u003cp\u003e\u003cb\u003eEvening Session (19:00)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eThird round\u003c/b\u003e\u003c/p\u003e\u003cp\u003eRicky Evans 2-4 Robert Owen\u003c/p\u003e\u003cp\u003e\u003cb\u003eFourth round\u003c/b\u003e\u003c/p\u003e\u003cp\u003eJonny Clayton 2-4 Gerwyn Price\u003c/p\u003e\u003cp\u003eLuke Humphries 1-4 Peter Wright\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAfternoon Session (12:30 GMT)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eFourth round\u003c/b\u003e\u003c/p\u003e\u003cp\u003eKevin Doets v Chris Dobey\u003c/p\u003e\u003cp\u003eRobert Owen v Callan Rydz\u003c/p\u003e\u003cp\u003eRicardo Pietreczko v Nathan Aspinall\u003c/p\u003e\u003cp\u003e\u003cb\u003eEvening Session (19:00 GMT)\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eFourth round\u003c/b\u003e\u003c/p\u003e\u003cp\u003eStephen Bunting v Luke Woodhouse\u003c/p\u003e\u003cp\u003eMichael van Gerwen v Jeffrey de Graaf\u003c/p\u003e\u003cp\u003eLuke Littler v Ryan Joyce\u003c/p\u003e\u003cp\u003e\u003ci\u003eThere will be live text commentary on the evening session from 18:45 GMT on the BBC Sport website and app.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-29T16:50:31.873Z",
  "modifiedTime": null
}
