{
  "id": "c4250170-b31f-481b-9666-e9859ba8a7c5",
  "title": "'Maybe it's destiny' - Amorim on Man Utd job \u0026 coaching philosophy",
  "link": "https://www.bbc.com/sport/football/articles/cx2ye47jkz2o",
  "description": "Manchester United's new manager Ruben Amorim sits down with BBC Sport's Mark Chapman to discuss his new job and coaching philosophy.",
  "author": "",
  "published": "Fri, 29 Nov 2024 21:05:35 GMT",
  "source": "http://feeds.bbci.co.uk/sport/rss.xml",
  "categories": null,
  "byline": "BBC Sport",
  "length": 4503,
  "excerpt": "Manchester United's new manager Ruben Amorim sits down with BBC Sport's Mark Chapman to discuss his new job and coaching philosophy.",
  "siteName": "BBC Sport",
  "favicon": "",
  "text": "'Maybe it's destiny' - Amorim on Man Utd job \u0026 coaching philosophyMedia caption, Ruben Amorim on Man Utd job 'destiny'Ruben Amorim has become the latest manager to be tasked with restoring Manchester United's on-pitch fortunes.The club paid £11m to Portuguese club Sporting to recruit the 39-year-old and his staff, making him the sixth permanent manager since Sir Alex Ferguson's illustrious 26-year reign ended with his retirement in 2013.Amorim was brought in following the dismissal of Erik ten Hag and, after a draw at Ipswich and win against Bodo/Glimt in his first two games, his side host Everton on Sunday (13:30 GMT).BBC Sport presenter Mark Chapman caught up with Amorim for Football Focus to find out more about the Portuguese.Watch the full interview with Ruben Amorim on Football Focus on Saturday, 30 November on BBC One at 12:00 GMT or download the special Football Daily podcast on BBC Sounds from 10:00 GMT'If you are not emotional, you cannot have a connection'Are you feeling a connection with Manchester United fans?\"Yes, for sure I feel that, maybe because I am a little bit [of] an emotional person. I can transmit that, even in interviews I think. Maybe because I am different from the last coach and this can bring a different connection with the next guy. \"I believe that I am the right guy. People always believe the next guy is the right guy. We always have this feeling. \"To maintain this feeling we have to play better, win games and be really honest with the supporters. If you are honest and direct with the supporters - maybe you don't always say the popular thing - you create a better connection.\"Have you always been emotional?\"Yes, because it is my character. You cannot change. You cannot be one day not emotional and the next day be emotional. \"I think also with my head, not always with my heart. But when I do things, I do it with emotion. \"As a coach you can be so good with tactical and technical stuff, but if you are not emotional, you cannot have a connection with players, you cannot do nothing with a football team.\"'I like to bond with people'What kind of player were you?\"I was a team player. I had a lot of injuries but all the team players say that to excuse some lack of success. \"I always loved the game and I will always love the tactical aspect of the game. \"I try to understand things. I played in all positions so I understood the game and tried to help the game in every position and that gave me the knowledge - not just the position - but the understanding.\"I grew up with not a large family, but a strong family with a lot of emotion. I am a Latin guy, I'm just like that. \"I like people, I like to bond with people, and I think it's one of the best things in this job. \"You can make a lot of friends and still do your job. You can be demanding and still have a connection with everybody.\"Image source, Getty ImagesImage caption, Amorim beat Manchester City in his penultimate game in charge of Sporting'I'm not ashamed to say I had a psychologist'You went to university in Lisbon to study elite coaching and management - was the emotional side of individuals a big part of it?\"Yes, and I'm not ashamed to say I had also a therapist, a psychologist. I think it helps a lot because I was preparing for the end of my career. \"I wanted to change different things to prepare my career as a coach. \"I went to university because I was a football player and sometimes the football player thinks that because they know football they are ready to cope with the demands of being a coach. \"Some rules are for all, but I treat my players completely differently. They are different people so I deal with every one of them in a different way.\"You can have some rules, some red lines that you cannot cross, no matter who you are, but I deal with the players completely different because they are different people.\"'This will not change me'You are very relaxed - why is that?\"I will be OK. No matter what, in this stage of my life, I'll be OK, so that's why I'm relaxed.\"Everybody says to me, 'this will change me'. This will not change me.\"If something happens I will be frustrated for a while but I know I will recover. But I believe that we are going to succeed.\"I'm ready. When I had this invitation, I felt that it was really hard to leave my players at Sporting. But, when I had this opportunity, I felt I had to do this. \"Maybe it's destiny and I will be a little bit lucky in the beginning and then everything is going to be fine.\"More on this story",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_sport/fa04/live/dc8ff070-ae42-11ef-849c-7d505374741f.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cheader data-component=\"headline-block\"\u003e\u003ch2 id=\"main-heading\" type=\"headline\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;Maybe it\u0026#39;s destiny\u0026#39; - Amorim on Man Utd job \u0026amp; coaching philosophy\u003c/span\u003e\u003c/h2\u003e\u003c/header\u003e\u003cdiv data-component=\"video-block\"\u003e\u003cfigure\u003e\u003cfigcaption\u003e\u003cspan\u003eMedia caption, \u003c/span\u003e\u003cp\u003eRuben Amorim on Man Utd job \u0026#39;destiny\u0026#39;\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eRuben Amorim has become the latest manager to be tasked with restoring Manchester United\u0026#39;s on-pitch fortunes.\u003c/b\u003e\u003c/p\u003e\u003cp\u003eThe club paid £11m to Portuguese club Sporting to recruit the 39-year-old and his staff, making him the sixth permanent manager since Sir Alex Ferguson\u0026#39;s illustrious 26-year reign ended with his retirement in 2013.\u003c/p\u003e\u003cp\u003eAmorim was brought in following the dismissal of Erik ten Hag and, after a draw at Ipswich and win against Bodo/Glimt in his first two games, his side host Everton on Sunday (13:30 GMT).\u003c/p\u003e\u003cp\u003eBBC Sport presenter Mark Chapman caught up with Amorim for Football Focus to find out more about the Portuguese.\u003c/p\u003e\u003cdiv\u003e\u003cul role=\"list\"\u003e\u003cli\u003e\u003cp\u003e\u003ci\u003eWatch the full interview with Ruben Amorim on Football Focus on Saturday, 30 November on BBC One at 12:00 GMT or download the special Football Daily podcast on BBC Sounds from 10:00 GMT\u003c/i\u003e\u003c/p\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"If-you-are-not-emotional-you-cannot-have-a-connection\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;If you are not emotional, you cannot have a connection\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eAre you feeling a connection with Manchester United fans?\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;Yes, for sure I feel that, maybe because I am a little bit [of] an emotional person. I can transmit that, even in interviews I think. Maybe because I am different from the last coach and this can bring a different connection with the next guy. \u003c/p\u003e\u003cp\u003e\u0026#34;I believe that I am the right guy. People always believe the next guy is the right guy. We always have this feeling. \u003c/p\u003e\u003cp\u003e\u0026#34;To maintain this feeling we have to play better, win games and be really honest with the supporters. If you are honest and direct with the supporters - maybe you don\u0026#39;t always say the popular thing - you create a better connection.\u0026#34;\u003c/p\u003e\u003cp\u003e\u003cb\u003eHave you always been emotional?\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;Yes, because it is my character. You cannot change. You cannot be one day not emotional and the next day be emotional. \u003c/p\u003e\u003cp\u003e\u0026#34;I think also with my head, not always with my heart. But when I do things, I do it with emotion. \u003c/p\u003e\u003cp\u003e\u0026#34;As a coach you can be so good with tactical and technical stuff, but if you are not emotional, you cannot have a connection with players, you cannot do nothing with a football team.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"I-like-to-bond-with-people\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;I like to bond with people\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eWhat kind of player were you?\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I was a team player. I had a lot of injuries but all the team players say that to excuse some lack of success. \u003c/p\u003e\u003cp\u003e\u0026#34;I always loved the game and I will always love the tactical aspect of the game. \u003c/p\u003e\u003cp\u003e\u0026#34;I try to understand things. I played in all positions so I understood the game and tried to help the game in every position and that gave me the knowledge - not just the position - but the understanding.\u003c/p\u003e\u003cp\u003e\u0026#34;I grew up with not a large family, but a strong family with a lot of emotion. I am a Latin guy, I\u0026#39;m just like that. \u003c/p\u003e\u003cp\u003e\u0026#34;I like people, I like to bond with people, and I think it\u0026#39;s one of the best things in this job. \u003c/p\u003e\u003cp\u003e\u0026#34;You can make a lot of friends and still do your job. You can be demanding and still have a connection with everybody.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cspan\u003e\u003c/span\u003e\u003c/span\u003e\u003cspan role=\"text\"\u003e\u003cspan\u003eImage source, \u003c/span\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003cfigcaption\u003e\u003cspan\u003eImage caption, \u003c/span\u003e\u003cp\u003eAmorim beat Manchester City in his penultimate game in charge of Sporting\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"Im-not-ashamed-to-say-I-had-a-psychologist\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;I\u0026#39;m not ashamed to say I had a psychologist\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eYou went to university in Lisbon to study elite coaching and management - was the emotional side of individuals a big part of it?\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;Yes, and I\u0026#39;m not ashamed to say I had also a therapist, a psychologist. I think it helps a lot because I was preparing for the end of my career. \u003c/p\u003e\u003cp\u003e\u0026#34;I wanted to change different things to prepare my career as a coach. \u003c/p\u003e\u003cp\u003e\u0026#34;I went to university because I was a football player and sometimes the football player thinks that because they know football they are ready to cope with the demands of being a coach. \u003c/p\u003e\u003cp\u003e\u0026#34;Some rules are for all, but I treat my players completely differently. They are different people so I deal with every one of them in a different way.\u003c/p\u003e\u003cp\u003e\u0026#34;You can have some rules, some red lines that you cannot cross, no matter who you are, but I deal with the players completely different because they are different people.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"subheadline-block\"\u003e\u003ch2 id=\"This-will-not-change-me\" tabindex=\"-1\"\u003e\u003cspan role=\"text\"\u003e\u0026#39;This will not change me\u0026#39;\u003c/span\u003e\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u003cb\u003eYou are very relaxed - why is that?\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u0026#34;I will be OK. No matter what, in this stage of my life, I\u0026#39;ll be OK, so that\u0026#39;s why I\u0026#39;m relaxed.\u003c/p\u003e\u003cp\u003e\u0026#34;Everybody says to me, \u0026#39;this will change me\u0026#39;. This will not change me.\u003c/p\u003e\u003cp\u003e\u0026#34;If something happens I will be frustrated for a while but I know I will recover. But I believe that we are going to succeed.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m ready. When I had this invitation, I felt that it was really hard to leave my players at Sporting. But, when I had this opportunity, I felt I had to do this. \u003c/p\u003e\u003cp\u003e\u0026#34;Maybe it\u0026#39;s destiny and I will be a little bit lucky in the beginning and then everything is going to be fine.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003csection data-component=\"links-block\"\u003e\u003cp\u003e\u003ch2 type=\"normal\"\u003eMore on this story\u003c/h2\u003e\u003c/p\u003e\u003c/section\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-29T21:05:35.982Z",
  "modifiedTime": null
}
