{
  "id": "c6a3deb9-ec5f-4d26-9f97-ee0180846d80",
  "title": "Indiana's Kurtis Rourke is a rare QB import from our northern neighbors",
  "link": "https://www.espn.com/college-football/story/_/id/43064799/indiana-hoosiers-college-football-playoff-kurtis-rourke-canada",
  "description": "When Indiana kicks off the 12-team College Football Playoff at Notre Dame, it will be led by a Canadian. That's rarer than you might think.",
  "author": "Jake Trotter",
  "published": "Fri, 20 Dec 2024 19:26:21 EST",
  "source": "https://www.espn.com/espn/rss/news",
  "categories": null,
  "byline": "Jake Trotter",
  "length": 14041,
  "excerpt": "When Indiana kicks off the 12-team College Football Playoff at Notre Dame, it will be led by a Canadian. That's rarer than you might think.",
  "siteName": "ESPN",
  "favicon": "https://a.espncdn.com/wireless/mw5/r1/images/bookmark-icons-v2/espn-icon-180x180.png",
  "text": "Jake Trotter, ESPN Senior WriterDec 20, 2024, 07:00 AM ETCloseJake Trotter covers college football for ESPN. He joined ESPN in 2011. Before that, he worked at The Oklahoman, Austin American-Statesman and Middletown (Ohio) Journal newspapers. You can follow him @Jake_Trotter.KURTIS ROURKE'S GO-TO shirt around the Indiana football facility reads, \"BRING YOUR EH GAME,\" featuring the red and white Canadian maple leaf flag. In 2019, his first year of college in America, Rourke bought NBA League Pass, so he could watch the Toronto Raptors' run to an NBA championship. Rourke's sports hero remains Terry Fox, the Canadian who ran a marathon 143 straight days in 1980 after having his right leg amputated due to cancer.\"I'm very proud to be Canadian,\" said the Indiana star quarterback, who grew up in Oakville, Ontario, and attended all but one year of high school there. \"I don't shy away from talking about it, talking about where I'm from and where I was raised because that really shaped me into who I am.\"Rourke, who propelled the Hoosiers to a school-record 11 wins during the regular season, will lead Indiana into its biggest game in program history Friday night. The Hoosiers, picked to finish 17th out of 18 schools in the Big Ten's preseason poll, face Notre Dame (8 p.m. ET, ABC/ESPN) in the first round of the College Football Playoff.Rourke won't just be playing for the Hoosiers. He'll be representing an entire country. No quarterback of Canadian origin has played in a college football game of this magnitude. That includes Rourke's older brother Nathan, who quarterbacked Ohio University to three straight bowl wins and now starts for the Canadian Football League's BC Lions.\"I hope Kurtis understands how many people here are rooting for him,\" Nathan said. \"Hopefully, he'll feel that.\"This millennium, Kurtis Rourke is one of only three Canadian quarterbacks to start at the Power 4 level, according to ESPN Research, joining Christian Veilleux (Pittsburgh) and Jesse Palmer (Florida).Veilleux is from Ottawa but played high school ball in Maryland. He started his career at Penn State before transferring to Pitt. He now plays for Georgia State. Palmer, an ESPN college football analyst (and host of \"The Bachelor\"), played 27 games with 14 starts for former Gators coach Steve Spurrier from 1997 to 2000.Canadians at other positions who attended high school in their home country, like Carolina Panthers running back Chuba Hubbard, have enjoyed opportunities in ways Canadian quarterbacks never have. CFL rules that Canadian high schools employ -- a longer and wider field, 12 players on each side, unlimited motion -- have turned off American college football coaches from pursuing Canadian high school passers.\"If you're athletic and you're big and you're strong and can bench a lot and run a good 40 time, you can be coached on the intricacy of playing those [non-QB] positions,\" Palmer said. \"But for a long time, with the rules the way they are, the stigma was, you can't dedicate the development time [for quarterbacks]. Kurtis' success is removing that stigma ... and that's going to provide Canadian quarterbacks with more opportunities south of the border.\"Rourke is also giving \"The Great White North\" a college football player and team to pull for. College football remains a niche sport in Canada. Ice hockey, basketball, soccer and pro football reign over all else.Dave Naylor has covered football in Canada for more than three decades and now works for TSN, Canada's largest sports TV channel. He said Rourke is already a household name there due to Nathan's CFL success. But Naylor added that Kurtis could become one of the biggest stories in the country if Indiana knocks off the Fighting Irish to keep its magical season rolling.\"When Canadians see something Canadian blow up in the American media, that's their signal to pay attention ... it gets people here excited,\" said Naylor, who will be in South Bend reporting from the game. \"And as well as opening up the eyes to American coaches with what Kurtis Rourke is doing, there's all these little Kurtis Rourkes across Canada that are going to see this. That's significant.\"AS A CHILD, Nathan found his dad's old VHS highlight tape of the Green Bay Packers' 1996-97 Super Bowl-winning team. Immediately, he was mesmerized.\"My mom only allowed us to have an hour of TV growing up,\" Nathan said. \"That was what I wanted to watch instead of like cartoons. I just wanted to be Brett Favre.\"Kurtis just wanted to do whatever his brother was doing. So when Nathan was 7 and Kurtis was 5, they both started playing football.\"I developed a love and passion myself,\" Kurtis said. \"But it definitely got started with Nathan.\"That passion stuck for both. Andrew Saulez, a teacher and basketball coach at Holy Trinity Catholic Secondary School, where the Rourkes attended, remembered them always asking if they could watch game film if they completed their classwork.\"And as soon as they finished, they'd be breaking down game film,\" Saulez said. \"They were students of the game. They fell in love with getting better and the grind.\"Nathan quicky became a star quarterback for Holy Trinity. He soon realized the grind was different in the States, though. Hoping to catch the attention of college football coaches, he began attending American camps the summer before his junior season.\"You could see the gap, in terms of the development and how far I was behind some of these guys,\" he said. \"I saw the separation. They were just a lot better. And because I was from Canada, I wasn't going to get recruited at really any type of level.\"But Justin Dillon, who operates 730 Scouting, which helps Canadian high school football players relocate to America to compete for college scholarships, saw potential in Nathan. Before Nathan's senior year, Dillon told him he could help facilitate a transfer to Edgewood Academy (Elmore, Alabama), which needed a quarterback.\"The weird thing is, I've never met [Dillon], money was never exchanged,\" Nathan recalled. \"He just wanted to help. But to this day, I couldn't pick him out of a crowd.\"Arrangements were made for Nathan to live with a host family. Yet two weeks before Nathan was set to move, that host family canceled. So Kurtis and his mom uprooted their lives to relocate with Nathan to Alabama instead.For Nathan, it was a dream opportunity. He led Edgewood to a state championship. For Kurtis, moving a thousand miles away during his sophomore year proved miserable.\"I knew how much it meant to Nathan,\" Kurtis said. \"But it was still a really tough time because I didn't really have any friends. I was just trying to survive.\"The culture shock didn't make it easier. Kurtis couldn't understand why players wore jerseys to school on game days. He was also just 5-foot-5 then, leaving him a benchwarmer on the football and basketball teams.But their move to Alabama eventually opened a door for Nathan. Later, it would open one for Kurtis, too.NATHAN THREW 59 touchdowns with only three interceptions during his lone season at Edgewood. Still, signing day came and went without any FBS scholarship offers.\"It was crushing,\" he said. \"My family had upended their lives to come and support me in this last-ditch effort to try and get into a Division I school and get a scholarship.\"But Nathan didn't give up. He enrolled at Fort Scott Community College and won a starting job. After earning all-conference honors, he finally got two offers, from Akron and Ohio, where he started three seasons and broke a school record for career passing efficiency.Kurtis, meanwhile, moved back home for his high school junior year.\"When he came back to us, he was 7 inches taller and 40 pounds bigger,\" said Holy Trinity football coach Joe Moscato.Kurtis kept growing. As a senior, he led Holy Trinity to a regional championship. But he faced the same obstacles getting noticed in America that his brother had. So Kurtis stayed in high school for the 13th grade, often utilized by students in Canada.Ohio quarterbacks coach Scott Isphording remembered Kurtis visiting Athens to watch Nathan play. Even though Nathan had become an All-MAC quarterback, Isphording initially had doubts about Kurtis, especially because of the competition he faced in Canada. But each time Isphording saw him, Kurtis seemed to be an inch taller. Finally, Isphording traveled north to scout Kurtis.\"The first throw was a thing of beauty,\" Isphording recalled. \"Just wow, where did that come from?\"Still, nobody else showed much interest, outside Buffalo offensive coordinator Andy Kotelnicki, who's now Penn State's playcaller. But the Bulls remained skeptical. With Nathan stumping for him, Ohio eventually offered Kurtis a scholarship.\"They only knew who I was because of Nathan,\" said Kurtis, who from the time he moved to Alabama to when he enrolled at Ohio had grown nearly a full foot.After backing up his brother for one season, Kurtis succeeded him as Ohio's starter. In 2022, he was named MAC Player of the Year after leading the league with 3,257 passing yards and 25 touchdowns.This past offseason, he entered the transfer portal and coach Curt Cignetti brought him to Indiana, where he emerged into one of the top passers in the country, ranking third nationally only behind Heisman finalists Cam Ward and Dillon Gabriel in QBR (85.7).\"I owe a lot to Nathan,\" Kurtis said. \"We've done a lot for each other. I'm just grateful for the opportunity to support him in Alabama. It ultimately led to where I am, truly.\"PALMER'S FATHER, BILL, played for the CFL's Ottawa Rough Riders. But Palmer discovered college football in America through card collecting. NFL players would have their alma maters printed on the back of trading cards.Palmer later bought college football magazines, including one featuring former Florida quarterback Shane Matthews on its cover. A local Ottawa store sold college gear. Palmer visited often. At one point, he even owned an Indiana Hoosiers hat.\"That's how hardcore I was,\" he said. \"I really got into it.\"Like the Rourkes, Palmer dreamed of playing college football. He dubbed his high school highlights on VHS tapes and sent them to the top passing schools in the country. The first coach to reach out was Nick Saban, who then was at Michigan State. But Palmer committed to the Gators a week after getting a call from Spurrier.After arriving in Gainesville, Palmer quickly realized how different American football would be.\"During a goal-line drill, we were trying to throw a football into the end zone,\" he said. \"It was like I was playing in a closet.\"At Ohio, Kurtis initially struggled adjusting to American rules, as well. In Canada, the game goes on for one more play after the clock strikes zero. In America, the game's over.\"The first time we were doing a two-minute drill here, Kurtis wasn't aware of that,\" Isphording said. \"I said, 'Kurtis, when the clock hits triple zeroes, that's the game.'\"Larry Jusdanis is believed to be the first Canadian university quarterback invited to the NFL combine. He played in the CFL from 1995 to 1998 and knows well the hurdles Canadian quarterbacks face on either side of the border. The CFL mandates that 21 of 45 players on a roster be Canadians. But until 2020, that designation didn't apply to the starting quarterback, leaving CFL teams with little incentive to play a Canadian quarterback over an American.\"It was rare for a [CFL team] to go get a Canadian quarterback and develop him,\" Jusdanis said, \"because they could go to the U.S. and get one that's played football since age 6 or 7.\"To help Canadians develop in Canada and still get noticed while acclimating to American football, Jusdanis launched Clarkson Football North in 2016. The Mississauga, Ontario, school is Canada's version of IMG Academy, the Florida prep school that prepares athletes to play in college. Football North schedules several high school powerhouses in the States, including Ohio's Massillon Washington, St. Ignatius and St. Edward this past season. Jusdanis noted his school has now produced roughly 60 FBS players, including Ohio sophomore quarterback Callum Wither.Jusdanis said the Rourkes are \"breaking down barriers\" for future Canadian quarterbacks, both in college football, CFL and, potentially, the NFL, too.play0:30ESPN original trailer: 'Inside the College Football Playoff'Check out the trailer for ESPN's original series \"Inside the College Football Playoff.\"Off his breakout season with BC in 2022, when he threw for 3,349 yards and totaled 32 touchdowns, Nathan is now the highest-paid player in the CFL ($749,200). Kurtis could earn way more if he makes it in the NFL. ESPN Football analyst Mel Kiper currently ranks him as the No. 6 quarterback for the upcoming NFL draft.\"Nathan became a big, big deal in this country. ... because it's been so rare for a Canadian to start at quarterback in the CFL,\" Naylor said. \"Now Kurtis [in the playoff] is taking another chip off the rock, that long-running narrative these guys can't play.\"Murray Drinkwalter has officiated high school football in Ontario for more than four decades. The Rourkes are two of the best quarterbacks he's ever seen in person.\"But there've been some other great Canadian quarterbacks that never had a shot down south,\" Drinkwalter said. \"You'd be surprised by the amount of people up here that are following Indiana football.\"The Rourke brothers said they want to inspire young Canadians to play quarterback. And they're hoping their success will clear the way for future Canadian quarterbacks, who won't have to jump through the hoops they did.\"I have tremendous pride in where I'm from,\" Nathan said. \"And it's been awesome to watch Kurtis. I'm super proud of him, not just as a brother, but as a fellow Canadian.\"Kurtis knows his brother won't be the only Canadian watching him play in South Bend.\"I know there haven't been too many opportunities for Canadians like this,\" he said. \"It won't be front of mind. But it's definitely in the back of my mind -- that I'm doing this for Canada.\"",
  "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1219%2Fr1429919_1296x729_16%2D9.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cul\u003e\u003cli\u003e\u003cp\u003e\u003cimg src=\"https://a.espncdn.com/combiner/i?img=/i/columnists/full/trotter_jake.png\u0026amp;h=80\u0026amp;w=80\u0026amp;scale=crop\" alt=\"\" width=\"40\" height=\"40\"/\u003e\u003c/p\u003e\u003cp\u003eJake Trotter, ESPN Senior Writer\u003cspan\u003eDec 20, 2024, 07:00 AM ET\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"#\"\u003eClose\u003c/a\u003e\u003c/p\u003e\u003cul\u003eJake Trotter covers college football for ESPN. He joined ESPN in 2011. Before that, he worked at The Oklahoman, Austin American-Statesman and Middletown (Ohio) Journal newspapers. You can follow him @Jake_Trotter.\u003c/ul\u003e\u003c/div\u003e\u003c/li\u003e\u003c/ul\u003e\u003c/div\u003e\u003cp\u003e\u003cstrong\u003eKURTIS ROURKE\u0026#39;S GO-TO\u003c/strong\u003e shirt around the \u003ca href=\"https://www.espn.com/college-football/team/_/id/84/indiana-hoosiers\"\u003eIndiana\u003c/a\u003e football facility reads, \u0026#34;BRING YOUR EH GAME,\u0026#34; featuring the red and white Canadian maple leaf flag. In 2019, his first year of college in America, Rourke bought NBA League Pass, so he could watch the \u003ca data-clubhouse-guid=\"5a9c33b8-63fd-ff34-a833-925fe89320a6\" href=\"https://www.espn.com/nba/team/_/name/tor/toronto-raptors\"\u003eToronto Raptors\u003c/a\u003e\u0026#39; run to an NBA championship. Rourke\u0026#39;s sports hero remains Terry Fox, the Canadian who ran a marathon 143 straight days in 1980 after having his right leg amputated due to cancer.\u003c/p\u003e\u003cp\u003e\u0026#34;I\u0026#39;m very proud to be Canadian,\u0026#34; said the Indiana star quarterback, who grew up in Oakville, Ontario, and attended all but one year of high school there. \u0026#34;I don\u0026#39;t shy away from talking about it, talking about where I\u0026#39;m from and where I was raised because that really shaped me into who I am.\u0026#34;\u003c/p\u003e\u003cp\u003eRourke, who propelled the Hoosiers to a school-record 11 wins during the regular season, will lead Indiana into its biggest game in program history Friday night. The Hoosiers, picked to finish 17th out of 18 schools in the Big Ten\u0026#39;s preseason poll, face \u003ca href=\"https://www.espn.com/college-football/team/_/id/87/notre-dame-fighting-irish\"\u003eNotre Dame\u003c/a\u003e (\u003ca href=\"https://www.espn.com/college-football/game/_/gameId/401677179/indiana-notre-dame\"\u003e8 p.m. ET, ABC/ESPN\u003c/a\u003e) in the first round of the College Football Playoff.\u003c/p\u003e\u003cp\u003eRourke won\u0026#39;t just be playing for the Hoosiers. He\u0026#39;ll be representing an entire country. No quarterback of Canadian origin has played in a college football game of this magnitude. That includes Rourke\u0026#39;s older brother Nathan, who quarterbacked Ohio University to three straight bowl wins and now starts for the Canadian Football League\u0026#39;s BC Lions.\u003c/p\u003e\u003cp\u003e\u0026#34;I hope Kurtis understands how many people here are rooting for him,\u0026#34; Nathan said. \u0026#34;Hopefully, he\u0026#39;ll feel that.\u0026#34;\u003c/p\u003e\u003cp\u003eThis millennium, \u003ca data-player-guid=\"90eff2c3-0547-4ce3-bfc4-41777479b5c8\" href=\"https://www.espn.com/college-football/player/_/id/4430431/kurtis-rourke\"\u003eKurtis Rourke\u003c/a\u003e is one of only three Canadian quarterbacks to start at the Power 4 level, according to ESPN Research, joining \u003ca data-player-guid=\"0fad9d6a-b827-3877-ace7-02ca509a449c\" href=\"https://www.espn.com/college-football/player/_/id/4432612/christian-veilleux\"\u003eChristian Veilleux\u003c/a\u003e (Pittsburgh) and Jesse Palmer (Florida).\u003c/p\u003e\u003cp\u003eVeilleux is from Ottawa but played high school ball in Maryland. He started his career at Penn State before transferring to Pitt. He now plays for Georgia State. Palmer, an ESPN college football analyst (and host of \u0026#34;The Bachelor\u0026#34;), played 27 games with 14 starts for former Gators coach Steve Spurrier from 1997 to 2000.\u003c/p\u003e\u003cp\u003eCanadians at other positions who attended high school in their home country, like \u003ca data-clubhouse-guid=\"647c27bf-ab86-550e-5b83-91c29e73e4a9\" href=\"https://www.espn.com/nfl/team/_/name/car/carolina-panthers\"\u003eCarolina Panthers\u003c/a\u003e running back \u003ca data-player-guid=\"7c6b0551-49b5-aa13-9e26-7db2f9dad46f\" href=\"https://www.espn.com/nfl/player/_/id/4241416/chuba-hubbard\"\u003eChuba Hubbard\u003c/a\u003e, have enjoyed opportunities in ways Canadian quarterbacks never have. CFL rules that Canadian high schools employ -- a longer and wider field, 12 players on each side, unlimited motion -- have turned off American college football coaches from pursuing Canadian high school passers.\u003c/p\u003e\u003cp\u003e\u0026#34;If you\u0026#39;re athletic and you\u0026#39;re big and you\u0026#39;re strong and can bench a lot and run a good 40 time, you can be coached on the intricacy of playing those [non-QB] positions,\u0026#34; Palmer said. \u0026#34;But for a long time, with the rules the way they are, the stigma was, you can\u0026#39;t dedicate the development time [for quarterbacks]. Kurtis\u0026#39; success is removing that stigma ... and that\u0026#39;s going to provide Canadian quarterbacks with more opportunities south of the border.\u0026#34;\u003c/p\u003e\u003cp\u003eRourke is also giving \u0026#34;The Great White North\u0026#34; a college football player and team to pull for. College football remains a niche sport in Canada. Ice hockey, basketball, soccer and pro football reign over all else.\u003c/p\u003e\u003cp\u003eDave Naylor has covered football in Canada for more than three decades and now works for TSN, Canada\u0026#39;s largest sports TV channel. He said Rourke is already a household name there due to Nathan\u0026#39;s CFL success. But Naylor added that Kurtis could become one of the biggest stories in the country if Indiana knocks off the Fighting Irish to keep its magical season rolling.\u003c/p\u003e\u003cp\u003e\u0026#34;When Canadians see something Canadian blow up in the American media, that\u0026#39;s their signal to pay attention ... it gets people here excited,\u0026#34; said Naylor, who will be in South Bend reporting from the game. \u0026#34;And as well as opening up the eyes to American coaches with what Kurtis Rourke is doing, there\u0026#39;s all these little Kurtis Rourkes across Canada that are going to see this. That\u0026#39;s significant.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eAS A CHILD\u003c/strong\u003e, Nathan found his dad\u0026#39;s old VHS highlight tape of the \u003ca data-clubhouse-guid=\"06cd3bcf-7a86-53d4-28e7-aa049dd36261\" href=\"https://www.espn.com/nfl/team/_/name/gb/green-bay-packers\"\u003eGreen Bay Packers\u003c/a\u003e\u0026#39; 1996-97 Super Bowl-winning team. Immediately, he was mesmerized.\u003c/p\u003e\u003cp\u003e\u0026#34;My mom only allowed us to have an hour of TV growing up,\u0026#34; Nathan said. \u0026#34;That was what I wanted to watch instead of like cartoons. I just wanted to be Brett Favre.\u0026#34;\u003c/p\u003e\u003cp\u003eKurtis just wanted to do whatever his brother was doing. So when Nathan was 7 and Kurtis was 5, they both started playing football.\u003c/p\u003e\u003cp\u003e\u0026#34;I developed a love and passion myself,\u0026#34; Kurtis said. \u0026#34;But it definitely got started with Nathan.\u0026#34;\u003c/p\u003e\u003cp\u003eThat passion stuck for both. Andrew Saulez, a teacher and basketball coach at Holy Trinity Catholic Secondary School, where the Rourkes attended, remembered them always asking if they could watch game film if they completed their classwork.\u003c/p\u003e\u003cp\u003e\u0026#34;And as soon as they finished, they\u0026#39;d be breaking down game film,\u0026#34; Saulez said. \u0026#34;They were students of the game. They fell in love with getting better and the grind.\u0026#34;\u003c/p\u003e\u003cp\u003eNathan quicky became a star quarterback for Holy Trinity. He soon realized the grind was different in the States, though. Hoping to catch the attention of college football coaches, he began attending American camps the summer before his junior season.\u003c/p\u003e\u003cp\u003e\u0026#34;You could see the gap, in terms of the development and how far I was behind some of these guys,\u0026#34; he said. \u0026#34;I saw the separation. They were just a lot better. And because I was from Canada, I wasn\u0026#39;t going to get recruited at really any type of level.\u0026#34;\u003c/p\u003e\u003cp\u003eBut Justin Dillon, who operates 730 Scouting, which helps Canadian high school football players relocate to America to compete for college scholarships, saw potential in Nathan. Before Nathan\u0026#39;s senior year, Dillon told him he could help facilitate a transfer to Edgewood Academy (Elmore, Alabama), which needed a quarterback.\u003c/p\u003e\u003cp\u003e\u0026#34;The weird thing is, I\u0026#39;ve never met [Dillon], money was never exchanged,\u0026#34; Nathan recalled. \u0026#34;He just wanted to help. But to this day, I couldn\u0026#39;t pick him out of a crowd.\u0026#34;\u003c/p\u003e\u003cp\u003eArrangements were made for Nathan to live with a host family. Yet two weeks before Nathan was set to move, that host family canceled. So Kurtis and his mom uprooted their lives to relocate with Nathan to Alabama instead.\u003c/p\u003e\u003cp\u003eFor Nathan, it was a dream opportunity. He led Edgewood to a state championship. For Kurtis, moving a thousand miles away during his sophomore year proved miserable.\u003c/p\u003e\u003cp\u003e\u0026#34;I knew how much it meant to Nathan,\u0026#34; Kurtis said. \u0026#34;But it was still a really tough time because I didn\u0026#39;t really have any friends. I was just trying to survive.\u0026#34;\u003c/p\u003e\u003cp\u003eThe culture shock didn\u0026#39;t make it easier. Kurtis couldn\u0026#39;t understand why players wore jerseys to school on game days. He was also just 5-foot-5 then, leaving him a benchwarmer on the football and basketball teams.\u003c/p\u003e\u003cp\u003eBut their move to Alabama eventually opened a door for Nathan. Later, it would open one for Kurtis, too.\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003eNATHAN THREW 59\u003c/strong\u003e touchdowns with only three interceptions during his lone season at Edgewood. Still, signing day came and went without any FBS scholarship offers.\u003c/p\u003e\u003cp\u003e\u0026#34;It was crushing,\u0026#34; he said. \u0026#34;My family had upended their lives to come and support me in this last-ditch effort to try and get into a Division I school and get a scholarship.\u0026#34;\u003c/p\u003e\u003cp\u003eBut Nathan didn\u0026#39;t give up. He enrolled at Fort Scott Community College and won a starting job. After earning all-conference honors, he finally got two offers, from Akron and Ohio, where he started three seasons and broke a school record for career passing efficiency.\u003c/p\u003e\u003cp\u003eKurtis, meanwhile, moved back home for his high school junior year.\u003c/p\u003e\u003cp\u003e\u0026#34;When he came back to us, he was 7 inches taller and 40 pounds bigger,\u0026#34; said Holy Trinity football coach Joe Moscato.\u003c/p\u003e\u003cp\u003eKurtis kept growing. As a senior, he led Holy Trinity to a regional championship. But he faced the same obstacles getting noticed in America that his brother had. So Kurtis stayed in high school for the 13th grade, often utilized by students in Canada.\u003c/p\u003e\u003cp\u003eOhio quarterbacks coach Scott Isphording remembered Kurtis visiting Athens to watch Nathan play. Even though Nathan had become an All-MAC quarterback, Isphording initially had doubts about Kurtis, especially because of the competition he faced in Canada. But each time Isphording saw him, Kurtis seemed to be an inch taller. Finally, Isphording traveled north to scout Kurtis.\u003c/p\u003e\u003cp\u003e\u0026#34;The first throw was a thing of beauty,\u0026#34; Isphording recalled. \u0026#34;Just wow, where did that come from?\u0026#34;\u003c/p\u003e\u003cp\u003eStill, nobody else showed much interest, outside Buffalo offensive coordinator Andy Kotelnicki, who\u0026#39;s now Penn State\u0026#39;s playcaller. But the Bulls remained skeptical. With Nathan stumping for him, Ohio eventually offered Kurtis a scholarship.\u003c/p\u003e\u003cp\u003e\u0026#34;They only knew who I was because of Nathan,\u0026#34; said Kurtis, who from the time he moved to Alabama to when he enrolled at Ohio had grown nearly a full foot.\u003c/p\u003e\u003cp\u003eAfter backing up his brother for one season, Kurtis succeeded him as Ohio\u0026#39;s starter. In 2022, he was named MAC Player of the Year after leading the league with 3,257 passing yards and 25 touchdowns.\u003c/p\u003e\u003cp\u003eThis past offseason, he entered the transfer portal and coach Curt Cignetti brought him to Indiana, where he emerged into one of the top passers in the country, ranking third nationally only behind Heisman finalists \u003ca data-player-guid=\"9f4e87b5-5da8-38c0-9951-e3496b55b3c8\" href=\"http://www.espn.com/college-football/player/_/id/4688380/cam-ward\"\u003eCam Ward\u003c/a\u003e and \u003ca data-player-guid=\"2126efde-bc9b-0168-dd5a-49fe11331807\" href=\"https://www.espn.com/college-football/player/_/id/4427238/dillon-gabriel\"\u003eDillon Gabriel\u003c/a\u003e in QBR (85.7).\u003c/p\u003e\u003cp\u003e\u0026#34;I owe a lot to Nathan,\u0026#34; Kurtis said. \u0026#34;We\u0026#39;ve done a lot for each other. I\u0026#39;m just grateful for the opportunity to support him in Alabama. It ultimately led to where I am, truly.\u0026#34;\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003cstrong\u003ePALMER\u0026#39;S FATHER, BILL\u003c/strong\u003e, played for the CFL\u0026#39;s Ottawa Rough Riders. But Palmer discovered college football in America through card collecting. NFL players would have their alma maters printed on the back of trading cards.\u003c/p\u003e\u003cp\u003ePalmer later bought college football magazines, including one featuring former Florida quarterback Shane Matthews on its cover. A local Ottawa store sold college gear. Palmer visited often. At one point, he even owned an \u003ca data-clubhouse-guid=\"bd06efe1-3050-2356-37c1-4b3fef1c29be\" href=\"https://www.espn.com/college-football/team/_/id/84/indiana-hoosiers\"\u003eIndiana Hoosiers\u003c/a\u003e hat.\u003c/p\u003e\u003cp\u003e\u0026#34;That\u0026#39;s how hardcore I was,\u0026#34; he said. \u0026#34;I really got into it.\u0026#34;\u003c/p\u003e\u003cp\u003eLike the Rourkes, Palmer dreamed of playing college football. He dubbed his high school highlights on VHS tapes and sent them to the top passing schools in the country. The first coach to reach out was Nick Saban, who then was at Michigan State. But Palmer committed to the Gators a week after getting a call from Spurrier.\u003c/p\u003e\u003cp\u003eAfter arriving in Gainesville, Palmer quickly realized how different American football would be.\u003c/p\u003e\u003cp\u003e\u0026#34;During a goal-line drill, we were trying to throw a football into the end zone,\u0026#34; he said. \u0026#34;It was like I was playing in a closet.\u0026#34;\u003c/p\u003e\u003cp\u003eAt Ohio, Kurtis initially struggled adjusting to American rules, as well. In Canada, the game goes on for one more play after the clock strikes zero. In America, the game\u0026#39;s over.\u003c/p\u003e\u003cp\u003e\u0026#34;The first time we were doing a two-minute drill here, Kurtis wasn\u0026#39;t aware of that,\u0026#34; Isphording said. \u0026#34;I said, \u0026#39;Kurtis, when the clock hits triple zeroes, that\u0026#39;s the game.\u0026#39;\u0026#34;\u003c/p\u003e\u003cp\u003eLarry Jusdanis is believed to be the first Canadian university quarterback invited to the NFL combine. He played in the CFL from 1995 to 1998 and knows well the hurdles Canadian quarterbacks face on either side of the border. The CFL mandates that 21 of 45 players on a roster be Canadians. But until 2020, that designation didn\u0026#39;t apply to the starting quarterback, leaving CFL teams with little incentive to play a Canadian quarterback over an American.\u003c/p\u003e\u003cp\u003e\u0026#34;It was rare for a [CFL team] to go get a Canadian quarterback and develop him,\u0026#34; Jusdanis said, \u0026#34;because they could go to the U.S. and get one that\u0026#39;s played football since age 6 or 7.\u0026#34;\u003c/p\u003e\u003cp\u003eTo help Canadians develop in Canada and still get noticed while acclimating to American football, Jusdanis launched Clarkson Football North in 2016. The Mississauga, Ontario, school is Canada\u0026#39;s version of IMG Academy, the Florida prep school that prepares athletes to play in college. Football North schedules several high school powerhouses in the States, including Ohio\u0026#39;s Massillon Washington, St. Ignatius and St. Edward this past season. Jusdanis noted his school has now produced roughly 60 FBS players, including Ohio sophomore quarterback \u003ca data-player-guid=\"cbfb425b-b401-340a-84b6-ce22d16f64b7\" href=\"https://www.espn.com/college-football/player/_/id/4879824/callum-wither\"\u003eCallum Wither\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eJusdanis said the Rourkes are \u0026#34;breaking down barriers\u0026#34; for future Canadian quarterbacks, both in college football, CFL and, potentially, the NFL, too.\u003c/p\u003e\u003cdiv data-behavior=\"video_scroll\"\u003e\u003cfigure data-video=\"watch,640,360,42916057\" data-cerebro-id=\"6759fb44a122494e1de1acb7\" data-title=\"ESPN original trailer: \u0026#39;Inside the College Football Playoff\u0026#39;\" data-source=\"espn\"\u003e\u003cpicture\u003e\u003csource data-srcset=\"https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2024%2F1211%2Fdm_241211_Inside_the_College_Football_Playoff_trailer%2Fdm_241211_Inside_the_College_Football_Playoff_trailer.jpg\u0026amp;w=640\u0026amp;h=360\u0026amp;cquality=80\u0026amp;format=jpg\" media=\"(min-width: 376px)\"/\u003e\u003csource data-srcset=\"https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2024%2F1211%2Fdm_241211_Inside_the_College_Football_Playoff_trailer%2Fdm_241211_Inside_the_College_Football_Playoff_trailer.jpg\u0026amp;w=335\u0026amp;cquality=80, https://a4.espncdn.com/combiner/i?img=%2Fmedia%2Fmotion%2F2024%2F1211%2Fdm_241211_Inside_the_College_Football_Playoff_trailer%2Fdm_241211_Inside_the_College_Football_Playoff_trailer.jpg\u0026amp;w=670\u0026amp;cquality=40\u0026amp;format=jpg 2x\" media=\"(max-width: 375px)\"/\u003e\u003c/picture\u003e\u003cspan data-id=\"42916057\"\u003eplay\u003c/span\u003e\u003cfigcaption\u003e\u003cp\u003e0:30\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003eESPN original trailer: \u0026#39;Inside the College Football Playoff\u0026#39;\u003c/p\u003e\u003cp\u003eCheck out the trailer for ESPN\u0026#39;s original series \u0026#34;Inside the College Football Playoff.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cp\u003eOff his breakout season with BC in 2022, when he threw for 3,349 yards and totaled 32 touchdowns, Nathan is now the highest-paid player in the CFL (\u003ca href=\"https://3downnation.com/2024/08/13/canadian-nathan-rourke-blows-up-cfl-qb-market-with-b-c-lions-contract-following-nfl-stint/\"\u003e$749,200\u003c/a\u003e). Kurtis could earn way more if he makes it in the NFL. ESPN Football analyst Mel Kiper currently ranks him as the No. 6 quarterback for the upcoming NFL draft.\u003c/p\u003e\u003cp\u003e\u0026#34;Nathan became a big, big deal in this country. ... because it\u0026#39;s been so rare for a Canadian to start at quarterback in the CFL,\u0026#34; Naylor said. \u0026#34;Now Kurtis [in the playoff] is taking another chip off the rock, that long-running narrative these guys can\u0026#39;t play.\u0026#34;\u003c/p\u003e\u003cp\u003eMurray Drinkwalter has officiated high school football in Ontario for more than four decades. The Rourkes are two of the best quarterbacks he\u0026#39;s ever seen in person.\u003c/p\u003e\u003cp\u003e\u0026#34;But there\u0026#39;ve been some other great Canadian quarterbacks that never had a shot down south,\u0026#34; Drinkwalter said. \u0026#34;You\u0026#39;d be surprised by the amount of people up here that are following Indiana football.\u0026#34;\u003c/p\u003e\u003cp\u003eThe Rourke brothers said they want to inspire young Canadians to play quarterback. And they\u0026#39;re hoping their success will clear the way for future Canadian quarterbacks, who won\u0026#39;t have to jump through the hoops they did.\u003c/p\u003e\u003cp\u003e\u0026#34;I have tremendous pride in where I\u0026#39;m from,\u0026#34; Nathan said. \u0026#34;And it\u0026#39;s been awesome to watch Kurtis. I\u0026#39;m super proud of him, not just as a brother, but as a fellow Canadian.\u0026#34;\u003c/p\u003e\u003cp\u003eKurtis knows his brother won\u0026#39;t be the only Canadian watching him play in South Bend.\u003c/p\u003e\u003cp\u003e\u0026#34;I know there haven\u0026#39;t been too many opportunities for Canadians like this,\u0026#34; he said. \u0026#34;It won\u0026#39;t be front of mind. But it\u0026#39;s definitely in the back of my mind -- that I\u0026#39;m doing this for Canada.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2024-12-20T12:00:00Z",
  "modifiedTime": null
}
