{
  "id": "0cb37511-8c43-47d3-b0e1-5198bae25262",
  "title": "Salzburg 1-4 Atletico Madrid: Griezmann brace leads visitors to top eight finish",
  "link": "https://www.soccernews.com/salzburg-1-4-atletico-madrid-griezmann-brace-leads-visitors-to-top-eight-finish/381243/",
  "description": "Antoine Griezmann’s brace ensured Atletico Madrid’s place in the Champions League last 16 as they thrashed RB Salzburg 4-1 to finish fifth in the 36-team standings. Griezmann’s heroics have set up a potential clash in the next round against either Celtic, Manchester City, Real Madrid or Bayern Munich following Wednesday’s results. Atletico needed just five […] The post Salzburg 1-4 Atletico Madrid: Griezmann brace leads visitors to top eight finish appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Wed, 29 Jan 2025 23:07:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2201,
  "excerpt": "Antoine Griezmann’s brace ensured Atletico Madrid’s place in the Champions League last 16 as they thrashed RB Salzburg 4-1 to finish fifth in the 36-team standings. Griezmann’s heroics have set up a potential clash in the next round against either Celtic, Manchester City, Real Madrid or Bayern Munich following Wednesday’s results. Atletico needed just five […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Antoine Griezmann’s brace ensured Atletico Madrid’s place in the Champions League last 16 as they thrashed RB Salzburg 4-1 to finish fifth in the 36-team standings. Griezmann’s heroics have set up a potential clash in the next round against either Celtic, Manchester City, Real Madrid or Bayern Munich following Wednesday’s results. Atletico needed just five minutes to get up and running at the Red Bull Arena when Giuliano Simeone tucked home his first Champions League goal with his father and manager watching on. Simeone was instrumental again eight minutes later, sending in a teasing delivery that found Griezmann, who stroked the ball past Salzburg captain Alexander Schlager. Atletico’s French striker completed his brace in the first minute of first-half stoppage time to put the result beyond their lowly hosts with 45 minutes still to play. Marcos Llorente added further gloss to the scoreline just after the hour, rounding off a quick counter-attack led by Rodrigo De Paul with a fine finish. Salzburg, however, would take the shine off an otherwise impressive display from Diego Simeone’s side late on when Adam Daghim sent a brilliantly taken left-footed volley into the bottom corner. Data Debrief: Oh I do love playing away Atletico have made the Metropolitano Stadium a fortress across all competitions under Simeone, but have now been able to transfer that fear factor away from home in Europe. They have now won three consecutive away games in the European Cup / Champions League for the first time since the 1973-74 campaign (a run of three), with today just the fifth time they’ve scored four or more goals in an away match and the second time this season (also 6-0 v Sparta Prague in November). But their triumph was led by Greizmann, who netted just his second brace away from home for Atletico (out of nine overall), since a double against Galatasaray in September 2015. He has now scored more braces than any other player not to score a single hat-trick in the competition (nine). Salzburg, meanwhile, have now been eliminated in the group stage in six of their seven participations in the Champions League, the exception being 2021-22 when they reached the last 16.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eAntoine Griezmann’s brace ensured Atletico Madrid’s place in the Champions League last 16 as they thrashed RB Salzburg 4-1 to finish fifth in the 36-team standings. \u003c/p\u003e\n\u003cp\u003eGriezmann’s heroics have set up a potential clash in the next round against either Celtic, Manchester City, Real Madrid or Bayern Munich following Wednesday’s results. \u003c/p\u003e\n\u003cp\u003eAtletico needed just five minutes to get up and running at the Red Bull Arena when Giuliano Simeone tucked home his first Champions League goal with his father and manager watching on. \u003c/p\u003e\n\u003cp\u003eSimeone was instrumental again eight minutes later, sending in a teasing delivery that found Griezmann, who stroked the ball past Salzburg captain Alexander Schlager. \u003c/p\u003e\n\u003cp\u003eAtletico’s French striker completed his brace in the first minute of first-half stoppage time to put the result beyond their lowly hosts with 45 minutes still to play. \u003c/p\u003e\n\u003cp\u003eMarcos Llorente added further gloss to the scoreline just after the hour, rounding off a quick counter-attack led by Rodrigo De Paul with a fine finish. \u003c/p\u003e\n\u003cp\u003eSalzburg, however, would take the shine off an otherwise impressive display from Diego Simeone’s side late on when Adam Daghim sent a brilliantly taken left-footed volley into the bottom corner. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eData Debrief: Oh I do love playing away\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAtletico have made the Metropolitano Stadium a fortress across all competitions under Simeone, but have now been able to transfer that fear factor away from home in Europe. \u003c/p\u003e\n\u003cp\u003eThey have now won three consecutive away games in the European Cup / Champions League for the first time since the 1973-74 campaign (a run of three), with today just the fifth time they’ve scored four or more goals in an away match and the second time this season (also 6-0 v Sparta Prague in November).\u003c/p\u003e\n\u003cp\u003eBut their triumph was led by Greizmann, who netted just his second brace away from home for Atletico (out of nine overall), since a double against Galatasaray in September 2015. He has now scored more braces than any other player not to score a single hat-trick in the competition (nine).\u003c/p\u003e\n\u003cp\u003eSalzburg, meanwhile, have now been eliminated in the group stage in six of their seven participations in the Champions League, the exception being 2021-22 when they reached the last 16.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-01-29T23:07:00Z",
  "modifiedTime": null
}
