{
  "id": "2ea94297-2087-456b-b1fb-682629454e98",
  "title": "Amorim refusing to quit amid Man Utd struggles ahead of Chelsea trip",
  "link": "https://www.soccernews.com/amorim-refusing-to-quit-amid-man-utd-struggles-ahead-of-chelsea-trip/385488/",
  "description": "Ruben Amorim insists quitting is not an option with Manchester United but apportioned the responsibility for their struggles to himself ahead of Friday’s Premier League trip to Chelsea. United could be forgiven for having one eye on next Wednesday’s Europa League final against Tottenham, with the winner securing Champions League football next season. Europe has […] The post Amorim refusing to quit amid Man Utd struggles ahead of Chelsea trip appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Wed, 14 May 2025 23:55:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "English Premier League"
  ],
  "byline": "SoccerNews",
  "length": 4212,
  "excerpt": "Ruben Amorim insists quitting is not an option with Manchester United but apportioned the responsibility for their struggles to himself ahead of Friday’s Premier League trip to Chelsea. United could be forgiven for having one eye on next Wednesday’s Europa League final against Tottenham, with the winner securing Champions League football next season. Europe has […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Ruben Amorim insists quitting is not an option with Manchester United but apportioned the responsibility for their struggles to himself ahead of Friday’s Premier League trip to Chelsea. United could be forgiven for having one eye on next Wednesday’s Europa League final against Tottenham, with the winner securing Champions League football next season. Europe has provided a welcome distraction for Amorim, whose side are 16th in the table and just a point and a place better off than their final opponents Spurs. The Premier League has been less forgiving, however, with United winless in their last seven top-flight games amid another torrid campaign. Amorim says he is in the fight for the long-term battle, though. “I am far from quitting,” Amorim said on Wednesday when resignation was put towards him in his press conference. “What I am saying is that since I arrived here I am always talking about the standards. I cannot see the team having these results, especially in the Premier League, and not say something and take responsibility. “I have a clear plan of what to do. I understand the problems of the team.” Who remembers this strike? Ahead of our final away day of the 2024/25 #PL season, watch our top 20 away limbs #MUFC — Manchester United (@ManUtd) May 13, 2025 A trip to Stamford Bridge could make it eight league games without victory, and Amorim acknowledged the threat their drab form could put on his tenure at Old Trafford. “We need to perform or else they [Man Utd’s board] will change us. That is a normal thing. That was my feeling, and it’s still my feeling today,” he continued. “I’m the manager of this big club. Even if it’s a pre-season match, we need to win.” A desire to win may be music to the ears of Chelsea’s fellow top-five contenders, with Enzo Maresca’s side sitting fifth but level on points with sixth-placed Aston Villa heading into the penultimate matchday. Nottingham Forest are also only a point back from Chelsea, who had Nicolas Jackson sent off in a 2-0 defeat to Newcastle United last time out that ended the Blues’ three-game winning run in the competition. PLAYERS TO WATCH Chelsea – Cole Palmer Cole Palmer has scored four goals in his three Premier League games against United for Chelsea, including a hat-trick in this exact fixture last season. No Chelsea player has scored more against United in the competition (Eidur Gudjohnsen also four), and Palmer will head into this game with confidence, having scored at Stamford Bridge in his last home league outing against Liverpool. Manchester United – Bruno Fernandes Only Mohamed Salah (56) has been involved in more goals than Bruno Fernandes (36 – 19 goals, 17 assists) in all competitions among Premier League players this season. However, less than half of these have come in the Premier League (17 – eight goals, nine assists) – will Amorim be tempted to rest his captain on Friday? Leading the way #MUFC pic.twitter.com/9DpyfvnRE1 — Manchester United (@ManUtd) May 13, 2025 MATCH PREDICTION – CHELSEA WIN Lowly United have been overlooked by the Opta supercomputer, owing to their drab form and Chelsea’s impressive head-to-head record in this fixture. Indeed, United have won just one of their last 11 Premier League away games against Chelsea (D5 L5), a 2-0 victory in February 2020 under Ole Gunnar Solskjaer. Chelsea are also unbeaten in all nine of their top-flight home games so far in 2025 (W7 D2), earning the joint-most points (23) and conceding the fewest goals (7) at home of any Premier League side this calendar year. That is in stark contrast to United, whose seven-game winless run in the competition marks their longest such streak since going 11 without victory between December 1989 and February 1990. Maresca will be hopeful of a strong finish at Stamford Bridge, too, given Chelsea have not lost their final home league game in any of the last 22 seasons (W15 D7), since a 3-1 defeat to Villa in 2001-02. A Chelsea win looks likely in that case, though they have won just one of their last 14 Premier League games against United (D8 L5). That was a 4-3 victory in this exact fixture last season. OPTA WIN PROBABILITY Chelsea win – 65.9% Draw – 18.4% Manchester United win – 15.7%",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eRuben Amorim insists quitting is not an option with Manchester United but apportioned the responsibility for their struggles to himself ahead of Friday’s Premier League trip to Chelsea.\u003c/p\u003e\n\u003cp\u003eUnited could be forgiven for having one eye on next Wednesday’s Europa League final against Tottenham, with the winner securing Champions League football next season.\u003c/p\u003e\n\u003cp\u003eEurope has provided a welcome distraction for Amorim, whose side are 16th in the table and just a point and a place better off than their final opponents Spurs.\u003c/p\u003e\n\u003cp\u003eThe Premier League has been less forgiving, however, with United winless in their last seven top-flight games amid another torrid campaign.\u003c/p\u003e\n\u003cp\u003eAmorim says he is in the fight for the long-term battle, though.\u003c/p\u003e\n\u003cp\u003e“I am far from quitting,” Amorim said on Wednesday when resignation was put towards him in his press conference.\u003c/p\u003e\n\u003cp\u003e“What I am saying is that since I arrived here I am always talking about the standards. I cannot see the team having these results, especially in the Premier League, and not say something and take responsibility.\u003c/p\u003e\n\u003cp\u003e“I have a clear plan of what to do. I understand the problems of the team.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eWho remembers this strike?\u003c/p\u003e\n\u003cp\u003eAhead of our final away day of the 2024/25 \u003ca href=\"https://twitter.com/hashtag/PL?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#PL\u003c/a\u003e season, watch our top 20 away limbs \u003ca href=\"https://twitter.com/hashtag/MUFC?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#MUFC\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Manchester United (@ManUtd) \u003ca href=\"https://twitter.com/ManUtd/status/1922359438091944092?ref_src=twsrc%5Etfw\"\u003eMay 13, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eA trip to Stamford Bridge could make it eight league games without victory, and Amorim acknowledged the threat their drab form could put on his tenure at Old Trafford.\u003c/p\u003e\n\u003cp\u003e“We need to perform or else they [Man Utd’s board] will change us. That is a normal thing. That was my feeling, and it’s still my feeling today,” he continued.\u003c/p\u003e\n\u003cp\u003e“I’m the manager of this big club. Even if it’s a pre-season match, we need to win.”\u003c/p\u003e\n\u003cp\u003eA desire to win may be music to the ears of Chelsea’s fellow top-five contenders, with Enzo Maresca’s side sitting fifth but level on points with sixth-placed Aston Villa heading into the penultimate matchday.\u003c/p\u003e\n\u003cp\u003eNottingham Forest are also only a point back from Chelsea, who had Nicolas Jackson sent off in a 2-0 defeat to Newcastle United last time out that ended the Blues’ three-game winning run in the competition.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePLAYERS TO WATCH\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eChelsea – Cole Palmer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCole Palmer has scored four goals in his three Premier League games against United for Chelsea, including a hat-trick in this exact fixture last season.\u003c/p\u003e\n\u003cp\u003eNo Chelsea player has scored more against United in the competition (Eidur Gudjohnsen also four), and Palmer will head into this game with confidence, having scored at Stamford Bridge in his last home league outing against Liverpool.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eManchester United – Bruno Fernandes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOnly Mohamed Salah (56) has been involved in more goals than Bruno Fernandes (36 – 19 goals, 17 assists) in all competitions among Premier League players this season.\u003c/p\u003e\n\u003cp\u003eHowever, less than half of these have come in the Premier League (17 – eight goals, nine assists) – will Amorim be tempted to rest his captain on Friday?\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eLeading the way \u003ca href=\"https://twitter.com/hashtag/MUFC?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#MUFC\u003c/a\u003e \u003ca href=\"https://t.co/9DpyfvnRE1\"\u003epic.twitter.com/9DpyfvnRE1\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Manchester United (@ManUtd) \u003ca href=\"https://twitter.com/ManUtd/status/1922394189599273063?ref_src=twsrc%5Etfw\"\u003eMay 13, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eMATCH PREDICTION – CHELSEA WIN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLowly United have been overlooked by the Opta supercomputer, owing to their drab form and Chelsea’s impressive head-to-head record in this fixture.\u003c/p\u003e\n\u003cp\u003eIndeed, United have won just one of their last 11 Premier League away games against Chelsea (D5 L5), a 2-0 victory in February 2020 under Ole Gunnar Solskjaer.\u003c/p\u003e\n\u003cp\u003eChelsea are also unbeaten in all nine of their top-flight home games so far in 2025 (W7 D2), earning the joint-most points (23) and conceding the fewest goals (7) at home of any Premier League side this calendar year.\u003c/p\u003e\n\u003cp\u003eThat is in stark contrast to United, whose seven-game winless run in the competition marks their longest such streak since going 11 without victory between December 1989 and February 1990.\u003c/p\u003e\n\u003cp\u003eMaresca will be hopeful of a strong finish at Stamford Bridge, too, given Chelsea have not lost their final home league game in any of the last 22 seasons (W15 D7), since a 3-1 defeat to Villa in 2001-02.\u003c/p\u003e\n\u003cp\u003eA Chelsea win looks likely in that case, though they have won just one of their last 14 Premier League games against United (D8 L5). That was a 4-3 victory in this exact fixture last season.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOPTA WIN PROBABILITY\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eChelsea win – 65.9%\u003c/p\u003e\n\u003cp\u003eDraw – 18.4%\u003c/p\u003e\n\u003cp\u003eManchester United win – 15.7%\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-05-14T23:55:00Z",
  "modifiedTime": null
}
