{
  "id": "39671ff1-fb87-44ed-9023-ed77664a3fb3",
  "title": "Ancelotti bracing for another ´nightmare´ clash with Man City",
  "link": "https://www.soccernews.com/ancelotti-bracing-for-another-nightmare-clash-with-man-city/381760/",
  "description": "Carlo Ancelotti described Real Madrid’s preparations for their Champions League play-off clash against Manchester City as a “nightmare”. Madrid square off against Pep Guardiola’s side at the Etihad Stadium on Tuesday, with the winners of the last three titles facing off for a fourth consecutive season. Indeed, this will be just the fourth fixture in […] The post Ancelotti bracing for another ´nightmare´ clash with Man City appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Mon, 10 Feb 2025 22:52:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2881,
  "excerpt": "Carlo Ancelotti described Real Madrid’s preparations for their Champions League play-off clash against Manchester City as a “nightmare”. Madrid square off against Pep Guardiola’s side at the Etihad Stadium on Tuesday, with the winners of the last three titles facing off for a fourth consecutive season. Indeed, this will be just the fourth fixture in […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Carlo Ancelotti described Real Madrid’s preparations for their Champions League play-off clash against Manchester City as a “nightmare”. Madrid square off against Pep Guardiola’s side at the Etihad Stadium on Tuesday, with the winners of the last three titles facing off for a fourth consecutive season. Indeed, this will be just the fourth fixture in European Cup / Champions League history to be played in four straight campaigns, after Deportivo de La Coruna v Juventus (four from 2000-01 to 2003-04), Chelsea v Liverpool (five from 2004-05 to 2008-09), and Atletico Madrid v Madrid (four from 2013-14 to 2016-17). Despite only losing three of their 12 games against them in the competition, the Citizens have been eliminated from the Champions League knockout stages by Los Blancos more often than by any other opponent (three). And Ancelotti, who has won four of his 12 games against Guardiola across his managerial career, believes the rivalry between the two teams has become Europe’s biggest. “It feels like a modern classic because we’ve been playing against each other in this competition for many years,” Ancelotti told a press conference on Monday. “I think it’s going to be as entertaining and evenly matched as ever. So much depends on attitude, individual quality, confidence and personality. “It’s such a high-level that you have to bring out the best in every aspect of the game, not just one. “Whoever goes through will have a good chance of going far in the competition, as has been the case in recent years.” pic.twitter.com/vMOP7fIZFb — Real Madrid C.F. (@realmadriden) February 10, 2025 Ancelotti talks from experience after his side won the Champions League in 2022 and last year, having eliminated City in the knockout stages of the competition. The Madrid boss also dismissed the idea that Real would be facing a weakened opponent compared to the one they have come up against in recent years. City have struggled in the Premier League this season, sitting fifth after an unprecedented run of form towards the end of last year that dented their title hopes. Guardiola’s side are 15 points behind leaders Liverpool, but those troubles transcended into their European campaign. They needed a win over Club Brugge in their final game of the league phase to book their place in the knockout round. Ancelotti, however, is expecting another tough battle, saying: “The reality is that’s always a headache (playing against Manchester City). “Guardiola is a coach who has brought a lot to football, an innovator and I have a lot of respect for him. He’s one of the best, if not the best. “Every time we play against each other, it’s a nightmare to prepare for the games, because he always has ideas that make you think. “City are still one of the best teams in Europe, they have the best coach, and they are the toughest rival we could have played against.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eCarlo Ancelotti described Real Madrid’s preparations for their Champions League play-off clash against Manchester City as a “nightmare”. \u003c/p\u003e\n\u003cp\u003eMadrid square off against Pep Guardiola’s side at the Etihad Stadium on Tuesday, with the winners of the last three titles facing off for a fourth consecutive season. \u003c/p\u003e\n\u003cp\u003eIndeed, this will be just the fourth fixture in European Cup / Champions League history to be played in four straight campaigns, after Deportivo de La Coruna v Juventus (four from 2000-01 to 2003-04), Chelsea v Liverpool (five from 2004-05 to 2008-09), and Atletico Madrid v Madrid (four from 2013-14 to 2016-17).\u003c/p\u003e\n\u003cp\u003eDespite only losing three of their 12 games against them in the competition, the Citizens have been eliminated from the Champions League knockout stages by Los Blancos more often than by any other opponent (three).\u003c/p\u003e\n\u003cp\u003eAnd Ancelotti, who has won four of his 12 games against Guardiola across his managerial career, believes the rivalry between the two teams has become Europe’s biggest.\u003c/p\u003e\n\u003cp\u003e“It feels like a modern classic because we’ve been playing against each other in this competition for many years,” Ancelotti told a press conference on Monday.\u003c/p\u003e\n\u003cp\u003e“I think it’s going to be as entertaining and evenly matched as ever. So much depends on attitude, individual quality, confidence and personality.\u003c/p\u003e\n\u003cp\u003e“It’s such a high-level that you have to bring out the best in every aspect of the game, not just one.\u003c/p\u003e\n\u003cp\u003e“Whoever goes through will have a good chance of going far in the competition, as has been the case in recent years.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"qme\"\u003e\u003ca href=\"https://t.co/vMOP7fIZFb\"\u003epic.twitter.com/vMOP7fIZFb\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Real Madrid C.F. (@realmadriden) \u003ca href=\"https://twitter.com/realmadriden/status/1889068072864264631?ref_src=twsrc%5Etfw\"\u003eFebruary 10, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eAncelotti talks from experience after his side won the Champions League in 2022 and last year, having eliminated City in the knockout stages of the competition. \u003c/p\u003e\n\u003cp\u003eThe Madrid boss also dismissed the idea that Real would be facing a weakened opponent compared to the one they have come up against in recent years. \u003c/p\u003e\n\u003cp\u003eCity have struggled in the Premier League this season, sitting fifth after an unprecedented run of form towards the end of last year that dented their title hopes. \u003c/p\u003e\n\u003cp\u003eGuardiola’s side are 15 points behind leaders Liverpool, but those troubles transcended into their European campaign. They needed a win over Club Brugge in their final game of the league phase to book their place in the knockout round. \u003c/p\u003e\n\u003cp\u003eAncelotti, however, is expecting another tough battle, saying: “The reality is that’s always a headache (playing against Manchester City). \u003c/p\u003e\n\u003cp\u003e“Guardiola is a coach who has brought a lot to football, an innovator and I have a lot of respect for him. He’s one of the best, if not the best.\u003c/p\u003e\n\u003cp\u003e“Every time we play against each other, it’s a nightmare to prepare for the games, because he always has ideas that make you think.\u003c/p\u003e\n\u003cp\u003e“City are still one of the best teams in Europe, they have the best coach, and they are the toughest rival we could have played against.” \u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-02-10T22:52:00Z",
  "modifiedTime": null
}
