{
  "id": "76ce1bbb-4a91-44e1-9cad-68c5ef5da9f4",
  "title": "Roma 1-1 Napoli: Angelino´s late stunner sees Serie A leaders stumble",
  "link": "https://www.soccernews.com/roma-1-1-napoli-angelino-s-late-stunner-sees-serie-a-leaders-stumble/381444/",
  "description": "Angelino’s late leveller stopped Serie A leaders Napoli from extending their lead at the summit as Roma salvaged a 1-1 draw against Antonio Conte’s side on Sunday. Napoli had the chance to move five points clear at the top after second-placed Inter were pegged back late on by rivals AC Milan in the Derby di […] The post Roma 1-1 Napoli: Angelino´s late stunner sees Serie A leaders stumble appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Sun, 02 Feb 2025 22:26:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 1861,
  "excerpt": "Angelino’s late leveller stopped Serie A leaders Napoli from extending their lead at the summit as Roma salvaged a 1-1 draw against Antonio Conte’s side on Sunday. Napoli had the chance to move five points clear at the top after second-placed Inter were pegged back late on by rivals AC Milan in the Derby di […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Angelino’s late leveller stopped Serie A leaders Napoli from extending their lead at the summit as Roma salvaged a 1-1 draw against Antonio Conte’s side on Sunday. Napoli had the chance to move five points clear at the top after second-placed Inter were pegged back late on by rivals AC Milan in the Derby di Milano earlier in the day. But the Partenopei were unable to capitalise at the Stadio Olimpico, meaning their advantage remains at three points, with Inter also having a game in hand. Leonardo Spinazzola handed the visitors the lead against his former club in the 29th minute after lofting the ball over Mile Svilar following Juan Jesus’ punt forward. After the break, Leandro Paredes almost levelled for Roma as his free-kick left Alex Meret stranded, but fortunately for the Napoli goalkeeper, it was inches wide of the mark. And with Napoli on course for an eighth straight Serie A win in a row, they were dealt a hammer blow to their title hopes in the second minute of second-half stoppage time. Roma surged forward down the right, with Alexis Saelemaekers’ delivery to the edge of the penalty area brilliantly volleyed first time into the bottom corner by Angelino. Data Debrief: Roma produce late late show once again Napoli knew the importance of a win on Sunday, but they were held at the death against Claudio Ranieri’s side, though Roma have made a habit of scoring late on in Serie A. Roma have now scored 28 goals from the 90th minute onwards in the last five Serie A seasons, more than any other side in the Italian top-flight since 2020-21. But despite not being able to extend their Serie A lead, Napoli have won 54 points after 23 games (W17 D3 L3) this season. In the three points per win era (from 1994-95), only in 2017-18 (60) and in 2022-23 (62) have they done better after the same number of matches in the competition.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eAngelino’s late leveller stopped Serie A leaders Napoli from extending their lead at the summit as Roma salvaged a 1-1 draw against Antonio Conte’s side on Sunday. \u003c/p\u003e\n\u003cp\u003eNapoli had the chance to move five points clear at the top after second-placed Inter were pegged back late on by rivals AC Milan in the Derby di Milano earlier in the day. \u003c/p\u003e\n\u003cp\u003eBut the Partenopei were unable to capitalise at the Stadio Olimpico, meaning their advantage remains at three points, with Inter also having a game in hand. \u003c/p\u003e\n\u003cp\u003eLeonardo Spinazzola handed the visitors the lead against his former club in the 29th minute after lofting the ball over Mile Svilar following Juan Jesus’ punt forward. \u003c/p\u003e\n\u003cp\u003eAfter the break, Leandro Paredes almost levelled for Roma as his free-kick left Alex Meret stranded, but fortunately for the Napoli goalkeeper, it was inches wide of the mark. \u003c/p\u003e\n\u003cp\u003eAnd with Napoli on course for an eighth straight Serie A win in a row, they were dealt a hammer blow to their title hopes in the second minute of second-half stoppage time. \u003c/p\u003e\n\u003cp\u003eRoma surged forward down the right, with Alexis Saelemaekers’ delivery to the edge of the penalty area brilliantly volleyed first time into the bottom corner by Angelino. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eData Debrief: Roma produce late late show once again\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNapoli knew the importance of a win on Sunday, but they were held at the death against Claudio Ranieri’s side, though Roma have made a habit of scoring late on in Serie A. \u003c/p\u003e\n\u003cp\u003eRoma have now scored 28 goals from the 90th minute onwards in the last five Serie A seasons, more than any other side in the Italian top-flight since 2020-21. \u003c/p\u003e\n\u003cp\u003eBut despite not being able to extend their Serie A lead, Napoli have won 54 points after 23 games (W17 D3 L3) this season. In the three points per win era (from 1994-95), only in 2017-18 (60) and in 2022-23 (62) have they done better after the same number of matches in the competition.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-02T22:26:00Z",
  "modifiedTime": null
}
