{
  "id": "b9242559-5b31-4e1d-8e37-1c64f63b7845",
  "title": "Trafford earned Burnley a point with penalty heroics against Sunderland, says Parker",
  "link": "https://www.soccernews.com/trafford-earned-burnley-a-point-with-penalty-heroics-against-sunderland-says-parker/380722/",
  "description": "Scott Parker hailed James Trafford for earning Burnley a point as he saved two late penalties in a 0-0 draw with Sunderland on Friday. Fans were kept on the edge of their seats at Turf Moor as the goalkeeper twice denied Wilson Isidor, who had also hit the woodwork at the start of the second […] The post Trafford earned Burnley a point with penalty heroics against Sunderland, says Parker appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 17 Jan 2025 23:01:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2765,
  "excerpt": "Scott Parker hailed James Trafford for earning Burnley a point as he saved two late penalties in a 0-0 draw with Sunderland on Friday. Fans were kept on the edge of their seats at Turf Moor as the goalkeeper twice denied Wilson Isidor, who had also hit the woodwork at the start of the second […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Scott Parker hailed James Trafford for earning Burnley a point as he saved two late penalties in a 0-0 draw with Sunderland on Friday. Fans were kept on the edge of their seats at Turf Moor as the goalkeeper twice denied Wilson Isidor, who had also hit the woodwork at the start of the second half, in the final 10 minutes to earn a valuable point in the race for automatic promotion. The first save came in the 86th minute – CJ Egan-Riley brought down Isidor with the referee pointing to the spot, despite the contact seemingly happening outside the box. However, Trafford guessed right and got a strong hand behind the spot-kick. The drama was not over yet though, as Sunderland kept pushing for a winner. In the 95th minute, Oliver Sonne caught Dennis Cirkin, with the referee awarding another penalty. Isidor stepped up from 12 yards once more, choosing to shoot the same way, but Trafford was equal to the task again to preserve a point that moved Burnley level on points with leaders Leeds United, though they sit second due to an inferior goal difference. Sunderland, meanwhile, missed the chance to leapfrog their opponents and sit in fourth. “I think it’s a massive point when you look at it on reflection,” Parker told Sky Sports. “Two penalties and two magnificent saves and looking at it where I’m sitting, it’s a valuable point for us. “James Trafford has been a vital part of what we’ve done, a huge talent who still needs refining and this year he’s took that on really. They were incredible saves. “He definitely earned us a point tonight. Those two penalties were coming at pace, they were fantastic saves.” He is him x2 ‍ pic.twitter.com/4dwpUaTKxz — Burnley FC (@BurnleyOfficial) January 17, 2025 Burnley remain unbeaten at home thanks to this draw, as Sunderland missed the chance to complete a league double over Scott Parker’s men, who boast the best defence in the competition. The Black Cats had 14 chances, five more than their hosts, but only managed three on target, with two of those coming from Isidor’s penalties. The spot-kicks also lend to their 2.86 expected goals (xG), with Isidor responsible for 2.55 of that. “It was a good game. Burnley started well, they were very good, but it’s always hard to manage long balls in behind, and they were good in that moment,” Regis Le Bris told Sky Sports. “But we solved the problems, and I think we finished the first half well. The second half was good, we created big chances. We probably deserved to win, but football is like that.” Asked how he felt about Trafford’s delay tactics before both penalties, he added: “It’s smart because it’s a way to break the rhythm, you can introduce doubt. “It works for them and the referee has to judge, but it’s done, and we have to turn the page.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eScott Parker hailed James Trafford for earning Burnley a point as he saved two late penalties in a 0-0 draw with Sunderland on Friday.\u003c/p\u003e\n\u003cp\u003eFans were kept on the edge of their seats at Turf Moor as the goalkeeper twice denied Wilson Isidor, who had also hit the woodwork at the start of the second half, in the final 10 minutes to earn a valuable point in the race for automatic promotion.\u003c/p\u003e\n\u003cp\u003eThe first save came in the 86th minute – CJ Egan-Riley brought down Isidor with the referee pointing to the spot, despite the contact seemingly happening outside the box. However, Trafford guessed right and got a strong hand behind the spot-kick.\u003c/p\u003e\n\u003cp\u003eThe drama was not over yet though, as Sunderland kept pushing for a winner. In the 95th minute, Oliver Sonne caught Dennis Cirkin, with the referee awarding another penalty.\u003c/p\u003e\n\u003cp\u003eIsidor stepped up from 12 yards once more, choosing to shoot the same way, but Trafford was equal to the task again to preserve a point that moved Burnley level on points with leaders Leeds United, though they sit second due to an inferior goal difference.\u003c/p\u003e\n\u003cp\u003eSunderland, meanwhile, missed the chance to leapfrog their opponents and sit in fourth.\u003c/p\u003e\n\u003cp\u003e“I think it’s a massive point when you look at it on reflection,” Parker told Sky Sports.\u003c/p\u003e\n\u003cp\u003e“Two penalties and two magnificent saves and looking at it where I’m sitting, it’s a valuable point for us.\u003c/p\u003e\n\u003cp\u003e“James Trafford has been a vital part of what we’ve done, a huge talent who still needs refining and this year he’s took that on really. They were incredible saves.\u003c/p\u003e\n\u003cp\u003e“He definitely earned us a point tonight. Those two penalties were coming at pace, they were fantastic saves.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eHe is him x2 ‍\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://t.co/4dwpUaTKxz\"\u003epic.twitter.com/4dwpUaTKxz\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Burnley FC (@BurnleyOfficial) \u003ca href=\"https://twitter.com/BurnleyOfficial/status/1880378201358450923?ref_src=twsrc%5Etfw\"\u003eJanuary 17, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eBurnley remain unbeaten at home thanks to this draw, as Sunderland missed the chance to complete a league double over Scott Parker’s men, who boast the best defence in the competition.\u003c/p\u003e\n\u003cp\u003eThe Black Cats had 14 chances, five more than their hosts, but only managed three on target, with two of those coming from Isidor’s penalties. The spot-kicks also lend to their 2.86 expected goals (xG), with Isidor responsible for 2.55 of that.\u003c/p\u003e\n\u003cp\u003e“It was a good game. Burnley started well, they were very good, but it’s always hard to manage long balls in behind, and they were good in that moment,” Regis Le Bris told Sky Sports.\u003c/p\u003e\n\u003cp\u003e“But we solved the problems, and I think we finished the first half well. The second half was good, we created big chances. We probably deserved to win, but football is like that.”\u003c/p\u003e\n\u003cp\u003eAsked how he felt about Trafford’s delay tactics before both penalties, he added: “It’s smart because it’s a way to break the rhythm, you can introduce doubt.\u003c/p\u003e\n\u003cp\u003e“It works for them and the referee has to judge, but it’s done, and we have to turn the page.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-01-17T23:01:00Z",
  "modifiedTime": null
}
