{
  "id": "bb32645c-0187-426b-8f02-d2119c7e1f86",
  "title": "Martinelli prepared for ´biggest game of his life´ against PSG",
  "link": "https://www.soccernews.com/martinelli-prepared-for-biggest-game-of-his-life-against-psg/384857/",
  "description": "Arsenal forward Gabriel Martinelli acknowledged the magnitude of their Champions League semi-final first leg against Paris Saint-Germain on Tuesday for both himself and the club. The Brazilian scored a stoppage-time winner in the Gunners’ 2-1 victory away to Real Madrid in the quarter-final, sealing a 5-1 aggregate victory to take them to their first Champions […] The post Martinelli prepared for ´biggest game of his life´ against PSG appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Mon, 28 Apr 2025 23:25:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "English Premier League"
  ],
  "byline": "SoccerNews",
  "length": 1848,
  "excerpt": "Arsenal forward Gabriel Martinelli acknowledged the magnitude of their Champions League semi-final first leg against Paris Saint-Germain on Tuesday for both himself and the club. The Brazilian scored a stoppage-time winner in the Gunners’ 2-1 victory away to Real Madrid in the quarter-final, sealing a 5-1 aggregate victory to take them to their first Champions […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Arsenal forward Gabriel Martinelli acknowledged the magnitude of their Champions League semi-final first leg against Paris Saint-Germain on Tuesday for both himself and the club. The Brazilian scored a stoppage-time winner in the Gunners’ 2-1 victory away to Real Madrid in the quarter-final, sealing a 5-1 aggregate victory to take them to their first Champions League semi-final in 16 years. “It’s the biggest game of my life,” he said, as quoted by The Mirror. “Since I was five or six years old, it’s been a dream. We deserve to be here and we are ready. It’s an opportunity for our lives. Everyone who loves football wants to play in these games. We have to enjoy the moment and be ready. “We deserve to be here, we deserve to win something for one of the great clubs in Europe. We have an amazing opportunity and we will go into the game believing we can do it. “We have this dream, the club has never won the title and we deserve it because we are one of the greatest clubs in the world.” North London is set. pic.twitter.com/JZDKWJva8v — Arsenal (@Arsenal) April 28, 2025 Martinelli’s goal in Madrid extended his record of never having lost when scoring for Arsenal – he has netted 50 in all competitions for the Gunners. But the record is not something that will be on his mind going into this game. “If I need to run 15km, I don’t score and we win the Champions League then I will still be the happiest man in the world. I try to give my best for the team. I don’t think about that record but I know about it,” he sad/ “When we play against Vini and Rodrygo, I know the players need a little help so me and B [Bukayo Saka] try to help Jurrien [Timber] and Myles [Lewis-Skelly] and work hard for the team. “We have a huge respect for PSG, we have watched them. We’ve got an amazing team as well, amazing supporters who will be behind us.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eArsenal forward Gabriel Martinelli acknowledged the magnitude of their Champions League semi-final first leg against Paris Saint-Germain on Tuesday for both himself and the club.\u003c/p\u003e\n\u003cp\u003eThe Brazilian scored a stoppage-time winner in the Gunners’ 2-1 victory away to Real Madrid in the quarter-final, sealing a 5-1 aggregate victory to take them to their first Champions League semi-final in 16 years.\u003c/p\u003e\n\u003cp\u003e“It’s the biggest game of my life,” he said, as quoted by The Mirror.\u003c/p\u003e\n\u003cp\u003e“Since I was five or six years old, it’s been a dream. We deserve to be here and we are ready. It’s an opportunity for our lives. Everyone who loves football wants to play in these games. We have to enjoy the moment and be ready.\u003c/p\u003e\n\u003cp\u003e“We deserve to be here, we deserve to win something for one of the great clubs in Europe. We have an amazing opportunity and we will go into the game believing we can do it.\u003c/p\u003e\n\u003cp\u003e“We have this dream, the club has never won the title and we deserve it because we are one of the greatest clubs in the world.”\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eNorth London is set. \u003ca href=\"https://t.co/JZDKWJva8v\"\u003epic.twitter.com/JZDKWJva8v\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Arsenal (@Arsenal) \u003ca href=\"https://twitter.com/Arsenal/status/1916968163377614918?ref_src=twsrc%5Etfw\"\u003eApril 28, 2025\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003eMartinelli’s goal in Madrid extended his record of never having lost when scoring for Arsenal – he has netted 50 in all competitions for the Gunners.\u003c/p\u003e\n\u003cp\u003eBut the record is not something that will be on his mind going into this game.\u003c/p\u003e\n\u003cp\u003e“If I need to run 15km, I don’t score and we win the Champions League then I will still be the happiest man in the world. I try to give my best for the team. I don’t think about that record but I know about it,” he sad/\u003c/p\u003e\n\u003cp\u003e“When we play against Vini and Rodrygo, I know the players need a little help so me and B [Bukayo Saka] try to help Jurrien [Timber] and Myles [Lewis-Skelly] and work hard for the team.\u003c/p\u003e\n\u003cp\u003e“We have a huge respect for PSG, we have watched them. We’ve got an amazing team as well, amazing supporters who will be behind us.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-28T23:25:00Z",
  "modifiedTime": null
}
