{
  "id": "e5f69f27-940d-4cda-965f-b18fe0be4034",
  "title": "Chelsea continuing to prove doubters wrong to the delight of James",
  "link": "https://www.soccernews.com/chelsea-continuing-to-prove-doubters-wrong-to-the-delight-of-james/385568/",
  "description": "Chelsea captain Reece James revelled in proving the Blues’ Champions League doubters wrong after their huge 1-0 win over Manchester United on Friday. James played a crucial role in the only goal of the game, neatly turning before providing the cross for Marc Cucurella to head home the winner in the 71st minute. The result […] The post Chelsea continuing to prove doubters wrong to the delight of James appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Fri, 16 May 2025 23:36:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 3213,
  "excerpt": "Chelsea captain Reece James revelled in proving the Blues’ Champions League doubters wrong after their huge 1-0 win over Manchester United on Friday. James played a crucial role in the only goal of the game, neatly turning before providing the cross for Marc Cucurella to head home the winner in the 71st minute. The result […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Chelsea captain Reece James revelled in proving the Blues’ Champions League doubters wrong after their huge 1-0 win over Manchester United on Friday. James played a crucial role in the only goal of the game, neatly turning before providing the cross for Marc Cucurella to head home the winner in the 71st minute. The result proved a crucial one after Aston Villa’s win over Tottenham Hotspur earlier in the day, with Chelsea moving up to fourth, level on points with Unai Emery’s team. Chelsea are one of three teams on 66 points, though Newcastle United have a game in hand against Arsenal on Sunday, with the Blues facing Nottingham Forest on the final day. James is the only player remaining in the Chelsea squad that was part of their Champions League success in 2020-21, and believes the club belongs among Europe’s elite. “I think that’s where the club belongs, in the Champions League. Competing in the best competitions,” James said. “People like to write us off and call us inexperienced. We played against a very experienced United team today. “We were there and we won the game. We got what we needed to do.” Should Chelsea seal a top-five finish this season, it will be down to their impressive form at Stamford Bridge since the turn of the year. The Blues remain unbeaten in the Premier League at Stamford Bridge in 2025, winning eight and drawing two of 10 games. They’ve won more points on home soil (26) than any other side this calendar year, and Chelsea boss Enzo Maresca believed his team were deserving of their latest victory. “It was quite confident because I know how difficult it is to play against United,” Maresca told Sky Sports. “We expected a very tough game. They played very well. I was completely confident. Overall, it was a game where we could have a good moment and score a goal. “I used to watch five, six, seven games when we played against a team. I have never watched them [Man Utd] so aggressive – they were man to man, and it was very difficult. “Off the ball I think we played a fantastic game. The team was very aggressive until the end. We tried to press higher, and I think we deserved to win the game. “It is nice to work on some solutions, and then you score.” And Chelsea’s latest home success was clinched by Cucurella, who netted his fifth Premier League goal of the season. Indeed, all six of Cucurella’s Premier League goals have been on home soil (one for Brighton, five for Chelsea). In Premier League history, only Clive Wilson (nine), Jeff Kenna and Ronny Johnsen (both eight) have scored more goals with 100% of them coming at home. But away from personal glory, Cucurella was on hand to stress the need for Champions League football, while also believing something special was building at Chelsea. “It is very important [to get Champions League]. Step by step we are creating something special and now there are only two games left to achieve something special,” he added. “The most important thing is it depends on us, so we have to play the game on Sunday, and then we are thinking about the [Conference League] final. “Today is a moment to enjoy because we work all season for these moments, so now we have ambitions to achieve these things.”",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eChelsea captain Reece James revelled in proving the Blues’ Champions League doubters wrong after their huge 1-0 win over Manchester United on Friday. \u003c/p\u003e\n\u003cp\u003eJames played a crucial role in the only goal of the game, neatly turning before providing the cross for Marc Cucurella to head home the winner in the 71st minute. \u003c/p\u003e\n\u003cp\u003eThe result proved a crucial one after Aston Villa’s win over Tottenham Hotspur earlier in the day, with Chelsea moving up to fourth, level on points with Unai Emery’s team. \u003c/p\u003e\n\u003cp\u003eChelsea are one of three teams on 66 points, though Newcastle United have a game in hand against Arsenal on Sunday, with the Blues facing Nottingham Forest on the final day.\u003c/p\u003e\n\u003cp\u003eJames is the only player remaining in the Chelsea squad that was part of their Champions League success in 2020-21, and believes the club belongs among Europe’s elite. \u003c/p\u003e\n\u003cp\u003e“I think that’s where the club belongs, in the Champions League. Competing in the best competitions,” James said.\u003c/p\u003e\n\u003cp\u003e“People like to write us off and call us inexperienced. We played against a very experienced United team today.\u003c/p\u003e\n\u003cp\u003e“We were there and we won the game. We got what we needed to do.”\u003c/p\u003e\n\n\u003cp\u003eShould Chelsea seal a top-five finish this season, it will be down to their impressive form at Stamford Bridge since the turn of the year. \u003c/p\u003e\n\u003cp\u003eThe Blues remain unbeaten in the Premier League at Stamford Bridge in 2025, winning eight and drawing two of 10 games.\u003c/p\u003e\n\u003cp\u003eThey’ve won more points on home soil (26) than any other side this calendar year, and Chelsea boss Enzo Maresca believed his team were deserving of their latest victory. \u003c/p\u003e\n\u003cp\u003e“It was quite confident because I know how difficult it is to play against United,” Maresca told Sky Sports. \u003c/p\u003e\n\u003cp\u003e“We expected a very tough game. They played very well. I was completely confident. Overall, it was a game where we could have a good moment and score a goal.\u003c/p\u003e\n\u003cp\u003e“I used to watch five, six, seven games when we played against a team. I have never watched them [Man Utd] so aggressive – they were man to man, and it was very difficult.\u003c/p\u003e\n\u003cp\u003e“Off the ball I think we played a fantastic game. The team was very aggressive until the end. We tried to press higher, and I think we deserved to win the game.\u003c/p\u003e\n\u003cp\u003e“It is nice to work on some solutions, and then you score.”\u003c/p\u003e\n\u003cp\u003eAnd Chelsea’s latest home success was clinched by Cucurella, who netted his fifth Premier League goal of the season. \u003c/p\u003e\n\u003cp\u003eIndeed, all six of Cucurella’s Premier League goals have been on home soil (one for Brighton, five for Chelsea).\u003c/p\u003e\n\u003cp\u003eIn Premier League history, only Clive Wilson (nine), Jeff Kenna and Ronny Johnsen (both eight) have scored more goals with 100% of them coming at home.\u003c/p\u003e\n\n\u003cp\u003eBut away from personal glory, Cucurella was on hand to stress the need for Champions League football, while also believing something special was building at Chelsea.\u003c/p\u003e\n\u003cp\u003e“It is very important [to get Champions League]. Step by step we are creating something special and now there are only two games left to achieve something special,” he added.\u003c/p\u003e\n\u003cp\u003e“The most important thing is it depends on us, so we have to play the game on Sunday, and then we are thinking about the [Conference League] final.\u003c/p\u003e\n\u003cp\u003e“Today is a moment to enjoy because we work all season for these moments, so now we have ambitions to achieve these things.”\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-16T23:36:00Z",
  "modifiedTime": null
}
