{
  "id": "f7fdf027-645c-4c4e-8404-ce336e323dc9",
  "title": "Bayer Leverkusen 0-2 Bayern Munich (0-5 agg) – History-maker Kane sends Kompany´s side through",
  "link": "https://www.soccernews.com/bayer-leverkusen-0-2-bayern-munich-0-5-agg-history-maker-kane-sends-kompany-s-side-through/382956/",
  "description": "Harry Kane made history as Bayern Munich confirmed their place in the Champions League quarter-finals with a comfortable 2-0 win over Bayer Leverkusen. Kane’s second-half strike was his 10th goal in the competition this season, becoming the first English player to reach double figures in a single edition of the European Cup or the Champions […] The post Bayer Leverkusen 0-2 Bayern Munich (0-5 agg) – History-maker Kane sends Kompany´s side through appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Tue, 11 Mar 2025 22:34:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2572,
  "excerpt": "Harry Kane made history as Bayern Munich confirmed their place in the Champions League quarter-finals with a comfortable 2-0 win over Bayer Leverkusen. Kane’s second-half strike was his 10th goal in the competition this season, becoming the first English player to reach double figures in a single edition of the European Cup or the Champions […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Harry Kane made history as Bayern Munich confirmed their place in the Champions League quarter-finals with a comfortable 2-0 win over Bayer Leverkusen. Kane’s second-half strike was his 10th goal in the competition this season, becoming the first English player to reach double figures in a single edition of the European Cup or the Champions League. The England captain also grabbed the assist for Alphonso Davies’ 71st-minute effort to seal a 5-0 aggregate win and a date with Inter in the next round after they progressed past Feyenoord on Tuesday. Bayern started the brighter of the two sides and almost edged in front early on, with Michael Olise’s cross narrowly evading the far post before Kingsley Coman went close. Xabi Alonso’s side looked threatening in the final third but were unable to create any clear chances, and knew they needed to come out and attack after the break to keep their hopes of remaining in the competition alive. But it was Bayern who edged in front seven minutes after the restart when Patrik Schick’s attempted clearance from a Joshua Kimmich free-kick fell straight at the feet of Kane, who bundled home from a few yards out. The absence of star man Florian Wirtz, who was ruled out of the contest with an ankle ligament injury, proved pivotal for Leverkusen, who had to wait until the 65th minute to register a shot on target. And Leverkusen’s desperation left more space for Bayern to exploit and Davies took full advantage by converting Kane’s cross from close range in the 71st minute. Kane then struck the crossbar as Bayern went in search of a third, with Jamal Musiala then striking the post, but their two-goal advantage was enough in the end. Data Debrief: Kane the difference in all-German affair Bayern have always had a prolific number nine at the top end of the pitch, but Kane has seemingly taken Kompany’s side to another level this season as they eye a first Champions League title since 2019-20. Kane has been directly involved in 24 goals in 23 Champions League appearances for Bayern (18 goals, six assists), the most of any player since the start of last season. Overall, he is now just the second Englishman to have been involved in 50 or more goals in the competition (39 goals, 11 assists), along with David Beckham (52 – 16 goals, 36 assists). For Bayern, their 5-0 aggregate win was the biggest in an all-German tie in the knockout stages of a European competition since 1998-99, when Bayern themselves won 6-0 in the quarter-finals of the Champions League against Kaiserslautern (2-0 at home, 4-0 away).",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eHarry Kane made history as Bayern Munich confirmed their place in the Champions League quarter-finals with a comfortable 2-0 win over Bayer Leverkusen. \u003c/p\u003e\n\u003cp\u003eKane’s second-half strike was his 10th goal in the competition this season, becoming the first English player to reach double figures in a single edition of the European Cup or the Champions League. \u003c/p\u003e\n\u003cp\u003eThe England captain also grabbed the assist for Alphonso Davies’ 71st-minute effort to seal a 5-0 aggregate win and a date with Inter in the next round after they progressed past Feyenoord on Tuesday. \u003c/p\u003e\n\u003cp\u003eBayern started the brighter of the two sides and almost edged in front early on, with Michael Olise’s cross narrowly evading the far post before Kingsley Coman went close.\u003c/p\u003e\n\u003cp\u003eXabi Alonso’s side looked threatening in the final third but were unable to create any clear chances, and knew they needed to come out and attack after the break to keep their hopes of remaining in the competition alive. \u003c/p\u003e\n\u003cp\u003eBut it was Bayern who edged in front seven minutes after the restart when Patrik Schick’s attempted clearance from a Joshua Kimmich free-kick fell straight at the feet of Kane, who bundled home from a few yards out.\u003c/p\u003e\n\u003cp\u003eThe absence of star man Florian Wirtz, who was ruled out of the contest with an ankle ligament injury, proved pivotal for Leverkusen, who had to wait until the 65th minute to register a shot on target. \u003c/p\u003e\n\u003cp\u003eAnd Leverkusen’s desperation left more space for Bayern to exploit and Davies took full advantage by converting Kane’s cross from close range in the 71st minute.\u003c/p\u003e\n\u003cp\u003eKane then struck the crossbar as Bayern went in search of a third, with Jamal Musiala then striking the post, but their two-goal advantage was enough in the end. \u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eData Debrief: Kane the difference in all-German affair\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBayern have always had a prolific number nine at the top end of the pitch, but Kane has seemingly taken Kompany’s side to another level this season as they eye a first Champions League title since 2019-20. \u003c/p\u003e\n\u003cp\u003eKane has been directly involved in 24 goals in 23 Champions League appearances for Bayern (18 goals, six assists), the most of any player since the start of last season.\u003c/p\u003e\n\u003cp\u003eOverall, he is now just the second Englishman to have been involved in 50 or more goals in the competition (39 goals, 11 assists), along with David Beckham (52 – 16 goals, 36 assists).\u003c/p\u003e\n\u003cp\u003eFor Bayern, their 5-0 aggregate win was the biggest in an all-German tie in the knockout stages of a European competition since 1998-99, when Bayern themselves won 6-0 in the quarter-finals of the Champions League against Kaiserslautern (2-0 at home, 4-0 away). \u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-03-11T22:34:00Z",
  "modifiedTime": null
}
