{
  "id": "faef8171-3316-4159-8738-72763178137c",
  "title": "Wales promotion ´hasn´t sunk in´ for Bellamy after 4-1 Iceland win",
  "link": "https://www.soccernews.com/wales-promotion-hasn-t-sunk-in-for-bellamy-after-4-1-iceland-win/378528/",
  "description": "Wales secured promotion to League A after beating Iceland 4-1 at home in their final Nations League group match, having gone a goal down early on. Their victory, alongside a 3-1 defeat for Turkiye away to Montenegro, means that Craig Bellamy’s side topped their group by a point. “The feeling hasn’t quite sunk in yet, […] The post Wales promotion ´hasn´t sunk in´ for Bellamy after 4-1 Iceland win appeared first on Soccer News.",
  "author": "SoccerNews",
  "published": "Tue, 19 Nov 2024 23:13:00 +0000",
  "source": "https://www.soccernews.com/feed",
  "categories": [
    "General Soccer News"
  ],
  "byline": "SoccerNews",
  "length": 2166,
  "excerpt": "Wales secured promotion to League A after beating Iceland 4-1 at home in their final Nations League group match, having gone a goal down early on. Their victory, alongside a 3-1 defeat for Turkiye away to Montenegro, means that Craig Bellamy’s side topped their group by a point. “The feeling hasn’t quite sunk in yet, […]",
  "siteName": "Soccer News",
  "favicon": "",
  "text": "Wales secured promotion to League A after beating Iceland 4-1 at home in their final Nations League group match, having gone a goal down early on. Their victory, alongside a 3-1 defeat for Turkiye away to Montenegro, means that Craig Bellamy’s side topped their group by a point. “The feeling hasn’t quite sunk in yet, but it’s been a real positive camp Whatever the result of this game, it’s just been a positive camp,” said Bellamy after the match. “The targets we set right from the start, I feel we’ve been able to achieve.” Wales started the day knowing they needed to win and for results to go their way to top the group, but went a goal down after seven minutes after Andri Gudjohnsen followed up from a Danny Ward save. It was the first goal Wales had conceded at home in 321 minutes and the first time they had been behind under Bellamy, but they responded well. The hosts managed to control the rest of the half, with Lewis Cullen scoring twice in the final 15 minutes of the first period. The determination of his team to stick to the plan was something that pleased Bellamy immensely. How good does that look? #UNL | #TogetherStronger pic.twitter.com/vECo6gdXYP — Wales (@Cymru) November 19, 2024 “There were one or two tests today that I feel we’ve been able to progress [through]. If they had happened one or two games ago, we might not have been able to. “Where we’re at, you go 1-0 down in the first few minutes and you get a performance like that. “Then after that, when the crowd get a little bit edgy and try to force things for us… No, no. We keep the ball because we believe that’s going to benefit us, and the players were able to do that.” In the second half, Wales were able to dominate and bagged goals from Brennan Johnson and Harry Wilson to make things more comfortable. “I thought we took control of the tempo of the game and we’re a good team if we’re able to do that,” said Bellamy. On promotion itself, the Wales manager could not overstate the importance of being able to mix with the biggest teams in international football in Europe. “For where we want to be and where we want to go, it’s huge. It’s so important for us,” he said.",
  "image": "",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t                        \u003cp\u003e\u003ca href=\"https://mmwebhandler.aff-online.com/C/35442?sr=155474\u0026amp;anid=\" rel=\"nofollow\" target=\"_blank\"\u003e\u003cimg src=\"https://www.soccernews.com/wp-content/themes/SN/images/300x250_HR.gif\"/\u003e\u003c/a\u003e\n\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\u003cp\u003eWales secured promotion to League A after beating Iceland 4-1 at home in their final Nations League group match, having gone a goal down early on.\u003c/p\u003e\n\u003cp\u003eTheir victory, alongside a 3-1 defeat for Turkiye away to Montenegro, means that Craig Bellamy’s side topped their group by a point.\u003c/p\u003e\n\u003cp\u003e“The feeling hasn’t quite sunk in yet, but it’s been a real positive camp Whatever the result of this game, it’s just been a positive camp,” said Bellamy after the match.\u003c/p\u003e\n\u003cp\u003e“The targets we set right from the start, I feel we’ve been able to achieve.”\u003c/p\u003e\n\u003cp\u003eWales started the day knowing they needed to win and for results to go their way to top the group, but went a goal down after seven minutes after Andri Gudjohnsen followed up from a Danny Ward save.\u003c/p\u003e\n\u003cp\u003eIt was the first goal Wales had conceded at home in 321 minutes and the first time they had been behind under Bellamy, but they responded well. The hosts managed to control the rest of the half, with Lewis Cullen scoring twice in the final 15 minutes of the first period.\u003c/p\u003e\n\u003cp\u003eThe determination of his team to stick to the plan was something that pleased Bellamy immensely.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp dir=\"ltr\" lang=\"en\"\u003eHow good does that look? \u003ca href=\"https://twitter.com/hashtag/UNL?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#UNL\u003c/a\u003e | \u003ca href=\"https://twitter.com/hashtag/TogetherStronger?src=hash\u0026amp;ref_src=twsrc%5Etfw\"\u003e#TogetherStronger\u003c/a\u003e \u003ca href=\"https://t.co/vECo6gdXYP\"\u003epic.twitter.com/vECo6gdXYP\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e— Wales (@Cymru) \u003ca href=\"https://twitter.com/Cymru/status/1858990368051916832?ref_src=twsrc%5Etfw\"\u003eNovember 19, 2024\u003c/a\u003e\u003c/p\u003e\u003c/blockquote\u003e\n\u003cp\u003e“There were one or two tests today that I feel we’ve been able to progress [through]. If they had happened one or two games ago, we might not have been able to.\u003c/p\u003e\n\u003cp\u003e“Where we’re at, you go 1-0 down in the first few minutes and you get a performance like that.\u003c/p\u003e\n\u003cp\u003e“Then after that, when the crowd get a little bit edgy and try to force things for us… No, no. We keep the ball because we believe that’s going to benefit us, and the players were able to do that.”\u003c/p\u003e\n\u003cp\u003eIn the second half, Wales were able to dominate and bagged goals from Brennan Johnson and Harry Wilson to make things more comfortable.\u003c/p\u003e\n\u003cp\u003e“I thought we took control of the tempo of the game and we’re a good team if we’re able to do that,” said Bellamy.\u003c/p\u003e\n\u003cp\u003eOn promotion itself, the Wales manager could not overstate the importance of being able to mix with the biggest teams in international football in Europe.\u003c/p\u003e\n\u003cp\u003e“For where we want to be and where we want to go, it’s huge. It’s so important for us,” he said.\u003c/p\u003e\n                    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-11-19T23:13:00Z",
  "modifiedTime": null
}
