{
  "id": "03d8fffc-4f02-410c-8a99-b8f1647dfdba",
  "title": "Earliest deep-cave ritual compound in Southwest Asia discovered",
  "link": "https://www.sciencedaily.com/releases/2024/12/241209162441.htm",
  "description": "A cave in Galilee, Israel, has yielded evidence for ritualistic gathering 35,000 years ago, the earliest on the Asian continent.",
  "author": "",
  "published": "Mon, 09 Dec 2024 16:24:41 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4503,
  "excerpt": "A cave in Galilee, Israel, has yielded evidence for ritualistic gathering 35,000 years ago, the earliest on the Asian continent.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A cave in Galilee, Israel, has yielded evidence for ritualistic gathering 35,000 years ago, the earliest on the Asian continent. Three Israeli researchers led the team that published its results today in the journal Proceedings of the National Academy of Sciences. And researchers from the Case Western Reserve University (CWRU) School of Dental Medicine helped unearth the cave's secrets over more than a decade of excavation. Manot Cave was used for thousands of years as a living space for both Neanderthals and humans at different times. In 2015, researchers from Case Western Reserve helped identify a 55,000-year-old skull that provided physical evidence of interbreeding between Neanderthal and homo sapiens, with characteristics of each clearly visible in the skull fragment. The cave's living space was near the entrance, but in the deepest, darkest part of the cave, eight stories below, the new paper describes a large cavern with evidence it was used as a gathering space, possibly for rituals that enhanced social cohesion. The cavern's touchstone is an engraved rock, deliberately placed in a niche in the cavern, with a turtle-shell design carved into its surface. The three-dimensional turtle is contemporaneous with some of the oldest cave paintings in France. \"It may have represented a totem or spiritual figure,\" said Omry Barzilai, Head of Material Culture PaleoLab at the University of Haifa and the Israel Antiquities Authority, who led the team. \"Its special location, far from the daily activities near the cave entrance, suggests that it was an object of worship.\" The cavern has natural acoustics favorable for large gatherings, and evidence of wood ash on nearby stalagmites suggests prehistoric humans carried torches to light the chamber. Manot Cave was discovered in 2008 by workers building condominiums in a mountain resort close to Israel's border with Lebanon. Case Western Reserve's School of Dental Medicine got involved in the excavation in 2012. The dean at the time, Jerold Goldberg, committed $20,000 annually for 10 years to CWRU's Institute for the Science of Origins; the money was used to fund dental students' summer research in Israel. \"I'm an oral and maxillofacial surgeon by training,\" Goldberg said. \"I provided the commitment and the money because I wanted people to understand the breadth and intellectual interest that dental schools have.\" And although not trained in archaeology, dental students can quickly identify bone fragments from rock, which makes them invaluable at excavations like Manot Cave. \"Most people would not suspect that a dental school would be involved in an archaeological excavation,\" said Mark Hans, professor and chair of orthodontics at the dental school. \"But one of the things that are preserved very well in ancient skeletons are teeth, because they are harder than bone. There is a whole field of dental anthropology. As an orthodontist, I am interested in human facial growth and development, which, it turns out, is exactly what is needed to identify anthropological specimens.\" For 10 years, Case Western Reserve sent 10 to 20 dental students every summer to help with the Manot Cave excavation. The summer research became so popular that students from other dental and medical schools began applying to visit Israel with the CWRU team, according to Yvonne McDermott, the project coordinator. Case Western Reserve also collaborated closely with Linda Spurlock, a physical anthropologist at Kent State University, whose expertise is putting a face on a skull using clay to build out the tissues that would have covered the bone when the person was alive. \"One of the things I liked most about working on this excavation was how much we learned from the other researchers,\" Hans said. \"Everyone has a narrow focus, like mammals, uranium-dating, hearths; and we all came together and shared our knowledge. We learned a lot over 10 years.\" The Manot Cave project is supported by the Dan David Foundation, the Israel Science Foundation, the United States-Israel Binational Science Foundation, the Irene Levi Sala CARE Archaeological Foundation and the Leakey Foundation. The research also involved experts from the Israel Antiquities Authority, Cleveland State University, the Geological Survey of Israel, the Hebrew University of Jerusalem, the University of Haifa, Tel Aviv University, Ben-Gurion University, the University of Vienna, the University of Barcelona, the University of Siena and Simon Fraser University.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA cave in Galilee, Israel, has yielded evidence for ritualistic gathering 35,000 years ago, the earliest on the Asian continent. Three Israeli researchers led the team that published its results today in the journal \u003cem\u003eProceedings of the National Academy of Sciences\u003c/em\u003e.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eAnd researchers from the Case Western Reserve University (CWRU) School of Dental Medicine helped unearth the cave\u0026#39;s secrets over more than a decade of excavation.\u003c/p\u003e\n\u003cp\u003eManot Cave was used for thousands of years as a living space for both Neanderthals and humans at different times. In 2015, researchers from Case Western Reserve helped identify a 55,000-year-old skull that provided physical evidence of interbreeding between Neanderthal and \u003cem\u003ehomo sapiens\u003c/em\u003e, with characteristics of each clearly visible in the skull fragment.\u003c/p\u003e\n\u003cp\u003eThe cave\u0026#39;s living space was near the entrance, but in the deepest, darkest part of the cave, eight stories below, the new paper describes a large cavern with evidence it was used as a gathering space, possibly for rituals that enhanced social cohesion.\u003c/p\u003e\n\u003cp\u003eThe cavern\u0026#39;s touchstone is an engraved rock, deliberately placed in a niche in the cavern, with a turtle-shell design carved into its surface. The three-dimensional turtle is contemporaneous with some of the oldest cave paintings in France.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It may have represented a totem or spiritual figure,\u0026#34; said Omry Barzilai, Head of Material Culture PaleoLab at the University of Haifa and the Israel Antiquities Authority, who led the team. \u0026#34;Its special location, far from the daily activities near the cave entrance, suggests that it was an object of worship.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe cavern has natural acoustics favorable for large gatherings, and evidence of wood ash on nearby stalagmites suggests prehistoric humans carried torches to light the chamber.\u003c/p\u003e\n\n\n\u003cp\u003eManot Cave was discovered in 2008 by workers building condominiums in a mountain resort close to Israel\u0026#39;s border with Lebanon. Case Western Reserve\u0026#39;s School of Dental Medicine got involved in the excavation in 2012. The dean at the time, Jerold Goldberg, committed $20,000 annually for 10 years to CWRU\u0026#39;s Institute for the Science of Origins; the money was used to fund dental students\u0026#39; summer research in Israel.\u003c/p\u003e\n\u003cp\u003e\u0026#34;I\u0026#39;m an oral and maxillofacial surgeon by training,\u0026#34; Goldberg said. \u0026#34;I provided the commitment and the money because I wanted people to understand the breadth and intellectual interest that dental schools have.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAnd although not trained in archaeology, dental students can quickly identify bone fragments from rock, which makes them invaluable at excavations like Manot Cave.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Most people would not suspect that a dental school would be involved in an archaeological excavation,\u0026#34; said Mark Hans, professor and chair of orthodontics at the dental school. \u0026#34;But one of the things that are preserved very well in ancient skeletons are teeth, because they are harder than bone. There is a whole field of dental anthropology. As an orthodontist, I am interested in human facial growth and development, which, it turns out, is exactly what is needed to identify anthropological specimens.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFor 10 years, Case Western Reserve sent 10 to 20 dental students every summer to help with the Manot Cave excavation. The summer research became so popular that students from other dental and medical schools began applying to visit Israel with the CWRU team, according to Yvonne McDermott, the project coordinator.\u003c/p\u003e\n\u003cp\u003eCase Western Reserve also collaborated closely with Linda Spurlock, a physical anthropologist at Kent State University, whose expertise is putting a face on a skull using clay to build out the tissues that would have covered the bone when the person was alive.\u003c/p\u003e\n\u003cp\u003e\u0026#34;One of the things I liked most about working on this excavation was how much we learned from the other researchers,\u0026#34; Hans said. \u0026#34;Everyone has a narrow focus, like mammals, uranium-dating, hearths; and we all came together and shared our knowledge. We learned a lot over 10 years.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe Manot Cave project is supported by the Dan David Foundation, the Israel Science Foundation, the United States-Israel Binational Science Foundation, the Irene Levi Sala CARE Archaeological Foundation and the Leakey Foundation. The research also involved experts from the Israel Antiquities Authority, Cleveland State University, the Geological Survey of Israel, the Hebrew University of Jerusalem, the University of Haifa, Tel Aviv University, Ben-Gurion University, the University of Vienna, the University of Barcelona, the University of Siena and Simon Fraser University.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
