{
  "id": "0f3f778c-d285-40f0-82db-a6c57865bb7f",
  "title": "The Physics Trick That Makes These New Super Cars So Insanely Fast",
  "link": "https://www.wired.com/story/the-physics-trick-that-makes-these-new-super-cars-so-fast/",
  "description": "Zero to 60 in 1.4 seconds? By lowering air pressure under the car, automakers can dial the acceleration way up.",
  "author": "Rhett Allain",
  "published": "Fri, 18 Oct 2024 18:59:22 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Science / Physics and Math",
    "Dot Physics"
  ],
  "byline": "Rhett Allain",
  "length": 9369,
  "excerpt": "Zero to 60 in 1.4 seconds? By lowering air pressure under the car, automakers can dial the acceleration way up.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "People with fast street cars like to put them through their paces at the quarter-mile track. One way to get your quarter-mile time is to just buckle up and put the pedal to the metal. But if your car's design is suboptimal, you won't be taking home the bragging rights.So here's this week's question: Can automotive engineers predict a car's quarter-mile time using physics? And could the physics suggest some tricks to make a car faster? Yes and yes! Let's see how.Simple Model for an Accelerating CarWhen a car launches off the start, its increase in speed is described by its acceleration (the rate of change of velocity). But according to Newton's second law, to increase velocity, you need a force pushing in the direction of travel.We can model the motion of a car with just three forces. There's the downward-pulling gravitational force (= mass, m, times the gravitational field, g). There is also the interaction between the car and the road. It's useful to split this into two forces: One, perpendicular to the ground, is called the “normal force” (FN). It's the resistance of the ground to gravity—what keeps a car from plunging to the center of the Earth. The other force, friction (Ff), acts parallel to the ground. Here's a picture:It's the forward-pushing frictional force that makes the car accelerate. (Yes, this is powered by the engine, but the force is exerted where the rubber hits the road.) This frictional force depends on two things: the types of surfaces interacting, captured by a friction coefficient, μ, and the normal force (FN) pushing these surfaces together. With that, we get the following maximum frictional force:The frictional force that drives the car ahead depends on the specific materials in contact (captured by a friction coefficient, μ) and the normal force. We can quantify this by looking up the friction coefficient (around 0.7 for tires and asphalt) and calculating the normal force. Since the car stays on the ground, the acceleration in the vertical direction is zero. This means the net force in the vertical direction must be zero. So the normal force and the gravitational force must be equal.This gives us a value for the maximum frictional force (Ff). Since this is the only force in the horizontal direction, Newton's second law says it must equal the product of the car's mass (m) and its acceleration (a).So if we know the mass of the car (m) and the coefficient of friction (μ), we can calculate the acceleration. This is going to be useful. First, however, there's another factor we have to look at—engine power.Constant-Power ModelSuppose you have a nice sports car. It's red and has a nice sound system, but most importantly it's a Porsche 911 Carrera with a 379-horsepower engine. We can use this power figure to model the motion of a car on the track. Power is something everyone thinks they understand, but most people can't define it. So here you go: Power is the rate of change in energy.A car has kinetic energy (K) by virtue of its being in motion. The amount of kinetic energy depends on the mass of the car and its velocity (v).Let's say we have a tiny car with a power of 100 watts (1 horsepower = 735 watts). If this car starts from rest, after one second it'll have a kinetic energy of 100 joules (since 1 watt = 1 joule per second). If the car has a mass of 2 kilograms, that would give it a velocity of 10 meters per second after one second. If you double the mass (to 4 kg), it would be 7.1 meters per second.What happens to the velocity of the 2-kg car during the next second if we assume the power is constant? It will again increase in kinetic energy by an amount of 100 joules. However, since it started at 10 m/s and this starting velocity is squared, its new velocity will be 14.1 m/s (an increase of only 4.1 m/s) at the two-second mark. And so on. With constant power, the gain in speed with each successive second gets smaller. That's how power works.If we apply this idea to a real car (I'm sticking with the Porsche 911), we can see how long it would take to run the quarter-mile track. I'm going to convert the power to watts and the distance to meters—it's just easier that way. The Porsche's mass is 1,493 kilograms (3,291 pounds), which gives me the following plot of velocity vs. time. As you can see, at 10 seconds the 911 is going 63 m/s (140 mph).This constant-power model looks nice. It shows that the car increases in speed but not to infinity and beyond. As it goes faster, it's acceleration (the slope of the velocity curve) decreases. Seems real.Not so fast! There's a problem with this model: At the start of the race, the slope of the curve is essentially vertical. That means it would have an infinite acceleration. According to friction, that's just not possible. Looking back at our equation for the acceleration based on the friction, the highest acceleration would be:Notice that the mass has canceled out. It doesn't matter if you have a more massive vehicle. Yes, you get more friction, but it's also more difficult to accelerate.Constant-Friction ModelSince constant power doesn't work, what about a constant acceleration due to the friction between the tires and road? Let's say the coefficient of friction is 0.7 (fairly reasonable for a dry road). In that case we would get the following plot of velocity versus time for the quarter-mile run.I've included the constant-power curve just for comparison. You can see that with this friction model, the car will just keep increasing in speed forever with the same acceleration. That doesn't seem correct either.A Better Model of AccelerationHow about this? The car increases in velocity—however, the rate of increase (the acceleration) is the lower of the two models. So, at the beginning of the run the acceleration is limited by the friction between the tires and road. Then, when the acceleration using the constant power model is lower, we can use that method.Before we test this out, we need some real data for comparison. Since I don't own a Porsche 911, I'm going to use the data from this MotorTrend race between a 911 and a Tesla Cybertruck. Here is a plot of the actual position of the Porsche over the quarter-mile track along with the combo power-friction model. (That's now distance on the vertical axis—a quarter-mile is just about 400 meters.)It's not a perfect fit, but it could be. I lowered the power of the Porsche a bit in my model because not all of those 379 horses go into the kinetic energy of the car—it's not a perfectly efficient system. But still, this fairly powerful car hits a quarter-mile in 12.2 seconds with a final speed of 116.4 mph (from MotorTrend). Is it possible to get a lower time? Yes. With physics.Cheating With PhysicsThe dilemma is that our car is limited by the frictional force at the start. You can raise the coefficient with drag-car tires, but you won't be driving home on those. Alternatively, you can boost the friction by increasing the mass of a car. But then you also have more mass that needs to accelerate, so you don't gain anything. The key is to increase the frictional force without increasing the mass.Now, there are “super cars” that can do the quarter mile in a crazy 10 seconds. (The sticker prices are crazy too.) But forget that. What if I told you there's a road-legal “hypercar” that can do it in under 8 seconds? True fact. The McMurtry Spéirling clocked a time of 7.97 seconds, even on a slightly wet road. The secret? It has fans that pull air out from underneath, creating a pocket of low air pressure that sucks the car downward.Let me just go ahead and draw a force diagram for a car with a fan.Even though there's an extra downward pushing force (Ffan), the car stays on the ground and still has a zero acceleration in the vertical direction. In this case, Newton's second law looks like this:With the extra downward force, the only way for the forces to add up to zero is if the normal force increases. This means the frictional force is greater, so the new acceleration is greater.Now instead of getting a maximum acceleration of 6 to 7 meters per second squared, it's possible to get much higher values—maybe 15 or even 20 m/s2. The McMurtry Spéirling in the video went from 0 to 60 mph in … wait for it … 1.4 seconds. Just thinking about that will pin your ears back.The fan idea isn't new. In 1978, the Brabham BT46B used it to win the Formula 1 Swedish Grand Prix, but it was quickly banned. The idea of increasing downward force lives on, however. F1 cars today channel airflow through the body in clever ways to achieve some of the same “ground effect”—justified by saying their purpose is to cool the engine.While these airflow systems do help cool the engine, everyone knows the real purpose is to generate low pressure under the car to suction it closer to the road. In fact, the new McLaren W1 that we recently reviewed is a road car that makes this the sales pitch. (You can buy one for $2.6 million—or you could have if you'd signed up in time. McLaren is making only 399.)The cool part is that this higher acceleration isn't just for increasing your speed. It also allows the car to slow down faster and even make sharper turns, since these are also types of acceleration. The downward thrust can turn a fast car into a crazy-fast car—if that's what you want. For me, I'm happy as long as it's a red car and it drives.",
  "image": "https://media.wired.com/photos/6707e8df1410f36be01e1302/191:100/w_1280,c_limit/GettyImages-471316067.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003ePeople with fast street cars like to put them through their paces at the quarter-mile track. One way to get your quarter-mile time is to just buckle up and put the pedal to the metal. But if your car\u0026#39;s design is suboptimal, you won\u0026#39;t be taking home the bragging rights.\u003c/p\u003e\u003cp\u003eSo here\u0026#39;s this week\u0026#39;s question: Can automotive engineers predict a car\u0026#39;s quarter-mile time using physics? And could the physics suggest some tricks to make a car faster? Yes and yes! Let\u0026#39;s see how.\u003c/p\u003e\u003ch2\u003eSimple Model for an Accelerating Car\u003c/h2\u003e\u003cp\u003eWhen a car launches off the start, its increase in speed is described by its acceleration (the rate of change of velocity). But according to Newton\u0026#39;s second law, to increase velocity, you need a force pushing in the direction of travel.\u003c/p\u003e\u003cp\u003eWe can model the motion of a car with just three forces. There\u0026#39;s the downward-pulling gravitational force (= mass, \u003cstrong\u003em\u003c/strong\u003e, times the gravitational field, \u003cstrong\u003eg\u003c/strong\u003e). There is also the interaction between the car and the road. It\u0026#39;s useful to split this into two forces: One, perpendicular to the ground, is called the “normal force” (\u003cstrong\u003eF\u003csub\u003eN\u003c/sub\u003e\u003c/strong\u003e). It\u0026#39;s the resistance of the ground to gravity—what keeps a car from plunging to the center of the Earth. The other force, friction (\u003cstrong\u003eF\u003csub\u003ef\u003c/sub\u003e\u003c/strong\u003e), acts parallel to the ground. Here\u0026#39;s a picture:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIt\u0026#39;s the forward-pushing frictional force that makes the car accelerate. (Yes, this is powered by the engine, but the force is exerted where the rubber hits the road.) This frictional force depends on two things: the types of surfaces interacting, captured by a friction coefficient, \u003cstrong\u003eμ\u003c/strong\u003e, and the normal force (\u003cstrong\u003eF\u003csub\u003eN\u003c/sub\u003e\u003c/strong\u003e) pushing these surfaces together. With that, we get the following maximum frictional force:\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe frictional force that drives the car ahead depends on the specific materials in contact (captured by a friction coefficient, \u003cstrong\u003eμ\u003c/strong\u003e) and the normal force.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eWe can quantify this by looking up the friction coefficient (around 0.7 for tires and asphalt) and calculating the normal force. Since the car stays on the ground, the acceleration in the vertical direction is zero. This means the net force in the vertical direction must be zero. So the normal force and the gravitational force must be equal.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThis gives us a value for the maximum frictional force (\u003cstrong\u003eF\u003csub\u003ef\u003c/sub\u003e\u003c/strong\u003e). Since this is the only force in the horizontal direction, Newton\u0026#39;s second law says it must equal the product of the car\u0026#39;s mass (\u003cstrong\u003em\u003c/strong\u003e) and its acceleration (\u003cstrong\u003ea\u003c/strong\u003e).\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSo if we know the mass of the car (\u003cstrong\u003em\u003c/strong\u003e) and the coefficient of friction (\u003cstrong\u003eμ\u003c/strong\u003e), we can calculate the acceleration. This is going to be useful. First, however, there\u0026#39;s another factor we have to look at—engine power.\u003c/p\u003e\u003ch2\u003eConstant-Power Model\u003c/h2\u003e\u003cp\u003eSuppose you have a nice sports car. It\u0026#39;s red and has a nice sound system, but most importantly it\u0026#39;s a Porsche 911 Carrera with a 379-horsepower engine. We can use this power figure to model the motion of a car on the track. Power is something everyone thinks they understand, but most people can\u0026#39;t define it. So here you go: Power is the rate of change in energy.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eA car has kinetic energy (\u003cstrong\u003eK\u003c/strong\u003e) by virtue of its being in motion. The amount of kinetic energy depends on the mass of the car and its velocity (\u003cstrong\u003ev\u003c/strong\u003e).\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eLet\u0026#39;s say we have a tiny car with a power of 100 watts (1 horsepower = 735 watts). If this car starts from rest, after one second it\u0026#39;ll have a kinetic energy of 100 joules (since 1 watt = 1 joule per second). If the car has a mass of 2 kilograms, that would give it a velocity of 10 meters per second after one second. If you double the mass (to 4 kg), it would be 7.1 meters per second.\u003c/p\u003e\u003cp\u003eWhat happens to the velocity of the 2-kg car during the next second if we assume the power is constant? It will again increase in kinetic energy by an amount of 100 joules. However, since it started at 10 m/s and this starting velocity is squared, its new velocity will be 14.1 m/s (an increase of only 4.1 m/s) at the two-second mark. And so on. With constant power, the gain in speed with each successive second gets smaller. That\u0026#39;s how power works.\u003c/p\u003e\u003cp\u003eIf we apply this idea to a real car (I\u0026#39;m sticking with the Porsche 911), we can see how long it would take to run the quarter-mile track. I\u0026#39;m going to convert the power to watts and the distance to meters—it\u0026#39;s just easier that way. The Porsche\u0026#39;s mass is 1,493 kilograms (3,291 pounds), which gives me the following plot of velocity vs. time. As you can see, at 10 seconds the 911 is going 63 m/s (140 mph).\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThis constant-power model looks nice. It shows that the car increases in speed but not to infinity and beyond. As it goes faster, it\u0026#39;s acceleration (the slope of the velocity curve) decreases. Seems real.\u003c/p\u003e\u003cp\u003eNot so fast! There\u0026#39;s a problem with this model: At the start of the race, the slope of the curve is essentially vertical. That means it would have an infinite acceleration. According to friction, that\u0026#39;s just not possible. Looking back at our equation for the acceleration based on the friction, the highest acceleration would be:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eNotice that the mass has canceled out. It doesn\u0026#39;t matter if you have a more massive vehicle. Yes, you get more friction, but it\u0026#39;s also more difficult to accelerate.\u003c/p\u003e\u003ch2\u003eConstant-Friction Model\u003c/h2\u003e\u003cp\u003eSince constant power doesn\u0026#39;t work, what about a constant acceleration due to the friction between the tires and road? Let\u0026#39;s say the coefficient of friction is 0.7 (fairly reasonable for a dry road). In that case we would get the following plot of velocity versus time for the quarter-mile run.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eI\u0026#39;ve included the constant-power curve just for comparison. You can see that with this friction model, the car will just keep increasing in speed forever with the same acceleration. That doesn\u0026#39;t seem correct either.\u003c/p\u003e\u003ch2\u003eA Better Model of Acceleration\u003c/h2\u003e\u003cp\u003eHow about this? The car increases in velocity—however, the rate of increase (the acceleration) is the lower of the two models. So, at the beginning of the run the acceleration is limited by the friction between the tires and road. Then, when the acceleration using the constant power model is lower, we can use that method.\u003c/p\u003e\u003cp\u003eBefore we test this out, we need some real data for comparison. Since I don\u0026#39;t own a Porsche 911, I\u0026#39;m going to use the data from this MotorTrend \u003ca data-offer-url=\"https://www.motortrend.com/reviews/tesla-cybertruck-beast-vs-porsche-911-carrera-t-drag-race-towing-rematch\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.motortrend.com/reviews/tesla-cybertruck-beast-vs-porsche-911-carrera-t-drag-race-towing-rematch\u0026#34;}\" href=\"https://www.motortrend.com/reviews/tesla-cybertruck-beast-vs-porsche-911-carrera-t-drag-race-towing-rematch\" rel=\"nofollow noopener\" target=\"_blank\"\u003erace between a 911 and a Tesla Cybertruck\u003c/a\u003e. Here is a plot of the actual position of the Porsche over the quarter-mile track along with the combo power-friction model. (That\u0026#39;s now distance on the vertical axis—a quarter-mile is just about 400 meters.)\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIt\u0026#39;s not a perfect fit, but it could be. I lowered the power of the Porsche a bit in my model because not all of those 379 horses go into the kinetic energy of the car—it\u0026#39;s not a perfectly efficient system. But still, this fairly powerful car hits a quarter-mile in 12.2 seconds with a final speed of 116.4 mph (from MotorTrend). Is it possible to get a lower time? Yes. With physics.\u003c/p\u003e\u003ch2\u003eCheating With Physics\u003c/h2\u003e\u003cp\u003eThe dilemma is that our car is limited by the frictional force at the start. You can raise the coefficient with drag-car tires, but you won\u0026#39;t be driving home on those. Alternatively, you can boost the friction by increasing the mass of a car. But then you also have more mass that needs to accelerate, so you don\u0026#39;t gain anything. \u003cem\u003eThe key is to increase the frictional force without increasing the mass\u003c/em\u003e.\u003c/p\u003e\u003cp\u003eNow, there are “super cars” that can do the quarter mile in a crazy 10 seconds. (The sticker prices are crazy too.) But forget that. What if I told you there\u0026#39;s a road-legal “hypercar” that can do it in under 8 seconds? True fact. The \u003ca href=\"https://www.youtube.com/watch?v=TptzkkbC1vE\"\u003eMcMurtry Spéirling clocked a time of 7.97 seconds\u003c/a\u003e, even on a slightly wet road. The secret? It has fans that pull air out from underneath, creating a pocket of low air pressure that sucks the car downward.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eLet me just go ahead and draw a force diagram for a car with a fan.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eEven though there\u0026#39;s an extra downward pushing force (\u003cstrong\u003eF\u003csub\u003efan\u003c/sub\u003e\u003c/strong\u003e), the car stays on the ground and still has a zero acceleration in the vertical direction. In this case, Newton\u0026#39;s second law looks like this:\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eWith the extra downward force, the only way for the forces to add up to zero is if the normal force increases. This means the frictional force is greater, so the new acceleration is greater.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eNow instead of getting a maximum acceleration of 6 to 7 meters per second squared, it\u0026#39;s possible to get much higher values—maybe 15 or even 20 m/s\u003csup\u003e2\u003c/sup\u003e. The McMurtry Spéirling in the video went from 0 to 60 mph in … wait for it … 1.4 seconds. Just thinking about that will pin your ears back.\u003c/p\u003e\u003cp\u003eThe fan idea isn\u0026#39;t new. In 1978, the Brabham BT46B used it to win the Formula 1 Swedish Grand Prix, but it was quickly banned. The idea of increasing downward force lives on, however. F1 cars today channel airflow through the body in clever ways to achieve some of the same “ground effect”—justified by saying their purpose is to cool the engine.\u003c/p\u003e\u003cp\u003eWhile these airflow systems do help cool the engine, everyone knows the real purpose is to generate low pressure under the car to suction it closer to the road. In fact, the new \u003ca href=\"https://www.wired.com/story/mclarens-w1-dollar26m-supercar-is-in-places-mightier-than-an-f1-car/\"\u003eMcLaren W1 that we recently reviewed\u003c/a\u003e is a road car that makes this the sales pitch. (You can buy one for $2.6 million—or you could have if you\u0026#39;d signed up in time. McLaren is making only 399.)\u003c/p\u003e\u003cp\u003eThe cool part is that this higher acceleration isn\u0026#39;t just for increasing your speed. It also allows the car to slow down faster and even make sharper turns, since these are also types of acceleration. The downward thrust can turn a fast car into a crazy-fast car—if that\u0026#39;s what you want. For me, I\u0026#39;m happy as long as it\u0026#39;s a red car and it drives.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-18T14:59:22.94-04:00",
  "modifiedTime": "2024-10-18T18:59:22.94Z"
}
