{
  "id": "14357075-8e92-4b7e-aae1-a4711c6c64fa",
  "title": "Ancient cemeteries and rock art discovered on Morocco's Tangier Peninsula",
  "link": "https://phys.org/news/2025-05-ancient-cemeteries-art-morocco-tangier.html",
  "description": "A trio of archaeologists from the University of Barcelona and the University of Castilla-La Mancha, both in Spain, and the National Institute of Archaeology and Heritage in Morocco have discovered three ancient cemeteries on the Tangier Peninsula. In their study, published in the journal African Archaeological Review, Hamza Benattia, Jorge Onrubia-Pintado and Youssef Bokbot conducted fieldwork on the peninsula.",
  "author": "",
  "published": "Sat, 17 May 2025 11:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Archaeology"
  ],
  "byline": "Bob Yirka",
  "length": 2949,
  "excerpt": "A trio of archaeologists from the University of Barcelona and the University of Castilla-La Mancha, both in Spain, and the National Institute of Archaeology and Heritage in Morocco have discovered three ancient cemeteries on the Tangier Peninsula. In their study, published in the journal African Archaeological Review, Hamza Benattia, Jorge Onrubia-Pintado and Youssef Bokbot conducted fieldwork on the peninsula.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Images of the newly discovered cist cemeteries and tumuli. (a) Daroua Zaydan; (b) Oulad Zin. Credit: Hamza Benattia; African Archaeological Review (2025). DOI: 10.1007/s10437-025-09621-z A trio of archaeologists from the University of Barcelona and the University of Castilla-La Mancha, both in Spain, and the National Institute of Archaeology and Heritage in Morocco have discovered three ancient cemeteries on the Tangier Peninsula. In their study, published in the journal African Archaeological Review, Hamza Benattia, Jorge Onrubia-Pintado and Youssef Bokbot conducted fieldwork on the peninsula. The Tangier Peninsula, which lies on the northwest tip of Africa, in Morocco, just south of the Strait of Gibraltar, is one of the least-understood parts of the Mediterranean region. The researchers traveled to the area and conducted fieldwork. They discovered three ancient cemeteries, one of which held a stone burial dated to approximately 4,000 years ago. The team also found several rock shelters with painted rock art and also several standing stones. The goal of the research team was to find dig sites containing evidence of human existence from 500 BC to 3000 BC. As they dug at several sites, they uncovered evidence of cist burials in some of the cemeteries they discovered. Such burials were conducted by digging holes into rock, placing a body in the hole, and then covering it with a stone slab. This type of burial, they note, would require a great deal of work, given the limited tool set of the time. The researchers also used radiocarbon dating on human remains that were found in one of the cist burials, and found that the person who had been placed in the cist was from some time around 2000 BC. They note that their use of radiocarbon dating was the first to be done on a cist burial site in any part of northwest Africa. The researchers also found multiple instances of human-built shelters, many with shapes painted on them. They note that some of the pictures were similar to ancient pictures found in the Sahara Desert. They found multiple examples of standing rocks and stones located at both the cemeteries and the sites where the painted rocks were found—with one approximately 2.5 meters tall. They note that standing stones were used by many ancient peoples as a way to mark territory. More information: Hamza Benattia et al, Cemeteries, Rock Art and Other Ritual Monuments of the Tangier Peninsula, Northwestern Africa, in Wider Trans-Regional Perspective (c. 3000–500 BC), African Archaeological Review (2025). DOI: 10.1007/s10437-025-09621-z © 2025 Science X Network",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/ancient-cemeteries-fou.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n        \u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1216433\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/2025/ancient-cemeteries-fou.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/ancient-cemeteries-fou.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/ancient-cemeteries-fou.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/ancient-cemeteries-fou.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/ancient-cemeteries-fou.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/ancient-cemeteries-fou.jpg\" width=\"800\" height=\"530\" alt=\"Ancient cemeteries found on Tangier Peninsula\" title=\"Images of the newly discovered cist cemeteries and tumuli. (a) Daroua Zaydan; (b) Oulad Zin. Credit: Hamza Benattia; African Archaeological Review (2025). DOI: 10.1007/s10437-025-09621-z\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eImages of the newly discovered cist cemeteries and tumuli. (a) Daroua Zaydan; (b) Oulad Zin. Credit: Hamza Benattia; \u003ci\u003eAfrican Archaeological Review\u003c/i\u003e (2025). DOI: 10.1007/s10437-025-09621-z\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eA trio of archaeologists from the University of Barcelona and the University of Castilla-La Mancha, both in Spain, and the National Institute of Archaeology and Heritage in Morocco have discovered three ancient cemeteries on the Tangier Peninsula. In their study, \u003ca href=\"https://link.springer.com/10.1007/s10437-025-09621-z\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eAfrican Archaeological Review,\u003c/i\u003e Hamza Benattia, Jorge Onrubia-Pintado and Youssef Bokbot conducted fieldwork on the peninsula.\u003c/p\u003e\n\n                \n                                \n                \n                                    \u003cp\u003eThe Tangier Peninsula, which lies on the northwest tip of Africa, in Morocco, just south of the Strait of Gibraltar, is one of the least-understood parts of the Mediterranean region. The researchers traveled to the area and conducted fieldwork. They discovered three ancient cemeteries, one of which held a stone \u003ca href=\"https://phys.org/tags/burial/\" rel=\"tag\"\u003eburial\u003c/a\u003e dated to approximately 4,000 years ago. The team also found several \u003ca href=\"https://phys.org/tags/rock+shelters/\" rel=\"tag\"\u003erock shelters\u003c/a\u003e with painted \u003ca href=\"https://phys.org/tags/rock+art/\" rel=\"tag\"\u003erock art\u003c/a\u003e and also several standing stones.\u003c/p\u003e\n\u003cp\u003eThe goal of the research team was to find dig sites containing evidence of human existence from 500 BC to 3000 BC. As they dug at several sites, they uncovered evidence of cist burials in some of the cemeteries they discovered. Such burials were conducted by digging holes into rock, placing a body in the hole, and then covering it with a stone slab. This type of burial, they note, would require a great deal of work, given the limited tool set of the time.\u003c/p\u003e\n\u003cp\u003eThe researchers also used radiocarbon dating on \u003ca href=\"https://phys.org/tags/human+remains/\" rel=\"tag\"\u003ehuman remains\u003c/a\u003e that were found in one of the cist burials, and found that the person who had been placed in the cist was from some time around 2000 BC. They note that their use of radiocarbon dating was the first to be done on a cist burial site in any part of northwest Africa.\u003c/p\u003e\n\u003cp\u003eThe researchers also found multiple instances of human-built shelters, many with shapes painted on them. They note that some of the pictures were similar to ancient pictures found in the Sahara Desert. They found multiple examples of standing rocks and stones located at both the cemeteries and the sites where the painted rocks were found—with one approximately 2.5 meters tall. They note that standing stones were used by many \u003ca href=\"https://phys.org/tags/ancient+peoples/\" rel=\"tag\"\u003eancient peoples\u003c/a\u003e as a way to mark territory.\u003c/p\u003e\n\n                \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Hamza Benattia et al, Cemeteries, Rock Art and Other Ritual Monuments of the Tangier Peninsula, Northwestern Africa, in Wider Trans-Regional Perspective (c. 3000–500 BC), \u003ci\u003eAfrican Archaeological Review\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1007/s10437-025-09621-z\" target=\"_blank\"\u003eDOI: 10.1007/s10437-025-09621-z\u003c/a\u003e\n                            \u003c/p\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                \n\n                                    \u003cp\u003e© 2025 Science X Network\u003c/p\u003e\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\n\t\t  \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-05-17T11:00:01-04:00",
  "modifiedTime": null
}
