{
  "id": "2277fa22-f41f-44d0-b9c9-f9e55a426c32",
  "title": "A Public Health Researcher and Her Engineer Husband Found How Diseases Can Spread through Air Decades before the COVID Pandemic",
  "link": "https://www.scientificamerican.com/article/a-public-health-researcher-and-her-engineer-husband-found-how-diseases-can/",
  "description": "Mildred Weeks Wells and her husband figured out that disease-causing pathogens can spread through the air like smoke",
  "author": "",
  "published": "Thu, 22 May 2025 16:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Carol Sutton Lewis, Luca Evans, The Lost Women of Science Initiative",
  "length": 33517,
  "excerpt": "Mildred Weeks Wells and her husband figured out that disease-causing pathogens can spread through the air like smoke",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "Air-Borne: The Hidden History of the Life We Breathe, by Carl Zimmer, charts the history of the field of aerobiology: the science of airborne microorganisms. In this episode, we discover the story of two lost pioneers of the 1930s: physician and self-taught epidemiologist Mildred Weeks Wells and her husband, sanitary engineer William Firth Wells. Together, they proved that infectious pathogens could spread through the air over long distances. But the two had a reputation as outsiders, and they failed to convince the scientific establishment, who ignored their findings for decades. What the pair figured out could have saved many lives from tuberculosis, SARS, COVID and other airborne diseases. The contributions of Mildred Weeks Wells and her husband were all but erased from history—until now.LISTEN TO THE PODCASTOn supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.TRANSCRIPTCarl Zimmer: Mildred is hired in the late 1920s to put together everything that was known about polio. And she does this incredible study, where she basically looks for everything that she can find about how polio spreads.At the time, the idea that it could spread through the air was really looked at as being just an obsolete superstition. Public health experts would say, look, a patient's breath is basically harmless. But the epidemiology looks to her like these germs are airborne, and this goes totally against the consensus at the time.Carol Sutton Lewis: Hello, I'm Carol Sutton Lewis. Welcome to the latest episode of Lost Women of Science Conversations, where we talk with authors and artists who've discovered and celebrated female scientists in books, poetry, film, and the visual arts.Today I'm joined by Carl Zimmer, an award-winning New York Times columnist and the author of 15 books about science. His latest book, Airborne: The Hidden History of the Life We Breathe, focuses on the last great biological frontier: the air. It presents the history of aerobiology, which is the science dealing with the occurrence, transportation, and effects of airborne microorganisms.The book chronicles the exploits of committed aerobiologists from the early pioneers through to the present day. Among these pioneers were Mildred Weeks Wells and her husband, William Firth Wells.Airborne tells the story of how Mildred and William tried to sound the alarm about airborne infections, but for many reasons, their warnings went unheard.Welcome, Carl Zimmer. It's such a pleasure to have you with us to tell us all about this fascinating woman and her contributions to science.Can you please tell us about Mildred Weeks Wells—where and how she grew up and what led her to the field of aerobiology?Carl Zimmer: She was born in 1891, and she came from a very prominent Texas family—the Denton family. Her great-grandfather is actually whom the city of Denton, Texas is named after. Her grandfather was a surgeon for the Confederate Army in the Civil War, and he becomes the director of what was called then the State Lunatic Asylum.And he and the bookkeeper there, William Weeks, are both charged with embezzlement. It's a big scandal. The bookkeeper then marries Mildred's mother. Then, shortly after Mildred's born, her father disappears. Her mother basically abandons her with her grandmother. And she grows up with her sister and grandmother in Austin, Texas. A comfortable life, but obviously there's a lot of scandal hanging over them.She is clearly incredibly strong-willed. She goes to medical school at the University of Texas and graduates in 1915, one of three women in a class of 34. That is really something for a woman at that point—there were hardly any women with medical degrees in the United States, let alone someone in Texas.But she books out of there. She does not stick around. She heads in 1915 to Washington, D.C., and works at the Public Health Service in a lab called the Hygienic Laboratory. Basically, what they're doing is studying bacteria. You have to remember, this is the golden age of the germ theory of disease. People have been figuring out that particular bacteria or viruses cause particular diseases, and that knowledge is helping them fight those diseases.It's there in Washington at this time that she meets a man who will become her husband, William Firth Wells.Carol Sutton Lewis: Just a quick aside—because we at Lost Women of Science are always interested in how you discover the material in addition to what you've discovered. How were you able to piece together her story? What sources were you able to find? It seems like there wasn't a lot of information available.Carl Zimmer: Yeah, it was a tough process. There is little information that's really easy to get your hands on. I mean, there is no biography of Mildred Wells or her husband, William Firth Wells.At the Rockefeller archives, they had maybe 30 document boxes full of stuff that was just miraculously conserved there. There are also letters that she wrote to people that have been saved in various collections.But especially with her early years, it's really tough. You know, in all my work trying to dig down for every single scrap of information I could find of her, I have only found one photograph of her—and it's the photograph in her yearbook. That’s it.Carol Sutton Lewis: You talked about that photograph in the book, and I was struck by your description of it. You say that she's smiling, but the longer you look at her smile, the sadder it becomes. What do you think at that young age was the source of the sadness?Carl Zimmer: I think that Mildred grew up with a lot of trauma. She was not the sort of person to keep long journals or write long letters about these sorts of things. But when you've come across those clues in these brief little newspaper accounts, you can kind of read between the lines.There are reports in newspapers saying that Mildred's mother had come to Austin to pay a visit to Mildred because she had scarlet fever when she was 10, and then she goes away again. And when I look at her face in her yearbook, it doesn't surprise me that there is this cast of melancholy to it because you just think about what she had gone through just as a kid.Carol Sutton Lewis: Oh. Absolutely. And fast forward, she meets William and they marry. They have a son, and they start collaborating. How did that begin?Carl Zimmer: The collaboration takes a while. So William Wells is also working at the Public Health Service at the time. He is a few years older than Mildred and he has been trained at MIT as what was called then a sanitarian. In other words, he was going to take the germ theory of disease and was going to save people's lives.He was very clever. He could invent tests that a sanitarian could use, dip a little tube into a river and see whether the water was safe or not, things like that. He was particularly focused on keeping water clean of bacteria that could cause diseases like typhoid or cholera and he also, gets assigned by the government to study oysters because oysters, they sit in this water and they're filtering all day long. And you know, if there's bacteria in there, they're going to filter it and trap it in their tissues. And oysters are incredibly popular in the early nineteen hundreds and a shocking number of people are keeling over dying of typhoid because they're eating them raw. So William is very busy, figuring out ways to save the oyster industry. How do we purify oysters and things like that? They meet, they get married in 1917.In 1918 they have a child, William Jr. nicknamed Bud. But William is not around for the birth, because he is drafted into the army, and he goes off to serve. in World War I.Carol Sutton Lewis: So Mildred is at home with Bud and William's off at the war. But ultimately, Mildred returns to science. A few years later, where she is hired as a polio detective. Can you tell me a little bit about what the state of polio knowledge was at the time and what precisely a polio detective did?Carl Zimmer: It doesn't seem like polio really was a thing in the United States until the late 1800s. And then suddenly there's this mysterious disease that can strike children with no warning. These kids can't. walk, or suddenly these kids are dying. Not only are the symptoms completely terrifying to parents, but how it spreads is a complete mystery. And so Mildred, seems to have been hired at some point in the late 1920s To basically put together everything that was known about polio to help doctors to deal with their patients and to, you know, encourage future science to try to figure out what is this disease.You know, Mildred wasn't trained in epidemiology. So it's kind of remarkable that she taught herself. And she would turn out to be a really great epidemiologist. But, in any case, She gets hired by the International Committee for the Study of Infantile Paralysis, that was the name then for polio. And she does this incredible study, where she basically looks for everything that she can find about how polio spreads. Case studies where, in a town, like this child got polio, then this child did, and did they have contact and what sort of contact, what season was it? What was the weather like? All these different factors.And one thing that's really important to bear in mind is that, at this time, the prevailing view was that diseases spread by water, by food, by sex, by close contact. Maybe like someone just coughs and sprays droplets on you, but otherwise it's these other routes.The idea that it could spread through the air was really looked at as being just obsolete superstition. for thousands of years, people talked about miasmas, somehow the air mysteriously became corrupted and that made people sick with different diseases. That was all thrown out in the late 1800s, early 1900s when germ theory really takes hold. And so public health experts would say, look, a patient's breath is basically harmless.Carol Sutton Lewis: But Mildred doesn't agree, does she?Carl Zimmer: Well, Mildred Wells is looking at all of this, data and she is starting to get an idea that maybe these public health experts have been too quick to dismiss the air. So when people are talking about droplet infections in the 1920s, they're basically just talking about, big droplets that someone might just sneeze in your face. But the epidemiology looks to her like these germs are airborne, are spreading long distances through the air.So Mildred is starting to make a distinction in her mind about what she calls airborne and droplet infections. So, and this is really the time that the Wellses collectively are thinking about airborne infection and it's Mildred is doing it. And William actually gives her credit for this later on.Carol Sutton Lewis: Right. and her results are published in a book about polio written entirely by female authors, which is quite unusual for the time.Carl Zimmer: Mm hmm. Right. The book is published in 1932, and the reception just tells you so much about what it was like to be a woman in science. The New England Journal of Medicine reviews the book, which is great. But, here's a line that they give, they say, it is interesting to note that this book is entirely the product of women in medicine and is the first book.So far as a reviewer knows. by a number of authors, all of whom are of the female sex. So it's this: Oh, look at this oddity. And basically, the virtue of that is that women are really thorough, I, guess. so it's a very detailed book. And the reviewer writes, no one is better fitted than a woman to collect data such as this book contains. So there's no okay, this is very useful.Carol Sutton Lewis: PatronizeCarl Zimmer: Yeah. Thank you very much. Reviewers were just skating over the conclusions that they were drawing, I guess because they were women. Yeah, pretty incredible.Carol Sutton Lewis: So she is the first to submit scientific proof about this potential for airborne transmission. And that was pretty much dismissed. It wasn't even actively dismissed.It was just, nah, these women, nothing's coming outta that, except William did pay attention. I believe he too had been thinking about airborne transmission for some time and then started seriously looking at Mildred's conclusion when he started teaching at Harvard.Carl Zimmer: Yeah. So, William gets a job as a low level instructor at Harvard. He's getting paid very little. Mildred has no income. He's teaching about hygiene and sanitation, but apparently he's a terrible teacher. But he is a clever, brilliant engineer and scientist; he very quickly develops an idea that probably originated in the work that Mildred had been doing on polio. that maybe diseases actually can spread long distances through the air. So there are large droplets that we might sneeze out and cough out and, and they go a short distance before gravity pulls them down. But physics dictates that below a certain size, droplets can resist gravity.This is something that's going totally against what all the, the really prominent public health figures are saying. William Wells doesn't care. He goes ahead and he starts to, invent a way to sample air for germs. Basically it's a centrifuge. You plug it in, the fan spins, it sucks in air, the air comes up inside a glass cylinder and then as it's spinning, if there are any droplets of particles or anything floating in the air, they get flung out to the sideS.And so afterwards you just pull out the glass which is coated with, food for microbes to grow on and you put it in a nice warm place. And If there's anything in the air, you'll be able to grow a colony and see it.Carol Sutton Lewis: Amazing.Carl Zimmer: It is amazing. This, this was a crucial inventionCarol Sutton Lewis: So we have William, who is with Mildred's help moving more towards the possibility of airborne infection, understanding that this is very much not where science is at the moment, and he conducts a really interesting experiment in one of his classrooms to try to move the theory forward. We'll talk more about that experiment when we come back after the break.MidrollCarol Sutton Lewis: Welcome back to Lost Women of Science Conversations. We left off as the Wellses were about to conduct an experiment to test their theories about airborne infections. Carl, can you tell us about that experiment?Carl Zimmer: Okay. it's 1934, It's a cold day. Students come in for a lecture from this terrible teacher, William Wells. The windows are closed. The doors are closed. It's a poorly ventilated room. About 20 minutes before the end of the class, he takes this weird device that's next to him, he plugs it into the wall, and then he just goes back and keeps lecturing.It's not clear whether he even told them what he was doing. But, he then takes this little pinch of sneezing powder. out of a jar and holds it in the sort of outflow from the fan inside the air centrifuge. So all of a sudden, poof, the sneezing powder just goes off into the air. You know, there are probably about a couple dozen students scattered around this lecture hall and after a while they start to sneeze. And in fact, people All the way in the [00:16:00] back are sneezing too.So now Wells turns off his machine, puts in a new cylinder, turns it on, keeps talking. The thing is that they are actually sneezing out droplets into the air.And some of those droplets contain harmless bacteria from their mouths. And he harvests them from the air. He actually collects them in his centrifuge. And after a few days, he's got colonies of these bacteria, but only after he had released the sneezing powder, the one before that didn't have any.So, you have this demonstration that William Wells could catch germs in the air that had been released from his students at quite a distance away, And other people can inhale them, and not even realize what's happening. In other words, germs were spreading like smoke. And so this becomes an explanation for what Mildred had been seeing in her epidemiology..Carol Sutton Lewis: Wow. That was pretty revolutionary. But how was it received?Carl Zimmer: Well, you know, At first it was received, With great fanfare, and he starts publishing papers in nineteen thirty he and Mildred are coauthors on these. And, Mildred is actually appointed as a research associate at Harvard, in nineteen thirty it's a nice title, but she doesn't get paid anything. And then William makes another discovery, which is also very important.He's thinking okay, if these things are floating in the air, is there a way that I can disinfect the air? And he tries all sorts of things and he discovers ultraviolet light works really well. In fact, you can just put an ultraviolet light in a room and the droplets will circulate around and as they pass through the ultraviolet rays, it kills the bacteria or viruses inside of them. So in 1936, when he's publishing these results, there are so many headlines in newspapers and magazines and stuff about this discovery.There's one headline that says, scientists fight flu germs with violet ray. And, there are these predictions that, we are going to be safe from these terrible diseases. Like for example, influenza, which had just, devastated the world not long beforehand, because you're going to put ultraviolet lights in trains and schools and trolleys and movie theaters.Carol Sutton Lewis: Did Mildred get any public recognition for her contributions to all of this?Carl Zimmer: Well not surprisingly, William gets the lion's share of the attention. I mean, there's a passing reference to Mildred in one article. The Associated Press says chief among his aides, Wells said, was his wife, Dr. Mildred Wells. So, William was perfectly comfortable, acknowledging her, but the reporters. Didn't care,Carol Sutton Lewis: And there were no pictures of herCarl Zimmer: Right. Mildred wasn't the engineer in that couple, but she was doing all the research on epidemiology. And you can tell from comments that people made about, and Mildred Wells is that. William would be nowhere as a scientist without Mildred. She was the one who kept him from jumping ahead to wild conclusions from the data he had so far. So they were, they're very much a team. She was doing the writing and they were collaborating, they were arguing with each other all the time about it And she was a much better writer than he was., but that wasn't suitable for a picture, so she was invisible.Carol Sutton Lewis: In the book, you write a lot about their difficult personalities and how that impacted their reputations within the wider scientific community. Can you say more about that?Carl Zimmer: Right. They really had a reputation as being really hard to deal with. People would politely call them peculiar. And when they weren't being quite so polite, they would talk about all these arguments that they would get in, shouting matches and so on. They really felt that they had discovered something incredibly important, but they were outsiders, you know, they didn't have PhDs, they didn't have really much formal training. And here they were saying that, you know, the consensus about infectious disease is profoundly wrong.Now, ironically, what happened is that once William Wells showed that ultraviolet light could kill germs, his superior at Harvard abruptly took an intense interest in all of this and said, Okay, you're going to share a patent on this with me. My name's going to be on the patent and all the research from now on is going to happen in my lab. I'm going to have complete control over what happens next. And Mildred took the lead saying no way we want total autonomy, get out of our face. She was much more aggressive in university politics, and sort of protecting their turf. And unfortunately they didn't have many allies at Harvard and pretty soon they were out, they were fired. And William Wells and his boss, Gordon Fair, were both named on a patent that was filed for using ultraviolet lamps to disinfect the air.Carol Sutton Lewis: So what happened when they left Harvard?Carl Zimmer: Well, it's really interesting watching them scrambling to find work, because their reputation had preceded them. They were hoping they could go back to Washington DC to the public health service. But, the story about the Wells was that Mildred, was carrying out a lot of the research, and so they thought, we can't hire William if it's his wife, who's quietly doing a lot of the work, like they, for some reason they didn't think, oh, we could hire them both.Carol Sutton Lewis: Or just her.Carl Zimmer: None of that, they were like, do we hire William Wells? His wife apparently hauls a lot of the weight. So no, we won't hire them. It's literally like written down. It’s, I'm not making it up. And fortunately they had a few defenders, a few champions down in Philadelphia.There was a doctor in Philadelphia who was using ultraviolet light to protect children in hospitals. And he was, really, inspired by the Wellses and he knew they were trouble. He wrote yes, I get it. They're difficult, but let's try to get them here.And so they brought them down to Philadelphia and Mildred. And William, opened up the laboratories for airborne infection at the University of Pennsylvania. And now actually Mildred got paid, for the first time, for this work. So they're both getting paid, things are starting to look betterCarol Sutton Lewis: So they start to do amazing work at the University of Pennsylvania.Carl Zimmer: That's right. That's right. William, takes the next step in proving their theory. He figures out how to actually give animals diseases through the air. He builds a machine that gets to be known as the infection machine. a big bell jar, and you can put mice in there, or a rabbit in there, and there's a tube connected to it.And through that tube, William can create a very fine mist that might have influenza viruses in it, or the bacteria that cause tuberculosis. And the animals just sit there and breathe, and lo and behold, They get tuberculosis, they get influenza, they get all these diseases,Now, meanwhile, Mildred is actually spending a lot of her time at a school nearby the Germantown Friends School, where they have installed ultraviolet lamps in some of the classrooms. And they're convinced that they can protect kids from airborne diseases. The biggest demonstration of what these lamps can do comes in 1940, because there's a huge epidemic of measles. In 1940, there's, no vaccine for measles. Every kid basically gets it.And lo and behold, the kids in the classrooms with the ultraviolet lamps are 10 times less likely to get measles than the kids just down the hall in the regular classrooms. And so this is one of the best experiments ever done on the nature of airborne infection and how you can protect people by disinfecting the air.Carol Sutton Lewis: Were they then finally accepted into the scientific community?Carl Zimmer: I know you keep waiting for that, that victory lap, but no. It's just like time and again, that glory gets snatched away from them. Again, this was not anything that was done in secret. Newspapers around Philadelphia were. Celebrating this wow, look at this, look at how we can protect our children from disease. This is fantastic. But other experts, public health authorities just were not budging. they had all taken in this dogma that the air can't be dangerous.And so again and again, they were hitting a brick wall. This is right on the eve of World War II.And so all sorts of scientists in World War II are asking themselves, what can we do? Mildred and William put themselves forward and say we don't want soldiers to get sick with the flu the way they did in World War I. They're both haunted by this and they're thinking, so we could put our ultraviolet lamps in the barracks, we could protect them. Soldiers from the flu, if the flu is airborne, like we think, not only that, but this could help to really convince all those skepticsCarol Sutton Lewis: mm.Carl Zimmer: But they failed. The army put all their money into other experiments, they were blackballed, they were shut out, and again, I think it was just because they were continuing to be just incredibly difficult. Even patrons and their friends would just sigh to each other, like, Oh my God, I've just had to deal with these, with them arguing with us and yelling at us. And by the end of World War II, things are bad, they have some sort of split up, they never get divorced, but it's just too much. Mildred, like she is not only trying to do this pioneering work in these schools, trying to keep William's labs organized, there's the matter of their son. Now looking at some documents, I would hazard a guess that he had schizophrenia because he was examined by a doctor who came to that conclusion.And so, she's under incredible pressure and eventually she cracks and in 1944 she resigns from the lab. She stops working in the schools, she stops collaborating with her husband, but she keeps doing her own science. And that's really amazing to me. What kinds of things did she do after this breakup? What kind of work did she conduct? And how was that received?Mildred goes on on her own to carry out a gigantic experiment, in hindsight, a really visionary piece of work. It's based on her experience in Philadelphia. Because she could see that the ultraviolet lamps worked very well at protecting children during a really intense measles epidemic. And so she thought to herself, if you want to really make ultraviolet light, and the theory of airborne infection live up to its true potential to protect people. You need to protect the air in a lot more places.So she gets introduced to the health commissioner in Westchester County, this is a county just north of New York City. And she pitches him this idea. She says, I want to go into one of your towns and I want to put ultraviolet lights everywhere. And this guy, William Holla, he is a very bold, flamboyant guy. He's the right guy to ask. He's like, yeah, let's do this. And he leaves it up to her to design the experiment.And so this town Pleasantville in New York gets fitted out with ultraviolet lamps in the train station, in the fountain shops, in the movie theater, in churches, all over the place. And she publishes a paper with Holla in 1950 on the results.The results are mixed though. You look carefully at them, you can see that actually, yeah, the lamps worked in certain respects. So certain diseases, the rates were lower in certain places, but sadly, this incredibly ambitious study really didn't move the needle. And yeah, it was a big disappointment and that was the last science that Mildred did.Carol Sutton Lewis: Even when they were working together, Mildred and William never really succeeded in convincing the scientific community to take airborne infection seriously, although their work obviously did move the science forward. So what did sway scientific opinion and when?Carl Zimmer: Yeah, Mildred dies in 1957. William dies in 1963. After the Wellses are dead, their work is dismissed and they themselves are quite forgotten. It really isn't until the early 2000s that a few people rediscover them.The SARS epidemic kicks up in 2003, for example, and I talked to a scientist in Hong Kong named Yuguo Li, and he was trying to understand how was this new disease spreading around? He's looking around and he finds references to papers by William Wells and Mildred Wells. He has no idea who they are and he sees that William Wells had published a book in 1955 and he's like, well, okay, maybe I need to go read the book.Nobody has the book. And the only place that he could find it was in one university in the United States. They photocopied it and shipped it to him in Hong Kong and he finally starts reading it. And it's really hard to read because again William was a terrible writer, unlike Mildred. But after a while it clicks and he's like, oh. That's it. I got it. But again, all the guidelines for controlling pandemics and diseases do not really give much serious attention to airborne infection except for just a couple diseases. And it's not until the COVID pandemic that things finally change.Carol Sutton Lewis: Wow. If we had listened to Mildred and William earlier, what might have been different?Carl Zimmer: Yeah, I do try to imagine a world in which Mildred and William had been taken seriously by more people. If airborne infection was just a seriously recognized thing at the start of the COVID pandemic, we would have been controlling the disease differently from the start. We wouldn't have been wiping down our shopping bags obsessively. People would have been encouraged to open the windows, people would have been encouraged to get air purifiers, ultraviolet lamps might have been installed in places with poor ventilation, masks might not have been so controversial.And instead these intellectual grandchildren of William and Mildred Wells had to reinvent the wheel. They had to do new studies to persuade people finally that a disease could be airborne. And it took a long time. It took months to finally move the needle.Carol Sutton Lewis: Carl, what do you hope people will take away from Mildred's story, which you have so wonderfully detailed in your book, rendering her no longer a lost woman of science? And what do you hope people will take away from the book more broadly?Carl Zimmer: I think sometimes that we imagine that science just marches on smoothly and effortlessly. But science is a human endeavor in all the good ways and in all the not-so-good ways. Science does have a fair amount of tragedy throughout it, as any human endeavor does. I'm sad about what happened to the Wells by the end of their lives, both of them. But in some ways, things are better now.When I'm writing about aerobiology in the early, mid, even late—except for Mildred, it's pretty much all men. But who were the people during the COVID pandemic who led the fight to get recognized as airborne? People like Linsey Marr at Virginia Tech, Kim Prather at University of California, San Diego, Lidia Morawska, an Australian researcher. Now, all women in science still have to contend with all sorts of sexism and sort of baked-in inequalities. But it is striking to me that when you get to the end of the book, the women show up.Carol Sutton Lewis: Well,Carl Zimmer: And they show up in force.Carol Sutton Lewis: And on that very positive note to end on, Carl, thank you so much, first and foremost, for writing this really fascinating book and within it, highlighting a now no longer lost woman of science, Mildred Weeks Wells. Your book is Airborne: The Hidden History of the Life We Breathe, and it's been a pleasure to speak with—Carl Zimmer: Thanks a lot. I really enjoyed talking about Mildred.Carol Sutton Lewis: This has been Lost Women of Science Conversations. Carl Zimmer's book Airborne: The Hidden History of the Life We Breathe is out now. This episode was hosted by me, Carol Sutton Lewis. Our producer was Luca Evans, and Hansdale Hsu was our sound engineer. Special thanks to our senior managing producer, Deborah Unger, our program manager, Eowyn Burtner, and our co-executive producers, Katie Hafner and Amy Scharf.Thanks also to Jeff DelViscio and our publishing partner, Scientific American. The episode art was created by Lily Whear and Lizzie Younan composes our music. Lost Women of Science is funded in part by the Alfred P. Sloan Foundation and the Anne Wojcicki Foundation. We're distributed by PRX.If you've enjoyed this conversation, go to our website lostwomenofscience.org and subscribe so you'll never miss an episode—that's lostwomenofscience.org. And please share it and give us a rating wherever you listen to podcasts. Oh, and please don't forget to click on the donate button—that helps us bring you even more stories of important female scientists.I'm Carol Sutton Lewis. See you next time.HostCarol Sutton LewisProducerLuca EvansGuest Carl ZimmerCarl Zimmer writes the Origins column for the New York Times and has frequently contributed to The Atlantic, National Geographic, Time, and Scientific American. His journalism has earned numerous awards, including ones from the American Association for the Advancement of Science and the National Academies of Sciences, Medicine, and Engineering. He is the author of fourteen books about science, including Life's Edge.Further Reading:Air-Borne: The Hidden History of the Life We Breathe. Carl Zimmer. Dutton, 2025Poliomyelitis. International Committee for the Study of Infantile Paralysis. Williams \u0026 Wilkins Company, 1932 “Air-borne Infection,” by William Firth Wells and Mildred Weeks Wells, in JAMA, Vol. 107, No. 21; November 21, 1936“Air-borne Infection: Sanitary Control,” by William Firth Wells and Mildred Weeks Wells, in JAMA, Vol. 107, No. 22; November 28, 1936“Ventilation in the Spread of Chickenpox and Measles within School Rooms,” by Mildred Weeks Wells, in JAMA, Vol. 129, No. 3; September 15, 1945“The 60-Year-Old Scientific Screwup That Helped Covid Kill,” by Megan Molteni, in Wired. Published online May 13, 2021WATCH THIS NEXTScience journalist Carl Zimmer joins host Rachel Feltman to look back at the history of the field, from ancient Greek “miasmas” to Louis Pasteur’s unorthodox experiments to biological warfare.",
  "image": "https://static.scientificamerican.com/dam/m/924bb2302462b89/original/Lost-Women-of-Science-Partner-Podcast-Span-Art-Airborne.png?m=1747878912.787\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eAir-Borne: The Hidden History of the Life We Breathe,\u003c/i\u003e by Carl Zimmer, charts the history of the field of aerobiology: the science of airborne microorganisms. In this episode, we discover the story of two lost pioneers of the 1930s: physician and self-taught epidemiologist Mildred Weeks Wells and her husband, sanitary engineer William Firth Wells. Together, they proved that infectious pathogens could spread through the air over long distances. But the two had a reputation as outsiders, and they failed to convince the scientific establishment, who ignored their findings for decades. What the pair figured out could have saved many lives from tuberculosis, SARS, COVID and other airborne diseases. The contributions of Mildred Weeks Wells and her husband were all but erased from history—until now.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eLISTEN TO THE PODCAST\u003c/b\u003e\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eTRANSCRIPT\u003c/i\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Mildred is hired in the late 1920s to put together everything that was known about polio. And she does this incredible study, where she basically looks for everything that she can find about how polio spreads.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAt the time, the idea that it could spread through the air was really looked at as being just an obsolete superstition. Public health experts would say, look, a patient\u0026#39;s breath is basically harmless. But the epidemiology looks to her like these germs are airborne, and this goes totally against the consensus at the time.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Hello, I\u0026#39;m Carol Sutton Lewis. Welcome to the latest episode of \u003ci\u003eLost Women of Science Conversations\u003c/i\u003e, where we talk with authors and artists who\u0026#39;ve discovered and celebrated female scientists in books, poetry, film, and the visual arts.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eToday I\u0026#39;m joined by Carl Zimmer, an award-winning \u003ci\u003eNew York Times\u003c/i\u003e columnist and the author of 15 books about science. His latest book, \u003ci\u003eAirborne: The Hidden History of the Life We Breathe\u003c/i\u003e, focuses on the last great biological frontier: the air. It presents the history of aerobiology, which is the science dealing with the occurrence, transportation, and effects of airborne microorganisms.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe book chronicles the exploits of committed aerobiologists from the early pioneers through to the present day. Among these pioneers were Mildred Weeks Wells and her husband, William Firth Wells.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eAirborne\u003c/i\u003e tells the story of how Mildred and William tried to sound the alarm about airborne infections, but for many reasons, their warnings went unheard.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWelcome, Carl Zimmer. It\u0026#39;s such a pleasure to have you with us to tell us all about this fascinating woman and her contributions to science.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCan you please tell us about Mildred Weeks Wells—where and how she grew up and what led her to the field of aerobiology?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e She was born in 1891, and she came from a very prominent Texas family—the Denton family. Her great-grandfather is actually whom the city of Denton, Texas is named after. Her grandfather was a surgeon for the Confederate Army in the Civil War, and he becomes the director of what was called then the State Lunatic Asylum.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd he and the bookkeeper there, William Weeks, are both charged with embezzlement. It\u0026#39;s a big scandal. The bookkeeper then marries Mildred\u0026#39;s mother. Then, shortly after Mildred\u0026#39;s born, her father disappears. Her mother basically abandons her with her grandmother. And she grows up with her sister and grandmother in Austin, Texas. A comfortable life, but obviously there\u0026#39;s a lot of scandal hanging over them.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eShe is clearly incredibly strong-willed. She goes to medical school at the University of Texas and graduates in 1915, one of three women in a class of 34. That is really something for a woman at that point—there were hardly any women with medical degrees in the United States, let alone someone in Texas.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut she books out of there. She does not stick around. She heads in 1915 to Washington, D.C., and works at the Public Health Service in a lab called the Hygienic Laboratory. Basically, what they\u0026#39;re doing is studying bacteria. You have to remember, this is the golden age of the germ theory of disease. People have been figuring out that particular bacteria or viruses cause particular diseases, and that knowledge is helping them fight those diseases.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIt\u0026#39;s there in Washington at this time that she meets a man who will become her husband, William Firth Wells.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Just a quick aside—because we at \u003ci\u003eLost Women of Science\u003c/i\u003e are always interested in how you discover the material in addition to what you\u0026#39;ve discovered. How were you able to piece together her story? What sources were you able to find? It seems like there wasn\u0026#39;t a lot of information available.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Yeah, it was a tough process. There is little information that\u0026#39;s really easy to get your hands on. I mean, there is no biography of Mildred Wells or her husband, William Firth Wells.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAt the Rockefeller archives, they had maybe 30 document boxes full of stuff that was just miraculously conserved there. There are also letters that she wrote to people that have been saved in various collections.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut especially with her early years, it\u0026#39;s really tough. You know, in all my work trying to dig down for every single scrap of information I could find of her, I have only found one photograph of her—and it\u0026#39;s the photograph in her yearbook. That’s it.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e You talked about that photograph in the book, and I was struck by your description of it. You say that she\u0026#39;s smiling, but the longer you look at her smile, the sadder it becomes. What do you think at that young age was the source of the sadness?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e I think that Mildred grew up with a lot of trauma. She was not the sort of person to keep long journals or write long letters about these sorts of things. But when you\u0026#39;ve come across those clues in these brief little newspaper accounts, you can kind of read between the lines.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThere are reports in newspapers saying that Mildred\u0026#39;s mother had come to Austin to pay a visit to Mildred because she had scarlet fever when she was 10, and then she goes away again. And when I look at her face in her yearbook, it doesn\u0026#39;t surprise me that there is this cast of melancholy to it because you just think about what she had gone through just as a kid.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Oh. Absolutely. And fast forward, she meets William and they marry. They have a son, and they start collaborating. How did that begin?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e The collaboration takes a while. So William Wells is also working at the Public Health Service at the time. He is a few years older than Mildred and he has been trained at MIT as what was called then a sanitarian. In other words, he was going to take the germ theory of disease and was going to save people\u0026#39;s lives.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHe was very clever. He could invent tests that a sanitarian could use, dip a little tube into a river and see whether the water was safe or not, things like that. He was particularly focused on keeping water clean of bacteria that could cause diseases like typhoid or cholera and he also, gets assigned by the government to study oysters because oysters, they sit in this water and they\u0026#39;re filtering all day long. And you know, if there\u0026#39;s bacteria in there, they\u0026#39;re going to filter it and trap it in their tissues. And oysters are incredibly popular in the early nineteen hundreds and a shocking number of people are keeling over dying of typhoid because they\u0026#39;re eating them raw. So William is very busy, figuring out ways to save the oyster industry. How do we purify oysters and things like that? They meet, they get married in 1917.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn 1918 they have a child, William Jr. nicknamed Bud. But William is not around for the birth, because he is drafted into the army, and he goes off to serve. in World War I.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e So Mildred is at home with Bud and William\u0026#39;s off at the war. But ultimately, Mildred returns to science. A few years later, where she is hired as a polio detective. Can you tell me a little bit about what the state of polio knowledge was at the time and what precisely a polio detective did?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer: \u003c/b\u003eIt doesn\u0026#39;t seem like polio really was a thing in the United States until the late 1800s. And then suddenly there\u0026#39;s this mysterious disease that can strike children with no warning. These kids can\u0026#39;t. walk, or suddenly these kids are dying. Not only are the symptoms completely terrifying to parents, but how it spreads is a complete mystery. And so Mildred, seems to have been hired at some point in the late 1920s To basically put together everything that was known about polio to help doctors to deal with their patients and to, you know, encourage future science to try to figure out what is this disease.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eYou know, Mildred wasn\u0026#39;t trained in epidemiology. So it\u0026#39;s kind of remarkable that she taught herself. And she would turn out to be a really great epidemiologist. But, in any case, She gets hired by the International Committee for the Study of Infantile Paralysis, that was the name then for polio. And she does this incredible study, where she basically looks for everything that she can find about how polio spreads. Case studies where, in a town, like this child got polio, then this child did, and did they have contact and what sort of contact, what season was it? What was the weather like? All these different factors.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd one thing that\u0026#39;s really important to bear in mind is that, at this time, the prevailing view was that diseases spread by water, by food, by sex, by close contact. Maybe like someone just coughs and sprays droplets on you, but otherwise it\u0026#39;s these other routes.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe idea that it could spread through the air was really looked at as being just obsolete superstition. for thousands of years, people talked about miasmas, somehow the air mysteriously became corrupted and that made people sick with different diseases. That was all thrown out in the late 1800s, early 1900s when \u003ci\u003egerm theory really takes hold. \u003c/i\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so public health experts would say, look, a patient\u0026#39;s breath is basically harmless.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e But Mildred doesn\u0026#39;t agree, does she?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Well, Mildred Wells is looking at all of this, data and she is starting to get an idea that maybe these public health experts have been too quick to dismiss the air. So when people are talking about droplet infections in the 1920s, they\u0026#39;re basically just talking about, big droplets that someone might just sneeze in your face. But the epidemiology looks to her like these germs are airborne, are spreading long distances through the air.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo Mildred is starting to make a distinction in her mind about what she calls airborne and droplet infections. So, and this is really the time that the Wellses collectively are thinking about airborne infection and it\u0026#39;s Mildred is doing it. And William actually gives her credit for this later on.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Right. and her results are published in a book about polio written entirely by female authors, which is quite unusual for the time.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Mm hmm. Right. The book is published in 1932, and the reception just tells you so much about what it was like to be a woman in science. \u003ci\u003eThe New England Journal of Medicine\u003c/i\u003e reviews the book, which is great. But, here\u0026#39;s a line that they give, they say, it is interesting to note that this book is entirely the product of women in medicine and is the first book.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo far as a reviewer knows. by a number of authors, all of whom are of the female sex. So it\u0026#39;s this: Oh, look at this oddity. And basically, the virtue of that is that women are really thorough, I, guess. so it\u0026#39;s a very detailed book. And the reviewer writes, no one is better fitted than a woman to collect data such as this book contains. So there\u0026#39;s no okay, this is very useful.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Patronize\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Yeah. Thank you very much. Reviewers were just skating over the conclusions that they were drawing, I guess because they were women. Yeah, pretty incredible.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e So she is the first to submit scientific proof about this potential for airborne transmission. And that was pretty much dismissed. It wasn\u0026#39;t even actively dismissed.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIt was just, nah, these women, nothing\u0026#39;s coming outta that, except William did pay attention. I believe he too had been thinking about airborne transmission for some time and then started seriously looking at Mildred\u0026#39;s conclusion when he started teaching at Harvard.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Yeah. So, William gets a job as a low level instructor at Harvard. He\u0026#39;s getting paid very little. Mildred has no income. He\u0026#39;s teaching about hygiene and sanitation, but apparently he\u0026#39;s a terrible teacher. But he is a clever, brilliant engineer and scientist; he very quickly develops an idea that probably originated in the work that Mildred had been doing on polio. that maybe diseases actually can spread long distances through the air. So there are large droplets that we might sneeze out and cough out and, and they go a short distance before gravity pulls them down. But physics dictates that below a certain size, droplets can resist gravity.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis is something that\u0026#39;s going totally against what all the, the really prominent public health figures are saying. William Wells doesn\u0026#39;t care. He goes ahead and he starts to, invent a way to sample air for germs. Basically it\u0026#39;s a centrifuge. You plug it in, the fan spins, it sucks in air, the air comes up inside a glass cylinder and then as it\u0026#39;s spinning, if there are any droplets of particles or anything floating in the air, they get flung out to the sideS.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so afterwards you just pull out the glass which is coated with, food for microbes to grow on and you put it in a nice warm place. And If there\u0026#39;s anything in the air, you\u0026#39;ll be able to grow a colony and see it.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Amazing.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e It is amazing. This, this was a crucial invention\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e So we have William, who is with Mildred\u0026#39;s help moving more towards the possibility of airborne infection, understanding that this is very much not where science is at the moment, and he conducts a really interesting experiment in one of his classrooms to try to move the theory forward. We\u0026#39;ll talk more about that experiment when we come back after the break.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eMidroll\u003c/b\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Welcome back to Lost Women of Science Conversations. We left off as the Wellses were about to conduct an experiment to test their theories about airborne infections. Carl, can you tell us about that experiment?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Okay. it\u0026#39;s 1934, It\u0026#39;s a cold day. Students come in for a lecture from this terrible teacher, William Wells. The windows are closed. The doors are closed. It\u0026#39;s a poorly ventilated room. About 20 minutes before the end of the class, he takes this weird device that\u0026#39;s next to him, he plugs it into the wall, and then he just goes back and keeps lecturing.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIt\u0026#39;s not clear whether he even told them what he was doing. But, he then takes this little pinch of sneezing powder. out of a jar and holds it in the sort of outflow from the fan inside the air centrifuge. So all of a sudden, poof, the sneezing powder just goes off into the air. You know, there are probably about a couple dozen students scattered around this lecture hall and after a while they start to sneeze. And in fact, people All the way in the [00:16:00] back are sneezing too.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo now Wells turns off his machine, puts in a new cylinder, turns it on, keeps talking. The thing is that they are actually sneezing out droplets into the air.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd some of those droplets contain harmless bacteria from their mouths. And he harvests them from the air. He actually collects them in his centrifuge. And after a few days, he\u0026#39;s got colonies of these bacteria, but only after he had released the sneezing powder, the one before that didn\u0026#39;t have any.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo, you have this demonstration that William Wells could catch germs in the air that had been released from his students at quite a distance away, And other people can inhale them, and not even realize what\u0026#39;s happening. In other words, germs were spreading like smoke. And so this becomes an explanation for what Mildred had been seeing in her epidemiology..\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Wow. That was pretty revolutionary. But how was it received?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Well, you know, At first it was received, With great fanfare, and he starts publishing papers in nineteen thirty he and Mildred are coauthors on these. And, Mildred is actually appointed as a research associate at Harvard, in nineteen thirty it\u0026#39;s a nice title, but she doesn\u0026#39;t get paid anything. And then William makes another discovery, which is also very important.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHe\u0026#39;s thinking okay, if these things are floating in the air, is there a way that I can disinfect the air? And he tries all sorts of things and he discovers ultraviolet light works really well. In fact, you can just put an ultraviolet light in a room and the droplets will circulate around and as they pass through the ultraviolet rays, it kills the bacteria or viruses inside of them. So in 1936, when he\u0026#39;s publishing these results, there are so many headlines in newspapers and magazines and stuff about this discovery.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThere\u0026#39;s one headline that says, scientists fight flu germs with violet ray. And, there are these predictions that, we are going to be safe from these terrible diseases. Like for example, influenza, which had just, devastated the world not long beforehand, because you\u0026#39;re going to put ultraviolet lights in trains and schools and trolleys and movie theaters.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Did Mildred get any public recognition for her contributions to all of this?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Well not surprisingly, William gets the lion\u0026#39;s share of the attention. I mean, there\u0026#39;s a passing reference to Mildred in one article. The Associated Press says chief among his aides, Wells said, was his wife, Dr. Mildred Wells. So, William was perfectly comfortable, acknowledging her, but the reporters. Didn\u0026#39;t care,\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e And there were no pictures of her\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Right. Mildred wasn\u0026#39;t the engineer in that couple, but she was doing all the research on epidemiology. And you can tell from comments that people made about, and Mildred Wells is that. William would be nowhere as a scientist without Mildred. She was the one who kept him from jumping ahead to wild conclusions from the data he had so far. So they were, they\u0026#39;re very much a team. She was doing the writing and they were collaborating, they were arguing with each other all the time about it And she was a much better writer than he was., but that wasn\u0026#39;t suitable for a picture, so she was invisible.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e In the book, you write a lot about their difficult personalities and how that impacted their reputations within the wider scientific community. Can you say more about that?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer: \u003c/b\u003eRight. They really had a reputation as being really hard to deal with. People would politely call them peculiar. And when they weren\u0026#39;t being quite so polite, they would talk about all these arguments that they would get in, shouting matches and so on. They really felt that they had discovered something incredibly important, but they were outsiders, you know, they didn\u0026#39;t have PhDs, they didn\u0026#39;t have really much formal training. And here they were saying that, you know, the consensus about infectious disease is profoundly wrong.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNow, ironically, what happened is that once William Wells showed that ultraviolet light could kill germs, his superior at Harvard abruptly took an intense interest in all of this and said, Okay, you\u0026#39;re going to share a patent on this with me. My name\u0026#39;s going to be on the patent and all the research from now on is going to happen in my lab. I\u0026#39;m going to have complete control over what happens next. And Mildred took the lead saying no way we want total autonomy, get out of our face. \u003ci\u003eShe was\u003c/i\u003e much more aggressive in university politics, and sort of protecting their turf. And unfortunately they didn\u0026#39;t have many allies at Harvard and pretty soon they were out, they were fired. And William Wells and his boss, Gordon Fair, were both named on a patent that was filed for using ultraviolet lamps to disinfect the air.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e So what happened when they left Harvard?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Well, it\u0026#39;s really interesting watching them scrambling to find work, because their reputation had preceded them. They were hoping they could go back to Washington DC to the public health service. But, the story about the Wells was that Mildred, was carrying out a lot of the research, and so they thought, we can\u0026#39;t hire William if it\u0026#39;s his wife, who\u0026#39;s quietly doing a lot of the work, like they, for some reason they didn\u0026#39;t think, oh, we could hire them both.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Or just her.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e None of that, they were like, do we hire William Wells? His wife apparently hauls a lot of the weight. So no, we won\u0026#39;t hire them. It\u0026#39;s literally like written down. It’s, I\u0026#39;m not making it up. And fortunately they had a few defenders, a few champions down in Philadelphia.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThere was a doctor in Philadelphia who was using ultraviolet light to protect children in hospitals. And he was, really, inspired by the Wellses and he knew they were trouble. He wrote yes, I get it. They\u0026#39;re difficult, but let\u0026#39;s try to get them here.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so they brought them down to Philadelphia and Mildred. And William, opened up the laboratories for airborne infection at the University of Pennsylvania. And now actually Mildred got paid, for the first time, for this work. So they\u0026#39;re both getting paid, things are starting to look better\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e So they start to do amazing work at the University of Pennsylvania.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e That\u0026#39;s right. That\u0026#39;s right. William, takes the next step in proving their theory. He figures out how to actually give animals diseases through the air. He builds a machine that gets to be known as the infection machine. a big bell jar, and you can put mice in there, or a rabbit in there, and there\u0026#39;s a tube connected to it.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd through that tube, William can create a very fine mist that might have influenza viruses in it, or the bacteria that cause tuberculosis. And the animals just sit there and breathe, and lo and behold, They get tuberculosis, they get influenza, they get all these diseases,\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNow, meanwhile, Mildred is actually spending a lot of her time at a school nearby the Germantown Friends School, where they have installed ultraviolet lamps in some of the classrooms. And they\u0026#39;re convinced that they can protect kids from airborne diseases. The biggest demonstration of what these lamps can do comes in 1940, because there\u0026#39;s a huge epidemic of measles. In 1940, there\u0026#39;s, no vaccine for measles. Every kid basically gets it.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd lo and behold, the kids in the classrooms with the ultraviolet lamps are 10 times less likely to get measles than the kids just down the hall in the regular classrooms. And so this is one of the best experiments ever done on the nature of airborne infection and how you can protect people by disinfecting the air.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Were they then finally accepted into the scientific community?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e I know you keep waiting for that, that victory lap, but no. It\u0026#39;s just like time and again, that glory gets snatched away from them. Again, this was not anything that was done in secret. Newspapers around Philadelphia were. Celebrating this wow, look at this, look at how we can protect our children from disease. This is fantastic. But other experts, public health authorities just were not budging. they had all taken in this dogma that the air can\u0026#39;t be dangerous.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so again and again, they were hitting a brick wall. This is right on the eve of World War II.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so all sorts of scientists in World War II are asking themselves, what can we do? Mildred and William put themselves forward and say we don\u0026#39;t want soldiers to get sick with the flu the way they did in World War I. They\u0026#39;re both haunted by this and they\u0026#39;re thinking, so we could put our ultraviolet lamps in the barracks, we could protect them. Soldiers from the flu, if the flu is airborne, like we think, not only that, but this could help to really convince all those skeptics\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e mm.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e But they failed. The army put all their money into other experiments, they were blackballed, they were shut out, and again, I think it was just because they were continuing to be just incredibly difficult. Even patrons and their friends would just sigh to each other, like, Oh my God, I\u0026#39;ve just had to deal with these, with them arguing with us and yelling at us. And by the end of World War II, things are bad, they have some sort of split up, they never get divorced, but it\u0026#39;s just too much. Mildred, like she is not only trying to do this pioneering work in these schools, trying to keep William\u0026#39;s labs organized, there\u0026#39;s the matter of their son. Now looking at some documents, I would hazard a guess that he had schizophrenia because he was examined by a doctor who came to that conclusion.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so, she\u0026#39;s under incredible pressure and eventually she cracks and in 1944 she resigns from the lab. She stops working in the schools, she stops collaborating with her husband, but she keeps doing her own science. And that\u0026#39;s really amazing to me. What kinds of things did she do after this breakup? What kind of work did she conduct? And how was that received?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMildred goes on on her own to carry out a gigantic experiment, in hindsight, a really visionary piece of work. It\u0026#39;s based on her experience in Philadelphia. Because she could see that the ultraviolet lamps worked very well at protecting children during a really intense measles epidemic. And so she thought to herself, if you want to really make ultraviolet light, and the theory of airborne infection live up to its true potential to protect people. You need to protect the air in a lot more places.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSo she gets introduced to the health commissioner in Westchester County, this is a county just north of New York City. And she pitches him this idea. She says, I want to go into one of your towns and I want to put ultraviolet lights everywhere. And this guy, William Holla, he is a very bold, flamboyant guy. He\u0026#39;s the right guy to ask. He\u0026#39;s like, yeah, let\u0026#39;s do this. And he leaves it up to her to design the experiment.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd so this town Pleasantville in New York gets fitted out with ultraviolet lamps in the train station, in the fountain shops, in the movie theater, in churches, all over the place. And she publishes a paper with Holla in 1950 on the results.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe results are mixed though. You look carefully at them, you can see that actually, yeah, the lamps worked in certain respects. So certain diseases, the rates were lower in certain places, but sadly, this incredibly ambitious study really didn\u0026#39;t move the needle. And yeah, it was a big disappointment and that was the last science that Mildred did.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Even when they were working together, Mildred and William never really succeeded in convincing the scientific community to take airborne infection seriously, although their work obviously did move the science forward. So what did sway scientific opinion and when?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Yeah, Mildred dies in 1957. William dies in 1963. After the Wellses are dead, their work is dismissed and they themselves are quite forgotten. It really isn\u0026#39;t until the early 2000s that a few people rediscover them.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe SARS epidemic kicks up in 2003, for example, and I talked to a scientist in Hong Kong named Yuguo Li, and he was trying to understand how was this new disease spreading around? He\u0026#39;s looking around and he finds references to papers by William Wells and Mildred Wells. He has no idea who they are and he sees that William Wells had published a book in 1955 and he\u0026#39;s like, well, okay, maybe I need to go read the book.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNobody has the book. And the only place that he could find it was in one university in the United States. They photocopied it and shipped it to him in Hong Kong and he finally starts reading it. And it\u0026#39;s really hard to read because again William was a terrible writer, unlike Mildred. But after a while it clicks and he\u0026#39;s like, oh. That\u0026#39;s it. I got it. But again, all the guidelines for controlling pandemics and diseases do not really give much serious attention to airborne infection except for just a couple diseases. And it\u0026#39;s not until the COVID pandemic that things finally change.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Wow. If we had listened to Mildred and William earlier, what might have been different?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Yeah, I do try to imagine a world in which Mildred and William had been taken seriously by more people. If airborne infection was just a seriously recognized thing at the start of the COVID pandemic, we would have been controlling the disease differently from the start. We wouldn\u0026#39;t have been wiping down our shopping bags obsessively. People would have been encouraged to open the windows, people would have been encouraged to get air purifiers, ultraviolet lamps might have been installed in places with poor ventilation, masks might not have been so controversial.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnd instead these intellectual grandchildren of William and Mildred Wells had to reinvent the wheel. They had to do new studies to persuade people finally that a disease could be airborne. And it took a long time. It took months to finally move the needle.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Carl, what do you hope people will take away from Mildred\u0026#39;s story, which you have so wonderfully detailed in your book, rendering her no longer a lost woman of science? And what do you hope people will take away from the book more broadly?\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e I think sometimes that we imagine that science just marches on smoothly and effortlessly. But science is a human endeavor in all the good ways and in all the not-so-good ways. Science does have a fair amount of tragedy throughout it, as any human endeavor does. I\u0026#39;m sad about what happened to the Wells by the end of their lives, both of them. But in some ways, things are better now.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhen I\u0026#39;m writing about aerobiology in the early, mid, even late—except for Mildred, it\u0026#39;s pretty much all men. But who were the people during the COVID pandemic who led the fight to get recognized as airborne? People like Linsey Marr at Virginia Tech, Kim Prather at University of California, San Diego, Lidia Morawska, an Australian researcher. Now, all women in science still have to contend with all sorts of sexism and sort of baked-in inequalities. But it is striking to me that when you get to the end of the book, the women show up.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e Well,\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e And they show up in force.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e And on that very positive note to end on, Carl, thank you so much, first and foremost, for writing this really fascinating book and within it, highlighting a now no longer lost woman of science, Mildred Weeks Wells. Your book is \u003ci\u003eAirborne: The Hidden History of the Life We Breathe\u003c/i\u003e, and it\u0026#39;s been a pleasure to speak with—\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarl Zimmer:\u003c/b\u003e Thanks a lot. I really enjoyed talking about Mildred.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCarol Sutton Lewis:\u003c/b\u003e This has been \u003ci\u003eLost Women of Science Conversations\u003c/i\u003e. Carl Zimmer\u0026#39;s book \u003ci\u003eAirborne: The Hidden History of the Life We Breathe\u003c/i\u003e is out now. This episode was hosted by me, Carol Sutton Lewis. Our producer was Luca Evans, and Hansdale Hsu was our sound engineer. Special thanks to our senior managing producer, Deborah Unger, our program manager, Eowyn Burtner, and our co-executive producers, Katie Hafner and Amy Scharf.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThanks also to Jeff DelViscio and our publishing partner, \u003ci\u003eScientific American\u003c/i\u003e. The episode art was created by Lily Whear and Lizzie Younan composes our music. \u003ci\u003eLost Women of Science\u003c/i\u003e is funded in part by the Alfred P. Sloan Foundation and the Anne Wojcicki Foundation. We\u0026#39;re distributed by PRX.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf you\u0026#39;ve enjoyed this conversation, go to our website lostwomenofscience.org and subscribe so you\u0026#39;ll never miss an episode—that\u0026#39;s lostwomenofscience.org. And please share it and give us a rating wherever you listen to podcasts. Oh, and please don\u0026#39;t forget to click on the donate button—that helps us bring you even more stories of important female scientists.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eI\u0026#39;m Carol Sutton Lewis. See you next time.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eHost\u003cbr/\u003e\u003c/b\u003eCarol Sutton Lewis\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eProducer\u003cbr/\u003e\u003c/b\u003eLuca Evans\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eGuest \u003cbr/\u003e\u003c/b\u003eCarl Zimmer\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eCarl Zimmer writes the Origins column for the New York Times and has frequently contributed to The Atlantic, National Geographic, Time, and Scientific American. His journalism has earned numerous awards, including ones from the American Association for the Advancement of Science and the National Academies of Sciences, Medicine, and Engineering. He is the author of fourteen books about science, including Life\u0026#39;s Edge.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eFurther Reading:\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://carlzimmer.com/books/airborne/\"\u003e\u003ci\u003eAir-Borne: The Hidden History of the Life We Breathe. \u003c/i\u003eCarl Zimmer. Dutton, 2025\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.google.com/books/edition/Poliomyelitis_a_Survey_Made_Possible_by/M4MaAAAAMAAJ?hl=en\u0026amp;gbpv=0\u0026amp;bsq=%22Poliomyelitis%22%20%221932%22%20%22A%20SURVEY%20MADE%20POSSIBLE%20BY%20A%20GRANT%20FROM%20THE%20INTERNATIONAL%20COMMITTEE%20FOR%20THE%20STUDY%20OF%20INFANTILE%20PARALYSIS%22\"\u003e\u003ci\u003ePoliomyelitis\u003c/i\u003e. International Committee for the Study of Infantile Paralysis. Williams \u0026amp; Wilkins Company, 1932 \u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://jamanetwork.com/journals/jama/article-abstract/273913\"\u003e“Air-borne Infection,” by William Firth Wells and Mildred Weeks Wells, in \u003ci\u003eJAMA,\u003c/i\u003e Vol. 107, No. 21; November 21, 1936\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://jamanetwork.com/journals/jama/article-abstract/274066\"\u003e“Air-borne Infection: Sanitary Control,” by William Firth Wells and Mildred Weeks Wells, in \u003ci\u003eJAMA,\u003c/i\u003e Vol. 107, No. 22; November 28, 1936\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://jamanetwork.com/journals/jama/article-abstract/275822\"\u003e“Ventilation in the Spread of Chickenpox and Measles within School Rooms,” by Mildred Weeks Wells, in \u003ci\u003eJAMA,\u003c/i\u003e Vol. 129, No. 3; September 15, 1945\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://www.wired.com/story/the-teeny-tiny-scientific-screwup-that-helped-covid-kill/\"\u003e“The 60-Year-Old Scientific Screwup That Helped Covid Kill,” by Megan Molteni, in \u003ci\u003eWired\u003c/i\u003e. Published online May 13, 2021\u003c/a\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eWATCH THIS NEXT\u003c/b\u003e\u003c/p\u003e\u003cfigure data-block=\"contentful/image\"\u003e\u003ciframe src=\"https://www.youtube.com/embed/3KHrdOaaKh0\" loading=\"lazy\" title=\"Video player\" width=\"1280\"\u003e\u003c/iframe\u003e\u003cfigcaption\u003e\u003cp\u003eScience journalist Carl Zimmer joins host Rachel Feltman to look back at the history of the field, from ancient Greek “miasmas” to Louis Pasteur’s unorthodox experiments to biological warfare.\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "35 min read",
  "publishedTime": "2025-05-22T12:00:00-04:00",
  "modifiedTime": null
}
