{
  "id": "247efd4c-f720-4679-a8a1-c9e2acc86e9d",
  "title": "NASA's Hubble finds Kuiper Belt duo may be trio",
  "link": "https://www.sciencedaily.com/releases/2025/03/250304143526.htm",
  "description": "The puzzle of predicting how three gravitationally bound bodies move in space has challenged mathematicians for centuries, and has most recently been popularized in the novel and television show '3 Body Problem.' There's no problem, however, with what a team of researchers say is likely a stable trio of icy space rocks in the solar system's Kuiper Belt.",
  "author": "",
  "published": "Tue, 04 Mar 2025 14:35:26 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4859,
  "excerpt": "The puzzle of predicting how three gravitationally bound bodies move in space has challenged mathematicians for centuries, and has most recently been popularized in the novel and television show '3 Body Problem.' There's no problem, however, with what a team of researchers say is likely a stable trio of icy space rocks in the solar system's Kuiper Belt.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The puzzle of predicting how three gravitationally bound bodies move in space has challenged mathematicians for centuries, and has most recently been popularized in the novel and television show \"3 Body Problem.\" There's no problem, however, with what a team of researchers say is likely a stable trio of icy space rocks in the solar system's Kuiper Belt, found using data from NASA's Hubble Space Telescope and the ground-based W. M. Keck Observatory in Hawaii. If confirmed as the second such three-body system found in the region, the 148780 Altjira system suggests there could be similar triples waiting to be discovered, which would support a particular theory of our solar system's history and the formation of Kuiper Belt objects (KBOs). \"The universe is filled with a range of three-body systems, including the closest stars to Earth, the Alpha Centauri star system, and we're finding that the Kuiper Belt may be no exception,\" said the study's lead author Maia Nelsen, a physics and astronomy graduate of Brigham Young University in Provo, Utah. Known since 1992, KBOs are primitive icy remnants from the early solar system found beyond the orbit of Neptune. To date, over 3,000 KBOs have been cataloged, and scientists estimate there could be several hundred thousand more that measure over 10 miles in diameter. The largest KBO is dwarf planet Pluto. The Hubble finding is crucial support for a KBO formation theory, in which three small rocky bodies would not be the result of collision in a busy Kuiper Belt, but instead form as a trio directly from the gravitational collapse of matter in the disk of material surrounding the newly formed Sun, around 4.5 billion years ago. It's well known that stars form by gravitational collapse of gas, commonly as pairs or triples, but that idea that cosmic objects like those in the Kuiper Belt form in a similar way is still under investigation. The Altjira system is located in the outer reaches of the solar system, 3.7 billion miles away, or 44 times the distance between Earth and the Sun. Hubble images show two KBOs located about 4,700 miles (7,600 kilometers) apart. However, researchers say that repeated observations of the objects' unique co-orbital motion indicate the inner object is actually two bodies that are so close together they can't be distinguished at such a great distance. \"With objects this small and far away, the separation between the two inner members of the system is a fraction of a pixel on Hubble's camera, so you have to use non-imaging methods to discover that it's a triple,\" said Nelsen. This takes time and patience, Nelsen explained. Scientists have gathered a 17-year observational baseline of data from Hubble and the Keck Observatory, watching the orbit of the Altjira system's outer object. \"Over time, we saw the orientation of the outer object's orbit change, indicating that the inner object was either very elongated or actually two separate objects,\" said Darin Ragozzine, also of Brigham Young University, a co-author of the Altjira study. \"A triple system was the best fit when we put the Hubble data into different modeling scenarios,\" said Nelsen. \"Other possibilities are that the inner object is a contact binary, where two separate bodies become so close they touch each other, or something that actually is oddly flat, like a pancake.\" Currently, there are about 40 identified binary objects in the Kuiper Belt. Now, with two of these systems likely triples, the researchers say it is more likely they are looking not at an oddball, but instead a population of three-body systems, formed by the same circumstances. However, building up that evidence takes time and repeated observations. The only Kuiper Belt objects that have been explored in detail are Pluto and the smaller object Arrokoth, which NASA's New Horizons mission visited in 2015 and 2019, respectively. New Horizons showed that Arrokoth is a contact binary, which for KBOs means that two objects that have moved closer and closer to one another are now touching and/or have merged, often resulting in a peanut shape. Ragozzine describes Altjira as a \"cousin\" of Arrokoth, a member of the same group of Kuiper Belt objects. They estimate Altjira is 10 times larger than Arrokoth, however, at 124 miles (200 kilometers) wide. While there is no mission planned to fly by Altjira to get Arrokoth-level detail, Nelsen said there is a different upcoming opportunity for further study of the intriguing system. \"Altjira has entered an eclipsing season, where the outer body passes in front of the central body. This will last for the next ten years, giving scientists a great opportunity to learn more about it,\" Nelsen said. NASA's James Webb Space Telescope is also joining in on the study of Altjira as it will check if the components look the same in its upcoming Cycle 3 observations.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe puzzle of predicting how three gravitationally bound bodies move in space has challenged mathematicians for centuries, and has most recently been popularized in the novel and television show \u0026#34;3 Body Problem.\u0026#34; There\u0026#39;s no problem, however, with what a team of researchers say is likely a stable trio of icy space rocks in the solar system\u0026#39;s Kuiper Belt, found using data from NASA\u0026#39;s Hubble Space Telescope and the ground-based W. M. Keck Observatory in Hawaii.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eIf confirmed as the second such three-body system found in the region, the 148780 Altjira system suggests there could be similar triples waiting to be discovered, which would support a particular theory of our solar system\u0026#39;s history and the formation of Kuiper Belt objects (KBOs).\u003c/p\u003e\n\u003cp\u003e\u0026#34;The universe is filled with a range of three-body systems, including the closest stars to Earth, the Alpha Centauri star system, and we\u0026#39;re finding that the Kuiper Belt may be no exception,\u0026#34; said the study\u0026#39;s lead author Maia Nelsen, a physics and astronomy graduate of Brigham Young University in Provo, Utah.\u003c/p\u003e\n\u003cp\u003eKnown since 1992, KBOs are primitive icy remnants from the early solar system found beyond the orbit of Neptune. To date, over 3,000 KBOs have been cataloged, and scientists estimate there could be several hundred thousand more that measure over 10 miles in diameter. The largest KBO is dwarf planet Pluto.\u003c/p\u003e\n\u003cp\u003eThe Hubble finding is crucial support for a KBO formation theory, in which three small rocky bodies would not be the result of collision in a busy Kuiper Belt, but instead form as a trio directly from the gravitational collapse of matter in the disk of material surrounding the newly formed Sun, around 4.5 billion years ago. It\u0026#39;s well known that stars form by gravitational collapse of gas, commonly as pairs or triples, but that idea that cosmic objects like those in the Kuiper Belt form in a similar way is still under investigation.\u003c/p\u003e\n\u003cp\u003eThe Altjira system is located in the outer reaches of the solar system, 3.7 billion miles away, or 44 times the distance between Earth and the Sun. Hubble images show two KBOs located about 4,700 miles (7,600 kilometers) apart. However, researchers say that repeated observations of the objects\u0026#39; unique co-orbital motion indicate the inner object is actually two bodies that are so close together they can\u0026#39;t be distinguished at such a great distance.\u003c/p\u003e\n\u003cp\u003e\u0026#34;With objects this small and far away, the separation between the two inner members of the system is a fraction of a pixel on Hubble\u0026#39;s camera, so you have to use non-imaging methods to discover that it\u0026#39;s a triple,\u0026#34; said Nelsen.\u003c/p\u003e\n\n\n\u003cp\u003eThis takes time and patience, Nelsen explained. Scientists have gathered a 17-year observational baseline of data from Hubble and the Keck Observatory, watching the orbit of the Altjira system\u0026#39;s outer object.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Over time, we saw the orientation of the outer object\u0026#39;s orbit change, indicating that the inner object was either very elongated or actually two separate objects,\u0026#34; said Darin Ragozzine, also of Brigham Young University, a co-author of the Altjira study.\u003c/p\u003e\n\u003cp\u003e\u0026#34;A triple system was the best fit when we put the Hubble data into different modeling scenarios,\u0026#34; said Nelsen. \u0026#34;Other possibilities are that the inner object is a contact binary, where two separate bodies become so close they touch each other, or something that actually is oddly flat, like a pancake.\u0026#34;\u003c/p\u003e\n\u003cp\u003eCurrently, there are about 40 identified binary objects in the Kuiper Belt. Now, with two of these systems likely triples, the researchers say it is more likely they are looking not at an oddball, but instead a population of three-body systems, formed by the same circumstances. However, building up that evidence takes time and repeated observations.\u003c/p\u003e\n\u003cp\u003eThe only Kuiper Belt objects that have been explored in detail are Pluto and the smaller object Arrokoth, which NASA\u0026#39;s New Horizons mission visited in 2015 and 2019, respectively. New Horizons showed that Arrokoth is a contact binary, which for KBOs means that two objects that have moved closer and closer to one another are now touching and/or have merged, often resulting in a peanut shape. Ragozzine describes Altjira as a \u0026#34;cousin\u0026#34; of Arrokoth, a member of the same group of Kuiper Belt objects. They estimate Altjira is 10 times larger than Arrokoth, however, at 124 miles (200 kilometers) wide.\u003c/p\u003e\n\u003cp\u003eWhile there is no mission planned to fly by Altjira to get Arrokoth-level detail, Nelsen said there is a different upcoming opportunity for further study of the intriguing system. \u0026#34;Altjira has entered an eclipsing season, where the outer body passes in front of the central body. This will last for the next ten years, giving scientists a great opportunity to learn more about it,\u0026#34; Nelsen said. NASA\u0026#39;s James Webb Space Telescope is also joining in on the study of Altjira as it will check if the components look the same in its upcoming Cycle 3 observations.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
