{
  "id": "2c32b4e3-4e0d-46ac-adf2-9758ad05fd63",
  "title": "Deep clear-water lake analysis shows shallow water areas crucial for nutrient balance in lakes",
  "link": "https://phys.org/news/2024-11-deep-lake-analysis-shallow-areas.html",
  "description": "Even deep clear water lakes, which are considered particularly valuable ecosystems, can show signs of eutrophication and algae growth—often for no apparent reason.",
  "author": "",
  "published": "Fri, 29 Nov 2024 14:01:05 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Ecology"
  ],
  "byline": "Forschungsverbund Berlin e.V. (FVB)",
  "length": 7866,
  "excerpt": "Even deep clear water lakes, which are considered particularly valuable ecosystems, can show signs of eutrophication and algae growth—often for no apparent reason.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Shallow water areas are important zones for metabolism, as this study of Lake Stechlin illustrates. Credit: Solvin Zankl Even deep clear water lakes, which are considered particularly valuable ecosystems, can show signs of eutrophication and algae growth—often for no apparent reason. A new study by four researchers from the Leibniz Institute of Freshwater Ecology and Inland Fisheries (IGB) now shows that the causes are not always to be found in increasing nutrient inputs from the catchment area or in re-dissolution processes in the deep areas of a lake, but also in the shallower areas up to a water depth of around 20 meters. The paper is published in the journal Global Change Biology. The team combined long-term data on water chemistry, several years of measurements with sediment traps, sediment analyses and simple mass balance models to decipher the mechanisms behind the sudden eutrophication of Lake Stechlin. The results are not only surprising, they could also apply to similar types of lakes worldwide. Over-fertilization, also known as eutrophication, is one of the most pressing environmental problems in lakes worldwide. It is usually caused by man-made nutrient inputs, such as inadequately treated wastewater and fertilization of agricultural land. The consequences, such as algal blooms, oxygen deficiency and fish mortality, have been known for a long time. However, more and more remote lakes, which are hardly influenced by human activity, are now showing signs of sudden eutrophication. So far, climate change, atmospheric inputs or internal pollution from the depths of the lakes have been discussed as possible causes. For their study, the IGB team investigated Lake Stechlin, a deep clear-water lake in north-east Germany, which has experienced a dramatic increase in nutrients in recent years. Within just ten years, the phosphorus concentration quadrupled, which was accompanied by algal blooms, oxygen depletion in the deep water and other symptoms of eutrophication. Shallow water areas: New plant composition and altered sediment properties led to phosphorus increase The researchers discovered that it is not only processes in the sediments of deeper areas that influence the natural phosphorus retention in the lake, but that the shallow water areas of the lake also play a decisive role. By this, the researchers mean the zones in which light still penetrates to the bottom, which in the Stechlin includes areas up to a water depth of around 20 meters and thus 46% of the lake surface. In particular, changes in the underwater plants found there and the reduced ability of the sediments to bind phosphorus intensify the internal phosphorus dynamics. So far, so-called regime shifts have mainly been described for shallow lakes, but not for stratified lakes. However, with a maximum depth of almost 70 meters, the Stechlin is one of the deepest lakes in northern Germany. As the researchers describe, the areas colonized by winter-green stonewort declined sharply, resulting in exposed sediment areas that were gradually colonized by annual, higher aquatic plants. These changes in the vegetation meant that the phosphorus previously bound in plants or sediments was able to enter the water column. The causes of this change in the underwater plant community are still the subject of scientific research and debate. Development of the mean annual total phosphorus concentration in Lake Stechlin since 1990. Credit: IGB In addition to the plants, changes in the sediment properties are also an important factor. The scientists found that the uppermost sediment layers contain less iron, which reduces the ability to bind phosphorus. This could have been caused over a period of several decades by the progressive formation of iron sulfide in the shallow and deep sediments of the lake. Iron is increasingly fixed as iron sulfide and is no longer available to bind the phosphorus. \"These complex interactions between plant life and sediment properties could explain why Lake Stechlin has eutrophied so quickly in recent years,\" explains Dr. Thomas Gonsiorczyk, one of the two lead authors of the study. \"Even deep lakes can reach a state of severe eutrophication in their shallow water areas as a result of these processes.\" Discover the latest in science, tech, and space with over 100,000 subscribers who rely on Phys.org for daily insights. Sign up for our free newsletter and get updates on breakthroughs, innovations, and research that matter—daily or weekly. Processes in the deep water and external inputs play a subordinate role at Stechlin The analysis of Lake Stechlin also showed that the increase in phosphorus concentrations cannot be explained by external nutrient inputs. The data analyses even suggest that the phosphorus load from the catchment area has decreased since 1990. Other potential sources such as rewetting measures or the late effects of previous pollution from wastewater from the region, which is heavily frequented by tourists, were also classified as unlikely causes of phosphorus enrichment. Trend reversal: phosphorus concentrations have been falling since 2020 The phosphorus concentration in the lake has fallen sharply again since 2020. \"The phosphorus concentration in the lake in 2024 is only half as high as it was in 2020,\" says Prof Michael Hupfer, also lead author of the study. However, it remains to be seen whether this development will continue and whether this change will also result in a longer-term trend reversal in the colonization of underwater plants. The falling phosphorus concentrations have also not yet led to a decisive improvement in oxygen conditions in the deep water. Relevance for water protection The results of the current study are of interest for water protection, as many stratified lakes have a high proportion of shallow water in the sense described above despite their depth. Similar processes could therefore take place there. Climate change is exacerbating eutrophication phenomena in lakes through longer summer stratification, heavy rainfall and more frequent storms. \"In order to preserve stratified clear water lakes in the long term, protection measures must therefore also include the shallow water areas with more light in the future,\" says Hupfer. \"This could help us to better understand the nutrient dynamics of lakes and develop effective strategies to combat the deterioration of water quality.\" More information: Thomas Gonsiorczyk et al, Rapid Eutrophication of a Clearwater Lake: Trends and Potential Causes Inferred From Phosphorus Mass Balance Analyses, Global Change Biology (2024). DOI: 10.1111/gcb.17575 Citation: Deep clear-water lake analysis shows shallow water areas crucial for nutrient balance in lakes (2024, November 29) retrieved 29 November 2024 from https://phys.org/news/2024-11-deep-lake-analysis-shallow-areas.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2024/shallow-water-areas-ar.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/shallow-water-areas-ar.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2024/shallow-water-areas-ar.jpg\" data-sub-html=\"Shallow water areas are important zones for metabolism, as this study of Lake Stechlin illustrates. Credit: Solvin Zankl\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/shallow-water-areas-ar.jpg\" alt=\"Shallow water areas are crucial for the nutrient balance of a lake\" title=\"Shallow water areas are important zones for metabolism, as this study of Lake Stechlin illustrates. Credit: Solvin Zankl\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Shallow water areas are important zones for metabolism, as this study of Lake Stechlin illustrates. Credit: Solvin Zankl\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eEven deep clear water lakes, which are considered particularly valuable ecosystems, can show signs of eutrophication and algae growth—often for no apparent reason.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eA new study by four researchers from the Leibniz Institute of Freshwater Ecology and Inland Fisheries (IGB) now shows that the causes are not always to be found in increasing nutrient inputs from the \u003ca href=\"https://phys.org/tags/catchment+area/\" rel=\"tag\"\u003ecatchment area\u003c/a\u003e or in re-dissolution processes in the deep areas of a lake, but also in the shallower areas up to a water depth of around 20 meters. The paper is \u003ca href=\"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17575\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eGlobal Change Biology\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eThe team combined long-term data on \u003ca href=\"https://phys.org/tags/water+chemistry/\" rel=\"tag\"\u003ewater chemistry\u003c/a\u003e, several years of measurements with \u003ca href=\"https://phys.org/tags/sediment+traps/\" rel=\"tag\"\u003esediment traps\u003c/a\u003e, sediment analyses and simple mass balance models to decipher the mechanisms behind the sudden eutrophication of Lake Stechlin. The results are not only surprising, they could also apply to similar types of lakes worldwide.\u003c/p\u003e\n\u003cp\u003eOver-fertilization, also known as eutrophication, is one of the most pressing environmental problems in lakes worldwide. It is usually caused by man-made nutrient inputs, such as inadequately treated wastewater and fertilization of agricultural land.\u003c/p\u003e\n\u003cp\u003eThe consequences, such as algal blooms, oxygen deficiency and fish mortality, have been known for a long time. However, more and more remote lakes, which are hardly influenced by human activity, are now showing signs of sudden eutrophication. So far, \u003ca href=\"https://phys.org/tags/climate+change/\" rel=\"tag\"\u003eclimate change\u003c/a\u003e, atmospheric inputs or internal pollution from the depths of the lakes have been discussed as possible causes.\u003c/p\u003e\n\u003cp\u003eFor their study, the IGB team investigated Lake Stechlin, a deep clear-water lake in north-east Germany, which has experienced a dramatic increase in nutrients in recent years. Within just ten years, the \u003ca href=\"https://phys.org/tags/phosphorus/\" rel=\"tag\"\u003ephosphorus\u003c/a\u003e concentration quadrupled, which was accompanied by \u003ca href=\"https://phys.org/tags/algal+blooms/\" rel=\"tag\"\u003ealgal blooms\u003c/a\u003e, oxygen depletion in the deep water and other symptoms of eutrophication.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eShallow water areas: New plant composition and altered sediment properties led to phosphorus increase\u003c/h2\u003e\n\u003cp\u003eThe researchers discovered that it is not only processes in the sediments of deeper areas that influence the natural phosphorus retention in the lake, but that the shallow water areas of the lake also play a decisive role. By this, the researchers mean the zones in which light still penetrates to the bottom, which in the Stechlin includes areas up to a water depth of around 20 meters and thus 46% of the lake surface.\u003c/p\u003e\n\u003cp\u003eIn particular, changes in the underwater plants found there and the reduced ability of the sediments to bind phosphorus intensify the internal phosphorus dynamics. So far, so-called regime shifts have mainly been described for shallow lakes, but not for stratified lakes. However, with a maximum depth of almost 70 meters, the Stechlin is one of the deepest lakes in northern Germany.\u003c/p\u003e\n\u003cp\u003eAs the researchers describe, the areas colonized by winter-green stonewort declined sharply, resulting in exposed sediment areas that were gradually colonized by annual, higher aquatic plants. These changes in the vegetation meant that the phosphorus previously bound in plants or sediments was able to enter the water column. The causes of this change in the underwater plant community are still the subject of scientific research and debate.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2024/shallow-water-areas-ar-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2024/shallow-water-areas-ar-1.jpg\" data-sub-html=\"Development of the mean annual total phosphorus concentration in Lake Stechlin since 1990. Credit: IGB\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/shallow-water-areas-ar-1.jpg\" alt=\"Shallow water areas are crucial for the nutrient balance of a lake\" title=\"Development of the mean annual total phosphorus concentration in Lake Stechlin since 1990. Credit: IGB\"/\u003e\n             \u003cfigcaption\u003e\n                Development of the mean annual total phosphorus concentration in Lake Stechlin since 1990. Credit: IGB\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eIn addition to the plants, changes in the sediment properties are also an important factor. The scientists found that the uppermost sediment layers contain less iron, which reduces the ability to bind phosphorus. This could have been caused over a period of several decades by the progressive formation of iron sulfide in the shallow and deep sediments of the lake. Iron is increasingly fixed as iron sulfide and is no longer available to bind the phosphorus.\u003c/p\u003e\n\u003cp\u003e\u0026#34;These \u003ca href=\"https://phys.org/tags/complex+interactions/\" rel=\"tag\"\u003ecomplex interactions\u003c/a\u003e between plant life and \u003ca href=\"https://phys.org/tags/sediment/\" rel=\"tag\"\u003esediment\u003c/a\u003e properties could explain why Lake Stechlin has eutrophied so quickly in recent years,\u0026#34; explains Dr. Thomas Gonsiorczyk, one of the two lead authors of the study. \u0026#34;Even deep lakes can reach a state of severe eutrophication in their shallow water areas as a result of these processes.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n    \u003cp\u003e\n        Discover the latest in science, tech, and space with over \u003cstrong\u003e100,000 subscribers\u003c/strong\u003e who rely on Phys.org for daily insights.\n        Sign up for our \u003ca href=\"https://sciencex.com/help/newsletter/\" target=\"_blank\"\u003efree newsletter\u003c/a\u003e and get updates on breakthroughs,\n        innovations, and research that matter—\u003cstrong\u003edaily or weekly\u003c/strong\u003e.\n    \u003c/p\u003e\n\n    \n\u003c/div\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eProcesses in the deep water and external inputs play a subordinate role at Stechlin\u003c/h2\u003e\n\u003cp\u003eThe analysis of Lake Stechlin also showed that the increase in phosphorus concentrations cannot be explained by external nutrient inputs. The data analyses even suggest that the phosphorus load from the catchment area has decreased since 1990.\u003c/p\u003e\n\u003cp\u003eOther potential sources such as rewetting measures or the late effects of previous pollution from wastewater from the region, which is heavily frequented by tourists, were also classified as unlikely causes of phosphorus enrichment.\u003c/p\u003e\n\u003ch2\u003eTrend reversal: phosphorus concentrations have been falling since 2020\u003c/h2\u003e\n\u003cp\u003eThe phosphorus concentration in the lake has fallen sharply again since 2020. \u0026#34;The phosphorus concentration in the lake in 2024 is only half as high as it was in 2020,\u0026#34; says Prof Michael Hupfer, also lead author of the study.\u003c/p\u003e\n\u003cp\u003eHowever, it remains to be seen whether this development will continue and whether this change will also result in a longer-term trend reversal in the colonization of underwater plants. The falling phosphorus concentrations have also not yet led to a decisive improvement in oxygen conditions in the \u003ca href=\"https://phys.org/tags/deep+water/\" rel=\"tag\"\u003edeep water\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eRelevance for water protection\u003c/h2\u003e\n\u003cp\u003eThe results of the current study are of interest for water protection, as many stratified lakes have a high proportion of shallow water in the sense described above despite their depth. Similar processes could therefore take place there. Climate change is exacerbating eutrophication phenomena in lakes through longer summer stratification, heavy rainfall and more frequent storms.\u003c/p\u003e\n\u003cp\u003e\u0026#34;In order to preserve stratified clear water lakes in the long term, protection measures must therefore also include the shallow water areas with more light in the future,\u0026#34; says Hupfer. \u0026#34;This could help us to better understand the nutrient dynamics of lakes and develop effective strategies to combat the deterioration of water quality.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tThomas Gonsiorczyk et al, Rapid Eutrophication of a Clearwater Lake: Trends and Potential Causes Inferred From Phosphorus Mass Balance Analyses, \u003ci\u003eGlobal Change Biology\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1111/gcb.17575\" target=\"_blank\"\u003eDOI: 10.1111/gcb.17575\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tDeep clear-water lake analysis shows shallow water areas crucial for nutrient balance in lakes (2024, November 29)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 29 November 2024\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2024-11-deep-lake-analysis-shallow-areas.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-29T14:01:05-05:00",
  "modifiedTime": null
}
