{
  "id": "342939c0-9789-454f-a659-e91650a7e516",
  "title": "Hubble reveals surprising spiral shape of galaxy hosting young jet",
  "link": "https://www.sciencedaily.com/releases/2025/01/250113161127.htm",
  "description": "The night sky has always played a crucial role in navigation, from early ocean crossings to modern GPS. Besides stars, the United States Navy uses quasars as beacons. Quasars are distant galaxies with supermassive black holes, surrounded by brilliantly hot disks of swirling gas that can blast off jets of material. Following up on the groundbreaking 2020 discovery of newborn jets in a number of quasars, aspiring naval officer Olivia Achenbach of the United States Naval Academy has used NASA's Hubble Space Telescope to reveal surprising properties of one of them, quasar J0742+2704.",
  "author": "",
  "published": "Mon, 13 Jan 2025 16:11:27 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3490,
  "excerpt": "The night sky has always played a crucial role in navigation, from early ocean crossings to modern GPS. Besides stars, the United States Navy uses quasars as beacons. Quasars are distant galaxies with supermassive black holes, surrounded by brilliantly hot disks of swirling gas that can blast off jets of material. Following up on the groundbreaking 2020 discovery of newborn jets in a number of quasars, aspiring naval officer Olivia Achenbach of the United States Naval Academy has used NASA's Hubble Space Telescope to reveal surprising properties of one of them, quasar J0742+2704.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "The night sky has always played a crucial role in navigation, from early ocean crossings to modern GPS. Besides stars, the United States Navy uses quasars as beacons. Quasars are distant galaxies with supermassive black holes, surrounded by brilliantly hot disks of swirling gas that can blast off jets of material. Following up on the groundbreaking 2020 discovery of newborn jets in a number of quasars, aspiring naval officer Olivia Achenbach of the United States Naval Academy has used NASA's Hubble Space Telescope to reveal surprising properties of one of them, quasar J0742+2704. \"The biggest surprise was seeing the distinct spiral shape in the Hubble Space Telescope images. At first I was worried I had made an error,\" said Achenbach, who made the discovery during the course of a four-week internship. \"We typically see quasars as older galaxies that have grown very massive, along with their central black holes, after going through messy mergers and have come out with an elliptical shape,\" said astronomer Kristina Nyland of the Naval Research Laboratory, Achenbach's adviser on the research. \"It's extremely rare and exciting to find a quasar-hosting galaxy with spiral arms and a black hole that is more than 400 million times the mass of the Sun -- which is pretty big -- plus young jets that weren't detectable 20 years ago,\" Nyland said. The unusual quasar takes its place amid an active debate in the astronomy community over what triggers quasar jets, which can be significant in the evolution of galaxies, as the jets can suppress star formation. Some astronomers suspect that quasar jets are triggered by major galaxy mergers, as the material from two or more galaxies mashes together, and heated gas is funneled toward merged black holes. Spiral galaxy quasars like J0742+2704, however, suggest that there may be other pathways for jet formation. While J0742+2704 has maintained its spiral shape, the Hubble image does show intriguing signs of its potential interaction with other galaxies. One of its arms shows distortion, possibly a tidal tail. \"Clearly there is something interesting going on. While the quasar has not experienced a major disruptive merger, it may be interacting with another galaxy, which is gravitationally tugging at its spiral arm,\" said Nyland. Another galaxy that appears nearby in the Hubble image (though its location still needs to be spectroscopically confirmed) has a ring structure. This rare shape can occur after a galaxy interaction in which a smaller galaxy punches through the center of a spiral galaxy. \"The ring galaxy near the quasar host galaxy could be an intriguing clue as to what is happening in this system. We may be witnessing the aftermath of the interaction that triggered this young quasar jet,\" said Nyland. Both Achenbach and Nyland emphasize that this intriguing discovery is really a new starting point, and there will be additional multi-wavelength analysis of J0742+2704 with data from NASA's Chandra X-ray Observatory and the Atacama Large Millimeter/submillimeter Array (ALMA) in Chile. It's also a case for keeping our eyes on the skies, said Achenbach. \"If we looked at this galaxy 20 years, or maybe even a decade ago, we would have seen a fairly average quasar and never known it would eventually be home to newborn jets,\" said Achenbach. \"It goes to show that if you keep searching, you can find something remarkable that you never expected, and it can send you in a whole new direction of discovery.\"",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eThe night sky has always played a crucial role in navigation, from early ocean crossings to modern GPS. Besides stars, the United States Navy uses quasars as beacons. Quasars are distant galaxies with supermassive black holes, surrounded by brilliantly hot disks of swirling gas that can blast off jets of material. Following up on the groundbreaking 2020 discovery of newborn jets in a number of quasars, aspiring naval officer Olivia Achenbach of the United States Naval Academy has used NASA\u0026#39;s Hubble Space Telescope to reveal surprising properties of one of them, quasar J0742+2704.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;The biggest surprise was seeing the distinct spiral shape in the Hubble Space Telescope images. At first I was worried I had made an error,\u0026#34; said Achenbach, who made the discovery during the course of a four-week internship.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We typically see quasars as older galaxies that have grown very massive, along with their central black holes, after going through messy mergers and have come out with an elliptical shape,\u0026#34; said astronomer Kristina Nyland of the Naval Research Laboratory, Achenbach\u0026#39;s adviser on the research.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s extremely rare and exciting to find a quasar-hosting galaxy with spiral arms and a black hole that is more than 400 million times the mass of the Sun -- which is pretty big -- plus young jets that weren\u0026#39;t detectable 20 years ago,\u0026#34; Nyland said.\u003c/p\u003e\n\u003cp\u003eThe unusual quasar takes its place amid an active debate in the astronomy community over what triggers quasar jets, which can be significant in the evolution of galaxies, as the jets can suppress star formation. Some astronomers suspect that quasar jets are triggered by major galaxy mergers, as the material from two or more galaxies mashes together, and heated gas is funneled toward merged black holes. Spiral galaxy quasars like J0742+2704, however, suggest that there may be other pathways for jet formation.\u003c/p\u003e\n\u003cp\u003eWhile J0742+2704 has maintained its spiral shape, the Hubble image does show intriguing signs of its potential interaction with other galaxies. One of its arms shows distortion, possibly a tidal tail.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Clearly there is something interesting going on. While the quasar has not experienced a major disruptive merger, it may be interacting with another galaxy, which is gravitationally tugging at its spiral arm,\u0026#34; said Nyland.\u003c/p\u003e\n\u003cp\u003eAnother galaxy that appears nearby in the Hubble image (though its location still needs to be spectroscopically confirmed) has a ring structure. This rare shape can occur after a galaxy interaction in which a smaller galaxy punches through the center of a spiral galaxy. \u0026#34;The ring galaxy near the quasar host galaxy could be an intriguing clue as to what is happening in this system. We may be witnessing the aftermath of the interaction that triggered this young quasar jet,\u0026#34; said Nyland.\u003c/p\u003e\n\u003cp\u003eBoth Achenbach and Nyland emphasize that this intriguing discovery is really a new starting point, and there will be additional multi-wavelength analysis of J0742+2704 with data from NASA\u0026#39;s Chandra X-ray Observatory and the Atacama Large Millimeter/submillimeter Array (ALMA) in Chile. It\u0026#39;s also a case for keeping our eyes on the skies, said Achenbach.\u003c/p\u003e\n\u003cp\u003e\u0026#34;If we looked at this galaxy 20 years, or maybe even a decade ago, we would have seen a fairly average quasar and never known it would eventually be home to newborn jets,\u0026#34; said Achenbach. \u0026#34;It goes to show that if you keep searching, you can find something remarkable that you never expected, and it can send you in a whole new direction of discovery.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
