{
  "id": "3b85f4b7-877b-461c-999a-6f2c65410191",
  "title": "Concern UK's AI ambitions could lead to water shortages",
  "link": "https://www.bbc.com/news/articles/ce85wx9jjndo",
  "description": "Data centres can use vast quantities of water to cool them - but it's not clear where it will come from.",
  "author": "",
  "published": "Fri, 07 Feb 2025 01:48:21 GMT",
  "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
  "categories": null,
  "byline": "Zoe Kleinman",
  "length": 7410,
  "excerpt": "Data centres can use vast quantities of water to cool them - but it's not clear where it will come from.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Zoe KleinmanTechnology editor•@zskBrian WheelerSenior political reporterReutersKeir Starmer is pinning his growth hopes on cutting edge tools powered by AISir Keir Starmer's plan to make the UK a \"world leader\" in Artificial Intelligence (AI) could put already stretched supplies of drinking water under strain, industry sources have told the BBC.The giant data centres needed to power AI can require large quantities of water to prevent them from overheating.The tech industry says it is developing more efficient cooling systems that use less water.But the department for science, innovation and technology said in a statement it recognised the plants \"face sustainability challenges\". The government has committed to the construction of multiple data centres around the country in an effort to kick start economic growth.Ministers insist the notoriously power-hungry server farms will be given priority access to the electricity grid.Questions have been raised about the impact this might have on the government's plans for clean energy production by 2030.But less attention has been given to the impact data centres could have on the supply of fresh, drinkable water to homes and businesses.Parts of the UK, in the south especially, are already under threat of water shortages because of climate change and population growth.The government is backing plans for nine new reservoirs to ease the risk of rationing and hosepipe bans during droughts.But some of these are in areas where new data centres are set to be built.The first of the government's \"AI growth zones\" will be in Culham, Oxfordshire, at the UK Atomic Energy Authority's campus – seven miles from the site of a planned new reservoir at Abingdon.The 4.5 sq mile (7 sq km) reservoir will supply customers in the Thames Valley, London and Hampshire. It is not known how much water the massive new data centres now planned nearby could take from it.The BBC understands Thames Water has been talking to the government about the challenge of water demand in relation to data centres and how it can be mitigated.In a new report, the Royal Academy of Engineering calls on the government to ensure tech companies accurately report how much energy and water their data centres are using.It also calls for environmental sustainability requirements for all data centres, including reducing the use of drinking water, moving to zero use for cooling.Without such action, warns one of the report's authors, Prof Tom Rodden, \"we face a real risk that our development, deployment and use of AI could do irreparable damage to the environment\".Getty ImagesData centres - like this Google facility in Hertfordshire - are being built across the countryThe tech industry tends to be cagey about water consumption. Most UK data centres contacted for this article did not respond to our inquiries.Data centres use fresh, mains water, rather than surface water, so that the pipes, pumps and heat exchangers used to cool racks of servers do not get clogged up with contaminants.The amount used can vary considerably depending on a number of factors including the surrounding environment; sites in colder, wetter parts of the world tend to require less.Dr Venkatesh Uddameri, a Texas-based expert in water resources management, says a typical data centre can use between 11 million and 19 million litres of water per day, roughly the same as a town of 30,000 to 50,000 people.His widely quoted calculations are based on arid, or semi arid, climates and do not take into account recent efficiency improvements or developments in AI. Microsoft's global water use soared by 34% while it was developing its initial AI tools, and a data centre cluster in Iowa used 6% of the district's water supply in one month during the training of OpenAI's GPT-4.Local resistance to data centres is growing around the world, particularly in areas where water is scarce.In Chile, Google stopped building a data centre following concerns about its water use, and it redesigned the cooling system at another in Uruguay following local protests.Getty ImagesRacks of computer servers can generate a lot of heatIn the UK, Thames Water has warned data centres they could face restrictions on use during heatwaves.In 2022, the company said it would review data centres' water use as it prepared to introduce a hosepipe ban during a summer draught.But Foxglove, a group of campaigning lawyers, found evidence from Thames Water's strategy documents the following year that the firm still did not appear to know how much water its existing data centre customers were using.Thames Water declined to comment. It signposted its recent five-year plan, which has been approved by the government. This states that it has no legal obligation to service businesses, and can choose to restrict or refuse water to commercial customers; but this was written before the government designated data centres as Critical National Infrastructure, meaning they will face fewer planning restrictions.Thames Water filed an objection to a planning application for a new data centre in a cluster in Slough, near Reading, in 2021.But other proposals in the area have since succeeded: for example in August 2024 the firm Yondr announced that it would be building its third data centre campus there.Foxglove CEO Martha Dark said: \"The government must urgently explain how its plans for new data centres will not threaten our long-term supplies of drinking water.\"Getty ImagesThe site of a planned new Meta data centre in Spain has raised concernsA government spokesperson said: \"We recognise that data centres face sustainability challenges such as energy demands and water use - that's why AI Growth Zones are designed to attract investment in areas where existing energy and water infrastructure is already in place.\"In addition, recent changes made by the water regulator Ofwat would \"unlock £104bn of spending by water companies\" in the next five years.The data centre industry argues that modern sites are already more efficient. Alternative cooling methods which do not require much water, such as free air cooling and dry cooling, are evolving.Closed-loop cooling, which involves reusing water, will be deployed in Microsoft's new data centres in Phoenix and Wisconsin.Aaron Binckley, vice president of sustainability at Digital Realty, acknowledged criticism around data centres' water usage but claimed that the sector was making \"significant strides\".His company, which has 300 data centres worldwide, is trialling a new AI tool which analyses operational data and identifies water-saving measures. He says it is predicted to conserve nearly 4m litres of water per year.Clearly, that is currently an expectation rather than a reality, but Mr Binckley says it proves that \"AI can drive sustainability as well as technological progress\".In 2024 the Environment Agency wrote in a blog that by 2050, England alone would need an extra five billion litres of water every day – it says this is the equivalent of two million wheelie bins-full – just to serve the population. But the regulator now needs more data in order to factor in new data centres' future needs.For the time being, it is urging data centres to forecast and plan their water consumption - and to explore their own sources of water, such as water reuse.\"Meeting the increased water demand is not just for the water industry to solve,\" says a source.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3dca/live/c4a130e0-e52a-11ef-bd1b-d536627785f2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eZoe Kleinman\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eTechnology editor\u003cspan\u003e•\u003c/span\u003e\u003ca href=\"https://twitter.com/zsk\" target=\"_blank\"\u003e@zsk\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eBrian Wheeler\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSenior political reporter\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c53c/live/3c0a03e0-e2fc-11ef-bf72-232dd6212056.jpg.webp\" alt=\"Reuters Keir Starmer, in a white lab coat, points at a computer screen, watched by a young man and women in lab coats and safety goggles. He is on a visit to the Manufacturing Futures Lab at University College London\"/\u003e\u003cspan\u003eReuters\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eKeir Starmer is pinning his growth hopes on cutting edge tools powered by AI\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eSir Keir Starmer\u0026#39;s plan to make the UK a \u0026#34;world leader\u0026#34; in Artificial Intelligence (AI) could put already stretched supplies of drinking water under strain, industry sources have told the BBC.\u003c/p\u003e\u003cp\u003eThe giant data centres needed to power AI can require large quantities of water to prevent them from overheating.\u003c/p\u003e\u003cp\u003eThe tech industry says it is developing more efficient cooling systems that use less water.\u003c/p\u003e\u003cp\u003eBut the department for science, innovation and technology said in a statement it recognised the plants \u0026#34;face sustainability challenges\u0026#34;. The government has committed to the construction of multiple data centres around the country in an effort to kick start economic growth.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eMinisters insist the \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cj5ll89dy2mo\"\u003enotoriously power-hungry server farms\u003c/a\u003e will be given priority access to the electricity grid.\u003c/p\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://www.lboro.ac.uk/news-events/news/2025/january/how-the-uks-plans-for-ai-could-derail-net-zero/\"\u003eQuestions have been raised\u003c/a\u003e about the impact this might have on the government\u0026#39;s plans for clean energy production by 2030.\u003c/p\u003e\u003cp\u003eBut less attention has been given to the impact data centres could have on the supply of fresh, drinkable water to homes and businesses.\u003c/p\u003e\u003cp\u003eParts of the UK, in the south especially, are already under threat of water shortages because of climate change and population growth.\u003c/p\u003e\u003cp\u003eThe government is backing plans for nine new reservoirs to ease the risk of rationing and hosepipe bans during droughts.\u003c/p\u003e\u003cp\u003eBut some of these are in areas where new data centres are set to be built.\u003c/p\u003e\u003cp\u003eThe first of the government\u0026#39;s \u0026#34;AI growth zones\u0026#34; will be in Culham, Oxfordshire, at the UK Atomic Energy Authority\u0026#39;s campus – seven miles from the site of a planned new reservoir at Abingdon.\u003c/p\u003e\u003cp\u003eThe  4.5 sq mile (7 sq km) reservoir will supply customers in the Thames Valley, London and Hampshire. It is not known how much water the massive new data centres now planned nearby could take from it.\u003c/p\u003e\u003cp\u003eThe BBC understands Thames Water has been talking to the government about the challenge of water demand in relation to data centres and how it can be mitigated.\u003c/p\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://raeng.org.uk/news/uk-government-urged-to-promote-prioritise-and-invest-in-sustainable-ai-to-become-global-leader-in-ai-frugality-and-efficiency\"\u003eIn a new report\u003c/a\u003e, the Royal Academy of Engineering calls on the government to ensure tech companies accurately report how much energy and water their data centres are using.\u003c/p\u003e\u003cp\u003eIt also calls for environmental sustainability requirements for all data centres, including reducing the use of drinking water, moving to zero use for cooling.\u003c/p\u003e\u003cp\u003eWithout such action, warns one of the report\u0026#39;s authors, Prof Tom Rodden, \u0026#34;we face a real risk that our development, deployment and use of AI could do irreparable damage to the environment\u0026#34;.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/bdb4/live/61295aa0-e300-11ef-bf72-232dd6212056.jpg.webp\" alt=\"Getty Images An aerial view of a data centre, made up of large white rectangular buildings, under construction\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eData centres - like this Google facility in Hertfordshire - are being built across the country\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe tech industry tends to be cagey about water consumption. Most UK data centres contacted for this article did not respond to our inquiries.\u003c/p\u003e\u003cp\u003eData centres use fresh, mains water, rather than surface water, so that the pipes, pumps and heat exchangers used to cool racks of servers do not get clogged up with contaminants.\u003c/p\u003e\u003cp\u003eThe amount used can vary considerably depending on a number of factors including the surrounding environment; sites in colder, wetter parts of the world tend to require less.\u003c/p\u003e\u003cp\u003eDr Venkatesh Uddameri, a Texas-based expert in water resources management, says a typical data centre can use between 11 million and 19 million litres of water per day, roughly the same as a town of 30,000 to 50,000 people.\u003c/p\u003e\u003cp\u003eHis widely quoted calculations are based on arid, or semi arid, climates and do not take into account recent efficiency improvements or developments in AI. \u003c/p\u003e\u003cp\u003eMicrosoft\u0026#39;s global water use soared by 34% while it was developing its initial AI tools, and a data centre cluster in Iowa used 6% of the district\u0026#39;s water supply in one month during the training of OpenAI\u0026#39;s GPT-4.\u003c/p\u003e\u003cp\u003e\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/cz0mlrx0jxno\"\u003eLocal resistance to data centres is growing around the world\u003c/a\u003e, particularly in areas where water is scarce.\u003c/p\u003e\u003cp\u003eIn Chile, Google stopped building a data centre following concerns about its water use, and it redesigned the cooling system at another in Uruguay following local protests.\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9433/live/98672890-e2ff-11ef-bf72-232dd6212056.jpg.webp\" alt=\"Getty Images Narrow corridor in data centres with racks of computer servers behind smoked glass on either side\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eRacks of computer servers can generate a lot of heat\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn the UK, Thames Water has warned data centres they could face restrictions on use during heatwaves.\u003c/p\u003e\u003cp\u003eIn 2022, the company said it would review data centres\u0026#39; water use as it prepared to introduce a hosepipe ban during a summer draught.\u003c/p\u003e\u003cp\u003eBut Foxglove, a group of campaigning lawyers, found evidence from Thames Water\u0026#39;s strategy documents the following year that the firm still did not appear to know how much water its existing data centre customers were using.\u003c/p\u003e\u003cp\u003eThames Water declined to comment. It signposted its recent five-year plan, which has been approved by the government. \u003c/p\u003e\u003cp\u003eThis states that it has no legal obligation to service businesses, and can choose to restrict or refuse water to commercial customers; but this was written before the government \u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/articles/c23ljy4z05mo\"\u003edesignated data centres as Critical National Infrastructure\u003c/a\u003e, meaning they will face fewer planning restrictions.\u003c/p\u003e\u003cp\u003eThames Water filed an objection to a planning application for a new data centre in a cluster in Slough, near Reading, in 2021.\u003c/p\u003e\u003cp\u003eBut other proposals in the area have since succeeded: for example in August 2024 the firm Yondr announced that it would be building its third data centre campus there.\u003c/p\u003e\u003cp\u003eFoxglove CEO Martha Dark said: \u0026#34;The government must urgently explain how its plans for new data centres will not threaten our long-term supplies of drinking water.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure\u003e\u003cdiv data-component=\"image-block\"\u003e\u003cp\u003e\u003cimg src=\"https://www.bbc.com/bbcx/grey-placeholder.png\"/\u003e\u003cimg sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/19a0/live/294d98a0-e2f9-11ef-bf72-232dd6212056.jpg.webp\" alt=\"Getty Images Sandy earth and brush at the proposed site of the Meta Platforms Inc. data center outside Talavera de la Reina, Spain\"/\u003e\u003cspan\u003eGetty Images\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cp data-component=\"caption-block\"\u003e\u003cfigcaption\u003eThe site of a planned new Meta data centre in Spain has raised concerns\u003c/figcaption\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eA government spokesperson said: \u0026#34;We recognise that data centres face sustainability challenges such as energy demands and water use - that\u0026#39;s why AI Growth Zones are designed to attract investment in areas where existing energy and water infrastructure is already in place.\u0026#34;\u003c/p\u003e\u003cp\u003eIn addition, recent changes made by the water regulator Ofwat would \u0026#34;unlock £104bn of spending by water companies\u0026#34; in the next five years.\u003c/p\u003e\u003cp\u003eThe data centre industry argues that modern sites are already more efficient. Alternative cooling methods which do not require much water, such as free air cooling and dry cooling, are evolving.\u003c/p\u003e\u003cp\u003eClosed-loop cooling, which involves reusing water, will be deployed in Microsoft\u0026#39;s new data centres in Phoenix and Wisconsin.\u003c/p\u003e\u003cp\u003eAaron Binckley, vice president of sustainability at Digital Realty, acknowledged criticism around data centres\u0026#39; water usage but claimed that the sector was making  \u0026#34;significant strides\u0026#34;.\u003c/p\u003e\u003cp\u003eHis company, which has 300 data centres worldwide, is trialling a new AI tool which analyses operational data and identifies water-saving measures. He says it is predicted to conserve nearly 4m litres of water per year.\u003c/p\u003e\u003cp\u003eClearly, that is currently an expectation rather than a reality, but Mr Binckley  says it proves that \u0026#34;AI can drive sustainability as well as technological progress\u0026#34;.\u003c/p\u003e\u003cp\u003e\u003ca target=\"_blank\" href=\"https://environmentagency.blog.gov.uk/2024/03/21/meeting-our-water-needs-for-the-next-25-years/\"\u003eIn 2024 the Environment Agency wrote in a blog\u003c/a\u003e that by 2050, England alone would need an extra five billion litres of water every day – it says this is the equivalent of two million wheelie bins-full – just to serve the population. \u003c/p\u003e\u003cp\u003eBut the regulator now needs more data in order to factor in new data centres\u0026#39; future needs.\u003c/p\u003e\u003cp\u003eFor the time being, it is urging data centres to forecast and plan their water consumption - and to explore their own sources of water, such as water reuse.\u003c/p\u003e\u003cp\u003e\u0026#34;Meeting the increased water demand is not just for the water industry to solve,\u0026#34; says a source.\u003c/p\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-07T01:48:21.035Z",
  "modifiedTime": null
}
