{
  "id": "3e20119d-05b0-4e8f-baa6-6d35e3a0d98d",
  "title": "Dr. Jay Bhattacharya: You Work for an Administration That Runs a Vast Censorship Regime to Suppress Scientific Discussion. Most Authoritarian Policy I’ve Seen From an American Government. You Should be Ashamed of Yourself.",
  "link": "https://sciencebasedmedicine.org/censorship/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=censorship",
  "description": "Imagine if the fate of Tweets and YouTube vidoes was the sole concern of scientists today. The post Dr. Jay Bhattacharya: You Work for an Administration That Runs a Vast Censorship Regime to Suppress Scientific Discussion. Most Authoritarian Policy I’ve Seen From an American Government. You Should be Ashamed of Yourself. first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Tue, 22 Apr 2025 07:16:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 14032,
  "excerpt": "Imagine if the fate of Tweets and YouTube vidoes was the sole concern of scientists today.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Let’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate. Forgive me for the clickbait title of this article. It’s not my style to make such histrionic, overwrought allegations. However, it is my style to accurately quote people, and I am merely repeating the words our NIH director, Dr. Jay Bhattacharya, who said things like this about censorship, not long ago: Those are strong words, and they seem to apply well to our current moment. What calamity befell Dr. Bhattacharya to make him say this? Was he fired? Was his research defunded? Did no one know his name or what he believed? Was “media/social media suppression” really the only thing standing between Dr. Bhattacharya and a perfect pandemic response? Dr. Jay Bhattacharya would have done amazing, incredible things Dr. Bhattacharya felt grievously victimized because he was called “fringe” in an email, and he lost a YouTube video and some Tweets. To him, this was a calamity of epic proportions with grave implications for the future of free speech in the U.S. After losing a YouTube video in 2021, Florida Governor Ron Desantis put out a press release titled GOVERNOR RON DESANTIS HOLDS ROUNDTABLE WITH PUBLIC HEALTH EXPERTS TO DISCUSS BIG TECH CENSORSHIP. It contained the following quotes: “There’s nothing more dangerous than being able to censor what is said in a country, because then you are simply not ever going to even hear the truth. And you are entering into a phase of countries that we used to criticize severely like the USSR, like communist China…I mean, this is almost the end of our civilization if we have this sort of censorship, I’m afraid,” said Dr. Scott Atlas. “For science to work, you have to have an open exchange of ideas…If you’re going to make an argument that something is misinformation, you should provide an actual argument. You can’t just take it down and say, ‘Oh, it’s misinformation’ without actually giving a reason…Let’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate,” said Dr. Jay Bhattacharya. “We need to have debates, rather than censoring…When we do censoring and slandering, even if we are willing to continue to speak out, there are many other scientists that I know, including junior scientists, who do not want to speak out because they see what’s happening to us. They don’t want to have to go through the same thing. So, we really need a debate,” said Dr. Martin Kulldorff. Again, these Big Feelings from famous doctors were about a single YouTube video. When Dr. Bhattacharya claims to have been silence and censored, this is what he is talking about, though he may have had motives beyond pure scientific discourse to keep people enraged and engaged with his social media feed. Read this article here. Reasonable people can disagree about whether Big Tech and Biden administration overstepped their bounds in trying to limit online disinformation. Maybe government officials should have yawned and said nothing as anti-vaccine lies killed droves of Americans. Dr. Bhattacharya sure thinks so, and he wasn’t afraid to challenge the government. He excoriated them obsessively and even took a case about this to the Supreme Court. According to the Wikipedia article Murthy v. Missouri: The lawsuit alleges that President Joe Biden and his administration were “working with social media giants such as Meta, Twitter, and YouTube to censor and suppress free speech, including truthful information, related to COVID-19, election integrity, and other topics, under the guise of combating ‘misinformation’.” Imagine if the fate of social media posts was the sole concern of scientists today. It all seems pretty trivial now, doesn’t it? Yet, this hysterical, provocative language is how Dr. Bhattacharya routinely depicted a government that requested Facebook limit deadly anti-vaccine disinformation. This article was about social media content. The End of Free Speech is the End of Science. In reality, Dr. Bhattacharya was not silenced. As the video below shows, he was loud, prominent, and influential. He didn’t come out of nowhere when Trump plunked him from obscurity to head the NIH. He was a celebrity on Fox News and Twitter. Billionaires sung his praises. He made an enormous number of YouTube videos, many of them about how he had been censored. He was on countless podcasts and wrote many columns in international newspapers. He advised presidents and governors. He testified in courts and before Congress. He was everywhere, except a hospital. Dr. Bhattacharya is doing just fine today, and he was always doing just fine. While his feelings may have been hurt, he was famous, healthy, and gainfully employed. Indeed, he lost his Supreme Court case, as he couldn’t show he had been harmed in any way. Justice Amy Coney Barrett wrote the opinion, stating: To establish standing, the plaintiffs must demonstrate a substantial risk that, in the near future, they will suffer an injury that is traceable to a government defendant and redressable by the injunction they seek. Because no plaintiff has carried that burden, none has standing to seek a preliminary injunction. She’s right. Dr. Bhattacharya was so “censored” that he became the director of the NIH. Moreover, Dr. Bhattacharya’s experience was hardly unique. He was called “fringe” because he claimed the mass infection of unvaccinated people under 60-70 would end the pandemic in 3-6 months. Big deal. Dr. Bhattacharya wrote a fake “review” of my book and called me childish names for pointing out the flaws in his “plan.” It’s not fun being on the receiving end of such juvenile, content-free tantrums, but it’s not that bad either. Additionally, Dr. Bhattacharya was not the only doctor who had their voice curtailed in one way or another. I wrote about being silenced for political reasons in an article titled I’ve Been Silenced, Censored, and Cancelled. The Reason Why Matters. I didn’t center my identity around this or expect anyone to pity me. The doctors I knew who died of COVID were truly silenced. Rather, I wrote about my canceled speech, once, fearing that it might foreshadow worse things to come. In contrast, Dr. Bhattacharya treated his feelings and social media content as the central story of the pandemic. Nothing mattered more to him. While I never heard him express remorse over a young life lost to COVID, he produced an overwhelming amount of material depicting himself as both a “censored” scientist and true champion of free speech. He testified before Congress about having been a victim of a fictional “Ministry of Truth” gave and self-important talks with grandiose titles such as The End of Free Speech is the End of Science, A Personal COVID Perspective. Dr. Bhattacharya still feels he’s owed a public apology because he was called “fringe” in an email 4.5 years ago. Dr. Bhattacharya’s identity was entirely based around grievance and victimhood, and the right-wing hive mind was eager to perpetuate the myth that he was a suppressed Galileo (Reason, Wall Street Journal, Epoch Times, Sensible Medicine, The Free Press, UnHerd, Tablet, The Heartland Institute, The Spectator, Fox News, Rubin Report, ZDoggMD). They agreed he was the pandemic’s Main Character and that his Tweets and YouTube videos mattered more than the victims of his misinformation. Dr. Bhattacharya promised the horrors would end once he took office. He testified during his confirmation hearing that he would welcome dissent and promote a culture of free speech. He promised a new era of open discussion, where scientists would finally be free to Tweet without repercussions. No one would have to suffer or fear as he did. “We will never use this agency to censor scientists who disagree,” he said recently on Fox News. NIH Director Removes Four Main Scientists Amid Massive Staff Purge As with COVID, the depressing reality on the ground bears no relation to Dr. Bhattacharya’s cheerful Fox News fantasy. Though Dr. Bhattacharya promised to tolerate dissent, many articles about the NIH contain remarks from officials who ask to “remain anonymous for fear of retaliation.” Why is this? What are they afraid of? Today, scientists have much more to worry about than their social media feeds. Scientists are being purged, research is being defunded, words are being banned, thought is being policed, universities and medical journals are being attacked. Foreign scientists are staying away, and many domestic ones want to flee. Here are some recent headlines: NIH Director Removes Four Main Scientists Amid Massive Staff Purge Women, Minorities Fired in Purge of NIH Science Review Boards Trump Officials Will Screen NIH Funding Opportunities NIH Reels with Fear, Uncertainty About Future of Scientific Research NIH Freezes Funds to Harvard and Four Other Universities, But Can’t Tell Them Leading Nutrition Scientist Departs N.I.H., Citing Censorship Nobel-Winning Scientist Says His Researchers Are Fleeing the Country Because Of Trump’s Cruelty I Work at NIH. The Fear Among Staff Is Palpable Here Are the Words Putting Science in the Crosshairs of Trump’s Orders NIH Sued Over ‘Ideological Purge’ of DEI, Covid and Vaccine Research Medical Journals Get Letters From DOJ Growing Signs of Discontent — and Resistance — Within NIH Scientists Say NIH Officials Told Them to Scrub mRNA References on Grants At NIH, ‘Everyone is on Edge’ as They Brace for Deep Cuts and More Centralized Control Survey: Trump Policies Push 75% of Scientists to Consider Leaving U.S. Fauci Allies, Covid Vaccine Officials Get Ax at NIH Nearly 300 Scientists Apply for French Academic Program Amid Trump Cuts in U.S. NIH Bans All Future Grants to Universities with DEI Programs or Israel Boycotts A Sense of Foreboding Hangs Over the National Institutes of Health ‘Chaos and Confusion’ at the N.I.H., the Crown Jewel of American Science NIH Removing Outside Scientific Advisers Who Evaluate Research This is the state of science and research under Dr. Bhattacharya’s leadership and in the administration in which he proudly serves. “Massive” cuts to the NIH budget are on the horizon. Along with his COVID misinformation, this will be Dr. Bhattacharya’s permanent legacy. No one is going to care about the YouTube video he lost in 2021 or that he was called “fringe.” Dr. Jay Bhattacharya’s legacy You should be ashamed of yourself Perhaps one day Dr. Bhattacharya will stop talking about free scientific debate and demonstrate a commitment to it. Until then, as with his flawed COVID pronouncements, we are allowed to remember and amplify what he said about censorship. He had strong feelings on the topic and expressed them often. The stakes today are higher than Tweets and YouTube videos. Like Dr. Bhattacharya, I call it like I see it, though I don’t feel nearly as safe and I once did. However, if I could speak freely, I might say something like this: Those were the words of a man who knew he had nothing to fear from the government, but every incentive to pretend they were out to get him. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-17.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\n\u003ch2\u003eLet’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate.\u003c/h2\u003e\n\n\n\n\u003cp\u003eForgive me for the clickbait title of this article. It’s not my style to make such histrionic, overwrought allegations. However, it is my style to accurately quote people, and I am merely repeating the words our NIH director, Dr. Jay Bhattacharya, who said things like this about censorship, not long ago:\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"450\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-1024x450.png\" alt=\"A tweet from Jay Bhattacharya claims censorship is used to hide government policy failure, with a highlighted sentence: \u0026#34;the purpose of censorship is to cover up government policy failure,\u0026#34; and a follow-up explaining this view.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-1024x450.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-480x211.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-200x88.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-768x338.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15-650x286.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-15.png 1067w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThose are strong words, and they seem to apply well to our current moment. What calamity befell Dr. Bhattacharya to make him say this? Was he fired? Was his research defunded? Did no one know his name or what he believed? Was “media/social media suppression” \u003cem\u003ereally\u003c/em\u003e the only thing standing between Dr. Bhattacharya and a perfect pandemic response?\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"628\" height=\"495\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-18.png\" alt=\"A tweet by Jay Bhattacharya questions NIH\u0026#39;s handling of the Great Barrington Declaration in October 2020, suggesting without suppression, schools would’ve reopened and protection prioritized instead of lockdowns.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-18.png 628w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-18-480x378.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-18-200x158.png 200w\" sizes=\"(max-width: 628px) 100vw, 628px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eDr. Jay Bhattacharya \u003cem\u003ewould have\u003c/em\u003e done amazing, incredible things\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Bhattacharya felt grievously victimized because he was called “\u003ca href=\"https://sciencebasedmedicine.org/fringe/\" title=\"\"\u003efringe\u003c/a\u003e” in an email, and he lost a YouTube video and some Tweets. To him, this was a calamity of epic proportions with grave implications for the future of free speech in the U.S. After losing a YouTube video in 2021, Florida Governor Ron Desantis put out a press release titled \u003ca href=\"https://www.flgov.com/eog/news/press/2021/governor-ron-desantis-holds-roundtable-public-health-experts-discuss-big-tech\"\u003eGOVERNOR RON DESANTIS HOLDS ROUNDTABLE WITH PUBLIC HEALTH EXPERTS TO DISCUSS BIG TECH CENSORSHIP.\u003c/a\u003e It contained the following quotes:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003e“There’s nothing more dangerous than being able to censor what is said in a country, because then you are simply not ever going to even hear the truth. And you are entering into a phase of countries that we used to criticize severely like the USSR, like communist China…I mean, this is almost the end of our civilization if we have this sort of censorship, I’m afraid,” \u003cstrong\u003esaid Dr. Scott Atlas.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“For science to work, you have to have an open exchange of ideas…If you’re going to make an argument that something is misinformation, you should provide an actual argument. You can’t just take it down and say, ‘Oh, it’s misinformation’ without actually giving a reason…Let’s hear the argument, let’s see the evidence that YouTube used to decide it was misinformation. Let’s have a debate. Science works best when we have an open debate,” \u003cstrong\u003esaid Dr. Jay Bhattacharya.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e“We need to have debates, rather than censoring…When we do censoring and slandering, even if we are willing to continue to speak out, there are many other scientists that I know, including junior scientists, who do not want to speak out because they see what’s happening to us. They don’t want to have to go through the same thing. So, we really need a debate,” \u003cstrong\u003esaid Dr. Martin Kulldorff.\u003c/strong\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eAgain, these Big Feelings from famous doctors were about a single YouTube video. When Dr. Bhattacharya claims to have been silence and censored, this is what he is talking about, though he may have had motives beyond pure scientific discourse to keep people enraged and engaged with his social media feed.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"347\" height=\"546\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-2.jpeg\" alt=\"Business Insider article headline: \u0026#34;Trump\u0026#39;s NIH director nominee made nearly $12,000 from posting on X last year.\u0026#34; Below the headline is a man in a suit speaking while seated on stage at a Forbes event.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-2.jpeg 347w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-2-127x200.jpeg 127w\" sizes=\"(max-width: 347px) 100vw, 347px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e\u003ca href=\"https://www.businessinsider.com/jay-bhattacharya-x-content-creator-national-institute-health-2025-2\"\u003eRead this article here\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eReasonable people can disagree about whether Big Tech and Biden administration overstepped their bounds in trying to limit online disinformation. Maybe government officials should have yawned and said nothing as anti-vaccine lies killed droves of Americans. Dr. Bhattacharya sure thinks so, and he wasn’t afraid to challenge the government. He excoriated them obsessively and even took a case about this to the Supreme Court. According to the Wikipedia article \u003ca href=\"https://en.wikipedia.org/wiki/Murthy_v._Missouri\"\u003eMurthy v. Missouri\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe lawsuit alleges that President Joe Biden and his administration were “working with social media giants such as Meta, Twitter, and YouTube to censor and suppress free speech, including truthful information, related to COVID-19, election integrity, and other topics, under the guise of combating ‘misinformation’.” \u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eImagine if the fate of social media posts was the sole concern of scientists today. It all seems pretty trivial now, doesn’t it? Yet, this hysterical, provocative language is how Dr. Bhattacharya routinely depicted a government that requested Facebook limit deadly anti-vaccine disinformation.\u003c/p\u003e\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"451\" height=\"546\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-4.jpeg\" alt=\"A man in a U.S. Public Health Service uniform speaks at a podium, holding a blue booklet titled \u0026#34;Confronting Health Misinformation.\u0026#34; The background features an emblem with the U.S. flag.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-4.jpeg 451w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-4-165x200.jpeg 165w\" sizes=\"auto, (max-width: 451px) 100vw, 451px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003e\u003ca href=\"https://www.wsj.com/articles/white-house-covid-censorship-machine-social-media-facebook-meta-executive-rob-flaherty-free-speech-google-11673203704\"\u003eThis article\u003c/a\u003e was about social media content.\u003c/p\u003e\n\n\n\n\u003ch2\u003eThe End of Free Speech is the End of Science.\u003c/h2\u003e\n\n\n\n\u003cp\u003eIn reality, Dr. Bhattacharya was not silenced. As the video below shows, he was loud, prominent, and influential. He didn’t come out of nowhere when Trump plunked him from obscurity to head the NIH. He was a celebrity on \u003ca href=\"https://www.mediamatters.org/fox-news/dishonest-doctors-who-were-fox-news-most-frequent-medical-guests-2021-0\"\u003eFox News\u003c/a\u003e and Twitter. Billionaires \u003ca href=\"https://sciencebasedmedicine.org/bombshell/\"\u003esung his praises\u003c/a\u003e. He made an enormous number of \u003ca href=\"https://www.youtube.com/watch?v=pfxyFK8uwV0\"\u003eYouTube videos\u003c/a\u003e, many of them about how he had been censored. He was on countless podcasts and wrote many columns in international newspapers. He advised \u003ca href=\"https://www.youtube.com/watch?v=pnzhwaswY6I\"\u003epresidents\u003c/a\u003e and \u003ca href=\"https://floridapolitics.com/archives/712217-ron-desantis-jay-bhattacharya-nih/\"\u003egovernors\u003c/a\u003e. He testified in \u003ca href=\"https://floridaphoenix.com/2021/08/24/desantis-adviser-takes-virtual-stand-in-lawsuit-testing-school-masks-policy/\"\u003ecourts\u003c/a\u003e and before \u003ca href=\"https://www.youtube.com/watch?v=WqfIekceDvc\"\u003eCongress\u003c/a\u003e. He was \u003cem\u003eeverywhere\u003c/em\u003e, except a hospital.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Bhattacharya is doing just fine today, and he was \u003cem\u003ealways\u003c/em\u003e doing just fine. While his feelings may have been hurt, he was famous, healthy, and gainfully employed. Indeed, he lost his Supreme Court case, as he couldn’t show he had been harmed in any way. Justice Amy Coney Barrett wrote the opinion, stating:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eTo establish standing, the plaintiffs must demonstrate a substantial risk that, in the near future, they will suffer an injury that is traceable to a government defendant and redressable by the injunction they seek. Because no plaintiff has carried that burden, none has standing to seek a preliminary injunction.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eShe’s right. Dr. Bhattacharya was so “censored” that he became the director of the NIH.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Uncensored Fringe Epidemiologist\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/zFCwlSaeZ2I?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eMoreover, Dr. Bhattacharya’s experience was hardly unique. He was called “\u003ca href=\"https://sciencebasedmedicine.org/fringe/\" title=\"\"\u003efringe\u003c/a\u003e” because he claimed the mass infection of unvaccinated people under 60-70 would end the pandemic in 3-6 months. Big deal. Dr. Bhattacharya wrote a \u003ca href=\"https://x.com/DrJBhattacharya/status/1669047416753111040\" title=\"\"\u003efake “review”\u003c/a\u003e of \u003ca href=\"https://www.latimes.com/business/story/2023-05-23/column-these-experts-sold-the-u-s-on-a-disastrous-covid-plan-and-never-paid-a-professional-price\"\u003emy book\u003c/a\u003e and called me childish names for pointing out the flaws in his “plan.” It’s not fun being on the receiving end of such juvenile, content-free tantrums, but it’s not \u003cem\u003ethat bad \u003c/em\u003eeither. \u003c/p\u003e\n\n\n\n\u003cp\u003eAdditionally, Dr. Bhattacharya was not the only doctor who had their voice curtailed in one way or another. I wrote about being silenced for political reasons in an article titled \u003ca href=\"https://sciencebasedmedicine.org/cancelled/\"\u003eI’ve Been Silenced, Censored, and Cancelled. The Reason Why Matters\u003c/a\u003e. I didn’t center my identity around this or expect anyone to pity me. The doctors \u003ca href=\"https://www.aan.com/PressRoom/Home/PressRelease/4895\"\u003eI knew\u003c/a\u003e who died of COVID were truly silenced. Rather, I wrote about my canceled speech, once, fearing that it might foreshadow worse things to come.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn contrast, Dr. Bhattacharya treated his feelings and social media content as the central story of the pandemic. Nothing mattered more to him. While I never heard him express remorse over a young life lost to COVID, he produced an overwhelming amount of material depicting himself as both a “censored” scientist and true champion of free speech. He testified before Congress about having been a victim of a fictional “\u003ca href=\"https://www.youtube.com/watch?v=WqfIekceDvc\"\u003eMinistry of Truth\u003c/a\u003e” gave and self-important talks with grandiose titles such as \u003ca href=\"https://jmp.princeton.edu/events/2024/end-free-speech-end-science\" title=\"\"\u003eThe End of Free Speech is the End of Science, A Personal COVID Perspective\u003c/a\u003e.  Dr. Bhattacharya \u003ca href=\"https://www.youtube.com/watch?v=iKo6v0Ex1cA\"\u003estill feels\u003c/a\u003e he’s owed a public apology because he was called “fringe” in an email 4.5 years ago.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Bhattacharya’s identity was entirely based around grievance and victimhood, and the right-wing hive mind was eager to perpetuate the myth that he was a suppressed Galileo (\u003ca href=\"https://reason.com/2024/06/25/jay-bhattacharya-on-covid-19/\" title=\"\"\u003eReason\u003c/a\u003e, \u003ca href=\"https://www.wsj.com/articles/the-twitter-blacklisting-of-jay-bhattacharya-medical-expert-covid-lockdown-stanford-doctor-shadow-banned-censorship-11670621083\" title=\"\"\u003eWall Street Journal\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=hQzS9uqdw68\" title=\"\"\u003eEpoch Times\u003c/a\u003e, \u003ca href=\"https://www.sensible-med.com/p/the-semmelweis-effect-and-the-great\" title=\"\"\u003eSensible Medicine\u003c/a\u003e, \u003ca href=\"https://www.thefp.com/p/jay-bhattacharya-nih-fauci\" title=\"\"\u003eThe Free Press\u003c/a\u003e, \u003ca href=\"https://unherd.com/2022/12/what-i-discovered-at-twitter-hq/\" title=\"\"\u003eUnHerd\u003c/a\u003e, \u003ca href=\"https://www.tabletmag.com/sections/science/articles/the-dissidents\" title=\"\"\u003eTablet\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=rHmTzCyrMzs\" title=\"\"\u003eThe Heartland Institute\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=GDqx6R1okrU\" title=\"\"\u003eThe Spectator\u003c/a\u003e, \u003ca href=\"https://www.foxnews.com/video/6317312002112\" title=\"\"\u003eFox News\u003c/a\u003e, \u003ca href=\"https://www.youtube.com/watch?v=7T3ijqvjj40\" title=\"\"\u003eRubin Report\u003c/a\u003e, \u003ca href=\"https://zdoggmd.com/jay-bhattacharya-2/\" title=\"\"\u003eZDoggMD\u003c/a\u003e). They agreed he was the pandemic’s Main Character and that his Tweets and YouTube videos mattered more than the victims of his misinformation.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Bhattacharya promised the horrors would end once he took office. He testified during his confirmation hearing that he would welcome dissent and promote a culture of free speech. He promised a new era of open discussion, where scientists would \u003cem\u003efinally\u003c/em\u003e be free to Tweet without repercussions. No one would have to suffer or fear as he did. “We will never use this agency to censor scientists who disagree,” he said recently on \u003ca href=\"https://www.instagram.com/foxandfriends/reel/DH6R6ldxogl/\"\u003eFox News\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe loading=\"lazy\" title=\"Jay Bhattacharya speaks on the value of free speech in science\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/AP0M-IIYL3Y?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003ch2\u003eNIH Director Removes Four Main Scientists Amid Massive Staff Purge\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs with COVID, the depressing reality on the ground bears no relation to Dr. Bhattacharya’s cheerful Fox News fantasy. Though Dr. Bhattacharya promised to tolerate dissent, many articles about the NIH contain remarks from officials who ask to “\u003ca href=\"https://www.thetransmitter.org/science-and-society/u-s-health-agency-purge-includes-10-lab-heads-at-national-institute-of-neurological-disorders-and-stroke/\"\u003eremain anonymous for fear of retaliation\u003c/a\u003e.” Why is this? What are they afraid of?\u003c/p\u003e\n\n\n\n\u003cp\u003eToday, scientists have much more to worry about than their social media feeds. Scientists are being purged, research is being defunded, words are being banned, thought is being policed, universities and medical journals are being attacked. Foreign scientists are \u003ca href=\"https://www.science.org/content/article/international-scientists-rethink-us-conference-attendance\"\u003estaying away,\u003c/a\u003e and many domestic ones want to flee. Here are some recent headlines:\u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.scientificamerican.com/article/nih-director-removes-four-main-scientists-amid-massive-staff-purge/\"\u003eNIH Director Removes Four Main Scientists Amid Massive Staff Purge\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/science/2025/04/16/women-and-minorities-fired-nih-board-science/\"\u003eWomen, Minorities Fired in Purge of NIH Science Review Boards\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.science.org/content/article/trump-officials-will-screen-nih-funding-opportunities\"\u003eTrump Officials Will Screen NIH Funding Opportunities\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/science/2025/03/05/nih-trump-turmoil-grants/\"\u003eNIH Reels with Fear, Uncertainty About Future of Scientific Research\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.science.org/content/article/nih-freezes-funds-harvard-and-four-other-universities-can-t-tell-them\"\u003eNIH Freezes Funds to Harvard and Four Other Universities, But Can’t Tell Them\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.nytimes.com/2025/04/16/well/kevin-hall-nutrition-retirement-nih-censorship-rfk-maha.html\"\u003eLeading Nutrition Scientist Departs N.I.H., Citing Censorship\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://futurism.com/neoscope/nobel-winning-scientist-researchers-fleeing-us-trump\"\u003eNobel-Winning Scientist Says His Researchers Are Fleeing the Country Because Of Trump’s Cruelty\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.motherjones.com/politics/2025/01/nih-science-trump-funding-freeze-chaos-chilling-effect-dei/\"\u003eI Work at NIH. The Fear Among Staff Is Palpable\u003c/a\u003e \u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.washingtonpost.com/science/2025/02/04/national-science-foundation-trump-executive-orders-words/\"\u003eHere Are the Words Putting Science in the Crosshairs of Trump’s Orders\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.theguardian.com/us-news/2025/apr/02/nih-funding-trump-lawsuit\"\u003eNIH Sued Over ‘Ideological Purge’ of DEI, Covid and Vaccine Research\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.medpagetoday.com/special-reports/exclusives/115180\"\u003eMedical Journals Get Letters From DOJ\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.statnews.com/2025/04/18/health-news-nih-discontent-he-jiankui-gene-editing-hearing-loss-dementia-morning-rounds/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGrowing Signs of Discontent — and Resistance — Within NIH\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://kffhealthnews.org/news/article/nih-grants-mrna-vaccines-trump-administration-hhs-rfk/\"\u003eScientists Say NIH Officials Told Them to Scrub mRNA References on Grants\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.statnews.com/2025/03/14/nih-staff-cuts-reorganization-morale/\"\u003eAt NIH, ‘Everyone is on Edge’ as They Brace for Deep Cuts and More Centralized Control\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.insidehighered.com/news/quick-takes/2025/04/01/poll-75-scientists-consider-leaving-us\"\u003eSurvey: Trump Policies Push 75% of Scientists to Consider Leaving U.S.\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.politico.com/news/2025/04/02/fauci-allies-covid-vaccine-officials-dismissed-nih-00265714\"\u003eFauci Allies, Covid Vaccine Officials Get Ax at NIH\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.npr.org/2025/04/18/nx-s1-5368132/us-researchers-scientists-apply-french-university-program\" title=\"\"\u003eNearly 300 Scientists Apply for French Academic Program Amid Trump Cuts in U.S.\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.statnews.com/2025/04/21/trump-nih-grants-draft-rule-would-prohibit-university-dei-programs-israel-boycott/\" title=\"\"\u003eNIH Bans All Future Grants to Universities with DEI Programs or Israel Boycotts\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.npr.org/sections/shots-health-news/2025/02/04/nx-s1-5286669/nih-research-confusion\"\u003eA Sense of Foreboding Hangs Over the National Institutes of Health\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.nytimes.com/2025/03/24/health/nih-doge-trump.html\"\u003e‘Chaos and Confusion’ at the N.I.H., the Crown Jewel of American Science\u003c/a\u003e\u003c/li\u003e\n\n\n\n\u003cli\u003e\u003ca href=\"https://www.statnews.com/2025/03/24/nih-outside-scientific-advisers-being-removed/\"\u003eNIH Removing Outside Scientific Advisers Who Evaluate Research\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eThis is the state of science and research under Dr. Bhattacharya’s leadership and in the administration in which he proudly serves. “\u003ca href=\"https://www.science.org/content/article/trump-proposes-massive-nih-budget-cut-and-reorganization\"\u003eMassive\u003c/a\u003e” cuts to the NIH budget are on the horizon. Along with his COVID misinformation, this will be Dr. Bhattacharya’s permanent legacy. No one is going to care about \u003ca href=\"https://www.youtube.com/watch?v=pfxyFK8uwV0\"\u003ethe YouTube video\u003c/a\u003e he lost in 2021 or that he was called “fringe.”\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"357\" height=\"546\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-1.jpeg\" alt=\"A man in a suit speaks into a microphone at a podium. The article headline reads, \u0026#34;NIH Director Removes Four Main Scientists amid Massive Staff Purge,\u0026#34; with details about actions by the Trump Administration at the NIH.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-1.jpeg 357w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-1-131x200.jpeg 131w\" sizes=\"auto, (max-width: 357px) 100vw, 357px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\u003cp\u003eDr. Jay Bhattacharya’s legacy\u003c/p\u003e\n\n\n\n\n\n\n\n\u003ch2\u003eYou should be ashamed of yourself\u003c/h2\u003e\n\n\n\n\u003cp\u003ePerhaps one day Dr. Bhattacharya will stop \u003cem\u003etalking\u003c/em\u003e about free scientific debate and demonstrate a commitment to it. Until then, as with his flawed\u003ca href=\"https://www.youtube.com/watch?v=pX7rcCMaJA4\"\u003e COVID pronouncements\u003c/a\u003e, we are allowed to remember and amplify what he said about censorship. He had strong feelings on the topic and expressed them often. The stakes today are higher than Tweets and YouTube videos. Like Dr. Bhattacharya, I call it like I see it, though I don’t feel nearly as safe and I once did. However, if I could speak freely, I might say something like \u003ca href=\"https://x.com/DrJBhattacharya/status/1662258774613311488\"\u003ethis\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\n\n\n\u003cdiv\u003e\n\u003cfigure\u003e\u003cimg loading=\"lazy\" decoding=\"async\" width=\"695\" height=\"546\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-16.png\" alt=\"A tweet by Jay Bhattacharya criticizes a government administration for censoring scientific discussion, calling it the most authoritarian policy he’s seen, and says the official should be ashamed. The tweet is dated May 26, 2023.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-16.png 695w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-16-480x377.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-16-200x157.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/04/image-16-650x511.png 650w\" sizes=\"auto, (max-width: 695px) 100vw, 695px\"/\u003e\u003c/figure\u003e\u003c/div\u003e\n\n\n\n\n\n\n\u003cp\u003eThose were the words of a man who knew he had nothing\u003cem\u003e \u003c/em\u003eto fear from the government, but every incentive to pretend they were out to get him.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                                                                                                    Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                                                                                                \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#6d0702030c19050c034305021a0c1f092d031418010c030a02030843021f0a\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                            \n        \n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "15 min read",
  "publishedTime": "2025-04-22T03:16:00-04:00",
  "modifiedTime": "2025-04-22T17:28:30Z"
}
