{
  "id": "4d320f99-eb41-42f9-a5c9-01f274877ecd",
  "title": "Why your headphone battery doesn't last",
  "link": "https://www.sciencedaily.com/releases/2025/02/250204141845.htm",
  "description": "Engineers took on the well-known battery challenge of degradation in a real-world technology that many of us use daily: wireless earbuds.",
  "author": "",
  "published": "Tue, 04 Feb 2025 14:18:45 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4123,
  "excerpt": "Engineers took on the well-known battery challenge of degradation in a real-world technology that many of us use daily: wireless earbuds.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Ever notice that batteries in electronics don't last as long as they did when they were brand new? An international research team led by The University of Texas at Austin took on this well-known battery challenge, called degradation, with a twist. They're focusing their work on real-world technology that many of us use daily: wireless earbuds. They deployed x-ray, infrared, and other imaging technologies to understand the complexities of all the technology packed in these tiny devices and learn why their battery lives erode over time. \"This started with my personal headphones; I only wear the right one, and I found that after two years, the left earbud had a much longer battery life,\" said Yijin Liu, an associate professor in the Cockrell School of Engineering's Walker Department of Mechanical Engineering, who led the new research published in Advanced Materials. \"So, we decided to look into it and see what we could find.\" They found that other critical components in the compact device, like the Bluetooth antenna, microphones and circuits, clashed with the battery, creating a challenging microenvironment. This dynamic led to a temperature gradient -- different temperatures at the top and bottom portions of the battery -- that damaged the battery. Exposure to the real world, with many different temperatures, degrees of air quality and other wildcard factors, also plays a role. Batteries are often designed to withstand harsh environments, but frequent environmental changes are challenging in their own way. These findings, the researchers say, illustrate the need to think more about how batteries fit into real-world devices like phones, laptops and vehicles. How can they be packaged to mitigate interactions with potentially damaging components, and how can they be adjusted for different user behaviors? \"Using devices differently changes how the battery behaves and performs,\" said Guannan Qian, the first author of this paper and a postdoctoral researcher in Liu's lab. \"They could be exposed to different temperatures; one person has different charging habits than another; and every electric vehicle owner has their own driving style. This all matters.\" To conduct experiments, Liu and his team worked closely with UT's Fire Research Group, led by mechanical engineer Ofodike Ezekoye. They used Ezekoye's infrared imaging technology to complement their laboratory x-ray technology at UT Austin and Sigray Inc. But to get the full picture, Liu and his team turned to some of the most powerful x-ray facilities on the planet. They collaborated with teams from SLAC National Accelerator Laboratory's Stanford Synchrotron Radiation Lightsource, Brookhaven National Laboratory's National Synchrotron Light Source II, Argonne National Laboratory's Advanced Photon Source, and the European Synchrotron Radiation Facility (ESRF) in France. These national and international institutions grant researchers access to world-class synchrotron facilities, enabling them to uncover the hidden dynamics of batteries under real-life conditions. \"Most of the time, in the lab, we're looking at either pristine and stable conditions or extremes,\" said Xiaojing Huang, a physicist at Brookhaven National Laboratory. \"As we discover and develop new types of batteries, we must understand the differences between lab conditions and the unpredictability of the real world and react accordingly. X-ray imaging can offer valuable insights for this.\" Liu says his team will continue to investigate battery performance in real-world conditions. That work could extend to larger cells, like the batteries that power our phones, laptops and electric vehicles. The full team includes: Tianxiao Sun and Ayrton M. Yanyachi of the Walker Department of Mechanical Engineering; Guibin Zan, Jizhou Li, Dechao Meng, Vivek Thampy, Sang-Jun Lee, Jun-Sik Lee and Piero Pianetta of SLAC; Sheraz Gul and Wenbing Yun of Sigray; Xiaojing Huang, Hanfei Yan and Yong S. Chu of Brookhaven National Laboratory; Juanjuan Huang and Shelly D. Kelly of Argonne National Laboratory; Peter Cloetens of ESRF; and Kejie Zhao of Purdue University.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eEver notice that batteries in electronics don\u0026#39;t last as long as they did when they were brand new?\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eAn international research team led by The University of Texas at Austin took on this well-known battery challenge, called degradation, with a twist. They\u0026#39;re focusing their work on real-world technology that many of us use daily: wireless earbuds. They deployed x-ray, infrared, and other imaging technologies to understand the complexities of all the technology packed in these tiny devices and learn why their battery lives erode over time.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This started with my personal headphones; I only wear the right one, and I found that after two years, the left earbud had a much longer battery life,\u0026#34; said Yijin Liu, an associate professor in the Cockrell School of Engineering\u0026#39;s Walker Department of Mechanical Engineering, who led the new research published in \u003cem\u003eAdvanced Materials.\u003c/em\u003e \u0026#34;So, we decided to look into it and see what we could find.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThey found that other critical components in the compact device, like the Bluetooth antenna, microphones and circuits, clashed with the battery, creating a challenging microenvironment. This dynamic led to a temperature gradient -- different temperatures at the top and bottom portions of the battery -- that damaged the battery.\u003c/p\u003e\n\u003cp\u003eExposure to the real world, with many different temperatures, degrees of air quality and other wildcard factors, also plays a role. Batteries are often designed to withstand harsh environments, but frequent environmental changes are challenging in their own way.\u003c/p\u003e\n\u003cp\u003eThese findings, the researchers say, illustrate the need to think more about how batteries fit into real-world devices like phones, laptops and vehicles. How can they be packaged to mitigate interactions with potentially damaging components, and how can they be adjusted for different user behaviors?\u003c/p\u003e\n\u003cp\u003e\u0026#34;Using devices differently changes how the battery behaves and performs,\u0026#34; said Guannan Qian, the first author of this paper and a postdoctoral researcher in Liu\u0026#39;s lab. \u0026#34;They could be exposed to different temperatures; one person has different charging habits than another; and every electric vehicle owner has their own driving style. This all matters.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTo conduct experiments, Liu and his team worked closely with UT\u0026#39;s Fire Research Group, led by mechanical engineer Ofodike Ezekoye. They used Ezekoye\u0026#39;s infrared imaging technology to complement their laboratory x-ray technology at UT Austin and Sigray Inc. But to get the full picture, Liu and his team turned to some of the most powerful x-ray facilities on the planet.\u003c/p\u003e\n\n\n\u003cp\u003eThey collaborated with teams from SLAC National Accelerator Laboratory\u0026#39;s Stanford Synchrotron Radiation Lightsource, Brookhaven National Laboratory\u0026#39;s National Synchrotron Light Source II, Argonne National Laboratory\u0026#39;s Advanced Photon Source, and the European Synchrotron Radiation Facility (ESRF) in France. These national and international institutions grant researchers access to world-class synchrotron facilities, enabling them to uncover the hidden dynamics of batteries under real-life conditions.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Most of the time, in the lab, we\u0026#39;re looking at either pristine and stable conditions or extremes,\u0026#34; said Xiaojing Huang, a physicist at Brookhaven National Laboratory. \u0026#34;As we discover and develop new types of batteries, we must understand the differences between lab conditions and the unpredictability of the real world and react accordingly. X-ray imaging can offer valuable insights for this.\u0026#34;\u003c/p\u003e\n\u003cp\u003eLiu says his team will continue to investigate battery performance in real-world conditions. That work could extend to larger cells, like the batteries that power our phones, laptops and electric vehicles.\u003c/p\u003e\n\u003cp\u003eThe full team includes: Tianxiao Sun and Ayrton M. Yanyachi of the Walker Department of Mechanical Engineering; Guibin Zan, Jizhou Li, Dechao Meng, Vivek Thampy, Sang-Jun Lee, Jun-Sik Lee and Piero Pianetta of SLAC; Sheraz Gul and Wenbing Yun of Sigray; Xiaojing Huang, Hanfei Yan and Yong S. Chu of Brookhaven National Laboratory; Juanjuan Huang and Shelly D. Kelly of Argonne National Laboratory; Peter Cloetens of ESRF; and Kejie Zhao of Purdue University.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
