{
  "id": "5011be0a-df0d-4454-8eae-3f0989664f2c",
  "title": "What’s at Stake in Supreme Court Case on Transgender Health Care",
  "link": "https://www.scientificamerican.com/article/whats-at-stake-in-supreme-court-case-on-transgender-health-care/",
  "description": "In United States v. Skrmetti, the Supreme Court is considering whether a law banning gender-affirming care for transgender youth is discriminatory under the Constitution",
  "author": "",
  "published": "Thu, 05 Dec 2024 22:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Allison Parshall",
  "length": 9015,
  "excerpt": "In United States v. Skrmetti, the Supreme Court is considering whether a law banning gender-affirming care for transgender youth is discriminatory under the Constitution",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "December 5, 20245 min readSupreme Court to Decide Landmark Transgender Health Care Case. Here’s What’s at StakeIn United States v. Skrmetti, the Supreme Court is considering whether a law banning gender-affirming care for transgender youth is discriminatory under the ConstitutionPeople rally outside of the the U.S. Supreme Court on December 04, 2024 as the justices hear arguments in United States v. Skrmetti, a case on transgender health rights Kevin Dietsch/Getty ImagesThis week the U.S. Supreme Court heard oral arguments in United States v. Skrmetti, a case that challenges Tennessee’s ban on gender-affirming care for minors. The justices are considering whether these bans discriminate on the basis of sex under the Constitution’s Equal Protection Clause.The Court appears poised to uphold the Tennessee law, SB1, which was enacted in July 2023 and prohibits all medical care intended to allow someone under 18 years old to “identify with, or live as, a purported identity inconsistent with the minor’s sex” assigned at birth, citing the state’s interest in “encouraging minors to appreciate their sex.”“What’s at stake is whether the Court is going to consider transgender people to merit some of the protections of the Equal Protection Clause or whether states are allowed to discriminate against transgender people. And that’s a big question,” says Elana Redfield, an LGBTQ+ policy expert at the Williams Institute, part of the University of California, Los Angeles.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.The Tennessee law, which mirrors similar recent bans in 24 other states, prevents transgender youth from receiving treatments proven to relieve the symptoms of gender dysphoria (psychological distress that results from an incongruence between someone’s sex assigned at birth and their gender identity). These treatments include puberty-blocking drugs and hormone therapies—medications also used by nontransgender adolescents and children to treat a variety of conditions. Their use to treat gender dysphoria is supported by the American Medical Association, the American Association of Pediatrics, the American Psychological Association and other important medical institutions.A number of studies have shown that adolescents who receive gender-affirming care have better mental health outcomes—including a lower rate of suicidal ideation—than those who wanted treatment but couldn’t get it. And care bans have increased suicide rates among transgender young people in affected states, recent research has shown. Like any medication, the treatments can have risks, which is true when they are prescribed for nontransgender people as well. Parents and physicians weigh these risks against those of not receiving the care. Critics of gender-affirming care for minors often cite concerns that adolescents will later regret the treatment, but regret rates are relatively low.While the Tennessee law prohibits these treatments when they are used for the purpose of transitioning, nontransgender youth continue to have access to them. In Supreme Court oral arguments on Wednesday U.S. Solicitor General Elizabeth Prelogar argued that this constitutes sex discrimination—because the law uses birth-assigned sex to determine what medications someone legally has access to. For example, an adolescent would be able to access testosterone if they were assigned male at birth but not if they were assigned female.“SB1 leaves the same medications and many others entirely unrestricted when used for any other purpose [outside of gender-affirming care], even when those uses present similar risks,” Prelogar said during her opening statement. The federal government is arguing that the law’s sex-based classification should trigger a heightened level of judicial scrutiny under the Equal Protection Clause of the 14th Amendment to the Constitution. If the Supreme Court agrees, it can send the case back to the lower courts. There Tennessee officials would have to demonstrate that the law serves an important government interest. At this stage, the lower courts could weigh the evidence supporting gender-affirming care in evaluating the impacts of a total ban.Before the Court’s nine justices, Tennessee Solicitor General Matthew Rice argued that the law does not discriminate on the basis of sex because it prevents both those assigned male and female at birth from transitioning. This reasoning could also be applied to laws that prevent or restrict adults from receiving gender-affirming care, such as Florida’s SB 254. A decision is not expected until next spring, but at least five members of the Supreme Court’s conservative supermajority are widely seen as likely to side with Tennessee.“If the Court upholds this ban, it will potentially validate all the 24 states that have bans” on gender-affirming care for minors, Redfield says. The decision, she adds, may impact current and future legal challenges to other antitrans legislation—such as bans on adult gender-affirming care or bathroom and sports bans based on gender identity.The stakes of these challenges will continue to grow as President-elect Donald Trump returns to the White House in January. This election cycle, Republicans spent an estimated $215 million in network TV advertisements attacking and denigrating transgender people, who make up less than 1 percent of the U.S. population.“On Day One, I will sign an executive order instructing every federal agency to cease the promotion of sex or gender transition at any age,” Trump said at an event hosted by the anti-LGBTQ+ group Moms for Liberty in June 2023. He has also said that he would revoke the federal funding of any hospital or health care provider that provides gender-affirming care to minors.This possibility is very worrying for Daphna Stroumsa, an ob-gyn at University of Michigan Health, who specializes in gender-affirming care. Being prevented from providing patients with the best care is “heartbreaking. It feels ethically and morally wrong,” Stroumsa says. “The effects of not being able to offer this care on the individual can be devastating.”Susan Lacy, one of the plaintiffs in the case against Tennessee’s ban and an ob-gyn based in Memphis, expressed similar distress in a declaration in the initial lawsuit. “Being prohibited from treating my patients in accordance with existing evidence and clinical guidelines is an awful scenario that no medical provider should be forced to face,” she wrote.Nearly 40 percent of transgender young people between the ages of 13 and 17 now live in states where laws have banned gender-affirming care. Members of the three families that challenged Tennessee’s ban in this case, which originated in a Tennessee district court, have described how devastating a prohibition would be for their life and livelihood. In all three families, the parents described how their children experienced debilitating mental and physical symptoms of gender dysphoria that caused them to withdraw from the world. One child began getting repeated urinary tract infections because she was uncomfortable using the bathroom at school, her parents said. Another, referred to as Ryan Roe, threw up almost every morning before school and stopped talking almost entirely.“I was scared and didn’t want to move too fast with medical treatment,” Roe’s mother wrote in a declaration. “But I also worried, that in my fear, I had moved too slowly for what my child needed. As I watched my son suffer and decline, I realized we couldn’t wait anymore.” The family consulted a doctor about gender-affirming care, and Roe eventually started taking testosterone. He subsequently “transformed back into the vocal, outgoing child that we saw before puberty,” his mother said.“Nobody makes this choice overnight,” Stroumsa says. “These are dedicated parents and dedicated physicians who have a very long process ... before any decisions are made.”All three families are considering traveling out of state regularly for treatment—an expensive effort that requires parents to take days off of work and children to miss school. And clinics in states without bans already have limited capacity. “We’re in the state of Michigan, which is within travel distance for multiple states with bans,” Stroumsa says. “We’ve seen a rise in patients coming from out of state, and we’re already booking several months out for consultations.”But for all three families, going back to the way things used to be is not an option.“This might seem like a small issue to others but it affects my whole world,” wrote John Doe, an adolescent transgender boy, in a declaration submitted to the district court. “I’ve gone through a lot to finally get to the happy, healthy place where I am and I desperately hope that doesn’t all get taken away from me.”",
  "image": "https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003eDecember 5, 2024\u003c/p\u003e\u003cp\u003e5 min read\u003c/p\u003e\u003c/div\u003e\u003ch2\u003e\u003cp\u003eSupreme Court to Decide Landmark Transgender Health Care Case. Here\u003cb\u003e’\u003c/b\u003es What\u003cb\u003e’\u003c/b\u003es at Stake\u003c/p\u003e\u003c/h2\u003e\u003cp\u003eIn \u003ci\u003eUnited States v. Skrmetti\u003c/i\u003e\u003cb\u003e\u003ci\u003e,\u003c/i\u003e\u003c/b\u003e the Supreme Court is considering whether a law banning gender\u003cb\u003e-\u003c/b\u003eaffirming care for transgender youth is discriminatory under the Constitution\u003c/p\u003e\u003cfigure\u003e\u003cimg src=\"https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=600\" alt=\"Transgender rights supporters outside Supreme Court\" srcset=\"https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=900 900w, https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/35708218a62c4082/original/Transgender-rights-supporters.jpg?m=1733437285.961\u0026amp;w=1350 1350w\" sizes=\"(min-width: 900px) 900px, (min-resolution: 2dppx) 75vw, (min-resolution: 2.1dppx) 50vw, 100vw\" fetchpriority=\"high\"/\u003e\u003cfigcaption\u003e\u003cp\u003ePeople rally outside of the the U.S. Supreme Court on December 04, 2024 as the justices hear arguments in \u003ci\u003eUnited States v. Skrmetti\u003c/i\u003e, a case on transgender health rights\u003c/p\u003e \u003cp\u003eKevin Dietsch/Getty Images\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis week the U.S. Supreme Court heard oral arguments in \u003ci\u003eUnited States v. Skrmetti, \u003c/i\u003ea case that challenges Tennessee’s ban on \u003ca href=\"https://www.scientificamerican.com/article/what-the-science-on-gender-affirming-care-for-transgender-kids-really-shows/\"\u003egender-affirming care for minors\u003c/a\u003e. The justices are considering whether these bans discriminate on the basis of sex under the Constitution’s Equal Protection Clause.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Court \u003ca href=\"https://apnews.com/article/supreme-court-transgender-health-tennessee-3fd2de125caeac6e323bd81ef7271837\"\u003eappears poised\u003c/a\u003e to uphold the Tennessee law, \u003ca href=\"https://www.capitol.tn.gov/Bills/113/Bill/SB0001.pdf\"\u003eSB1\u003c/a\u003e, which was enacted in July 2023 and prohibits all \u003ca href=\"https://www.scientificamerican.com/article/the-u-k-s-cass-review-badly-fails-trans-children/\"\u003emedical care\u003c/a\u003e intended to allow someone under 18 years old to “identify with, or live as, a purported identity inconsistent with the minor’s sex” assigned at birth, citing the state’s interest in “encouraging minors to appreciate their sex.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“What’s at stake is whether the Court is going to consider \u003ca href=\"https://www.scientificamerican.com/article/families-find-ways-to-protect-their-lgbtq-kids-from-serious-harm-physical/\"\u003etransgender people\u003c/a\u003e to merit some of the protections of the Equal Protection Clause or whether states are allowed to discriminate against transgender people. And that’s a big question,” says Elana Redfield, an LGBTQ+ policy expert at the Williams Institute, part of the University of California, Los Angeles.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Tennessee law, which mirrors similar recent bans in \u003ca href=\"https://www.lgbtmap.org/equality-maps/healthcare_youth_medical_care_bans\"\u003e24 other states\u003c/a\u003e, prevents transgender youth from receiving treatments proven to relieve the symptoms of gender dysphoria (psychological distress that results from an incongruence between someone’s sex assigned at birth and their gender identity). These treatments include \u003ca href=\"https://www.scientificamerican.com/article/what-are-puberty-blockers-and-how-do-they-work/\"\u003epuberty-blocking\u003c/a\u003e drugs and \u003ca href=\"https://www.scientificamerican.com/article/what-the-science-on-gender-affirming-care-for-transgender-kids-really-shows/\"\u003ehormone therapies\u003c/a\u003e—medications also used by nontransgender adolescents and children to treat a variety of conditions. Their use to treat gender dysphoria is supported by the \u003ca href=\"https://www.ama-assn.org/press-center/press-releases/ama-states-stop-interfering-health-care-transgender-children\"\u003eAmerican Medical Association\u003c/a\u003e, the \u003ca href=\"https://publications.aap.org/aapnews/news/25340/AAP-reaffirms-gender-affirming-care-policy\"\u003eAmerican Association of Pediatrics\u003c/a\u003e, the \u003ca href=\"https://www.apa.org/news/press/releases/2024/02/policy-supporting-transgender-nonbinary\"\u003eAmerican Psychological Association\u003c/a\u003e and other important medical institutions.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ca href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0261039\"\u003eA number\u003c/a\u003e of \u003ca href=\"https://jamanetwork.com/journals/jamanetworkopen/article-abstract/2789423\"\u003estudies\u003c/a\u003e have \u003ca href=\"https://link.springer.com/article/10.1186/s13633-020-00078-2\"\u003eshown\u003c/a\u003e that adolescents who receive gender-affirming care have better mental health outcomes—including a lower rate of suicidal ideation—than those who wanted treatment but couldn’t get it. And care bans have increased suicide rates among transgender young people in affected states, \u003ca href=\"https://www.nature.com/articles/s41562-024-01979-5\"\u003erecent research\u003c/a\u003e has shown. Like any medication, the treatments can have risks, which is true when they are prescribed for nontransgender people as well. Parents and physicians \u003ca href=\"https://www.jahonline.org/article/S1054-139X(24)00384-7/fulltext\"\u003eweigh these risks\u003c/a\u003e against those of not receiving the care. Critics of gender-affirming care for minors often cite concerns that adolescents will later regret the treatment, but \u003ca href=\"https://www.jahonline.org/article/S1054-139X(24)00384-7/fulltext\"\u003eregret rates are relatively low\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhile the Tennessee law prohibits these treatments when they are used for the purpose of transitioning, nontransgender youth continue to have access to them. In Supreme Court oral arguments on Wednesday U.S. Solicitor General Elizabeth Prelogar argued that this constitutes sex discrimination—because the law uses birth-assigned sex to determine what medications someone legally has access to. For example, an adolescent would be able to access testosterone if they were assigned male at birth but not if they were assigned female.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“SB1 leaves the same medications and many others entirely unrestricted when used for any other purpose [outside of gender-affirming care], even when those uses present similar risks,” Prelogar said during her opening statement. The federal government is arguing that the law’s sex-based classification should trigger a heightened level of judicial scrutiny under the Equal Protection Clause of the 14th Amendment to the Constitution. If the Supreme Court agrees, it can send the case back to the lower courts. There Tennessee officials would have to demonstrate that the law serves an important government interest. At this stage, the lower courts could weigh the evidence supporting gender-affirming care in evaluating the impacts of a total ban.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBefore the Court’s nine justices, Tennessee Solicitor General Matthew Rice argued that the law does not discriminate on the basis of sex because it prevents both those assigned male and female at birth from transitioning. This reasoning could also be applied to laws that prevent or restrict adults from receiving gender-affirming care, such as Florida’s SB 254. A decision is not expected until next spring, but at least five members of the Supreme Court’s conservative supermajority are widely seen as likely to side with Tennessee.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“If the Court upholds this ban, it will potentially validate all the 24 states that have bans” on gender-affirming care for minors, Redfield says. The decision, she adds, may impact current and future legal challenges to other antitrans legislation—such as bans on adult gender-affirming care or bathroom and sports bans based on gender identity.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe stakes of these challenges will continue to grow as President-elect Donald Trump returns to the White House in January. This election cycle, Republicans spent an estimated $215 million in network TV advertisements attacking and denigrating transgender people, who make up \u003ca href=\"https://williamsinstitute.law.ucla.edu/publications/trans-adults-united-states/\"\u003eless than 1 percent\u003c/a\u003e of the U.S. population.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“On Day One, I will sign an executive order instructing every federal agency to cease the promotion of sex or gender transition at any age,” Trump said at an event hosted by the anti-LGBTQ+ group Moms for Liberty in June 2023. He has also said that he would revoke the federal funding of any hospital or health care provider that provides gender-affirming care to minors.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis possibility is very worrying for Daphna Stroumsa, an ob-gyn at University of Michigan Health, who specializes in gender-affirming care. Being prevented from providing patients with the best care is “heartbreaking. It feels ethically and morally wrong,” Stroumsa says. “The effects of not being able to offer this care on the individual can be devastating.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSusan Lacy, one of the plaintiffs in the case against Tennessee’s ban and an ob-gyn based in Memphis, expressed similar distress in a \u003ca href=\"https://lambdalegal.org/wp-content/uploads/2023/04/File-Stamped_Dr.-Lacy-Declaration.pdf\"\u003edeclaration\u003c/a\u003e in the initial lawsuit. “Being prohibited from treating my patients in accordance with existing evidence and clinical guidelines is an awful scenario that no medical provider should be forced to face,” she wrote.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNearly \u003ca href=\"https://www.kff.org/other/dashboard/gender-affirming-care-policy-tracker/\"\u003e40 percent\u003c/a\u003e of transgender young people between the ages of 13 and 17 now live in states where laws have banned gender-affirming care. Members of the three families that challenged Tennessee’s ban in this case, which originated in a Tennessee district court, have described how devastating a prohibition would be for their life and livelihood. In all three families, the parents described how their children experienced debilitating mental and physical symptoms of gender dysphoria that caused them to withdraw from the world. One child began getting repeated urinary tract infections because she was uncomfortable using the bathroom at school, \u003ca href=\"https://lambdalegal.org/wp-content/uploads/2023/04/File-Stamped_Samantha-Williams-Declaration.pdf\"\u003eher parents said\u003c/a\u003e. Another, referred to as Ryan Roe, \u003ca href=\"https://lambdalegal.org/wp-content/uploads/2023/04/File-Stamped_Ryan-Roe-Declaration.pdf\"\u003ethrew up almost every morning\u003c/a\u003e before school and stopped talking almost entirely.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“I was scared and didn’t want to move too fast with medical treatment,” Roe’s mother wrote in a \u003ca href=\"https://lambdalegal.org/wp-content/uploads/2023/04/File-Stamped_Rebecca-Roe-Declaration.pdf\"\u003edeclaration\u003c/a\u003e. “But I also worried, that in my fear, I had moved too slowly for what my child needed. As I watched my son suffer and decline, I realized we couldn’t wait anymore.” The family consulted a doctor about gender-affirming care, and Roe eventually started taking testosterone. He subsequently “transformed back into the vocal, outgoing child that we saw before puberty,” his mother said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Nobody makes this choice overnight,” Stroumsa says. “These are dedicated parents and dedicated physicians who have a very long process ... before any decisions are made.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAll three families are considering traveling out of state regularly for treatment—an expensive effort that requires parents to take days off of work and children to miss school. And clinics in states without bans already have limited capacity. “We’re in the state of Michigan, which is within travel distance for multiple states with bans,” Stroumsa says. “We’ve seen a rise in patients coming from out of state, and we’re already booking several months out for consultations.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut for all three families, going back to the way things used to be is not an option.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“This might seem like a small issue to others but it affects my whole world,” wrote John Doe, an adolescent transgender boy, in a \u003ca href=\"https://lambdalegal.org/wp-content/uploads/2023/04/File-Stamped_John-Doe-Declaration.pdf\"\u003edeclaration\u003c/a\u003e submitted to the district court. “I’ve gone through a lot to finally get to the happy, healthy place where I am and I desperately hope that doesn’t all get taken away from me.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-12-05T17:00:00-05:00",
  "modifiedTime": null
}
