{
  "id": "5a8e7991-f8b5-402b-860a-bb6359981d7c",
  "title": "Dogs can detect Parkinson’s years before symptoms—with 98% accuracy",
  "link": "https://www.sciencedaily.com/releases/2025/07/250716000846.htm",
  "description": "Dogs trained to detect Parkinson’s disease using scent have shown remarkable accuracy in new research. In a double-blind trial, they identified skin swabs from people with Parkinson’s with up to 80% sensitivity and 98% specificity, even when other health conditions were present. The findings offer hope for a simple, non-invasive diagnostic method using biomarkers that appear long before traditional symptoms, potentially allowing earlier treatment and slowed disease progression.",
  "author": "",
  "published": "Wed, 16 Jul 2025 12:22:41 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3051,
  "excerpt": "Dogs trained to detect Parkinson’s disease using scent have shown remarkable accuracy in new research. In a double-blind trial, they identified skin swabs from people with Parkinson’s with up to 80% sensitivity and 98% specificity, even when other health conditions were present. The findings offer hope for a simple, non-invasive diagnostic method using biomarkers that appear long before traditional symptoms, potentially allowing earlier treatment and slowed disease progression.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "People with Parkinson's disease (PD) have an odour that can be reliably detected from skin swabs by trained dogs, a new study has shown. The research, in collaboration with Medical Detection Dogs and the Universities of Bristol and Manchester, was published on July 15 in The Journal of Parkinson's Disease. Two dogs were trained by the charity, Medical Detection Dogs, to distinguish between sebum swabs from people with and without Parkinson's disease. In a double blind trial, they showed sensitivity of up to 80% and specificity of up to 98%. Not only that, they detected it in samples from patients who also had other health conditions. The dogs were trained over a number of weeks on over 200 odor samples from individuals that had tested positive for PD and control samples from people who did not have the disease. Samples were presented to the dogs on a stand system and the dogs were rewarded for correctly indicating a positive sample and for correctly ignoring a negative sample. In the double-blind testing, meaning that only a computer knew where the correct samples were, each line was also presented in reverse order so that samples for which no decision was made were re-presented. Then any unsearched samples were collected together in new lines, until a decision had been made for all samples. A definitive diagnostic test for Parkinson's Disease (PD) remains elusive, so identification of potential biomarkers could help diagnosis and timely intervention. Claire Guest, Medical Detection Dogs CEO and Chief Scientific Officer, says: \"We are extremely proud to say that once again, dogs can very accurately detect disease. \"There is currently no early test for Parkinson's disease and symptoms may start up to 20 years before they become visible and persistent leading to a confirmed diagnosis. \"Timely diagnosis is key as subsequent treatment could slow down the progression of the disease and reduce the intensity of symptoms.\" Nicola Rooney, Associate Professor at Bristol Veterinary School at the University of Bristol and lead author, says: \"Identifying diagnostic biomarkers of PD, particularly those that may predict development or help diagnose disease earlier is the subject of much ongoing research. The dogs in this study achieved high sensitivity and specificity and showed there is an olfactory signature distinct to patients with the disease. Sensitivity levels of 70% and 80% are well above chance and I believe that dogs could help us to develop a quick non-invasive and cost-effective method to identify patients with Parkinson's disease.\" Perdita Barran, Professor of Mass Spectrometry at The University of Manchester, said: \"It's wonderful to be part of this research inspired by Joy Milne and our Nose2Diagnose programme. This study adds to the growing body of evidence showing that simple, non-invasive skin swabs can be used to diagnose Parkinson's disease, offering a faster and more accessible method for early detection.\" The two dogs in the study were Golden Retriever, Bumper and Black Labrador, Peanut.",
  "image": "https://www.sciencedaily.com/images/1920/golden-retriever-dog-nurse.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003ePeople with Parkinson\u0026#39;s disease (PD) have an odour that can be reliably detected from skin swabs by trained dogs, a new study has shown.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe research, in collaboration with Medical Detection Dogs and the Universities of Bristol and Manchester, was published on July 15 in \u003cem\u003eThe Journal of Parkinson\u0026#39;s Disease\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eTwo dogs were trained by the charity, Medical Detection Dogs, to distinguish between sebum swabs from people with and without Parkinson\u0026#39;s disease.\u003c/p\u003e\n\u003cp\u003eIn a double blind trial, they showed sensitivity of up to 80% and specificity of up to 98%.\u003c/p\u003e\n\u003cp\u003eNot only that, they detected it in samples from patients who also had other health conditions.\u003c/p\u003e\n\u003cp\u003eThe dogs were trained over a number of weeks on over 200 odor samples from individuals that had tested positive for PD and control samples from people who did not have the disease. Samples were presented to the dogs on a stand system and the dogs were rewarded for correctly indicating a positive sample and for correctly ignoring a negative sample.\u003c/p\u003e\n\u003cp\u003eIn the double-blind testing, meaning that only a computer knew where the correct samples were, each line was also presented in reverse order so that samples for which no decision was made were re-presented. Then any unsearched samples were collected together in new lines, until a decision had been made for all samples.\u003c/p\u003e\n\n\n\u003cp\u003eA definitive diagnostic test for Parkinson\u0026#39;s Disease (PD) remains elusive, so identification of potential biomarkers could help diagnosis and timely intervention.\u003c/p\u003e\n\u003cp\u003eClaire Guest, Medical Detection Dogs CEO and Chief Scientific Officer, says: \u0026#34;We are extremely proud to say that once again, dogs can very accurately detect disease.\u003c/p\u003e\n\u003cp\u003e\u0026#34;There is currently no early test for Parkinson\u0026#39;s disease and symptoms may start up to 20 years before they become visible and persistent leading to a confirmed diagnosis.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Timely diagnosis is key as subsequent treatment could slow down the progression of the disease and reduce the intensity of symptoms.\u0026#34;\u003c/p\u003e\n\u003cp\u003eNicola Rooney, Associate Professor at Bristol Veterinary School at the University of Bristol and lead author, says: \u0026#34;Identifying diagnostic biomarkers of PD, particularly those that may predict development or help diagnose disease earlier is the subject of much ongoing research. The dogs in this study achieved high sensitivity and specificity and showed there is an olfactory signature distinct to patients with the disease. Sensitivity levels of 70% and 80% are well above chance and I believe that dogs could help us to develop a quick non-invasive and cost-effective method to identify patients with Parkinson\u0026#39;s disease.\u0026#34;\u003c/p\u003e\n\u003cp\u003ePerdita Barran, Professor of Mass Spectrometry at The University of Manchester, said: \u0026#34;It\u0026#39;s wonderful to be part of this research inspired by Joy Milne and our Nose2Diagnose programme. This study adds to the growing body of evidence showing that simple, non-invasive skin swabs can be used to diagnose Parkinson\u0026#39;s disease, offering a faster and more accessible method for early detection.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe two dogs in the study were Golden Retriever, Bumper and Black Labrador, Peanut.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
