{
  "id": "60ec3d64-5e73-4998-bb8e-7c1bcd6a2429",
  "title": "When Vaginas Attack!",
  "link": "",
  "description": "[VIDEO available on Spotify.] Imagine a vagina. You might be thinking of a passive tube, patiently waiting for a penis to shoot out sperm — and you wouldn't be alone. From Aristotle to Darwin, tons of prominent nerds classified males as the active sexual players: They're coercing, manipulating and harassing to reproduce, while the females are passive, coy, chaste. But animal ecologist Dr. Tiana Pirtle is here to give us the real story. Because once scientists started investigating what really goes on in the vaginas of the animal queendom, they realized that — far from being docile tubes — vaginas are packed with their own weaponry, tools and secret chambers. It turns out that both penises and vaginas were allowed to fight in the evolutionary arms race. Pirtle breaks open a box filled with animal vaginas to tell us all about it.   Find our transcript here: https://bit.ly/ScienceVsWhenVaginasAttack In this episode, we cover: (00:00) A Box Full of Vaginas (02:42) The 'Chaste' Female is Born (06:51) The Duck Vagina that Launched a Thousand Ships (11:06) Hyenas and their Pseudo Penises (13:23) Water Striders and their Genital Shields (16:53) Snakes and their Two Vaginas?!  (20:28) Alpacas and their Regal Vaginas (25:31) The Rainbow of Vaginas This episode was produced by Wendy Zukerman with help from Michelle Dang, Rose Rimler, Meryl Horn, and Ekedi Fauster-Keeys. We’re edited by Blythe Terrell. Fact checking by Michelle Dang. Video Editing Kait Plum. Additional editing help from Alex Button. Mix and sound design by Sam Bair. Thanks to Dr. Patricia Brennan, Dr. Andy Flies, Dr. Chang Han, Prof. Christine Drea, Samuel Cox and Nick Johnson. We first heard about Tiana's show at Beaker Street Festival in Tasmania. Also a big thanks to the Zukerman Family and Joseph Lavelle Wilson. Science Vs is a Spotify Studios Original. Listen for free on Spotify or wherever you get your podcasts. If you are listening on Spotify, follow us and tap the bell for episode notifications. And if you like the show - please give us a five star review – it really helps new people find the show. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
  "author": "Spotify Studios",
  "published": "Thu, 05 Dec 2024 10:00:00 -0000",
  "source": "http://feeds.gimletmedia.com/ScienceVs",
  "categories": null,
  "byline": "",
  "length": 0,
  "excerpt": "",
  "siteName": "",
  "favicon": "",
  "text": "",
  "image": "",
  "html": "",
  "readingTime": "Less than 1 min",
  "publishedTime": null,
  "modifiedTime": null
}
