{
  "id": "61869a06-63dc-4381-8bff-bc3a75ff2845",
  "title": "How Researchers Are Using Geospatial Technology to Uncover Mexico's Clandestine Graves",
  "link": "https://www.wired.com/story/how-researchers-are-using-geospatial-technology-to-uncover-mexicos-clandestine-graves/",
  "description": "Thousands of hidden graves contain the bodies of the disappeared all across Mexico. Using drones, hyperspectral imaging, and other technologies, scientists and members of the public are uncovering them.",
  "author": "Geraldine Castro",
  "published": "Fri, 01 Nov 2024 11:00:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Hidden Truths"
  ],
  "byline": "Geraldine Castro",
  "length": 14588,
  "excerpt": "Thousands of hidden graves contain the bodies of the disappeared all across Mexico. Using drones, hyperspectral imaging, and other technologies, scientists and members of the public are uncovering them.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "There are more than 114,000 missing persons in Mexico, and that number is continuing to rise. Criminal violence in the country is at a record level, largely driven by gangs and drug cartels. Many of those missing are buried in clandestine graves all across the country.To contribute to the solution of this complex problem, a group of scientists from the Center for Research in Geospatial Information Sciences (CentroGeo) put technology and data analysis at the service of the searches.\"I never thought I would have to work on this, but if this knowledge is of any use, now is the time to show it,\" says José Luis Silván, a geographer at CentroGeo. Years ago, as part of his doctoral work, he specialized in measuring forest biomass and human populations through satellite information. At that time, he was far from imagining the scientific work he is doing today: investigating the potential of drones, hyperspectral images, and protocols to detect clandestine graves.Posters of missing persons cover the walls of police stations in Juarez. Photograph: Shaul Schwarz/Getty ImagesIn a recent article published in the International Journal of Forensic Research and Criminology, José Silván and researcher Ana Alegre insist that studying the geographical environment is important to understand in depth a crime like disappearance. Thus, “due to its context and diversity of climates, the case of Mexico may represent an opportunity for the development of investigations.”Finding burials requires hard work. All available information and resources must be optimized. Therefore, scientists have evaluated the use of remote sensing tools and have systematized information from previous findings. They seek to discover patterns in the behavior of the perpetrators and, with this, to find burials.According to Red Lupa, 88 percent of the 114,000 cases of disappearances in Mexico occurred between 2000 and May 2024. 10,315 were registered in 2023, the most on record. This represents an average of 29 people per day. Jalisco, Tamaulipas, State of Mexico, Veracruz and Nuevo Leon are the entities with the highest incidences.Justice is almost nonexistent, with 99 percent impunity for this crime. For this reason, since 2007 alone, civil society has formed more than 300 search groups, mostly made up of family members who scour the land guided by witness statements or organized in general brigades. These groups have detected most of the 5,696 clandestine graves reported on Mexican soil.The association United for Our Disappeared searches in the north of the country, in Baja California. One of its members, who preferred to remain anonymous, has been searching for his son for 18 years. He says they have been using pointed rods to detect graves for more than 10 years. This is one of the most widely used tools in Mexico for this purpose. \"We fit the rod in where we suspect the earth was removed, insert it, pull it out and smell it. If there are bone remains or tissue, you can tell by the smell. It is a strong odor, easy to detect. It smells like organic matter in the process of decomposition.\"Relatives of the disappeared and the National Search Commission in work at the end of 2022. Photograph: Anadolu Agency/Getty ImagesBefore, he says, they used a georadar—a device similar to a pruning shear that detects inconsistencies in the ground—but they abandoned this practice because it was not very useful. The radar responds to almost any kind of object, from chips to boats. The last time they used it, it returned 40 suspicious spots, but none were positive. In Mexicali, another group uses a drone to fly over areas and detect changes in the terrain. Others have used machines to dig holes instead of shovels. Some innovations are abandoned over time, but the use of rods remains.In 2014, after the disappearance of 43 Ayotzinapa normalistas in Mexico, Silván and other CentroGeo professionals joined the scientific advisory board on the case. During the search for the students, different civilian groups and government brigades detected dozens of illegal graves. In less than 10 months, the Mexican Attorney General's Office counted 60 sites and 129 bodies in the state of Guerrero. As a result of the raids, 300 illegal graves were revealed. Since then, the number of clandestine graves has only grown.No one anticipated the size of this horror. The report, “Searching between pain and hope: Findings of clandestine graves in Mexico 2020–2022,” exposes with hemerographic data that in those two years, 1,134 clandestine graves were registered, with 2,314 bodies and 2,242 remains. In proportional terms, Colima reported the highest rate of illegal graves, with 10 per 100,000 inhabitants. It was followed by Sonora, Guanajuato, Guerrero, Sinaloa and Zacatecas.By number of cases, Guanajuato, Sonora, and Guerrero stand out. These three entities account for 42 percent of the records. By April 2023, a journalistic investigation by Quinto Elemento Lab reported that the number of illegal burials reached 5,696 clandestine graves, and that more than half of them were detected during the current federal administration.Employing his field of study, remote sensing, José Luis Silván uses images captured with satellites, drones or airplanes, from which he extracts geospatial information using knowledge of the physics of light, mathematics and programming. Multispectral and hyperspectral images capture subsurface information using sensors that record wavelengths of light imperceptible to the human eye, making them useful for searching.In 2016, during a first study by CentroGeo researchers, they simulated burials with pig carcasses to evaluate the potential of using hyperspectral cameras in searches and learn what information from the sensors was useful to them. The Mexican researchers knew from research in other countries that successful detection with these techniques depends, in part, on being able to recognize how carcasses (and their spectral images) change in different soils and climates.The experiment was carried out on rented land in the state of Morelos. There they buried seven animals and evaluated the light reflected by the soil at different wavelengths for six months. They concluded that a hyperspectral camera, which provides more than a hundred layers of data, has the potential to detect clandestine burials, although the technique is only effective three months after burial. They tried to arrange for the acquisition of a camera and drone (valued at 5 million pesos) through the National Search Commission, but were unsuccessful.Faced with this, they began to evaluate more affordable alternatives, such as multispectral devices. Today, despite the fact that spaces such as the Commission for the Search for Disappeared Persons of the State of Jalisco (COBUPEJ)—with which they have a partnership—has acquired this equipment, no national strategy exists to deploy these technologies systematically.Some time later, the scientists took on a bigger challenge. When they briefed the National Search Commission on the usefulness of remote sensing for locating burials, officials told them that in some regions of the Northwest, the greatest need was to locate substances used to conceal crimes. \"They dispose of them in caustic soda or with chemicals, char them and incinerate them in the open air or in crematoria; they throw the remains away or bury them,\" the researcher says.So, in 2021, Silván's group did another experiment, this time in Hidalgo and with a spectroradiometer, which measures how different substances reflect light. For that study, they tested the trace of substances used in crimes. They found that diesel, muriatic acid, and blood treated with anticoagulants require more precise imaging to be located, but that most substances, such as caustic soda, lime, blood, and those resulting from open burning, could be detected with multispectral sensors, which are less expensive.CentroGeo has also participated in the development of complementary strategies to identify areas with a high probability of harboring clandestine graves. One example is the training of mathematical models with the coordinates of previous findings and the characteristics of the sites preferred by criminals, which they call clandestine spaces and which are defined as those which are easy to access for perpetrators and of low visibility to the population.In addition, they have been using the signs that decomposing bodies leave on the vegetation for years. As a corpse decomposes, it releases nutrients into the soil, in particular increasing the concentration of nitrogen. In plants, this element is linked to chlorophyll, which gives them their greenness. In experiments with buried pigs, they have observed that a chlorophyll indicator can be quantified through satellite images. They measure how fast this index grows to detect sites with anomalies. This tool is available on the \"Clandestine Space\" platform.This APP demonstrates the concept of Clandestine Space to delimit areas to search for human remains. Graphic: Courtesy of Centro de Investigación en Ciencias de Información GeoespacialSilván says that to interpret the nitrogen signal, they must consider that the gas signal can also vary due to the use of fertilizers or rains that carry nutrients. The presence of nitrogen, then, is not definitive proof of the existence of trenches, but it provides indications that justify paying attention in certain regions. The National Search Commission has been trained to use this indicator.In Baja California, a northern state with 17,306 missing persons cases, these strategies have already been used. They first analyzed 52 locations of known graves and deduced that, because of the way they were distributed, there was a high probability of finding more graves at a distance of between 18 and 28 kilometers from those already known. They also looked for possible \"clandestine spaces\" and identified that 32 percent of the territory of Baja California had the potential to be used for that purpose. Finally, they reviewed the concentration of chlorophyll in satellite images. The result was a useful accompaniment for some family brigades.Recently, Ana Alegre and José Silván analyzed geospatial models that could explain the distribution of graves in 10 states. They found that the travel time it would take an offender to get from urban streets to the grave is the factor that most influences the location of graves. \"The secrecy sought by perpetrators seemed less important than reducing the effort they invest in creating the grave,\" their article says.In 2019, alleged clandestine graves were searched in Veracruz. Photograph: VICTORIA RAZO/Getty ImagesIn addition to collaborating with the government, CentroGeo researchers work with civil associations such as Regresando a Casa Morelos and Fuerzas Unidas por Nuestros Desaparecidos en Nuevo León (FUNDENL). Some time ago, the former asked them to survey a site. \"We collected thermal images and three-dimensional models to provide information,\" says Silván. In addition, they gave a workshop for visual interpretation. Silván describes the members of Regresando a Casa Morelos as dedicated people. \"They want to find their loved ones, they are willing to learn anything, to analyze an image or fly a drone. To everything.\"With information from the FUNDENL collective and support from the American Jewish World Service, CentroGeo created “Huellas de vida,” a platform that crosses the information of unfound persons and unidentified bodies with data from objects found in clandestine burial sites in Nuevo León. The intention is to detect coincidences that will help solve cases.The geographer points out that the investigation is advancing, while the forms and numbers of disappearances are multiplying. Other countries, he says, are installing ground penetration radars on drones, or are planning to use electronic noses as indicators of methane, an element that corpses release at a certain stage of decomposition. To search for missing persons from the Spanish Civil War, for example, patterns in geographic data were tracked to narrow down search sites.Abandoned clothing near illegal graves on the outskirts of Iguala. Photograph: Miguel Tovar/Getty ImagesThe big pending issue is to evaluate the real contribution that geographic information has had in uncovering crime scenes. “It is complicated to have feedback, even with the National Commission, because they are not obliged to tell us where they have findings.” It will be until they have the new reports when they will be able to collate the results and measure the impact of their contributions. For now, “it is complicated to attribute the findings to our tools and information.”For his part, the member of FUNDENL assures that the search groups are the ones who have found most of the clandestine graves currently located. The usual thing, he says, is that the governments do not have departments for this work and only search when they have declarations that oblige them to do so. With the collectives it is different, because “we receive anonymous information, and even if we have no information, we still schedule searches and go out.”Finding graves is the beginning of another loss. When they have reason to excavate, they use picks and shovels and, if they find human remains, the authorities (who usually accompany them) cordon off the area and proceed with their work. If they are not present, they call them. “From there, many times we don't know what's going on, we don't get feedback from the authorities. We say that the person we found is lost again.” The problem is general; “the collectives complain that people get lost in the bureaucratic process.” In few cases, they say, the Prosecutor's Office restores the identity of the disappeared.While technology is integrated into the systematic searches, collectives such as FUNDENL ask society to share the information they have on missing persons. “We only want to find them, all the information that reaches the collectives is anonymous,” says the interviewee whose identity we reserve. The authorities have accepted this, he assures.For his part, José Silván comments that, as a result of the collaboration with COBUPEJ and other institutions, they are about to publish a book to disseminate techniques for the detection of graves that they tested during their work. The book is entitled Interpreting Nature to Find Them and is coordinated by Tunuari Chavez, head of the COBUPEJ context unit, and José Silván, under the direction of commissioner Victor Avila.",
  "image": "https://media.wired.com/photos/671ff78848cef3aaedab6818/191:100/w_1280,c_limit/Science_Ehecati_GettyImages-2166963686.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cspan\u003eThere are more\u003c/span\u003e than 114,000 missing persons in Mexico, and that number is continuing to rise. \u003ca data-offer-url=\"https://cla.umn.edu/human-rights/engagement/press-reporting-disappearances-mexico/disappearances-mexico\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://cla.umn.edu/human-rights/engagement/press-reporting-disappearances-mexico/disappearances-mexico\u0026#34;}\" href=\"https://cla.umn.edu/human-rights/engagement/press-reporting-disappearances-mexico/disappearances-mexico\" rel=\"nofollow noopener\" target=\"_blank\"\u003eCriminal violence\u003c/a\u003e in the country is at a \u003ca href=\"https://www.cfr.org/global-conflict-tracker/conflict/criminal-violence-mexico\"\u003erecord level\u003c/a\u003e, largely driven by gangs and drug cartels. Many of those missing are buried in clandestine graves all across the country.\u003c/p\u003e\u003cp\u003eTo contribute to the solution of this complex problem, a group of scientists from the Center for Research in Geospatial Information Sciences (CentroGeo) put technology and data analysis at the service of the searches.\u003c/p\u003e\u003cp\u003e\u0026#34;I never thought I would have to work on this, but if this knowledge is of any use, now is the time to show it,\u0026#34; says José Luis Silván, a geographer at CentroGeo. Years ago, as part of his doctoral work, he specialized in measuring forest biomass and human populations through satellite information. At that time, he was far from imagining the scientific work he is doing today: investigating the potential of drones, hyperspectral images, and protocols to detect \u003ca href=\"https://es.wired.com/articulos/arquitectura-forense-la-ciencia-emergente-capaz-de-esclarecer-el-incendio-en-ciudad-juarez\"\u003eclandestine graves\u003c/a\u003e.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003ePosters of missing persons cover the walls of police stations in Juarez.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Shaul Schwarz/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn \u003ca data-offer-url=\"https://www.medcrave.com/articles/det/28319/Using-geospatial-information-sciences-for-the-search-of-clandestine-graves\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.medcrave.com/articles/det/28319/Using-geospatial-information-sciences-for-the-search-of-clandestine-graves\u0026#34;}\" href=\"https://www.medcrave.com/articles/det/28319/Using-geospatial-information-sciences-for-the-search-of-clandestine-graves\" rel=\"nofollow noopener\" target=\"_blank\"\u003ea recent article\u003c/a\u003e published in the International Journal of Forensic Research and Criminology, José Silván and researcher Ana Alegre insist that studying the geographical environment is important to understand in depth \u003ca href=\"https://es.wired.com/articulos/chile-usara-inteligencia-artificial-para-encontrar-a-los-desaparecidos-de-la-dictadura\"\u003ea crime like disappearance\u003c/a\u003e. Thus, “due to its context and diversity of climates, the case of Mexico may represent an opportunity for the development of investigations.”\u003c/p\u003e\u003cp\u003eFinding burials requires hard work. All available information and resources must be optimized. Therefore, scientists have evaluated the use of remote sensing tools and have systematized information from previous findings. They seek to discover patterns in the behavior of the perpetrators and, with this, to find burials.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eAccording to \u003c/span\u003e\u003ca data-offer-url=\"https://imdhd.org/redlupa/informes-y-analisis/informes-nacionales/informe-nacional-2024/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://imdhd.org/redlupa/informes-y-analisis/informes-nacionales/informe-nacional-2024/\u0026#34;}\" href=\"https://imdhd.org/redlupa/informes-y-analisis/informes-nacionales/informe-nacional-2024/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eRed Lupa\u003c/a\u003e, 88 percent of the 114,000 cases of disappearances in Mexico occurred between 2000 and May 2024. 10,315 were registered in 2023, the most on record. This represents an average of 29 people per day. Jalisco, Tamaulipas, State of Mexico, Veracruz and Nuevo Leon are the entities with the highest incidences.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eJustice is almost nonexistent, \u003ca data-offer-url=\"https://www.impunidadcero.org/articulo.php?id=196\u0026amp;t=impunidad-en-delitos-de-desaparicion-en-mexico-2023#:~:text=En%20M%C3%A9xico%20tenemos%20un%20nivel,humanitaria%20que%20va%20en%20aumento.\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.impunidadcero.org/articulo.php?id=196\u0026amp;t=impunidad-en-delitos-de-desaparicion-en-mexico-2023#:~:text=En%20M%C3%A9xico%20tenemos%20un%20nivel,humanitaria%20que%20va%20en%20aumento.\u0026#34;}\" href=\"https://www.impunidadcero.org/articulo.php?id=196\u0026amp;t=impunidad-en-delitos-de-desaparicion-en-mexico-2023#:~:text=En%20M%C3%A9xico%20tenemos%20un%20nivel,humanitaria%20que%20va%20en%20aumento.\" rel=\"nofollow noopener\" target=\"_blank\"\u003ewith 99 percent impunity for this crime\u003c/a\u003e. For this reason, since 2007 alone, civil society has formed more than 300 search groups, mostly made up of family members who scour the land guided by witness statements or organized in general brigades. These groups have detected most of the 5,696 clandestine graves reported on Mexican soil.\u003c/p\u003e\u003cp\u003eThe association United for Our Disappeared searches in the north of the country, in Baja California. One of its members, who preferred to remain anonymous, has been searching for his son for 18 years. He says they have been using pointed rods to detect graves for more than 10 years. This is one of the most widely used tools in Mexico for this purpose. \u0026#34;We fit the rod in where we suspect the earth was removed, insert it, pull it out and smell it. If there are bone remains or tissue, you can tell by the smell. It is a strong odor, easy to detect. It smells like organic matter in the process of decomposition.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eRelatives of the disappeared and the National Search Commission in work at the end of 2022.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Anadolu Agency/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eBefore, he says, they used a georadar—a device similar to a pruning shear that detects inconsistencies in the ground—but they abandoned this practice because it was not very useful. The radar responds to almost any kind of object, from chips to boats. The last time they used it, it returned 40 suspicious spots, but none were positive. In Mexicali, another group uses a drone to fly over areas and detect changes in the terrain. Others have used machines to dig holes instead of shovels. Some innovations are abandoned over time, but the use of rods remains.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn 2014, after\u003c/span\u003e the disappearance of 43 Ayotzinapa normalistas in Mexico, Silván and other CentroGeo professionals joined the scientific advisory board on the case. During the search for the students, different civilian groups and government brigades detected dozens of illegal graves. In less than 10 months, the Mexican Attorney General\u0026#39;s Office counted 60 sites and 129 bodies in the state of Guerrero. As a result of the raids, 300 illegal graves were revealed. Since then, the number of clandestine graves has only grown.\u003c/p\u003e\u003cp\u003eNo one anticipated the size of this horror. \u003ca data-offer-url=\"https://ibero.mx/sites/all/themes/ibero/images/ibero/derechos-humanos/informe-fosas.pdf\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://ibero.mx/sites/all/themes/ibero/images/ibero/derechos-humanos/informe-fosas.pdf\u0026#34;}\" href=\"https://ibero.mx/sites/all/themes/ibero/images/ibero/derechos-humanos/informe-fosas.pdf\" rel=\"nofollow noopener\" target=\"_blank\"\u003eThe report\u003c/a\u003e, “Searching between pain and hope: Findings of clandestine graves in Mexico 2020–2022,” exposes with hemerographic data that in those two years, 1,134 clandestine graves were registered, with 2,314 bodies and 2,242 remains. In proportional terms, Colima reported the highest rate of illegal graves, with 10 per 100,000 inhabitants. It was followed by Sonora, Guanajuato, Guerrero, Sinaloa and Zacatecas.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eBy number of cases, Guanajuato, Sonora, and Guerrero stand out. These three entities account for 42 percent of the records. By April 2023, a journalistic investigation by Quinto Elemento Lab reported that the number of illegal burials reached 5,696 clandestine graves, and that more than half of them were detected during the current federal administration.\u003c/p\u003e\u003cp\u003eEmploying his field of study, \u003ca data-offer-url=\"https://www.centrogeo.org.mx/areas-profile/jsilvan/#perfil\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.centrogeo.org.mx/areas-profile/jsilvan/#perfil\u0026#34;}\" href=\"https://www.centrogeo.org.mx/areas-profile/jsilvan/#perfil\" rel=\"nofollow noopener\" target=\"_blank\"\u003eremote sensing\u003c/a\u003e, José Luis Silván uses images captured with satellites, drones or airplanes, from which he extracts geospatial information using knowledge of the physics of light, mathematics and programming. Multispectral and hyperspectral images capture subsurface information using sensors that record wavelengths of light imperceptible to the human eye, making them useful for searching.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn 2016, during a first study by CentroGeo researchers, they simulated burials with pig carcasses to evaluate the potential of using hyperspectral cameras in searches and learn what information from the sensors was useful to them. The Mexican researchers knew from research in other countries that successful detection with these techniques depends, in part, on being able to recognize how carcasses (and their spectral images) change in different soils and climates.\u003c/p\u003e\u003cp\u003eThe experiment was carried out on rented land in the state of Morelos. There they buried seven animals and evaluated the light reflected by the soil at different wavelengths for six months. They concluded that a hyperspectral camera, which provides more than a hundred layers of data, has the potential to detect clandestine burials, although the technique is only effective three months after burial. They tried to arrange for the acquisition of a camera and drone (valued at 5 million pesos) through the National Search Commission, but were unsuccessful.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFaced with this, they began to evaluate more affordable alternatives, such as multispectral devices. Today, despite the fact that spaces such as the Commission for the Search for Disappeared Persons of the State of Jalisco (COBUPEJ)—with which they have a partnership—has acquired this equipment, no national strategy exists to deploy these technologies systematically.\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSome time later,\u003c/span\u003e the scientists took on a bigger challenge. When they briefed the National Search Commission on the usefulness of remote sensing for locating burials, officials told them that in some regions of the Northwest, the greatest need was to locate substances used to conceal crimes. \u0026#34;They dispose of them in caustic soda or with chemicals, char them and incinerate them in the open air or in crematoria; they throw the remains away or bury them,\u0026#34; the researcher says.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSo, in 2021, Silván\u0026#39;s group did another experiment, this time in Hidalgo and with a spectroradiometer, which measures how different substances reflect light. For that study, they tested the trace of substances used in crimes. They found that diesel, muriatic acid, and blood treated with anticoagulants require more precise imaging to be located, but that most substances, such as caustic soda, lime, blood, and those resulting from open burning, could be detected with multispectral sensors, which are less expensive.\u003c/p\u003e\u003cp\u003eCentroGeo has also participated in the development of complementary strategies to identify areas with a high probability of harboring clandestine graves. One example is the training of mathematical models with the coordinates of previous findings and the characteristics of the sites preferred by criminals, which they call clandestine spaces and which are defined as those which are easy to access for perpetrators and of low visibility to the population.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn addition, they have been using the signs that decomposing bodies leave on the vegetation for years. As a corpse decomposes, it releases nutrients into the soil, in particular increasing the concentration of nitrogen. In plants, this element is linked to chlorophyll, which gives them their greenness. In experiments with buried pigs, they have observed that a chlorophyll indicator can be quantified through satellite images. They measure how fast this index grows to detect sites with anomalies. This tool is available on the \u0026#34;Clandestine Space\u0026#34; platform.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThis APP demonstrates the concept of Clandestine Space to delimit areas to search for human remains.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003eGraphic: Courtesy of Centro de Investigación en Ciencias de Información Geoespacial\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSilván says that to interpret the nitrogen signal, they must consider that the gas signal can also vary due to the use of fertilizers or rains that carry nutrients. The presence of nitrogen, then, is not definitive proof of the existence of trenches, but it provides indications that justify paying attention in certain regions. The National Search Commission has been trained to use this indicator.\u003c/p\u003e\u003cp\u003eIn Baja California, a northern state with 17,306 missing persons cases, these strategies have already been used. They first analyzed 52 locations of known graves and deduced that, because of the way they were distributed, there was a high probability of finding more graves at a distance of between 18 and 28 kilometers from those already known. They also looked for possible \u0026#34;clandestine spaces\u0026#34; and identified that 32 percent of the territory of Baja California had the potential to be used for that purpose. Finally, they reviewed the concentration of chlorophyll in satellite images. The result was a useful accompaniment for some family brigades.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eRecently, Ana Alegre and José Silván analyzed geospatial models that could explain the distribution of graves in 10 states. They found that the travel time it would take an offender to get from urban streets to the grave is the factor that most influences the location of graves. \u0026#34;The secrecy sought by perpetrators seemed less important than reducing the effort they invest in creating the grave,\u0026#34; their article says.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eIn 2019, alleged clandestine graves were searched in Veracruz.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: VICTORIA RAZO/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cspan\u003eIn addition to\u003c/span\u003e collaborating with the government, CentroGeo researchers work with civil associations such as Regresando a Casa Morelos and Fuerzas Unidas por Nuestros Desaparecidos en Nuevo León (FUNDENL). Some time ago, the former asked them to survey a site. \u0026#34;We collected thermal images and three-dimensional models to provide information,\u0026#34; says Silván. In addition, they gave a workshop for visual interpretation. Silván describes the members of Regresando a Casa Morelos as dedicated people. \u0026#34;They want to find their loved ones, they are willing to learn anything, to analyze an image or fly a drone. To everything.\u0026#34;\u003c/p\u003e\u003cp\u003eWith information from the FUNDENL collective and support from the American Jewish World Service, CentroGeo created “\u003ca data-offer-url=\"https://piedepagina.mx/huellas-de-vida-buscar-las-personas-desaparecidas-mediante-los-objetos-localizados-en-campo/#:~:text=%E2%80%9CHuellas%20de%20Vida%3A%20B%C3%BAsqueda%20de,desarrollar%20desde%20octubre%20del%202020%E2%80%9D.\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://piedepagina.mx/huellas-de-vida-buscar-las-personas-desaparecidas-mediante-los-objetos-localizados-en-campo/#:~:text=%E2%80%9CHuellas%20de%20Vida%3A%20B%C3%BAsqueda%20de,desarrollar%20desde%20octubre%20del%202020%E2%80%9D.\u0026#34;}\" href=\"https://piedepagina.mx/huellas-de-vida-buscar-las-personas-desaparecidas-mediante-los-objetos-localizados-en-campo/#:~:text=%E2%80%9CHuellas%20de%20Vida%3A%20B%C3%BAsqueda%20de,desarrollar%20desde%20octubre%20del%202020%E2%80%9D.\" rel=\"nofollow noopener\" target=\"_blank\"\u003eHuellas de vida\u003c/a\u003e,” a platform that crosses the information of unfound persons and unidentified bodies with data from objects found in clandestine burial sites in Nuevo León. The intention is to detect coincidences that will help solve cases.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe geographer points out that the investigation is advancing, while the forms and numbers of disappearances are multiplying. Other countries, he says, are installing ground penetration radars on drones, or are planning to use electronic noses as indicators of methane, an element that corpses release at a certain stage of decomposition. To search for missing persons from the Spanish Civil War, for example, patterns in geographic data were tracked to narrow down search sites.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAbandoned clothing near illegal graves on the outskirts of Iguala.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Miguel Tovar/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe big pending issue is to evaluate the real contribution that geographic information has had in uncovering crime scenes. “It is complicated to have feedback, even with the National Commission, because they are not obliged to tell us where they have findings.” It will be until they have the new reports when they will be able to collate the results and measure the impact of their contributions. For now, “it is complicated to attribute the findings to our tools and information.”\u003c/p\u003e\u003cp\u003eFor his part, the member of FUNDENL assures that the search groups are the ones who have found most of the clandestine graves currently located. The usual thing, he says, is that the governments do not have departments for this work and only search when they have declarations that oblige them to do so. With the collectives it is different, because “we receive anonymous information, and even if we have no information, we still schedule searches and go out.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFinding graves is the beginning of another loss. When they have reason to excavate, they use picks and shovels and, if they find human remains, the authorities (who usually accompany them) cordon off the area and proceed with their work. If they are not present, they call them. “From there, many times we don\u0026#39;t know what\u0026#39;s going on, we don\u0026#39;t get feedback from the authorities. We say that the person we found is lost again.” The problem is general; “the collectives complain that people get lost in the bureaucratic process.” In few cases, they say, the Prosecutor\u0026#39;s Office restores the identity of the disappeared.\u003c/p\u003e\u003cp\u003eWhile technology is integrated into the systematic searches, collectives such as FUNDENL ask society to share the information they have on missing persons. “We only want to find them, all the information that reaches the collectives is anonymous,” says the interviewee whose identity we reserve. The authorities have accepted this, he assures.\u003c/p\u003e\u003cp\u003eFor his part, José Silván comments that, as a result of the collaboration with COBUPEJ and other institutions, they are about to publish a book to disseminate techniques for the detection of graves that they tested during their work. The book is entitled \u003cem\u003eInterpreting Nature to Find Them\u003c/em\u003e and is coordinated by Tunuari Chavez, head of the COBUPEJ context unit, and José Silván, under the direction of commissioner Victor Avila.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "16 min read",
  "publishedTime": "2024-11-01T07:00:00-04:00",
  "modifiedTime": "2024-11-01T11:00:00Z"
}
