{
  "id": "6243adb3-1a24-4b35-af91-2c6ec447b8f2",
  "title": "Study uncovers potential new target for treatment of chronic, debilitating skin disease",
  "link": "https://www.sciencedaily.com/releases/2024/11/241121141404.htm",
  "description": "Hidradenitis suppurativa (HS) is an immune disease that affects up to 4% of the global population and causes painful, recurring skin lesions and inflammation, primarily in the folds of the skin. It commonly affects women of African American descent.",
  "author": "",
  "published": "Thu, 21 Nov 2024 14:14:04 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2110,
  "excerpt": "Hidradenitis suppurativa (HS) is an immune disease that affects up to 4% of the global population and causes painful, recurring skin lesions and inflammation, primarily in the folds of the skin. It commonly affects women of African American descent.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A team of researchers at Clemson University used an innovative multiomics approach to identify key immune mechanisms in a chronic and debilitating inflammatory skin condition. The research, which was published in the journal Proceedings of the National Academy of Sciences (PNAS), offers a promising target for future therapies. Hidradenitis suppurativa (HS) is an immune disease that affects up to 4% of the global population and causes painful, recurring skin lesions and inflammation, primarily in the folds of the skin. It commonly affects women of African American descent. Shahid Mukhtar and his team -- Bharat Mishra, Nilesh Kumar and graduate student YiFei Gou -- used single-cell sequencing techniques to pinpoint CD2 as a key immune receptor with elevated expression on T cells and innate lymphoid cells (ILCs), including natural killer cells, in HS-affected skin tissue. In collaboration with researchers at the University of Alabama at Birmingham, Mukhtar's team demonstrated through organotypic skin culture experiments from HS patients that blocking CD2 led to a significant reduction in cytokine and chemokine production, along with suppression of key pathogenic gene signatures. This finding suggests that blocking CD2 may effectively reduce the inflammatory response in HS, providing a potential new therapeutic avenue for managing symptoms and improving patient quality of life. Gou, who has a keen interest in deep learning, a type of artificial intelligence (AI), hopes to further integrate single-cell transcriptomics with global protein-protein interactions using contextual AI. This approach aims to enhance understanding of cellular networks and disease mechanisms, pushing forward the frontiers of precision medicine for immune-related diseases like HS. \"Our integrative approach, combining single-cell data with molecular insights, shows the transformative potential of multiomics in discovering novel therapeutic targets,\" Mukhtar said. \"These findings deepen our understanding of HS and open new pathways for developing targeted therapies in HS and other immune-related conditions.\"",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA team of researchers at Clemson University used an innovative multiomics approach to identify key immune mechanisms in a chronic and debilitating inflammatory skin condition.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe research, which was published in the journal \u003cem\u003eProceedings of the National Academy of Sciences (PNAS)\u003c/em\u003e, offers a promising target for future therapies.\u003c/p\u003e\n\u003cp\u003eHidradenitis suppurativa (HS) is an immune disease that affects up to 4% of the global population and causes painful, recurring skin lesions and inflammation, primarily in the folds of the skin. It commonly affects women of African American descent.\u003c/p\u003e\n\u003cp\u003eShahid Mukhtar and his team -- Bharat Mishra, Nilesh Kumar and graduate student YiFei Gou -- used single-cell sequencing techniques to pinpoint CD2 as a key immune receptor with elevated expression on T cells and innate lymphoid cells (ILCs), including natural killer cells, in HS-affected skin tissue.\u003c/p\u003e\n\u003cp\u003eIn collaboration with researchers at the University of Alabama at Birmingham, Mukhtar\u0026#39;s team demonstrated through organotypic skin culture experiments from HS patients that blocking CD2 led to a significant reduction in cytokine and chemokine production, along with suppression of key pathogenic gene signatures.\u003c/p\u003e\n\u003cp\u003eThis finding suggests that blocking CD2 may effectively reduce the inflammatory response in HS, providing a potential new therapeutic avenue for managing symptoms and improving patient quality of life.\u003c/p\u003e\n\u003cp\u003eGou, who has a keen interest in deep learning, a type of artificial intelligence (AI), hopes to further integrate single-cell transcriptomics with global protein-protein interactions using contextual AI. This approach aims to enhance understanding of cellular networks and disease mechanisms, pushing forward the frontiers of precision medicine for immune-related diseases like HS.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our integrative approach, combining single-cell data with molecular insights, shows the transformative potential of multiomics in discovering novel therapeutic targets,\u0026#34; Mukhtar said. \u0026#34;These findings deepen our understanding of HS and open new pathways for developing targeted therapies in HS and other immune-related conditions.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
