{
  "id": "655f4c21-66ed-44c1-bf0e-f271d0282c22",
  "title": "UK investigating claims green fuel contains virgin palm oil",
  "link": "https://www.bbc.com/news/articles/cm24n8nej94o",
  "description": "The BBC finds evidence of fraud in the production of a \"green\" diesel meant to cut emissions.",
  "author": "",
  "published": "Tue, 08 Apr 2025 23:03:15 GMT",
  "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
  "categories": null,
  "byline": "Matt McGrath and Mark Poynting",
  "length": 6210,
  "excerpt": "The BBC finds evidence of fraud in the production of a \"green\" diesel meant to cut emissions.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "Matt McGrath and Mark PoyntingBBC Climate \u0026 ScienceThe UK government is investigating a fast-growing \"green fuel\" called HVO diesel amid claims of significant fraud, the BBC has learned.HVO is increasingly popular as a transport fuel and for powering music festivals and its backers say it can curb carbon emissions by up to 90% as it can be made from waste materials like used cooking oil.But industry whistleblowers told the BBC they believe large amounts of these materials are not waste but instead are virgin palm oil, which is being fraudulently relabelled.And data analysed by the BBC and shared with the UK's Department for Transport casts further doubt on one of the key ingredients in HVO, a material called palm sludge waste.Europe used more of this waste in HVO and other biofuels in 2023 than it is thought possible for the world to produce.In response to the BBC's findings, the Department for Transport said they \"take the concerns raised seriously and are working with stakeholders and international partners to gather further information\".HVO, or hydrotreated vegetable oil, has been called something of a wonder-fuel in recent years as it can be used as 100% substitute for diesel reducing planet warming emissions.UK consumption rocketed from 8 million litres in 2019 to about 699 million litres in 2024, according to provisional government figures.Its green credentials rely heavily on the assumption that it is made from waste sources, particularly used cooking oil or the waste sludge from palm oil production.But industry whistle-blowers have told the BBC that they believe virgin palm oil and other non-waste materials are often being used instead.That would be bad news for the planet, as virgin palm oil is linked to increased tropical deforestation, which adds to climate change and threatening endangered species like orang-utans.This palm oil \"floods the market like cancer,\" one large European biofuel manufacturer told the BBC.They said that to stay in business they have to go along with the pretence that they are using waste materials.Another whistle-blower, a former trader of these biofuels, also speaking anonymously, gave the BBC his account of one recent case dealing with supposedly waste products.\"I believe that what I bought was multiple cargos of virgin palm oil that has been wrongly classified as palm oil sludge,\" they said.\"I called one of the board members and told them about the situation, and then I was told that they didn't want to do anything about it, because the evidence would be burned.\"As well as this testimony, data compiled by campaign group Transport \u0026 Environment and analysed by the BBC suggests that more palm sludge waste is being used for transport biofuels than the world is probably able to produce. The figures show that the UK and EU used about two million tonnes of palm sludge waste for HVO and other biofuels in 2023, based on Eurostat and UK Department for Transport figures.EU imports of this sludge appear to have risen further in 2024, according to preliminary UN trade data, although the UK appears to have bucked this trend.But the data analysed by the BBC, which is based on well-established UN and industry statistics, suggests the world can only produce just over one million tonnes of palm sludge waste a year.This mismatch further suggests non-waste fuels such as virgin palm oil are being used to meet Europe's rapid growth in biofuels, according to researchers and industry figures.\"It's a very easy game,\" said Dr Christian Bickert, a German farmer and editor with experience in biofuels, who believes that much of the HVO made with these waste products is \"fake\".\"Chemically, the sludge and the pure palm oil are absolutely the same because they come from the same plant, and also from the same production facilities in Indonesia,\" he told BBC News.\"There's no paper which proves [the fraud], no paper at all, but the figures tell a clear story.\"Underpinning the sustainability claims of biofuels is an independent system of certification where producers have to show exactly where they get their raw materials from.It is mainly administered by a company called ISCC, and in Europe it has a long-standing reputation for ensuring that waste materials turned into fuel really do come from waste, by working with national authorities.But in Indonesia, Malaysia and China, three of the main sources of the raw ingredients claimed to be waste for HVO, supervision is much more difficult.\"ISCC is simply not allowed to send anybody to China,\" said Dr Christian Bickert.\"They have to rely on certification companies in China to check that everything is OK, but China doesn't allow any inspectors in from outside.\"This concern is echoed by several other groups contacted by the BBC.Construction giant Balfour Beatty, for example, has a policy of not using the fuel, citing sustainability concerns.\"We just are not able to get any level of visibility over the supply chain of HVO that would give us that level of assurance that this is truly a sustainable product,\" Balfour Beatty's Jo Gilroy told BBC News.The European Waste-based and Advanced Biofuels Association represents the major biofuel manufacturers in the EU and UK.In a statement they said \"there is a major certification verification issue that needs to be addressed as a matter of priority\", adding that the \"ISCC should do much more to ensure that non-EU Biodiesel is really what it claims to be\".In the light of growing fraud allegations, the Irish authorities have recently restricted incentives for fuels made from palm waste.The BBC also understands that the EU is about to propose a ban on ISCC certification of waste biofuels for two-and-a-half years, although it is expected to say it is not aware of direct breaches of renewable goals.It would then be up to individual member countries to decide whether to accept certifications.In response, the ISCC said it was \"more than surprised\" by the EU's move, adding that it had been \"a frontrunner in implementing the most strict and effective measures to ensure integrity and fraud prevention in the market for years\".\"The measure would be a severe blow to the entire market for waste-based biofuels,\" it said.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c35d/live/dc7b9e60-147a-11f0-aff1-f1386d086010.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"byline-new\" data-component=\"byline-block\"\u003e\u003cp\u003e\u003cspan\u003eMatt McGrath and Mark Poynting\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBBC Climate \u0026amp; Science\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThe UK government is investigating a fast-growing \u0026#34;green fuel\u0026#34; called HVO diesel amid claims of significant fraud, the BBC has learned.\u003c/p\u003e\u003cp\u003eHVO is increasingly popular as a transport fuel and for powering music festivals and its backers say it can curb carbon emissions by up to 90% as it can be made from waste materials like used cooking oil.\u003c/p\u003e\u003cp\u003eBut industry whistleblowers told the BBC they believe large amounts of these materials are not waste but instead are virgin palm oil, which is being fraudulently relabelled.\u003c/p\u003e\u003cp\u003eAnd data analysed by the BBC and shared with the UK\u0026#39;s Department for Transport casts further doubt on one of the key ingredients in HVO, a material called palm sludge waste.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eEurope used more of this waste in HVO and other biofuels in 2023 than it is thought possible for the world to produce.\u003c/p\u003e\u003cp\u003eIn response to the BBC\u0026#39;s findings, the Department for Transport said they \u0026#34;take the concerns raised seriously and are working with stakeholders and international partners to gather further information\u0026#34;.\u003c/p\u003e\u003cp\u003eHVO, or hydrotreated vegetable oil, has been called something of a wonder-fuel in recent years as it can be used as 100% substitute for diesel reducing planet warming emissions.\u003c/p\u003e\u003cp\u003eUK consumption rocketed from 8 million litres in 2019 to about 699 million litres in 2024, according to provisional government figures.\u003c/p\u003e\u003cp\u003eIts green credentials rely heavily on the assumption that it is made from waste sources, particularly used cooking oil or the waste sludge from palm oil production.\u003c/p\u003e\u003cp\u003eBut industry whistle-blowers have told the BBC that they believe virgin palm oil and other non-waste materials are often being used instead.\u003c/p\u003e\u003cp\u003eThat would be bad news for the planet, as virgin palm oil is linked to increased tropical deforestation, which adds to climate change and threatening endangered species like orang-utans.\u003c/p\u003e\u003cp\u003eThis palm oil \u0026#34;floods the market like cancer,\u0026#34; one large European biofuel manufacturer told the BBC.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eThey said that to stay in business they have to go along with the pretence that they are using waste materials.\u003c/p\u003e\u003cp\u003eAnother whistle-blower, a former trader of these biofuels, also speaking anonymously, gave the BBC his account of one recent case dealing with supposedly waste products.\u003c/p\u003e\u003cp\u003e\u0026#34;I believe that what I bought was multiple cargos of virgin palm oil that has been wrongly classified as palm oil sludge,\u0026#34; they said.\u003c/p\u003e\u003cp\u003e\u0026#34;I called one of the board members and told them about the situation, and then I was told that they didn\u0026#39;t want to do anything about it, because the evidence would be burned.\u0026#34;\u003c/p\u003e\u003cp\u003eAs well as this testimony, data compiled by campaign group Transport \u0026amp; Environment and analysed by the BBC suggests that more palm sludge waste is being used for transport biofuels than the world is probably able to produce. \u003c/p\u003e\u003cp\u003eThe figures show that the UK and EU used about two million tonnes of palm sludge waste for HVO and other biofuels in 2023, based on Eurostat and UK Department for Transport figures.\u003c/p\u003e\u003cp\u003eEU imports of this sludge appear to have risen further in 2024, according to preliminary UN trade data, although the UK appears to have bucked this trend.\u003c/p\u003e\u003cp\u003eBut the data analysed by the BBC, which is based on well-established UN and industry statistics, suggests the world can only produce just over one million tonnes of palm sludge waste a year.\u003c/p\u003e\u003cp\u003eThis mismatch further suggests non-waste fuels such as  virgin palm oil are being used to meet Europe\u0026#39;s rapid growth in biofuels, according to researchers and industry figures.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003e\u0026#34;It\u0026#39;s a very easy game,\u0026#34; said Dr Christian Bickert, a German farmer and editor with experience in biofuels, who believes that much of the HVO made with these waste products is \u0026#34;fake\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;Chemically, the sludge and the pure palm oil are absolutely the same because they come from the same plant, and also from the same production facilities in Indonesia,\u0026#34; he told BBC News.\u003c/p\u003e\u003cp\u003e\u0026#34;There\u0026#39;s no paper which proves [the fraud], no paper at all, but the figures tell a clear story.\u0026#34;\u003c/p\u003e\u003cp\u003eUnderpinning the sustainability claims of biofuels is an independent system of certification where producers have to show exactly where they get their raw materials from.\u003c/p\u003e\u003cp\u003eIt is mainly administered by a company called ISCC, and in Europe it has a long-standing reputation for ensuring that waste materials turned into fuel really do come from waste, by working with national authorities.\u003c/p\u003e\u003cp\u003eBut in Indonesia, Malaysia and China, three of the main sources of the raw ingredients claimed to be waste for HVO, supervision is much more difficult.\u003c/p\u003e\u003cp\u003e\u0026#34;ISCC is simply not allowed to send anybody to China,\u0026#34; said Dr Christian Bickert.\u003c/p\u003e\u003cp\u003e\u0026#34;They have to rely on certification companies in China to check that everything is OK, but China doesn\u0026#39;t allow any inspectors in from outside.\u0026#34;\u003c/p\u003e\u003cp\u003eThis concern is echoed by several other groups contacted by the BBC.\u003c/p\u003e\u003cp\u003eConstruction giant Balfour Beatty, for example, has a policy of not using the fuel, citing sustainability concerns.\u003c/p\u003e\u003cp\u003e\u0026#34;We just are not able to get any level of visibility over the supply chain of HVO that would give us that level of assurance that this is truly a sustainable product,\u0026#34; Balfour Beatty\u0026#39;s Jo Gilroy told BBC News.\u003c/p\u003e\u003cp\u003eThe European Waste-based and Advanced Biofuels Association represents the major biofuel manufacturers in the EU and UK.\u003c/p\u003e\u003cp\u003eIn a statement they said \u0026#34;there is a major certification verification issue that needs to be addressed as a matter of priority\u0026#34;, adding that the \u0026#34;ISCC should do much more to ensure that non-EU Biodiesel is really what it claims to be\u0026#34;.\u003c/p\u003e\u003cp\u003eIn the light of growing fraud allegations, the Irish authorities have recently restricted incentives for fuels made from palm waste.\u003c/p\u003e\u003cp\u003eThe BBC also understands that the EU is about to propose a ban on ISCC certification of waste biofuels for two-and-a-half years, although it is expected to say it is not aware of direct breaches of renewable goals.\u003c/p\u003e\u003cp\u003eIt would then be up to individual member countries to decide whether to accept certifications.\u003c/p\u003e\u003cp\u003eIn response, the ISCC said it was \u0026#34;more than surprised\u0026#34; by the EU\u0026#39;s move, adding that it had been \u0026#34;a frontrunner in implementing the most strict and effective measures to ensure integrity and fraud prevention in the market for years\u0026#34;.\u003c/p\u003e\u003cp\u003e\u0026#34;The measure would be a severe blow to the entire market for waste-based biofuels,\u0026#34; it said.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-08T23:03:15.676Z",
  "modifiedTime": "2025-04-08T23:03:15.676Z"
}
