{
  "id": "77ecbaeb-a027-4e26-9257-e7cada89f063",
  "title": "This quasar may have helped turn the lights on for the universe",
  "link": "https://www.sciencedaily.com/releases/2025/01/250115164904.htm",
  "description": "Astronomers have detected an intensely brightening and dimming quasar that may help explain how some objects in the early universe grew at a highly accelerated rate. The discovery is the most distant object detected by the NuSTAR X-ray space telescope (which launched in 2012) and stands as one of the most highly 'variable' quasars ever identified.",
  "author": "",
  "published": "Wed, 15 Jan 2025 16:49:04 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 3228,
  "excerpt": "Astronomers have detected an intensely brightening and dimming quasar that may help explain how some objects in the early universe grew at a highly accelerated rate. The discovery is the most distant object detected by the NuSTAR X-ray space telescope (which launched in 2012) and stands as one of the most highly 'variable' quasars ever identified.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A Yale-led team of astronomers has detected an intensely brightening and dimming quasar that may help explain how some objects in the early universe grew at a highly accelerated rate. The discovery, announced Jan. 14 at the winter meeting of the American Astronomical Society, is the most distant object detected by the NuSTAR X-ray space telescope (which launched in 2012) and stands as one of the most highly \"variable\" quasars ever identified. \"In this work, we have discovered that this quasar is very likely to be a supermassive black hole with a jet pointed towards Earth -- and we are seeing it in the first billion years of the universe,\" said Lea Marcotulli, a postdoctoral fellow in astrophysics at Yale and lead author of a new study published Jan. 14 in The Astrophysical Journal Letters. Quasars are among the oldest, brightest objects in the universe. Formed from active galactic nuclei (AGN) -- areas at the center of galaxies where a black hole is drawing in matter -- quasars emit electromagnetic radiation that can be spotted in radio, infrared, visible, ultraviolet, X-ray, and gamma-ray wavelengths. This \"visibility\" has made quasars a helpful proxy for trying to understand the structure and evolution of the cosmos. For example, astronomers look to quasars to study reionization, a period less than a billion years after the Big Bang when electrically neutral hydrogen atoms became charged and the first generation of stars lit up the universe. \"The epoch of reionization is considered the end of the universe's dark ages,\" said Thomas Connor, an astronomer at the Chandra X-Ray Center and co-corresponding author of the study. \"The precise timeline and source class responsible for reionization are still debated, and actively accreting supermassive black holes are one proposed culprit.\" For the study, the researchers compared NuSTAR observations of a distant quasar -- designated J1429+5447 -- with unrelated observations of four months earlier by the Chandra X-ray telescope. The researchers found that the quasar's X-ray emissions had doubled in that very short time (due to relativistic effects, the four months on Earth corresponded to only two weeks for the quasar). \"This level of X-ray variability, in terms of intensity and rapidity, is extreme,\" said Meg Urry, the Israel Munson Professor of Physics and Astronomy in Yale's Faculty of Arts and Sciences and co-author of the study. \"It is almost certainly explained by a jet pointing toward us -- a cone in which particles are transported up to a million light years away from the central, supermassive black hole. Because the jet moves at nearly the speed of light, effects of Einstein's theory of special relativity speed up and amplify the variability.\" The researchers said their findings offer crucial, much-needed information for astronomers studying reionization. It may also point astronomers toward other supermassive black hole candidates from the early universe. \"Finding more supermassive black holes that are potentially hosting jets raises the question as to how these black holes grew so big in such a short timescale, and what the connection may be to jet triggering mechanisms,\" Marcotulli said. NASA supported the research.",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA Yale-led team of astronomers has detected an intensely brightening and dimming quasar that may help explain how some objects in the early universe grew at a highly accelerated rate.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe discovery, announced Jan. 14 at the winter meeting of the American Astronomical Society, is the most distant object detected by the NuSTAR X-ray space telescope (which launched in 2012) and stands as one of the most highly \u0026#34;variable\u0026#34; quasars ever identified.\u003c/p\u003e\n\u003cp\u003e\u0026#34;In this work, we have discovered that this quasar is very likely to be a supermassive black hole with a jet pointed towards Earth -- and we are seeing it in the first billion years of the universe,\u0026#34; said Lea Marcotulli, a postdoctoral fellow in astrophysics at Yale and lead author of a new study published Jan. 14 in \u003cem\u003eThe Astrophysical Journal Letters\u003c/em\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eQuasars are among the oldest, brightest objects in the universe. Formed from active galactic nuclei (AGN) -- areas at the center of galaxies where a black hole is drawing in matter -- quasars emit electromagnetic radiation that can be spotted in radio, infrared, visible, ultraviolet, X-ray, and gamma-ray wavelengths. This \u0026#34;visibility\u0026#34; has made quasars a helpful proxy for trying to understand the structure and evolution of the cosmos.\u003c/p\u003e\n\u003cp\u003eFor example, astronomers look to quasars to study reionization, a period less than a billion years after the Big Bang when electrically neutral hydrogen atoms became charged and the first generation of stars lit up the universe.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The epoch of reionization is considered the end of the universe\u0026#39;s dark ages,\u0026#34; said Thomas Connor, an astronomer at the Chandra X-Ray Center and co-corresponding author of the study. \u0026#34;The precise timeline and source class responsible for reionization are still debated, and actively accreting supermassive black holes are one proposed culprit.\u0026#34;\u003c/p\u003e\n\u003cp\u003eFor the study, the researchers compared NuSTAR observations of a distant quasar -- designated J1429+5447 -- with unrelated observations of four months earlier by the Chandra X-ray telescope. The researchers found that the quasar\u0026#39;s X-ray emissions had doubled in that very short time (due to relativistic effects, the four months on Earth corresponded to only two weeks for the quasar).\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;This level of X-ray variability, in terms of intensity and rapidity, is extreme,\u0026#34; said Meg Urry, the Israel Munson Professor of Physics and Astronomy in Yale\u0026#39;s Faculty of Arts and Sciences and co-author of the study. \u0026#34;It is almost certainly explained by a jet pointing toward us -- a cone in which particles are transported up to a million light years away from the central, supermassive black hole. Because the jet moves at nearly the speed of light, effects of Einstein\u0026#39;s theory of special relativity speed up and amplify the variability.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe researchers said their findings offer crucial, much-needed information for astronomers studying reionization. It may also point astronomers toward other supermassive black hole candidates from the early universe.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Finding more supermassive black holes that are potentially hosting jets raises the question as to how these black holes grew so big in such a short timescale, and what the connection may be to jet triggering mechanisms,\u0026#34; Marcotulli said.\u003c/p\u003e\n\u003cp\u003eNASA supported the research.\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": null,
  "modifiedTime": null
}
