{
  "id": "8d585b91-00b0-4d23-b5af-63a450538c73",
  "title": "Shocking brain cancer breakthrough: Electric fields supercharge immune assault",
  "link": "https://www.sciencedaily.com/releases/2025/06/250609060137.htm",
  "description": "A breakthrough study from Keck Medicine of USC may have found a powerful new triple therapy for glioblastoma, one of the deadliest brain cancers. By combining Tumor Treating Fields (TTFields), which deliver electric waves into tumors, with immunotherapy and chemotherapy, researchers saw a major boost in survival.",
  "author": "",
  "published": "Mon, 09 Jun 2025 06:01:37 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 7175,
  "excerpt": "A breakthrough study from Keck Medicine of USC may have found a powerful new triple therapy for glioblastoma, one of the deadliest brain cancers. By combining Tumor Treating Fields (TTFields), which deliver electric waves into tumors, with immunotherapy and chemotherapy, researchers saw a major boost in survival.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "A new study led by Keck Medicine of USC researchers may have uncovered an effective combination therapy for glioblastoma, a brain tumor diagnosis with few available effective treatments. According to the National Brain Tumor Society, the average survival for patients diagnosed with glioblastoma is eight months. The study finds that using Tumor Treating Fields therapy (TTFields), which delivers targeted waves of electric fields directly into tumors to stop their growth and signal the body's immune system to attack cancerous tumor cells, may extend survival among patients with glioblastoma, when combined with immunotherapy (pembrolizumab) and chemotherapy (temozolomide). TTFields disrupt tumor growth using low-intensity, alternating electric fields that push and pull key structures inside tumor cells in continually shifting directions, making it difficult for the cells to multiply. Preventing tumor growth gives patients a better chance of successfully fighting the cancer. When used to treat glioblastoma, TTFields are delivered through a set of mesh electrodes that are strategically positioned on the scalp, generating fields at a precise frequency and intensity focused on the tumor. Patients wear the electrodes for approximately 18 hours a day. Researchers observed that TTFields attract more tumor-fighting T cells, which are white blood cells that identify and attack cancer cells, into and around the glioblastoma. When followed by immunotherapy, these T cells stay active longer and are replaced by even stronger, more effective tumor-fighting T cells. \"By using TTFields with immunotherapy, we prime the body to mount an attack on the cancer, which enables the immunotherapy to have a meaningful effect in ways that it could not before,\" said David Tran, MD, PhD, chief of neuro-oncology with Keck Medicine, co-director of the USC Brain Tumor Center and corresponding author of the study. \"Our findings suggest that TTFields may be the key to unlocking the value of immunotherapy in treating glioblastoma.\" TTFields are often combined with chemotherapy in cancer treatment. However, even with aggressive treatment, the prognosis for glioblastoma remains poor. Immunotherapy, while successful in many other cancer types, has also not proved effective for glioblastoma when used on its own. However, in this study, adding immunotherapy to TTFields and chemotherapy was associated with a 70% increase in overall survival. Notably, patients with larger, unresected (not surgically removed) tumors showed an even stronger immune response to TTFields and lived even longer. This suggests that, when it comes to kick-starting the body's immune response against the cancer, having a larger tumor may provide more targets for the therapy to work against. Using alternating electric fields to unlock immunotherapy Pembrolizumab, the immunotherapy used in this study, is an immune checkpoint inhibitor (ICI), which enhances the body's natural ability to fight cancers by improving T cells' ability to identify and attack cancer cells. However, there are typically few T cells in and around glioblastomas because these tumors originate in the brain and are shielded from the body's natural immune response by the blood-brain barrier. This barrier safeguards the brain by tightly regulating which cells and substances enter from the bloodstream. Sometimes, this barrier even blocks T cells and other therapies that could help kill brain tumors. This immunosuppressive environment inside and around the glioblastoma is what makes common cancer therapies like pembrolizumab and chemotherapy significantly less effective in treating it. Tran theorized the best way to get around this issue was to start an immune reaction directly inside the tumor itself, an approach known as in situ immunization, using TTFields. This study demonstrates that combining TTFields with immunotherapy triggers a potent immune response within the tumor -- one that ICIs can then amplify to bolster the body's own defense against cancer. \"Think of it like a team sport -- immunotherapy sends players in to attack the tumor (the offense), while TTFields weaken the tumor's ability to fight back (the defense). And just like in team sports, the best defense is a good offense,\" said Tran, who is also a member of the USC Norris Comprehensive Cancer Center. Study methodology and results The study analyzed data from 2-THE-TOP, a Phase 2 clinical trial, which enrolled 31 newly diagnosed glioblastoma patients who had completed chemoradiation therapy. Of those, 26 received TTFields combined with both chemotherapy and immunotherapy. Seven of these 26 patients had inoperable tumors due to their locations -- an especially high-risk subgroup with the worst prognosis and few treatment options. Patients in the trial were given six to 12 monthly treatments of chemotherapy alongside TTFields for up to 24 months. The number and duration of treatments were determined by patients' response to treatment. The immunotherapy was given every three weeks, starting with the second dose of chemotherapy, for up to 24 months. Patients who used the device alongside chemotherapy and immunotherapy lived approximately 10 months longer than patients who had used the device with chemotherapy alone in the past. Moreover, those with large, inoperable tumors lived approximately 13 months longer and showed much stronger immune activation compared to patients who underwent surgical removal of their tumors. \"Further studies are needed to determine the optimal role of surgery in this setting, but these findings may offer hope, particularly for glioblastoma patients who do not have surgery as an option,\" said Tran. Moving the research forward Keck Medicine is participating in the multicenter Phase 3 clinical trial to validate the efficacy of TTFields with immunotherapy and chemotherapy. Tran, who has been researching TTFields for more than a decade, serves as the chair of the steering committee for this trial. Frances Chow, MD, neuro-oncologist with USC Norris, is the principal investigator of the Keck Medicine study site. This Phase 3 trial, currently open at 28 sites across the United States, Europe and Israel, aims to enroll over 740 patients through April 2029, including those with gross total resection, partial resection or biopsy-only tumors to assess the extent of how surgically removing tumors influences immune response. Keck School of Medicine of USC authors of this study include Dongjiang Chen, PhD, assistant professor of research neurological surgery; Son Le, PhD, assistant professor of research neurological surgery; Harshit Manektalia, research programmer; Ming Li, PhD, professor of research population and public health sciences; and Adam O'Dell, research lab specialist. Ashley Ghiaseddin, MD, and Maryam Rahman, MD, MS, colleagues from the University of Florida, also contributed to this work. This study was funded by a grant from Novocure, which manufactures Optune, the TTFields device used in this study. Tran has received honoraria from Novocure for consultant work. Chen and Tran are inventors of two patent applications related to work reported in this study",
  "image": "https://www.sciencedaily.com/images/1920/Brain-Cancer-Tumor.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eA new study led by Keck Medicine of USC researchers may have uncovered an effective combination therapy for glioblastoma, a brain tumor diagnosis with few available effective treatments. According to the National Brain Tumor Society, the average survival for patients diagnosed with glioblastoma is eight months.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eThe study finds that using Tumor Treating Fields therapy (TTFields), which delivers targeted waves of electric fields directly into tumors to stop their growth and signal the body\u0026#39;s immune system to attack cancerous tumor cells, may extend survival among patients with glioblastoma, when combined with immunotherapy (pembrolizumab) and chemotherapy (temozolomide).\u003c/p\u003e\n\u003cp\u003eTTFields disrupt tumor growth using low-intensity, alternating electric fields that push and pull key structures inside tumor cells in continually shifting directions, making it difficult for the cells to multiply. Preventing tumor growth gives patients a better chance of successfully fighting the cancer. When used to treat glioblastoma, TTFields are delivered through a set of mesh electrodes that are strategically positioned on the scalp, generating fields at a precise frequency and intensity focused on the tumor. Patients wear the electrodes for approximately 18 hours a day.\u003c/p\u003e\n\u003cp\u003eResearchers observed that TTFields attract more tumor-fighting T cells, which are white blood cells that identify and attack cancer cells, into and around the glioblastoma. When followed by immunotherapy, these T cells stay active longer and are replaced by even stronger, more effective tumor-fighting T cells.\u003c/p\u003e\n\u003cp\u003e\u0026#34;By using TTFields with immunotherapy, we prime the body to mount an attack on the cancer, which enables the immunotherapy to have a meaningful effect in ways that it could not before,\u0026#34; said David Tran, MD, PhD, chief of neuro-oncology with Keck Medicine, co-director of the USC Brain Tumor Center and corresponding author of the study. \u0026#34;Our findings suggest that TTFields may be the key to unlocking the value of immunotherapy in treating glioblastoma.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTTFields are often combined with chemotherapy in cancer treatment. However, even with aggressive treatment, the prognosis for glioblastoma remains poor. Immunotherapy, while successful in many other cancer types, has also not proved effective for glioblastoma when used on its own.\u003c/p\u003e\n\u003cp\u003eHowever, in this study, adding immunotherapy to TTFields and chemotherapy was associated with a 70% increase in overall survival. Notably, patients with larger, unresected (not surgically removed) tumors showed an even stronger immune response to TTFields and lived even longer. This suggests that, when it comes to kick-starting the body\u0026#39;s immune response against the cancer, having a larger tumor may provide more targets for the therapy to work against.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cstrong\u003eUsing alternating electric fields to unlock immunotherapy \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePembrolizumab, the immunotherapy used in this study, is an immune checkpoint inhibitor (ICI), which enhances the body\u0026#39;s natural ability to fight cancers by improving T cells\u0026#39; ability to identify and attack cancer cells.\u003c/p\u003e\n\u003cp\u003eHowever, there are typically few T cells in and around glioblastomas because these tumors originate in the brain and are shielded from the body\u0026#39;s natural immune response by the blood-brain barrier. This barrier safeguards the brain by tightly regulating which cells and substances enter from the bloodstream. Sometimes, this barrier even blocks T cells and other therapies that could help kill brain tumors.\u003c/p\u003e\n\u003cp\u003eThis immunosuppressive environment inside and around the glioblastoma is what makes common cancer therapies like pembrolizumab and chemotherapy significantly less effective in treating it. Tran theorized the best way to get around this issue was to start an immune reaction directly inside the tumor itself, an approach known as in situ immunization, using TTFields.\u003c/p\u003e\n\u003cp\u003eThis study demonstrates that combining TTFields with immunotherapy triggers a potent immune response within the tumor -- one that ICIs can then amplify to bolster the body\u0026#39;s own defense against cancer.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Think of it like a team sport -- immunotherapy sends players in to attack the tumor (the offense), while TTFields weaken the tumor\u0026#39;s ability to fight back (the defense). And just like in team sports, the best defense is a good offense,\u0026#34; said Tran, who is also a member of the USC Norris Comprehensive Cancer Center.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cstrong\u003eStudy methodology and results\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe study analyzed data from 2-THE-TOP, a Phase 2 clinical trial, which enrolled 31 newly diagnosed glioblastoma patients who had completed chemoradiation therapy. Of those, 26 received TTFields combined with both chemotherapy and immunotherapy. Seven of these 26 patients had inoperable tumors due to their locations -- an especially high-risk subgroup with the worst prognosis and few treatment options.\u003c/p\u003e\n\u003cp\u003ePatients in the trial were given six to 12 monthly treatments of chemotherapy alongside TTFields for up to 24 months. The number and duration of treatments were determined by patients\u0026#39; response to treatment. The immunotherapy was given every three weeks, starting with the second dose of chemotherapy, for up to 24 months.\u003c/p\u003e\n\u003cp\u003ePatients who used the device alongside chemotherapy and immunotherapy lived approximately 10 months longer than patients who had used the device with chemotherapy alone in the past. Moreover, those with large, inoperable tumors lived approximately 13 months longer and showed much stronger immune activation compared to patients who underwent surgical removal of their tumors.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Further studies are needed to determine the optimal role of surgery in this setting, but these findings may offer hope, particularly for glioblastoma patients who do not have surgery as an option,\u0026#34; said Tran.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMoving the research forward\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKeck Medicine is participating in the multicenter Phase 3 clinical trial to validate the efficacy of TTFields with immunotherapy and chemotherapy. Tran, who has been researching TTFields for more than a decade, serves as the chair of the steering committee for this trial. Frances Chow, MD, neuro-oncologist with USC Norris, is the principal investigator of the Keck Medicine study site.\u003c/p\u003e\n\u003cp\u003eThis Phase 3 trial, currently open at 28 sites across the United States, Europe and Israel, aims to enroll over 740 patients through April 2029, including those with gross total resection, partial resection or biopsy-only tumors to assess the extent of how surgically removing tumors influences immune response.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eKeck School of Medicine of USC authors of this study include Dongjiang Chen, PhD, assistant professor of research neurological surgery; Son Le, PhD, assistant professor of research neurological surgery; Harshit Manektalia, research programmer; Ming Li, PhD, professor of research population and public health sciences; and Adam O\u0026#39;Dell, research lab specialist. Ashley Ghiaseddin, MD, and Maryam Rahman, MD, MS, colleagues from the University of Florida, also contributed to this work.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis study was funded by a grant from Novocure, which manufactures Optune, the TTFields device used in this study. Tran has received honoraria from Novocure for consultant work. Chen and Tran are inventors of two patent applications related to work reported in this study\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
