{
  "id": "9404befe-2306-4078-8175-a076938614cd",
  "title": "Better heating method makes legumes easier to digest",
  "link": "https://phys.org/news/2025-06-method-legumes-easier-digest.html",
  "description": "While they have been part of our human diet for centuries, legumes like peas and beans are ultimately seeds for the next generation of plants. To protect themselves from being eaten by animals and insects, they contain \"antinutrients\" that are hard for animals—and humans—to digest.",
  "author": "",
  "published": "Tue, 24 Jun 2025 17:20:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Biochemistry"
  ],
  "byline": "Ella Funk",
  "length": 3412,
  "excerpt": "While they have been part of our human diet for centuries, legumes like peas and beans are ultimately seeds for the next generation of plants. To protect themselves from being eaten by animals and insects, they contain \"antinutrients\" that are hard for animals—and humans—to digest.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Pixabay/CC0 Public Domain While they have been part of our human diet for centuries, legumes like peas and beans are ultimately seeds for the next generation of plants. To protect themselves from being eaten by animals and insects, they contain \"antinutrients\" that are hard for animals—and humans—to digest. These antinutritional compounds—which include tannins, lectins, trypsin inhibitors, and phytic acid—are broken down when beans and peas are heated. However, the large ovens that food processing companies currently use to heat beans and peas are inefficient. They can burn the outside before the inside has reached a temperature hot enough to deactivate the antinutrients. Researchers from the University of Saskatchewan (USask) Department of Chemical and Biological Engineering have identified a new heating method—using radio frequency (RF) waves—that appears to be both more effective and efficient than the approach currently used in the industry. The paper is published in the journal Innovative Food Science \u0026 Emerging Technologies. Tolen Moirangthem, a Ph.D. student from the group, compares RF waves to microwaves. \"When you put a cup of water in the microwave, the water heats up, but the cup doesn't. The same is true for the pea—the water inside heats up, but the rest of the pea doesn't.\" Scientists call this process \"selective heating,\" because it can heat some areas within a material but not others. It seems to help maintain the desirable nutritional properties in pea or bean, which can break down with regular heating methods. And unlike the long heating times of traditional processes, the RF heating method only takes a few minutes. The team hypothesized that during RF heat treatment, the water inside a legume expands and turns into steam, which would cause the pores inside to explode from the pressure. In turn, this would create larger pores in the samples, as well as more pores in total, as the steam looked for ways to escape. Using the Canadian Light Source at USask, the research group confirmed that the beans treated with RF heat did in fact have more pores, and the heating method reduced the amount of an antinutrient (proteins called trypsin inhibitors) by 81%. \"We know that we have big potential with this project,\" says Moirangthem. \"Animal protein is very expensive in different parts of the world, so we need sustainable plant protein that can be produced at mass volume to feed the world population.\" This new heating method could help make bean and pea crops even more environmentally friendly to process, with the bonus of making legumes easier to digest. More information: Tolen Tombung Moirangthem et al, Experimental and computational study of synchrotron X-ray micro-computed tomography imaging in peas and pinto beans after radiofrequency heating, Innovative Food Science \u0026 Emerging Technologies (2025). DOI: 10.1016/j.ifset.2025.104033",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2023/dry-beans.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n        \u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1075306\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2023/dry-beans.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2023/dry-beans.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2023/dry-beans.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2023/dry-beans.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2023/dry-beans.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2023/dry-beans.jpg\" width=\"800\" height=\"530\" alt=\"dry beans\" title=\"Credit: Pixabay/CC0 Public Domain\" fetchpriority=\"high\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pixabay/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eWhile they have been part of our human diet for centuries, legumes like peas and beans are ultimately seeds for the next generation of plants. To protect themselves from being eaten by animals and insects, they contain \u0026#34;antinutrients\u0026#34; that are hard for animals—and humans—to digest.\u003c/p\u003e\n\n                \n                                \n                \n                \n                                                            \u003cp\u003eThese antinutritional compounds—which include tannins, lectins, trypsin inhibitors, and phytic acid—are broken down when beans and peas are heated. However, the large ovens that food processing companies currently use to heat beans and peas are inefficient. They can burn the outside before the inside has reached a temperature hot enough to deactivate the antinutrients.\u003c/p\u003e\n\u003cp\u003eResearchers from the University of Saskatchewan (USask) Department of Chemical and Biological Engineering have identified a new heating method—using \u003ca href=\"https://phys.org/tags/radio+frequency/\" rel=\"tag\"\u003eradio frequency\u003c/a\u003e (RF) waves—that appears to be both more effective and efficient than the approach currently used in the industry. The paper is \u003ca href=\"https://linkinghub.elsevier.com/retrieve/pii/S1466856425001171\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eInnovative Food Science \u0026amp; Emerging Technologies\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eTolen Moirangthem, a Ph.D. student from the group, compares RF waves to microwaves. \u0026#34;When you put a cup of water in the microwave, the water heats up, but the cup doesn\u0026#39;t. The same is true for the pea—the water inside heats up, but the rest of the pea doesn\u0026#39;t.\u0026#34;\u003c/p\u003e\n\u003cp\u003eScientists call this process \u0026#34;selective heating,\u0026#34; because it can heat some areas within a material but not others. It seems to help maintain the desirable nutritional properties in pea or bean, which can break down with regular heating methods. And unlike the long heating times of traditional processes, the RF heating method only takes a few minutes.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eThe team hypothesized that during RF heat treatment, the water inside a legume expands and turns into steam, which would cause the pores inside to explode from the pressure. In turn, this would create larger pores in the samples, as well as more pores in total, as the steam looked for ways to escape.\u003c/p\u003e\n\u003cp\u003eUsing the Canadian Light Source at USask, the research group confirmed that the beans treated with RF heat did in fact have more pores, and the heating method reduced the amount of an antinutrient (proteins called trypsin inhibitors) by 81%.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We know that we have big potential with this project,\u0026#34; says Moirangthem. \u0026#34;Animal protein is very expensive in different parts of the world, so we need sustainable plant protein that can be produced at mass volume to feed the world population.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThis new heating method could help make bean and pea crops even more environmentally friendly to process, with the bonus of making legumes easier to digest.\u003c/p\u003e\n\n                                                            \n                  \n\n                \n                                    \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Tolen Tombung Moirangthem et al, Experimental and computational study of synchrotron X-ray micro-computed tomography imaging in peas and pinto beans after radiofrequency heating, \u003ci\u003eInnovative Food Science \u0026amp; Emerging Technologies\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1016/j.ifset.2025.104033\" target=\"_blank\"\u003eDOI: 10.1016/j.ifset.2025.104033\u003c/a\u003e\n                            \u003c/p\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\n\t\t  \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-24T17:20:01-04:00",
  "modifiedTime": null
}
