{
  "id": "adb2cf81-eb4c-4124-a956-a9081be5d7a3",
  "title": "Mammals were adapting from life in the trees to living on the ground before dinosaur-killing asteroid, research reveals",
  "link": "https://phys.org/news/2025-04-mammals-life-trees-ground-dinosaur.html",
  "description": "More mammals were living on the ground several million years before the mass extinction event that wiped out the dinosaurs, new research led by the University of Bristol has revealed.",
  "author": "",
  "published": "Tue, 01 Apr 2025 20:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Evolution Paleontology \u0026 Fossils"
  ],
  "byline": "University of Bristol",
  "length": 3461,
  "excerpt": "More mammals were living on the ground several million years before the mass extinction event that wiped out the dinosaurs, new research led by the University of Bristol has revealed.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Dryolestes, a Late Jurassic relative of the Cretaceous therians. Credit: Artist James Brown. Pamela Gill More mammals were living on the ground several million years before the mass extinction event that wiped out the dinosaurs, new research led by the University of Bristol has revealed. The study, published in the journal Palaeontology, provides fresh evidence that many mammals were already shifting toward a more ground-based lifestyle leading up to the asteroid's impact. By analyzing small-fossilized bone fragments, specifically end of limb bones, from marsupial and placental mammals found in Western North America—the only place with a well-preserved terrestrial fossil record from this time—the team discovered signs that these mammals were adapting to life on the ground. End of limb bones were analyzed as they bear signatures of locomotory habit that can be statistically compared with modern mammals. Lead author Professor Christine Janis from the University of Bristol's School of Earth Sciences said, \"It was already known that plant life changed toward the end of the Cretaceous, with flowering plants, known as angiosperms, creating more diverse habitats on the ground. \"We also knew that tree-dwelling mammals struggled after the asteroid impact. What had not been documented was whether mammals were becoming more terrestrial, in line with the habitat changes.\" While previous studies used complete skeletons to study ancient mammal movement, this research is one of the first to use small bone elements to track changes within an entire community. The team used statistical data from museum collections in New York, California, and Calgary to analyze these tiny fossils. Professor Janis added, \"The vegetational habitat was more important for the course of Cretaceous mammalian evolution than any influence from dinosaurs.\" The evidence was gathered from bone articular fragments of therian mammals, which includes marsupials and placentals. The team's methods were not applied to more basal mammals such as multituberculates, which were common at the time, because their bones were different. Professor Janis said, \"We've known for a long time that mammalian long bone articular surfaces can carry good information about their mode of locomotion, but I think this is the first study to use such small bone elements to study change within a community, rather than just individual species.\" While this research marks the end of the project, the findings offer new insights into how prehistoric mammals responded to changing environments—a few million years before the asteroid impact reshaped life on Earth. More information: Down to earth: therian mammals became more terrestrial towards the end of the Cretaceous, Palaeontology (2025). DOI: 10.1111/pala.70004 Journal information: Palaeontology",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/mammals-were-adapting.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n        \u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1208423\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2025/mammals-were-adapting.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/mammals-were-adapting.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/mammals-were-adapting.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/mammals-were-adapting.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/mammals-were-adapting.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/mammals-were-adapting.jpg\" width=\"800\" height=\"530\" alt=\"Mammals were adapting from life in the trees to living on the ground before dinosaur-killing asteroid\" title=\"Dryolestes, a Late Jurassic relative of the Cretaceous therians. Credit: Artist James Brown. Pamela Gill\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eDryolestes, a Late Jurassic relative of the Cretaceous therians. Credit: Artist James Brown. Pamela Gill\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eMore mammals were living on the ground several million years before the mass extinction event that wiped out the dinosaurs, new research led by the University of Bristol has revealed.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003eThe study, published in the journal \u003ci\u003ePalaeontology\u003c/i\u003e, provides fresh evidence that many mammals were already shifting toward a more ground-based lifestyle leading up to the asteroid\u0026#39;s impact.\u003c/p\u003e\n\u003cp\u003eBy analyzing small-fossilized bone fragments, specifically end of limb bones, from marsupial and \u003ca href=\"https://phys.org/tags/placental+mammals/\" rel=\"tag\"\u003eplacental mammals\u003c/a\u003e found in Western North America—the only place with a well-preserved terrestrial fossil record from this time—the team discovered signs that these mammals were adapting to life on the ground. End of \u003ca href=\"https://phys.org/tags/limb+bones/\" rel=\"tag\"\u003elimb bones\u003c/a\u003e were analyzed as they bear signatures of locomotory habit that can be statistically compared with modern mammals.\u003c/p\u003e\n\u003cp\u003eLead author Professor Christine Janis from the University of Bristol\u0026#39;s School of Earth Sciences said, \u0026#34;It was already known that plant life changed toward the end of the Cretaceous, with flowering plants, known as angiosperms, creating more diverse habitats on the ground.\u003c/p\u003e\n\u003cp\u003e\u0026#34;We also knew that tree-dwelling mammals struggled after the asteroid impact. What had not been documented was whether mammals were becoming more terrestrial, in line with the habitat changes.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhile previous studies used complete skeletons to study ancient mammal movement, this research is one of the first to use small bone elements to track changes within an entire community. The team used \u003ca href=\"https://phys.org/tags/statistical+data/\" rel=\"tag\"\u003estatistical data\u003c/a\u003e from \u003ca href=\"https://phys.org/tags/museum+collections/\" rel=\"tag\"\u003emuseum collections\u003c/a\u003e in New York, California, and Calgary to analyze these tiny fossils.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eProfessor Janis added, \u0026#34;The vegetational habitat was more important for the course of Cretaceous mammalian evolution than any influence from dinosaurs.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe evidence was gathered from bone articular fragments of therian mammals, which includes marsupials and placentals. The team\u0026#39;s methods were not applied to more basal mammals such as multituberculates, which were common at the time, because their bones were different.\u003c/p\u003e\n\u003cp\u003eProfessor Janis said, \u0026#34;We\u0026#39;ve known for a long time that mammalian long bone articular surfaces can carry good information about their mode of locomotion, but I think this is the first study to use such small bone elements to study change within a community, rather than just individual species.\u0026#34;\u003c/p\u003e\n\u003cp\u003eWhile this research marks the end of the project, the findings offer new insights into how prehistoric mammals responded to changing environments—a few million years before the asteroid impact reshaped life on Earth.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Down to earth: therian mammals became more terrestrial towards the end of the Cretaceous, \u003ci\u003ePalaeontology\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1111/pala.70004\" target=\"_blank\"\u003eDOI: 10.1111/pala.70004\u003c/a\u003e\n                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/palaeontology/\"\u003ePalaeontology\u003c/a\u003e\n                                                                                    \u003ca href=\"http://www.blackwellpublishing.com/journal.asp?ref=0031-0239\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\n\t\t  \n    \u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-01T20:00:01-04:00",
  "modifiedTime": null
}
