{
  "id": "af0a78cc-c027-4b30-9744-ca3eb2becd47",
  "title": "Our Medical Establishment In Power Versus Our Medical Establishment Out of Power",
  "link": "https://sciencebasedmedicine.org/power/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=power",
  "description": "Now that they have power, Drs. Marty Makary, Vinay Prasad, and Jay Bhattacharya have different standards than they set for their predecessors. The post Our Medical Establishment In Power Versus Our Medical Establishment Out of Power first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Thu, 29 May 2025 11:09:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 7368,
  "excerpt": "Now that they have power, Drs. Marty Makary, Vinay Prasad, and Jay Bhattacharya have different standards than they set for their predecessors.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "Dr. Marty Makary When Dr. Marty Makary was out of power, he excoriated his predecessors for supposedly recommending COVID vaccines without a vote from vaccine experts. In an article titled Why America Doesn’t Trust the CDC he wrote: If the CDC is curious as to why people aren’t listening to its recommendations, it should consider how it bypassed experts to put the matter before a Kangaroo court of like-minded loyalists. The Biden administration should insist that we return to the standard process of putting all major vaccine decisions before a vote of the FDA’s leading vaccine experts. However, Dr. Makary didn’t follow this “standard process” once he had the power to restrict vaccines for healthy people under age 65. Along with Dr. Vinay Prasad and RFK Jr., he simply decreed it, and according to the article CDC Blindsided As RFK Jr. Changes Vaccine Recommendations: Health and Human Services Secretary Robert F. Kennedy Jr.’s surprise announcement Tuesday ending coronavirus vaccine recommendations for healthy children and pregnant women blindsided the agency that offers that advice, according to current and former federal health officials. Officials at the Centers for Disease Control and Prevention are scrambling to understand Kennedy’s decision, announced in a 58-second video on X on Tuesday morning, which took agency staff by surprise. Dr. Vinay Prasad When Dr. Vinay Prasad was out of power, he blasted his predecessors for not studying every COVID mitigation measure via an RCT for every variant and demographic subgroup. “My philosophy is RCT or STFU” he said in his typical juvenile manner. Dr. Prasad created long lists of unwanted mitigation measures and then claimed they were useless because other doctors hadn’t demonstrated their value in a massive RCT. Now, that he is in power and is expected to generate evidence for the American public, Dr. Prasad created yet another medical reversal. During a recent conversation with Dr. Makary about talc, which is grave danger to the American public according to our medical establishment, he decided that, except for vaccines, RCTs are no longer needed to guard against potential harms. “This is just a simple teaching point,” he said, explaining why no one should expect him or anyone in the new medical establishment to do any RCTs. “RCT or STFU” was for other people. Dr. Jay Bhattacharya When Dr. Jay Bhattacharya was out of power, he accused others of working for a “censorship regime.” This was entirely about the fate of social media content, some tweets and a YouTube video. Now that he is in power, Dr. Bhattacharya has no problems working for an administration responsible for these headlines: RFK Jr. Threatens To Bar Government Scientists From Publishing In Leading Medical Journals, Medical Journals Hit With Threatening Letters From Justice Department, and Top NIH Nutrition Researcher Quits, Citing Censorship Under Kennedy. And thus, it becomes clear. Aside from their anti-vaccine agenda, the only principles guiding our medical establishment are their own power and advancement. I also call it like I see it. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts Posted by Jonathan Howard Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\"",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-23.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n\n        \n\u003carticle id=\"post-109022\"\u003e\n\n\t\t\n\t\u003cdiv\u003e\n\t\t\n\n\u003ch2\u003eDr. Marty Makary\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen Dr. Marty Makary was out of power, he excoriated his predecessors for supposedly recommending COVID vaccines without a vote from vaccine experts. In an article titled \u003ca href=\"https://www.newsweek.com/why-america-doesnt-trust-cdc-opinion-1713145\"\u003eWhy America Doesn’t Trust the CDC\u003c/a\u003e he wrote:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eIf the CDC is curious as to why people aren’t listening to its recommendations, it should consider how it bypassed experts to put the matter before a Kangaroo court of like-minded loyalists. The Biden administration should insist that we return to the standard process of putting all major vaccine decisions before a vote of the FDA’s leading vaccine experts.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHowever, Dr. Makary didn’t follow this “standard process” once he had the power to \u003cem\u003erestrict\u003c/em\u003e vaccines for healthy people under age 65. Along with Dr. Vinay Prasad and RFK Jr., he simply decreed it, and according to the article \u003ca href=\"https://www.washingtonpost.com/health/2025/05/28/vaccines-cdc-rfk-jr-covid/\" title=\"\"\u003eCDC Blindsided As RFK Jr. Changes Vaccine Recommendations\u003c/a\u003e:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eHealth and Human Services Secretary Robert F. Kennedy Jr.’s surprise announcement Tuesday ending coronavirus vaccine recommendations for healthy children and pregnant women blindsided the agency that offers that advice, according to current and former federal health officials. Officials at the Centers for Disease Control and Prevention are scrambling to understand Kennedy’s decision, announced in a 58-second video on X on Tuesday morning, which took agency staff by surprise.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Makary explains why he and Dr. Prasad want unvaccinated kids to get COVID\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/CO08TUJckqQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eDr. Vinay Prasad\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen Dr. Vinay Prasad was out of power, he blasted his predecessors for not studying every COVID mitigation measure via an RCT for every variant and demographic subgroup.  “\u003ca href=\"https://www.drvinayprasad.com/p/mayo-clinic-suspends-a-doctor-who\" title=\"\"\u003eMy philosophy is RCT or STFU\u003c/a\u003e” he said in his typical juvenile manner. Dr. Prasad created \u003ca href=\"https://x.com/VPrasadMDMPH/status/1496281475561500673\" title=\"\"\u003elong lists of unwanted mitigation measures\u003c/a\u003e and then claimed they were useless because \u003cem\u003eother doctors \u003c/em\u003ehadn’t demonstrated their value in a massive RCT.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, that he is in power and is expected to generate evidence for the American public, Dr. Prasad created yet another medical reversal. During a recent conversation with Dr. Makary about talc, which is \u003ca href=\"https://x.com/DrMakaryFDA/status/1926420514597192001\" title=\"\"\u003egrave danger to the American public\u003c/a\u003e according to our medical establishment, he decided that, except for vaccines, RCTs are no longer needed to guard against potential harms. “This is just a simple teaching point,” he said, explaining why no one should expect him or anyone in the new medical establishment to do any RCTs.  “RCT or STFU” was for other people.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"Vinay Prasad suddenly rejects most RCTs now that he\u0026#39;s in power and expected to do them\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/-VOGWqtO4J4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\u003ch2\u003eDr. Jay Bhattacharya\u003c/h2\u003e\n\n\n\n\u003cp\u003eWhen Dr. Jay Bhattacharya was out of power, he accused others of working for a “censorship regime.” This was entirely about the fate of social media content, some tweets and a YouTube video.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"606\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-1024x606.png\" alt=\"A tweet from Jay Bhattacharya criticizing an administration for suppressing scientific discussion, calling it authoritarian and blaming the CDC’s failures. The tweet was posted on May 26, 2023, with 21K views.\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-1024x606.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-480x284.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-200x118.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-768x454.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-1200x710.png 1200w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-1300x769.png 1300w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22-650x384.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2025/05/image-22.png 1500w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eNow that he is in power, Dr. Bhattacharya has no problems working for an administration responsible for these headlines: \u003ca href=\"https://www.politico.com/news/2025/05/27/rfk-jr-nih-scientists-medical-journals-jama-lancet-nejm-00371349\"\u003eRFK Jr. Threatens To Bar Government Scientists From Publishing In Leading Medical Journals\u003c/a\u003e, \u003ca href=\"https://www.npr.org/sections/shots-health-news/2025/05/02/nx-s1-5374993/medical-journals-hit-with-threatening-letters-from-justice-department\"\u003eMedical Journals Hit With Threatening Letters From Justice Department\u003c/a\u003e, and \u003ca href=\"https://www.pulmonologyadvisor.com/news/top-nih-nutrition-researcher-quits-citing-censorship-under-kennedy/\"\u003eTop NIH Nutrition Researcher Quits, Citing Censorship Under Kennedy\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd thus, it becomes clear. Aside from their anti-vaccine agenda, the only principles guiding our medical establishment are their own power and advancement. I also call it like I see it.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                                                                                                    Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                                                                                                \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#87ede8e9e6f3efe6e9a9efe8f0e6f5e3c7e9fef2ebe6e9e0e8e9e2a9e8f5e0\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                            \n        \n\n\t\u003c/div\u003e\n\n\t\n\t\t\t\n\t\n\u003c/article\u003e\n\t\u003cdiv\u003e\n\t\t\t\u003ch3\u003e\n\t\t\t\t\t\t\t\t\tPosted by\t\t\t\t\t\t\t\tJonathan Howard\u003c/h3\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eDr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;\u003c/p\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/div\u003e\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n            \n\n            \n\n\n    \u003c/main\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-05-29T07:09:00-04:00",
  "modifiedTime": "2025-05-29T11:11:53Z"
}
