{
  "id": "b1d2805c-5d4a-43fb-9dfa-0a384ec46c3e",
  "title": "ZDoggMD on RFK Jr.’s Rise: “I’m Talking About Like These Science Based Medicine Guys”",
  "link": "https://sciencebasedmedicine.org/notourfault/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=notourfault",
  "description": "Dr. Zubin Damania praised and promoted RFK Jr.-loving doctors. We criticized these doctors and corrected their factual errors. See the difference? The post ZDoggMD on RFK Jr.’s Rise: “I’m Talking About Like These Science Based Medicine Guys” first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Fri, 29 Nov 2024 08:00:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and the Media",
    "Vaccines",
    "antivaccine",
    "COVID-19",
    "COVID-19 vaccine",
    "natural herd immunity",
    "public health",
    "Robert F. Kennedy Jr.",
    "vaccines",
    "Vinay Prasad",
    "ZDoggMD",
    "Zubin Damania"
  ],
  "byline": "Jonathan Howard",
  "length": 8926,
  "excerpt": "Dr. Zubin Damania praised and promoted RFK Jr.-loving doctors. We criticized these doctors and corrected their factual errors. See the difference?",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "In 2019, Dr. Zubin Damania (ZDoggMD) recorded a video titled Deadly Samoan Measles Outbreak, What Can We Learn? In it, he rightfully criticized anti-vaxxers for triggering this outbreak. He said: The tragedy of measles deaths in Samoa is a stark warning: NEVER listen to the anti-vaxx cult when they say this “natural” disease is harmless. However, with SARS-CoV-2 Dr. Damania repeatedly encouraged a casual indifference regarding deceased children. He further told his audience to disregard pediatricians and instead to believe doctors such as Marty Makary, Vinay Prasad, and Jay Bhattacharya. Dr. Damania was very successful in getting his audience to trust these anti-vaccine, misinformation doctors, and so here we are. Dr. Damania recently recorded a podcast titled The Truth About RFK Jr. (And Dr. Oz!) w/Dr. Paul Offit, in which they lamented the rise of RFK Jr. Dr. Damania correctly said: I’m clutching my pearls about RFK. Because he’s he’s just a different level of denialist and and and dangerous, honestly, because it will erode the public’s trust and faith in the actual process of science. He’s absolutely right. However, Dr. Damania also said the following: There’s a militantism right on in the science community sometimes about don’t, don’t brook any dissent. And, and I’m talking about like these Science Based Medicine guys and these guys. So they were at the time criticizing me for even talking to someone like a Vinay Prasad or someone because they, they, it wasn’t an absolutist sort of stance, right? And now they’re talking about like sane washing RFK, which I think is like not not a good thing, right? But the idea then that that we can’t be transparent in that way, that we have to speak in a certain way in order to make sure people go along with it. I, I just don’t know that I think people are smarter than that if given the opportunity. Dr. Damania was right about one thing, sanewashing RFK Jr. was definitely not a “good thing”. However, many of Dr. Damania’s most honored guests did exactly that. These doctors told the world that RFK Jr. was reliable and trustworthy and Dr. Damania told the world that these RFK Jr.-loving doctors were reliable and trustworthy. The many anti-vaccine comments on Dr. Damania’s recent video show that his listeners absorbed their pro-RFK Jr. message. This is what he accomplished the past 4.5 years, and this is why we’ve criticized him. No one faulted Dr. Damania for “talking to someone like a Vinay Prasad.” I’d be happy to talk to Dr. Prasad about his pandemic pronouncements. Instead we faulted Dr. Damania for praising, legitimizing, and amplifying someone like a Vinay Prasad. In contrast, we at SBM accurately informed our readers that Dr. Prasad spread copious misinformation and repeatedly gushed over RFK Jr. Dr. Damania dunked on us for that reason. We are not “transparent” in some mysterious way. Dr. Damania did this. We at SBM did the opposite. I think I can speak for everyone at SBM when I say, we believe that doctors should communicate accurate and complete information to their audience. That is being transparent, and I previously encouraged Dr. Damania to this. He declined. We also believe that doctors who praised RFK Jr. spread dangerous disinformation and have responsibility for bringing us to this dangerous moment. We further believe it was inappropriate for doctors to profit from their RFK Jr. boosterism. Dr. Damania disagrees with us about all this, and he is free to call us “absolutist” and “militant” for that reason. He can say we “don’t brook any dissent” and other content-free insults. However, he can’t point out an instance we’ve been wrong about anything, nor can he escape his role in paving the way for anti-vaxxers to gain power. He chose to glorify pro-RFK Jr. doctors, and he owns the results. If Dr. Damania feels I am wrong about this or anything else, I’d be happy to be on his podcast. Contrary to his dishonest depictions, I am perfectly willing to hear good-faith criticism. Dr. Damania can lay into me and let everyone know exactly where he thinks I’ve erred. He can grill my on my writing. I am perfectly prepared to defend it or admit error if I got something wrong. I am also perfectly prepared to calmly and politely remind Dr. Damania of many things he said about COVID. I will ask him why he glorified doctors who legitimized RFK Jr., while bashing doctors who warned about him. I will bring up the points I made in my article Any Doctor Who Enabled RFK Jr. In Any Way Is Anti-Vaccine No Matter How They Describe Themselves. Something tells me that while pro-RFK Jr. doctors will always be welcome on Dr. Damania’s podcast, I will not receive an invitation. It’s almost as if being unable to brook dissent isn’t my problem. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts Posted by Jonathan Howard Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\"",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n\n        \n\u003carticle id=\"post-102576\"\u003e\n\n\t\t\n\t\u003cdiv\u003e\n\t\t\n\n\u003cp\u003eIn 2019, \u003ca href=\"https://sciencebasedmedicine.org/open-letter-2/\"\u003eDr. Zubin Damania\u003c/a\u003e (ZDoggMD) recorded a video titled \u003ca href=\"https://zdoggmd.com/measles-outbreak-samoa/\"\u003eDeadly Samoan Measles Outbreak, What Can We Learn?\u003c/a\u003e In it, he rightfully criticized anti-vaxxers for triggering this outbreak. He said:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThe tragedy of measles deaths in Samoa is a stark warning: NEVER listen to the anti-vaxx cult when they say this “natural” disease is harmless.\u003c/p\u003e\n\n\n\n\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHowever, with SARS-CoV-2 Dr. Damania repeatedly encouraged a \u003ca href=\"https://sciencebasedmedicine.org/doctors-on-measles-never-listen-to-the-anti-vax-cult-when-they-say-this-natural-disease-is-harmless-doctors-on-covid-%f0%9f%98%82/\"\u003ecasual indifference\u003c/a\u003e regarding deceased children.  He further told his audience to \u003ca href=\"https://www.youtube.com/watch?v=Frmk5J_j2wI\"\u003edisregard pediatricians\u003c/a\u003e and instead to believe doctors such as \u003ca href=\"https://sciencebasedmedicine.org/too-late/\"\u003eMarty Makary\u003c/a\u003e, \u003ca href=\"https://sciencebasedmedicine.org/dr-vinay-prasad-opposed-the-pediatric-covid-vaccine-before-there-was-a-pediatric-covid-vaccine/\"\u003eVinay Prasad\u003c/a\u003e, and \u003ca href=\"https://thehill.com/opinion/healthcare/558757-the-ill-advised-push-to-vaccinate-the-young/\"\u003eJay Bhattacharya\u003c/a\u003e.  Dr. Damania was very successful in getting his audience to trust these anti-vaccine, misinformation doctors, and so here we are.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Damania recently recorded a podcast titled \u003ca href=\"https://www.youtube.com/watch?v=1Xx3SbURvmo\"\u003eThe Truth About RFK Jr. (And Dr. Oz!) w/Dr. Paul Offit\u003c/a\u003e, in which they lamented the rise of RFK Jr.  Dr. Damania correctly said:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eI’m clutching my pearls about RFK. Because he’s he’s just a different level of denialist and and and dangerous, honestly, because it will erode the public’s trust and faith in the actual process of science.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eHe’s absolutely right.  However, Dr. Damania also said the following:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eThere’s a militantism right on in the science community sometimes about don’t, don’t brook any dissent. And, and I’m talking about like these Science Based Medicine guys and these guys. So they were at the time criticizing me for even talking to someone like a Vinay Prasad or someone because they, they, it wasn’t an absolutist sort of stance, right? And now they’re talking about like sane washing RFK, which I think is like not not a good thing, right?\u003c/p\u003e\n\n\n\n\u003cp\u003eBut the idea then that that we can’t be transparent in that way, that we have to speak in a certain way in order to make sure people go along with it. I, I just don’t know that I think people are smarter than that if given the opportunity.\u003c/p\u003e\n\n\n\n\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eDr. Damania was right about one thing, \u003ca href=\"https://sciencebasedmedicine.org/notadrill/\"\u003esanewashing RFK Jr\u003c/a\u003e. was definitely not a “good thing”. However, many of Dr. Damania’s most honored guests did exactly that. These doctors told the world that RFK Jr. was reliable and trustworthy and Dr. Damania told the world that these RFK Jr.-loving doctors were reliable and trustworthy. The many anti-vaccine comments on Dr. Damania’s recent video show that his listeners absorbed their pro-RFK Jr. message. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis is what he accomplished the past 4.5 years, and this is why we’ve criticized him. No one faulted Dr. Damania for “talking to someone like a Vinay Prasad.” I’d be \u003cem\u003ehappy\u003c/em\u003e to talk to Dr. Prasad about his \u003ca href=\"https://sciencebasedmedicine.org/overhyping-vaccines-wasnt-pro-vaccine-it-was-pro-stop-worrying-about-covid/\"\u003epandemic pronouncements\u003c/a\u003e. Instead we faulted Dr. Damania for praising, legitimizing, and amplifying someone like a Vinay Prasad. In contrast, we at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e accurately informed our readers that Dr. Prasad spread \u003ca href=\"https://sciencebasedmedicine.org/dr-vinay-prasad-opposed-the-pediatric-covid-vaccine-before-there-was-a-pediatric-covid-vaccine/\"\u003ecopious misinformation\u003c/a\u003e and repeatedly \u003ca href=\"https://www.youtube.com/watch?v=kfGpCz4Ng6I\u0026amp;t=75s\"\u003egushed over RFK Jr\u003c/a\u003e. Dr. Damania dunked on us for that reason.  We are not “transparent” in some mysterious way.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"1024\" height=\"545\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-1024x545.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-1024x545.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-480x256.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-200x106.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-768x409.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-1200x639.png 1200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-1300x692.png 1300w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26-650x346.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-26.png 1420w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"551\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-1024x551.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-1024x551.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-480x258.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-200x108.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-768x413.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-1200x646.png 1200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-1300x700.png 1300w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30-650x350.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-30.png 1419w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"1024\" height=\"541\" src=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-1024x541.png\" alt=\"\" srcset=\"https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-1024x541.png 1024w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-480x254.png 480w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-200x106.png 200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-768x406.png 768w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-1200x634.png 1200w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-1300x687.png 1300w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27-650x344.png 650w, https://sciencebasedmedicine.org/wp-content/uploads/2024/11/image-27.png 1417w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eDr. Damania did this.  We at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e did the opposite.\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eI think I can speak for everyone at \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e when I say, we believe that doctors should communicate accurate and \u003ca href=\"https://sciencebasedmedicine.org/reader-beware/\"\u003ecomplete\u003c/a\u003e information to their audience. That is being transparent, and I \u003ca href=\"https://sciencebasedmedicine.org/open-letter-2/\"\u003epreviously encouraged\u003c/a\u003e Dr. Damania to this. He declined. We also believe that doctors who praised RFK Jr. spread dangerous disinformation and have responsibility for bringing us to this dangerous moment. We further believe it was inappropriate for doctors to \u003ca href=\"https://sciencebasedmedicine.org/antivaxxdocs/\"\u003eprofit\u003c/a\u003e from their RFK Jr. boosterism.\u003c/p\u003e\n\n\n\n\u003cp\u003eDr. Damania disagrees with us about all this, and he is free to call us “absolutist” and “militant” for that reason. He can say we “don’t brook any dissent” and other content-free insults. However, he can’t point out an instance we’ve been wrong about anything, nor can he escape his role in paving the way for anti-vaxxers to gain power. He \u003cem\u003echose \u003c/em\u003eto glorify pro-RFK Jr. doctors, and \u003ca href=\"https://sciencebasedmedicine.org/ownit/\"\u003ehe owns the results\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf Dr. Damania feels I am wrong about this or anything else, I’d be happy to be on his podcast. Contrary to his dishonest depictions, I am perfectly willing to hear good-faith criticism. Dr. Damania can lay into me and let everyone know \u003cem\u003eexactly \u003c/em\u003ewhere he thinks I’ve erred. He can grill my on my writing. I am perfectly prepared to defend it or admit error if I got something wrong.\u003c/p\u003e\n\n\n\n\u003cp\u003eI am also perfectly prepared to calmly and politely remind Dr. Damania of \u003ca href=\"https://www.youtube.com/watch?v=Frmk5J_j2wI\" title=\"\"\u003e\u003cem\u003emany\u003c/em\u003e things\u003c/a\u003e he said about COVID. I will ask him why he glorified doctors who legitimized RFK Jr., while bashing doctors who warned about him. I will bring up the points I made in my article \u003ca href=\"https://sciencebasedmedicine.org/antivaxxdocs/\"\u003eAny Doctor Who Enabled RFK Jr. In Any Way Is Anti-Vaccine No Matter How They Describe Themselves\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eSomething tells me that while pro-RFK Jr. doctors will always be welcome on Dr. Damania’s podcast, I will not receive an invitation. \u003c/p\u003e\n\n\n\n\u003cp\u003eIt’s almost as if being unable to brook dissent isn’t \u003cem\u003emy \u003c/em\u003eproblem.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#375d585956435f5659195f584056455377594e425b56595058595219584550\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\n\n\t\n\t\t\t\n\t\n\u003c/article\u003e\n\t\u003cdiv\u003e\n\t\t\t\u003ch3\u003e\n\t\t\t\t\t\t\t\t\tPosted by\t\t\t\t\t\t\t\tJonathan Howard\u003c/h3\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eDr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;\u003c/p\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/div\u003e\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n            \n\n            \n\n\n    \u003c/main\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-11-29T03:00:00-05:00",
  "modifiedTime": "2024-11-29T17:42:42Z"
}
