{
  "id": "b560ee07-ce9a-44c1-ab05-b2066e400be1",
  "title": "Why These Millennia-Old Brains Are So Well Preserved",
  "link": "https://www.scientificamerican.com/article/why-these-millennia-old-brains-are-so-well-preserved/",
  "description": "Misfolded proteins may preserve postmortem brains well after other tissues have decayed",
  "author": "",
  "published": "Mon, 02 Dec 2024 13:00:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Kermit Pattison",
  "length": 12059,
  "excerpt": "Misfolded proteins may preserve postmortem brains well after other tissues have decayed",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "No part of our body is as perishable as the brain. Within minutes of losing its supply of blood and oxygen, our delicate neurological machinery begins to suffer irreversible damage. The brain is our most energy-greedy organ, and in the hours after death, its enzymes typically devour it from within. As cellular membranes rupture, the brain liquifies. Within days, microbes may consume the remnants in the stinky process of putrefaction. In a few years, the skull becomes just an empty cavity.In some cases, however, brains outlast all other soft tissues and remain intact for hundreds or thousands of years. Archaeologists have been mystified to discover naturally preserved brains in ancient graveyards, tombs, mass graves and even shipwrecks. Scientists at the University of Oxford published a study earlier this year that revealed that such brains are more common than previously recognized. By surveying centuries of scientific literature, researchers counted more than 4,400 cases of preserved brains that were up to 12,000 years old.“The brain just decays super quickly, and it’s really weird that we find it preserved,” says Alexandra Morton-Hayward, a molecular scientist at Oxford and lead author of the new study. “My overarching question is: Why on Earth is this possible? Why is it happening in the brain and no other organ?”On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.Such unusual preservation involves the “misfolding” of proteins—the cellular building blocks—and bears intriguing similarities to the pathologies that cause some neurodegenerative conditions.As every biology student learns, proteins are formed by chains of amino acids strung together like beads on a necklace. Every protein has a unique sequence of amino acids—there are 20 common types in the human body—that determines how it folds into its proper three-dimensional structure. But disturbances in the cellular environment can make folding go awry.The misfolding and clumping of brain proteins is the underlying cause of dozens of neurodegenerative disorders, including Alzheimer’s disease, Parkinson’s disease, amyotrophic lateral sclerosis (ALS) and the cattle illness bovine spongiform encephalopathy (BSE), also called mad cow disease. Now scientists are discovering that some misfolded proteins also can form clumps after death—and persist for hundreds or thousands of years.Only in recent years have scientists begun to seriously investigate these bizarre cases. A big breakthrough occurred in 2008 when archaeologists discovered the 2,500-year-old skull of a man who had been hanged, decapitated and dumped into an irrigation channel in Heslington, England. All other soft tissue had long since vanished, but investigators were stunned to find that the skull still contained a shrunken brain.A team of neuroscientists at University College London analyzed the ancient brain with a chemical analysis technique known as liquid chromatography–mass spectrometry and identified nearly 800 preserved proteins—the most ever discovered in an archaeological specimen. They concluded the ancient brain was preserved by the aggregation of proteins.When Protein Folding Goes WrongIn living organisms, protein folding is very context-dependent, and disturbances in the cellular environment can make it to go astray.A classic example is egg white. Normally, it is a transparent liquid, but when conditions change—as when an egg is fried or boiled—its proteins unravel, become entangled and form clumps. “That’s an aggregate,” says Ulrich Hartl, a leading researcher of protein-folding diseases at the Max Planck Institute of Biochemistry in Martinsried, Germany. “The same thing happens in your brain at a microscopic level.” Many diseases share a similar underlying mechanism: the protein abandons its healthy native state, unfurls and becomes entangled in a jumbled mass with other misfolded proteins.In diseases, the misfolded version becomes the protein’s most thermodynamically stable state, often making the aggregations irreversible. Hartl says he would not be surprised if a similar mechanism lay behind ancient brain preservation. “It’s fascinating that the brain can be preserved for such a long time after death,” he says. “The question of interest for me is: Does this reflect, in any way, what is going on during neurodegeneration?”Enduring BrainsThe discovery of the Heslington brain stimulated new research into brain preservation. The epicenter of this effort is the University of Oxford, and its lead investigator is Morton-Hayward, a former mortician turned molecular scientist. Now a Ph.D. candidate, she has gathered the world’s largest collection of ancient brains—more than 600 specimens up to 8,000 years old from locales such as the U.K., Belgium, Sweden, the U.S. and Peru—and she is analyzing how they were preserved. (The specimens were collected in accordance with Oxford’s research ethics guidelines.)To understand why these brains haven’t decayed, Morton-Hayward has peered at ancient brain tissue with powerful microscopes. She has placed mouse brains in jars of water or sediment to measure how they decompose over time. She has employed mass spectrometry to identify the proteins and amino acids that persist in the ancient brains. She has identified more than 400 preserved proteins. (The most abundant of these is myelin basic protein, which helps form the insulating sheath on our neural wiring.) She has sliced up ancient brain tissues and taken the samples to the Diamond Light Source synchrotron (the U.K.’s national particle accelerator) to pummel them with electrons traveling at almost the speed of light to understand the metals, minerals and molecules involved in the preservation process.Bodies can avoid decomposition via embalming, freezing, tanning or dehydration, but Morton-Hayward focuses on cases where brains are the only soft tissues remaining. Typically, the preserved brains come from waterlogged, low-oxygen burial environments such as low-lying graveyards or, in the case of the Heslington brain, an irrigation ditch. Human brains are composed of about 80 percent water, and the rest is roughly divided between proteins and lipids (fatty, waxy or oily compounds that are insoluble in water). The Oxford researchers suspect that this unique chemistry makes neural tissue especially amenable to preservation.Photo of preserved brain at Oxford University.Kermit PattisonMorton-Hayward believes the brains are preserved by a process called molecular cross-linking: remnants of brain proteins and degraded lipids form a spongy polymer that resists decay. This process may be catalyzed by metals, especially iron. The strong covalent bonds (in which electrons are shared) and high molecular weights of these cross-linked molecules may make the shrunken brains extremely durable and chemically resistant—and thus able to defy decomposition for centuries.In the ancient brains, Morton-Hayward does not find the threadlike fibrils known as amyloids that characterize other protein-folding conditions such as Alzheimer’s or Parkinson’s. “When I set out on this journey, I wondered whether we would be finding amyloid,” she says. “But it doesn’t seem that we are.” Instead, she says, amino acids from other broken-down proteins “cross-link by the same kinds of mechanisms—and that seems to be what we’re seeing in these ancient brains: aggregations but different kinds.”Nevertheless, she says, some aspects of brain preservation “closely parallel neurodegeneration.” In both the ancient brain tissues and in her mouse-brain-decay experiments, she has found evidence of oxidative damage, which creates the precursor ingredients to crosslinking. Such damage, caused by the dysregulation of iron, has been implicated in brain aging and an array of neurodegenerative diseases.“Maybe these processes are happening in life as we naturally age,” Morton-Hayward suggests, “and then, after death, they just carry on.”The new research has overturned an old assumption that brains preserve by turning to adipocere, or “grave wax,” which forms when body fats transform into a tallow-colored soaplike substance (often when corpses are submerged). Although rich in lipids, brains contain only small amounts of the triglyceride fats that typically turn into grave wax. “Adipocere forms in adipose tissue—that’s buttocks, arms, cheeks,” says Sonia O’Connor, an archaeologist and a pioneering researcher of ancient brains at the University of Bradford in England. “There is no adipose tissue in the brain. It’s the wrong chemistry.”But the new research shows that brains do have the right chemistry for postmortem cross-linking and protein aggregation—making our most perishable organ, paradoxically, also our most commonly preserved soft tissue.Eternal DisorderWhat makes these protein aggregations so enduring? Part of the answer might arise from an essential capability of the human brain—its plasticity.Until the beginning of this century, proteins were often described as fitting together in a predictable “lock and key” manner, but over the past two decades, it has become clear that some proteins are far more versatile. Proteins with intrinsically disordered regions, including intrinsically disordered proteins (IDPs), comprise about one third of all human proteins and can take many configurations and binding partners—a key attribute that lets them adapt their structures and functions. Myelin basic protein is a prime example of a disordered protein. This “molecular glue” in the fatty insulating sheath around neurons must be adaptable to forming unique neural circuitry in every individual and changing throughout life.Unlike normal proteins, IDPs lack a stable three-dimensional structure and can assume a wide array of shapes. They are notorious for their ability to bind with many partners. Unfortunately, this versatility makes disordered proteins vulnerable to misfolding, and they play prominent roles in pathologies such as Alzheimer’s, Parkinson’s, Huntington’s disease, ALS, prion diseases in humans and BSE in cattle.Vladimir Uversky, a biophysicist at the University of South Florida and a leading researcher of disordered proteins, read about the Heslington brain and immediately suspected IDPs played a role. When he analyzed the dataset of proteins extracted from the ancient brain, he confirmed that the most abundant preserved proteins were marked by high levels of disorder.He hypothesizes that IDPs act as “molecular mortar” by gluing molecules into rigid aggregates that act like “long-lasting preservatives.” Uversky calls this phenomenon the “stability of instability,” and it helps explain why protein aggregations become so persistent in neurodegenerative conditions—and even among the dead. Like the Oxford researchers, he believes that molecular cross-linking bolsters the durability of these remains.Another insidious trait of a protein aggregation is that it becomes a seed for growing pathologies. “It will suck in everything,” Uversky says. “The stuff will act as a black hole.”In life, we have defenses against protein misfolding, but they weaken as we age and cease entirely after death. In postmortem brains, cross-linking and aggregation can run amok, limited only by the laws of chemistry and physics.To be sure, the stubborn molecules in ancient brains are distinct from the protein pathologies seen in living patients. Even so, researchers are intrigued by eerie similarities. Many preserved brains come from what Morton-Hayward calls “sites of suffering”—such as mass graves, the graveyard of a Victorian workhouse and mental asylum and places of violent death. She suspects that oxidative stress during life may unleash molecular processes that continue in the grave.“In that case,” she says, “we could study aging on a much greater trajectory than just human lifespans.”",
  "image": "https://static.scientificamerican.com/dam/m/7c64d2d8ed3d7d56/original/brain_disintegrating_illustration.jpg?m=1732720871.354\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNo part of our body is as perishable as the brain. Within minutes of losing its supply of blood and oxygen, our delicate neurological machinery begins to suffer irreversible damage. The brain is our most energy-greedy organ, and in the hours after death, its enzymes typically devour it from within. As cellular membranes rupture, the brain liquifies. Within days, microbes may consume the remnants in the stinky process of putrefaction. In a few years, the skull becomes just an empty cavity.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn some cases, however, brains outlast all other soft tissues and remain intact for hundreds or thousands of years. Archaeologists have been mystified to discover naturally preserved brains in ancient graveyards, tombs, mass graves and even shipwrecks. Scientists at the University of Oxford published a study earlier this year that revealed that such brains are more common than previously recognized. By surveying centuries of scientific literature, researchers counted more than 4,400 cases of \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/38503334/\"\u003epreserved brains that were up to 12,000 years old\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“The brain just decays super quickly, and it’s really weird that we find it preserved,” says Alexandra Morton-Hayward, a molecular scientist at Oxford and lead author of the new study. “My overarching question is: Why on Earth is this possible? Why is it happening in the brain and no other organ?”\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSuch unusual preservation involves the “misfolding” of proteins—the cellular building blocks—and bears intriguing similarities to the pathologies that cause some neurodegenerative conditions.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAs every biology student learns, proteins are formed by chains of amino acids strung together like beads on a necklace. Every protein has a unique sequence of amino acids—there are 20 common types in the human body—that determines how it folds into its proper three-dimensional structure. But disturbances in the cellular environment can make folding go awry.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe misfolding and clumping of brain proteins is the underlying cause of dozens of neurodegenerative disorders, including Alzheimer’s disease, Parkinson’s disease, amyotrophic lateral sclerosis (ALS) and the cattle illness bovine spongiform encephalopathy (BSE), also called mad cow disease. Now scientists are discovering that some misfolded proteins also can form clumps after death—and persist for hundreds or thousands of years.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOnly in recent years have scientists begun to seriously investigate these bizarre cases. A big breakthrough occurred in 2008 when archaeologists discovered the \u003ca href=\"https://www.sciencedirect.com/science/article/abs/pii/S0305440311000690\"\u003e2,500-year-old skull\u003c/a\u003e of a man who had been hanged, decapitated and dumped into an irrigation channel in Heslington, England. All other soft tissue had long since vanished, but investigators were stunned to find that the skull still contained a shrunken brain.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eA team of neuroscientists at University College London analyzed the ancient brain with a chemical analysis technique known as liquid chromatography–mass spectrometry and identified nearly 800 preserved proteins—the most ever discovered in an archaeological specimen. They concluded the ancient brain was \u003ca href=\"https://royalsocietypublishing.org/doi/full/10.1098/rsif.2019.0775\"\u003epreserved by the aggregation of proteins\u003c/a\u003e.\u003c/p\u003e\u003ch2 id=\"when-protein-folding-goes-wrong\" data-block=\"sciam/heading\"\u003eWhen Protein Folding Goes Wrong\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn living organisms, protein folding is very context-dependent, and disturbances in the cellular environment can make it to go astray.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eA classic example is egg white. Normally, it is a transparent liquid, but when conditions change—as when an egg is fried or boiled—its proteins unravel, become entangled and form clumps. “That’s an aggregate,” says Ulrich Hartl, a leading researcher of protein-folding diseases at the Max Planck Institute of Biochemistry in Martinsried, Germany. “The same thing happens in your brain at a microscopic level.” Many diseases share a similar underlying mechanism: the protein abandons its healthy native state, unfurls and becomes entangled in a jumbled mass with other misfolded proteins.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn diseases, the misfolded version becomes the protein’s most thermodynamically stable state, often making the aggregations irreversible. Hartl says he would not be surprised if a similar mechanism lay behind ancient brain preservation. “It’s fascinating that the brain can be preserved for such a long time after death,” he says. “The question of interest for me is: Does this reflect, in any way, what is going on during neurodegeneration?”\u003c/p\u003e\u003ch2 id=\"enduring-brains\" data-block=\"sciam/heading\"\u003eEnduring Brains\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe discovery of the Heslington brain stimulated new research into brain preservation. The epicenter of this effort is the University of Oxford, and its lead investigator is Morton-Hayward, a former mortician turned molecular scientist. Now a Ph.D. candidate, she has gathered the world’s largest collection of ancient brains—more than 600 specimens up to 8,000 years old from locales such as the U.K., Belgium, Sweden, the U.S. and Peru—and she is analyzing how they were preserved. (The specimens were collected in accordance with Oxford’s research ethics guidelines.)\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTo understand why these brains haven’t decayed, Morton-Hayward has peered at ancient brain tissue with powerful microscopes. She has placed mouse brains in jars of water or sediment to measure how they decompose over time. She has employed mass spectrometry to identify the proteins and amino acids that persist in the ancient brains. She has identified more than 400 preserved proteins. (The most abundant of these is myelin basic protein, which helps form the insulating sheath on our neural wiring.) She has sliced up ancient brain tissues and taken the samples to the Diamond Light Source synchrotron (the U.K.’s national particle accelerator) to pummel them with electrons traveling at almost the speed of light to understand the metals, minerals and molecules involved in the preservation process.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBodies can avoid decomposition via embalming, freezing, tanning or dehydration, but Morton-Hayward focuses on cases where brains are the \u003ci\u003eonly\u003c/i\u003e soft tissues remaining. Typically, the preserved brains come from waterlogged, low-oxygen burial environments such as low-lying graveyards or, in the case of the Heslington brain, an irrigation ditch. Human brains are composed of about 80 percent water, and the rest is roughly divided between proteins and lipids (fatty, waxy or oily compounds that are insoluble in water). The Oxford researchers suspect that this unique chemistry makes neural tissue especially amenable to preservation.\u003c/p\u003e\u003cfigure data-block=\"contentful/image\"\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 0px)\" srcset=\"https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003cimg alt=\"Photo of preserved brain at Oxford University being held by gloved hands\" decoding=\"async\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=900\" width=\"2880\" height=\"1920\" srcset=\"https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/796d339d54685ec3/original/ancient_preserved_brain_cambridge.jpg?m=1732721100.301\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003cp\u003ePhoto of preserved brain at Oxford University.\u003c/p\u003e\u003cp\u003eKermit Pattison\u003c/p\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMorton-Hayward believes the brains are preserved by a process called molecular cross-linking: remnants of brain proteins and degraded lipids form a spongy polymer that resists decay. This process may be catalyzed by metals, especially iron. The strong covalent bonds (in which electrons are shared) and high molecular weights of these cross-linked molecules may make the shrunken brains extremely durable and chemically resistant—and thus able to defy decomposition for centuries.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn the ancient brains, Morton-Hayward does not find the threadlike fibrils known as amyloids that characterize other protein-folding conditions such as Alzheimer’s or Parkinson’s. “When I set out on this journey, I wondered whether we would be finding amyloid,” she says. “But it doesn’t seem that we are.” Instead, she says, amino acids from other broken-down proteins “cross-link by the same kinds of mechanisms—and that seems to be what we’re seeing in these ancient brains: aggregations but different kinds.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eNevertheless, she says, some aspects of brain preservation “closely parallel neurodegeneration.” In both the ancient brain tissues and in her mouse-brain-decay experiments, she has found evidence of oxidative damage, which creates the precursor ingredients to crosslinking. Such damage, caused by the dysregulation of iron, has been implicated in brain aging and an array of neurodegenerative diseases.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Maybe these processes are happening in life as we naturally age,” Morton-Hayward suggests, “and then, after death, they just carry on.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe new research has overturned an old assumption that brains preserve by turning to adipocere, or “grave wax,” which forms when body fats transform into a tallow-colored soaplike substance (often when corpses are submerged). Although rich in lipids, brains contain only small amounts of the triglyceride fats that typically turn into grave wax. “Adipocere forms in adipose tissue—that’s buttocks, arms, cheeks,” says Sonia O’Connor, an archaeologist and a pioneering researcher of ancient brains at the University of Bradford in England. “There is no adipose tissue in the brain. It’s the wrong chemistry.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut the new research shows that brains do have the right chemistry for postmortem cross-linking and protein aggregation—making our most perishable organ, paradoxically, also our most commonly preserved soft tissue.\u003c/p\u003e\u003ch2 id=\"eternal-disorder\" data-block=\"sciam/heading\"\u003eEternal Disorder\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWhat makes these protein aggregations so enduring? Part of the answer might arise from an essential capability of the human brain—its plasticity.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eUntil the beginning of this century, proteins were often described as fitting together in a predictable “lock and key” manner, but over the past two decades, it has become clear that some proteins are far more versatile. Proteins with intrinsically disordered regions, including intrinsically disordered proteins (IDPs), comprise about one third of all human proteins and can take many configurations and binding partners—a key attribute that lets them adapt their structures and functions. Myelin basic protein is a prime example of a disordered protein. This “molecular glue” in the fatty insulating sheath around neurons must be adaptable to forming unique neural circuitry in every individual and changing throughout life.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eUnlike normal proteins, IDPs lack a stable three-dimensional structure and can assume a wide array of shapes. They are notorious for their ability to bind with many partners. Unfortunately, this versatility makes disordered proteins vulnerable to misfolding, and they play prominent roles in pathologies such as Alzheimer’s, Parkinson’s, Huntington’s disease, ALS, prion diseases in humans and BSE in cattle.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eVladimir Uversky, a biophysicist at the University of South Florida and a leading researcher of disordered proteins, read about the Heslington brain and immediately suspected IDPs played a role. When he analyzed the dataset of proteins extracted from the ancient brain, he confirmed that the most abundant preserved proteins were marked by high levels of disorder.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eHe hypothesizes that IDPs act as “molecular mortar” by gluing molecules into rigid aggregates that act like “long-lasting preservatives.” Uversky calls this phenomenon the “stability of instability,” and it helps explain why protein aggregations become so persistent in neurodegenerative conditions—and even among the dead. Like the Oxford researchers, he believes that molecular cross-linking bolsters the durability of these remains.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAnother insidious trait of a protein aggregation is that it becomes a seed for growing pathologies. “It will suck in everything,” Uversky says. “The stuff will act as a black hole.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn life, we have defenses against protein misfolding, but they weaken as we age and cease entirely after death. In postmortem brains, cross-linking and aggregation can run amok, limited only by the laws of chemistry and physics.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTo be sure, the stubborn molecules in ancient brains are distinct from the protein pathologies seen in living patients. Even so, researchers are intrigued by eerie similarities. Many preserved brains come from what Morton-Hayward calls “sites of suffering”—such as mass graves, the graveyard of a Victorian workhouse and mental asylum and places of violent death. She suspects that oxidative stress during life may unleash molecular processes that continue in the grave.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“In that case,” she says, “we could study aging on a much greater trajectory than just human lifespans.”\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2024-12-02T08:00:00-05:00",
  "modifiedTime": null
}
