{
  "id": "ba33c9bc-d5b7-4a28-a875-ecb3f5cc8d87",
  "title": "Polar bears face higher risk of disease in a warming Arctic",
  "link": "https://www.bbc.com/news/articles/c1e7pl3evd0o",
  "description": "Climate change and sea ice loss leaves polar bears exposed to more diseases, research suggests.",
  "author": "",
  "published": "Wed, 23 Oct 2024 23:05:41 GMT",
  "source": "http://feeds.bbci.co.uk/news/science_and_environment/rss.xml",
  "categories": null,
  "byline": "Victoria Gill",
  "length": 2751,
  "excerpt": "Climate change and sea ice loss leaves polar bears exposed to more diseases, research suggests.",
  "siteName": "BBC News",
  "favicon": "https://www.bbc.com/bbcx/apple-touch-icon.png",
  "text": "As the Arctic warms, polar bears face a growing risk of contracting viruses, bacteria and parasites that they were less likely to encounter just 30 years ago, research has revealed.In a study that has provided clues about how polar bear disease could be linked to ice loss, scientists examined blood samples from bears in the Chukchi Sea - between Alaska and Russia.They analysed samples that had been gathered between 1987 and 1994, then collected and studied samples three decades later - between 2008 and 2017.The researchers found that significantly more of the recent blood samples contained chemical signals that bears had been infected with one of five viruses, bacteria or parasites.It is difficult to know, from blood samples, how the bears’ physical health was affected, but wildlife biologist Dr Karyn Rode from the US Geological Survey said it showed that something was changing throughout the whole Arctic ecosystem.The researchers tested for six different pathogens in total - viruses, bacteria or parasites that are primarily associated with land-based animals but have been recorded before in marine animals, including species that polar bears hunt.The study covered three decades, Dr Rode said, “when there had been a substantial loss of sea ice and there’s been increased land use in [this population of polar bears]\".“So we wanted to know if exposure had changed - particularly for some of these pathogens that we think are primarily land-oriented.”The five pathogens, as disease-causing agents are collectively called, that have become more common in polar bears, are two parasites that cause toxoplasmosis and neosporosis, two types of bacteria that cause rabbit fever and brucellosis, and the virus that causes canine distemper.\"Bears in general are pretty robust to disease,\" explained Dr Rode. \"It's not typically been known to affect bear population, but I think what it just highlights is that things [in the Arctic] are changing.\"In the US, polar bears are classified as a threatened species; scientists say the biggest threat to their future is the continuing loss of sea ice habitat, which they depend on as a platform from which to pounce on their marine prey.Previous research using collar cameras on bears has shown that, as they spend more of the year on land - when there is no available sea ice to hunt from - the bears are unable to find enough calories. Dr Rode explained that polar bears are top predators: “Our study suggested that they're getting their exposure to some pathogens primarily through their prey species.“So what we saw as changes in pathogen exposure for polar bears is indicative of changes that other species are also experiencing.”The findings are published in the scientific journal PLOS One.",
  "image": "https://ichef.bbci.co.uk/news/1024/branded_news/787f/live/89155350-911d-11ef-88b8-8b00cbc9d4aa.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eAs the Arctic warms, polar bears face a growing risk of contracting viruses, bacteria and parasites that they were less likely to encounter just 30 years ago, research has revealed.\u003c/p\u003e\u003cp\u003eIn a study that has provided clues about how polar bear disease could be linked to ice loss, scientists examined blood samples from bears in the Chukchi Sea - between Alaska and Russia.\u003c/p\u003e\u003cp\u003eThey analysed samples that had been gathered between 1987 and 1994, then collected and studied samples three decades later - between 2008 and 2017.\u003c/p\u003e\u003cp\u003eThe researchers found that significantly more of the recent blood samples contained chemical signals that bears had been infected with one of five viruses, bacteria or parasites.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIt is difficult to know, from blood samples, how the bears’ physical health was affected, but wildlife biologist Dr Karyn Rode from the US Geological Survey said it showed that something was changing throughout the whole Arctic ecosystem.\u003c/p\u003e\u003cp\u003eThe researchers tested for six different pathogens in total - viruses, bacteria or parasites that are primarily associated with land-based animals but have been recorded before in marine animals, including species that polar bears hunt.\u003c/p\u003e\u003cp\u003eThe study covered three decades, Dr Rode said, “when there had been a substantial loss of sea ice and there’s been increased land use in [this population of polar bears]\u0026#34;.\u003c/p\u003e\u003cp\u003e“So we wanted to know if exposure had changed - particularly for some of these pathogens that we think are primarily land-oriented.”\u003c/p\u003e\u003cp\u003eThe five pathogens, as disease-causing agents are collectively called, that have become more common in polar bears, are two parasites that cause toxoplasmosis and neosporosis, two types of bacteria that cause rabbit fever and brucellosis, and the virus that causes canine distemper.\u003c/p\u003e\u003cp\u003e\u0026#34;Bears in general are pretty robust to disease,\u0026#34; explained Dr Rode. \u0026#34;It\u0026#39;s not typically  been known to affect bear population, but I think what it just highlights is that things [in the Arctic] are changing.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv data-component=\"text-block\"\u003e\u003cp\u003eIn the US, polar bears are classified as a threatened species; scientists say the biggest threat to their future is the continuing loss of sea ice habitat, which they depend on as a platform from which to pounce on their marine prey.\u003c/p\u003e\u003cp\u003ePrevious research using collar cameras on bears has shown that, as they spend more of the year on land - when there is no available sea ice to hunt from -\u003ca target=\"_self\" href=\"https://www.bbc.co.uk/news/science-environment-68253819\"\u003e the bears are unable to find enough calories. \u003c/a\u003e\u003c/p\u003e\u003cp\u003eDr Rode explained that polar bears are top predators: “Our study suggested that they\u0026#39;re getting their exposure to some pathogens primarily through their prey species.\u003c/p\u003e\u003cp\u003e“So what we saw as changes in pathogen exposure for polar bears is indicative of changes that other species are also experiencing.”\u003c/p\u003e\u003cp\u003eThe findings are \u003ca target=\"_blank\" href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310973\"\u003epublished in the scientific jou\u003c/a\u003e\u003ca target=\"_blank\" href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310973\"\u003ernal PLOS One\u003c/a\u003e. \u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-23T23:05:41.442Z",
  "modifiedTime": null
}
