{
  "id": "c10815fa-6bec-4ed0-b1a0-5420e63c181c",
  "title": "Trump’s Energy Pick, a Fracking Executive, Could Stymie Renewable Development",
  "link": "https://www.scientificamerican.com/article/trumps-energy-pick-a-fracking-executive-could-stymie-renewable-development/",
  "description": "Chris Wright, CEO of a fracking services company and Trump’s nominee to lead the Department of Energy, has said “there is no climate crisis”",
  "author": "",
  "published": "Mon, 18 Nov 2024 17:30:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Brian Dabbs",
  "length": 8014,
  "excerpt": "Chris Wright, CEO of a fracking services company and Trump’s nominee to lead the Department of Energy, has said “there is no climate crisis”",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "CLIMATEWIRE | President-elect Donald Trump's pick for Energy secretary signals a boost for U.S. fossil fuels.Trump tapped Chris Wright, the CEO of fracking services company Liberty Energy, for the position this weekend. The oil and gas executive is a passionate proselytizer for fossil fuels, often touting the benefits of energy access while downplaying the threats posed by climate change.Wright is celebrated in the oil and gas sector, where executives anticipate he will clear the way for more American exports of liquefied natural gas. The country's LNG exports have already skyrocketed in recent years, but the Department of Energy paused approvals for new permits earlier this year to assess the climate and economic impacts of the surge.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.“We look forward to working with him once confirmed to bolster American geopolitical strength by lifting DOE’s pause on LNG export permits and ensuring the open access of American energy for our allies around the world,” American Petroleum Institute CEO Mike Sommers said Saturday on X.On the campaign trail, Trump repeatedly argued that the clean energy transition is increasing inflation (though analysts say that's only partially accurate at best). He vowed to ramp up production of U.S. “liquid gold,” even as the U.S. produces record volumes of oil and gas.If confirmed as head of the Department of Energy, Wright would exercise a limited regulatory role over fossil fuels. Other agencies wield much more influence: for example, the Interior Department oversees drilling leases and EPA regulates industry emissions.But Wright would be tasked with approving or denying LNG exports, which environmentalists decry as a major threat to global temperature rise. Some controversial LNG projects that could get the go-ahead under Wright include the sprawling CP2 project in Louisiana and Alaska's $43 billion LNG project.“He’ll be hell-bent on abusing his power to prolong the use of deadly fossil fuels and give his corporate polluter executive friends a rubber stamp for the unfettered buildout of LNG exports,” said Sierra Club Executive Director Ben Jealous in a statement. “Chris Wright is not merely unqualified, he’s a direct threat to our future and the planet’s.”Wright was a donor to the Trump campaign and reportedly met with the president-elect earlier this year, according to The Wall Street Journal. Last week, he gained the backing of fossil fuel magnate and Trump ally Harold Hamm.The Wright nomination comes in the wake of Trump’s decision to nominate North Dakota Gov. Doug Burgum as Interior secretary. The president-elect also put Burgum in charge of a new informal agency called the National Energy Council, which Trump said in a statement would “oversee the path to U.S. ENERGY DOMINANCE.\"“We are excited to work with these two gentlemen to grow America’s standing as the pre-eminent global oil and natural gas producer,” said Kathleen Sgamma, president of the fossil fuel group Western Energy Alliance. “Not only is their agenda good for American jobs, economic growth, and prosperity, but for reducing energy poverty across the globe.”Wright was a major driver of technological development in fracking, which is often credited with boosting U.S. fossil fuel production. He has often argued that the benefit of energy access outweighs the impact of planet-warming emissions.Wright has said “there is no climate crisis” and labeled net-zero emissions goals “neither achievable nor humane.”“Any negative impacts of climate change are clearly overwhelmed by the benefits of increasing energy consumption,” he said last year. “We have seen no increase in the frequency or intensity of hurricanes, tornadoes, droughts or floods despite endless fear mongering of the media, politicians and activists.”Scientists overwhelmingly agree that burning fossil fuels drives climate change, which is increasing the frequency of disasters like wildfires, hurricanes and heat waves. The U.S. government's National Climate Assessment also says greenhouse gas emissions are increasing \"the frequency and severity of many types of extreme weather events.\"Methane emissions, which are linked to gas production and LNG exports, are a major short-term driver of climate change. A 2021 National Renewable Energy Laboratory study reviewing existing research found that the total life-cycle emissions of electricity generated from natural gas are 11 times higher than solar and 37 times higher than wind.Jean Su, director of the Center for Biological Diversity's Energy Justice Program, called on other countries to “reject American fracked exports and instead embrace the renewable future we desperately need.”“Picking someone like Chris Wright is a clear sign that Trump wants to turn the U.S. into a pariah petrostate,” said Su.All of the above?Trump’s energy picks, while controversial, aren’t expected to generate the level of opposition predicted for selections like former Rep. Matt Gaetz (R-Fla.) as attorney general or Pete Hegseth, a Fox News personality, as defense secretary. Both face sexual assault allegations.Atop DOE, Wright would be tasked with approving billions of dollars of loans and grants for renewable energy, carbon capture, direct air capture and hydrogen grants — all of which Congress authorized in the 2021 bipartisan infrastructure law. DOE also regulates efficiency levels for home appliances, directs the national laboratories, maintains the nuclear stockpile, cleans up nuclear weapons plants and broadly oversees energy policy.Meanwhile, Trump has laid out grand goals for the new Burgum-led National Energy Council.“This team will drive U.S. Energy Dominance, which will drive down Inflation, win the A.I. arms race with China (and others), and expand American Diplomatic Power to end Wars all across the World,” he said.Burgum has supported carbon capture and hydrogen energy as decarbonization solutions for the power and industrial sectors. Both industries have seen billions of dollars of federal support as part of the Biden administration's climate agenda.\"Clean hydrogen can play a major role in our all-of-the-above energy approach,” he said last year.But the inauguration of Trump will mark a dramatic shift in U.S. strategy on climate change and global multilateralism. He’s expected to abandon the Paris climate agreement — as he did in his first term.Meanwhile, on Sunday, President Joe Biden toured the Amazon rainforest on route to the G20 summit in Rio de Janeiro, Brazil, while U.S. leaders met with global counterparts in Baku, Azerbaijan for a new round of climate talks. Biden pledged U.S. funding for the Amazon Fund, which prevents deforestation.Biden has vowed to put the U.S. on track to eliminate greenhouse gas emissions in the power sector by 2035 and economywide by mid-century.“The fight against climate change has been a defining cause of President Biden’s leadership and presidency,” the White House said Sunday. “These past four years, the Administration has created a bold new playbook that has turned tackling the climate crisis into an enormous economic opportunity.”Environmentalists are vowing to continue the fight against climate change into the Trump administration.“The clean energy economy is here to stay, and we are all in to defend both bedrock environmental laws and the recent climate progress that is creating jobs and lowering energy costs for families across the country,” said Tiernan Sittenfeld, senior vice president of government affairs at the League of Conservation Voters.Reporter Timothy Cama contributed to this report.This story also appears in Energywire.Reprinted from E\u0026E News with permission from POLITICO, LLC. Copyright 2024. E\u0026E News provides essential news for energy and environment professionals.",
  "image": "https://static.scientificamerican.com/dam/m/1cae5f29f4ec5cf3/original/Chris_Wright_speaking.jpg?m=1731947794.729\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003cb\u003eCLIMATEWIRE |\u003c/b\u003e President-elect Donald Trump\u0026#39;s pick for Energy secretary signals a boost for U.S. fossil fuels.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTrump tapped Chris Wright, the CEO of fracking services company Liberty Energy, for the position this weekend. The oil and gas executive is a passionate proselytizer for fossil fuels, often touting the benefits of energy access while downplaying the threats posed by climate change.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWright is \u003ca href=\"https://www.eenews.net/articles/trump-weighs-fearless-fracking-advocate-for-top-energy-post/\"\u003ecelebrated in the oil and gas sector\u003c/a\u003e, where executives anticipate he will clear the way for more American exports of liquefied natural gas. The country\u0026#39;s LNG exports have already skyrocketed in recent years, but the Department of Energy paused approvals for new permits earlier this year to assess the climate and economic impacts of the surge.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“We look forward to working with him once confirmed to bolster American geopolitical strength by lifting DOE’s pause on LNG export permits and ensuring the open access of American energy for our allies around the world,” American Petroleum Institute CEO Mike Sommers \u003ca href=\"https://x.com/mj_sommers/status/1857912593102286897?s=42\"\u003esaid Saturday on X\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eOn the campaign trail, Trump repeatedly argued that the clean energy transition is increasing inflation (though analysts say that\u0026#39;s only \u003ca href=\"https://subscriber.politicopro.com/newsletter/2024/07/17/why-trump-is-talking-about-your-electric-bill-00169041\"\u003epartially accurate at best\u003c/a\u003e). He vowed to ramp up production of U.S. “liquid gold,” even as the U.S. produces record volumes of oil and gas.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIf confirmed as head of the Department of Energy, Wright would exercise a limited regulatory role over fossil fuels. Other agencies wield much more influence: for example, the Interior Department oversees drilling leases and EPA regulates industry emissions.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut Wright would be tasked with approving or denying LNG exports, which environmentalists decry as a major threat to global temperature rise. Some controversial LNG projects that could get the go-ahead under Wright include the sprawling CP2 project in Louisiana and Alaska\u0026#39;s $43 billion LNG project.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“He’ll be hell-bent on abusing his power to prolong the use of deadly fossil fuels and give his corporate polluter executive friends a rubber stamp for the unfettered buildout of LNG exports,” said Sierra Club Executive Director Ben Jealous in a statement. “Chris Wright is not merely unqualified, he’s a direct threat to our future and the planet’s.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWright was a donor to the Trump campaign and reportedly met with the president-elect earlier this year, \u003ca href=\"https://www.wsj.com/politics/elections/donald-trump-energy-policy-oil-gas-donors-1cbc98f6\"\u003eaccording to \u003ci\u003eThe Wall Street Journal\u003c/i\u003e\u003c/a\u003e. Last week, he gained the backing of fossil fuel magnate and Trump ally Harold Hamm.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe Wright nomination comes in the wake of Trump’s decision to nominate North Dakota Gov. Doug Burgum as Interior secretary. The president-elect also put Burgum in \u003ca href=\"https://subscriber.politicopro.com/article/eenews/2024/11/15/trump-taps-burgum-to-lead-energy-council-interior-department-00189915\"\u003echarge of a new informal agency\u003c/a\u003e called the National Energy Council, which Trump said in a statement would “oversee the path to U.S. ENERGY DOMINANCE.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“We are excited to work with these two gentlemen to grow America’s standing as the pre-eminent global oil and natural gas producer,” said Kathleen Sgamma, president of the fossil fuel group Western Energy Alliance. “Not only is their agenda good for American jobs, economic growth, and prosperity, but for reducing energy poverty across the globe.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWright was a major driver of technological development in fracking, which is often credited with boosting U.S. fossil fuel production. He has often argued that the benefit of energy access outweighs the impact of planet-warming emissions.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eWright has said “there is no climate crisis” and labeled net-zero emissions goals “neither achievable nor humane.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Any negative impacts of climate change are clearly overwhelmed by the benefits of increasing energy consumption,” \u003ca href=\"https://www.linkedin.com/posts/chris-wright-b8370a17b_energysobriety-activity-7021514919787319298-xpzQ/?utm_source=share\u0026amp;utm_medium=member_desktop\"\u003ehe said last year\u003c/a\u003e. “We have seen no increase in the frequency or intensity of hurricanes, tornadoes, droughts or floods despite endless fear mongering of the media, politicians and activists.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eScientists overwhelmingly agree that burning fossil fuels drives climate change, which is increasing the frequency of disasters like \u003ca href=\"https://subscriber.politicopro.com/article/eenews/2024/08/14/climate-change-worsened-last-years-wildfire-season-00173862\"\u003ewildfires\u003c/a\u003e, \u003ca href=\"https://subscriber.politicopro.com/article/eenews/2024/10/09/climate-change-worsened-helenes-historic-winds-and-rain-00182913\"\u003ehurricanes\u003c/a\u003e and \u003ca href=\"https://subscriber.politicopro.com/article/eenews/2024/09/18/summer-is-getting-hotter-billions-of-people-are-at-risk-00179663\"\u003eheat waves\u003c/a\u003e. The U.S. government\u0026#39;s \u003ca href=\"https://nca2023.globalchange.gov/chapter/2/\"\u003eNational Climate Assessment\u003c/a\u003e also says greenhouse gas emissions are increasing \u0026#34;the frequency and severity of many types of extreme weather events.\u0026#34;\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMethane emissions, which are linked to gas production and LNG exports, are a major short-term driver of climate change. \u003ca href=\"https://www.nrel.gov/docs/fy21osti/80580.pdf\"\u003eA 2021 National Renewable Energy Laboratory study\u003c/a\u003e reviewing existing research found that the total life-cycle emissions of electricity generated from natural gas are 11 times higher than solar and 37 times higher than wind.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eJean Su, director of the Center for Biological Diversity\u0026#39;s Energy Justice Program, called on other countries to “reject American fracked exports and instead embrace the renewable future we desperately need.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Picking someone like Chris Wright is a clear sign that Trump wants to turn the U.S. into a pariah petrostate,” said Su.\u003c/p\u003e\u003ch2 data-block=\"sciam/heading\"\u003eAll of the above?\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTrump’s energy picks, while controversial, aren’t expected to generate the level of opposition predicted for selections like former Rep. Matt Gaetz (R-Fla.) as attorney general or Pete Hegseth, a Fox News personality, as defense secretary. Both face sexual assault allegations.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eAtop DOE, Wright would be tasked with approving billions of dollars of loans and grants for renewable energy, carbon capture, direct air capture and hydrogen grants — all of which Congress authorized in the 2021 bipartisan infrastructure law. DOE also regulates efficiency levels for home appliances, directs the national laboratories, maintains the nuclear stockpile, cleans up nuclear weapons plants and broadly oversees energy policy.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMeanwhile, Trump has laid out grand goals for the new Burgum-led National Energy Council.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“This team will drive U.S. Energy Dominance, which will drive down Inflation, win the A.I. arms race with China (and others), and expand American Diplomatic Power to end Wars all across the World,” he said.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBurgum has supported carbon capture and hydrogen energy as decarbonization solutions for the power and industrial sectors. Both industries have seen billions of dollars of federal support as part of the Biden administration\u0026#39;s climate agenda.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u0026#34;Clean hydrogen can play a major role in our all-of-the-above energy approach,” he said last year.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut the inauguration of Trump will mark a dramatic shift in U.S. strategy on climate change and global multilateralism. He’s expected to abandon the Paris climate agreement — as he did in his first term.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eMeanwhile, on Sunday, President Joe Biden toured the Amazon rainforest on route to the G20 summit in Rio de Janeiro, Brazil, while U.S. leaders met with global counterparts in Baku, Azerbaijan for a new round of climate talks. Biden pledged U.S. funding for the Amazon Fund, which prevents deforestation.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBiden has vowed to put the U.S. on track to eliminate greenhouse gas emissions in the power sector by 2035 and economywide by mid-century.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“The fight against climate change has been a defining cause of President Biden’s leadership and presidency,” the White House said Sunday. “These past four years, the Administration has created a bold new playbook that has turned tackling the climate crisis into an enormous economic opportunity.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eEnvironmentalists are vowing to continue the fight against climate change into the Trump administration.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“The clean energy economy is here to stay, and we are all in to defend both bedrock environmental laws and the recent climate progress that is creating jobs and lowering energy costs for families across the country,” said Tiernan Sittenfeld, senior vice president of government affairs at the League of Conservation Voters.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eReporter Timothy Cama contributed to this report.\u003c/i\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eThis story also appears in \u003c/i\u003eEnergywire\u003ci\u003e.\u003c/i\u003e\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eReprinted from \u003c/i\u003e\u003ca href=\"https://www.eenews.net/\"\u003e\u003ci\u003eE\u0026amp;E News\u003c/i\u003e\u003c/a\u003e\u003ci\u003e with permission from POLITICO, LLC. Copyright 2024. E\u0026amp;E News provides essential news for energy and environment professionals.\u003c/i\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-18T12:30:00-05:00",
  "modifiedTime": null
}
