{
  "id": "c4e83308-0510-4973-8cc8-aa8084b934a1",
  "title": "Who is on RFK Jr’s new vaccine panel — and what will they do?",
  "link": "https://www.nature.com/articles/d41586-025-01852-z",
  "description": "",
  "author": "Heidi Ledford",
  "published": "2025-06-12",
  "source": "https://www.nature.com/nature.rss",
  "categories": null,
  "byline": "Fieldhouse, Rachel",
  "length": 7514,
  "excerpt": "Critics fear that anti-vaccine leader’s picks for crucial committee will be a ‘disaster for public health’. Critics fear that anti-vaccine leader’s picks for crucial committee will be a ‘disaster for public health’.",
  "siteName": "",
  "favicon": "https://www.nature.com/static/images/favicons/nature/apple-touch-icon-f39cb19454.png",
  "text": "Eight new members have been appointed to the US powerful Advisory Committee on Immunization Practices, which plays a large part in the vaccines taken by US children and adults. Credit: Joseph Prezioso/AFP/GettyAn emergency-room doctor, critics of COVID-19 vaccines and an obstetrician who advises a supplement company are among the advisers handpicked by vaccine skeptic Robert F. Kennedy Jr, the head of the US Department of Health and Human Services (HHS), to provide advice on vaccines to the federal government.Kennedy announced his new roster for the influential Advisory Committee on Immunization Practices (ACIP) on 11 June — just two days after he fired all 17 of its previous members and accused the ACIP of “malevolent malpractice”. The ACIP advises US public-health officials as to who should receive approved vaccines, and when. Those recommendations are then often used to guide whether public and private health-insurance programmes will pay for the shots.Kennedy has pledged that the ACIP will re-evaluate the vaccine “schedule” for children — the list of which vaccines children should get and when they should get them. This week’s shakeup of the committee is “a major step towards restoring public trust in vaccines,” Kennedy said in a post on the social media platform, X.Will RFK Jr’s vaccine agenda make America contagious again?Several of the new ACIP members have expressed public support for vaccines. But a number of them have also expressed scepticism; one serves on the board of an anti-vaccination organization, and a second has been a prominent sceptic of the COVID-19 vaccines on social media. As first reported by the biomedical news outlet STAT, Kennedy included four of the new committee members in the dedication to his 2021 book The Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health.“This is a disaster for public health,” says Adam Ratner, a paediatric infectious diseases physician in New York City. “It has the potential to set us back decades.” The HHS did not respond to a request for comment before publication.Far-reaching implicationsInfectious-disease specialists worry about the implications of the ACIP potentially voting to recommend fewer vaccines or fewer doses than are currently advised. Paul Offit, an infectious-diseases paediatrician at the Children’s Hospital of Philadelphia and co-inventor of a rotavirus vaccine who served on the ACIP from 1998 to 2003, says insurers don’t have to cover vaccines that aren’t recommended by the ACIP. And “doctors or pharmacists who give vaccines may feel that they would be liable for giving that vaccine”, he adds.Even those who can pay for vaccines out of pocket might find them harder to get without an ACIP recommendation, says Arthur Reingold, an epidemiologist at the University of California, Berkeley, because overall demand for the shots will decrease. That, in turn, could lead some pharmacies to stop stocking them.Offit notes that at the ACIP’s next meeting, which starts 25 June, the panel will decide whether to recommend vaccines for COVID-19, the human papillomavirus, meningococcal disease and RSV. “These are established vaccines, and we’re voting on them?” Offit says. “The entire childhood and adult immunisation schedule is on the table.”How to speak to a vaccine sceptic: research reveals what worksKennedy has criticized the ACIP for what he says are rampant conflicts of interest among its members. On 12 June, the biopharma news outlet Endpoints News reported that two newly named ACIP members, Robert Malone and Martin Kulldorff, have received payment for serving as expert witnesses in lawsuits against pharmaceutical company Merck over two of its vaccines. Malone said on X that this work ended six years ago.Kennedy has also said that past committee members did not demand what he considers to be adequate safety trials with control groups that received a placebo, before recommending vaccines.But many of the vaccine studies included placebo controls, Ratner says, unless it was unethical to conduct the trial with one. And Reingold, who has served on the ACIP in the past, says that the committee has strict policies regarding conflicts of interest and that committee members must recuse themselves from any vote that might pose a conflict. “The issue of potential conflicts of interest has been radically overblown and unfairly called into question the objectivity of this panel,” he says.Offit says several independent groups have reviewed previous ACIP members and found no conflicts of interest. “Now, the conflict of interest is real because these folks are indebted to RFK Jr, who just gave them this position,” he says.Vetting processResearchers are also concerned about the loss of expertise. The committee’s new lineup is “disturbing”, says Nancy Bennett, a public-health specialist at the University of Rochester Medical Center in New York.In the past, members were nominated and then vetted by staff at the US Centers for Disease Control (CDC) before being sent to the head of the CDC and, finally, the head of the HHS for approval. Bennett says the vetting process sometimes took years. “The ACIP was meant to be composed of people with deep expertise in the area,” Ratner says. “That’s what we have lost.”Joseph HibbelnHibbeln is a psychiatrist and neuroscientist who once worked at the US National Institutes of Health. His recent papers1 have focused on the connection between nutrition and various disorders, including mental-health conditions, and his LinkedIn profile states that twenty-first-century diets are contributing to “inadequate brain nutrients and are likely contributing to the high burden of mental illnesses worldwide”. A search of PubMed, a database of biomedical papers, did not turn up any papers he has authored about vaccines or infectious disease. He did not respond to a request for comment.Martin KulldorffKulldorff is a Swedish epidemiologist and senior scholar at the Brownstone Institute, a think tank based in West Hartford, Connecticut, that formed “to provide an independent voice for personal liberty” and to oppose lockdown policies instituted by public officials during the COVID-19 pandemic. Along with Jayanta Bhattacharya, the current head of the US National Institutes of Health, Kulldorff wrote the Great Barrington Declaration in 2020, which advocated against COVID-19 lockdowns except for vulnerable populations, and drew much pushback from the medical community.Last year, Kulldorff wrote in City Journal that he was fired from Harvard University in Cambridge, Massachusetts, for refusing a COVID-19 vaccine even though he already had immunity from being infected. He also wrote that “vaccines are a vital medical invention, allowing people to obtain immunity without the risk that comes from getting sick,” but suggested that trials of COVID-19 vaccines early in the pandemic were not properly designed. Kulldorff did not respond to Nature’s request for comment.Retsef LeviLevi is a professor of operations management at the Massachusetts Institute of Technology in Cambridge. He has published several papers on COVID-19, including one2 expressing concerns about side effects of the COVID-19 vaccines. In a post on social-media platform X in 2023, Levi said, “The evidence is mounting and indisputable that MRNA vaccines cause serious harm including death, especially among young people. We have to stop giving them immediately!” Levi did not respond to a request for comment.Robert Malone",
  "image": "https://media.nature.com/lw1200/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_51093836.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-test=\"access-teaser\"\u003e \u003cfigure\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://media.nature.com/lw767/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_51093836.jpg?as=webp 767w, https://media.nature.com/lw319/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_51093836.jpg?as=webp 319w\" sizes=\"(max-width: 319px) 319px, (min-width: 1023px) 100vw,  767px\"/\u003e\u003cimg alt=\"A close-up of a person giving a child a vaccine in the arm\" loading=\"lazy\" src=\"https://media.nature.com/lw767/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_51093836.jpg\"/\u003e\u003cfigcaption\u003e\u003cp\u003e\u003cspan\u003eEight new members have been appointed to the US powerful Advisory Committee on Immunization Practices, which plays a large part in the vaccines taken by US children and adults. \u003c/span\u003e\u003cspan\u003eCredit: Joseph Prezioso/AFP/Getty\u003c/span\u003e\u003c/p\u003e\u003c/figcaption\u003e\u003c/picture\u003e\u003c/figure\u003e\u003cp\u003eAn emergency-room doctor, critics of \u003ca href=\"https://www.nature.com/articles/d41586-023-00220-z\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-023-00220-z\" data-track-category=\"body text link\"\u003eCOVID-19 vaccines\u003c/a\u003e and an obstetrician who advises a supplement company are among the advisers handpicked by \u003ca href=\"https://www.nature.com/articles/d41586-025-00439-y\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-025-00439-y\" data-track-category=\"body text link\"\u003evaccine skeptic Robert F. Kennedy Jr\u003c/a\u003e, the head of the US Department of Health and Human Services (HHS), to provide advice on vaccines to the federal government.\u003c/p\u003e\u003cp\u003eKennedy announced his new roster for the influential Advisory Committee on Immunization Practices (ACIP) on 11 June — just two days after he fired all 17 of its previous members and accused the ACIP of “malevolent malpractice”. The ACIP advises US public-health officials as to who should receive approved vaccines, and when. Those recommendations are then often used to guide whether public and private health-insurance programmes will pay for the shots.\u003c/p\u003e\u003cp\u003eKennedy has pledged that the ACIP will re-evaluate the vaccine “schedule” for children — the list of which vaccines children should get and when they should get them. This week’s shakeup of the committee is “a major step towards restoring public trust in vaccines,” Kennedy said in a post on the social media platform, X.\u003c/p\u003e\u003carticle data-label=\"Related\"\u003e\u003ca href=\"https://www.nature.com/articles/d41586-025-00709-9\" data-track=\"click\" data-track-label=\"recommended article\"\u003e\u003cimg alt=\"\" src=\"https://media.nature.com/w400/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_50740396.jpg\"/\u003e\u003cp\u003eWill RFK Jr’s vaccine agenda make America contagious again?\u003c/p\u003e\u003c/a\u003e\u003c/article\u003e\u003cp\u003eSeveral of the new ACIP members have expressed public support for vaccines. But a number of them have also expressed scepticism; one serves on the board of an anti-vaccination organization, and a second has been a prominent sceptic of the COVID-19 vaccines on social media. As \u003ca href=\"https://www.statnews.com/2025/06/11/rfk-jr-names-new-acip-members-replaces-cdc-vaccine-experts-he-just-fired/\" data-track=\"click\" data-label=\"https://www.statnews.com/2025/06/11/rfk-jr-names-new-acip-members-replaces-cdc-vaccine-experts-he-just-fired/\" data-track-category=\"body text link\"\u003efirst reported by the biomedical news outlet \u003ci\u003eSTAT\u003c/i\u003e\u003c/a\u003e, Kennedy included four of the new committee members in the dedication to his 2021 book \u003ci\u003eThe Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health\u003c/i\u003e.\u003c/p\u003e\u003cp\u003e“This is a disaster for public health,” says Adam Ratner, a paediatric infectious diseases physician in New York City. “It has the potential to set us back decades.” The HHS did not respond to a request for comment before publication.\u003c/p\u003e\u003ch2\u003eFar-reaching implications\u003c/h2\u003e\u003cp\u003eInfectious-disease specialists worry about the implications of the ACIP potentially voting to recommend fewer vaccines or fewer doses than are currently advised. Paul Offit, an infectious-diseases paediatrician at the Children’s Hospital of Philadelphia and co-inventor of a rotavirus vaccine who served on the ACIP from 1998 to 2003, says insurers don’t have to cover vaccines that aren’t recommended by the ACIP. And “doctors or pharmacists who give vaccines may feel that they would be liable for giving that vaccine”, he adds.\u003c/p\u003e\u003cp\u003eEven those who can pay for vaccines out of pocket might find them harder to get without an ACIP recommendation, says Arthur Reingold, an epidemiologist at the University of California, Berkeley, because overall demand for the shots will decrease. That, in turn, could lead some pharmacies to stop stocking them.\u003c/p\u003e\u003cp\u003eOffit notes that at the ACIP’s next meeting, which starts 25 June, the panel will decide whether to recommend vaccines for COVID-19, the human papillomavirus, meningococcal disease and RSV. “These are established vaccines, and we’re voting on them?” Offit says. “The entire childhood and adult immunisation schedule is on the table.”\u003c/p\u003e\u003carticle data-label=\"Related\"\u003e\u003ca href=\"https://www.nature.com/articles/d41586-025-01771-z\" data-track=\"click\" data-track-label=\"recommended article\"\u003e\u003cimg alt=\"\" src=\"https://media.nature.com/w400/magazine-assets/d41586-025-01852-z/d41586-025-01852-z_51091730.jpg\"/\u003e\u003cp\u003eHow to speak to a vaccine sceptic: research reveals what works\u003c/p\u003e\u003c/a\u003e\u003c/article\u003e\u003cp\u003eKennedy has criticized the ACIP for what he says are rampant conflicts of interest among its members. On 12 June, the biopharma news outlet Endpoints News reported that \u003ca href=\"https://endpoints.news/two-new-acip-picks-were-paid-experts-against-merck-in-court/\" data-track=\"click\" data-label=\"https://endpoints.news/two-new-acip-picks-were-paid-experts-against-merck-in-court/\" data-track-category=\"body text link\"\u003etwo newly named ACIP members, Robert Malone and Martin Kulldorff, have received payment for serving as expert witnesses\u003c/a\u003e in lawsuits against pharmaceutical company Merck over two of its vaccines. Malone \u003ca href=\"https://x.com/RWMaloneMD/status/1933182433727565977\" data-track=\"click\" data-label=\"https://x.com/RWMaloneMD/status/1933182433727565977\" data-track-category=\"body text link\"\u003esaid on X\u003c/a\u003e that this work ended six years ago.\u003c/p\u003e\u003cp\u003eKennedy has also said that past committee members did not demand what he considers to be adequate safety trials with control groups that received a placebo, before recommending vaccines.\u003c/p\u003e\u003cp\u003eBut many of the vaccine studies included placebo controls, Ratner says, unless it was unethical to conduct the trial with one. And Reingold, who has served on the ACIP in the past, says that the committee has strict policies regarding conflicts of interest and that committee members must recuse themselves from any vote that might pose a conflict. “The issue of potential conflicts of interest has been radically overblown and unfairly called into question the objectivity of this panel,” he says.\u003c/p\u003e\u003cp\u003eOffit says several independent groups have reviewed previous ACIP members and found no conflicts of interest. “Now, the conflict of interest is real because these folks are indebted to RFK Jr, who just gave them this position,” he says.\u003c/p\u003e\u003ch2\u003eVetting process\u003c/h2\u003e\u003cp\u003eResearchers are also concerned about the loss of expertise. The committee’s new lineup is “disturbing”, says Nancy Bennett, a public-health specialist at the University of Rochester Medical Center in New York.\u003c/p\u003e\u003cp\u003eIn the past, members were nominated and then vetted by staff at the US Centers for Disease Control (CDC) before being sent to the head of the CDC and, finally, the head of the HHS for approval. Bennett says the vetting process sometimes took years. “The ACIP was meant to be composed of people with deep expertise in the area,” Ratner says. “That’s what we have lost.”\u003c/p\u003e\u003ch2\u003eJoseph Hibbeln\u003c/h2\u003e\u003cp\u003eHibbeln is a psychiatrist and neuroscientist who once worked at the US National Institutes of Health. His recent papers\u003csup\u003e\u003ca href=\"#ref-CR1\" data-track=\"click\" data-action=\"anchor-link\" data-track-label=\"go to reference\" data-track-category=\"references\"\u003e1\u003c/a\u003e\u003c/sup\u003e have focused on the connection between nutrition and various disorders, including mental-health conditions, and his LinkedIn profile states that twenty-first-century diets are contributing to “inadequate brain nutrients and are likely contributing to the high burden of mental illnesses worldwide”. A search of PubMed, a database of biomedical papers, did not turn up any papers he has authored about vaccines or infectious disease. He did not respond to a request for comment.\u003c/p\u003e\u003ch2\u003eMartin Kulldorff\u003c/h2\u003e\u003cp\u003eKulldorff is a Swedish epidemiologist and senior scholar at the Brownstone Institute, a think tank based in West Hartford, Connecticut, that formed “to provide an independent voice for personal liberty” and to oppose \u003ca href=\"https://www.nature.com/articles/d41586-022-02823-4\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-022-02823-4\" data-track-category=\"body text link\"\u003elockdown policies instituted by public officials during the COVID-19 pandemic\u003c/a\u003e. Along with \u003ca href=\"https://www.nature.com/articles/d41586-025-01827-0\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-025-01827-0\" data-track-category=\"body text link\"\u003eJayanta Bhattacharya, the current head of the US National Institutes of Health\u003c/a\u003e, Kulldorff wrote the \u003ca href=\"https://gbdeclaration.org/#read\" data-track=\"click\" data-label=\"https://gbdeclaration.org/#read\" data-track-category=\"body text link\"\u003eGreat Barrington Declaration\u003c/a\u003e in 2020, \u003ca href=\"https://www.nature.com/articles/d41586-020-02948-4\" data-track=\"click\" data-label=\"https://www.nature.com/articles/d41586-020-02948-4\" data-track-category=\"body text link\"\u003ewhich advocated against COVID-19 lockdowns except for vulnerable populations\u003c/a\u003e, and drew much pushback from the medical community.\u003c/p\u003e\u003cp\u003eLast year, \u003ca href=\"https://www.city-journal.org/article/harvard-tramples-the-truth\" data-track=\"click\" data-label=\"https://www.city-journal.org/article/harvard-tramples-the-truth\" data-track-category=\"body text link\"\u003eKulldorff wrote in \u003ci\u003eCity Journal\u003c/i\u003e\u003c/a\u003e that he was fired from Harvard University in Cambridge, Massachusetts, for refusing a COVID-19 vaccine even though he already had immunity from being infected. He also wrote that “vaccines are a vital medical invention, allowing people to obtain immunity without the risk that comes from getting sick,” but suggested that trials of COVID-19 vaccines early in the pandemic were not properly designed. Kulldorff did not respond to \u003ci\u003eNature\u003c/i\u003e’s request for comment.\u003c/p\u003e\u003ch2\u003eRetsef Levi\u003c/h2\u003e\u003cp\u003eLevi is a professor of operations management at the Massachusetts Institute of Technology in Cambridge. He has published several papers on COVID-19, including one\u003csup\u003e\u003ca href=\"#ref-CR2\" data-track=\"click\" data-action=\"anchor-link\" data-track-label=\"go to reference\" data-track-category=\"references\"\u003e2\u003c/a\u003e\u003c/sup\u003e expressing concerns about side effects of the COVID-19 vaccines. In a post on social-media platform X in 2023, Levi said, “The evidence is mounting and indisputable that MRNA vaccines cause serious harm including death, especially among young people. We have to stop giving them immediately!” Levi did not respond to a request for comment.\u003c/p\u003e\u003ch2\u003eRobert Malone\u003c/h2\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": null,
  "modifiedTime": null
}
