{
  "id": "c574f296-4482-4281-8512-905479e0c945",
  "title": "Dinosaur eggshell study confirms biogenic origin of secondary eggshell units",
  "link": "https://phys.org/news/2025-05-dinosaur-eggshell-biogenic-secondary.html",
  "description": "The calcitic layers of the eggshells of archosaurs (including crocodilians and birds) and turtles are composed of distinctive crystalline structures known as eggshell units. Those growing from the shell membrane are called primary eggshell units (PEUs), while those forming within the calcitic layer are called secondary eggshell units (SEUs). Although rare in modern bird eggs, SEUs are common in dinosaur eggs. Due to the lack of in-depth research on this structure, however, scientists are uncertain whether they are biogenic or abiogenic in origin.",
  "author": "",
  "published": "Fri, 30 May 2025 14:16:02 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Evolution Paleontology \u0026 Fossils"
  ],
  "byline": "Chinese Academy of Sciences",
  "length": 5925,
  "excerpt": "The calcitic layers of the eggshells of archosaurs (including crocodilians and birds) and turtles are composed of distinctive crystalline structures known as eggshell units. Those growing from the shell membrane are called primary eggshell units (PEUs), while those forming within the calcitic layer are called secondary eggshell units (SEUs). Although rare in modern bird eggs, SEUs are common in dinosaur eggs. Due to the lack of in-depth research on this structure, however, scientists are uncertain whether they are biogenic or abiogenic in origin.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "The differences between the biogenic and abiogenic calcite in dinosaur eggshells. Credit: IVPP The calcitic layers of the eggshells of archosaurs (including crocodilians and birds) and turtles are composed of distinctive crystalline structures known as eggshell units. Those growing from the shell membrane are called primary eggshell units (PEUs), while those forming within the calcitic layer are called secondary eggshell units (SEUs). Although rare in modern bird eggs, SEUs are common in dinosaur eggs. Due to the lack of in-depth research on this structure, however, scientists are uncertain whether they are biogenic or abiogenic in origin. To tackle this issue, an international research team led by Dr. Zhang Shukang and postdoctoral researcher Dr. Choi Seung from the Institute of Vertebrate Paleontology and Paleoanthropology (IVPP) of the Chinese Academy of Sciences, has conducted a comprehensive study of SEUs in dinosaur eggshells using techniques including electron backscatter diffraction (EBSD), polarized light microscopy (PLM), and scanning electron microscopy (SEM). For comparison, they examined some eggshells of modern birds, turtles, and crocodiles. The study revealed that the crystallographic characteristics of dinosaur egg SEUs were almost identical to those of PEUs. Notably, they also matched the crystallographic characteristics of the SEUs in modern turtle and crocodile eggshells. Additionally, the SEUs in dinosaur eggs exhibited numerous grooves and vesicles, similar to those in modern bird eggshell units. These grooves and vesicles were interpreted as remnants of spaces left by the degradation of organic matrix fibers during fossilization. These findings, published in the journal Science Advances, strongly suggest that the SEUs in dinosaur eggs are biogenic structures. SEUs of the highly porous dinosaur eggshells. A—D: PLM images；E, F: SEM images；G—O: EBSD images. The SEUs have radially arranged c-axes (G, J, and M), textured gray scales (H, K, and N), and high KAM values (I, L, and O). The arrows show the grooves and vesicles in F, show the SEUs in other images. Scale bars are equal to 200 μm (A and C), 100 μm (B, D, E, and G to O), and 25 μm (F). Credit: IVPP Formation mechanism of dinosaur eggshells containing SEUs. B—F: Highly porous eggshells, SEUs are superimposed on PEUs, inside pore canals (B and C), and form layers (E and F)；G—I: Moderately porous eggshells. SEUs are mostly embedded in PEUs and other SEUs. Credit: IVPP SEUs gradually decline in the maniraptoran eggshells. The SEUs of turtle, crocodilian, ornithischian dinosaurs, sauropod dinosaurs, and theropod dinosaurs might result from parallel evolution (A), or might have a deep homology (B). Credit: IVPP Furthermore, in some dinosaur eggshells with well-developed pore canals, the researchers discovered that the SEUs either overlapped the PEUs or grew inside the pore canals. Although the growth of these SEUs was undisturbed, the c-axes of their calcite crystals still extended parallel to the growth direction of the eggshell. This phenomenon challenges the \"competition hypothesis\" derived from modern bird eggshells, and it reveals that the c-axis orientation of eggshell units is likely regulated by organic matrix fibers rather than the result of the competitive growth between adjacent calcite crystals. Notably, when it comes to evolutionary dynamics, the researchers discovered that SEUs were present in the eggshells of sauropods, hadrosaurs, and potential basal Tetanurae while being conspicuously rare in those of maniraptorans (including birds), suggesting that the formation mechanism may have changed during the evolution of eggshells from non-avian theropods to modern birds. From a macroevolutionary perspective, SEUs appear in turtles, crocodilians, as well as ornithischian, sauropod, and theropod dinosaur lineages, indicating that these structures may have evolved independently within the calcitic layers of the eggshells. However, at the molecular level of biomineralization, the possibility of a deep homology of SEUs across all these lineages cannot be ruled out. This study sheds light on the characterization of SEUs in dinosaur eggshells and offers new insights into the evolutionary plasticity of eggshell structures. More information: Shukang Zhang, Biogenic origin of secondary eggshell units in dinosaur eggshells elucidates lost biomineralization process in maniraptoran dinosaurs, Science Advances (2025). DOI: 10.1126/sciadv.adt1879. www.science.org/doi/10.1126/sciadv.adt1879 Citation: Dinosaur eggshell study confirms biogenic origin of secondary eggshell units (2025, May 30) retrieved 30 May 2025 from https://phys.org/news/2025-05-dinosaur-eggshell-biogenic-secondary.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/dinosaur-eggshell-stud.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/dinosaur-eggshell-stud.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/dinosaur-eggshell-stud.jpg\" data-sub-html=\"The differences between the biogenic and abiogenic calcite in dinosaur eggshells. Credit: IVPP\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/dinosaur-eggshell-stud.jpg\" alt=\"Dinosaur eggshell study confirms biogenic origin of secondary eggshell units\" title=\"The differences between the biogenic and abiogenic calcite in dinosaur eggshells. Credit: IVPP\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                The differences between the biogenic and abiogenic calcite in dinosaur eggshells. Credit: IVPP\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eThe calcitic layers of the eggshells of archosaurs (including crocodilians and birds) and turtles are composed of distinctive crystalline structures known as eggshell units. Those growing from the shell membrane are called primary eggshell units (PEUs), while those forming within the calcitic layer are called secondary eggshell units (SEUs). Although rare in modern bird eggs, SEUs are common in dinosaur eggs. Due to the lack of in-depth research on this structure, however, scientists are uncertain whether they are biogenic or abiogenic in origin.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eTo tackle this issue, an international research team led by Dr. Zhang Shukang and postdoctoral researcher Dr. Choi Seung from the Institute of Vertebrate Paleontology and Paleoanthropology (IVPP) of the Chinese Academy of Sciences, has conducted a comprehensive study of SEUs in dinosaur eggshells using techniques including \u003ca href=\"https://phys.org/tags/electron+backscatter+diffraction/\" rel=\"tag\"\u003eelectron backscatter diffraction\u003c/a\u003e (EBSD), polarized \u003ca href=\"https://phys.org/tags/light+microscopy/\" rel=\"tag\"\u003elight microscopy\u003c/a\u003e (PLM), and scanning \u003ca href=\"https://phys.org/tags/electron+microscopy/\" rel=\"tag\"\u003eelectron microscopy\u003c/a\u003e (SEM). For comparison, they examined some eggshells of modern birds, turtles, and crocodiles.\u003c/p\u003e\n\u003cp\u003eThe study revealed that the crystallographic characteristics of dinosaur egg SEUs were almost identical to those of PEUs. Notably, they also matched the crystallographic characteristics of the SEUs in modern turtle and crocodile eggshells.\u003c/p\u003e\n\u003cp\u003eAdditionally, the SEUs in dinosaur eggs exhibited numerous grooves and vesicles, similar to those in modern bird \u003ca href=\"https://phys.org/tags/eggshell/\" rel=\"tag\"\u003eeggshell\u003c/a\u003e units. These grooves and vesicles were interpreted as remnants of spaces left by the degradation of organic matrix fibers during fossilization. These \u003ca href=\"https://www.science.org/doi/10.1126/sciadv.adt1879\" target=\"_blank\"\u003efindings\u003c/a\u003e, published in the journal \u003ci\u003eScience Advances\u003c/i\u003e, strongly suggest that the SEUs in \u003ca href=\"https://phys.org/tags/dinosaur+eggs/\" rel=\"tag\"\u003edinosaur eggs\u003c/a\u003e are biogenic structures.\u003c/p\u003e\n\n\u003cul\u003e\n            \u003cli data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/dinosaur-eggshell-stud-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/dinosaur-eggshell-stud-1.jpg\" data-sub-html=\"SEUs of the highly porous dinosaur eggshells. A—D: PLM images；E, F: SEM images；G—O: EBSD images. The SEUs have radially arranged c-axes (G, J, and M), textured gray scales (H, K, and N), and high KAM values (I, L, and O). The arrows show the grooves and vesicles in F, show the SEUs in other images. Scale bars are equal to 200 μm (A and C), 100 μm (B, D, E, and G to O), and 25 μm (F). Credit: IVPP\"\u003e\n            \u003cfigure\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800/2025/dinosaur-eggshell-stud-1.jpg\" alt=\"Dinosaur eggshell study confirms biogenic origin of secondary eggshell units\"/\u003e\n                 \u003cfigcaption\u003e\n                    SEUs of the highly porous dinosaur eggshells. A—D: PLM images；E, F: SEM images；G—O: EBSD images. The SEUs have radially arranged c-axes (G, J, and M), textured gray scales (H, K, and N), and high KAM values (I, L, and O). The arrows show the grooves and vesicles in F, show the SEUs in other images. Scale bars are equal to 200 μm (A and C), 100 μm (B, D, E, and G to O), and 25 μm (F). Credit: IVPP\n                \u003c/figcaption\u003e            \u003c/figure\u003e\n        \u003c/li\u003e\n            \u003cli data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/dinosaur-eggshell-stud-2.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/dinosaur-eggshell-stud-2.jpg\" data-sub-html=\"Formation mechanism of dinosaur eggshells containing SEUs. B—F: Highly porous eggshells, SEUs are superimposed on PEUs, inside pore canals (B and C), and form layers (E and F)；G—I: Moderately porous eggshells. SEUs are mostly embedded in PEUs and other SEUs. Credit: IVPP\"\u003e\n            \u003cfigure\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800/2025/dinosaur-eggshell-stud-2.jpg\" alt=\"Dinosaur eggshell study confirms biogenic origin of secondary eggshell units\"/\u003e\n                 \u003cfigcaption\u003e\n                    Formation mechanism of dinosaur eggshells containing SEUs. B—F: Highly porous eggshells, SEUs are superimposed on PEUs, inside pore canals (B and C), and form layers (E and F)；G—I: Moderately porous eggshells. SEUs are mostly embedded in PEUs and other SEUs. Credit: IVPP\n                \u003c/figcaption\u003e            \u003c/figure\u003e\n        \u003c/li\u003e\n            \u003cli data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/dinosaur-eggshell-stud-3.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/dinosaur-eggshell-stud-3.jpg\" data-sub-html=\"SEUs gradually decline in the maniraptoran eggshells. The SEUs of turtle, crocodilian, ornithischian dinosaurs, sauropod dinosaurs, and theropod dinosaurs might result from parallel evolution (A), or might have a deep homology (B). Credit: IVPP\"\u003e\n            \u003cfigure\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800/2025/dinosaur-eggshell-stud-3.jpg\" alt=\"Dinosaur eggshell study confirms biogenic origin of secondary eggshell units\"/\u003e\n                 \u003cfigcaption\u003e\n                    SEUs gradually decline in the maniraptoran eggshells. The SEUs of turtle, crocodilian, ornithischian dinosaurs, sauropod dinosaurs, and theropod dinosaurs might result from parallel evolution (A), or might have a deep homology (B). Credit: IVPP\n                \u003c/figcaption\u003e            \u003c/figure\u003e\n        \u003c/li\u003e\n    \u003c/ul\u003e\n\u003cp\u003eFurthermore, in some dinosaur eggshells with well-developed pore canals, the researchers discovered that the SEUs either overlapped the PEUs or grew inside the pore canals. Although the growth of these SEUs was undisturbed, the c-axes of their calcite crystals still extended parallel to the growth direction of the eggshell.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThis phenomenon challenges the \u0026#34;competition hypothesis\u0026#34; derived from modern bird eggshells, and it reveals that the c-axis orientation of eggshell units is likely regulated by organic matrix fibers rather than the result of the competitive growth between adjacent calcite crystals.\u003c/p\u003e\n\u003cp\u003eNotably, when it comes to \u003ca href=\"https://phys.org/tags/evolutionary+dynamics/\" rel=\"tag\"\u003eevolutionary dynamics\u003c/a\u003e, the researchers discovered that SEUs were present in the eggshells of sauropods, hadrosaurs, and potential basal Tetanurae while being conspicuously rare in those of maniraptorans (including birds), suggesting that the formation mechanism may have changed during the evolution of eggshells from non-avian theropods to \u003ca href=\"https://phys.org/tags/modern+birds/\" rel=\"tag\"\u003emodern birds\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFrom a macroevolutionary perspective, SEUs appear in turtles, crocodilians, as well as ornithischian, sauropod, and theropod dinosaur lineages, indicating that these structures may have evolved independently within the calcitic layers of the eggshells. However, at the molecular level of biomineralization, the possibility of a deep homology of SEUs across all these lineages cannot be ruled out.\u003c/p\u003e\n\u003cp\u003eThis study sheds light on the characterization of SEUs in dinosaur eggshells and offers new insights into the evolutionary plasticity of eggshell structures.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tShukang Zhang, Biogenic origin of secondary eggshell units in dinosaur eggshells elucidates lost biomineralization process in maniraptoran dinosaurs, \u003ci\u003eScience Advances\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1126/sciadv.adt1879\" target=\"_blank\"\u003eDOI: 10.1126/sciadv.adt1879\u003c/a\u003e. \u003ca href=\"https://www.science.org/doi/10.1126/sciadv.adt1879\" target=\"_blank\"\u003ewww.science.org/doi/10.1126/sciadv.adt1879\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tDinosaur eggshell study confirms biogenic origin of secondary eggshell units (2025, May 30)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 30 May 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-05-dinosaur-eggshell-biogenic-secondary.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-30T14:16:02-04:00",
  "modifiedTime": null
}
