{
  "id": "cad137dc-7502-4ed8-9253-27cd50a6f936",
  "title": "Scientists uncover why \"stealth\" volcanoes stay silent until eruption",
  "link": "https://www.sciencedaily.com/releases/2025/06/250610074307.htm",
  "description": "Some volcanoes erupt with little to no warning, posing serious risks to nearby communities and air traffic. A study of Alaska's Veniaminof volcano reveals how specific internal conditions like slow magma flow and warm chamber walls can create these so-called \"stealthy eruptions.\"",
  "author": "",
  "published": "Tue, 10 Jun 2025 07:43:07 EDT",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 4799,
  "excerpt": "Some volcanoes erupt with little to no warning, posing serious risks to nearby communities and air traffic. A study of Alaska's Veniaminof volcano reveals how specific internal conditions like slow magma flow and warm chamber walls can create these so-called \"stealthy eruptions.\"",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "When volcanoes are preparing to erupt, scientists rely on typical signs to warn people living nearby: deformation of the ground and earthquakes, caused by underground chambers filling up with magma and volcanic gas. But some volcanoes, called 'stealthy' volcanoes, don't give obvious warning signs. Now scientists studying Veniaminof, Alaska, have developed a model which could explain and predict stealthy eruptions. \"Despite major advances in monitoring, some volcanoes erupt with little or no detectable precursors, significantly increasing the risk to nearby populations,\" said Dr Yuyu Li of the University of Illinois, lead author of the study in Frontiers in Earth Science. \"Some of these volcanoes are located near major air routes or close to communities: examples include Popocatépetl and Colima in Mexico, Merapi in Indonesia, Galeras in Colombia, and Stromboli in Italy. \"Our work helps explain how this happens, by identifying the key internal conditions -- such as low magma supply and warm host rock -- that make eruptions stealthy.\" Warning signs Veniaminof is an ice-clad volcano in the Aleutian Arc of Alaska. It's carefully monitored, but only two of its 13 eruptions since 1993 have been preceded by enough signs to alert observing scientists. In fact, a 2021 eruption wasn't caught until three days after it had started. \"Veniaminof is a case study in how a volcano can appear quiet while still being primed to erupt,\" said Li. \"It is one of the most active volcanoes in Alaska. In recent decades, it has produced several VEI 3 eruptions -- moderate-sized explosive events that can send ash up to 15 km high, disrupt air traffic, and pose regional hazards to nearby communities and infrastructure -- often without clear warning signs.\" To understand Veniaminof better, the scientists used monitoring data over three summer seasons immediately before the 2018 stealthy eruption, which produced only ambiguous warning signs immediately before it happened. They created a model of the volcano's behavior in different conditions which would change the impact of a filling magma reservoir on the ground above: six potential volumes of magma reservoir, a range of magma flow rates and reservoir depths, and three shapes of reservoir. They then compared the models to the data to see which matched best, and which conditions produced eruptions, stealthy or otherwise. Volcano by the numbers They found that a high flow of magma into a chamber increases the deformation of the ground and the likelihood of an eruption. If magma is flowing quickly into a large chamber, an eruption may not occur, but if one does the ground will deform enough to warn scientists first. Similarly, a high flow of magma into a small chamber is likely to produce an eruption, but not a stealthy one. Stealthy eruptions become likely when a low flow of magma enters a relatively small chamber. Compared to observational data, the results suggest that Veniaminof has a small magma chamber and a low flow of magma. The model also suggests that different conditions could produce different warning signs. Magma flowing into larger, flatter chambers may cause minimal earthquakes, while smaller, more elongated chambers may produce little deformation of the ground. But stealthy eruptions only happen when all the conditions are in place -- the right magma flow and the right chamber size, shape, and depth. However, when the scientists added temperature to their model, they found that if magma is consistently present over time so that the rock of the chamber is warm, size and shape matters less. If the rock is warm, it's less likely to fail in ways that cause detectable earthquakes or deformation of the ground when magma flows into the chamber, increasing the likelihood of a stealthy eruption. What next? \"To mitigate the impact of these potential surprise eruptions, we need to integrate high-precision instruments like borehole tiltmeters and strainmeters and fiber optic sensing, as well as newer approaches such as infrasound and gas emission monitoring,\" said Li. \"Machine learning has also shown promise in detecting subtle changes in volcanic behavior, especially in earthquake signal picking.\" At Veniaminof, taking measures to improve the coverage of satellite monitoring and adding tiltmeters and strainmeters could improve the rate of detection. In the meantime, scientists now know which volcanoes they need to watch most closely: volcanoes with small, warm reservoirs and slow magma flows. \"Combining these models with real-time observations represents a promising direction for improving volcano forecasting,\" said Li. \"In the future, this approach can enable improved monitoring for these stealthy systems, ultimately leading to more effective responses to protect nearby communities.\"",
  "image": "https://www.sciencedaily.com/images/1920/Volcanic-Eruption.webp",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eWhen volcanoes are preparing to erupt, scientists rely on typical signs to warn people living nearby: deformation of the ground and earthquakes, caused by underground chambers filling up with magma and volcanic gas. But some volcanoes, called \u0026#39;stealthy\u0026#39; volcanoes, don\u0026#39;t give obvious warning signs. Now scientists studying Veniaminof, Alaska, have developed a model which could explain and predict stealthy eruptions.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003e\u0026#34;Despite major advances in monitoring, some volcanoes erupt with little or no detectable precursors, significantly increasing the risk to nearby populations,\u0026#34; said Dr Yuyu Li of the University of Illinois, lead author of the study in \u003cem\u003eFrontiers in Earth Science\u003c/em\u003e. \u0026#34;Some of these volcanoes are located near major air routes or close to communities: examples include Popocatépetl and Colima in Mexico, Merapi in Indonesia, Galeras in Colombia, and Stromboli in Italy.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our work helps explain how this happens, by identifying the key internal conditions -- such as low magma supply and warm host rock -- that make eruptions stealthy.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWarning signs \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVeniaminof is an ice-clad volcano in the Aleutian Arc of Alaska. It\u0026#39;s carefully monitored, but only two of its 13 eruptions since 1993 have been preceded by enough signs to alert observing scientists. In fact, a 2021 eruption wasn\u0026#39;t caught until three days after it had started.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Veniaminof is a case study in how a volcano can appear quiet while still being primed to erupt,\u0026#34; said Li. \u0026#34;It is one of the most active volcanoes in Alaska. In recent decades, it has produced several VEI 3 eruptions -- moderate-sized explosive events that can send ash up to 15 km high, disrupt air traffic, and pose regional hazards to nearby communities and infrastructure -- often without clear warning signs.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTo understand Veniaminof better, the scientists used monitoring data over three summer seasons immediately before the 2018 stealthy eruption, which produced only ambiguous warning signs immediately before it happened. They created a model of the volcano\u0026#39;s behavior in different conditions which would change the impact of a filling magma reservoir on the ground above: six potential volumes of magma reservoir, a range of magma flow rates and reservoir depths, and three shapes of reservoir. They then compared the models to the data to see which matched best, and which conditions produced eruptions, stealthy or otherwise.\u003c/p\u003e\n\n\n\u003cp\u003e\u003cstrong\u003eVolcano by the numbers \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThey found that a high flow of magma into a chamber increases the deformation of the ground and the likelihood of an eruption. If magma is flowing quickly into a large chamber, an eruption may not occur, but if one does the ground will deform enough to warn scientists first. Similarly, a high flow of magma into a small chamber is likely to produce an eruption, but not a stealthy one. Stealthy eruptions become likely when a low flow of magma enters a relatively small chamber. Compared to observational data, the results suggest that Veniaminof has a small magma chamber and a low flow of magma.\u003c/p\u003e\n\u003cp\u003eThe model also suggests that different conditions could produce different warning signs. Magma flowing into larger, flatter chambers may cause minimal earthquakes, while smaller, more elongated chambers may produce little deformation of the ground. But stealthy eruptions only happen when all the conditions are in place -- the right magma flow and the right chamber size, shape, and depth.\u003c/p\u003e\n\u003cp\u003eHowever, when the scientists added temperature to their model, they found that if magma is consistently present over time so that the rock of the chamber is warm, size and shape matters less. If the rock is warm, it\u0026#39;s less likely to fail in ways that cause detectable earthquakes or deformation of the ground when magma flows into the chamber, increasing the likelihood of a stealthy eruption.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat next? \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u0026#34;To mitigate the impact of these potential surprise eruptions, we need to integrate high-precision instruments like borehole tiltmeters and strainmeters and fiber optic sensing, as well as newer approaches such as infrasound and gas emission monitoring,\u0026#34; said Li. \u0026#34;Machine learning has also shown promise in detecting subtle changes in volcanic behavior, especially in earthquake signal picking.\u0026#34;\u003c/p\u003e\n\u003cp\u003eAt Veniaminof, taking measures to improve the coverage of satellite monitoring and adding tiltmeters and strainmeters could improve the rate of detection. In the meantime, scientists now know which volcanoes they need to watch most closely: volcanoes with small, warm reservoirs and slow magma flows.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Combining these models with real-time observations represents a promising direction for improving volcano forecasting,\u0026#34; said Li. \u0026#34;In the future, this approach can enable improved monitoring for these stealthy systems, ultimately leading to more effective responses to protect nearby communities.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": null,
  "modifiedTime": null
}
