{
  "id": "d12caafb-bdb2-44a6-b6cc-607be1ba0da3",
  "title": "Analysis casts doubt on ancient drying of northern Africa's climate, raising new questions about early human evolution",
  "link": "https://phys.org/news/2025-06-analysis-ancient-drying-northern-africa.html",
  "description": "A study led by researchers from Brown University finds that rainfall patterns across northern Africa remained largely stable between 3.5 and 2.5 million years ago—a pivotal period in Earth's climate history when the Northern Hemisphere cooled and places like Greenland became permanently glaciated.",
  "author": "",
  "published": "Fri, 20 Jun 2025 14:00:06 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Earth Sciences Environment"
  ],
  "byline": "Kevin Stacey",
  "length": 5623,
  "excerpt": "A study led by researchers from Brown University finds that rainfall patterns across northern Africa remained largely stable between 3.5 and 2.5 million years ago—a pivotal period in Earth's climate history when the Northern Hemisphere cooled and places like Greenland became permanently glaciated.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Pixabay/CC0 Public Domain A study led by researchers from Brown University finds that rainfall patterns across northern Africa remained largely stable between 3.5 and 2.5 million years ago—a pivotal period in Earth's climate history when the Northern Hemisphere cooled and places like Greenland became permanently glaciated. The new findings, published in Science Advances, challenge long-held interpretations of the climate history of northern Africa, which had suggested that the region dried out considerably during this period. The timing coincides with the appearance of the first known member of the genus Homo in the fossil record, leading to speculation that this drying may have played a significant evolutionary role near the dawn of the human lineage. But compared to previous studies, this new study analyzed a more direct proxy for rainfall—leaf waxes produced by terrestrial vegetation—and came to a new conclusion. \"Plants produce these waxes during the summer growing season, so they provide a direct signal of summer rainfall over time,\" said Bryce Mitsunaga, who led the research while completing his Ph.D. in Brown's Department of Earth, Environmental and Planetary Sciences and is now a postdoctoral researcher at Harvard. \"We found that precipitation cycles didn't change much even as all these larger changes in temperature and glaciation were happening.\" Prior evidence for drying across northern Africa came from dust deposits found in ocean sediment cores taken off the West African coast. Ocean sediments preserve fossil microorganisms, plant matter and other markers that help scientists to track climate through deep time. Researchers had found that the amount of continental dust found in the samples increased dramatically in samples dated to between 3.5 and 2.5 million years ago, a period known as Pliocene-Pleistocene transition. That increase in dust was interpreted as an expansion of the Sahara Desert brought on by decreasing summer monsoons. For this new study, the researchers meticulously analyzed leaf waxes in the same cores in which the dust evidence was found. Leaf waxes preserve the isotopic signature of the water plants absorb as they grow, and that signature varies with the amount of rain that falls. Rainwater generally contains two forms of hydrogen: light hydrogen with no neutrons and a heavier form with one neutron. Rainwater with heavier hydrogen falls first. So leaf waxes with a higher ratio of light hydrogen are indicative of more sustained rains. The leaf wax analysis revealed no significant drying trend at the Pliocene-Pleistocene boundary. Patterns of summer rainfall remained largely stable on either side of the boundary, indicating that African rainfall patterns were largely unaffected by changes in global climate—decreasing temperature in increasing Northern Hemisphere glaciation—that were occurring at the time. The research suggests that the dust found in prior studies is attributable to something other than changes in rainfall—perhaps changes in wind patterns or intensity. The findings have a range of implications for understanding both past and future climate, the researchers say. Carbon dioxide levels at the Pliocene-Pleistocene boundary are thought to be similar to where they are today, although heading in opposite directions (increasing today and decreasing then). \"If we can see how global climate influenced what the water cycle is doing at that point in history, it could inform predictions of the future rainfall in this already water-stressed region,\" Mitsunaga said. Jim Russell, a professor in Brown's Department of Earth, Environmental and Planetary Sciences and senior author of the study, said the results raise new questions about the climate history of northern Africa and its implications for human evolution. The timing of the supposed African drying event coincides with the appearance in the fossil record of early hominid ancestors including Homo habilis and Paranthropus, leading to speculation that drier conditions may have driven adaptations for upright walking in a new foraging environment. But the lack of a drying trend at the Pliocene-Pleistocene boundary complicates that story. \"This calls for new research to determine when and why African climate and environments transitioned to a drier state and new theories to understand our ancestry,\" Russell said. More information: Bryce Mitsunaga, Fundamentally unchanged northwestern African rainfall regimes across the Plio-Pleistocene transition, Science Advances (2025). DOI: 10.1126/sciadv.ads3149. www.science.org/doi/10.1126/sciadv.ads3149 Journal information: Science Advances",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2023/africa-continent.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1073408\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2023/africa-continent.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2023/africa-continent.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2023/africa-continent.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2023/africa-continent.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2023/africa-continent.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2023/africa-continent.jpg\" width=\"800\" height=\"529\" alt=\"Africa continent\" title=\"Credit: Pixabay/CC0 Public Domain\" fetchpriority=\"high\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Pixabay/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eA study led by researchers from Brown University finds that rainfall patterns across northern Africa remained largely stable between 3.5 and 2.5 million years ago—a pivotal period in Earth\u0026#39;s climate history when the Northern Hemisphere cooled and places like Greenland became permanently glaciated.\u003c/p\u003e\n\n                \n                                \n                \n                \n                                                            \u003cp\u003eThe new findings, \u003ca href=\"https://www.science.org/doi/10.1126/sciadv.ads3149\" target=\"_blank\"\u003epublished\u003c/a\u003e in \u003ci\u003eScience Advances\u003c/i\u003e, challenge long-held interpretations of the climate history of northern Africa, which had suggested that the region dried out considerably during this period. The timing coincides with the appearance of the first known member of the genus Homo in the \u003ca href=\"https://phys.org/tags/fossil+record/\" rel=\"tag\"\u003efossil record\u003c/a\u003e, leading to speculation that this drying may have played a significant evolutionary role near the dawn of the human lineage.\u003c/p\u003e\n\u003cp\u003eBut compared to previous studies, this new study analyzed a more direct proxy for rainfall—leaf waxes produced by terrestrial vegetation—and came to a new conclusion.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Plants produce these waxes during the summer growing season, so they provide a direct signal of summer rainfall over time,\u0026#34; said Bryce Mitsunaga, who led the research while completing his Ph.D. in Brown\u0026#39;s Department of Earth, Environmental and Planetary Sciences and is now a postdoctoral researcher at Harvard. \u0026#34;We found that precipitation cycles didn\u0026#39;t change much even as all these larger changes in temperature and glaciation were happening.\u0026#34;\u003c/p\u003e\n\u003cp\u003ePrior evidence for drying across northern Africa came from dust deposits found in ocean sediment cores taken off the West African coast. Ocean sediments preserve fossil microorganisms, plant matter and other markers that help scientists to track climate through deep time.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eResearchers had found that the amount of continental dust found in the samples increased dramatically in samples dated to between 3.5 and 2.5 million years ago, a period known as Pliocene-Pleistocene transition. That increase in dust was interpreted as an expansion of the Sahara Desert brought on by decreasing summer monsoons.\u003c/p\u003e\n\u003cp\u003eFor this new study, the researchers meticulously analyzed leaf waxes in the same cores in which the dust evidence was found. Leaf waxes preserve the isotopic signature of the water plants absorb as they grow, and that signature varies with the amount of rain that falls.\u003c/p\u003e\n\u003cp\u003eRainwater generally contains two forms of hydrogen: light hydrogen with no neutrons and a heavier form with one neutron. Rainwater with heavier hydrogen falls first. So leaf waxes with a higher ratio of light hydrogen are indicative of more sustained rains.\u003c/p\u003e\n\u003cp\u003eThe leaf wax analysis revealed no significant drying trend at the Pliocene-Pleistocene boundary. Patterns of summer rainfall remained largely stable on either side of the boundary, indicating that African \u003ca href=\"https://phys.org/tags/rainfall+patterns/\" rel=\"tag\"\u003erainfall patterns\u003c/a\u003e were largely unaffected by changes in global climate—decreasing temperature in increasing Northern Hemisphere glaciation—that were occurring at the time.\u003c/p\u003e\n\u003cp\u003eThe research suggests that the dust found in prior studies is attributable to something other than changes in rainfall—perhaps changes in wind patterns or intensity.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eThe findings have a range of implications for understanding both past and future climate, the researchers say.\u003c/p\u003e\n\u003cp\u003eCarbon dioxide levels at the Pliocene-Pleistocene boundary are thought to be similar to where they are today, although heading in opposite directions (increasing today and decreasing then).\u003c/p\u003e\n\u003cp\u003e\u0026#34;If we can see how global climate influenced what the water cycle is doing at that point in history, it could inform predictions of the future rainfall in this already water-stressed region,\u0026#34; Mitsunaga said.\u003c/p\u003e\n\u003cp\u003eJim Russell, a professor in Brown\u0026#39;s Department of Earth, Environmental and Planetary Sciences and senior author of the study, said the results raise new questions about the climate history of northern Africa and its implications for human evolution.\u003c/p\u003e\n\u003cp\u003eThe timing of the supposed African drying event coincides with the appearance in the fossil record of early hominid ancestors including Homo habilis and Paranthropus, leading to speculation that drier conditions may have driven adaptations for upright walking in a new foraging environment. But the lack of a drying trend at the Pliocene-Pleistocene boundary complicates that story.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This calls for new research to determine when and why African climate and environments transitioned to a drier state and new theories to understand our ancestry,\u0026#34; Russell said.\u003c/p\u003e\n\n                                                            \n                  \n\n                \n                                    \u003cdiv\u003e\n                                                    \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Bryce Mitsunaga, Fundamentally unchanged northwestern African rainfall regimes across the Plio-Pleistocene transition, \u003ci\u003eScience Advances\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1126/sciadv.ads3149\" target=\"_blank\"\u003eDOI: 10.1126/sciadv.ads3149\u003c/a\u003e. \u003ca href=\"https://www.science.org/doi/10.1126/sciadv.ads3149\" target=\"_blank\"\u003ewww.science.org/doi/10.1126/sciadv.ads3149\u003c/a\u003e\n                            \u003c/p\u003e\n                                                                        \n                                                    \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                                                    \u003ca href=\"https://phys.org/journals/science-advances/\"\u003eScience Advances\u003c/a\u003e\n                                                                            \u003ca href=\"http://advances.sciencemag.org/\" target=\"_blank\" rel=\"nofollow\"\u003e\n                                            \u003ci\u003e\u003c/i\u003e\n                                        \u003c/a\u003e\n                                                                         \n                                                            \u003c/p\u003e\n                                            \u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-06-20T14:00:06-04:00",
  "modifiedTime": null
}
