{
  "id": "d8a8a7e3-af67-40e6-af95-8f0c61e9f044",
  "title": "New clues from two million-year-old tooth enamel tell us more about an ancient relative of humans",
  "link": "https://phys.org/news/2025-07-clues-million-year-tooth-enamel.html",
  "description": "For nearly a century, scientists have been puzzling over fossils from a strange and robust-looking distant relative of early humans: Paranthropus robustus. It walked upright, and was built for heavy chewing with relatively massive jaws, and huge teeth with thick dental enamel. It's thought to have lived between 2.25 million and 1.7 million years ago.",
  "author": "",
  "published": "Sat, 12 Jul 2025 13:10:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Evolution Paleontology \u0026 Fossils"
  ],
  "byline": "Palesa P. Madupe, Claire Koenig, Ioannis Patramanis",
  "length": 7058,
  "excerpt": "For nearly a century, scientists have been puzzling over fossils from a strange and robust-looking distant relative of early humans: Paranthropus robustus. It walked upright, and was built for heavy chewing with relatively massive jaws, and huge teeth with thick dental enamel. It's thought to have lived between 2.25 million and 1.7 million years ago.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Proteins were taken from the enamel of this Paranthropus robustus’ tooth. Credit: Dr. Bernhard Zipfel, with permission from Dr. Lazarus Kgasi, junior curator of Plio-Pleistocene Paleontology at Ditsong National Museum of Natural History in Pretoria, South Africa. For nearly a century, scientists have been puzzling over fossils from a strange and robust-looking distant relative of early humans: Paranthropus robustus. It walked upright, and was built for heavy chewing with relatively massive jaws, and huge teeth with thick dental enamel. It's thought to have lived between 2.25 million and 1.7 million years ago. Humans today have a diverse array of hominin distant relatives and ancestors from millions of years ago. The South African fossil record ranges from early hominins such as Australopithecus prometheus, A. africanus (Taung child), A. sediba and P. robustus, to early members of the genus Homo (H. erectus/ergaster, H. habilis), to later hominins such as H. naledi and Homo sapiens (humans). Fossils show how these early relatives evolved from as far back as A. africanus, 3.67 million years ago. They also document milestones in evolution, including the transition to walking on two legs, tool making and increased brain development. Ultimately, our species—Homo sapiens—appeared in South Africa 153,000 years ago. Fossils of P. robustus were first discovered in South Africa in 1938. But crucial questions remained. How much variation was there within the species? Were the size differences related to sex, or did they reflect the presence of multiple species? How was P. robustus related to the other hominins and early Homo? And what, genetically, made it distinct? Until now, answers to these questions have been elusive. As a team of African and European molecular science, chemistry and paleoanthropology researchers, we wanted to find answers but we couldn't use ancient DNA to help us. Ancient DNA has been a game-changer in studying later hominins like Neanderthals and Denisovans but it doesn't survive well in Africa's climate because of its simple structure. We experienced a breakthrough when we decided to use paleoproteomics—the analysis of ancient proteins. We extracted these from the enamel of the 2-million-year-old teeth of four P. robustus fossils from Swartkrans Cave in South Africa's Cradle of Humankind. Luckily, proteins that are millions of years old preserve well because they stick to teeth and bones and are not affected by the warm weather. One of these proteins tells us the biological sex of the fossils. This is how we found that two of the individuals were male and two were female. These findings open a new window into human evolution—one that could reshape how we interpret diversity in our early ancestors by providing some of the oldest human genetic data from Africa. From there, we can understand more about the relationships between the individuals and potentially even whether the fossils come from different species. More than one kind of Paranthropus? The protein sequences also revealed other subtle but potentially significant genetic differences. One standout difference was found in a gene which makes enamelin, a critical enamel-forming protein. We found that two of the individuals shared an amino acid with modern and early humans, chimpanzees and gorillas. The other two had an amino acid that among African great apes is, so far, unique to Paranthropus. What's even more interesting is that one of the individuals had both the distinct amino acids. This is the first documented time we can show heterozygosity (a state of having two different versions of a gene) in proteins that are 2 million years old. When studying proteins, specific mutations are thought to indicate different species. We were quite surprised to discover that what we initially thought was a mutation unique to Paranthropus robustus was actually variable within that group—some individuals had it while others did not. Again, this was the first time anyone had observed a protein mutation in ancient proteins (these mutations are usually observed in ancient DNA). We realized that instead of seeing a single, variable species, we might be looking at a complex evolutionary puzzle of individuals with different ancestries. This shows that combining analyses of morphology (the study of the form and structure of organisms) and the study of ancient proteins, we can create a clearer evolutionary picture of the relationships among these early hominin individuals. However, to confirm that P. robustus fossils have different ancestry, we will need to take samples of tooth enamel protein from more of their teeth. To do this, we plan to sustainably sample more P. robustus from other sites in South Africa where they've been found. Preserving Africa's fossil heritage Our team was careful to balance scientific innovation with the need to protect irreplaceable heritage. Fossils were sampled minimally, and all work followed South African regulations. We also involved local laboratories in the analysis. Many of the authors were from the African continent. They were instrumental in guiding the research agenda and approach from the early stages of the project. Doing this kind of high-end science on African fossils in Africa is an important step towards transformation and decolonization of paleontology. It builds local capacity and ensures that discoveries benefit the regions from which the fossils come. By combining data on molecules and morphology, our study offers a blueprint for future research—one that could clarify whether early hominins were more or less diverse than we've known. For now, the Paranthropus puzzle just got a little more complex—and a lot more exciting. As paleoproteomic techniques improve and more fossils are analyzed, we can expect more surprises from our ancient relatives. This article is republished from The Conversation under a Creative Commons license. Read the original article. Citation: New clues from two million-year-old tooth enamel tell us more about an ancient relative of humans (2025, July 12) retrieved 12 July 2025 from https://phys.org/news/2025-07-clues-million-year-tooth-enamel.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/new-clues-from-2-milli.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/new-clues-from-2-milli.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/new-clues-from-2-milli.jpg\" data-sub-html=\"Proteins were taken from the enamel of this Paranthropus robustus’ tooth. Credit: Dr. Bernhard Zipfel, with permission from Dr. Lazarus Kgasi, junior curator of Plio-Pleistocene Paleontology at Ditsong National Museum of Natural History in Pretoria, South Africa.\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/new-clues-from-2-milli.jpg\" alt=\"New clues from 2 million-year-old tooth enamel tell us more about an ancient relative of humans\" title=\"Proteins were taken from the enamel of this Paranthropus robustus’ tooth. Credit: Dr. Bernhard Zipfel, with permission from Dr. Lazarus Kgasi, junior curator of Plio-Pleistocene Paleontology at Ditsong National Museum of Natural History in Pretoria, South Africa.\" width=\"800\" height=\"449\"/\u003e\n             \u003cfigcaption\u003e\n                Proteins were taken from the enamel of this Paranthropus robustus’ tooth. Credit: Dr. Bernhard Zipfel, with permission from Dr. Lazarus Kgasi, junior curator of Plio-Pleistocene Paleontology at Ditsong National Museum of Natural History in Pretoria, South Africa.\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eFor nearly a century, scientists have been puzzling over fossils from a strange and robust-looking distant relative of early humans: \u003ci\u003eParanthropus robustus\u003c/i\u003e. It \u003ca href=\"https://www.sciencedirect.com/science/article/abs/pii/S0047248424001556\" target=\"_blank\"\u003ewalked upright\u003c/a\u003e, and was built for heavy chewing with relatively massive jaws, and huge teeth with thick dental enamel. It\u0026#39;s thought to have lived \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0012821X11001634\" target=\"_blank\"\u003ebetween 2.25 million and 1.7 million years ago\u003c/a\u003e.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eHumans today have a diverse array of hominin distant relatives and ancestors from millions of years ago. The South African \u003ca href=\"https://phys.org/tags/fossil/\" rel=\"tag\"\u003efossil\u003c/a\u003e record ranges from early hominins such as \u003ci\u003e\u003ca href=\"https://milnepublishing.geneseo.edu/the-history-of-our-tribe-hominini/chapter/australopithecus-prometheus-or-africanus/\" target=\"_blank\"\u003eAustralopithecus prometheus\u003c/a\u003e\u003c/i\u003e, \u003ca href=\"https://humanorigins.si.edu/evidence/human-fossils/fossils/taung-child\" target=\"_blank\"\u003e\u003ci\u003eA. africanus\u003c/i\u003e\u003c/a\u003e (Taung child), \u003ci\u003e\u003ca href=\"https://humanorigins.si.edu/evidence/human-fossils/species/australopithecus-sediba\" target=\"_blank\"\u003eA. sediba\u003c/a\u003e\u003c/i\u003e and \u003ci\u003eP. robustus\u003c/i\u003e, to early members of the genus \u003ci\u003eHomo\u003c/i\u003e (\u003ci\u003e\u003ca href=\"https://www.britannica.com/topic/Homo-erectus\" target=\"_blank\"\u003eH. erectus/ergaster\u003c/a\u003e\u003c/i\u003e, \u003ci\u003e\u003ca href=\"https://humanorigins.si.edu/evidence/human-fossils/species/homo-habilis\" target=\"_blank\"\u003eH. habilis\u003c/a\u003e\u003c/i\u003e), to later hominins such as \u003ci\u003e\u003ca href=\"https://humanorigins.si.edu/evidence/human-fossils/species/homo-naledi\" target=\"_blank\"\u003eH. naledi\u003c/a\u003e\u003c/i\u003e and \u003ci\u003e\u003ca href=\"https://www.britannica.com/topic/Homo-sapiens\" target=\"_blank\"\u003eHomo sapiens\u003c/a\u003e\u003c/i\u003e (humans).\u003c/p\u003e\n\u003cp\u003eFossils show how these early relatives evolved from as far back as \u003ci\u003eA. africanus\u003c/i\u003e, 3.67 million years ago. They also document milestones in \u003ca href=\"https://theconversation.com/fun-with-fossils-south-african-kids-learn-a-whole-lot-more-about-human-evolution-from-museum-workshops-259319\" target=\"_blank\"\u003eevolution\u003c/a\u003e, including the transition to walking on two legs, tool making and increased brain development. Ultimately, our species—\u003ci\u003eHomo sapiens\u003c/i\u003e—appeared in South Africa \u003ca href=\"https://www.tandfonline.com/doi/full/10.1080/10420940.2023.2204231\" target=\"_blank\"\u003e153,000 years ago\u003c/a\u003e.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eFossils of \u003ci\u003eP. robustus\u003c/i\u003e were \u003ca href=\"https://www.archaeology.org.za/events/excursion-kromdraai-cradle-civilisation#:~:text=In%201938%20a%20schoolboy%20named,France%20(2016-2021).\" target=\"_blank\"\u003efirst discovered in South Africa in 1938\u003c/a\u003e. But crucial questions remained. How much variation was there within the species? Were the size differences related to sex, or did they reflect the presence of multiple species? How was \u003ci\u003eP. robustus\u003c/i\u003e related to the other hominins and early \u003ci\u003eHomo\u003c/i\u003e? And what, genetically, made it distinct?\u003c/p\u003e\n\u003cp\u003eUntil now, answers to these questions have been elusive. As a team of African and European molecular science, chemistry and paleoanthropology researchers, we wanted to find answers but we couldn\u0026#39;t use \u003ca href=\"https://www.sciencedirect.com/topics/neuroscience/ancient-dna\" target=\"_blank\"\u003eancient DNA\u003c/a\u003e to help us. Ancient DNA has been a game-changer in studying later hominins like \u003ca href=\"https://www.nhm.ac.uk/discover/who-were-the-neanderthals.html\" target=\"_blank\"\u003eNeanderthals\u003c/a\u003e and \u003ca href=\"https://www.livescience.com/denisovans-extinct-human-relative\" target=\"_blank\"\u003eDenisovans\u003c/a\u003e but it doesn\u0026#39;t survive well in Africa\u0026#39;s climate because of its simple structure.\u003c/p\u003e\n\u003cp\u003eWe experienced a breakthrough when we decided to use \u003ca href=\"http://www.ical.manchester.ac.uk/research/palaeoproteomics/#:~:text=\" target=\"_blank\"\u003epaleoproteomics\u003c/a\u003e—the analysis of ancient proteins. We extracted these from the enamel of the 2-million-year-old teeth of four \u003ci\u003eP. robustus\u003c/i\u003e fossils from Swartkrans Cave in \u003ca href=\"https://sterkfonteincaves.wits.ac.za/caves/swartkrans-caves/\" target=\"_blank\"\u003eSouth Africa\u0026#39;s Cradle of Humankind\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eLuckily, proteins that are millions of years old \u003ca href=\"https://pubmed.ncbi.nlm.nih.gov/32269345\" target=\"_blank\"\u003epreserve well\u003c/a\u003e because they \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC6908745/\" target=\"_blank\"\u003estick to teeth and bones\u003c/a\u003e and are not affected by the warm weather. One of these proteins tells us the biological sex of the fossils. This is how \u003ca href=\"https://www.science.org/doi/10.1126/science.adt9539\" target=\"_blank\"\u003ewe found that\u003c/a\u003e two of the individuals were male and two were female.\u003c/p\u003e\n\u003cp\u003eThese findings open a new window into \u003ca href=\"https://phys.org/tags/human+evolution/\" rel=\"tag\"\u003ehuman evolution\u003c/a\u003e—one that could reshape how we interpret diversity in our early ancestors by providing some of the oldest human genetic data from Africa. From there, we can understand more about the relationships between the individuals and potentially even whether the fossils come from different species.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eMore than one kind of \u003ci\u003eParanthropus\u003c/i\u003e?\u003c/h2\u003e\n\u003cp\u003eThe \u003ca href=\"https://phys.org/tags/protein+sequences/\" rel=\"tag\"\u003eprotein sequences\u003c/a\u003e also revealed other subtle but potentially significant genetic differences. One standout difference was found in a gene which makes \u003ca href=\"https://ontosight.ai/glossary/term/introduction-to-enamelin-protein--679e147b38099fda3cfe29e6\" target=\"_blank\"\u003eenamelin\u003c/a\u003e, a critical enamel-forming protein. We found that two of the individuals shared an \u003ca href=\"https://www.britannica.com/science/amino-acid\" target=\"_blank\"\u003eamino acid\u003c/a\u003e with modern and early humans, chimpanzees and gorillas. The other two had an amino acid that among African great apes is, so far, unique to \u003ci\u003eParanthropus\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eWhat\u0026#39;s even more interesting is that one of the individuals had both the distinct amino acids. This is the first documented time we can show \u003ca href=\"https://www.cancer.gov/publications/dictionaries/cancer-terms/def/heterozygous-genotype\" target=\"_blank\"\u003eheterozygosity\u003c/a\u003e (a state of having two different versions of a gene) in proteins that are 2 million years old.\u003c/p\u003e\n\u003cp\u003eWhen studying proteins, specific mutations are thought to indicate different species. We were quite surprised to discover that what we initially thought was a mutation unique to \u003ci\u003eParanthropus robustus\u003c/i\u003e was actually variable within that group—some individuals had it while others did not. Again, this was the first time anyone had observed a protein mutation in ancient proteins (these mutations are usually observed in ancient DNA).\u003c/p\u003e\n\u003cp\u003eWe realized that instead of seeing a single, variable species, we might be looking at a complex evolutionary puzzle of individuals with different ancestries. This shows that combining analyses of \u003ca href=\"https://www.merriam-webster.com/dictionary/morphology\" target=\"_blank\"\u003emorphology\u003c/a\u003e (the study of the form and structure of organisms) and the study of ancient proteins, we can create a clearer evolutionary picture of the relationships among these early hominin individuals.\u003c/p\u003e\n\u003cp\u003eHowever, to confirm that \u003ci\u003eP. robustus\u003c/i\u003e fossils have different ancestry, we will need to take samples of tooth enamel \u003ca href=\"https://phys.org/tags/protein/\" rel=\"tag\"\u003eprotein\u003c/a\u003e from more of their teeth. To do this, we plan to sustainably sample more \u003ci\u003eP. robustus\u003c/i\u003e from other sites in South Africa where they\u0026#39;ve been found.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003ePreserving Africa\u0026#39;s fossil heritage\u003c/h2\u003e\n\u003cp\u003eOur team was careful to balance scientific innovation with the need to protect irreplaceable heritage. Fossils were sampled minimally, and all work followed South African regulations. We also involved local laboratories in the analysis. Many of the authors were from the African continent. They were instrumental in guiding the research agenda and approach from the early stages of the project.\u003c/p\u003e\n\u003cp\u003eDoing this kind of high-end science on African fossils in Africa is an important step towards transformation and decolonization of paleontology. It builds local capacity and ensures that discoveries benefit the regions from which the fossils come.\u003c/p\u003e\n\u003cp\u003eBy combining data on molecules and morphology, our study offers a blueprint for future research—one that could clarify whether \u003ca href=\"https://phys.org/tags/early+hominins/\" rel=\"tag\"\u003eearly hominins\u003c/a\u003e were more or less diverse than we\u0026#39;ve known.\u003c/p\u003e\n\u003cp\u003eFor now, the \u003ci\u003eParanthropus\u003c/i\u003e puzzle just got a little more complex—and a lot more exciting. As \u003ca href=\"http://www.ical.manchester.ac.uk/research/palaeoproteomics/#:~:text=\" target=\"_blank\"\u003epaleoproteomic\u003c/a\u003e techniques improve and more fossils are analyzed, we can expect more surprises from our ancient relatives.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  This article is republished from \u003ca href=\"https://theconversation.com\" target=\"_blank\"\u003eThe Conversation\u003c/a\u003e under a Creative Commons license. Read the \u003ca href=\"https://theconversation.com/new-clues-from-2-million-year-old-tooth-enamel-tell-us-more-about-an-ancient-relative-of-humans-258082\" target=\"_blank\"\u003eoriginal article\u003c/a\u003e.\u003cimg src=\"https://counter.theconversation.com/content/258082/count.gif?distributor=republish-lightbox-advanced\" alt=\"The Conversation\" width=\"1\" height=\"1\"/\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tNew clues from two million-year-old tooth enamel tell us more about an ancient relative of humans (2025, July 12)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 12 July 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-07-clues-million-year-tooth-enamel.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-12T13:10:01-04:00",
  "modifiedTime": null
}
