{
  "id": "dc59375e-782f-44a8-ae4c-10f54d0283eb",
  "title": "Expert shares advice on how to ease anxiety this election season",
  "link": "https://phys.org/news/2024-10-expert-advice-ease-anxiety-election.html",
  "description": "This election season, there is more at stake than which political party or candidate wins the race—it is voters' mental health.",
  "author": "",
  "published": "Thu, 31 Oct 2024 20:00:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Social Sciences Political science"
  ],
  "byline": "Virginia Tech",
  "length": 2368,
  "excerpt": "This election season, there is more at stake than which political party or candidate wins the race—it is voters' mental health.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Credit: Unsplash/CC0 Public Domain This election season, there is more at stake than which political party or candidate wins the race—it is voters' mental health. During this election season, the stress of handling conversations with family or friends who have different political views, or the worry of how a particular issue may be resolved, is enough to create a perfect storm of tension and worry for many people, says a Virginia Tech expert. \"These are deeply important personal issues that have direct impacts on well-being,\" said Kristen Benson, associate professor and director of the marriage and family therapy program at Virginia Tech. The uncertainty surrounding misinformation and the constant exposure of political ads and social media commentary doesn't help, she said. Benson offers suggestions for ways that people can ease anxiety leading up to the presidential election. Be intentional and limit access to media. Stay informed but limit time on social media, in particular doomscrolling. We tend to grab our phones when we have a free moment. We may be better off enjoying moments of silence by putting the phone down. Spend time with other people while doing joyful activities. Negotiate how much or if you will talk about politics and the election. Set boundaries with friends and loved ones and develop strategies when political topics come up. This might include saying, \"This issue is important to me. Are you interested in understanding my perspective or are you hoping to change my mind?\" or \"We disagree about this issue, and I prefer that we not discuss it.\" Also, ask yourself if you are interested in hearing perspectives that differ from your own. Always maintain civility and avoid demeaning comments. Focus on well-being activities, such as walking outside, working out, taking a social media break, or other calming actions. If you find yourself regularly distracted or struggling in daily activities, seek support from a therapist. Rest and practice sleep hygiene. Avoid social media and news media consumption right before bed. Instead focus on winding down and preparing to rest. Get involved. Volunteer in organizations that are important to you, such as animal shelters, nonprofits, or even political campaigns.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/voter-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1183443\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/hires/2024/voter-1.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/voter-1.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2024/voter-1.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2024/voter-1.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2024/voter-1.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2024/voter-1.jpg\" width=\"800\" height=\"530\" alt=\"voter\" title=\"Credit: Unsplash/CC0 Public Domain\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eCredit: Unsplash/CC0 Public Domain\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eThis election season, there is more at stake than which political party or candidate wins the race—it is voters\u0026#39; mental health.\u003c/p\u003e\n\n                \n                                \n                \n                                    \u003cp\u003eDuring this election season, the stress of handling conversations with family or friends who have different political views, or the worry of how a particular issue may be resolved, is enough to create a perfect storm of tension and worry for many people, says a Virginia Tech expert.\u003c/p\u003e\n\u003cp\u003e\u0026#34;These are deeply important personal issues that have direct impacts on well-being,\u0026#34; said Kristen Benson, associate professor and director of the marriage and family therapy program at Virginia Tech.\u003c/p\u003e\n\u003cp\u003eThe \u003ca href=\"https://phys.org/tags/uncertainty/\" rel=\"tag\"\u003euncertainty\u003c/a\u003e surrounding misinformation and the constant exposure of political ads and \u003ca href=\"https://phys.org/tags/social+media/\" rel=\"tag\"\u003esocial media\u003c/a\u003e commentary doesn\u0026#39;t help, she said.\u003c/p\u003e\n\u003cp\u003eBenson offers suggestions for ways that people can ease anxiety leading up to the \u003ca href=\"https://phys.org/tags/presidential+election/\" rel=\"tag\"\u003epresidential election\u003c/a\u003e.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe intentional and limit access to \u003ca href=\"https://phys.org/tags/media/\" rel=\"tag\"\u003emedia\u003c/a\u003e. Stay informed but limit time on social media, in particular doomscrolling. We tend to grab our phones when we have a free moment. We may be better off enjoying moments of silence by putting the phone down.\u003c/li\u003e\n\u003cli\u003eSpend time with other people while doing joyful activities. Negotiate how much or if you will talk about politics and the election.\u003c/li\u003e\n\u003cli\u003eSet boundaries with friends and loved ones and develop strategies when political topics come up. This might include saying, \u0026#34;This issue is important to me. Are you interested in understanding my perspective or are you hoping to change my mind?\u0026#34; or \u0026#34;We disagree about this issue, and I prefer that we not discuss it.\u0026#34; Also, ask yourself if you are interested in hearing perspectives that differ from your own. Always maintain civility and avoid demeaning comments.\u003c/li\u003e\n\u003cli\u003eFocus on well-being activities, such as walking outside, working out, taking a social media break, or other calming actions. If you find yourself regularly distracted or struggling in daily activities, seek support from a therapist.\u003c/li\u003e\n\u003cli\u003eRest and practice sleep hygiene. Avoid social media and news media consumption right before bed. Instead focus on winding down and preparing to rest.\u003c/li\u003e\n\u003cli\u003eGet involved. Volunteer in organizations that are important to you, such as animal shelters, nonprofits, or even \u003ca href=\"https://phys.org/tags/political+campaigns/\" rel=\"tag\"\u003epolitical campaigns\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\n                \n                  \n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2024-10-31T20:00:01-04:00",
  "modifiedTime": null
}
