{
  "id": "e0f89a0d-2675-4f65-bee2-fe353365843a",
  "title": "The President of Stanford Is Unsure Which Number is Larger, 9 or 133",
  "link": "https://sciencebasedmedicine.org/number/?utm_source=rss\u0026utm_medium=rss\u0026utm_campaign=number",
  "description": "It doesn't bode well for the future that leaders of major American institutions say naked emperors are wearing beautiful clothes. The post The President of Stanford Is Unsure Which Number is Larger, 9 or 133 first appeared on Science-Based Medicine.",
  "author": "Jonathan Howard",
  "published": "Fri, 11 Oct 2024 07:09:00 +0000",
  "source": "https://sciencebasedmedicine.org/feed/",
  "categories": [
    "Science and Medicine"
  ],
  "byline": "Jonathan Howard",
  "length": 10539,
  "excerpt": "It doesn't bode well for the future that leaders of major American institutions say naked emperors are wearing beautiful clothes.",
  "siteName": "Science-Based Medicine",
  "favicon": "https://sciencebasedmedicine.org/wp-content/uploads/2018/09/favicon.png",
  "text": "We need to make every effort to get people who disagree, even sharply, in dialogue with one another. In a previous article, I wrote an open letter to the Stanford President, Jonathan Levin, regarding a conference at his university, Pandemic Policy: Planning the Future, Assessing the Past. As SBM readers know, this conference featured doctors who mostly didn’t treat COVID patients, but instead spread misinformation about it and tried to purposefully infect people with it. My letter predicted that the conference would be a giant exercise in deliberate amnesia. As such, I encouraged President Levin to reject censorship and simply play videos of the speakers from the first two years of the pandemic. Sadly, President Levin embraced censorship. Instead of honestly informing the conference attendees about the speakers, he whitewashed their pandemic record with the following speech: Good morning and welcome to everyone. I appreciate the opportunity to be here. Now, you might wonder: Why is Jon Levin opening this conference on pandemic policy? You might say, Jon is no public health expert. And I might say: Well, I did run a business school during the COVID pandemic, so I have some experience making pandemic policy decisions. They also say you learn most by making mistakes. So I think there are probably a thousand Stanford MBAs who are willing to argue that I’m basically a world expert. However, that’s not why I’m here. When I was invited to participate in this event a few months ago, it was with the understanding that the goal was to bring together people with different perspectives, engage in a day of discussion, and in that way, try to repair some of the rifts that opened during COVID. That struck me as a valuable goal, and the sort of goal we should aim for at Stanford. So I agreed to give a few brief remarks to that effect. What followed was disappointing. When I was invited, I asked around and indeed the organizers were talking to some well-known people with quite different views who were likely to speak. However, it was not so straightforward. Some invitees weren’t able to make it, or withdrew, or didn’t want to participate in an event with other speakers whose views and behavior they found attacking or abhorrent. When an initial and partial agenda was posted, it was immediately perceived as one-sided, and as I’m sure you all noticed became the subject of op-eds and social media posts. Ironically, instead of repairing rifts as intended and perhaps spurring fresh thinking, the process seemed to reopen old and existing divisions. As an observer and as the leader of this university, I found the episode dispiriting, in a way that goes beyond the specifics of this particular event. We have many issues today at Stanford, and on other campuses, where views are divided, and in some cases, like this one, where feelings are raw. Yet I believe we need to make every effort to get people who disagree, even sharply, in dialogue with one another. I believe it’s essential for us to do that as members of the faculty and university leaders – not just because it’s a way to advance knowledge, but because we need to model that behavior if we want to expect it from our students. And in today’s world, we absolutely need to ask and expect our students to be able to engage with, listen to, and debate with people with whom they disagree. My view is that we need to err on the side of talking to one another. So I hope today’s conference will come off in a way that involves just that – thoughtful and robust discussion across different perspectives. I hope it yields some important insights about future pandemic policy – we certainly need that. Perhaps it does even bridge a few divides among those in the room. And I hope even more that all of you will join in the larger project of trying to make Stanford and other campuses forums for the type of robust and thoughtful discussion that is at the heart of universities when we’re at our best. I wouldn’t have been have mentioned that many of these doctors predicted COVID would kill less than 50,000 Americans and that the mass infection of unvaccinated youth would lead to herd immunity in 3-6 months. We’ve had more flu deaths among children this year than COVID deaths. With President Levin’s admonition to “listen to” people in mind, let’s revisit just one of the videos I presented to him. In this video, from November 2020 Dr. Jay Bhattacharya said “we’ve had more flu deaths among children this year than COVID deaths”. The first reported COVID death in the US was on 2/28/2020. By the time Dr. Bhattacharya recorded that video, COVID had killed at least 133 children according to the American Academy of Pediatrics. During that same time frame, the flu killed 9 children. The next year, just 1 child died of the flu while COVID killed several hundred children. Currently, the CDC reports 1,935 COVID deaths and 438 flu deaths amongst children since the start of the pandemic, though obviously children should be vaccinated against both viruses. Yet, according to President Levin, its fine for people to have “different views” on this topic. He feels “we need to make every effort to get people who disagree, even sharply, in dialogue with one another.” Sounding more like a college freshman than a university President, President Levin feels everything is a matter of opinion and what really matters is that no one get their feelings hurts. In President Levin’s telling, it’s not wrong for Dr. Bhattacharya to say that 9 is larger than 133, however it is wrong for people like me to say this isn’t a “different view” and it shouldn’t be a topic of “dialogue”. I supposed I’ll be accused of silencing debate and discussion, but 133 is larger than 9. This wouldn’t have been controversial in 2019. When someone spreads dangerous, blatant misinformation, honest brokers call it out, even if the person spreading the misinformation has fancy credentials and can speak in scientific jargon. It’s not that hard. President Levin, however, expects us all to be open to the possibility that 9 is larger 133, and it doesn’t bode well for the future that leaders of major American institutions say naked emperors are wearing beautiful clothes. Correction notice: An earlier version of this article misstated the number of flu deaths as 338, not 438. Thanks to the reader who spotted the error. Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\" View all posts Posted by Jonathan Howard Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19. He is the author of \"We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\"",
  "image": "https://sciencebasedmedicine.org/wp-content/uploads/2024/10/images.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"page\"\u003e\n    \u003cmain id=\"main\" role=\"main\"\u003e\n\n        \n\n        \n\u003carticle id=\"post-101675\"\u003e\n\n\t\t\n\t\u003cdiv\u003e\n\t\t\n\n\u003ch2\u003eWe need to make every effort to get people who disagree, even sharply, in dialogue with one another.\u003c/h2\u003e\n\n\n\n\n\n\n\n\u003cp\u003eIn a \u003ca href=\"https://sciencebasedmedicine.org/nocensorship/\"\u003eprevious article\u003c/a\u003e, I wrote an open letter to the Stanford President, Jonathan Levin, regarding a conference at his university, \u003cem\u003ePandemic Policy: Planning the Future, Assessing the Past.\u003c/em\u003e As \u003cabbr title=\"Science-Based Medicine\"\u003eSBM\u003c/abbr\u003e readers know, this conference featured doctors who mostly didn’t treat COVID patients, but instead spread misinformation about it and tried to purposefully infect people with it. My letter predicted that the conference would be a giant exercise in deliberate amnesia. As such, I encouraged President Levin to reject censorship and simply play videos of the speakers from the first two years of the pandemic.\u003c/p\u003e\n\n\n\n\u003cp\u003eSadly, President Levin embraced censorship. Instead of honestly informing the conference attendees about the speakers, he whitewashed their pandemic record with the \u003ca href=\"https://news.stanford.edu/stories/2024/10/remarks-at-pandemic-policy-conference\" title=\"\"\u003efollowing\u003c/a\u003e speech:\u003c/p\u003e\n\n\n\n\u003cblockquote\u003e\n\u003cp\u003eGood morning and welcome to everyone. I appreciate the opportunity to be here.\u003c/p\u003e\n\n\n\n\u003cp\u003eNow, you might wonder: Why is Jon Levin opening this conference on pandemic policy? You might say, Jon is no public health expert. And I might say: Well, I did run a business school during the COVID pandemic, so I have some experience making pandemic policy decisions. They also say you learn most by making mistakes. So I think there are probably a thousand Stanford MBAs who are willing to argue that I’m basically a world expert.\u003c/p\u003e\n\n\n\n\u003cp\u003eHowever, that’s not why I’m here.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen I was invited to participate in this event a few months ago, it was with the understanding that the goal was to bring together people with different perspectives, engage in a day of discussion, and in that way, try to repair some of the rifts that opened during COVID.\u003c/p\u003e\n\n\n\n\u003cp\u003eThat struck me as a valuable goal, and the sort of goal we should aim for at Stanford. So I agreed to give a few brief remarks to that effect.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhat followed was disappointing. When I was invited, I asked around and indeed the organizers were talking to some well-known people with quite different views who were likely to speak. However, it was not so straightforward. Some invitees weren’t able to make it, or withdrew, or didn’t want to participate in an event with other speakers whose views and behavior they found attacking or abhorrent.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen an initial and partial agenda was posted, it was immediately perceived as one-sided, and as I’m sure you all noticed became the subject of op-eds and social media posts.\u003c/p\u003e\n\n\n\n\u003cp\u003eIronically, instead of repairing rifts as intended and perhaps spurring fresh thinking, the process seemed to reopen old and existing divisions.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs an observer and as the leader of this university, I found the episode dispiriting, in a way that goes beyond the specifics of this particular event.\u003c/p\u003e\n\n\n\n\u003cp\u003eWe have many issues today at Stanford, and on other campuses, where views are divided, and in some cases, like this one, where feelings are raw.\u003c/p\u003e\n\n\n\n\u003cp\u003eYet I believe we need to make every effort to get people who disagree, even sharply, in dialogue with one another. I believe it’s essential for us to do that as members of the faculty and university leaders – not just because it’s a way to advance knowledge, but because we need to model that behavior if we want to expect it from our students. And in today’s world, we absolutely need to ask and expect our students to be able to engage with, listen to, and debate with people with whom they disagree. My view is that we need to err on the side of talking to one another.\u003c/p\u003e\n\n\n\n\u003cp\u003eSo I hope today’s conference will come off in a way that involves just that – thoughtful and robust discussion across different perspectives. I hope it yields some important insights about future pandemic policy – we certainly need that. Perhaps it does even bridge a few divides among those in the room.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd I hope even more that all of you will join in the larger project of trying to make Stanford and other campuses forums for the type of robust and thoughtful discussion that is at the heart of universities when we’re at our best.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\n\n\u003cp\u003eI wouldn’t have been have mentioned that many of these doctors predicted COVID would kill less than 50,000 Americans and that the mass infection of unvaccinated youth would lead to herd immunity in 3-6 months.\u003c/p\u003e\n\n\n\n\u003ch2\u003eWe’ve had more flu deaths among children this year than COVID deaths.\u003c/h2\u003e\n\n\n\n\u003cp\u003eWith President Levin’s admonition to “listen to” people in mind, let’s revisit just one of the videos I presented to him. In this video, from November 2020 Dr. Jay Bhattacharya said “we’ve had more flu deaths among children this year than COVID deaths”.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cfigure\u003e\u003cp\u003e\n\u003ciframe title=\"11/2020: Dr. Jay Bhattacharya says 133 COVID deaths are less than 9 flu deaths\" width=\"900\" height=\"506\" src=\"https://www.youtube.com/embed/Vt0zugbVKoE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\n\u003c/p\u003e\u003c/figure\u003e\n\n\n\n\n\n\n\n\u003cp\u003eThe first reported COVID death in the US was on 2/28/2020. By the time Dr. Bhattacharya recorded that video, COVID had killed at least \u003ca href=\"https://downloads.aap.org/AAP/PDF/AAP%20and%20CHA%20-%20Children%20and%20COVID-19%20State%20Data%20Report%205.20.21%20FINAL.pdf\"\u003e133 children\u003c/a\u003e according to the American Academy of Pediatrics. During that same time frame, the flu killed \u003ca href=\"https://gis.cdc.gov/grasp/fluview/pedfludeath.html\"\u003e9 children\u003c/a\u003e. The next year, just 1 child died of the flu while COVID killed several hundred children. Currently, the CDC reports \u003ca href=\"https://covid.cdc.gov/covid-data-tracker/#demographics\"\u003e1,935 COVID deaths\u003c/a\u003e and \u003ca href=\"https://gis.cdc.gov/grasp/fluview/pedfludeath.html\" title=\"\"\u003e438 flu deaths\u003c/a\u003e amongst children since the start of the pandemic, though obviously children should be vaccinated against both viruses.\u003c/p\u003e\n\n\n\n\u003cp\u003eYet, according to President Levin, its fine for people to have “different views” on this topic. He feels “we need to make every effort to get people who disagree, even sharply, in dialogue with one another.” Sounding more like a college freshman than a university President, President Levin feels everything is a matter of opinion and what really matters is that no one get their feelings hurts. In President Levin’s telling, it’s not wrong for Dr. Bhattacharya to say that 9 is larger than 133, however it is wrong for people like me to say this isn’t a “different view” and it shouldn’t be a topic of “dialogue”.\u003c/p\u003e\n\n\n\n\u003cp\u003eI supposed I’ll be accused of silencing debate and discussion, but 133 is larger than 9. This wouldn’t have been controversial in 2019. When someone spreads dangerous, blatant misinformation, honest brokers call it out, even if the person spreading the misinformation has fancy credentials and can speak in scientific jargon. It’s not that hard. President Levin, however, expects us all to be open to the possibility that 9 is larger 133, and it doesn’t bode well for the future that leaders of major American institutions say naked emperors are wearing beautiful clothes.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003e\u003cstrong\u003eCorrection notice\u003c/strong\u003e: An earlier version of this article misstated the number of flu deaths as 338, not 438.  Thanks to the reader who spotted the error.\u003c/p\u003e\n                \n                    \n\n                    \n                    \u003cdiv data-post_id=\"86980\" data-instance_id=\"1\" data-additional_class=\"pp-multiple-authors-layout-boxed.multiple-authors-target-the-content\" data-original_class=\"pp-multiple-authors-boxes-wrapper pp-multiple-authors-wrapper box-post-id-86980 box-instance-id-1\"\u003e\n                                                                                    \n                                                                            \u003cp\u003e\u003cspan\u003e\n                                                                                                                        \u003cul\u003e\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    \n                                                                                                                    \u003cli\u003e\n                                                                                                                                                                                    \n                                                            \n                                                            \u003cdiv\u003e\n                                                                                                                                                                                                                                                                        \u003cp\u003e\n                                                                            Dr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;                                                                        \u003c/p\u003e\n                                                                                                                                \n                                                                                                                                    \u003cp\u003e\u003cspan\u003e\n                                                                        \u003ca href=\"https://sciencebasedmedicine.org/author/jonathanhoward/\" title=\"View all posts\"\u003e\n                                                                            \u003cspan\u003eView all posts\u003c/span\u003e\n                                                                        \u003c/a\u003e\n                                                                    \u003c/span\u003e\n                                                                                                                                \u003ca aria-label=\"Email\" href=\"https://sciencebasedmedicine.org/cdn-cgi/l/email-protection#d2b8bdbcb3a6bab3bcfcbabda5b3a0b692bcaba7beb3bcb5bdbcb7fcbda0b5\" target=\"_self\"\u003e\u003cspan\u003e\u003c/span\u003e \u003c/a\u003e\n                                                                                                                            \u003c/p\u003e\u003c/div\u003e\n                                                                                                                                                                                                                        \u003c/li\u003e\n                                                                                                                                                                                                                                    \u003c/ul\u003e\n                                                                            \u003c/span\u003e\n                                                                                                                                                                                    \u003c/p\u003e\n                        \u003c/div\u003e\n                    \n                    \n                \n                                \n        \n        \n\n\t\u003c/div\u003e\n\n\t\n\t\t\t\n\t\n\u003c/article\u003e\n\t\u003cdiv\u003e\n\t\t\t\u003ch3\u003e\n\t\t\t\t\t\t\t\t\tPosted by\t\t\t\t\t\t\t\tJonathan Howard\u003c/h3\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003eDr. Jonathan Howard is a neurologist and psychiatrist who has been interested in vaccines since long before COVID-19.  He is the author of \u0026#34;We Want Them Infected: How the failed quest for herd immunity led doctors to embrace the anti-vaccine movement and blinded Americans to the threat of COVID.\u0026#34;\u003c/p\u003e\n\t\t\t\n\t\t\t\n\t\t\u003c/div\u003e\n\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n            \n\n            \n\n\n    \u003c/main\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-10-11T03:09:00-04:00",
  "modifiedTime": "2024-10-11T16:28:01Z"
}
