{
  "id": "e11c1bac-b7f5-485d-8c9e-0124ba0a2e77",
  "title": "Seeing more in expansion microscopy: New methods light up lipid membranes and allow for high-resolution protein mapping",
  "link": "https://phys.org/news/2025-03-expansion-microscopy-methods-lipid-membranes.html",
  "description": "In biology, seeing can lead to understanding, and researchers in Professor Edward Boyden's lab at the McGovern Institute for Brain Research are committed to bringing life into sharper focus. With a pair of new methods, they are expanding the capabilities of expansion microscopy—a high-resolution imaging technique the group introduced in 2015—so researchers everywhere can see more when they look at cells and tissues under a light microscope.",
  "author": "",
  "published": "Mon, 03 Mar 2025 17:20:05 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Cell \u0026 Microbiology Molecular \u0026 Computational biology"
  ],
  "byline": "Jennifer Michalowski",
  "length": 10657,
  "excerpt": "In biology, seeing can lead to understanding, and researchers in Professor Edward Boyden's lab at the McGovern Institute for Brain Research are committed to bringing life into sharper focus. With a pair of new methods, they are expanding the capabilities of expansion microscopy—a high-resolution imaging technique the group introduced in 2015—so researchers everywhere can see more when they look at cells and tissues under a light microscope.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "Composite image of several synaptic, beta-amyloid, and other cell type marker proteins in the ~18x expanded brain of wild-type (gray) and 5xFAD Alzheimer's disease model mice (pink) captured using multiExR. Each color represents a different protein. Credit: Boyden Lab In biology, seeing can lead to understanding, and researchers in Professor Edward Boyden's lab at the McGovern Institute for Brain Research are committed to bringing life into sharper focus. With a pair of new methods, they are expanding the capabilities of expansion microscopy—a high-resolution imaging technique the group introduced in 2015—so researchers everywhere can see more when they look at cells and tissues under a light microscope. \"We want to see everything, so we're always trying to improve it,\" says Boyden, the Y. Eva Tan Professor in Neurotechnology at MIT. \"A snapshot of all life, down to its fundamental building blocks, is really the goal.\" Boyden is also a Howard Hughes Medical Institute investigator and a member of the Yang Tan Collective at MIT. With new ways of staining their samples and processing images, users of expansion microscopy can now see vivid outlines of the shapes of cells in their images and pinpoint the locations of many different proteins inside a single tissue sample with resolution that far exceeds that of conventional light microscopy. These advances, both reported in open-access form in the journal Nature Communications, enable new ways of tracing the slender projections of neurons and visualizing spatial relationships between molecules that contribute to health and disease. Expansion microscopy uses a water-absorbing hydrogel to physically expand biological tissues. After a tissue sample has been permeated by the hydrogel, it is hydrated. The hydrogel swells as it absorbs water, preserving the relative locations of molecules in the tissue as it gently pulls them away from one another. As a result, crowded cellular components appear separate and distinct when the expanded tissue is viewed under a light microscope. The approach, which can be performed using standard laboratory equipment, has made super-resolution imaging accessible to most research teams. Since first developing expansion microscopy, Boyden and his team have continued to enhance the method—increasing its resolution, simplifying the procedure, devising new features, and integrating it with other tools. Visualizing cell membranes One of the team's latest advances is a method called ultrastructural membrane expansion microscopy (umExM), which they described in the Feb. 12 issue of Nature Communications. With it, biologists can use expansion microscopy to visualize the thin membranes that form the boundaries of cells and enclose the organelles inside them. These membranes, built mostly of molecules called lipids, have been notoriously difficult to densely label in intact tissues for imaging with light microscopy. Now, researchers can use umExM to study cellular ultrastructure and organization within tissues. Tay Shin SM '20, Ph.D. '23, a former graduate student in Boyden's lab and a J. Douglas Tan Fellow in the Tan-Yang Center for Autism Research at MIT, led the development of umExM. \"Our goal was very simple at first: Let's label membranes in intact tissue, much like how an electron microscope uses osmium tetroxide to label membranes to visualize the membranes in tissue,\" he says. \"It turns out that it's extremely hard to achieve this.\" The team first needed to design a label that would make the membranes in tissue samples visible under a light microscope. \"We almost had to start from scratch,\" Shin says. \"We really had to think about the fundamental characteristics of the probe that is going to label the plasma membrane, and then think about how to incorporate them into expansion microscopy.\" That meant engineering a molecule that would associate with the lipids that make up the membrane and link it to both the hydrogel used to expand the tissue sample and a fluorescent molecule for visibility. After optimizing the expansion microscopy protocol for membrane visualization and extensively testing and improving potential probes, Shin found success one late night in the lab. He placed an expanded tissue sample on a microscope and saw sharp outlines of cells. Because of the high resolution enabled by expansion, the method allowed Boyden's team to identify even the tiny dendrites that protrude from neurons and clearly see the long extensions of their slender axons. That kind of clarity could help researchers follow individual neurons' paths within the densely interconnected networks of the brain, the researchers say. Boyden calls tracing these neural processes \"a top priority of our time in brain science.\" Such tracing has traditionally relied heavily on electron microscopy, which requires specialized skills and expensive equipment. Shin says that because expansion microscopy uses a standard light microscope, it is far more accessible to laboratories worldwide. Shin and Boyden point out that users of expansion microscopy can learn even more about their samples when they pair the new ability to reveal lipid membranes with fluorescent labels that show where specific proteins are located. \"That's important, because proteins do a lot of the work of the cell, but you want to know where they are with respect to the cell's structure,\" Boyden says. One sample, many proteins To that end, researchers no longer have to choose just a few proteins to see when they use expansion microscopy. With a new method called multiplexed expansion revealing (multiExR), users can now label and see more than 20 different proteins in a single sample. Biologists can use the method to visualize sets of proteins, see how they are organized with respect to one another, and generate new hypotheses about how they might interact. A key to that new method, reported Nov. 9, 2024, in Nature Communications, is the ability to repeatedly link fluorescently labeled antibodies to specific proteins in an expanded tissue sample, image them, then strip these away and use a new set of antibodies to reveal a new set of proteins. Postdoc Jinyoung Kang fine-tuned each step of this process, assuring tissue samples stayed intact and the labeled proteins produced bright signals in each round of imaging. After capturing many images of a single sample, Boyden's team faced another challenge: how to ensure those images were in perfect alignment so they could be overlaid with one another, producing a final picture that showed the precise positions of all of the proteins that had been labeled and visualized one by one. Expansion microscopy lets biologists visualize some of cells' tiniest features—but to find the same features over and over again during multiple rounds of imaging, Boyden's team first needed to home in on a larger structure. \"These fields of view are really tiny, and you're trying to find this really tiny field of view in a gel that's actually become quite large once you've expanded it,\" explains Margaret Schroeder, a graduate student in Boyden's lab who, with Kang, led the development of multiExR. To navigate to the right spot every time, the team decided to label the blood vessels that pass through each tissue sample and use these as a guide. To enable precise alignment, certain fine details also needed to consistently appear in every image; for this, the team labeled several structural proteins. With these reference points and customized imaging processing software, the team was able to integrate all of their images of a sample into one, revealing how proteins that had been visualized separately were arranged relative to one another. The team used multiExR to look at amyloid plaques—the aberrant protein clusters that notoriously develop in brains affected by Alzheimer's disease. \"We could look inside those amyloid plaques and ask, what's inside of them? And because we can stain for many different proteins, we could do a high-throughput exploration,\" Boyden says. The team chose 23 different proteins to view in their images. The approach revealed some surprises, such as the presence of certain neurotransmitter receptors (AMPARs). \"Here's one of the most famous receptors in all of neuroscience, and there it is, hiding out in one of the most famous molecular hallmarks of pathology in neuroscience,\" says Boyden. It's unclear what role, if any, the receptors play in Alzheimer's disease—but the finding illustrates how the ability to see more inside cells can expose unexpected aspects of biology and raise new questions for research. More information: Tay Won Shin et al, Dense, continuous membrane labeling and expansion microscopy visualization of ultrastructure in tissues, Nature Communications (2025). DOI: 10.1038/s41467-025-56641-z Jinyoung Kang et al, Multiplexed expansion revealing for imaging multiprotein nanostructures in healthy and diseased brain, Nature Communications (2024). DOI: 10.1038/s41467-024-53729-w Journal information: Nature Communications This story is republished courtesy of MIT News (web.mit.edu/newsoffice/), a popular site that covers news about MIT research, innovation and teaching.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/seeing-more-in-expansi.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n                \n\u003cfigure data-lightbox=\"\"\u003e\n    \u003cdiv id=\"i1202959\"\u003e\n        \u003ca href=\"https://scx2.b-cdn.net/gfx/news/2025/seeing-more-in-expansi.jpg\" target=\"_self\"\u003e\n            \u003cpicture\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/seeing-more-in-expansi.jpg?f=webp 800w, https://scx1.b-cdn.net/csz/news/500a/2025/seeing-more-in-expansi.jpg?f=webp 500w\" sizes=\"(max-width: 500px) 500px, 800px\" type=\"image/webp\"/\u003e\n                \u003csource srcset=\"https://scx1.b-cdn.net/csz/news/800a/2025/seeing-more-in-expansi.jpg 800w, https://scx1.b-cdn.net/csz/news/500a/2025/seeing-more-in-expansi.jpg 500w\" sizes=\"(max-width: 500px) 500px, 800px\"/\u003e\n                \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/seeing-more-in-expansi.jpg\" width=\"800\" height=\"530\" alt=\"Seeing more in expansion microscopy\" title=\"Composite image of several synaptic, beta-amyloid, and other cell type marker proteins in the ~18x expanded brain of wild-type (gray) and 5xFAD Alzheimer\u0026#39;s disease model mice (pink) captured using multiExR. Each color represents a different protein. Credit: Boyden Lab\" loading=\"lazy\"/\u003e\n            \u003c/picture\u003e\n        \u003c/a\u003e\n    \u003c/div\u003e\n\n            \u003cfigcaption\u003e\n            \u003cp\u003eComposite image of several synaptic, beta-amyloid, and other cell type marker proteins in the ~18x expanded brain of wild-type (gray) and 5xFAD Alzheimer\u0026#39;s disease model mice (pink) captured using multiExR. Each color represents a different protein. Credit: Boyden Lab\u003c/p\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\u003cp\u003eIn biology, seeing can lead to understanding, and researchers in Professor Edward Boyden\u0026#39;s lab at the McGovern Institute for Brain Research are committed to bringing life into sharper focus. With a pair of new methods, they are expanding the capabilities of expansion microscopy—a high-resolution imaging technique the group introduced in 2015—so researchers everywhere can see more when they look at cells and tissues under a light microscope.\u003c/p\u003e\n\n                \n                                \n                \n                                                            \u003cp\u003e\u0026#34;We want to see everything, so we\u0026#39;re always trying to improve it,\u0026#34; says Boyden, the Y. Eva Tan Professor in Neurotechnology at MIT. \u0026#34;A snapshot of all life, down to its fundamental building blocks, is really the goal.\u0026#34; Boyden is also a Howard Hughes Medical Institute investigator and a member of the Yang Tan Collective at MIT.\u003c/p\u003e\n\u003cp\u003eWith new ways of staining their samples and processing images, users of \u003ca href=\"https://phys.org/tags/expansion+microscopy/\" rel=\"tag\"\u003eexpansion microscopy\u003c/a\u003e can now see vivid outlines of the shapes of cells in their images and pinpoint the locations of many different proteins inside a single tissue sample with resolution that far exceeds that of conventional light microscopy. These advances, both reported in open-access form in the journal \u003ci\u003eNature Communications\u003c/i\u003e, enable new ways of tracing the slender projections of neurons and visualizing spatial relationships between molecules that contribute to health and disease.\u003c/p\u003e\n\u003cp\u003eExpansion microscopy uses a water-absorbing hydrogel to physically expand biological tissues. After a tissue sample has been permeated by the hydrogel, it is hydrated. The hydrogel swells as it absorbs water, preserving the relative locations of molecules in the tissue as it gently pulls them away from one another.\u003c/p\u003e\n\u003cp\u003eAs a result, crowded cellular components appear separate and distinct when the expanded tissue is viewed under a light microscope. The approach, which can be performed using standard laboratory equipment, has made super-resolution imaging accessible to most research teams.\u003c/p\u003e\n\u003cp\u003eSince first developing expansion microscopy, Boyden and his team have continued to enhance the method—increasing its resolution, simplifying the procedure, devising new features, and integrating it with other tools.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eVisualizing cell membranes\u003c/h2\u003e\n\u003cp\u003eOne of the team\u0026#39;s latest advances is a method called ultrastructural membrane expansion microscopy (umExM), which they \u003ca href=\"https://www.nature.com/articles/s41467-025-56641-z\" target=\"_blank\"\u003edescribed\u003c/a\u003e in the Feb. 12 issue of \u003ci\u003eNature Communications\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eWith it, biologists can use expansion microscopy to visualize the thin membranes that form the boundaries of cells and enclose the organelles inside them. These membranes, built mostly of molecules called lipids, have been notoriously difficult to densely label in intact tissues for imaging with light microscopy. Now, researchers can use umExM to study cellular ultrastructure and organization within tissues.\u003c/p\u003e\n\u003cp\u003eTay Shin SM \u0026#39;20, Ph.D. \u0026#39;23, a former graduate student in Boyden\u0026#39;s lab and a J. Douglas Tan Fellow in the Tan-Yang Center for Autism Research at MIT, led the development of umExM. \u0026#34;Our goal was very simple at first: Let\u0026#39;s label membranes in intact tissue, much like how an electron microscope uses osmium tetroxide to label membranes to visualize the membranes in tissue,\u0026#34; he says. \u0026#34;It turns out that it\u0026#39;s extremely hard to achieve this.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe team first needed to design a label that would make the membranes in tissue samples visible under a light microscope. \u0026#34;We almost had to start from scratch,\u0026#34; Shin says. \u0026#34;We really had to think about the fundamental characteristics of the probe that is going to label the plasma membrane, and then think about how to incorporate them into expansion microscopy.\u0026#34; That meant engineering a molecule that would associate with the lipids that make up the membrane and link it to both the hydrogel used to expand the tissue sample and a fluorescent molecule for visibility.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eAfter optimizing the expansion microscopy protocol for membrane visualization and extensively testing and improving potential probes, Shin found success one late night in the lab. He placed an expanded tissue sample on a microscope and saw sharp outlines of cells.\u003c/p\u003e\n\u003cp\u003eBecause of the high resolution enabled by expansion, the method allowed Boyden\u0026#39;s team to identify even the tiny dendrites that protrude from neurons and clearly see the long extensions of their slender axons. That kind of clarity could help researchers follow individual neurons\u0026#39; paths within the densely interconnected networks of the brain, the researchers say.\u003c/p\u003e\n\u003cp\u003eBoyden calls tracing these neural processes \u0026#34;a top priority of our time in brain science.\u0026#34; Such tracing has traditionally relied heavily on electron microscopy, which requires specialized skills and expensive equipment. Shin says that because expansion microscopy uses a standard \u003ca href=\"https://phys.org/tags/light+microscope/\" rel=\"tag\"\u003elight microscope\u003c/a\u003e, it is far more accessible to laboratories worldwide.\u003c/p\u003e\n\u003cp\u003eShin and Boyden point out that users of expansion microscopy can learn even more about their samples when they pair the new ability to reveal lipid membranes with fluorescent labels that show where specific proteins are located. \u0026#34;That\u0026#39;s important, because proteins do a lot of the work of the cell, but you want to know where they are with respect to the cell\u0026#39;s structure,\u0026#34; Boyden says.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003ch2\u003eOne sample, many proteins\u003c/h2\u003e\n\u003cp\u003eTo that end, researchers no longer have to choose just a few proteins to see when they use expansion microscopy. With a new method called multiplexed expansion revealing (multiExR), users can now label and see more than 20 different proteins in a single sample. Biologists can use the method to visualize sets of proteins, see how they are organized with respect to one another, and generate new hypotheses about how they might interact.\u003c/p\u003e\n\u003cp\u003eA key to that new method, \u003ca href=\"https://www.nature.com/articles/s41467-024-53729-w\" target=\"_blank\"\u003ereported\u003c/a\u003e Nov. 9, 2024, in \u003ci\u003eNature Communications\u003c/i\u003e, is the ability to repeatedly link fluorescently labeled antibodies to specific proteins in an expanded tissue sample, image them, then strip these away and use a new set of antibodies to reveal a new set of proteins. Postdoc Jinyoung Kang fine-tuned each step of this process, assuring tissue samples stayed intact and the labeled proteins produced bright signals in each round of imaging.\u003c/p\u003e\n\u003cp\u003eAfter capturing many images of a single sample, Boyden\u0026#39;s team faced another challenge: how to ensure those images were in perfect alignment so they could be overlaid with one another, producing a final picture that showed the precise positions of all of the proteins that had been labeled and visualized one by one.\u003c/p\u003e\n\u003cp\u003eExpansion microscopy lets biologists visualize some of cells\u0026#39; tiniest features—but to find the same features over and over again during multiple rounds of imaging, Boyden\u0026#39;s team first needed to home in on a larger structure. \u0026#34;These fields of view are really tiny, and you\u0026#39;re trying to find this really tiny field of view in a gel that\u0026#39;s actually become quite large once you\u0026#39;ve expanded it,\u0026#34; explains Margaret Schroeder, a graduate student in Boyden\u0026#39;s lab who, with Kang, led the development of multiExR.\u003c/p\u003e\n\n                                                                                  \n                                                                    \u003cp\u003eTo navigate to the right spot every time, the team decided to label the blood vessels that pass through each tissue sample and use these as a guide. To enable precise alignment, certain fine details also needed to consistently appear in every image; for this, the team labeled several structural proteins. With these reference points and customized imaging processing software, the team was able to integrate all of their images of a sample into one, revealing how proteins that had been visualized separately were arranged relative to one another.\u003c/p\u003e\n\u003cp\u003eThe team used multiExR to look at amyloid plaques—the aberrant \u003ca href=\"https://phys.org/tags/protein/\" rel=\"tag\"\u003eprotein\u003c/a\u003e clusters that notoriously develop in brains affected by Alzheimer\u0026#39;s disease. \u0026#34;We could look inside those \u003ca href=\"https://phys.org/tags/amyloid+plaques/\" rel=\"tag\"\u003eamyloid plaques\u003c/a\u003e and ask, what\u0026#39;s inside of them? And because we can stain for many different proteins, we could do a high-throughput exploration,\u0026#34; Boyden says. The team chose 23 different proteins to view in their images. The approach revealed some surprises, such as the presence of certain neurotransmitter receptors (AMPARs).\u003c/p\u003e\n\u003cp\u003e\u0026#34;Here\u0026#39;s one of the most famous receptors in all of neuroscience, and there it is, hiding out in one of the most famous molecular hallmarks of pathology in neuroscience,\u0026#34; says Boyden. It\u0026#39;s unclear what role, if any, the receptors play in Alzheimer\u0026#39;s disease—but the finding illustrates how the ability to see more inside cells can expose unexpected aspects of biology and raise new questions for research.\u003c/p\u003e\n\n                                                            \n                  \n\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eMore information:\u003c/strong\u003e \n                                Tay Won Shin et al, Dense, continuous membrane labeling and expansion microscopy visualization of ultrastructure in tissues, \u003ci\u003eNature Communications\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1038/s41467-025-56641-z\" target=\"_blank\"\u003eDOI: 10.1038/s41467-025-56641-z\u003c/a\u003e\n\u003c/p\u003e\u003cp\u003eJinyoung Kang et al, Multiplexed expansion revealing for imaging multiprotein nanostructures in healthy and diseased brain, \u003ci\u003eNature Communications\u003c/i\u003e (2024). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1038/s41467-024-53729-w\" target=\"_blank\"\u003eDOI: 10.1038/s41467-024-53729-w\u003c/a\u003e\u003c/p\u003e\n\n                            \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t                            \u003cp\u003e\n                                \u003cstrong\u003eJournal information:\u003c/strong\u003e \n                                \t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/nature-communications/\"\u003eNature Communications\u003c/a\u003e\n                                                                                    \u003ca href=\"https://www.nature.com/ncomms/index.html\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\u003ci\u003e\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e\n                                                                                 \n\t\t\t\t\t\t\t\t                            \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n                                    \n                \n\n                                    \u003cp\u003e\u003ci\u003eThis story is republished courtesy of MIT News (\u003ca href=\"http://web.mit.edu/newsoffice/\" target=\"_blank\"\u003eweb.mit.edu/newsoffice/\u003c/a\u003e), a popular site that covers news about MIT research, innovation and teaching.\u003c/i\u003e\u003c/p\u003e\n                \t\t\t\t\t    \n\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2025-03-03T17:20:05-05:00",
  "modifiedTime": null
}
