{
  "id": "e326206d-2083-4e84-a1e0-be7eefe59a22",
  "title": "Early galaxies may contribute to the 'afterglow' of the universe",
  "link": "https://phys.org/news/2025-05-early-galaxies-contribute-afterglow-universe.html",
  "description": "The \"afterglow\" of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to form. Researchers at the Universities of Bonn, Prague and Nanjing calculate that the strength of this radiation has probably been overestimated up to now. If the results prove to be accurate, it would call into question the theoretical foundation of the standard model of cosmology.",
  "author": "",
  "published": "Fri, 09 May 2025 15:59:42 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Astronomy"
  ],
  "byline": "Katrin Piecha",
  "length": 6123,
  "excerpt": "The \"afterglow\" of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to form. Researchers at the Universities of Bonn, Prague and Nanjing calculate that the strength of this radiation has probably been overestimated up to now. If the results prove to be accurate, it would call into question the theoretical foundation of the standard model of cosmology.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "The huge elliptical galaxy ESO 325-G004 shone 10,000 times brighter when it formed than it does today. These types of galaxies briefly lit up the entire universe—and contributed to the background radiation we can measure today. Credit: NASA, ESA and The Hubble Heritage Team (STScI/AURA); J. Blakeslee (Washington State University) The \"afterglow\" of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to form. Researchers at the Universities of Bonn, Prague and Nanjing calculate that the strength of this radiation has probably been overestimated up to now. If the results prove to be accurate, it would call into question the theoretical foundation of the standard model of cosmology. The results have now been published in the journal Nuclear Physics B. Space, time and matter emerged from nothing 13.8 billion years ago. The Big Bang marked the beginning of our universe—at least according to the standard model of cosmology. The universe had already expanded massively in the first 380,000 years after the Big Bang, cooling down substantially in the process. It was only at this point that electrons and protons were able to unite to form electrically neutral hydrogen atoms. The universe became transparent to light as a result, because photons were no longer able to exchange energy with matter. This marked the birth of cosmic microwave background radiation. We can still detect this radiation today using highly sensitive telescopes. As it has been traveling to us for almost 13.8 billion years, it provides an insight into the birth and first few hours of the existence of the universe. \"According to our calculations, however, it could be that this background radiation doesn't exist at all,\" explains Prof. Dr. Pavel Kroupa from the Helmholtz Institute for Radiation and Nuclear Physics at the University of Bonn and Charles University in Prague. \"At the very least, we are convinced that its strength has been overestimated.\" A powerful star fire overlays the background radiation The physicist, together with scientist Dr. Eda Gjergo from the University of Nanjing in China, has been investigating a particular group of galaxies called elliptical galaxies. \"The universe has been expanding since the Big Bang, like dough that is rising,\" says Kroupa. \"This means that the distance between galaxies is increasing constantly. We have measured how far apart elliptical galaxies are from one another today. \"Using these data and taking into account the characteristics of this group of galaxies, we were then able to use the speed of expansion to determine when they first formed.\" It was previously already known that elliptical galaxies were the first galaxies that formed in the young universe. Vast volumes of gas accumulated to give rise to hundreds of billions of stars forming these galaxies. \"Our results now show that this entire process only lasted for a few hundred million years—which is relatively short on a cosmological time scale,\" emphasizes Dr. Gjergo. \"During this time, the nuclear reactions in these ignited stars were intensely luminous.\" Gjergo and Kroupa have calculated the power of this early star fire. They must have blazed so brightly that we are still able to detect them today. \"Our calculations indicate that some of the cosmic background radiation actually originates from the formation of the elliptical galaxies,\" says Gjergo. \"This accounts for at least 1.4% of the radiation but could even account for all of it.\" Unevenness leads to the creation of galaxies Even if it accounts for just 1.4%, this would presumably have huge consequences for the standard model. Measurements carried out over the last few decades have shown that the background radiation is not completely uniform. Instead, there are very small differences in its intensity depending on the direction in which you look. Researchers have interpreted this observation so far as proof that gas was not uniformly distributed after the Big Bang. Instead, it was slightly less dense in some areas than in others. This is also the reason why galaxies were able to form in the first place: The denser areas acted as condensation points where the gas was compressed under the force of its own gravity to form stars. Without this uneven distribution of gas, we would probably not even exist. However, the variations in the background radiation that form the basis of this theory are only a few thousandths of a percentage point. The question now is how reliable these measurements can actually be if elliptical galaxies (which are also not uniformly distributed) account for at least 1.4% of the total measured radiation. \"Our results are a problem for the standard model of cosmology,\" says Kroupa. \"It might be necessary to rewrite the history of the universe, at least in part.\" More information: Eda Gjergo et al, The Impact of Early Massive Galaxy Formation on the Cosmic Microwave Background, Nuclear Physics B (2025). DOI: 10.1016/j.nuclphysb.2025.116931 Citation: Early galaxies may contribute to the 'afterglow' of the universe (2025, May 9) retrieved 9 May 2025 from https://phys.org/news/2025-05-early-galaxies-contribute-afterglow-universe.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2025/early-galaxies-contrib.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/early-galaxies-contrib.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/early-galaxies-contrib.jpg\" data-sub-html=\"The huge elliptical galaxy ESO 325-G004 shone 10,000 times brighter when it formed than it does today. These types of galaxies briefly lit up the entire universe—and contributed to the background radiation we can measure today. Credit: NASA, ESA and The Hubble Heritage Team (STScI/AURA); J. Blakeslee (Washington State University)\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/early-galaxies-contrib.jpg\" alt=\"Early galaxies contribute to the \u0026#34;afterglow\u0026#34; of the universe\" title=\"The huge elliptical galaxy ESO 325-G004 shone 10,000 times brighter when it formed than it does today. These types of galaxies briefly lit up the entire universe—and contributed to the background radiation we can measure today. Credit: NASA, ESA and The Hubble Heritage Team (STScI/AURA); J. Blakeslee (Washington State University)\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                The huge elliptical galaxy ESO 325-G004 shone 10,000 times brighter when it formed than it does today. These types of galaxies briefly lit up the entire universe—and contributed to the background radiation we can measure today. Credit: NASA, ESA and The Hubble Heritage Team (STScI/AURA); J. Blakeslee (Washington State University)\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eThe \u0026#34;afterglow\u0026#34; of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to form. Researchers at the Universities of Bonn, Prague and Nanjing calculate that the strength of this radiation has probably been overestimated up to now. If the results prove to be accurate, it would call into question the theoretical foundation of the standard model of cosmology.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eThe results have now been \u003ca href=\"https://linkinghub.elsevier.com/retrieve/pii/S0550321325001403\" target=\"_blank\"\u003epublished\u003c/a\u003e in the journal \u003ci\u003eNuclear Physics B\u003c/i\u003e.\u003c/p\u003e\n\u003cp\u003eSpace, time and matter emerged from nothing 13.8 billion years ago. The Big Bang marked the beginning of our universe—at least according to the standard model of cosmology. The universe had already expanded massively in the first 380,000 years after the Big Bang, cooling down substantially in the process.\u003c/p\u003e\n\u003cp\u003eIt was only at this point that electrons and protons were able to unite to form electrically neutral hydrogen atoms. The universe became transparent to light as a result, because photons were no longer able to exchange energy with matter. This marked the birth of cosmic microwave \u003ca href=\"https://phys.org/tags/background+radiation/\" rel=\"tag\"\u003ebackground radiation\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eWe can still detect this radiation today using highly sensitive telescopes. As it has been traveling to us for almost 13.8 billion years, it provides an insight into the birth and first few hours of the existence of the universe.\u003c/p\u003e\n\u003cp\u003e\u0026#34;According to our calculations, however, it could be that this background radiation doesn\u0026#39;t exist at all,\u0026#34; explains Prof. Dr. Pavel Kroupa from the Helmholtz Institute for Radiation and Nuclear Physics at the University of Bonn and Charles University in Prague. \u0026#34;At the very least, we are convinced that its strength has been overestimated.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eA powerful star fire overlays the background radiation\u003c/h2\u003e\n\u003cp\u003eThe physicist, together with scientist Dr. Eda Gjergo from the University of Nanjing in China, has been investigating a particular group of galaxies called elliptical galaxies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The universe has been expanding since the Big Bang, like dough that is rising,\u0026#34; says Kroupa. \u0026#34;This means that the distance between galaxies is increasing constantly. We have measured how far apart elliptical galaxies are from one another today. \u0026#34;Using these data and taking into account the characteristics of this group of galaxies, we were then able to use the speed of expansion to determine when they first formed.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIt was previously already known that elliptical galaxies were the first galaxies that formed in the young universe. Vast volumes of gas accumulated to give rise to hundreds of billions of stars forming these galaxies.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our results now show that this entire process only lasted for a few hundred million years—which is relatively short on a cosmological time scale,\u0026#34; emphasizes Dr. Gjergo. \u0026#34;During this time, the \u003ca href=\"https://phys.org/tags/nuclear+reactions/\" rel=\"tag\"\u003enuclear reactions\u003c/a\u003e in these ignited stars were intensely luminous.\u0026#34;\u003c/p\u003e\n\u003cp\u003eGjergo and Kroupa have calculated the power of this early star fire. They must have blazed so brightly that we are still able to detect them today.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our calculations indicate that some of the \u003ca href=\"https://phys.org/tags/cosmic+background+radiation/\" rel=\"tag\"\u003ecosmic background radiation\u003c/a\u003e actually originates from the formation of the elliptical galaxies,\u0026#34; says Gjergo. \u0026#34;This accounts for at least 1.4% of the radiation but could even account for all of it.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eUnevenness leads to the creation of galaxies\u003c/h2\u003e\n\u003cp\u003eEven if it accounts for just 1.4%, this would presumably have huge consequences for the standard model. Measurements carried out over the last few decades have shown that the background radiation is not completely uniform. Instead, there are very small differences in its intensity depending on the direction in which you look.\u003c/p\u003e\n\u003cp\u003eResearchers have interpreted this observation so far as proof that gas was not uniformly distributed after the Big Bang. Instead, it was slightly less dense in some areas than in others. This is also the reason why galaxies were able to form in the first place: The denser areas acted as condensation points where the gas was compressed under the force of its own gravity to form stars.\u003c/p\u003e\n\u003cp\u003eWithout this uneven distribution of gas, we would probably not even exist. However, the variations in the background radiation that form the basis of this theory are only a few thousandths of a percentage point. The question now is how reliable these measurements can actually be if \u003ca href=\"https://phys.org/tags/elliptical+galaxies/\" rel=\"tag\"\u003eelliptical galaxies\u003c/a\u003e (which are also not uniformly distributed) account for at least 1.4% of the total measured radiation.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Our results are a problem for the standard model of cosmology,\u0026#34; says Kroupa. \u0026#34;It might be necessary to rewrite the history of the universe, at least in part.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tEda Gjergo et al, The Impact of Early Massive Galaxy Formation on the Cosmic Microwave Background, \u003ci\u003eNuclear Physics B\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1016/j.nuclphysb.2025.116931\" target=\"_blank\"\u003eDOI: 10.1016/j.nuclphysb.2025.116931\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tEarly galaxies may contribute to the \u0026#39;afterglow\u0026#39; of the universe (2025, May 9)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 9 May 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-05-early-galaxies-contribute-afterglow-universe.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-09T15:59:42-04:00",
  "modifiedTime": null
}
