{
  "id": "e7edd6e8-293d-45f3-976b-048a39bd2ed6",
  "title": "Placenta and hormone levels in the womb may have been key drivers in human brain evolution",
  "link": "https://phys.org/news/2025-06-placenta-hormone-womb-key-drivers.html",
  "description": "The placenta and the hormones it produces may have played a crucial role in the evolution of the human brain, while also leading to the behavioral traits that have made human societies able to thrive and expand, according to a new hypothesis proposed by researchers from the Universities of Cambridge and Oxford.",
  "author": "",
  "published": "Thu, 19 Jun 2025 19:10:01 EDT",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Evolution"
  ],
  "byline": "University of Cambridge",
  "length": 6643,
  "excerpt": "The placenta and the hormones it produces may have played a crucial role in the evolution of the human brain, while also leading to the behavioral traits that have made human societies able to thrive and expand, according to a new hypothesis proposed by researchers from the Universities of Cambridge and Oxford.",
  "siteName": "Phys.org",
  "favicon": "https://phys.b-cdn.net/tmpl/v6/img/favicons/web-app-manifest-512x512.png",
  "text": "Credit: Pixabay/CC0 Public Domain The placenta and the hormones it produces may have played a crucial role in the evolution of the human brain, while also leading to the behavioral traits that have made human societies able to thrive and expand, according to a new hypothesis proposed by researchers from the Universities of Cambridge and Oxford. Dr. Alex Tsompanidis, senior researcher at the Autism Research Center at the University of Cambridge, and the lead author of this new study, said, \"Small variations in the prenatal levels of steroid hormones, like testosterone and estrogen, can predict the rate of social and cognitive learning in infants and even the likelihood of conditions such as autism. This prompted us to consider their relevance for human evolution.\" One explanation for the evolution of the human brain may be the way humans adapted to be social. Professor Robin Dunbar, an evolutionary biologist at the University of Oxford and joint senior author of the new study, said, \"We've known for a long time that living in larger, more complex social groups is associated with increases in the size of the brain. But we still don't know what mechanisms may link these behavioral and physical adaptations in humans.\" In this new paper, published in Evolutionary Anthropology, the researchers now propose that the mechanism may be found in prenatal sex steroid hormones, such as testosterone or estrogens, and the way these affect the developing brain and behavior in humans. Using mini-brains—clusters of human neuronal cells that are grown in a petri dish from donors' stem cells—other scientists have been able to study, for the first time, the effects of these hormones on the human brain. Recent discoveries have shown that testosterone can increase the size of the brain, while estrogens can improve the connectivity between neurons. In both humans and other primates such as chimpanzees and gorillas, the placenta can link the mother's and baby's endocrine systems to produce these hormones in varying amounts. Professor Graham Burton, founding director of the Loke Center of Trophoblast Research at the University of Cambridge and co-author of the new paper, said, \"The placenta regulates the duration of the pregnancy and the supply of nutrients to the fetus, both of which are crucial for the development of our species's characteristically large brains. But the advantage of human placentas over those of other primates has been less clear.\" Two previous studies show that levels of estrogen during pregnancy are higher in human pregnancies than in other primate species. Another characteristic of humans as a species is our ability to form and maintain large social groups, larger than other primates and other extinct species, such as Neanderthals. But to be able to do this, humans must have adapted in ways that maintain high levels of fertility, while also reducing competition in large groups for mates and resources. Prenatal sex steroid hormones, such as testosterone and estrogen, are also important for regulating the way males and females interact and develop, a process known as sex differentiation. For example, having higher testosterone relative to estrogen leads to more male-like features in anatomy (e.g., in physical size and strength) and in behavior (e.g., in competition). But in humans, while these on-average sex differences exist, they are reduced, compared to our closest primate relatives and relative to other extinct human species (such as the Neanderthals). Instead, anatomical features that are specific to humans appear to be related more to aspects of female rather than male biology, and to the effects of estrogens (e.g., reduced body hair, and a large ratio between the second and fourth digit). The researchers propose that the key to explaining this may lie again with the placenta, which rapidly turns testosterone to estrogens, using an enzyme called aromatase. Recent discoveries show that humans have higher levels of aromatase compared to macaques, and that males may have slightly higher levels compared to females. Bringing all these lines of evidence together, the authors propose that high levels of prenatal sex steroid hormones in the womb, combined with increased placental function, may have made human brains larger and more interconnected. At the same time, a lower ratio of androgens (like testosterone) to estrogens may have led to reductions in competition between males, while also improving fertility in females, allowing humans to form larger, more cohesive social groups. Professor Simon Baron-Cohen, director of the Autism Research Center at the University of Cambridge and joint senior author on the paper, said, \"We have been studying the effects of prenatal sex steroids on neurodevelopment for the past 20 years. This has led to the discovery that prenatal sex steroids are important for neurodiversity in human populations. This new hypothesis takes this further in arguing that these hormones may have also shaped the evolution of the human brain.\" Dr. Tsompanidis added, \"Our hypothesis puts pregnancy at the heart of our story as a species. The human brain is remarkable and unique, but it does not develop in a vacuum. Adaptations in the placenta and the way it produces sex steroid hormones may have been crucial for our brain's evolution, and for the emergence of the cognitive and social traits that make us human.\" More information: The placental steroid hypothesis of human brain evolution, Evolutionary Anthropology Issues News and Reviews (2025). DOI: 10.1002/evan.70003 Citation: Placenta and hormone levels in the womb may have been key drivers in human brain evolution (2025, June 19) retrieved 19 June 2025 from https://phys.org/news/2025-06-placenta-hormone-womb-key-drivers.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/hires/2022/placenta.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2022/placenta.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2022/placenta.jpg\" data-sub-html=\"Credit: Pixabay/CC0 Public Domain\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2022/placenta.jpg\" alt=\"PLACENTA\" title=\"Credit: Pixabay/CC0 Public Domain\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                Credit: Pixabay/CC0 Public Domain\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eThe placenta and the hormones it produces may have played a crucial role in the evolution of the human brain, while also leading to the behavioral traits that have made human societies able to thrive and expand, according to a new hypothesis proposed by researchers from the Universities of Cambridge and Oxford.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eDr. Alex Tsompanidis, senior researcher at the Autism Research Center at the University of Cambridge, and the lead author of this new study, said, \u0026#34;Small variations in the prenatal levels of steroid hormones, like testosterone and estrogen, can predict the rate of social and cognitive learning in infants and even the likelihood of conditions such as autism. This prompted us to consider their relevance for \u003ca href=\"https://phys.org/tags/human+evolution/\" rel=\"tag\"\u003ehuman evolution\u003c/a\u003e.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOne explanation for the evolution of the human \u003ca href=\"https://phys.org/tags/brain/\" rel=\"tag\"\u003ebrain\u003c/a\u003e may be the way humans adapted to be social. Professor Robin Dunbar, an \u003ca href=\"https://phys.org/tags/evolutionary+biologist/\" rel=\"tag\"\u003eevolutionary biologist\u003c/a\u003e at the University of Oxford and joint senior author of the new study, said, \u0026#34;We\u0026#39;ve known for a long time that living in larger, more complex social groups is associated with increases in the size of the brain. But we still don\u0026#39;t know what mechanisms may link these behavioral and physical adaptations in humans.\u0026#34;\u003c/p\u003e\n\u003cp\u003eIn this new paper, published in \u003ci\u003eEvolutionary Anthropology\u003c/i\u003e, the researchers now propose that the mechanism may be found in prenatal sex steroid hormones, such as testosterone or estrogens, and the way these affect the developing brain and behavior in humans.\u003c/p\u003e\n\u003cp\u003eUsing mini-brains—clusters of human neuronal cells that are grown in a \u003ca href=\"https://phys.org/tags/petri+dish/\" rel=\"tag\"\u003epetri dish\u003c/a\u003e from donors\u0026#39; stem cells—other scientists have been able to study, for the first time, the effects of these hormones on the human brain. Recent discoveries have shown that testosterone can increase the size of the brain, while estrogens can improve the connectivity between neurons.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn both humans and other primates such as chimpanzees and gorillas, the placenta can link the mother\u0026#39;s and baby\u0026#39;s endocrine systems to produce these hormones in varying amounts.\u003c/p\u003e\n\u003cp\u003eProfessor Graham Burton, founding director of the Loke Center of Trophoblast Research at the University of Cambridge and co-author of the new paper, said, \u0026#34;The placenta regulates the duration of the pregnancy and the supply of nutrients to the fetus, both of which are crucial for the development of our species\u0026#39;s characteristically large brains. But the advantage of human placentas over those of other primates has been less clear.\u0026#34;\u003c/p\u003e\n\u003cp\u003eTwo previous studies show that levels of estrogen during pregnancy are higher in human pregnancies than in other primate species.\u003c/p\u003e\n\u003cp\u003eAnother characteristic of humans as a species is our ability to form and maintain large social groups, larger than other primates and other extinct species, such as Neanderthals. But to be able to do this, humans must have adapted in ways that maintain high levels of fertility, while also reducing competition in large groups for mates and resources.\u003c/p\u003e\n\u003cp\u003ePrenatal sex steroid hormones, such as testosterone and estrogen, are also important for regulating the way males and females interact and develop, a process known as sex differentiation. For example, having higher testosterone relative to \u003ca href=\"https://phys.org/tags/estrogen/\" rel=\"tag\"\u003eestrogen\u003c/a\u003e leads to more male-like features in anatomy (e.g., in physical size and strength) and in behavior (e.g., in competition).\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eBut in humans, while these on-average sex differences exist, they are reduced, compared to our closest primate relatives and relative to other extinct human species (such as the Neanderthals). Instead, anatomical features that are specific to humans appear to be related more to aspects of female rather than male biology, and to the effects of estrogens (e.g., reduced body hair, and a large ratio between the second and fourth digit).\u003c/p\u003e\n\u003cp\u003eThe researchers propose that the key to explaining this may lie again with the placenta, which rapidly turns testosterone to estrogens, using an enzyme called aromatase. Recent discoveries show that humans have higher levels of aromatase compared to macaques, and that males may have slightly higher levels compared to females.\u003c/p\u003e\n\u003cp\u003eBringing all these lines of evidence together, the authors propose that high levels of prenatal sex steroid hormones in the womb, combined with increased placental function, may have made human brains larger and more interconnected. At the same time, a lower ratio of androgens (like testosterone) to estrogens may have led to reductions in competition between males, while also improving fertility in females, allowing humans to form larger, more cohesive social groups.\u003c/p\u003e\n\u003cp\u003eProfessor Simon Baron-Cohen, director of the Autism Research Center at the University of Cambridge and joint senior author on the paper, said, \u0026#34;We have been studying the effects of prenatal sex steroids on neurodevelopment for the past 20 years. This has led to the discovery that prenatal sex steroids are important for neurodiversity in human populations. This new hypothesis takes this further in arguing that these hormones may have also shaped the evolution of the human brain.\u0026#34;\u003c/p\u003e\n\u003cp\u003eDr. Tsompanidis added, \u0026#34;Our hypothesis puts pregnancy at the heart of our story as a species. The human brain is remarkable and unique, but it does not develop in a vacuum. Adaptations in the placenta and the way it produces sex steroid hormones may have been crucial for our brain\u0026#39;s evolution, and for the emergence of the cognitive and social traits that make us human.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tThe placental steroid hypothesis of human brain evolution, \u003ci\u003eEvolutionary Anthropology Issues News and Reviews\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1002/evan.70003\" target=\"_blank\"\u003eDOI: 10.1002/evan.70003\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tPlacenta and hormone levels in the womb may have been key drivers in human brain evolution (2025, June 19)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 19 June 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-06-placenta-hormone-womb-key-drivers.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-19T19:10:01-04:00",
  "modifiedTime": null
}
