{
  "id": "e9650fbd-4dfa-400c-8765-c3a7e278f369",
  "title": "The Quantum Geometry That Exists Outside of Space and Time",
  "link": "https://www.wired.com/story/physicists-reveal-a-quantum-geometry-that-exists-outside-of-space-and-time/",
  "description": "A decade after the discovery of the “amplituhedron,” physicists have excavated more of the timeless geometry underlying the standard picture of how particles move.",
  "author": "Charlie Wood",
  "published": "Sun, 03 Nov 2024 12:00:00 +0000",
  "source": "https://www.wired.com/feed/category/science/latest/rss",
  "categories": [
    "Science",
    "Science / Physics and Math",
    "Physics"
  ],
  "byline": "Charlie Wood",
  "length": 26397,
  "excerpt": "A decade after the discovery of the “amplituhedron,” physicists have excavated more of the timeless geometry underlying the standard picture of how particles move.",
  "siteName": "WIRED",
  "favicon": "",
  "text": "The original version of this story appeared in Quanta Magazine.In the fall of 2022, a Princeton University graduate student named Carolina Figueiredo stumbled onto a massive coincidence. She calculated that collisions involving three different types of subatomic particles would all produce the same wreckage. It was like laying a grid over maps of London, Tokyo, and New York and seeing that all three cities had train stations at the same coordinates.“They are very different [particle] theories. There’s no reason for them to be connected,” Figueiredo said.The coincidence soon revealed itself to be a conspiracy: The theories describing the three types of particles were, when viewed from the right perspective, essentially one. The conspiracy, Figueiredo and her colleagues realized, stems from the existence of a hidden structure, one that could potentially simplify the complex business of understanding what’s going on at the base level of reality.For nearly two decades, Figueiredo’s doctoral adviser, Nima Arkani-Hamed, has been leading a hunt for a new way of doing physics. Many physicists believe they’ve reached the end of the road when it comes to conceptualizing reality in terms of quantum events that play out in space and time. Such language can’t easily describe the beginning of the universe, for instance, when the space-time fabric likely didn’t exist in its current form. Arkani-Hamed therefore suspects that the usual notion of quantum particles moving and interacting in space-time is an approximation of deeper, more abstract concepts, which, if found, could serve as a better language for talking about quantum gravity and the origin of the universe.A major development came in 2013, when Arkani-Hamed and Jaroslav Trnka, his student at the time, discovered a jewel-like geometric object that forecasts the outcomes of certain particle interactions. They called the object the “amplituhedron.” However, the object didn’t apply to the particles of the real world. So Arkani-Hamed and his colleagues sought more such objects that would.Now Figueiredo’s conspiracy is another manifestation of abstract geometric structure that seems to underlie particle physics.“The overall program is inching closer to Nima’s long-term dream of space-time and quantum mechanics emerging from a new set of principles,” said Sebastian Mizera, a physicist who studies amplitudes at the Institute for Advanced Study in Princeton, New Jersey, but was not involved in the recent work.Like the amplituhedron, the new geometrical method, known as “surfaceology,” streamlines quantum physics by sidestepping the traditional approach, which is to track the countless ways particles can move through space-time using “Feynman diagrams.” These depictions of particles’ possible collisions and trajectories translate into complicated equations. With surfaceology, physicists can get the same result more directly.“It provides a natural framework, or a bookkeeping mechanism, to assemble very large numbers of Feynman diagrams,” said Marcus Spradlin, a physicist at Brown University who has been picking up the new tools of surfaceology. “There’s an exponential compactification in information.”Carolina Figueiredo, a graduate student at Princeton University, noticed a striking coincidence where three species of seemingly unrelated quantum particles act identically. Photograph: Andrea Kane/Institute for Advanced StudyUnlike the amplituhedron, which required exotic particles to provide a balance known as supersymmetry, surfaceology applies to more realistic, nonsupersymmetric particles. “It’s completely agnostic. It couldn’t care less about supersymmetry,” Spradlin said. “For some people, me included, I think that’s really been quite a surprise.”The question now is whether this new, more primitive geometric approach to particle physics will allow theoretical physicists to slip the confines of space and time altogether.“We needed to find some magic, and maybe this is it,” said Jacob Bourjaily, a physicist at Pennsylvania State University. “Whether it’s going to get rid of space-time, I don’t know. But it’s the first time I’ve seen a door.”The Trouble with FeynmanFigueiredo sensed the need for some new magic firsthand during the waning months of the pandemic. She was struggling with a task that has challenged physicists for more than 50 years: predicting what will happen when quantum particles collide. In the late 1940s, it took a yearslong effort by three of the brightest minds of the postwar era—Julian Schwinger, Sin-Itiro Tomonaga, and Richard Feynman—to solve the problem for electrically charged particles. Their eventual success would win them a Nobel Prize. Feynman’s scheme was the most visual, so it came to dominate the way physicists think about the quantum world.When two quantum particles come together, anything can happen. They might merge into one, split into many, disappear, or any sequence of the above. And what will actually happen is, in some sense, a combination of all these and many other possibilities. Feynman diagrams keep track of what might happen by stringing together lines representing particles’ trajectories through space-time. Each diagram captures one possible sequence of subatomic events and gives an equation for a number, called an “amplitude,” that represents the odds of that sequence taking place. Add up enough amplitudes, physicists believe, and you get stones, buildings, trees, and people. “Almost everything in the world is a concatenation of that stuff happening over and over again,” Arkani-Hamed said. “Just good old-fashioned things bouncing off each other.”There’s a puzzling tension inherent in these amplitudes—one that has vexed generations of quantum physicists going back to Feynman and Schwinger themselves. One might spend hours at a chalkboard sketching byzantine particle trajectories and evaluating fearsome formulas only to find that terms cancel out and complicated expressions melt away to leave behind extremely simple answers—in a classic example, literally the number 1.“The degree of effort required is tremendous,” Bourjaily said. “And every single time, the prediction you make mocks you with its simplicity.”Figueiredo had been wrestling with the strangeness of the situation when she attended a talk by Arkani-Hamed, a leading theoretical physicist at the IAS who has spent years seeking a new way of getting the answers without Feynman diagrams. She found her way to a series of his lectures on YouTube, in which he showed how—in special cases—one could jump straight to the amplitude of a certain outcome of a particle collision without worrying about how the particles moved through space.Illustration: Señor Salme for Quanta MagazineArkani-Hamed’s shortcuts, which involved reverse engineering answers that satisfy certain fundamental logical requirements, confirmed Figueiredo’s suspicions that alternative methods were out there. “By asking for these very simple things you could just get the answer. That was definitely striking,” she said.She began to regularly make the half-hour walk from Princeton’s campus to the IAS to work with Arkani-Hamed, a force of nature who runs on Diet Coke and an inexhaustible enthusiasm for physics.Arkani-Hamed and his collaborators aspire to bring about a conceptual revolution of the sort that rocked physics in the late 1700s. Joseph-Louis Lagrange didn’t discover any forces or laws of nature, but every physicist knows his name. He showed that you could predict the future without laboriously calculating actions and equal-and-opposite reactions in the style of Isaac Newton. Instead, Lagrange learned to predict the path an object will follow by considering the energies that different paths require and identifying the easiest path. Lagrange’s method, despite seeming like a mere mathematical convenience at the time, loosened the straitjacket of Newton’s mechanistic view of the universe as a sequence of falling dominos. Two centuries later, Lagrange’s approach provided Feynman with a more flexible framework that could accommodate the radical randomness of quantum mechanics.Now many amplitude researchers hope a reformulation of quantum physics will set the stage for the next physics revolution, a theory of quantum gravity and the origin of space-time.Nima Arkani-Hamed of the Institute for Advanced Study has spent more than a decade developing a new mathematical language for describing quantum physics that doesn’t directly refer to space, time, or quantum mechanics. Photograph: Maximilien Brice/Julien Marius OrdanA handful of mini-revolutions have already occurred. One came in the mid-2000s, when Ruth Britto, Freddy Cachazo, Bo Feng, and Edward Witten discovered the “recursion relations,” equations that let physicists condense hundreds of pages of Feynman diagrams to mere lines.Around the same time, Arkani-Hamed joined the hunt for a new conceptual perspective on particle physics, after a couple of thought experiments led him to doubt that space and time are truly well-founded physical concepts. Several years later, he and Trnka discovered the amplituhedron.The amplituhedron is a curvy shape whose contours encode the number and orientation of particles involved in an interaction. Its volume gives the amplitude for that interaction to occur. This volume equals the sum of amplitudes of all the Feynman diagrams depicting the various alternative ways the interaction could play out, but in this case you calculate the answer without reference to those spatiotemporal dynamics; all you need is the list of momentums of the particles that exist before and after the interaction.“However the scattering happens, it’s controlled by this real structure,” said Vijay Balasubramanian, a physicist at the University of Pennsylvania who studies quantum gravity. “You don’t have to talk about space-time.”The surprising discovery brought new people into the search. But the amplituhedron worked only for a theory of particles that came hand in hand with exotic partner particles, a simplifying balance called supersymmetry. (Generally speaking, one quantum “theory” describes one specific set of rules for one specific set of particles. As such, there are many quantum theories, some for real particles and others for fictitious ones.)“You’re a little bit suspicious that maybe the amazing things you’re seeing have nothing to do with the real world,” said Giulio Salvatori, a physicist who would later join the group.Giulio Salvatori, a physicist currently at the IAS and the Max Planck Institute for Physics in Germany, helped develop surfaceology—a far more efficient way of making quantum predictions. Photograph: Credit: Viktoria VasilenkoIn the following years, Arkani-Hamed’s team identified a second type of shape, the “associahedron,” that worked in a similar way. It had flat sides, and its volume gave scattering amplitudes for the particles of a simplified quantum theory, one that’s easier to study. The particles in this theory carry a type of charge called “color” that is also carried by the quarks and gluons in real-world atomic nuclei. (This charge has nothing to do with actual colors, but the mathematics of how charges combine to make color-neutral composite particles resembles how red, green and blue light together make white.)The particles of this theory also lack supersymmetric partners. The associahedron therefore represented a major step toward the real world. But the shape gave only partial answers, producing amplitudes for only the shortest sequences of subatomic events.Sensing a breakthrough was close, Arkani-Hamed recruited Salvatori and Hadleigh Frost at the University of Oxford, young physicists who had been independently advancing the understanding of the associahedron’s strange shapes, along with the mathematicians Pierre-Guy Plamondon and Hugh Thomas. In 2019, the gang started looking for a geometrical route to all of these amplitudes.Then the pandemic hit, and the team left our space-time to work in the digital ether of Zoom. They would emerge two years later with a second revolutionary way of doing quantum physics.Curves on SurfacesThe mystery confronting them was how to get the amplitudes that would usually come from the more intricate space-time trajectories, those with numerous splittings and mergings. In these cases, it wasn’t clear how to calculate an associahedron’s volume.“We couldn’t say exactly what the deep principle was,” Frost said.Arkani-Hamed was in the habit of working with the 1990s television show Twin Peaks running in the background. He found comfort in the show’s enigmatic vibe and played it dozens of times over the months he spent fiddling with assorted shapes and diagrams. “They’re trying to figure out a crazy, weird mystery with all sorts of insane characters, and so am I,” he told me over Zoom one afternoon, surrounded by the digital red drapes of the “Black Lodge,” a setting inside the Twin Peaks universe but outside its standard space-time.After repeatedly hitting dead ends, the researchers took a step back. They returned to the simpler events that they already understood, whose amplitudes came from the volumes of shapes. The shapes could be defined by polynomials—equations from high school math that sum up sequences of terms. But these were special polynomials, the group realized, in that they corresponded to curves twisting and turning on a surface. With that, they had stumbled upon the surfaces at the heart of surfaceology, their new art for predicting particle collisions.Illustration: Mark Belan for Quanta MagazineHere’s how it works. Say you need to calculate the odds of two particles colliding and three particles coming out of the wreckage. Start with a single Feynman diagram—any will do—for this five-particle interaction. It shows two particle trajectories coming in and three coming out. Thicken the lines to form a surface, and draw curves across the surface that explore all its junctions. At this point, the calculation leaves space-time behind; no longer do we imagine particles moving along trajectories and colliding. Instead, the curves—which record the structure of the surface—become the main actors.Each curve can be written as a sequence of left and right turns. Enumerating all the different ways of breaking up this sequence into smaller sequences generates a mathematical expression—one of the special polynomials. Using the polynomials for all the curves, along with some experimental data, you can calculate the amplitude for the five-particle interaction. To a layperson, it’s a lot. But to a quantum physicist, it’s child’s play.“It’s a formula you could teach to a fifth grader,” Spradlin said. “You look at the collection of curves and you count various things that can happen to them as they go around each other.”The researchers found that the procedure works for all amplitudes, including the lengthy sequences of events that had stumped them. The splitting and merging of particles in more complicated interactions translate into surfaces with holes for the curves to loop around, but the procedure remains the same. They also saw that the curves correspond to faces of an associahedron, establishing that the associahedron and surfaceology were two reflections of the same math.The secret sauce of surfaceology, though, is that each of the snaking curves on the surface replaces hordes of Feynman diagrams. Spradlin likened it to decimal notation: You could represent the number 7,312 with four digits or with thousands of tick marks. Surfaceology does something similar for amplitudes, representing particle interactions in a way that is more abstract and mysterious, but also far more efficient. “It’s like paleophysics,” Frost said. “But then out of it comes all this stuff.”The group published the findings in a pair of preprints, totaling 108 pages, in September 2023. They had made a huge leap toward the real world. But they hadn’t quite reached it. The simplified quantum theory of colored particles that they were working with lacks certain bells and whistles that prevent it from describing any real particles.That’s when Figueiredo joined the gang. She would help finally close the gap.Hidden ZerosIt’s no coincidence that two quantum theories—a supersymmetric theory and “trace phi cubed,” as the other is called—were the first to fall to Arkani-Hamed’s geometric efforts. Both have bare-bones amplitudes. The amplitudes take the form of fractions, with a numerator above a denominator. And in these two theories, all the variables—properties like particle momentums—go in the denominator.Amplitudes researchers obsess about denominators, because if you line up your collision just right, the denominator’s value becomes tiny and the overall value of the fraction becomes huge. Big amplitudes mean highly probable subatomic events, the kind that light up particle detectors like Christmas trees. These special events are called singularities, and they are the fingerprints of any quantum theory. (Note that these singularities are unrelated to the singularities thought to sit at the heart of black holes.) Singularities led Arkani-Hamed to the amplituhedron and associahedron in the first place.But the quantum theories that describe the real particles of our world put variables in the numerator too. Particles such as electrons have a kind of intrinsic angular momentum called spin, for instance, and terms capturing the effects of spin go up top.Figueiredo figured that the numerator could be the secret to finding the geometric underpinnings of more realistic particle interactions. She set out to look for collisions in which the numerator of the fraction—instead of the denominator—grows very small. The overall value of these amplitudes would approach zero, so they would represent essentially forbidden collisions with slim odds.Such “zeros” are more elusive than singularities. They’re hard to see with Feynman diagrams, and (by definition) almost impossible to observe experimentally. But Figueiredo had learned from Arkani-Hamed’s group how to recast a trace phi cubed amplitude as the volume of an associahedron. So she tweaked the incoming and outgoing particles and looked for collisions that flattened the shape, making its volume vanish.Figueiredo’s coincidence helped unify three different quantum theories under a new mathematical umbrella. Photograph: Andrea Kane/Institute for Advanced StudyThis led her to the zeros of trace phi cubed. Then, on a whim, she checked other theories. She examined the same collisions but using pions—real particles that play by different rules. There’s no known geometric theory for pions, so she had to resort to grinding out the amplitude using Feynman diagrams. The result was striking: The pion theory also outlawed precisely the same collisions.To the wider particle physics community, Figueiredo’s conspiracy came out of the blue. Bourjaily was in the audience when Arkani-Hamed teased the result at a conference last year. He recalls other physicists scratching their heads, wondering if pions could really act so similarly to such radically simpler particles. Bourjaily quickly checked the conspiracy for collisions involving up to 14 particles. Finding that it held, he marveled at how the new scheme reduced recently published predictions to trivial computations.“They were hard-won results that you just got for free,” said Bourjaily, who did his PhD with Arkani-Hamed. “I have no idea why that’s true.”The conspiracy continued. The same collisions turned out to be illegal under the laws of gluons, known as Yang-Mills theory. What seemed like three completely different theories all shared the same zeros. “There was no reasonable explanation for this,” Figueiredo said.Further exploration turned up the reason: The curves of trace phi cubed theory give an equation for an amplitude. The zeros make this amplitude very rigid; there’s only one part of the equation you can modify and still preserve the zeros, Figueiredo and collaborators found. Tweaking it in one way gave you pions. Another gives you gluons. They realized that all three theories come from curves on surfaces in essentially the same way. Figueiredo and Arkani-Hamed, along with their collaborators Qu Cao, Jin Dong, and Song He, posted their findings last winter.“We’re learning things about real-world processes that we didn’t know before. Like the fact that phi cubed [particles], pions, and gluons are … so closely related,” Arkani-Hamed said.Twists and TurnsOther groups have since made further advances.Initially, the surfaceology scheme applied only to collisions between bosons, particles with integer amounts of spin. But many of the matter particles that make up our world, such as electrons, are fermions, which have half-integer amounts of spin. A group at Brown led by Spradlin, Anastasia Volovich, and Marcos Skowronek has made progress in extending surfaceology to new particles. The group worked out a new set of rules for curves that can accommodate certain toy fermions.Brown University researchers Anastasia Volovich, Marcos Skowronek, and Marcus Spradlin extended surfaceology to cover a new family of particles. Photographs: Courtesy of Anastasia Volovich/LORESWhen Shruti Paranjape, a physicist then at the University of California, Davis, saw a slide at a conference last December that listed which quantum theories shared “hidden” zeros, she felt a flash of recognition. They were all theories in which it was possible to combine two copies of amplitudes of one theory to make an amplitude of another theory—a somewhat mysterious operation known as the double copy. She and her collaborators showed that if one could double-copy a theory, then that theory would have the zeros Figueiredo had found. It’s another hint that more theories might be brought into the geometric fold.The original surfaceology group is following up on indications that their curves know about much more than just amplitudes for colored particles.The typical procedure is to draw only curves that don’t cross themselves. But if you include the self-intersecting curves, the researchers noticed, you get a strange-looking amplitude, which turns out not to describe collisions between particles but rather tangled interactions between longer objects known as strings. Thus, surfaceology appears to be another route to string theory, a candidate theory of quantum gravity that posits that quantum particles are made of vibrating strings of energy. “This formalism, as far as we can tell, contains string theory but allows you to do more things,” Arkani-Hamed said.As a postdoc at the University of California, Davis, Shruti Paranjape connected a pattern in particle behavior revealed by surfaceology with the enigmatic “double copy” phenomenon. Photograph: Ashish KakkarSurfaceology might also account for gravitons, the particles thought to impart the gravitational force. While working out how much each curve would contribute to a trace phi cubed amplitude, the group came across curves that were unavoidable but that didn’t change the final answer. If the surface had holes, these curves circled around the holes forever, never taking an exit. From the space-time perspective, these curves capture events beyond the purview of trace phi cubed theory: colorless particles that the researchers believe could eventually describe gravitons.That would be a crucial step toward Arkani-Hamed’s ultimate aspiration of developing a novel theoretical framework for quantum gravity.“We don’t yet have a complete working picture of something gravitational,” Arkani-Hamed said. “But there are more and more hints that gravity is going to come along.”Physics for a New EraThere’s more to quantum gravity than gravitons, which would represent just the mildest ripples in space-time. A full theory would need to go beyond ripples to describe what happens when stars collapse and form black holes, warping the space-time fabric to oblivion. It should also account for how space-time came into existence during the Big Bang. Feynman diagrams capture only the minimal ripples of a quantum field and nothing more. So the full picture—what physicists call a “nonperturbative” theory—might be beyond the reach of the geometric paleophysics that these researchers are exploring.“I would be surprised if somehow this told us how to build space-time,” said Daniel Harlow, a theoretical physicist at the Massachusetts Institute of Technology. “My bias is that all the good stuff in quantum gravity is nonperturbative.”Harlow is pursuing another popular research program, known as holography, that seeks to capture space-time in its entirety, including the interiors of black holes, by treating it as a hologram of quantum particles moving around in one lower dimension.Illustrator: Señor Salme for Quanta MagazineArkani-Hamed agrees that a blindness to the aspects of space-time beyond Feynman diagrams is the greatest weakness of his approach. But his instinct is that the deeper mathematical description of nature from which space-time emerges will touch all of physics in some way, even with the mildest of ripples. “It should leave some echoes everywhere. It can’t just be relevant at the Big Bang,” he said.For his part, he feels that holography isn’t radical enough. It shows how one dimension of space could emerge, but otherwise all the familiar ingredients of quantum theory are there from the start: some space, locality, and a clock to mark time. Arkani-Hamed feels that all of those elements should emerge together from something more primitive—as they do in surfaceology.He stresses that the quest is ambitious and could still stumble at any point. But he and his collaborators and colleagues are charging ahead, encouraged by how far they’ve managed to come. He likens the effort to exploring a jungle in search of a rumored castle. The search party has stumbled upon two marble statues—the amplituhedron and now surfaceology. How could the castle itself not be out there?“To me,” he said, “they are all perfect chunks of some much more perfect thing that we have not yet seen.”Original story reprinted with permission from Quanta Magazine, an editorially independent publication of the Simons Foundation whose mission is to enhance public understanding of science by covering research developments and trends in mathematics and the physical and life sciences.",
  "image": "https://media.wired.com/photos/670f87fe9cfe9e3de82bca3e/191:100/w_1280,c_limit/Geometry-crSenor-Salme-AppleTileLede-scaled.jpeg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e\u003cem\u003e\u003cspan\u003eThe original version\u003c/span\u003e of\u003c/em\u003e \u003ca href=\"https://www.quantamagazine.org/physicists-reveal-a-quantum-geometry-that-exists-outside-of-space-and-time-20240925/\"\u003e\u003cem\u003ethis story\u003c/em\u003e\u003c/a\u003e \u003cem\u003eappeared in \u003ca href=\"https://www.quantamagazine.org\"\u003eQuanta Magazine\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\u003cp\u003eIn the fall of 2022, a Princeton University graduate student named \u003ca href=\"https://phy.princeton.edu/people/carolina-figueiredo\" target=\"_blank\"\u003eCarolina Figueiredo\u003c/a\u003e stumbled onto a massive coincidence. She calculated that collisions involving three different types of subatomic particles would all produce the same wreckage. It was like laying a grid over maps of London, Tokyo, and New York and seeing that all three cities had train stations at the same coordinates.\u003c/p\u003e\u003cp\u003e“They are very different [particle] theories. There’s no reason for them to be connected,” Figueiredo said.\u003c/p\u003e\u003cp\u003eThe coincidence soon revealed itself to be a conspiracy: The theories describing the three types of particles were, when viewed from the right perspective, essentially one. The conspiracy, Figueiredo and her colleagues realized, stems from the existence of a hidden structure, one that could potentially simplify the complex business of understanding what’s going on at the base level of reality.\u003c/p\u003e\u003cp\u003eFor nearly two decades, Figueiredo’s doctoral adviser, \u003ca data-offer-url=\"https://www.ias.edu/sns/arkani\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.ias.edu/sns/arkani\u0026#34;}\" href=\"https://www.ias.edu/sns/arkani\" rel=\"nofollow noopener\" target=\"_blank\"\u003eNima Arkani-Hamed\u003c/a\u003e, has been leading a hunt for a new way of doing physics. Many physicists believe they’ve reached the end of the road when it comes to conceptualizing reality in terms of quantum events that play out in space and time. Such language can’t easily describe the beginning of the universe, for instance, when the space-time fabric likely didn’t exist in its current form. Arkani-Hamed therefore suspects that the usual notion of quantum particles moving and interacting in space-time is an approximation of deeper, more abstract concepts, which, if found, could serve as a better language for talking about quantum gravity and the origin of the universe.\u003c/p\u003e\u003cp\u003eA major development came in 2013, when Arkani-Hamed and Jaroslav Trnka, his student at the time, discovered a jewel-like geometric object that forecasts the outcomes of certain particle interactions. They called the object the “\u003ca href=\"https://www.quantamagazine.org/physicists-discover-geometry-underlying-particle-physics-20130917/\"\u003eamplituhedron\u003c/a\u003e.” However, the object didn’t apply to the particles of the real world. So Arkani-Hamed and his colleagues sought more such objects that would.\u003c/p\u003e\u003cp\u003eNow Figueiredo’s conspiracy is another manifestation of abstract geometric structure that seems to underlie particle physics.\u003c/p\u003e\u003cp\u003e“The overall program is inching closer to Nima’s long-term dream of space-time and quantum mechanics emerging from a new set of principles,” said \u003ca data-offer-url=\"https://www.sns.ias.edu/~smizera/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.sns.ias.edu/~smizera/\u0026#34;}\" href=\"https://www.sns.ias.edu/~smizera/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eSebastian Mizera\u003c/a\u003e, a physicist who studies amplitudes at the Institute for Advanced Study in Princeton, New Jersey, but was not involved in the recent work.\u003c/p\u003e\u003cp\u003eLike the amplituhedron, the new geometrical method, known as “surfaceology,” streamlines quantum physics by sidestepping the traditional approach, which is to track the countless ways particles can move through space-time using “Feynman diagrams.” These depictions of particles’ possible collisions and trajectories translate into complicated equations. With surfaceology, physicists can get the same result more directly.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“It provides a natural framework, or a bookkeeping mechanism, to assemble very large numbers of Feynman diagrams,” said \u003ca href=\"https://vivo.brown.edu/display/mspradli\" target=\"_blank\"\u003eMarcus Spradlin\u003c/a\u003e, a physicist at Brown University who has been picking up the new tools of surfaceology. “There’s an exponential compactification in information.”\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eCarolina Figueiredo, a graduate student at Princeton University, noticed a striking coincidence where three species of seemingly unrelated quantum particles act identically.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Andrea Kane/Institute for Advanced Study\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eUnlike the amplituhedron, which required exotic particles to provide a balance known as supersymmetry, surfaceology applies to more realistic, nonsupersymmetric particles. “It’s completely agnostic. It couldn’t care less about supersymmetry,” Spradlin said. “For some people, me included, I think that’s really been quite a surprise.”\u003c/p\u003e\u003cp\u003eThe question now is whether this new, more primitive geometric approach to particle physics will allow theoretical physicists to slip the confines of space and time altogether.\u003c/p\u003e\u003cp\u003e“We needed to find some magic, and maybe this is it,” said \u003ca href=\"https://science.psu.edu/physics/people/jacob-bourjaily\" target=\"_blank\"\u003eJacob Bourjaily\u003c/a\u003e, a physicist at Pennsylvania State University. “Whether it’s going to get rid of space-time, I don’t know. But it’s the first time I’ve seen a door.”\u003c/p\u003e\u003ch2\u003eThe Trouble with Feynman\u003c/h2\u003e\u003cp\u003eFigueiredo sensed the need for some new magic firsthand during the waning months of the pandemic. She was struggling with a task that has challenged physicists for more than 50 years: predicting what will happen when quantum particles collide. In the late 1940s, it took a yearslong effort by three of the brightest minds of the postwar era—Julian Schwinger, Sin-Itiro Tomonaga, and Richard Feynman—to solve the problem for electrically charged particles. Their eventual success would win them a Nobel Prize. Feynman’s scheme was the most visual, so it came to dominate the way physicists think about the quantum world.\u003c/p\u003e\u003cp\u003eWhen two quantum particles come together, anything can happen. They might merge into one, split into many, disappear, or any sequence of the above. And what will actually happen is, in some sense, a combination of all these and many other possibilities. Feynman diagrams keep track of what might happen by stringing together lines representing particles’ trajectories through space-time. Each diagram captures one possible sequence of subatomic events and gives an equation for a number, called an “amplitude,” that represents the odds of that sequence taking place. Add up enough amplitudes, physicists believe, and you get stones, buildings, trees, and people. “Almost everything in the world is a concatenation of that stuff happening over and over again,” Arkani-Hamed said. “Just good old-fashioned things bouncing off each other.”\u003c/p\u003e\u003cp\u003eThere’s a puzzling tension inherent in these amplitudes—one that has vexed generations of quantum physicists going back to Feynman and Schwinger themselves. One might spend hours at a chalkboard sketching byzantine particle trajectories and evaluating fearsome formulas only to find that terms cancel out and complicated expressions melt away to leave behind extremely simple answers—in a classic example, literally the number 1.\u003c/p\u003e\u003cp\u003e“The degree of effort required is tremendous,” Bourjaily said. “And every single time, the prediction you make mocks you with its simplicity.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFigueiredo had been wrestling with the strangeness of the situation when she attended a talk by Arkani-Hamed, a leading theoretical physicist at the IAS who has spent years seeking a new way of getting the answers without Feynman diagrams. She found her way to a series of his lectures on YouTube, in which he showed how—in special cases—one could jump straight to the amplitude of a certain outcome of a particle collision without worrying about how the particles moved through space.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustration: Señor Salme for \u003cem\u003eQuanta Magazine\u003c/em\u003e\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eArkani-Hamed’s shortcuts, which involved reverse engineering answers that satisfy certain fundamental logical requirements, confirmed Figueiredo’s suspicions that alternative methods were out there. “By asking for these very simple things you could just get the answer. That was definitely striking,” she said.\u003c/p\u003e\u003cp\u003eShe began to regularly make the half-hour walk from Princeton’s campus to the IAS to work with Arkani-Hamed, a force of nature who runs on Diet Coke and an inexhaustible enthusiasm for physics.\u003c/p\u003e\u003cp\u003eArkani-Hamed and his collaborators aspire to bring about a conceptual revolution of the sort that rocked physics in the late 1700s. Joseph-Louis Lagrange didn’t discover any forces or laws of nature, but every physicist knows his name. He showed that you could predict the future without laboriously calculating actions and equal-and-opposite reactions in the style of Isaac Newton. Instead, Lagrange learned to predict the path an object will follow by considering the energies that different paths require and identifying the easiest path. Lagrange’s method, despite seeming like a mere mathematical convenience at the time, loosened the straitjacket of Newton’s mechanistic view of the universe as a sequence of falling dominos. Two centuries later, Lagrange’s approach provided Feynman with a more flexible framework that could accommodate the radical randomness of quantum mechanics.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eNow many amplitude researchers hope a reformulation of quantum physics will set the stage for the next physics revolution, a theory of quantum gravity and the origin of space-time.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eNima Arkani-Hamed of the Institute for Advanced Study has spent more than a decade developing a new mathematical language for describing quantum physics that doesn’t directly refer to space, time, or quantum mechanics.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Maximilien Brice/Julien Marius Ordan\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eA handful of mini-revolutions have already occurred. One came in the mid-2000s, when \u003ca data-offer-url=\"https://www.maths.tcd.ie/~britto/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.maths.tcd.ie/~britto/\u0026#34;}\" href=\"https://www.maths.tcd.ie/~britto/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eRuth Britto\u003c/a\u003e, \u003ca data-offer-url=\"https://perimeterinstitute.ca/people/freddy-cachazo\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://perimeterinstitute.ca/people/freddy-cachazo\u0026#34;}\" href=\"https://perimeterinstitute.ca/people/freddy-cachazo\" rel=\"nofollow noopener\" target=\"_blank\"\u003eFreddy Cachazo\u003c/a\u003e, Bo Feng, and \u003ca data-offer-url=\"https://www.ias.edu/sns/witten\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.ias.edu/sns/witten\u0026#34;}\" href=\"https://www.ias.edu/sns/witten\" rel=\"nofollow noopener\" target=\"_blank\"\u003eEdward Witten\u003c/a\u003e discovered the “\u003ca data-offer-url=\"https://arxiv.org/abs/hep-th/0412308\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/hep-th/0412308\u0026#34;}\" href=\"https://arxiv.org/abs/hep-th/0412308\" rel=\"nofollow noopener\" target=\"_blank\"\u003erecursion relations\u003c/a\u003e,” equations that let physicists condense hundreds of pages of Feynman diagrams to mere lines.\u003c/p\u003e\u003cp\u003eAround the same time, Arkani-Hamed joined the hunt for a new conceptual perspective on particle physics, after \u003ca href=\"https://www.quantamagazine.org/the-thought-experiments-that-fray-the-fabric-of-space-time-20240925/\"\u003ea couple of thought experiments\u003c/a\u003e led him to doubt that space and time are truly well-founded physical concepts. Several years later, he and Trnka discovered the amplituhedron.\u003c/p\u003e\u003cp\u003eThe amplituhedron is a curvy shape whose contours encode the number and orientation of particles involved in an interaction. Its volume gives the amplitude for that interaction to occur. This volume equals the sum of amplitudes of all the Feynman diagrams depicting the various alternative ways the interaction could play out, but in this case you calculate the answer without reference to those spatiotemporal dynamics; all you need is the list of momentums of the particles that exist before and after the interaction.\u003c/p\u003e\u003cp\u003e“However the scattering happens, it’s controlled by this real structure,” said \u003ca href=\"https://live-sas-physics.pantheon.sas.upenn.edu/people/standing-faculty/vijay-balasubramanian\" target=\"_blank\"\u003eVijay Balasubramanian\u003c/a\u003e, a physicist at the University of Pennsylvania who studies quantum gravity. “You don’t have to talk about space-time.”\u003c/p\u003e\u003cp\u003eThe surprising discovery brought new people into the search. But the amplituhedron worked only for a theory of particles that came hand in hand with exotic partner particles, a simplifying balance called supersymmetry. (Generally speaking, one quantum “theory” describes one specific set of rules for one specific set of particles. As such, there are many quantum theories, some for real particles and others for fictitious ones.)\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003e“You’re a little bit suspicious that maybe the amazing things you’re seeing have nothing to do with the real world,” said \u003ca data-offer-url=\"https://inspirehep.net/authors/2098300\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://inspirehep.net/authors/2098300\u0026#34;}\" href=\"https://inspirehep.net/authors/2098300\" rel=\"nofollow noopener\" target=\"_blank\"\u003eGiulio Salvatori\u003c/a\u003e, a physicist who would later join the group.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eGiulio Salvatori, a physicist currently at the IAS and the Max Planck Institute for Physics in Germany, helped develop surfaceology—a far more efficient way of making quantum predictions.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Credit: Viktoria Vasilenko\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eIn the following years, Arkani-Hamed’s team identified a second type of shape, the “associahedron,” that worked in a similar way. It had flat sides, and its volume gave scattering amplitudes for the particles of a simplified quantum theory, one that’s easier to study. The particles in this theory carry a type of charge called “color” that is also carried by the quarks and gluons in real-world atomic nuclei. (This charge has nothing to do with actual colors, but the mathematics of how charges combine to make color-neutral composite particles resembles how red, green and blue light together make white.)\u003c/p\u003e\u003cp\u003eThe particles of this theory also lack supersymmetric partners. The associahedron therefore represented a major step toward the real world. But the shape gave only partial answers, producing amplitudes for only the shortest sequences of subatomic events.\u003c/p\u003e\u003cp\u003eSensing a breakthrough was close, Arkani-Hamed recruited Salvatori and \u003ca data-offer-url=\"https://www.merton.ox.ac.uk/people/dr-hadleigh-frost\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.merton.ox.ac.uk/people/dr-hadleigh-frost\u0026#34;}\" href=\"https://www.merton.ox.ac.uk/people/dr-hadleigh-frost\" rel=\"nofollow noopener\" target=\"_blank\"\u003eHadleigh Frost\u003c/a\u003e at the University of Oxford, young physicists who had been independently advancing the understanding of the associahedron’s strange shapes, along with the mathematicians \u003ca data-offer-url=\"https://lmv.math.cnrs.fr/laboratoire/annuaire/membres-du-laboratoire/pierre-guy-plamondon/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://lmv.math.cnrs.fr/laboratoire/annuaire/membres-du-laboratoire/pierre-guy-plamondon/\u0026#34;}\" href=\"https://lmv.math.cnrs.fr/laboratoire/annuaire/membres-du-laboratoire/pierre-guy-plamondon/\" rel=\"nofollow noopener\" target=\"_blank\"\u003ePierre-Guy Plamondon\u003c/a\u003e and \u003ca data-offer-url=\"https://professeurs.uqam.ca/professeur/thomas.hugh_r/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://professeurs.uqam.ca/professeur/thomas.hugh_r/\u0026#34;}\" href=\"https://professeurs.uqam.ca/professeur/thomas.hugh_r/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eHugh Thomas\u003c/a\u003e. In 2019, the gang started looking for a geometrical route to all of these amplitudes.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThen the pandemic hit, and the team left our space-time to work in the digital ether of Zoom. They would emerge two years later with a second revolutionary way of doing quantum physics.\u003c/p\u003e\u003ch2\u003eCurves on Surfaces\u003c/h2\u003e\u003cp\u003eThe mystery confronting them was how to get the amplitudes that would usually come from the more intricate space-time trajectories, those with numerous splittings and mergings. In these cases, it wasn’t clear how to calculate an associahedron’s volume.\u003c/p\u003e\u003cp\u003e“We couldn’t say exactly what the deep principle was,” Frost said.\u003c/p\u003e\u003cp\u003eArkani-Hamed was in the habit of working with the 1990s television show \u003cem\u003eTwin Peaks\u003c/em\u003e running in the background. He found comfort in the show’s enigmatic vibe and played it dozens of times over the months he spent fiddling with assorted shapes and diagrams. “They’re trying to figure out a crazy, weird mystery with all sorts of insane characters, and so am I,” he told me over Zoom one afternoon, surrounded by the digital red drapes of the “Black Lodge,” a setting inside the \u003cem\u003eTwin Peaks\u003c/em\u003e universe but outside its standard space-time.\u003c/p\u003e\u003cp\u003eAfter repeatedly hitting dead ends, the researchers took a step back. They returned to the simpler events that they already understood, whose amplitudes came from the volumes of shapes. The shapes could be defined by polynomials—equations from high school math that sum up sequences of terms. But these were special polynomials, the group realized, in that they corresponded to curves twisting and turning on a surface. With that, they had stumbled upon the surfaces at the heart of surfaceology, their new art for predicting particle collisions.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustration:  Mark Belan for Quanta Magazine\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eHere’s how it works. Say you need to calculate the odds of two particles colliding and three particles coming out of the wreckage. Start with a single Feynman diagram—any will do—for this five-particle interaction. It shows two particle trajectories coming in and three coming out. Thicken the lines to form a surface, and draw curves across the surface that explore all its junctions. At this point, the calculation leaves space-time behind; no longer do we imagine particles moving along trajectories and colliding. Instead, the curves—which record the structure of the surface—become the main actors.\u003c/p\u003e\u003cp\u003eEach curve can be written as a sequence of left and right turns. Enumerating all the different ways of breaking up this sequence into smaller sequences generates a mathematical expression—one of the special polynomials. Using the polynomials for all the curves, along with some experimental data, you can calculate the amplitude for the five-particle interaction. To a layperson, it’s a lot. But to a quantum physicist, it’s child’s play.\u003c/p\u003e\u003cp\u003e“It’s a formula you could teach to a fifth grader,” Spradlin said. “You look at the collection of curves and you count various things that can happen to them as they go around each other.”\u003c/p\u003e\u003cp\u003eThe researchers found that the procedure works for all amplitudes, including the lengthy sequences of events that had stumped them. The splitting and merging of particles in more complicated interactions translate into surfaces with holes for the curves to loop around, but the procedure remains the same. They also saw that the curves correspond to faces of an associahedron, establishing that the associahedron and surfaceology were two reflections of the same math.\u003c/p\u003e\u003cp\u003eThe secret sauce of surfaceology, though, is that each of the snaking curves on the surface replaces hordes of Feynman diagrams. Spradlin likened it to decimal notation: You could represent the number 7,312 with four digits or with thousands of tick marks. Surfaceology does something similar for amplitudes, representing particle interactions in a way that is more abstract and mysterious, but also far more efficient. “It’s like paleophysics,” Frost said. “But then out of it comes all this stuff.”\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThe group published the findings in a \u003ca data-offer-url=\"https://arxiv.org/abs/2309.15913\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2309.15913\u0026#34;}\" href=\"https://arxiv.org/abs/2309.15913\" rel=\"nofollow noopener\" target=\"_blank\"\u003epair\u003c/a\u003e of \u003ca data-offer-url=\"https://arxiv.org/abs/2311.09284\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2311.09284\u0026#34;}\" href=\"https://arxiv.org/abs/2311.09284\" rel=\"nofollow noopener\" target=\"_blank\"\u003epreprints\u003c/a\u003e, totaling 108 pages, in September 2023. They had made a huge leap toward the real world. But they hadn’t quite reached it. The simplified quantum theory of colored particles that they were working with lacks certain bells and whistles that prevent it from describing any real particles.\u003c/p\u003e\u003cp\u003eThat’s when Figueiredo joined the gang. She would help finally close the gap.\u003c/p\u003e\u003ch2\u003eHidden Zeros\u003c/h2\u003e\u003cp\u003eIt’s no coincidence that two quantum theories—a supersymmetric theory and “trace phi cubed,” as the other is called—were the first to fall to Arkani-Hamed’s geometric efforts. Both have bare-bones amplitudes. The amplitudes take the form of fractions, with a numerator above a denominator. And in these two theories, all the variables—properties like particle momentums—go in the denominator.\u003c/p\u003e\u003cp\u003eAmplitudes researchers obsess about denominators, because if you line up your collision just right, the denominator’s value becomes tiny and the overall value of the fraction becomes huge. Big amplitudes mean highly probable subatomic events, the kind that light up particle detectors like Christmas trees. These special events are called singularities, and they are the fingerprints of any quantum theory. (Note that these singularities are unrelated to the singularities thought to sit at the heart of black holes.) Singularities led Arkani-Hamed to the amplituhedron and associahedron in the first place.\u003c/p\u003e\u003cp\u003eBut the quantum theories that describe the real particles of our world put variables in the numerator too. Particles such as electrons have a kind of intrinsic angular momentum called spin, for instance, and terms capturing the effects of spin go up top.\u003c/p\u003e\u003cp\u003eFigueiredo figured that the numerator could be the secret to finding the geometric underpinnings of more realistic particle interactions. She set out to look for collisions in which the numerator of the fraction—instead of the denominator—grows very small. The overall value of these amplitudes would approach zero, so they would represent essentially forbidden collisions with slim odds.\u003c/p\u003e\u003cp\u003eSuch “zeros” are more elusive than singularities. They’re hard to see with Feynman diagrams, and (by definition) almost impossible to observe experimentally. But Figueiredo had learned from Arkani-Hamed’s group how to recast a trace phi cubed amplitude as the volume of an associahedron. So she tweaked the incoming and outgoing particles and looked for collisions that flattened the shape, making its volume vanish.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eFigueiredo’s coincidence helped unify three different quantum theories under a new mathematical umbrella.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Andrea Kane/Institute for Advanced Study\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThis led her to the zeros of trace phi cubed. Then, on a whim, she checked other theories. She examined the same collisions but using pions—real particles that play by different rules. There’s no known geometric theory for pions, so she had to resort to grinding out the amplitude using Feynman diagrams. The result was striking: The pion theory also outlawed precisely the same collisions.\u003c/p\u003e\u003cp\u003eTo the wider particle physics community, Figueiredo’s conspiracy came out of the blue. Bourjaily was in the audience when Arkani-Hamed teased the result at a conference last year. He recalls other physicists scratching their heads, wondering if pions could really act so similarly to such radically simpler particles. Bourjaily quickly checked the conspiracy for collisions involving up to 14 particles. Finding that it held, he marveled at how the new scheme reduced recently published predictions to trivial computations.\u003c/p\u003e\u003cp\u003e“They were hard-won results that you just got for free,” said Bourjaily, who did his PhD with Arkani-Hamed. “I have no idea why that’s true.”\u003c/p\u003e\u003cp\u003eThe conspiracy continued. The same collisions turned out to be illegal under the laws of gluons, known as Yang-Mills theory. What seemed like three completely different theories all shared the same zeros. “There was no reasonable explanation for this,” Figueiredo said.\u003c/p\u003e\u003cp\u003eFurther exploration turned up the reason: The curves of trace phi cubed theory give an equation for an amplitude. The zeros make this amplitude very rigid; there’s only one part of the equation you can modify and still preserve the zeros, Figueiredo and collaborators found. Tweaking it in one way gave you pions. Another gives you gluons. They realized that all three theories come from curves on surfaces in essentially the same way. Figueiredo and Arkani-Hamed, along with their collaborators Qu Cao, Jin Dong, and Song He, \u003ca data-offer-url=\"https://arxiv.org/abs/2312.16282\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2312.16282\u0026#34;}\" href=\"https://arxiv.org/abs/2312.16282\" rel=\"nofollow noopener\" target=\"_blank\"\u003eposted\u003c/a\u003e \u003ca data-offer-url=\"https://arxiv.org/abs/2401.00041\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2401.00041\u0026#34;}\" href=\"https://arxiv.org/abs/2401.00041\" rel=\"nofollow noopener\" target=\"_blank\"\u003etheir\u003c/a\u003e \u003ca data-offer-url=\"https://arxiv.org/abs/2401.05483\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2401.05483\u0026#34;}\" href=\"https://arxiv.org/abs/2401.05483\" rel=\"nofollow noopener\" target=\"_blank\"\u003efindings\u003c/a\u003e last winter.\u003c/p\u003e\u003cp\u003e“We’re learning things about real-world processes that we didn’t know before. Like the fact that phi cubed [particles], pions, and gluons are … so closely related,” Arkani-Hamed said.\u003c/p\u003e\u003ch2\u003eTwists and Turns\u003c/h2\u003e\u003cp\u003eOther groups have since made further advances.\u003c/p\u003e\u003cp\u003eInitially, the surfaceology scheme applied only to collisions between bosons, particles with integer amounts of spin. But many of the matter particles that make up our world, such as electrons, are fermions, which have half-integer amounts of spin. A group at Brown led by Spradlin, \u003ca href=\"https://vivo.brown.edu/display/avolovic\" target=\"_blank\"\u003eAnastasia Volovich\u003c/a\u003e, and Marcos Skowronek has made progress in extending surfaceology to new particles. The group worked out a \u003ca data-offer-url=\"https://arxiv.org/abs/2406.04411\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2406.04411\u0026#34;}\" href=\"https://arxiv.org/abs/2406.04411\" rel=\"nofollow noopener\" target=\"_blank\"\u003enew set of rules\u003c/a\u003e for curves that can accommodate certain toy fermions.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eBrown University researchers Anastasia Volovich, Marcos Skowronek, and Marcus Spradlin extended surfaceology to cover a new family of particles.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotographs: Courtesy of Anastasia Volovich/LORES\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eWhen Shruti Paranjape, a physicist then at the University of California, Davis, saw a slide at a conference last December that listed which quantum theories shared “hidden” zeros, she felt a flash of recognition. They were all theories in which it was possible to combine two copies of amplitudes of one theory to make an amplitude of another theory—a somewhat mysterious operation known as the \u003ca href=\"https://www.quantamagazine.org/how-gravity-is-a-double-copy-of-other-forces-20210504/\"\u003edouble copy\u003c/a\u003e. She and her collaborators showed that if one could double-copy a theory, then \u003ca data-offer-url=\"https://arxiv.org/abs/2403.10594\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://arxiv.org/abs/2403.10594\u0026#34;}\" href=\"https://arxiv.org/abs/2403.10594\" rel=\"nofollow noopener\" target=\"_blank\"\u003ethat theory would have the zeros\u003c/a\u003e Figueiredo had found. It’s another hint that more theories might be brought into the geometric fold.\u003c/p\u003e\u003cp\u003eThe original surfaceology group is following up on indications that their curves know about much more than just amplitudes for colored particles.\u003c/p\u003e\u003cp\u003eThe typical procedure is to draw only curves that don’t cross themselves. But if you include the self-intersecting curves, the researchers noticed, you get a strange-looking amplitude, which turns out not to describe collisions between particles but rather tangled interactions between longer objects known as strings. Thus, surfaceology appears to be another route to string theory, a candidate theory of quantum gravity that posits that quantum particles are made of vibrating strings of energy. “This formalism, as far as we can tell, contains string theory but allows you to do more things,” Arkani-Hamed said.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAs a postdoc at the University of California, Davis, Shruti Paranjape connected a pattern in particle behavior revealed by surfaceology with the enigmatic “double copy” phenomenon.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhotograph: Ashish Kakkar\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eSurfaceology might also account for gravitons, the particles thought to impart the gravitational force. While working out how much each curve would contribute to a trace phi cubed amplitude, the group came across curves that were unavoidable but that didn’t change the final answer. If the surface had holes, these curves circled around the holes forever, never taking an exit. From the space-time perspective, these curves capture events beyond the purview of trace phi cubed theory: colorless particles that the researchers believe could eventually describe gravitons.\u003c/p\u003e\u003cp\u003eThat would be a crucial step toward Arkani-Hamed’s ultimate aspiration of developing a novel theoretical framework for quantum gravity.\u003c/p\u003e\u003cp\u003e“We don’t yet have a complete working picture of something gravitational,” Arkani-Hamed said. “But there are more and more hints that gravity is going to come along.”\u003c/p\u003e\u003ch2\u003ePhysics for a New Era\u003c/h2\u003e\u003cp\u003eThere’s more to quantum gravity than gravitons, which would represent just the mildest ripples in space-time. A full theory would need to go beyond ripples to describe what happens when stars collapse and form black holes, warping the space-time fabric to oblivion. It should also account for how space-time came into existence during the Big Bang. Feynman diagrams capture only the minimal ripples of a quantum field and nothing more. So the full picture—what physicists call a “nonperturbative” theory—might be beyond the reach of the geometric paleophysics that these researchers are exploring.\u003c/p\u003e\u003cp\u003e“I would be surprised if somehow this told us how to build space-time,” said \u003ca href=\"https://physics.mit.edu/faculty/daniel-harlow/\" target=\"_blank\"\u003eDaniel Harlow\u003c/a\u003e, a theoretical physicist at the Massachusetts Institute of Technology. “My bias is that all the good stuff in quantum gravity is nonperturbative.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eHarlow is pursuing \u003ca href=\"https://www.quantamagazine.org/if-the-universe-is-a-hologram-this-long-forgotten-math-could-decode-it-20240925/\"\u003eanother popular research program, known as holography\u003c/a\u003e, that seeks to capture space-time in its entirety, including the interiors of black holes, by treating it as a hologram of quantum particles moving around in one lower dimension.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003eIllustrator: Señor Salme for \u003cem\u003eQuanta Magazine\u003c/em\u003e\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eArkani-Hamed agrees that a blindness to the aspects of space-time beyond Feynman diagrams is the greatest weakness of his approach. But his instinct is that the deeper mathematical description of nature from which space-time emerges will touch all of physics in some way, even with the mildest of ripples. “It should leave some echoes everywhere. It can’t just be relevant at the Big Bang,” he said.\u003c/p\u003e\u003cp\u003eFor his part, he feels that holography isn’t radical enough. It shows how one dimension of space could emerge, but otherwise all the familiar ingredients of quantum theory are there from the start: some space, locality, and a clock to mark time. Arkani-Hamed feels that all of those elements should emerge together from something more primitive—as they do in surfaceology.\u003c/p\u003e\u003cp\u003eHe stresses that the quest is ambitious and could still stumble at any point. But he and his collaborators and colleagues are charging ahead, encouraged by how far they’ve managed to come. He likens the effort to exploring a jungle in search of a rumored castle. The search party has stumbled upon two marble statues—the amplituhedron and now surfaceology. How could the castle itself not be out there?\u003c/p\u003e\u003cp\u003e“To me,” he said, “they are all perfect chunks of some much more perfect thing that we have not yet seen.”\u003c/p\u003e\u003chr/\u003e\u003cp\u003e\u003ca href=\"https://www.quantamagazine.org/physicists-reveal-a-quantum-geometry-that-exists-outside-of-space-and-time-20240925/\"\u003e\u003cem\u003eOriginal story\u003c/em\u003e\u003c/a\u003e \u003cem\u003ereprinted with permission from \u003ca href=\"https://www.quantamagazine.org\"\u003eQuanta Magazine\u003c/a\u003e, an editorially independent publication of the\u003c/em\u003e \u003ca href=\"https://www.simonsfoundation.org\"\u003e\u003cem\u003eSimons Foundation\u003c/em\u003e\u003c/a\u003e \u003cem\u003ewhose mission is to enhance public understanding of science by covering research developments and trends in mathematics and the physical and life sciences.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "28 min read",
  "publishedTime": "2024-11-03T07:00:00-05:00",
  "modifiedTime": "2024-11-03T12:00:00Z"
}
