{
  "id": "ea2744b4-a32f-418e-b7f8-7183a3dfe030",
  "title": "Young coral use metabolic tricks to resist bleaching",
  "link": "https://www.sciencedaily.com/releases/2024/11/241112191018.htm",
  "description": "Coral larvae reduce their metabolism and increase nitrogen uptake to resist bleaching in high temperatures, according to a new study.",
  "author": "",
  "published": "Tue, 12 Nov 2024 19:10:18 EST",
  "source": "https://www.sciencedaily.com/rss/all.xml",
  "categories": null,
  "byline": "",
  "length": 2198,
  "excerpt": "Coral larvae reduce their metabolism and increase nitrogen uptake to resist bleaching in high temperatures, according to a new study.",
  "siteName": "ScienceDaily",
  "favicon": "",
  "text": "Coral larvae reduce their metabolism and increase nitrogen uptake to resist bleaching in high temperatures, according to a study published November 12 in the open-access journal PLOS Biology by Ariana S. Huffmyer of the University of Washington, US, and colleagues. High ocean temperatures cause coral bleaching, which results from the disruption of the relationship between corals and their symbiotic algae, an increasing concern as global temperatures rise. However, relatively little research has examined the effects of high temperatures during early life stages of corals. In this study, Huffmyer and colleagues exposed coral larvae to high temperatures at the Hawai'i Institute of Marine Biology. For three days during their first week of development, the larvae and their algal symbionts were treated to temperatures 2.5 degrees Celsius above ambient temperature, similar to expected changes in seawater due to climate change. The coral larvae showed no signs of bleaching in the heated water, and they were able to maintain rates of algal photosynthesis and the supply of carbon-based nutrition from the algae to the host. However, there was a 19% reduction in coral metabolism, as well as increased uptake and storage of nitrogen by the coral, both of which are apparent strategies that improve coral survival. Reduced metabolism allows the coral to conserve energy and resources, also seen in adult corals during bleaching. The change in nitrogen cycling seems to be an adaptation by the coral to limit the amount of nitrogen available to the algae, thus preventing algal overgrowth and the destabilization of the coral-algae relationship. It remains unclear how effective these strategies are at higher temperatures and for longer durations. Further research into the details and limitations of coral reaction to high temperatures will provide crucial knowledge for predicting coral response and protecting coral reefs as global temperatures continue to rise. The authors add, \"This research reveals that coral larvae must invest in their nutritional partnership with algae to withstand stress, offering key insights into strategies to avoid bleaching in earliest life stages of corals.\"",
  "image": "https://www.sciencedaily.com/images/scidaily-icon.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp id=\"first\"\u003eCoral larvae reduce their metabolism and increase nitrogen uptake to resist bleaching in high temperatures, according to a study published November 12 in the open-access journal \u003cem\u003ePLOS Biology\u003c/em\u003e by Ariana S. Huffmyer of the University of Washington, US, and colleagues.\u003c/p\u003e\u003cdiv id=\"text\"\u003e\n\u003cp\u003eHigh ocean temperatures cause coral bleaching, which results from the disruption of the relationship between corals and their symbiotic algae, an increasing concern as global temperatures rise. However, relatively little research has examined the effects of high temperatures during early life stages of corals.\u003c/p\u003e\n\u003cp\u003eIn this study, Huffmyer and colleagues exposed coral larvae to high temperatures at the Hawai\u0026#39;i Institute of Marine Biology. For three days during their first week of development, the larvae and their algal symbionts were treated to temperatures 2.5 degrees Celsius above ambient temperature, similar to expected changes in seawater due to climate change. The coral larvae showed no signs of bleaching in the heated water, and they were able to maintain rates of algal photosynthesis and the supply of carbon-based nutrition from the algae to the host. However, there was a 19% reduction in coral metabolism, as well as increased uptake and storage of nitrogen by the coral, both of which are apparent strategies that improve coral survival.\u003c/p\u003e\n\u003cp\u003eReduced metabolism allows the coral to conserve energy and resources, also seen in adult corals during bleaching. The change in nitrogen cycling seems to be an adaptation by the coral to limit the amount of nitrogen available to the algae, thus preventing algal overgrowth and the destabilization of the coral-algae relationship.\u003c/p\u003e\n\u003cp\u003eIt remains unclear how effective these strategies are at higher temperatures and for longer durations. Further research into the details and limitations of coral reaction to high temperatures will provide crucial knowledge for predicting coral response and protecting coral reefs as global temperatures continue to rise.\u003c/p\u003e\n\u003cp\u003eThe authors add, \u0026#34;This research reveals that coral larvae must invest in their nutritional partnership with algae to withstand stress, offering key insights into strategies to avoid bleaching in earliest life stages of corals.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
