{
  "id": "ed34a85f-802a-4ef1-92b8-663a651833bf",
  "title": "Physicists find unexpected crystals of electrons in new ultrathin material",
  "link": "https://phys.org/news/2025-02-physicists-unexpected-crystals-electrons-ultrathin.html",
  "description": "MIT physicists report the unexpected discovery of electrons forming crystalline structures in a material only billionths of a meter thick. The work adds to a gold mine of discoveries originating from the material, which the same team discovered only about three years ago.",
  "author": "",
  "published": "Wed, 26 Feb 2025 17:16:04 EST",
  "source": "https://phys.org/rss-feed/",
  "categories": [
    "Condensed Matter Quantum Physics"
  ],
  "byline": "Elizabeth A. Thomson",
  "length": 7126,
  "excerpt": "MIT physicists report the unexpected discovery of electrons forming crystalline structures in a material only billionths of a meter thick. The work adds to a gold mine of discoveries originating from the material, which the same team discovered only about three years ago.",
  "siteName": "Phys.org",
  "favicon": "",
  "text": "This graphic visualizes how electrons can behave as a solid (left, glacier-like structure) or liquid (river-like structure) depending on the voltage applied to a new material cooled to an ultra-low temperature akin to that of outer space. Credit: Michael Hurley and Sampson Wilcox/Research Laboratory of Electronics MIT physicists report the unexpected discovery of electrons forming crystalline structures in a material only billionths of a meter thick. The work adds to a gold mine of discoveries originating from the material, which the same team discovered only about three years ago. In a paper published Jan. 22 in Nature, the team describes how electrons in devices made, in part, of the new material can become solid, or form crystals, by changing the voltage applied to the devices when they are kept at a temperature similar to that of outer space. Under the same conditions, they also showed the emergence of two new electronic states that add to work they reported last year showing that electrons can split into fractions of themselves. The physicists were able to make the discoveries thanks to new custom-made filters for better insulation of the equipment involved in the work. These allowed them to cool their devices to a temperature an order of magnitude colder than they achieved for the earlier results. The team also observed all of these phenomena using two slightly different \"versions\" of the new material, one composed of five layers of atomically thin carbon; the other composed of four layers. This indicates \"that there's a family of materials where you can get this kind of behavior, which is exciting,\" says Long Ju, an assistant professor in the MIT Department of Physics who led the work. Ju is also affiliated with MIT's Materials Research Laboratory and Research Lab of Electronics. Referring to the new material, known as rhombohedral pentalayer graphene, Ju says, \"We found a gold mine, and every scoop is revealing something new.\" New material Rhombohedral pentalayer graphene is essentially a special form of pencil lead. Pencil lead, or graphite, is composed of graphene, a single layer of carbon atoms arranged in hexagons resembling a honeycomb structure. Rhombohedral pentalayer graphene is composed of five layers of graphene stacked in a specific overlapping order. Since Ju and colleagues discovered the material, they have tinkered with it by adding layers of another material they thought might accentuate the graphene's properties, or even produce new phenomena. For example, in 2023 they created a sandwich of rhombohedral pentalayer graphene with \"buns\" made of hexagonal boron nitride. By applying different voltages, or amounts of electricity, to the sandwich, they discovered three important properties never before seen in natural graphite. EQAH states in device 1, the pentalayer device. Credit: Nature (2025). DOI: 10.1038/s41586-024-08470-1 Last year, Ju and colleagues reported yet another important and even more surprising phenomenon: Electrons became fractions of themselves upon applying a current to a new device composed of rhombohedral pentalayer graphene and hexagonal boron nitride. This is important because this \"fractional quantum Hall effect\" has only been seen in a few systems, usually under very high magnetic fields. The Ju work showed that the phenomenon could occur in a fairly simple material without a magnetic field. As a result, it is called the \"fractional quantum anomalous Hall effect\" (anomalous indicates that no magnetic field is necessary). New results In the current work, the Ju team reports yet more unexpected phenomena from the general rhombohedral graphene/boron nitride system when it is cooled to 30 millikelvins (1 millikelvin is equivalent to -459.668 degrees Fahrenheit). In last year's paper, Ju and colleagues reported six fractional states of electrons. In the current work, they report discovering two more of these fractional states. They also found another unusual electronic phenomenon: the integer quantum anomalous Hall effect in a wide range of electron densities. The fractional quantum anomalous Hall effect was understood to emerge in an electron \"liquid\" phase, analogous to water. In contrast, the new state that the team has now observed can be interpreted as an electron \"solid\" phase—resembling the formation of electronic \"ice\"—that can also coexist with the fractional quantum anomalous Hall states when the system's voltage is carefully tuned at ultra-low temperatures. One way to think about the relation between the integer and fractional states is to imagine a map created by tuning electric voltages: By tuning the system with different voltages, you can create a \"landscape\" similar to a river (which represents the liquid-like fractional states) cutting through glaciers (which represent the solid-like integer effect), Ju explains. Ju notes that his team observed all of these phenomena not only in pentalayer rhombohedral graphene, but also in rhombohedral graphene composed of four layers. This creates a family of materials, and indicates that other \"relatives\" may exist. \"This work shows how rich this material is in exhibiting exotic phenomena. We've just added more flavor to this already very interesting material,\" says Zhengguang Lu, a co-first author of the paper. Lu, who conducted the work as a postdoc at MIT, is now on the faculty at Florida State University. More information: Zhengguang Lu et al, Extended quantum anomalous Hall states in graphene/hBN moiré superlattices, Nature (2025). DOI: 10.1038/s41586-024-08470-1 Journal information: Nature This story is republished courtesy of MIT News (web.mit.edu/newsoffice/), a popular site that covers news about MIT research, innovation and teaching. Citation: Physicists find unexpected crystals of electrons in new ultrathin material (2025, February 26) retrieved 26 February 2025 from https://phys.org/news/2025-02-physicists-unexpected-crystals-electrons-ultrathin.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "image": "https://scx2.b-cdn.net/gfx/news/2025/physicists-find-unexpe.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/physicists-find-unexpe.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/2025/physicists-find-unexpe.jpg\" data-sub-html=\"This graphic visualizes how electrons can behave as a solid (left, glacier-like structure) or liquid (river-like structure) depending on the voltage applied to a new material cooled to an ultra-low temperature akin to that of outer space. Credit: Michael Hurley and Sampson Wilcox/Research Laboratory of Electronics\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/physicists-find-unexpe.jpg\" alt=\"Physicists find unexpected crystals of electrons in new ultrathin material\" title=\"This graphic visualizes how electrons can behave as a solid (left, glacier-like structure) or liquid (river-like structure) depending on the voltage applied to a new material cooled to an ultra-low temperature akin to that of outer space. Credit: Michael Hurley and Sampson Wilcox/Research Laboratory of Electronics\" width=\"800\" height=\"530\"/\u003e\n             \u003cfigcaption\u003e\n                This graphic visualizes how electrons can behave as a solid (left, glacier-like structure) or liquid (river-like structure) depending on the voltage applied to a new material cooled to an ultra-low temperature akin to that of outer space. Credit: Michael Hurley and Sampson Wilcox/Research Laboratory of Electronics\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\u003cp\u003eMIT physicists report the unexpected discovery of electrons forming crystalline structures in a material only billionths of a meter thick. The work adds to a gold mine of discoveries originating from the material, which the same team discovered only about three years ago.\u003c/p\u003e\n\n\n\t\t\t\t\t\t\t\t\t\t      \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003eIn a paper \u003ca href=\"https://www.nature.com/articles/s41586-024-08470-1\" target=\"_blank\"\u003epublished\u003c/a\u003e Jan. 22 in \u003ci\u003eNature\u003c/i\u003e, the team describes how electrons in devices made, in part, of the new material can become solid, or form crystals, by changing the voltage applied to the devices when they are kept at a temperature similar to that of outer space. Under the same conditions, they also showed the emergence of two new electronic states that add to \u003ca href=\"https://phys.org/news/2024-02-electrons-fractions-graphene.html\"\u003ework they reported last year\u003c/a\u003e showing that electrons can split into fractions of themselves.\u003c/p\u003e\n\u003cp\u003eThe physicists were able to make the discoveries thanks to new custom-made filters for better insulation of the equipment involved in the work. These allowed them to cool their devices to a temperature an order of magnitude colder than they achieved for the earlier results.\u003c/p\u003e\n\u003cp\u003eThe team also observed all of these phenomena using two slightly different \u0026#34;versions\u0026#34; of the new material, one composed of five layers of atomically thin carbon; the other composed of four layers. This indicates \u0026#34;that there\u0026#39;s a family of materials where you can get this kind of behavior, which is exciting,\u0026#34; says Long Ju, an assistant professor in the MIT Department of Physics who led the work. Ju is also affiliated with MIT\u0026#39;s Materials Research Laboratory and Research Lab of Electronics.\u003c/p\u003e\n\u003cp\u003eReferring to the new material, known as rhombohedral pentalayer graphene, Ju says, \u0026#34;We found a gold mine, and every scoop is revealing something new.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eNew material\u003c/h2\u003e\n\u003cp\u003eRhombohedral pentalayer graphene is essentially a special form of pencil lead. Pencil lead, or graphite, is composed of graphene, a single layer of carbon atoms arranged in hexagons resembling a honeycomb structure. Rhombohedral pentalayer graphene is composed of five layers of graphene stacked in a specific overlapping order.\u003c/p\u003e\n\u003cp\u003eSince Ju and colleagues discovered the material, they have tinkered with it by adding layers of another material they thought might accentuate the graphene\u0026#39;s properties, or even produce new phenomena. For example, in 2023 they created a sandwich of rhombohedral pentalayer graphene with \u0026#34;buns\u0026#34; made of hexagonal boron nitride. By applying different voltages, or amounts of electricity, to the sandwich, they discovered three important properties never before seen in natural graphite.\u003c/p\u003e\n\n\u003cdiv data-thumb=\"https://scx1.b-cdn.net/csz/news/tmb/2025/physicists-find-unexpe-1.jpg\" data-src=\"https://scx2.b-cdn.net/gfx/news/hires/2025/physicists-find-unexpe-1.jpg\" data-sub-html=\"EQAH states in device 1, the pentalayer device. Credit: \u0026lt;i\u0026gt;Nature\u0026lt;/i\u0026gt; (2025). DOI: 10.1038/s41586-024-08470-1\"\u003e\n        \u003cfigure\u003e\n            \u003cimg src=\"https://scx1.b-cdn.net/csz/news/800a/2025/physicists-find-unexpe-1.jpg\" alt=\"Physicists find unexpected crystals of electrons in new ultrathin material\" title=\"EQAH states in device 1, the pentalayer device. Credit: Nature (2025). DOI: 10.1038/s41586-024-08470-1\"/\u003e\n             \u003cfigcaption\u003e\n                EQAH states in device 1, the pentalayer device. Credit: \u003ci\u003eNature\u003c/i\u003e (2025). DOI: 10.1038/s41586-024-08470-1\n            \u003c/figcaption\u003e        \u003c/figure\u003e\n    \u003c/div\u003e\n\u003cp\u003eLast year, Ju and colleagues reported yet another important and even more surprising phenomenon: Electrons became fractions of themselves upon applying a current to a new device composed of rhombohedral pentalayer graphene and hexagonal boron nitride.\u003c/p\u003e\n\u003cp\u003eThis is important because this \u0026#34;fractional quantum Hall effect\u0026#34; has only been seen in a few systems, usually under very high magnetic fields. The Ju work showed that the phenomenon could occur in a fairly simple material without a magnetic field. As a result, it is called the \u0026#34;fractional quantum anomalous Hall effect\u0026#34; (anomalous indicates that no magnetic field is necessary).\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ch2\u003eNew results\u003c/h2\u003e\n\u003cp\u003eIn the current work, the Ju team reports yet more unexpected phenomena from the general rhombohedral graphene/boron nitride system when it is cooled to 30 millikelvins (1 millikelvin is equivalent to -459.668 degrees Fahrenheit). In last year\u0026#39;s paper, Ju and colleagues reported six fractional states of electrons. In the current work, they report discovering two more of these fractional states.\u003c/p\u003e\n\u003cp\u003eThey also found another unusual electronic phenomenon: the integer quantum anomalous Hall effect in a wide range of electron densities. The fractional quantum anomalous Hall effect was understood to emerge in an electron \u0026#34;liquid\u0026#34; phase, analogous to water. In contrast, the new state that the team has now observed can be interpreted as an electron \u0026#34;solid\u0026#34; phase—resembling the formation of electronic \u0026#34;ice\u0026#34;—that can also coexist with the fractional quantum anomalous Hall states when the system\u0026#39;s voltage is carefully tuned at ultra-low temperatures.\u003c/p\u003e\n\u003cp\u003eOne way to think about the relation between the integer and fractional states is to imagine a map created by tuning electric voltages: By tuning the system with different voltages, you can create a \u0026#34;landscape\u0026#34; similar to a river (which represents the liquid-like fractional states) cutting through glaciers (which represent the solid-like integer effect), Ju explains.\u003c/p\u003e\n\u003cp\u003eJu notes that his team observed all of these phenomena not only in pentalayer rhombohedral graphene, but also in rhombohedral \u003ca href=\"https://phys.org/tags/graphene/\" rel=\"tag\"\u003egraphene\u003c/a\u003e composed of four layers. This creates a family of materials, and indicates that other \u0026#34;relatives\u0026#34; may exist.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This work shows how rich this material is in exhibiting exotic phenomena. We\u0026#39;ve just added more flavor to this already very interesting material,\u0026#34; says Zhengguang Lu, a co-first author of the paper. Lu, who conducted the work as a postdoc at MIT, is now on the faculty at Florida State University.\u003c/p\u003e\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cp\u003e\u003cstrong\u003eMore information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\tZhengguang Lu et al, Extended quantum anomalous Hall states in graphene/hBN moiré superlattices, \u003ci\u003eNature\u003c/i\u003e (2025). \u003ca data-doi=\"1\" href=\"https://dx.doi.org/10.1038/s41586-024-08470-1\" target=\"_blank\"\u003eDOI: 10.1038/s41586-024-08470-1\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cstrong\u003eJournal information:\u003c/strong\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ca href=\"https://phys.org/journals/nature/\"\u003e\u003ccite\u003eNature\u003c/cite\u003e\u003c/a\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003ca href=\"http://www.nature.com/nature/index.html\" target=\"_blank\" rel=\"nofollow\"\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003csvg\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003cuse href=\"https://phys.b-cdn.net/tmpl/v6/img/svg/sprite.svg#icon_open\" x=\"0\" y=\"0\"\u003e\u003c/use\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/svg\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/a\u003e \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                               \t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n                              \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t\t  \u003ci\u003eThis story is republished courtesy of MIT News (\u003ca href=\"http://web.mit.edu/newsoffice/\" target=\"_blank\"\u003eweb.mit.edu/newsoffice/\u003c/a\u003e), a popular site that covers news about MIT research, innovation and teaching.\u003c/i\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t                                        \n\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\u003cdiv\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\u003cstrong\u003eCitation\u003c/strong\u003e:\n\t\t\t\t\t\t\t\t\t\t\t\tPhysicists find unexpected crystals of electrons in new ultrathin material (2025, February 26)\n\t\t\t\t\t\t\t\t\t\t\t\tretrieved 26 February 2025\n\t\t\t\t\t\t\t\t\t\t\t\tfrom https://phys.org/news/2025-02-physicists-unexpected-crystals-electrons-ultrathin.html\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\t \u003cp\u003e\n\t\t\t\t\t\t\t\t\t\t\t This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n\t\t\t\t\t\t\t\t\t\t\t part may be reproduced without the written permission. The content is provided for information purposes only.\n\t\t\t\t\t\t\t\t\t\t\t \u003c/p\u003e\n\t\t\t\t\t\t\t\t\t\t\u003c/div\u003e\n                                        \n\t\t\t\t\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-26T17:16:04-05:00",
  "modifiedTime": null
}
