{
  "id": "fd98c266-b5c8-4f57-b2ea-379a9643dce9",
  "title": "HIV, Trans Health, and Covid Research Targeted by Trump Cuts to NIH",
  "link": "https://www.scientificamerican.com/article/hiv-trans-health-and-covid-research-targeted-by-trump-cuts-to-nih/",
  "description": "An analysis reveals which fields of science and U.S. states are being hit hardest by National Institutes of Health grant terminations",
  "author": "",
  "published": "Fri, 11 Apr 2025 20:15:00 +0000",
  "source": "http://rss.sciam.com/ScientificAmerican-Global",
  "categories": null,
  "byline": "Max Kozlov, Chris Ryan",
  "length": 8603,
  "excerpt": "An analysis reveals which fields of science and U.S. states are being hit hardest by National Institutes of Health grant terminations",
  "siteName": "Scientific American",
  "favicon": "",
  "text": "The US National Institutes of Health (NIH) has terminated nearly 800 research projects at a breakneck pace, wiping out significant chunks of funding to entire scientific fields, finds a Nature analysis of the unprecedented cuts.The administration of US President Donald Trump began purging NIH-funded studies on topics that it deems problematic less than 50 days ago, continuously expanding its list to include research on topics ranging from COVID-19 to misinformation. Hundreds of the 30,000-plus scientists funded by the NIH yearly have been forced to halt their work after receiving notices that their research “no longer effectuates agency priorities”, and some have had to fire personnel or even shut down their laboratories.To understand the extent and breadth of these actions, which have so far clawed back more than US$2.3 billion allocated to US researchers, Nature tapped into a scientist-led effort to track these cuts (see ‘How Nature analysed NIH’s grant terminations’ in supplemental info). Our analysis reveals the project topics, NIH institutes and US states affected the most.On supporting science journalismIf you're enjoying this article, consider supporting our award-winning journalism by subscribing. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.The cancellations of projects, despite scientists scoring them highly during review, “tears the long-standing fabric of the government’s contract to pursue medical research that seeks to better the healthspan and lifespan for all Americans”, says Francis Collins, a geneticist who led the NIH, based in Bethesda, Maryland, for 12 years under 3 US presidents, including Trump.The NIH and its parent organization, the US Department of Health and Human Services (HHS) based in Washington DC, did not respond to Nature’s queries about the terminations or scientists’ concerns about them.Grant assessmentThe NIH is by far the world’s largest public funder of biomedical research, with an annual budget of US$47 billion paying for more than 60,000 grants. This size means that the agency’s funding is irreplaceable for science, says Shirley Tilghman, a molecular biologist and former president of Princeton University in New Jersey.Nature’s analysis shows that, looking at just the projects terminated so far, 17% are related to COVID-19, and 29% to HIV/AIDS (see ‘Terminated grant tally’) — although this represents less than 4% of all the grants awarded to each of those topics that the agency funded in 2024. One reason for the focus of these cuts is that the Trump administration has said that the COVID-19 pandemic is over and people in the United States have moved on from it. Another potential reason is that HIV/AIDS disproportionately affects sexual and gender minorities (LGBT+); Trump signed an executive order on his first day in office on 20 January, directing the US government to stop acknowledging the fact that a person’s gender can differ from their sex at birth.The scientific fields hit hardest by the NIH’s cuts are those related to the health of transgender people, and the broader LGBT+ community, where around half of grants have been cut compared with what the NIH funded in 2024 (see ‘Fields under fire’).These actions deny “a small but real percentage of the population answers to critically important questions about their health”, Tilghman says. “You cannot eliminate a segment of the population by executive order, but you can harm them greatly.”The NIH institutes that fund a lot of research in these now-disfavoured topic areas — for instance, the US National Institute on Minority Health and Health Disparities — have been hammered by the cuts (see ‘US NIH institutes losing the most’). Five of six of the directors of the NIH’s institutes and centres affected the most by these grant cancellations were placed on administrative leave last week, amid a glut of lay-offs and restructuring at the HHS.Geographical impactsTrump and his Republican allies have said that they want to rein in ‘woke’ left-wing, elite universities. The grant terminations are now damaging the scientific enterprise at research institutions in both ‘red’ states that voted for Trump in 2024 and ‘blue’ states that didn’t (see ‘Grant cuts by state’). Washington state, a blue state in 2024, has been hit hardest by the grant terminations, relative to how much NIH funding it typically receives in a year, with North Carolina, a red state in 2024, being a close second.But the administration isn’t just cutting NIH grants at the wealthiest universities: many cuts are also happening at small state schools and historically Black colleges and universities, says Scott Delaney, an epidemiologist at the Harvard T. H. Chan School of Public Health in Boston, Massachusetts, who co-runs the database that Nature used for its analysis. To create the database, Delaney and his collaborator, Noam Ross, executive director of the data-science non-profit organization rOpenSci, based in Berkeley, California, have been asking scientists to submit information about their grant terminations and scraping from a list of cancelled projects that the HHS posts on its website weekly.Biomedical-research heavyweight states Massachusetts, California, Maryland and Texas have lost some of the largest absolute amounts of research funding, but because they receive so much from the NIH, the impact has been less than for other states. New York state is an exception — it registers in the top five states affected, according to Nature’s analysis, because it is home to Columbia University in New York City.Trump’s team has targeted research grants at Columbia, cancelling $400 million to the university because, the administration has said, it failed to protect Jewish students from harassment during campus protests over Israel’s war in Gaza.Unlike at other universities that lost NIH grants tied to topics of concern for the administration, Columbia has had a much broader swath of grants cancelled. Nature searched all terminated NIH grants for keywords that officials at federal agencies have been directed to search for, including ‘diversity’, ‘barrier’ and ‘underserved’. The NIH terminated 89 grants at Columbia that contained fewer than 4 flagged words, compared with the institution that received the second-most terminations, Emory University in Atlanta, Georgia, which lost 3 grants in this category. This indicates that the administration was less focused on topics of concern and more focused on cutting a certain amount of funding at Columbia. For instance, one of the cut grants was titled, ‘Long-term exposure to arsenic, and the co-occurrence of uranium, in public and private drinking water‘, and investigated links between arsenic and chronic heart and kidney disease.Since terminating these grants, the Trump administration has threatened the same treatment at several other elite universities that together receive billions in research funding. Nature’s analysis of the database should quash any wishful thinking that, “I have this grant studying synapses in fruit flies, and so I’m safe”, Delaney says. “Not if you’re at a targeted institution.”Termination normalizedIn the past, the termination of grants has been exceedingly rare, reserved only for gross misconduct, poor performance or fraud, says a former senior employee at the NIH, who requested anonymity out of fear of retribution. Even in those cases, institutions are often given the opportunity to remedy the situation, the former worker says.“Up until now, grant recipients have been able to assume that, as long as they do good work and don’t do anything stupid, they’ll have five years of funding,” they add. “Now, that’s gone.”This uncertainty, combined with the hostility toward institutions of higher education, is already having a deep chilling effect: more than 75% of respondents to an informal Nature poll of readers who are scientists said that they were considering leaving the United States.A coalition of 16 state attorney-generals, as well as a group of researchers and research-affiliated organizations, filed two legal challenges seeking to overturn grant cancellations and bar the NIH from continuing what one lawsuit calls a “reckless and illegal purge to stamp out NIH-funded research that addresses topics and populations that they disfavor”. The NIH did not respond to Nature’s queries about the lawsuits. The HHS said that it doesn’t comment on pending litigation.This article is reproduced with permission and was first published on April 10, 2025.",
  "image": "https://static.scientificamerican.com/dam/m/7730f43ca345b114/original/Washington_DC_Stand-Up_for_Science-Rally.jpg?m=1744400923.82\u0026w=1200",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe US National Institutes of Health (NIH) \u003ca href=\"https://www.nature.com/articles/d41586-025-00703-1\"\u003ehas terminated\u003c/a\u003e nearly 800 research projects at a breakneck pace, wiping out significant chunks of funding to entire scientific fields, finds a \u003ci\u003eNature\u003c/i\u003e analysis of the unprecedented cuts.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe administration of US President Donald Trump began purging NIH-funded studies on topics that it deems problematic less than 50 days ago, continuously expanding its list to include research on topics ranging from \u003ca href=\"https://www.nature.com/articles/d41586-025-00954-y\"\u003eCOVID-19\u003c/a\u003e to misinformation. Hundreds of the 30,000-plus scientists funded by the NIH yearly have been forced to halt their work after receiving notices that their research “no longer effectuates agency priorities”, and some have had to fire personnel or even shut down their laboratories.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTo understand the extent and breadth of these actions, which have so far clawed back more than US$2.3 billion allocated to US researchers, \u003ci\u003eNature\u003c/i\u003e tapped into a scientist-led effort to track these cuts (see ‘How \u003ci\u003eNature\u003c/i\u003e analysed NIH’s grant terminations’ in supplemental info). Our analysis reveals the project topics, NIH institutes and US states affected the most.\u003c/p\u003e\u003chr/\u003e\u003ch2\u003eOn supporting science journalism\u003c/h2\u003e\u003cp\u003eIf you\u0026#39;re enjoying this article, consider supporting our award-winning journalism by \u003ca href=\"https://www.scientificamerican.com/getsciam/\"\u003esubscribing\u003c/a\u003e. By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.\u003c/p\u003e\u003chr/\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe cancellations of projects, despite scientists scoring them highly during review, “tears the long-standing fabric of the government’s contract to pursue medical research that seeks to better the healthspan and lifespan for all Americans”, says Francis Collins, \u003ca href=\"https://www.nature.com/articles/d41586-021-03611-2\"\u003ea geneticist who led the NIH, based in Bethesda, Maryland, for 12 years\u003c/a\u003e under 3 US presidents, including Trump.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe NIH and its parent organization, the US Department of Health and Human Services (HHS) based in Washington DC, did not respond to \u003ci\u003eNature\u003c/i\u003e’s queries about the terminations or scientists’ concerns about them.\u003c/p\u003e\u003ch2 id=\"grant-assessment\" data-block=\"sciam/heading\"\u003eGrant assessment\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe NIH is by far \u003ca href=\"https://www.nature.com/articles/d41586-025-00754-4\"\u003ethe world’s largest public funder of biomedical research\u003c/a\u003e, with an annual budget of US$47 billion paying for more than 60,000 grants. This size means that the agency’s funding is irreplaceable for science, says Shirley Tilghman, a molecular biologist and former president of Princeton University in New Jersey.\u003c/p\u003e\u003cfigure data-block=\"contentful/image\" data-disable-apple-news=\"true\"\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 0px)\" srcset=\"https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003cimg alt=\"Terminated grant tally. Bar chart. Under President Donald Trump, the US National Institutes of Health has cancelled roughly 770 active research grants as of 7 April. Nearly 29% of the grants terminated were for research that mentioned HIV/AIDS, and about one-quarter of the grants terminated were related to the health of transgender people. Other topic areas that the Trump team has deemed no longer in the interests of the agency are COVID-19 and the effects of climate change on health.\" decoding=\"async\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=900\" width=\"3130\" height=\"2250\" srcset=\"https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/d34a4bf043e5df1/original/NIH-grants_graphic_1.png?m=1744401187.929\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eNature\u003c/i\u003e’s analysis shows that, looking at just the projects terminated so far, 17% are related to COVID-19, and 29% to HIV/AIDS (see ‘Terminated grant tally’) — although this represents less than 4% of all the grants awarded to each of those topics that the agency funded in 2024. One reason for the focus of these cuts is that the Trump administration has said that the COVID-19 pandemic is over and people in the United States have moved on from it. Another potential reason is that HIV/AIDS disproportionately affects sexual and gender minorities (LGBT+); Trump \u003ca href=\"https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/\"\u003esigned an executive order on his first day in office\u003c/a\u003e on 20 January, directing the US government to stop acknowledging the fact that a person’s gender can differ from their sex at birth.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe scientific fields hit hardest by the NIH’s cuts are those related to the health of transgender people, and the broader LGBT+ community, where around half of grants have been cut compared with what the NIH funded in 2024 (see ‘Fields under fire’).\u003c/p\u003e\u003cfigure data-block=\"contentful/image\" data-disable-apple-news=\"true\"\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 0px)\" srcset=\"https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003cimg alt=\"Fields under fire. Infographic. Some research fields have been heavily affected by grant terminations implemented by the US National Institutes of Health (NIH) under President Donald Trump. Around half of the active, NIH-funded projects about gender, sexual minorities (LGBT+) and vaccine hesitancy have been cancelled. 3.4% of HIV or AIDS grants have been terminated.\" decoding=\"async\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=900\" width=\"3130\" height=\"3500\" srcset=\"https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/146e021f871dfbff/original/NIH-grants_graphic_2.png?m=1744401227.089\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThese actions deny “a small but real percentage of the population answers to critically important questions about their health”, Tilghman says. “You cannot eliminate a segment of the population by executive order, but you can harm them greatly.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThe NIH institutes that fund a lot of research in these now-disfavoured topic areas — for instance, the US National Institute on Minority Health and Health Disparities — have been hammered by the cuts (see ‘US NIH institutes losing the most’). Five of six of the directors of the NIH’s institutes and centres affected the most by these grant cancellations \u003ca href=\"https://www.nature.com/articles/d41586-025-01016-z\"\u003ewere placed on administrative leave last week\u003c/a\u003e, amid a glut of lay-offs and restructuring at the HHS.\u003c/p\u003e\u003cfigure data-block=\"contentful/image\" data-disable-apple-news=\"true\"\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 0px)\" srcset=\"https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003cimg alt=\"US NIH institutes losing the most. Bar chart. The institutes and centers of the US National Institutes of Health that have the highest termination impact index, as calculated by Nature. The institutes and centers that focus on health of minority groups and infectious diseases have been targeted the most for grant cuts under Trump 2.0.\" decoding=\"async\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=900\" width=\"3130\" height=\"2500\" srcset=\"https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/3eba27c9e1ed08cd/original/NIH-grants_graphic_3.png?m=1744401266.512\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003ch2 id=\"geographical-impacts\" data-block=\"sciam/heading\"\u003eGeographical impacts\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTrump and his Republican allies have said that they want to rein in ‘woke’ left-wing, elite universities. The grant terminations are now damaging the scientific enterprise at research institutions in both ‘red’ states that voted for Trump in 2024 and ‘blue’ states that didn’t (see ‘Grant cuts by state’). Washington state, a blue state in 2024, has been hit hardest by the grant terminations, relative to how much NIH funding it typically receives in a year, with North Carolina, a red state in 2024, being a close second.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBut the administration isn’t just cutting NIH grants at the wealthiest universities: many cuts are also happening at small state schools and historically Black colleges and universities, says Scott Delaney, an epidemiologist at the Harvard T. H. Chan School of Public Health in Boston, Massachusetts, who co-runs \u003ca href=\"https://airtable.com/appjhyo9NTvJLocRy/shrNto1NNp9eJlgpA?Ffj6Q=sfs3tVjFBKnHYLkFJ\u0026amp;Ffj6Q%3Aview=plasNjSudszRmPvEo\u0026amp;Ffj6Q%3Asort=eyJwZWx1WnZkdFBydlpJRGhLZyI6W3siY29sdW1uSWQiOiJmbGROMlVmSG5ZRjRYM1pEdiIsImFzY2VuZGluZyI6ZmFsc2V9XX0\"\u003ethe database that \u003ci\u003eNature\u003c/i\u003e used for its analysis\u003c/a\u003e. To create the database, Delaney and his collaborator, Noam Ross, executive director of the data-science non-profit organization rOpenSci, based in Berkeley, California, have been asking scientists to submit information about their grant terminations and scraping from a list of cancelled projects that the HHS posts on its website weekly.\u003c/p\u003e\u003cfigure data-block=\"contentful/image\" data-disable-apple-news=\"true\"\u003e\u003cpicture\u003e\u003csource media=\"(min-width: 0px)\" srcset=\"https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003cimg alt=\"Grant cuts by state. Map of the United States showing termination impact index and the 2024 election result for individual states. States that voted for Republican Donald Trump in the 2024 presidential election and Democrat Kamala Harris are both being hit hard by terminations of research grants awarded by the US National Institutes of Health.\" decoding=\"async\" loading=\"lazy\" src=\"https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=900\" width=\"3130\" height=\"3084\" srcset=\"https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1000 1000w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1200 1200w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=1350 1350w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=2000 2000w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=600 600w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=750 750w, https://static.scientificamerican.com/dam/m/7bb5d13aceec6f39/original/NIH-grants_graphic_4.png?m=1744401303.786\u0026amp;w=900 900w\" sizes=\"(min-width: 2000px) 2000px, (min-resolution: 3dppx) 50vw, (min-resolution: 2dppx) 75vw, 100vw\"/\u003e\u003c/picture\u003e\u003cfigcaption\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp data-block=\"sciam/paragraph\"\u003eBiomedical-research heavyweight states Massachusetts, California, Maryland and Texas have lost some of the largest absolute amounts of research funding, but because they receive so much from the NIH, the impact has been less than for other states. New York state is an exception — it registers in the top five states affected, according to \u003ci\u003eNature\u003c/i\u003e’s analysis, because it is home to Columbia University in New York City.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eTrump’s team \u003ca href=\"https://www.nature.com/articles/d41586-025-00812-x\"\u003ehas targeted research grants at Columbia\u003c/a\u003e, cancelling $400 million to the university because, the administration has said, it failed to protect Jewish students from harassment during \u003ca href=\"https://www.nature.com/articles/d41586-024-01492-9\"\u003ecampus protests over Israel’s war in Gaza\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eUnlike at other universities that lost NIH grants tied to topics of concern for the administration, Columbia has had a much broader swath of grants cancelled. \u003ci\u003eNature \u003c/i\u003esearched all terminated NIH grants for keywords that officials at \u003ca href=\"https://www.nytimes.com/interactive/2025/03/07/us/trump-federal-agencies-websites-words-dei.html\"\u003efederal agencies have been directed to search for\u003c/a\u003e, including ‘diversity’, ‘barrier’ and ‘underserved’. The NIH terminated 89 grants at Columbia that contained fewer than 4 flagged words, compared with the institution that received the second-most terminations, Emory University in Atlanta, Georgia, which lost 3 grants in this category. This indicates that the administration was less focused on topics of concern and more focused on cutting a certain amount of funding at Columbia. For instance, one of the cut grants was titled, ‘\u003ca href=\"https://reporter.nih.gov/search/-gEBAUPoJUid4mL4KQD5oA/project-details/10922694\"\u003eLong-term exposure to arsenic, and the co-occurrence of uranium, in public and private drinking water\u003c/a\u003e‘, and investigated links between arsenic and chronic heart and kidney disease.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eSince terminating these grants, the Trump administration has threatened the same treatment at several other elite universities that together receive billions in research funding. \u003ci\u003eNature\u003c/i\u003e’s analysis of the database should quash any wishful thinking that, “I have this grant studying synapses in fruit flies, and so I’m safe”, Delaney says. “Not if you’re at a targeted institution.”\u003c/p\u003e\u003ch2 id=\"termination-normalized\" data-block=\"sciam/heading\"\u003eTermination normalized\u003c/h2\u003e\u003cp data-block=\"sciam/paragraph\"\u003eIn the past, the termination of grants has been exceedingly rare, reserved only for gross misconduct, poor performance or fraud, says a former senior employee at the NIH, who requested anonymity out of fear of retribution. Even in those cases, institutions are often given the opportunity to remedy the situation, the former worker says.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e“Up until now, grant recipients have been able to assume that, as long as they do good work and don’t do anything stupid, they’ll have five years of funding,” they add. “Now, that’s gone.”\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eThis uncertainty, combined with the hostility toward institutions of higher education, is already having a deep chilling effect: more than 75% of respondents to an informal \u003ci\u003eNature\u003c/i\u003e poll of readers who are scientists \u003ca href=\"https://www.nature.com/articles/d41586-025-00938-y\"\u003esaid that they were considering leaving the United States\u003c/a\u003e.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003eA coalition of 16 state attorney-generals, as well as a group of researchers and research-affiliated organizations, filed two legal challenges seeking to overturn grant cancellations and bar the NIH from continuing what one lawsuit calls a “reckless and illegal purge to stamp out NIH-funded research that addresses topics and populations that they disfavor”. The NIH did not respond to \u003ci\u003eNature\u003c/i\u003e’s queries about the lawsuits. The HHS said that it doesn’t comment on pending litigation.\u003c/p\u003e\u003cp data-block=\"sciam/paragraph\"\u003e\u003ci\u003eThis article is reproduced with permission and was \u003c/i\u003e\u003ca href=\"https://www.nature.com/articles/d41586-025-01099-8\"\u003e\u003ci\u003efirst published\u003c/i\u003e\u003c/a\u003e\u003ci\u003e on April 10, 2025\u003c/i\u003e.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-04-11T16:15:00-04:00",
  "modifiedTime": null
}
