{
  "id": "00a9f2c7-f321-4d0e-856c-d9849c74c7b5",
  "title": "From Berlin to Brooklyn: A Tale of Two Adaptive Reuse Transformations",
  "link": "https://architizer.com/blog/inspiration/stories/berlin-brooklyn-adaptive-reuse-transformations/",
  "description": "Tabula rasa is out and radical reuse is in. The post From Berlin to Brooklyn: A Tale of Two Adaptive Reuse Transformations appeared first on Journal.",
  "author": "Kalina Prelikj",
  "published": "Tue, 29 Oct 2024 15:01:31 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Inspiration",
    "Stories",
    "A+Spotlight",
    "Awards"
  ],
  "byline": "Kalina Prelikj",
  "length": 8793,
  "excerpt": "Tabula rasa is out and radical reuse is in.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "With a diverse jury of global experts and a global voting public, Architizer's A+Awards champions firms around the world. Get your work in front of the industry's best by starting your submission today.  When you hear the phrase adaptive reuse, what comes to mind? Perhaps it’s the familiar image of a warehouse-turned-loft or an old factory-turned-art gallery — textbook cases of repurposing buildings where the structure remains largely intact. But adaptive reuse isn’t always so straightforward. It exists on a spectrum, with projects ranging from practical updates that subtly extend a building’s use to radical transformations that change its purpose entirely. At its core, adaptive reuse is about more than just preserving what exists — it’s about reimagining what a space can become. This idea was the focus of two talks at Future Fest 2024. Whereas MVRDV’s Atelier Gardens in Berlin is a playful redesign that turns an old campus into a lively community space, PAU’s The Refinery in Brooklyn is a bold project that preserves the industrial heritage of the Domino Sugar complex while taking an unexpected and radical approach to its transformation. Inspired by the two talks, this article explores how these two projects take a different approach to adaptive reuse — one using lively updates to refresh a space, the other taking a radical path to reimagine a historic building from within — literally. Readers will also find opportunities to access the full recordings of the two Future Fest talks, 100% free. MVRDV’s Take: A Creative Statement with a Purpose “It always feels good to be recognized for something you’ve worked on for so long,” reflected Klaas Hofman, senior associate at MVRDV, during his talk at Future Fest, which focused on an A+Award-winning adaptive reuse project in Berlin. Hofman explained that although many of the firm’s projects gain global recognition, it’s usually the ones considered more ‘iconic.’ “And when we worked on this project, not many people — even in the office — knew about it. It’s a very sympathetic project, working with very small interventions. There are a lot of hidden qualities here that don’t scream out loud that this is award-winning architecture.” HAUS 1 is part of the Atelier Gardens project, transforming the BUFA film studios at Tempelhof Airport into a campus for activists, creatives and organizations focused on social and environmental change. MVRDV embraced a light-touch approach to adaptive reuse, focusing on keeping the building’s structure intact while upgrading its use and sustainability features. Register to Access Recording Inside, the redesign introduced adaptable workspaces, meeting rooms and a café, with new insulation, underfloor heating and energy-efficient lighting to improve the building’s environmental footprint. Water-saving systems using recycled rainwater were also installed, ensuring the building aligns with the campus’s sustainability goals. The decision to paint the entire building yellow gave it a new identity. Initially, only the new elements were going to be painted, but the client felt a stronger statement was needed. Yellow was chosen to contrast with the surrounding tones and reflect a sense of happiness, brightness and vibrancy. The addition of the rooftop pavilion and staircase further redefined the building’s role. Originally, the roof was inaccessible, but the team saw an opportunity. “This is the highest building on site and we saw that it was a missed opportunity if we did not provide access to the rooftop somehow,” Hofman said. “We convinced the client to let the public enjoy this beautiful view. So we proposed this pavilion on top, sitting in the roof garden and added this staircase. This allowed for the rooftop to become a public destination without interfering with the internal logistics of the building.” The zig-zagging staircase wrapping around the building became a key feature, serving both as a functional fire escape and a public gathering space. “The zig-zag stairs became quite an expressive element — something the client was looking for,” Hofman noted. Along the stairs, small chairs and tables encourage visitors to sit, meet and relax. Over time, as trees grow around it, the staircase will meander through greenery, offering a peaceful space for visitors to connect with nature. The transformation of HAUS 1 shows how adaptive reuse doesn’t always need radical interventions to have radical impact. By working within the existing structure, MVRDV gave the building a completely new identity and purpose, using color as one of the mail tools to achieve impactful results. Register to Access Recording PAU’s Take: Radical Reuse and the Art of Layering History At Future Fest 2024, Vishaan Chakrabarti, Founder and Creative Director of PAU, shared his perspective on adaptive reuse through what he describes as the “architecture of the palimpsest.” This concept reflects the idea that cities, buildings and communities are composed of many layers of history that should not be erased but carried forward. Chakrabarti emphasized that adaptive reuse applies not just to individual structures but to entire urban environments, allowing their historical narratives to evolve rather than be wiped clean. “What this image conjures is this notion that when we think about progress, we don’t think about it as a blank slate, like they did in the 20th century, but as layers of history, like a palimpsest, where you pull the past forward with you into the future. And we try to do that with all our work,” he explained. This philosophy guided PAU’s transformation of the Domino Sugar Refinery, where the team inserted a new building within the historic structure, respecting the site’s industrial heritage while creating spaces fit for modern use. Register to Access Recording “We did this drawing to explain to the landmarks commission and the public what this building was. That it was an envelope for machinery. The fenestration, the façade, was largely fake — the windows didn’t correlate to specific levels, but to the machinery inside.” Rather than trying to force modern functions into a structure not built for human use, PAU chose a bold approach: they would insert a brand-new building within the historic shell, leaving a 10-12 foot gap between the old masonry and the new interior. This design allowed them to create office floors with standardized heights, improving accessibility and functionality while celebrating the original architecture. “The design process for the architecture of the palimpsest must begin by reading the layers of history before we lay in the contemporary. We began by reading the historic structure, specifically the masonry facade. A comprehensive masonry survey was conducted to ensure that what we were proposing was appropriate and would in no way compromise the building’s integrity,” Ruchika Modi, Principal at PAU explained. During their talk, Modi also went over structural and engineering details, offering deeper insights into how PAU brought this ambitious vision to life. Register to Access Recording The perimeter atrium between the old and new walls now serves as a light-filled space with hanging gardens, where visitors can appreciate both the historic brickwork and views of the East River and Manhattan through the original windows. The design preserves the industrial grit and patina of the old facade while providing modern comfort within. At the top of the building, the new addition culminates in ‘The Vault,’ a glass barrel-vaulted penthouse with 360-degree views of the city. This rooftop event space draws inspiration from the original building’s American Round Arch style and allows visitors to interact with the iconic smokestack and neon sign. PAU’s approach exemplifies how adaptive reuse can go beyond preservation by introducing entirely new functions while respecting the history embedded within a space. Their design not only revitalizes the Refinery but also connects it to the larger urban fabric, ensuring the building remains relevant and useful for generations to come. Improvise, Adapt, Overcome From Berlin’s Atelier Gardens, where small interventions breathe new life into a creative campus, to Brooklyn’s Domino Refinery, where an entirely new building emerges within historic walls, these projects showcase the spectrum of adaptive reuse. Whether through subtle updates or radical transformations, each project serves as a reminder that architecture evolves by building on the layers of the past, creating spaces that are relevant, functional and future-ready. With a diverse jury of global experts and a global voting public, Architizer's A+Awards champions firms around the world. Get your work in front of the industry's best by starting your submission today.",
  "image": "https://blog.architizer.com/wp-content/uploads/HERO-1.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003cem\u003eWith a \u003ca href=\"https://awards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003ediverse jury of global experts\u003c/a\u003e and a\u003ca href=\"https://awards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e global voting public\u003c/a\u003e, Architizer\u0026#39;s A+Awards champions firms around the world. Get your work in front of the industry\u0026#39;s best by \u003ca href=\"https://enter.architizer.com/?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003estarting your submission today\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWhen you hear the phrase adaptive reuse, what comes to mind? Perhaps it’s the familiar image of a warehouse-turned-loft or an old factory-turned-art gallery — textbook cases of repurposing buildings where the structure remains largely intact. But adaptive reuse isn’t always so straightforward. It exists on a spectrum, with projects ranging from practical updates that subtly extend a building’s use to radical transformations that change its purpose entirely.\u003c/p\u003e\n\u003cp\u003eAt its core, adaptive reuse is about more than just preserving what exists — it’s about reimagining what a space can become.\u003c/p\u003e\n\u003cp\u003eThis idea was the focus of two talks at \u003ca href=\"https://architizer.com/blog/inside-architizer/updates/future-fest-2024-full-schedule/\" target=\"_blank\" rel=\"noopener\"\u003eFuture Fest 2024\u003c/a\u003e. Whereas MVRDV’s Atelier Gardens in Berlin is a playful redesign that turns an old campus into a lively community space, PAU’s The Refinery in Brooklyn is a bold project that preserves the industrial heritage of the Domino Sugar complex while taking an unexpected and radical approach to its transformation.\u003c/p\u003e\n\u003cp\u003eInspired by the two talks, this article explores how these two projects take a different approach to adaptive reuse — one using lively updates to refresh a space, the other taking a radical path to reimagine a historic building from within — \u003cem\u003eliterally\u003c/em\u003e. Readers will also find opportunities to access the full recordings of the two Future Fest talks, 100% free.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003e\u003ca href=\"https://architizer.com/firms/mvrdv/\" target=\"_blank\" rel=\"noopener\"\u003eMVRDV\u003c/a\u003e’s Take: A Creative Statement with a Purpose\u003c/h2\u003e\n\u003cp\u003e“It always feels good to be recognized for something you’ve worked on for so long,” reflected Klaas Hofman, senior associate at MVRDV, during his talk at Future Fest, which focused on an A+Award-winning adaptive reuse project in Berlin. Hofman explained that although many of the firm’s projects gain global recognition, it’s usually the ones considered more ‘iconic.’\u003c/p\u003e\n\u003cp\u003e“And when we worked on this project, not many people — even in the office — knew about it. It’s a very sympathetic project, working with very small interventions. There are a lot of hidden qualities here that don’t scream out loud that this is award-winning architecture.”\u003c/p\u003e\n\n\u003cp\u003eHAUS 1 is part of the Atelier Gardens project, transforming the BUFA film studios at Tempelhof Airport into a campus for activists, creatives and organizations focused on social and environmental change. MVRDV embraced a light-touch approach to adaptive reuse, focusing on keeping the building’s structure intact while upgrading its use and sustainability features.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://app.livestorm.co/architizer/future-fest-2024-with-mvrdv?type=detailed\" target=\"_blank\" rel=\"noopener\"\u003eRegister to Access Recording\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eInside, the redesign introduced adaptable workspaces, meeting rooms and a café, with new insulation, underfloor heating and energy-efficient lighting to improve the building’s environmental footprint. Water-saving systems using recycled rainwater were also installed, ensuring the building aligns with the campus’s sustainability goals.\u003c/p\u003e\n\n\n\u003cp\u003eThe decision to paint the entire building yellow gave it a new identity. Initially, only the new elements were going to be painted, but the client felt a stronger statement was needed. Yellow was chosen to contrast with the surrounding tones and reflect a sense of happiness, brightness and vibrancy.\u003c/p\u003e\n\u003cp\u003eThe addition of the rooftop pavilion and staircase further redefined the building’s role. Originally, the roof was inaccessible, but the team saw an opportunity. “This is the highest building on site and we saw that it was a missed opportunity if we did not provide access to the rooftop somehow,” Hofman said. “We convinced the client to let the public enjoy this beautiful view. So we proposed this pavilion on top, sitting in the roof garden and added this staircase. This allowed for the rooftop to become a public destination without interfering with the internal logistics of the building.”\u003c/p\u003e\n\n\n\u003cp\u003eThe zig-zagging staircase wrapping around the building became a key feature, serving both as a functional fire escape and a public gathering space. “The zig-zag stairs became quite an expressive element — something the client was looking for,” Hofman noted. Along the stairs, small chairs and tables encourage visitors to sit, meet and relax. Over time, as trees grow around it, the staircase will meander through greenery, offering a peaceful space for visitors to connect with nature.\u003c/p\u003e\n\u003cp\u003eThe transformation of HAUS 1 shows how adaptive reuse doesn’t always need radical interventions to have radical impact. By working within the existing structure, MVRDV gave the building a completely new identity and purpose, using color as one of the mail tools to achieve impactful results.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://app.livestorm.co/architizer/future-fest-2024-with-mvrdv?type=detailed\" target=\"_blank\" rel=\"noopener\"\u003eRegister to Access Recording\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003e\u003ca href=\"https://architizer.com/firms/practice-for-architecture-urbanism-pau/\" target=\"_blank\" rel=\"noopener\"\u003ePAU\u003c/a\u003e’s Take: Radical Reuse and the Art of Layering History\u003c/h2\u003e\n\u003cp\u003eAt Future Fest 2024, Vishaan Chakrabarti, Founder and Creative Director of PAU, shared his perspective on adaptive reuse through what he describes as the “architecture of the palimpsest.” This concept reflects the idea that cities, buildings and communities are composed of many layers of history that should not be erased but carried forward. Chakrabarti emphasized that adaptive reuse applies not just to individual structures but to entire urban environments, allowing their historical narratives to evolve rather than be wiped clean.\u003c/p\u003e\n\u003cp\u003e“What this image conjures is this notion that when we think about progress, we don’t think about it as a blank slate, like they did in the 20th century, but as layers of history, like a palimpsest, where you pull the past forward with you into the future. And we try to do that with all our work,” he explained.\u003c/p\u003e\n\n\u003cp\u003eThis philosophy guided PAU’s transformation of the Domino Sugar Refinery, where the team inserted a new building within the historic structure, respecting the site’s industrial heritage while creating spaces fit for modern use.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://app.livestorm.co/architizer/future-fest-2024-with-practice-for-architecture-and-urbanism-pau?type=detailed\" target=\"_blank\" rel=\"noopener\"\u003eRegister to Access Recording\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e“We did this drawing to explain to the landmarks commission and the public what this building was. That it was an envelope for machinery. The fenestration, the façade, was largely fake — the windows didn’t correlate to specific levels, but to the machinery inside.”\u003c/p\u003e\n\n\u003cp\u003eRather than trying to force modern functions into a structure not built for human use, PAU chose a bold approach: they would insert a brand-new building within the historic shell, leaving a 10-12 foot gap between the old masonry and the new interior. This design allowed them to create office floors with standardized heights, improving accessibility and functionality while celebrating the original architecture.\u003c/p\u003e\n\u003cp\u003e“The design process for the architecture of the palimpsest must begin by reading the layers of history before we lay in the contemporary. We began by reading the historic structure, specifically the masonry facade. A comprehensive masonry survey was conducted to ensure that what we were proposing was appropriate and would in no way compromise the building’s integrity,” Ruchika Modi, Principal at PAU explained.\u003c/p\u003e\n\n\u003cp\u003eDuring their talk, Modi also went over structural and engineering details, offering deeper insights into how PAU brought this ambitious vision to life.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://app.livestorm.co/architizer/future-fest-2024-with-practice-for-architecture-and-urbanism-pau?type=detailed\" target=\"_blank\" rel=\"noopener\"\u003eRegister to Access Recording\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe perimeter atrium between the old and new walls now serves as a light-filled space with hanging gardens, where visitors can appreciate both the historic brickwork and views of the East River and Manhattan through the original windows. The design preserves the industrial grit and patina of the old facade while providing modern comfort within.\u003c/p\u003e\n\u003cp\u003eAt the top of the building, the new addition culminates in ‘The Vault,’ a glass barrel-vaulted penthouse with 360-degree views of the city. This rooftop event space draws inspiration from the original building’s American Round Arch style and allows visitors to interact with the iconic smokestack and neon sign.\u003c/p\u003e\n\n\n\u003cp\u003ePAU’s approach exemplifies how adaptive reuse can go beyond preservation by introducing entirely new functions while respecting the history embedded within a space. Their design not only revitalizes the Refinery but also connects it to the larger urban fabric, ensuring the building remains relevant and useful for generations to come.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eImprovise, Adapt, Overcome\u003c/h2\u003e\n\u003cp\u003eFrom Berlin’s Atelier Gardens, where small interventions breathe new life into a creative campus, to Brooklyn’s Domino Refinery, where an entirely new building emerges within historic walls, these projects showcase the spectrum of adaptive reuse. Whether through subtle updates or radical transformations, each project serves as a reminder that architecture evolves by building on the layers of the past, creating spaces that are relevant, functional and future-ready.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWith a \u003ca href=\"https://awards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003ediverse jury of global experts\u003c/a\u003e and a\u003ca href=\"https://awards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e global voting public\u003c/a\u003e, Architizer\u0026#39;s A+Awards champions firms around the world. Get your work in front of the industry\u0026#39;s best by \u003ca href=\"https://enter.architizer.com/?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003estarting your submission today\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2024-10-29T15:01:31Z",
  "modifiedTime": "2024-10-29T17:12:50Z"
}
