{
  "id": "09cf0426-0920-4b36-93b6-fc510ff54b47",
  "title": "At New York City Hall protest, public housing residents demand end to Fulton Elliott-Chelsea plan",
  "link": "https://www.archpaper.com/2024/10/protest-new-york-city-hall-public-housing-residents/",
  "description": "Politicians, public housing residents, and tenants rights activists gathered on the steps of New York City Hall this week amid calls for Mayor Eric Adams’s resignation. They were there on The post At New York City Hall protest, public housing residents demand end to Fulton Elliott-Chelsea plan appeared first on The Architect’s Newspaper.",
  "author": "Daniel Jonas Roche",
  "published": "Fri, 11 Oct 2024 20:15:54 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Architecture",
    "Development",
    "East",
    "News",
    "Affordable Housing",
    "Eric Adams",
    "Housing Crisis",
    "housing policy",
    "New York City",
    "NYCHA",
    "PAU",
    "Protests",
    "Public Housing",
    "Public Protest"
  ],
  "byline": "Daniel Jonas Roche",
  "length": 5809,
  "excerpt": "Politicians, public housing residents, and tenants rights activists gathered on the steps of New York City Hall this week to protest the privatization and demolition of three NYCHA developments in the Manhattan neighborhood of Chelsea.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "Politicians, public housing residents, and tenants rights activists gathered on the steps of New York City Hall this week amid calls for Mayor Eric Adams’s resignation. They were there on October 10 to protest the privatization and demolition of three NYCHA developments in the Manhattan neighborhood of Chelsea, Fulton Houses and Elliott-Chelsea Houses, where more than 5,000 people live in Section 9 public housing. The Fulton Elliott-Chelsea (FEC) plan is by Related, Essence, PAU, COOKFOX, and ILA, as reported by AN. “I’ve been [in Fulton Houses] for 22 years, and this situation has made me beyond devastated,” said Jackie Lara, who staunchly opposes the FEC plan. “My home is being taken away from me. So the residents of our community firmly deny the proposed demolition of our homes which have multiple generations and families. I want my family to continue to be here.”  Lara added that she and other tenants have gathered 920 signatures (and counting) from Fulton and Elliott-Chelsea Houses residents who oppose the plan. That petition will soon be sent to NYCHA and city officials in order to stop the plan for Fulton and Elliott-Chelsea Houses from happening.  “Unbelievable Greed” Members of Save Section 9 and Residents to Preserve Public Housing were present alongside Lara as well as Celines Miranda and Renee Keitt of Elliott-Chelsea Houses. And so was Layla Law-Gisiko, who stepped down from Community Board 5 recently, and former Chelsea Reform Democratic Club president Luana Green, and a spokesperson for former New York City Councilor Charles Barron. In her speech, Keitt likened the FEC plan to “separate but equal,” a Jim Crow policy. Fulton Houses are in the heart of Chelsea. (Elvert Barnes/Flickr/CC BY-SA 2.0 DEED) “We are being subjected to Related Companies and their unbelievable greed,” Keitt said into the microphone. “Carver, East River, Thomas Jefferson, Dewitt-Clinton, and Frederick Douglass Houses have already been exploited for profit by Related Companies. We are next in line. We are being sold out in the name of profit and our community is being decimated.” Keitt said too that politicians who support the FEC plan “should be ashamed of themselves,” namely Mayor Adams and Councilor Erik Bottcher, who represents Chelsea.  Marquis Jenkins, founder of Residents to Preserve Public Housing, affirmed that the protest was about much more than just buildings. “Today we fight not just for bricks and mortar,” Jenkins declared. “We fight for rights and protections. Residents who came before us fought for the 964 rules and regulations. Those rules and regulations guaranteed residents a seat at the table.”  The 964 rules and regulations Jenkins alluded to endows public housing residents the right to self-management, a right they would lose under PACT/RAD. Jenkins also accused NYCHA of “interfering with resident leadership” to push the FEC plan through. “That is a Lie” “NYCHA has not been absolutely honest with you,” echoed former New York City Councilor Charles Barron’s spokesperson, “because this should have been a tenant-led development. That has not been the case. We know that the majority of tenants have come out against this plan.” The spokesperson also railed against the environmental pollution the FEC plan would create when he lambasted the proposed destruction of 350 trees. “We are not going to stand for this plan, because this plan is wrong,” Law-Gisiko said. “I’m sure you’ve heard that the city is pushing this narrative that increasing housing supply is the way we’re going to get out of the housing crisis. But that’s not true. You can’t build your way out of this crisis. The crisis is a crisis of affordability. And that’s why we need to keep housing affordable, and the gold standard of affordable housing is public housing.” Celines Miranda addressing the October 10 protest (Daniel Roche/AN) Law-Gisiko’s comments were in relation to City of Yes, Mayor Adams’s grand plan to add 500,000 new homes to New York in the next 10 years. Law-Gisiko continued that “public housing is the shield against displacement and gentrification.” She elaborated that tenants “have been deprived of the city and the federal government’s care” and the dire states of Fulton and Elliott-Chelsea Houses is NYCHA’s fault, not that of the residents.  “NYCHA’s claim that the only way to fix these buildings is with a wrecking ball is not acceptable,” Law-Gisiko said. “NYCHA and Related also say that these buildings are beyond repair. That is a lie. They also say that it’s cheaper to raise these buildings than repair them. That is also a lie.” Last March, at Center for Architecture, those in favor of the FEC plan driving it forward presented the project to a room full of architects. Jamar Adams, founder of Essence Development; Jonathan Gouveia, NYCHA’s vice president of real estate development; Ruchika Modi, principal at PAU; and Manish Chadha, principal at Ismael Leyva Architects (ILA) were present. Modi said that the proposed development would replace the current “towers in the park” at Fulton and Elliott-Chelsea Houses with perimeter block buildings that are more “integrated” into the neighborhood. Modi also said the development team would like to build a linear park between West 19th and 16th Streets as part of the project. After the gathering, Jamar Adams affirmed that the FEC plan is “resident led” and informed by “continued input from residents and the wider community.” Looking ahead, given the hot water Mayor Adams now finds himself in, residents and tenants activists who oppose the plan see an opportunity to help stop it. “Only a handful of developers are allowed to participate [in PACT/RAD],” Jenkins added at the October 10 protest. “Are they giving the mayor kickbacks so that they can have access to public housing?”",
  "image": "https://www.archpaper.com/wp-content/uploads/2024/10/IMG_5931.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003e\u003cspan\u003ePoliticians, public housing residents, and tenants rights activists gathered on the steps of \u003ca href=\"https://www.archpaper.com/tag/new-york-city/\"\u003eNew York City Hall\u003c/a\u003e this week amid calls for \u003ca href=\"https://www.archpaper.com/tag/eric-adams/\"\u003eMayor Eric Adams\u003c/a\u003e’s resignation. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThey were there on October 10 to \u003ca href=\"https://www.archpaper.com/tag/protests/\"\u003eprotest\u003c/a\u003e the \u003c/span\u003e\u003ca href=\"https://www.archpaper.com/2023/08/nycha-announces-plans-complete-rebuilding-fulton-and-elliott-chelsea-houses-manhattan-what-cost/\"\u003e\u003cspan\u003eprivatization and demolition\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e of three \u003ca href=\"https://www.archpaper.com/tag/nycha/\"\u003eNYCHA\u003c/a\u003e developments\u003c/span\u003e\u003cspan\u003e in the Manhattan neighborhood of Chelsea, Fulton Houses and Elliott-Chelsea Houses, where more than 5,000 people live in Section 9 \u003ca href=\"https://www.archpaper.com/tag/public-housing/\"\u003epublic housing\u003c/a\u003e. The Fulton Elliott-Chelsea (FEC) plan is by \u003ca href=\"https://www.archpaper.com/tag/related-companies/\"\u003eRelated\u003c/a\u003e, \u003ca href=\"https://www.essence-realty.com/\"\u003eEssence\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/tag/pau/\"\u003ePAU\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/tag/cookfox-architects/\"\u003eCOOKFOX\u003c/a\u003e, and \u003ca href=\"https://www.archpaper.com/tag/ismael-leyva-architects/\"\u003eILA\u003c/a\u003e, as \u003c/span\u003e\u003ca href=\"https://www.archpaper.com/2024/03/design-team-nycha-fulton-elliott-chelsea-plan/\"\u003e\u003cspan\u003ereported\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e by \u003c/span\u003e\u003ci\u003e\u003cspan\u003eAN\u003c/span\u003e\u003c/i\u003e\u003cspan\u003e.\u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e“I’ve been [in Fulton Houses] for 22 years, and this situation has made me beyond devastated,” said Jackie Lara, who staunchly opposes the FEC plan. “My home is being taken away from me. So the residents of our community firmly deny the proposed demolition of our homes which have multiple generations and families. I want my family to continue to be here.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLara added that she and other tenants have gathered 920 signatures (and counting) from Fulton and Elliott-Chelsea Houses residents who oppose the plan. That petition will soon be sent to NYCHA and city officials in order to stop the plan for Fulton and Elliott-Chelsea Houses from happening. \u003c/span\u003e\u003c/p\u003e\n\n\u003ch3\u003e“Unbelievable Greed”\u003c/h3\u003e\n\u003cp\u003e\u003cspan\u003eMembers of \u003c/span\u003e\u003ca href=\"https://www.savesection9.org/\"\u003e\u003cspan\u003eSave Section 9\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e and \u003c/span\u003e\u003ca href=\"https://actionnetwork.org/groups/residents-to-preserve-public-housing-rpph-2\"\u003e\u003cspan\u003eResidents to Preserve Public Housing\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e were present alongside Lara as well as Celines Miranda and Renee Keitt of Elliott-Chelsea Houses. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAnd so was Layla Law-Gisiko, who stepped down from Community Board 5 recently, and former Chelsea Reform Democratic Club president Luana Green, and a spokesperson for former New York City Councilor Charles Barron. In her speech, Keitt likened the FEC plan t\u003c/span\u003e\u003cspan\u003eo “separate but equal,” a Jim Crow policy.\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_372877\" aria-describedby=\"caption-attachment-372877\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k.jpg\" alt=\"Fulton Houses\" width=\"2000\" height=\"1333\" srcset=\"https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k.jpg 2000w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-550x367.jpg 550w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-1280x853.jpg 1280w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-1536x1024.jpg 1536w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-300x200.jpg 300w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-450x300.jpg 450w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-1200x800.jpg 1200w, https://www.archpaper.com/wp-content/uploads/2024/03/51311061822_5ef953ece6_k-1350x900.jpg 1350w\" sizes=\"(max-width: 2000px) 100vw, 2000px\"/\u003e\u003cfigcaption id=\"caption-attachment-372877\"\u003eFulton Houses are in the heart of Chelsea. (Elvert Barnes/\u003ca href=\"https://www.flickr.com/photos/perspective/51311061822/in/photolist-2mbaLZV-2mbb7mJ-2mbf1Pz-2mbgP9y-2mbf7ND-2mbfqzv-2mbfLgw-2mb5bUV-2mb8TeQ-2mb1nXv-2mbiQAo-2mbkMkn-2m9FsYP-2mbjtrh-2mb9kwe-2mb1o35-2mb5CNo-2m9FmNH-2mbaUM8-2mbkTUE-2mbfL19-2mbjHYj-2mbbB2G-2mbgsMw-2mbbQ17-2mbirYz-2mbjJ5X-2m9GQ9y-2mbjHS7-2m9xY3e-2m9GPZv-2mbkTGv-2mbij77-2mbf1ZQ-2m9CAB4-2m9xYiQ-2mbfDFL-2mb1eP6-2mb6vkH-2mb5tV8-2mb64UC-2mb1oe2-2mb64ue-2mbaBNG-2mbaBVW-2mb53Ky-2mb1eRF-2mb5t4y-2mbg3yB-2mb8Txa\"\u003eFlickr\u003c/a\u003e/\u003ca href=\"https://creativecommons.org/licenses/by-sa/2.0/\"\u003eCC BY-SA 2.0 DEED\u003c/a\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003e“We are being subjected to Related Companies and their unbelievable greed,” Keitt said into the microphone. “Carver, East River, Thomas Jefferson, Dewitt-Clinton, and Frederick Douglass Houses have already been exploited for profit by Related Companies. We are next in line. We are being sold out in the name of profit and our community is being decimated.” Keitt said too that politicians who support the FEC plan “should be ashamed of themselves,” namely Mayor Adams and Councilor Erik Bottcher, who represents Chelsea. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003eMarquis Jenkins, founder of Residents to Preserve Public Housing, affirmed that the protest was about much more than just buildings. “Today we fight not just for bricks and mortar,” Jenkins declared. “We fight for rights and protections. Residents who came before us fought for the \u003c/span\u003e\u003ca href=\"https://nychanow.nyc/training-to-strengthen-resident-engagement/#:~:text=Part%20964%20guidelines%20grant%20residents,funding%20for%20resident%20participation%20activities.\"\u003e\u003cspan\u003e964 rules and regulations\u003c/span\u003e\u003c/a\u003e\u003cspan\u003e. Those rules and regulations guaranteed residents a seat at the table.” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe 964 rules and regulations Jenkins alluded to endows public housing residents the right to self-management, a right they would lose under PACT/RAD. Jenkins also accused NYCHA of “interfering with resident leadership” to push the FEC plan through.\u003c/span\u003e\u003c/p\u003e\n\n\u003ch3\u003e“That is a Lie”\u003c/h3\u003e\n\u003cp\u003e\u003cspan\u003e“NYCHA has not been absolutely honest with you,” echoed former New York City Councilor Charles Barron’s spokesperson, “because this should have been a tenant-led development. That has not been the case. We know that the majority of tenants have come out against this plan.” The spokesperson also railed against the environmental pollution the FEC plan would create when he lambasted the proposed destruction of 350 trees.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“We are not going to stand for this plan, because this plan is wrong,” Law-Gisiko said. “I’m sure you’ve heard that the city is pushing this narrative that increasing housing supply is the way we’re going to get out of the \u003ca href=\"https://www.archpaper.com/tag/housing-crisis/\"\u003ehousing crisis\u003c/a\u003e. But that’s not true. You can’t build your way out of this crisis. The crisis is a crisis of affordability. And that’s why we need to keep housing affordable, and the gold standard of \u003ca href=\"https://www.archpaper.com/tag/affordable-housing/\"\u003eaffordable housing\u003c/a\u003e is public housing.”\u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_384079\" aria-describedby=\"caption-attachment-384079\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/IMG_5932.jpg\" alt=\"Celines Miranda speaking at protest over Fulton-Elliot \" width=\"1275\" height=\"1700\"/\u003e\u003cfigcaption id=\"caption-attachment-384079\"\u003eCelines Miranda addressing the October 10 protest (Daniel Roche/\u003cem\u003eAN\u003c/em\u003e)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003e\u003cspan\u003eLaw-Gisiko’s comments were in relation to City of Yes, Mayor Adams’s grand plan to add 500,000 new homes to New York in the next 10 years. Law-Gisiko continued that “public housing is the shield against displacement and gentrification.” She elaborated that tenants “have been deprived of the city and the federal government’s care” and the dire states of Fulton and Elliott-Chelsea Houses is NYCHA’s fault, not that of the residents. \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003cspan\u003e“NYCHA’s claim that the only way to fix these buildings is with a wrecking ball is not acceptable,” Law-Gisiko said. “NYCHA and Related also say that these buildings are beyond repair. That is a lie. They also say that it’s cheaper to raise these buildings than repair them. That is also a lie.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLast March, at Center for Architecture, those in favor of the FEC plan driving it forward presented the project to a room full of architects. Jamar Adams, founder of Essence Development; Jonathan Gouveia, NYCHA’s vice president of real estate development; Ruchika Modi, principal at PAU; and Manish Chadha, principal at Ismael Leyva Architects (ILA) were present.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eModi said that the proposed development would replace the current “towers in the park” at Fulton and Elliott-Chelsea Houses with perimeter block buildings that are more “integrated” into the neighborhood. Modi also said the development team would like to build a linear park between West 19th and 16th Streets as part of the project. After the gathering, Jamar Adams affirmed that the FEC plan is “resident led” and informed by “continued input from residents and the wider community.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLooking ahead, given the hot water Mayor Adams now finds himself in, residents and tenants activists who oppose the plan see an opportunity to help stop it. “Only a handful of developers are allowed to participate [in PACT/RAD],” Jenkins added at the October 10 protest. “Are they giving the mayor kickbacks so that they can have access to public housing?”\u003c/span\u003e\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-10-11T20:15:54Z",
  "modifiedTime": "2024-10-12T02:20:52Z"
}
