{
  "id": "1812ce6d-64f4-4779-8abe-f0455c101b3a",
  "title": "The 15 Biggest Scandals in Architecture History",
  "link": "https://www.architecturaldigest.com/story/biggest-scandals-in-architecture-history",
  "description": "From designs that caused an immediate uproar to multimillion-dollar lawsuits to the discovery of an architect’s secret family",
  "author": "Elizabeth Stamp",
  "published": "Wed, 25 Dec 2024 13:00:00 +0000",
  "source": "https://www.architecturaldigest.com/feed/rss",
  "categories": [
    "Architecture + Design",
    "Architecture + Design"
  ],
  "byline": "Elizabeth Stamp",
  "length": 11639,
  "excerpt": "From designs that caused an immediate uproar to multimillion-dollar lawsuits to the discovery of an architect’s secret family",
  "siteName": "Architectural Digest",
  "favicon": "",
  "text": "While scandal doesn’t hit architects quite as often as, say, politicians, the architecture profession is not immune from controversy, fraud, and even cold-blooded murder. The distinguished field has its share of bad actors who have made news with their professional or personal wrongdoings. In fact, one of the biggest scandals of the 20th century revolved around architect Stanford White, partner in the legendary firm McKim, Mead \u0026 White, which was responsible for some of New York’s famous Beaux Arts buildings. Read on to discover 15 scandals that had the architecture community—and the world—talking.15. DormzillaAn aerial view of the University of California’s Santa Barbara campus Photo: Nik Wheeler/Getty ImagesDorm life isn’t always luxe, but a proposed residence hall at the University of California at Santa Barbara drew fire for its lack of a essential amenity: natural light. In 2021, the university unveiled plans for a 12-story dorm, which would house 4,500 students in windowless single-occupancy rooms. The dorm was to be funded by the late billionaire Charles Munger, who designed the building with Van Tilburg, Banvard, \u0026 Soderbergh. The design sparked backlash from students and architectural critics alike, and prompted architect Dennis McFadden to resign from UCSB’s design review committee. The design was abandoned in 2023.14. Denise Scott Brown’s Pritzker SnubDenise Scott Brown was awarded the Soane Medal in 2018. Photo: Gary Gershoff/Getty ImagesAs a leading figure of postmodern architecture, it was no surprise when Robert Venturi won the Pritzker Prize in 1991. What was shocking, though, was that the committee didn’t give the honor to Denise Scott Brown, Venturi’s collaborator and wife, who had been a partner in their firm since 1969. While Venturi requested that Scott Brown be included, the Pritzker committee did not recognize her. In 2013, two graduate students at the Harvard University Graduate School of Design launched a petition asking the Pritzker Committee to correct the oversight and retroactively acknowledge Scott Brown, leading to a swell of press and support. The Pritzker Committee ultimately decided that it could not reopen the decision of a previous jury. Scott Brown was awarded the Soane Medal in 2018 and was honored alongside Venturi with the AIA Gold Medal 2016.13. Farnsworth House FeudView of architect Mies van der Rohe’s Farnsworth House in Plano, Illinois Photo: Carol M. Highsmith/Getty ImagesLudwig Mies van der Rohe’s Farnsworth House in Plano, Illinois, is an icon of the International Style of architecture, but its construction also sparked a legal battle. Dr. Edith Farnsworth commissioned the house and intended to spend $8,000 to 10,000 to build it, but the home ended up costing $74,000 (over $850,000 today). The architect sued to attain his fee and Farnsworth countersued alleging malpractice. The pair had an intense relationship and there were rumors of an affair early in the project. Van der Rohe won in court and the architect and his client eventually settled for $2,500 four years later.12. Ocean ParkwayOcean Parkway, on Long Island, shows the area where the murdered bodies of four young women were found in 2023. Investigators connected at least three of those bodies to suspected killer (and architect) Rex A. Heuermann. Photo: John Paraskevas/Getty ImagesFor decades, the identity of the person who was responsible for the murders of a number of women found on the beach near Giglo in Long Island remained a mystery to police and the true crime devotees who devoured documentaries and podcasts about the unsolved murders. In 2023, architect Rex Heuermann was arrested for the alleged murders of three women and was later charged with three additional murders, one of which dates back to 1993. A resident of Massapequa Park, Long Island, the architect was the owner of Manhattan-based RH Consultants \u0026 Associates, which worked on projects throughout New York City. Heuermann has pleaded not guilty and is currently being held without bail.11. The Poulson AffairArchitectural designer John Poulson arriving at court in 1973 Photo: Central Press/Hulton Archive/Getty ImagesBritish architect John Poulson caused an uproar in 1972 when it was revealed that he had been bribing public figures. He was arrested in 1973 on corruption charges, and his 52-day long trial cost 1.25 million British pounds. He was sentenced to five years in prison and later pled guilty to nine additional charges of corruption and conspiracy, which added two more years to his sentence. Two others were jailed and Home Secretary Reginald Maudling was forced to resign. Over 300 people were implicated in the affair.10. Eiffel Panama ScandalGustave Eiffel, French engineer and architect Photo: Getty ImagesAround the time Gustave Eiffel was building his iconic tower in Paris, he was also embroiled in a scandal across the Atlantic. Eiffel had been hired in 1887 to design the locks for the Panama Canal, but by 1889 the Panama Canal Company had gone bankrupt after mismanagement by its leader, Ferdinand de Lesseps. Eiffel and members of the company’s management were charged with raising money under false pretenses and misuse of funds. He was found guilty of the latter charge in 1893 and sentenced to two years in prison, but he was acquitted on appeal.9. Louis Kahn’s FamiliesThe Salk Institute, designed by Louis Kahn, in La Jolla, California Photo: Education Images/Citizens of the Planet/UIG via Getty ImagesArchitect Louis Kahn produced many iconic projects during his lifetime including the Yale University Art Gallery, the Salk Institute, and the Kimbell Art Museum. In 2003, his son Nathaniel Kahn released the documentary My Architect, which explored the personal life of Kahn, including the fact that he had three families. Kahn married his wife, Ester, in 1930, and they had a daughter, Sue Ann. He also had a daughter, Alexandra, with architect Anne Tyng, and a son, Nathanie, with landscape designer Harriet Pattison. The families knew about one another and lived a few miles apart, although the children did not meet until Kahn’s funeral.8. Murder at TaliesinFrank Lloyd Wright’s rebuilt Taliesin residence in Spring Green, Wisconsin Photo: Danita Delimont / Alamy Stock PhotoFrank Lloyd Wright’s personal life was almost as famous as his buildings. In 1909, Wright left his wife and children and ran off with Martha “Mamah” Cheney, a client’s wife. In 1911, they settled at Taliesin, a retreat he was building in Spring Green, Wisconsin. Several years later, Wright took a trip to Chicago, leaving Cheney and her visiting children behind. While he was gone, a houseman set fire to the building and then murdered them with an axe as they tried to flee. Wright later rebuilt Taliesin and lived there with his third wife.7. John Hancock TowerThe John Hancock Tower in Boston Photo: Paul Marotta/Getty ImagesBoston’s John Hancock Tower was plagued by controversy from the very beginning. Designed by Henry Cobb of the firm Pei Cobb Freed, the 60-story building faced initial opposition over concerns that it would cast a shadow on the historic Trinity Church. (The church later sued John Hancock Mutual Life Insurance for damage caused during construction of the tower.) But the real trouble started once the building was under construction. Glass window panes, each weighing 500 pounds, began to fall during high winds. The missing windows were temporarily replaced with plywood, earning the building the nickname Plywood Palace. All 10,344 windows were replaced. A tuned mass damper had to be installed when it was discovered that the building was swaying too much—causing motion sickness in the upper floors’ occupants. But perhaps the most shocking issue of all was Swiss engineer Bruno Thurlimann’s conclusion that, under certain rare wind conditions, the building could fall over. Five million dollars worth of steel braces were installed to ensure its structural integrity.6. Richard MeierArchitect Richard Meier Photo: Gonzalo Marroquin/Patrick McMullan via Getty ImagesIn the wake of the #MeToo and #TimesUp movements, the architecture industry was forced to reckon with its own history of gender inequality and sexual harassment in the workplace. In March of 2018, Richard Meier was accused of sexual harassment by five women, including four that worked for his firm. Meier took a leave of absence and later stepped down from his eponymous firm.5. Japanese Building ScandalTokyo’s skyline Photo: Getty ImagesIn 2006, a scandal erupted in Japan when it was discovered that the earthquake-resistance data had been fabricated during the construction of dozens of hotels and residential buildings. Architect Hidetsugu Aneha was found by the court to have falsified data since 1996. He was sentenced to six years in prison and fined 1.8 million yen. Several buildings have been torn down as a result of the scandal, and the country’s Architect Certification Law was revised.4. Operation Vandelay IndustriesThe buildings of Troy, New York Photo: Getty ImagesPaul J. Newman had a successful and award-winning career in architecture in Troy, New York. But there was one problem: He wasn’t a licensed architect. In 2017, then State Attorney General Eric Schneiderman indicted Newman on 58 counts, following a two-year investigation nicknamed Operation Vandelay Industries, a nod to George Costanza’s fake latex company on Seinfeld. Newman pled guilty to six counts and was sentenced to two and a half to seven years in prison.3. Henri Patrick DevillersThe Phnom Penh home of French architect Patrick Devillers Photo: TANG CHHIN SOTHY/AFP/GettyImagesFrench architect Henri Patrick Devillers became involved with an international scandal in 2012, when he was detained in Cambodia at the request of China for his ties to Chinese politician Bo Xilai and his wife, Gu Kailai. Devillers and British businessman Neil Heywood both served as fixers for Bo, and Heywood was found dead in a hotel room in China in 2011. Gu was charged with the murder and Devillers was a cooperating witness at the trial. Gu was found guilty and is serving a life sentence. The affair returned to the spotlight in 2016, when a real-estate transaction involving Gu, Heywood, and Devillers came to light during the leak of the Panama Papers.2. The CloudA rendering of The Cloud, at right, whose towers would resemble the collapsing buildings of New York’s World Trade Center Photo: Getty ImagesThere are plenty of designs that cause debate, but every so often there’s a design that causes an uproar. Back in 2011, Dutch architecture firm MVRDV unveiled the design for a pair of residential buildings called The Cloud in South Korea. The square towers were connected by a “pixelated cloud,” making the entire structure resemble the Twin Towers during the attacks of September 11. The firm apologized and the the complex still has not been built.1. The Crime of the CenturyHarry K. Thaw, taken when he was the center of the most sensational murder trial in New York’s history (left), and Stanford White, the famous architect Photo: Getty ImagesSix years into the 1900s there was already a murder so sensational it was dubbed the crime of the century. On June 25, 1906, architect Stanford White was murdered at the rooftop theater of Madison Square Garden by Harry K. Thaw, the husband of Evelyn Nesbit, model, actress, and chorus girl. White had sexually assaulted Nesbit when she was 15 or 16, and Thaw, a violent and mentally unstable man, had a long-standing grudge against him. The subsequent trial captivated the nation, and Thaw was eventually found not guilty on the grounds of insanity.",
  "image": "https://media.architecturaldigest.com/photos/5c48998682da5b2cd94a7f97/16:9/w_1280,c_limit/GettyImages-630679886.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eWhile scandal doesn’t hit architects quite as often as, say, politicians, the architecture profession is not immune from controversy, fraud, and even cold-blooded murder. The distinguished field has its share of bad actors who have made news with their professional or personal wrongdoings. In fact, one of the biggest scandals of the 20th century revolved around architect Stanford White, partner in the legendary firm McKim, Mead \u0026amp; White, which was responsible for some of New York’s famous Beaux Arts buildings. Read on to discover 15 scandals that had the architecture community—and the world—talking.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e15. Dormzilla\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAn aerial view of the University of California’s Santa Barbara campus\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Nik Wheeler/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eDorm life isn’t always luxe, but a proposed residence hall at the University of California at Santa Barbara drew fire for its lack of a essential amenity: natural light. In 2021, the university unveiled plans for a 12-story dorm, which would house 4,500 students in windowless single-occupancy rooms. The dorm was to be funded by the late billionaire Charles Munger, who designed the building with Van Tilburg, Banvard, \u0026amp; Soderbergh. The design sparked backlash from students and architectural critics alike, and prompted architect Dennis McFadden to resign from UCSB’s design review committee. The design was abandoned in 2023.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e14. Denise Scott Brown’s Pritzker Snub\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eDenise Scott Brown was awarded the Soane Medal in 2018.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Gary Gershoff/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eAs a leading figure of postmodern architecture, it was no surprise when Robert Venturi won the Pritzker Prize in 1991. What was shocking, though, was that the committee didn’t give the honor to Denise Scott Brown, Venturi’s collaborator and wife, who had been a partner in their firm since 1969. While Venturi requested that Scott Brown be included, the Pritzker committee did not recognize her. In 2013, two graduate students at the Harvard University Graduate School of Design launched a petition asking the Pritzker Committee to correct the oversight and retroactively acknowledge Scott Brown, leading to a swell of press and support. The Pritzker Committee ultimately decided that it could not reopen the decision of a previous jury. Scott Brown was awarded the Soane Medal in 2018 and was honored alongside Venturi with the AIA Gold Medal 2016.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e13. Farnsworth House Feud\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eView of architect Mies van der Rohe’s Farnsworth House in Plano, Illinois\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Carol M. Highsmith/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eLudwig Mies van der Rohe’s Farnsworth House in Plano, Illinois, is an icon of the International Style of architecture, but its construction also sparked a legal battle. Dr. Edith Farnsworth commissioned the house and intended to spend $8,000 to 10,000 to build it, but the home ended up costing $74,000 (over $850,000 today). The architect sued to attain his fee and Farnsworth countersued alleging malpractice. The pair had an intense relationship and there were rumors of an affair early in the project. Van der Rohe won in court and the architect and his client eventually settled for $2,500 four years later.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e12. Ocean Parkway\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eOcean Parkway, on Long Island, shows the area where the murdered bodies of four young women were found in 2023. Investigators connected at least three of those bodies to suspected killer (and architect) Rex A. Heuermann.\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: John Paraskevas/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFor decades, the identity of the person who was responsible for the murders of a number of women found on the beach near Giglo in Long Island remained a mystery to police and the true crime devotees who devoured documentaries and podcasts about the unsolved murders. In 2023, architect Rex Heuermann was arrested for the alleged murders of three women and was later charged with three additional murders, one of which dates back to 1993. A resident of Massapequa Park, Long Island, the architect was the owner of Manhattan-based RH Consultants \u0026amp; Associates, which worked on projects throughout New York City. Heuermann has pleaded not guilty and is currently being held without bail.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e11. The Poulson Affair\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eArchitectural designer John Poulson arriving at court in 1973\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Central Press/Hulton Archive/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eBritish architect John Poulson caused an uproar in 1972 when it was revealed that he had been bribing public figures. He was arrested in 1973 on corruption charges, and his 52-day long trial cost 1.25 million British pounds. He was sentenced to five years in prison and later pled guilty to nine additional charges of corruption and conspiracy, which added two more years to his sentence. Two others were jailed and Home Secretary Reginald Maudling was forced to resign. Over 300 people were implicated in the affair.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e10. Eiffel Panama Scandal\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eGustave Eiffel, French engineer and architect\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eAround the time Gustave Eiffel was building his iconic tower in Paris, he was also embroiled in a scandal across the Atlantic. Eiffel had been hired in 1887 to design the locks for the Panama Canal, but by 1889 the Panama Canal Company had gone bankrupt after mismanagement by its leader, Ferdinand de Lesseps. Eiffel and members of the company’s management were charged with raising money under false pretenses and misuse of funds. He was found guilty of the latter charge in 1893 and sentenced to two years in prison, but he was acquitted on appeal.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e9. Louis Kahn’s Families\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe Salk Institute, designed by Louis Kahn, in La Jolla, California\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Education Images/Citizens of the Planet/UIG via Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eArchitect Louis Kahn produced many iconic projects during his lifetime including the Yale University Art Gallery, the Salk Institute, and the Kimbell Art Museum. In 2003, his son Nathaniel Kahn released the documentary \u003cem\u003eMy Architect,\u003c/em\u003e which explored the personal life of Kahn, including the fact that he had three families. Kahn married his wife, Ester, in 1930, and they had a daughter, Sue Ann. He also had a daughter, Alexandra, with architect Anne Tyng, and a son, Nathanie, with landscape designer Harriet Pattison. The families knew about one another and lived a few miles apart, although the children did not meet until Kahn’s funeral.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e8. Murder at Taliesin\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eFrank Lloyd Wright’s rebuilt Taliesin residence in Spring Green, Wisconsin\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Danita Delimont / Alamy Stock Photo\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFrank Lloyd Wright’s personal life was almost as famous as his buildings. In 1909, Wright left his wife and children and ran off with Martha “Mamah” Cheney, a client’s wife. In 1911, they settled at Taliesin, a retreat he was building in Spring Green, Wisconsin. Several years later, Wright took a trip to Chicago, leaving Cheney and her visiting children behind. While he was gone, a houseman set fire to the building and then murdered them with an axe as they tried to flee. Wright later rebuilt Taliesin and lived there with his third wife.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e7. John Hancock Tower\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe John Hancock Tower in Boston\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Paul Marotta/Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eBoston’s John Hancock Tower was plagued by controversy from the very beginning. Designed by Henry Cobb of the firm Pei Cobb Freed, the 60-story building faced initial opposition over concerns that it would cast a shadow on the historic Trinity Church. (The church later sued John Hancock Mutual Life Insurance for damage caused during construction of the tower.) But the real trouble started once the building was under construction. Glass window panes, each weighing 500 pounds, began to fall during high winds. The missing windows were temporarily replaced with plywood, earning the building the nickname Plywood Palace. All 10,344 windows were replaced. A tuned mass damper had to be installed when it was discovered that the building was swaying too much—causing motion sickness in the upper floors’ occupants. But perhaps the most shocking issue of all was Swiss engineer Bruno Thurlimann’s conclusion that, under certain rare wind conditions, the building could fall over. Five million dollars worth of steel braces were installed to ensure its structural integrity.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e6. Richard Meier\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eArchitect Richard Meier\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Gonzalo Marroquin/Patrick McMullan via Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn the wake of the #MeToo and #TimesUp movements, the architecture industry was forced to reckon with its own history of gender inequality and sexual harassment in the workplace. In March of 2018, Richard Meier was accused of sexual harassment by five women, including four that worked for his firm. Meier took a leave of absence and later stepped down from his eponymous firm.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e5. Japanese Building Scandal\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTokyo’s skyline\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIn 2006, a scandal erupted in Japan when it was discovered that the earthquake-resistance data had been fabricated during the construction of dozens of hotels and residential buildings. Architect Hidetsugu Aneha was found by the court to have falsified data since 1996. He was sentenced to six years in prison and fined 1.8 million yen. Several buildings have been torn down as a result of the scandal, and the country’s Architect Certification Law was revised.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e4. Operation Vandelay Industries\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe buildings of Troy, New York\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003ePaul J. Newman had a successful and award-winning career in architecture in Troy, New York. But there was one problem: He wasn’t a licensed architect. In 2017, then State Attorney General Eric Schneiderman indicted Newman on 58 counts, following a two-year investigation nicknamed Operation Vandelay Industries, a nod to George Costanza’s fake latex company on \u003cem\u003eSeinfeld.\u003c/em\u003e Newman pled guilty to six counts and was sentenced to two and a half to seven years in prison.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e3. Henri Patrick Devillers\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe Phnom Penh home of French architect Patrick Devillers\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: TANG CHHIN SOTHY/AFP/GettyImages\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eFrench architect Henri Patrick Devillers became involved with an international scandal in 2012, when he was detained in Cambodia at the request of China for his ties to Chinese politician Bo Xilai and his wife, Gu Kailai. Devillers and British businessman Neil Heywood both served as fixers for Bo, and Heywood was found dead in a hotel room in China in 2011. Gu was charged with the murder and Devillers was a cooperating witness at the trial. Gu was found guilty and is serving a life sentence. The affair returned to the spotlight in 2016, when a real-estate transaction involving Gu, Heywood, and Devillers came to light during the leak of the Panama Papers.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e2. The Cloud\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA rendering of The Cloud, at right, whose towers would resemble the collapsing buildings of New York’s World Trade Center\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eThere are plenty of designs that cause debate, but every so often there’s a design that causes an uproar. Back in 2011, Dutch architecture firm MVRDV unveiled the design for a pair of residential buildings called The Cloud in South Korea. The square towers were connected by a “pixelated cloud,” making the entire structure resemble the Twin Towers during the attacks of September 11. The firm apologized and the the complex still has not been built.\u003c/p\u003e\u003ch2\u003e\u003cstrong\u003e1. The Crime of the Century\u003c/strong\u003e\u003c/h2\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eHarry K. Thaw, taken when he was the center of the most sensational murder trial in New York’s history (left), and Stanford White, the famous architect\u003c/p\u003e\n\u003c/span\u003e\u003cspan\u003ePhoto: Getty Images\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eSix years into the 1900s there was already a murder so sensational it was dubbed the crime of the century. On June 25, 1906, architect Stanford White was murdered at the rooftop theater of Madison Square Garden by Harry K. Thaw, the husband of Evelyn Nesbit, model, actress, and chorus girl. White had sexually assaulted Nesbit when she was 15 or 16, and Thaw, a violent and mentally unstable man, had a long-standing grudge against him. The subsequent trial captivated the nation, and Thaw was eventually found not guilty on the grounds of insanity.\u003c/p\u003e\u003cfigure\u003e\u003c/figure\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "13 min read",
  "publishedTime": "2019-01-23T12:32:27.374-05:00",
  "modifiedTime": "2024-12-25T13:00:00Z"
}
