{
  "id": "32b0a9f3-52cf-4b32-be22-83bd5c76da07",
  "title": "Klas Hyllén Architecture tops Malvern Pool House with skylight for stargazing",
  "link": "https://www.dezeen.com/2025/02/02/malvern-pool-house-klas-hyllen-architecture/",
  "description": "A \"cathedral-like\" timber ceiling shelters this pool house, which British studio Klas Hyllén Architecture has added to an existing Arts and Crafts-style home in Warwickshire. Malvern Pool House comprises two volumes – one containing a swimming pool and the other changing facilities, a meditation space and a wine cellar. They are connected to each other The post Klas Hyllén Architecture tops Malvern Pool House with skylight for stargazing appeared first on Dezeen.",
  "author": "Jon Astbury",
  "published": "Sun, 02 Feb 2025 11:00:37 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "England",
    "Bricks",
    "Swimming pools",
    "Pool houses",
    "Warwickshire",
    "Arts and Crafts",
    "UK"
  ],
  "byline": "Jon Astbury",
  "length": 6918,
  "excerpt": "A \"cathedral-like\" timber ceiling shelters this pool house, which British studio Klas Hyllén Architecture has added to an existing Arts and Crafts-style home in Warwickshire.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "A \"cathedral-like\" timber ceiling shelters this pool house, which British studio Klas Hyllén Architecture has added to an existing Arts and Crafts-style home in Warwickshire. Malvern Pool House comprises two volumes – one containing a swimming pool and the other changing facilities, a meditation space and a wine cellar. They are connected to each other and to the existing 1980s home by glazed links. Klas Hyllén Architecture has added a pool house to a 1980s home in WarwickshireThe volumes have curved edges and buff-brick exteriors, chosen to respect the original home and the surrounding landscape, while their interiors are pared-back and \"almost monastic\". Above the swimming pool, a diagrid ceiling of whitewashed timber – described by the studio as \"cathedral-like\" – is cut by a narrow skylight, intended for gazing at the sky and stars while laying in the water. Malvern Pool House has curved edges\"We wanted it to feel almost monastic, and inspiration came from quite austere spaces such as the Sankt Petri Church in Klippan, Sweden by Lewerentz or the Bishop Edward King Chapel by Niall McLaughlin,\" studio founder Klas Hyllén told Dezeen. \"It's about all the senses, acoustics, temperature, tactility and the smell of water on brick, which gives off this very pleasant mineral scent,\" he added. \"The most significant moment is probably floating on your back while taking in the exquisite timber. It's backstroke only here as you stargaze into the cosmos for a spot of night swimming.\" By casting Malvern Pool House's services directly into the structural walls themselves, the water can extend to the very edges of the interior, where a large panoramic window provides views over the landscape. The roof structure integrates an air handling system that maintains a temperature of around 29 degrees centigrade, while thick insulation in the roof and walls helps to mitigate heat loss. Its pool is crowned with a \"cathedral-like\" timber ceiling and skylight\"We met with six specialist pool contractors who all said we couldn't use the main structure as the pool walls – they all wanted us to build the pool 'within' the pool and have a void below the floor for services,\" Hyttén explained. \"It's thanks to the collaboration between the design team, the site manager and the no-compromise attitude of the client that we managed to achieve a pool which is entirely contained within the outer walls of the building itself,\" he added. A glazed bridge connects the pool to the ancillary facilities, which are partially lined in black timber, while a glazed corridor connects to the home itself. A large window provides views of the landscapeOriginally from Sweden, Klas Hyllén founded his eponymous studio in the UK in 2013. Elsewhere in the UK, Knox Bhavan recently completed a pool house for a home in Kent that is concealed beneath a grassy mound and Surman Weston created a pool house in the gardens of a home in Surrey. The photography is by Hyde Films. Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_1-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2157289\" data-article-id=\"2157289\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\n\n\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"Malvern Pool House by Klas Hyllén Architecture\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-hero_dezeen_2364_col_0-852x479.jpg\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eA \u0026#34;cathedral-like\u0026#34; timber ceiling shelters this \u003ca href=\"https://www.dezeen.com/tag/pool-houses/\"\u003epool house\u003c/a\u003e, which British studio Klas Hyllén Architecture has added to an existing Arts and Crafts-style \u003ca href=\"https://www.dezeen.com/tag/houses/\"\u003ehome\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/warwickshire/\"\u003eWarwickshire\u003c/a\u003e.\u003cspan id=\"more-2157289\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eMalvern Pool House comprises two volumes – one containing a \u003ca href=\"https://www.dezeen.com/tag/swimming-pools/\"\u003eswimming pool\u003c/a\u003e and the other changing facilities, a meditation space and a wine cellar. They are connected to each other and to the existing 1980s home by glazed links.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2166754\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_0-852x639.jpg\" alt=\"Overhead view of Malvern Pool House \" width=\"2364\" height=\"1773\" srcset=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_0-852x639.jpg 1x, https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_0-1704x1278.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_0-852x639.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2166754\"\u003eKlas Hyllén Architecture has added a pool house to a 1980s home in Warwickshire\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe volumes have curved edges and buff-brick exteriors, chosen to respect the original home and the surrounding landscape, while their interiors are pared-back and \u0026#34;almost monastic\u0026#34;.\u003c/p\u003e\n\u003cp\u003eAbove the swimming pool, a diagrid ceiling of whitewashed timber – described by the studio as \u0026#34;cathedral-like\u0026#34; – is cut by a narrow skylight, intended for gazing at the sky and stars while laying in the water.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2166757\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_3-852x568.jpg\" alt=\"Exterior view of Malvern Pool House by Klas Hyllén Architecture\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_3-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_3-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_3-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2166757\"\u003eMalvern Pool House has curved edges\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We wanted it to feel almost monastic, and inspiration came from quite austere spaces such as the Sankt Petri Church in Klippan, Sweden by Lewerentz or the Bishop Edward King Chapel by Niall McLaughlin,\u0026#34; studio founder Klas Hyllén told Dezeen.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;It\u0026#39;s about all the senses, acoustics, temperature, tactility and the smell of water on brick, which gives off this very pleasant mineral scent,\u0026#34; he added.\u003c/p\u003e\n\u003cp\u003e\u0026#34;The most significant moment is probably floating on your back while taking in the exquisite timber. It\u0026#39;s backstroke only here as you stargaze into the cosmos for a spot of night swimming.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eBy casting Malvern Pool House\u0026#39;s services directly into the structural walls themselves, the water can extend to the very edges of the interior, where a large panoramic window provides views over the landscape.\u003c/p\u003e\n\u003cp\u003eThe roof structure integrates an air handling system that maintains a temperature of around 29 degrees centigrade, while thick insulation in the roof and walls helps to mitigate heat loss.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2166762\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_8.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_8-852x568.jpg\" alt=\"Interior view of pool house by Klas Hyllén Architecture\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_8-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_8-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_8-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2166762\"\u003eIts pool is crowned with a \u0026#34;cathedral-like\u0026#34; timber ceiling and skylight\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;We met with six specialist pool contractors who all said we couldn\u0026#39;t use the main structure as the pool walls – they all wanted us to build the pool \u0026#39;within\u0026#39; the pool and have a void below the floor for services,\u0026#34; Hyttén explained.\u003c/p\u003e\n\u003cp\u003e\u0026#34;It\u0026#39;s thanks to the collaboration between the design team, the site manager and the no-compromise attitude of the client that we managed to achieve a pool which is entirely contained within the outer walls of the building itself,\u0026#34; he added.\u003c/p\u003e\n\u003cp\u003eA glazed bridge connects the pool to the ancillary facilities, which are partially lined in black timber, while a glazed corridor connects to the home itself.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2166763\" data-lightboximage=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_9.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_9-852x568.jpg\" alt=\"Swimming pool within home extension by Klas Hyllén Architecture\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_9-852x568.jpg 1x, https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_9-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\" data-cfsrc=\"https://static.dezeen.com/uploads/2025/01/klas-hyllen-architecture-malvern-pool-house-uk_dezeen_2364_col_9-852x568.jpg\"/\u003e\u003cfigcaption id=\"caption-attachment-2166763\"\u003eA large window provides views of the landscape\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eOriginally from Sweden, Klas Hyllén founded his eponymous studio in the UK in 2013.\u003c/p\u003e\n\u003cp\u003eElsewhere in the UK, \u003ca href=\"https://www.dezeen.com/2023/02/18/knox-bhavan-brick-pool-house-pembury-kent/\"\u003eKnox Bhavan recently completed a pool house for a home in Kent that is concealed beneath a grassy mound\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2023/02/07/surman-weston-geometric-pool-house-surrey/\"\u003eSurman Weston created a pool house in the gardens of a home in Surrey\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by Hyde Films.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#2b5b59425d4a48526b4f4e514e4e4505484446\"\u003e\u003cspan data-cfemail=\"0575776c7364667c4561607f60606b2b666a68\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-02-02T11:00:37Z",
  "modifiedTime": "2025-01-31T16:38:14Z"
}
