{
  "id": "53f87a24-fbac-4267-a209-90d055063cce",
  "title": "Feet First: 6 Pedestrian-First Projects Reclaiming the Right-of-Way",
  "link": "https://architizer.com/blog/inspiration/collections/feet-first-six-pedestrian-first-projects-reclaiming-the-right-of-way/",
  "description": "From gridlock to greenways, explore how city design is shifting from car-centric planning to people-powered space-making. The post Feet First: 6 Pedestrian-First Projects Reclaiming the Right-of-Way appeared first on Journal.",
  "author": "Eirini Makarouni",
  "published": "Thu, 01 May 2025 12:01:41 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Collections",
    "Inspiration"
  ],
  "byline": "Eirini Makarouni",
  "length": 6621,
  "excerpt": "From gridlock to greenways, city design is shifting from car-centric planning to pedestrian-first urbanism.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "Got a project that’s too wild for this world? Submit your conceptual works, images and ideas for global recognition and print publication in the 2025 Vision Awards, The Early Entry period is underway — start your entry today. Cars have been a thorn in architects’ and urban master planners’ sides for years. Apart from their many environmental disadvantages, these vehicles also require a tremendous amount of space and planning to operate efficiently. And yet, ever since cars were invented, cities have prioritized individual transportation and convenience over pedestrian-friendly setups. Fortunately, following the Covid-19 pandemic, a quiet revolution is gradually taking place, where cities turn to people-centric design, thus reshaping urban living. These six transformative initiatives reclaim space and improve the quality of life — oftentimes within vast urban metropoles. Taken together, these urban transformations illustrate that pedestrian-first urbanism is no longer a utopian idea, but rather a tangible, growing movement. By reclaiming car-dominated space, repurposing parking lots and shaded walkways, these designs prove that even the busiest urban cores can become livable, walkable, and inspiring places. The Urban Gallery at Hyperlane By ASPECT Studios, Chengdu, China The Hyperlane is a 1.5 mile (2.4 kilometer) multi-level linear sky park situated within Chengdu’s music and arts university district. The project acts as a replacement for a disused carpark and is comprised of an urban promenade, a “water carpet” landscape and a performance gallery. Specifically, the “water carpet” is made of shallow water ponds, playful urban seating, vegetation and impressive lighting displays that shape a performative urban “walk” along the district. Future additions to the project will be a performance gallery and a social terrace. Erie Street Plaza By Stoss Landscape Urbanism, Milwaukee, Wisconsin The project is located in the Historic Third Ward district of Milwaukee and is the final link in a series of public space activators along the riverwalk. The site used to be a large industrial parking lot, which after the project’s completion became a part of a larger three-mile pedestrian and bicycle street that connects the district with the city center. Programmatically, the plaza is conceived as a civic plane that has the potential to host art festivals, communal gatherings, concerts, farmer’s markets etc. This open-ended design encourages social interaction. Ample vegetation, discrete paving materials and carefully curated benches made of fiberglass populate the field. Urban design on both sides of Zhongxing Road in Shaoxing Ancient City By Tongji Architectural Design (Group), Shaoxing, China The ancient city of Shaoxing is comprised of many cultural monuments and is linked through the Zhongxing Road to the rest of the city. However, prior to the area’s regeneration , the central road-axis faced many functional challenges such as traffic congestion and a general disassociation within the ancient cityscape. The project’s main goal was to weaken ground traffic by separating the arrival and departure points in the area and creating a high-quality walking space. Functions such as the waterfront market, the port head and an old stage were reintroduced, integrating both ancient and modern activities to the site. Yibin Yangtze River Melody Commercial Street By Sichuan Provincial Architectural Design and Research Institute, Yibin, China The project is located in Xuzhou District at the confluence of three rivers. The site is a large commercial land that occupies approximately 1.3 acres (0.52 hectares) and is adjacent to both a business and residential area. The project’s aim is to build an ecological riverside leisure and fashion commercial street to meet the programmatic needs of the region as well as eliminate high-traffic roads and create a more people friendly experience. Pedestrians and vehicles are separated by integrating a road canopy greenway within the site and building an additional aerial corridor. Current elements found on site such as retaining walls and service rooms are preserved and turned into ramps and seating areas, becoming links in-between boardwalks and outdoor staircases. Finally, functional spaces such as a sports field and a playground are introduced. One Green Mile – Public Space and Streetscape Design By StudioPOD, Mumbai, India Jury Winner, Sustainable Transportation Project, 11th Annual A+Awards This project description begins with the following phrase: ‘in cities like Mumbai, finding synergies between mobility, infrastructure and open spaces is required to create livable urban environments.’ Consequently, the intent behind the One Green Mile was to develop a “complete street” within the city’s hectic financial hub that is both a vibrant public space and an efficient circulation space for city vehicles. The masterplan was comprised of three main strategies: (i) streamlining traffic movement and street geometry, (ii) efficiently allocate space for all users and (iii) develop the underused space below the flyover. Following a detailed traffic survey, the necessary modifications took place were footpaths and cycle routes were introduced, while the excess open space was planted with local tree species and populated with custom street furniture. Under-utilized pocket spaces under the flyover were turned into small plazas, play areas and an amphitheater. Shenzhen Yulong District Urban Design Competition By Aedas, Shenzhen, China The proposal placed a strong emphasis on the site’s ecological restoration, development and construction, suggesting a localized solution that conserves the utilizes different large spaces such as equipment rooms and parking spaces. A central green area connects the different spaces that are adjacent to the main water system, ensuring that water prevention systems are in effect. Smart and interactive infrastructure such as technology hubs, public spaces and social communities, Finally, both short-term and long-term traffic guidance systems and a new pedestrian bridge aim to control the disruptions caused by the urban expressway, while the scheme reconnects this urban gateway with the rest of the city. Got a project that’s too wild for this world? Submit your conceptual works, images and ideas for global recognition and print publication in the 2025 Vision Awards, The Early Entry period is underway — start your entry today. Featured Image: Yibin Yangtze River Melody Commercial Street by Sichuan Provincial Architectural Design and Research Institute, Yibin, China",
  "image": "https://blog.architizer.com/wp-content/uploads/The-Urban-Gallery-at-Hyperlane_01-1-1024x538.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003cem\u003eGot a project that’s too wild for this world? Submit your conceptual works, images and ideas for global recognition and print publication in the \u003cstrong\u003e\u003ca href=\"https://info.architizer.com/vision-awards?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003e2025 Vision Awards\u003c/a\u003e\u003c/strong\u003e, The\u003ci\u003e \u003cstrong\u003eEarly Entry\u003c/strong\u003e period is underway — \u003ca href=\"https://visionawards.architizer.com/a/organizations/main/submissions/submissionnotcompleted?solicitationId=24\u0026amp;utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003estart your entry today\u003c/a\u003e\u003c/i\u003e\u003cspan\u003e\u003ci\u003e.\u003c/i\u003e\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eCars have been a thorn in architects’ and urban master planners’ sides for years. Apart from their many environmental disadvantages, these vehicles also require a tremendous amount of space and planning to operate efficiently. And yet, ever since cars were invented, cities have prioritized individual transportation and convenience over pedestrian-friendly setups.\u003c/p\u003e\n\u003cp\u003eFortunately, following the Covid-19 pandemic, a quiet revolution is gradually taking place, where cities turn to people-centric design, thus reshaping urban living. These six transformative initiatives reclaim space and improve the quality of life — oftentimes within vast urban metropoles. Taken together, these urban transformations illustrate that pedestrian-first urbanism is no longer a utopian idea, but rather a tangible, growing movement. By reclaiming car-dominated space, repurposing parking lots and shaded walkways, these designs prove that even the busiest urban cores can become livable, walkable, and inspiring places.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/the-urban-gallery-at-hyperlane/\" target=\"_blank\" rel=\"noopener\"\u003eThe Urban Gallery at Hyperlane\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/aspect-studios/\" target=\"_blank\" rel=\"noopener\"\u003eASPECT Studios\u003c/a\u003e, Chengdu, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/The-Urban-Gallery-at-Hyperlane_02.jpg\" alt=\"The Urban Gallery at Hyperlane_02-architizer\" width=\"2000\" height=\"1333\"/\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1.jpg\" alt=\"\" width=\"2000\" height=\"1333\" srcset=\"https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1.jpg 2000w, https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1-300x200.jpg 300w, https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1-1024x682.jpg 1024w, https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1-768x512.jpg 768w, https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1-1536x1024.jpg 1536w, https://blog.architizer.com/wp-content/uploads/1652311775417Hyperlane_Chengdu_Photo_by_Lubing_22-1-400x267.jpg 400w\" sizes=\"(max-width: 2000px) 100vw, 2000px\"/\u003eThe Hyperlane is a 1.5 mile (2.4 kilometer) multi-level linear sky park situated within Chengdu’s music and arts university district. The project acts as a replacement for a disused carpark and is comprised of an urban promenade, a “water carpet” landscape and a performance gallery. Specifically, the “water carpet” is made of shallow water ponds, playful urban seating, vegetation and impressive lighting displays that shape a performative urban “walk” along the district. Future additions to the project will be a performance gallery and a social terrace.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/erie-street-plaza/\" target=\"_blank\" rel=\"noopener\"\u003eErie Street Plaza\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/stoss-landscape-urbanism/\" target=\"_blank\" rel=\"noopener\"\u003eStoss Landscape Urbanism\u003c/a\u003e, Milwaukee, Wisconsin\u003c/h4\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Erie-Street-Plaza_01-scaled.jpg\" alt=\"Erie Street Plaza_01-architizer\" width=\"2560\" height=\"1706\"/\u003e \u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Erie-Street-Plaza_02-scaled.jpg\" alt=\"Erie Street Plaza_02-architizer\" width=\"2560\" height=\"1707\"/\u003eThe project is located in the Historic Third Ward district of Milwaukee and is the final link in a series of public space activators along the riverwalk. The site used to be a large industrial parking lot, which after the project’s completion became a part of a larger three-mile pedestrian and bicycle street that connects the district with the city center.\u003c/p\u003e\n\u003cp\u003eProgrammatically, the plaza is conceived as a civic plane that has the potential to host art festivals, communal gatherings, concerts, farmer’s markets etc. This open-ended design encourages social interaction. Ample vegetation, discrete paving materials and carefully curated benches made of fiberglass populate the field.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/urban-design-on-both-sides-of-zhongxing-road-in-shaoxing-ancient-city-1/\" target=\"_blank\" rel=\"noopener\"\u003eUrban design on both sides of Zhongxing Road in Shaoxing Ancient City\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/tongji-architectural-design-group-co-ltd-1/\" target=\"_blank\" rel=\"noopener\"\u003eTongji Architectural Design (Group)\u003c/a\u003e, Shaoxing, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Urban-design-on-both-sides-of-Zhongxing-Road-in-Shaoxing-Ancient-City_01-scaled.jpg\" alt=\"Urban design on both sides of Zhongxing Road in Shaoxing Ancient City_01-architizer\" width=\"2560\" height=\"1408\"/\u003e \u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Urban-design-on-both-sides-of-Zhongxing-Road-in-Shaoxing-Ancient-City_02-scaled.jpg\" alt=\"Urban design on both sides of Zhongxing Road in Shaoxing Ancient City_02-architizer\" width=\"2560\" height=\"1600\"/\u003eThe ancient city of Shaoxing is comprised of many cultural monuments and is linked through the Zhongxing Road to the rest of the city. However, prior to the area’s regeneration , the central road-axis faced many functional challenges such as traffic congestion and a general disassociation within the ancient cityscape. The project’s main goal was to weaken ground traffic by separating the arrival and departure points in the area and creating a high-quality walking space. Functions such as the waterfront market, the port head and an old stage were reintroduced, integrating both ancient and modern activities to the site.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/yibin-yangtze-river-melody-commercial-street/\" target=\"_blank\" rel=\"noopener\"\u003eYibin Yangtze River Melody Commercial Street\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/sichuan-provincial-architectural-design-and-research-institute-co-ltd/\" target=\"_blank\" rel=\"noopener\"\u003eSichuan Provincial Architectural Design and Research Institute\u003c/a\u003e, Yibin, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Yibin-Yangtze-River-Melody-Commercial-Street_01-scaled.jpg\" alt=\"Yibin-Yangtze-River-Melody-Commercial-Street_01-architizer\" width=\"2560\" height=\"1440\"/\u003e \u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Yibin-Yangtze-River-Melody-Commercial-Street_02.jpg\" alt=\"Yibin-Yangtze-River-Melody-Commercial-Street_02-architizer\" width=\"8000\" height=\"8000\"/\u003eThe project is located in Xuzhou District at the confluence of three rivers. The site is a large commercial land that occupies approximately 1.3 acres (0.52 hectares) and is adjacent to both a business and residential area. The project’s aim is to build an ecological riverside leisure and fashion commercial street to meet the programmatic needs of the region as well as eliminate high-traffic roads and create a more people friendly experience.\u003c/p\u003e\n\u003cp\u003ePedestrians and vehicles are separated by integrating a road canopy greenway within the site and building an additional aerial corridor. Current elements found on site such as retaining walls and service rooms are preserved and turned into ramps and seating areas, becoming links in-between boardwalks and outdoor staircases. Finally, functional spaces such as a sports field and a playground are introduced.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/one-green-mile-public-space-and-streetscape-design/\" target=\"_blank\" rel=\"noopener\"\u003eOne Green Mile – Public Space and Streetscape Design\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/studiopod-inc/\" target=\"_blank\" rel=\"noopener\"\u003eStudioPOD\u003c/a\u003e, Mumbai, India\u003c/h4\u003e\n\u003ch5\u003eJury Winner, Sustainable Transportation Project, 11th Annual A+Awards\u003c/h5\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/One-Green-Mile-Public-Space-and-Streetscape-Design_01.jpg\" alt=\"One Green Mile - Public Space and Streetscape Design_01-architizer\" width=\"2198\" height=\"1465\"/\u003e \u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/One-Green-Mile-Public-Space-and-Streetscape-Design_02.jpg\" alt=\"One Green Mile - Public Space and Streetscape Design_02-architizer\" width=\"1500\" height=\"2250\"/\u003eThis project description begins with the following phrase: ‘in cities like Mumbai, finding synergies between mobility, infrastructure and open spaces is required to create livable urban environments.’ Consequently, the intent behind the One Green Mile was to develop a “complete street” within the city’s hectic financial hub that is both a vibrant public space and an efficient circulation space for city vehicles.\u003c/p\u003e\n\u003cp\u003eThe masterplan was comprised of three main strategies: (i) streamlining traffic movement and street geometry, (ii) efficiently allocate space for all users and (iii) develop the underused space below the flyover. Following a detailed traffic survey, the necessary modifications took place were footpaths and cycle routes were introduced, while the excess open space was planted with local tree species and populated with custom street furniture. Under-utilized pocket spaces under the flyover were turned into small plazas, play areas and an amphitheater.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/aedas-consortium-wins-the-shenzhen-yulong-district-urban-design-competition/\" target=\"_blank\" rel=\"noopener\"\u003eShenzhen Yulong District Urban Design Competition\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/aedas/\" target=\"_blank\" rel=\"noopener\"\u003eAedas\u003c/a\u003e, Shenzhen, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Shenzhen-Yulong-District-Urban-Design-Competition_01.jpg\" alt=\"Shenzhen Yulong District Urban Design Competition_01-architizer\" width=\"2000\" height=\"1125\"/\u003eThe proposal placed a strong emphasis on the site’s ecological restoration, development and construction, suggesting a localized solution that conserves the utilizes different large spaces such as equipment rooms and parking spaces. A central green area connects the different spaces that are adjacent to the main water system, ensuring that water prevention systems are in effect. Smart and interactive infrastructure such as technology hubs, public spaces and social communities, Finally, both short-term and long-term traffic guidance systems and a new pedestrian bridge aim to control the disruptions caused by the urban expressway, while the scheme reconnects this urban gateway with the rest of the city.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eGot a project that’s too wild for this world? Submit your conceptual works, images and ideas for global recognition and print publication in the \u003cstrong\u003e\u003ca href=\"https://info.architizer.com/vision-awards?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003e2025 Vision Awards\u003c/a\u003e\u003c/strong\u003e, The\u003ci\u003e \u003cstrong\u003eEarly Entry\u003c/strong\u003e period is underway — \u003ca href=\"https://visionawards.architizer.com/a/organizations/main/submissions/submissionnotcompleted?solicitationId=24\u0026amp;utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003estart your entry today\u003c/a\u003e\u003c/i\u003e\u003cspan\u003e\u003ci\u003e.\u003c/i\u003e\u003c/span\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFeatured Image: \u003ca href=\"https://architizer.com/projects/yibin-yangtze-river-melody-commercial-street/\" target=\"_blank\" rel=\"noopener\"\u003eYibin Yangtze River Melody Commercial Street\u003c/a\u003e by \u003ca href=\"https://architizer.com/firms/sichuan-provincial-architectural-design-and-research-institute-co-ltd/\" target=\"_blank\" rel=\"noopener\"\u003eSichuan Provincial Architectural Design and Research Institute\u003c/a\u003e, Yibin, China\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-01T12:01:41Z",
  "modifiedTime": "2025-04-30T11:31:01Z"
}
