{
  "id": "54852abc-0d73-4fab-a1d1-b6fc8e58420b",
  "title": "Daniel Libeskind Joins the Vision Awards Jury, Bringing Emotive Design to the Fore",
  "link": "https://architizer.com/blog/inspiration/industry/vision-awards-jury-daniel-libeskind/",
  "description": "\"Creating architecture is like a performance. It’s beautiful at every stage.” The post Daniel Libeskind Joins the Vision Awards Jury, Bringing Emotive Design to the Fore appeared first on Journal.",
  "author": "Architizer Editors",
  "published": "Tue, 20 May 2025 15:01:22 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Industry",
    "Inspiration",
    "Awards",
    "Vision Awards"
  ],
  "byline": "Architizer Editors",
  "length": 4428,
  "excerpt": "Architizer is excited to announce that acclaimed architect Daniel Libeskind has joined the jury for the 2025 Vision Awards! Libeskind will bring his expertise in visual storytelling, conceptual clarity and emotional impact to the panel, inviting entrants to \"pursue the profound\" with their submissions.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "Architizer is excited to announce that Daniel Libeskind, one of the most visionary figures in global architecture, has joined the jury for the 2025 Vision Awards. Known for his emotive, idea-driven architecture and deeply symbolic design language, Libeskind’s presence brings immense creative weight to a program that celebrates the most powerful architectural images and concepts shaping the future of the built environment. Libeskind will review entries submitted in an expanded Vision Awards program, which invites architects, designers, photographers, videographers, rendering artists, model makers and students to enter their work for global recognition and publication in print. The Main Entry Deadline is June 6th, 2025, so get started on your entry today: Enter the Vision Awards Over the course of his storied career, Libeskind has built a portfolio that transcends typology and geography. His seminal project, the Jewish Museum Berlin, redefined the relationship between architecture and memory, setting a new standard for how buildings can engage with history and human experience. Since then, he has completed groundbreaking cultural landmarks around the world — from the Imperial War Museum North in Manchester, to the Denver Art Museum, to the Military History Museum in Dresden — each one a testament to his ability to turn abstract concepts into built form. In 2003, Libeskind was selected to design the master plan for the rebuilding of the World Trade Center in Lower Manhattan, a project that required not only architectural vision, but deep emotional sensitivity. His design emphasized resilience, remembrance, and rebirth — values that continue to define his work today. Studio Libeskind also has notable conceptual or planned projects that form powerful cases studies in architectural ideation, including the Kurdistan Museum, designed as “the first major center in the Kurdistan Region for the history and culture of the Kurdish people.” Start My Entry This lifelong pursuit of the profound makes Libeskind is an ideal fit to judge the Vision Awards. A passionate advocate for architectural representation as a creative act, Libeskind’s design process is rooted in drawing, sketching, and conceptual storytelling. “My mother told me if I were an artist, I’d be so poor I wouldn’t even be able to afford a pencil,” said Libeskind in conversation with Architizer at his studio in Lower Manhattan. “‘You should become an architect,’ she said, ‘because you can always be an artist in architecture.’” As a juror for the 2025 Vision Awards, Libeskind will bring a critical eye to 50+ award categories that explore visual storytelling, conceptual clarity, and emotional impact — from architectural drawings and models to unbuilt projects that speculate on the future of cities, culture, and the human condition. Enter the Vision Awards Joining Libeskind on the 2025 Vision Awards jury is a distinguished panel of professionals from various disciplines, including: Steven Holl, Founding Principal, Steven Holl Architects. Winka Dubbeldam, Founding Principal, Archi-Tectonics and Director \u0026 CEO, SCI-Arc. Sanjay Puri, Founding Principal, Sanjay Puri Architects. Suchi Reddy, Founding Principal, ReddyMade. Arjun Desai and Katherine Chia, Founding Principals, Desai Chia Architecture. This multidisciplinary jury reflects the Vision Awards’ commitment to honoring a broad spectrum of architectural creativity and innovation. View the complete Vision Awards jury here. Start My Entry “I remember when there were all these people in the studio, like draftsmen, doing chores,” Libeskind recalled in his interview with Architizer. “Now, creating architecture is like a performance. It’s beautiful at every stage.” It is these ‘stages’ that will be given the spotlight in the Vision Awards, as the art of creative iteration — whether through drawing, rendering, model making, video or photography — is celebrated on a global stage. Libeskind’s presence underscores the Vision Awards’ mission to elevate not only how architecture is built, but how it is imagined, represented, and shared. With his guidance, this year’s jury will recognize submissions that embody bold thinking, narrative depth, and artistic rigor. Enter the 2025 Vision Awards today for the opportunity to have your work seen by Daniel Libeskind and other global design leaders. The Main Entry Deadline is June 6th, 2025. Start Submission",
  "image": "https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-scaled.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp data-start=\"115\" data-end=\"546\"\u003eArchitizer is excited to announce that \u003cstrong data-start=\"152\" data-end=\"172\"\u003eDaniel Libeskind\u003c/strong\u003e, one of the most visionary figures in global architecture, has joined the jury for the \u003ca href=\"https://info.architizer.com/vision-awards?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e\u003cstrong data-start=\"260\" data-end=\"282\"\u003e2025 Vision Awards\u003c/strong\u003e\u003c/a\u003e. Known for his emotive, idea-driven architecture and deeply symbolic design language, Libeskind’s presence brings immense creative weight to a program that celebrates the most powerful architectural images and concepts shaping the future of the built environment.\u003c/p\u003e\n\u003cp data-start=\"111\" data-end=\"434\"\u003eLibeskind will review entries submitted in an expanded \u003cstrong\u003eVision Awards\u003c/strong\u003e program, which invites architects, designers, photographers, videographers, rendering artists, model makers and students to enter their work for global recognition and publication in print. The Main Entry Deadline is \u003cstrong\u003eJune 6th, 2025\u003c/strong\u003e, so get started on your entry today:\u003c/p\u003e\n\u003cp data-start=\"111\" data-end=\"434\"\u003e\u003ca href=\"https://visionawards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eEnter the Vision Awards\u003c/a\u003e\u003c/p\u003e\n\u003cp data-start=\"548\" data-end=\"1145\"\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-1024x536.jpg\" alt=\"Daniel Libeskind Joins the Architizer Vision Awards Jury.\" width=\"1024\" height=\"536\" srcset=\"https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-1024x536.jpg 1024w, https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-300x157.jpg 300w, https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-768x402.jpg 768w, https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-1536x804.jpg 1536w, https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-2048x1073.jpg 2048w, https://blog.architizer.com/wp-content/uploads/New-Juror-Announcement-Hero_Daniel-Libeskind-400x209.jpg 400w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"/\u003eOver the course of his storied career, Libeskind has built a portfolio that transcends typology and geography. His seminal project, the \u003cstrong data-start=\"684\" data-end=\"708\"\u003eJewish Museum Berlin\u003c/strong\u003e, redefined the relationship between architecture and memory, setting a new standard for how buildings can engage with history and human experience. Since then, he has completed groundbreaking cultural landmarks around the world — from the \u003cstrong data-start=\"946\" data-end=\"989\"\u003eImperial War Museum North in Manchester\u003c/strong\u003e, to the \u003cstrong data-start=\"998\" data-end=\"1019\"\u003eDenver Art Museum\u003c/strong\u003e, to the \u003cstrong data-start=\"1028\" data-end=\"1066\"\u003eMilitary History Museum in Dresden \u003c/strong\u003e— each one a testament to his ability to turn abstract concepts into built form.\u003c/p\u003e\n\u003cp data-start=\"1147\" data-end=\"1466\"\u003eIn 2003, Libeskind was selected to design the master plan for the rebuilding of the\u003cstrong data-start=\"1193\" data-end=\"1253\"\u003e World Trade Center\u003c/strong\u003e in Lower Manhattan, a project that required not only architectural vision, but deep emotional sensitivity. His design emphasized resilience, remembrance, and rebirth — values that continue to define his work today. Studio Libeskind also has notable conceptual or planned projects that form powerful cases studies in architectural ideation, including the \u003cstrong\u003eKurdistan Museum\u003c/strong\u003e, designed as “the first major center in the Kurdistan Region for the history and culture of the Kurdish people.”\u003c/p\u003e\n\u003cp data-start=\"1147\" data-end=\"1466\"\u003e\u003ca href=\"https://visionawards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eStart My Entry\u003c/a\u003e\u003c/p\u003e\n\n\u003cp data-start=\"1468\" data-end=\"1959\"\u003eThis lifelong pursuit of the profound makes Libeskind is an ideal fit to judge the Vision Awards. A passionate advocate for architectural representation as a creative act, Libeskind’s design process is rooted in drawing, sketching, and conceptual storytelling.\u003c/p\u003e\n\u003cp data-start=\"1468\" data-end=\"1959\"\u003e“My mother told me if I were an artist, I’d be so poor I wouldn’t even be able to afford a pencil,” said Libeskind in conversation with Architizer at his studio in Lower Manhattan. “‘You should become an architect,’ she said, ‘because you can always be an artist in architecture.’”\u003c/p\u003e\n\u003cp data-start=\"1468\" data-end=\"1959\"\u003eAs a juror for the 2025 Vision Awards, Libeskind will bring a critical eye to \u003ca href=\"https://visionawards.architizer.com/a/page/categories?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e50+ award categories\u003c/a\u003e that explore \u003cstrong data-start=\"2063\" data-end=\"2128\"\u003evisual storytelling, conceptual clarity, and emotional impact \u003c/strong\u003e— from architectural drawings and models to unbuilt projects that speculate on the future of cities, culture, and the human condition.\u003c/p\u003e\n\u003cp data-start=\"1468\" data-end=\"1959\"\u003e\u003ca href=\"https://visionawards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eEnter the Vision Awards\u003c/a\u003e\u003c/p\u003e\n\n\u003cp data-start=\"2596\" data-end=\"2718\"\u003eJoining Libeskind on the 2025 Vision Awards jury is a distinguished panel of professionals from various disciplines, including:\u003c/p\u003e\n\u003cul data-start=\"2720\" data-end=\"3318\"\u003e\n\u003cli data-start=\"2720\" data-end=\"2828\"\u003e\n\u003cp data-start=\"2722\" data-end=\"2828\"\u003e\u003cstrong data-start=\"2722\" data-end=\"2741\"\u003eSteven Holl\u003c/strong\u003e, Founding Principal, Steven Holl Architects.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli data-start=\"2829\" data-end=\"2949\"\u003e\n\u003cp data-start=\"2831\" data-end=\"2949\"\u003e\u003cstrong data-start=\"2831\" data-end=\"2844\"\u003eWinka Dubbeldam\u003c/strong\u003e, Founding Principal, Archi-Tectonics and Director \u0026amp; CEO, SCI-Arc.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli data-start=\"2950\" data-end=\"3061\"\u003e\n\u003cp data-start=\"2952\" data-end=\"3061\"\u003e\u003cstrong data-start=\"2952\" data-end=\"2970\"\u003eSanjay Puri\u003c/strong\u003e, Founding Principal, Sanjay Puri Architects.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli data-start=\"3062\" data-end=\"3183\"\u003e\n\u003cp data-start=\"3064\" data-end=\"3183\"\u003e\u003cb\u003eSuchi Reddy\u003c/b\u003e, Founding Principal, ReddyMade.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli data-start=\"3184\" data-end=\"3318\"\u003e\n\u003cp data-start=\"3186\" data-end=\"3318\"\u003e\u003cstrong data-start=\"3186\" data-end=\"3220\"\u003eArjun Desai and Katherine Chia\u003c/strong\u003e, Founding Principals, Desai Chia Architecture.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp data-start=\"3320\" data-end=\"3459\"\u003eThis multidisciplinary jury reflects the Vision Awards’ commitment to honoring a broad spectrum of architectural creativity and innovation. View the complete Vision Awards jury \u003ca href=\"https://visionawards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003ehere.\u003c/a\u003e\u003c/p\u003e\n\u003cp data-start=\"3320\" data-end=\"3459\"\u003e\u003ca href=\"https://visionawards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eStart My Entry\u003c/a\u003e\u003c/p\u003e\n\n\u003cp data-start=\"1961\" data-end=\"2452\"\u003e“I remember when there were all these people in the studio, like draftsmen, doing chores,” Libeskind recalled in his interview with Architizer. “Now, creating architecture is like a performance. It’s beautiful at every stage.”\u003c/p\u003e\n\u003cp data-start=\"1961\" data-end=\"2452\"\u003eIt is these ‘stages’ that will be given the spotlight in the Vision Awards, as the art of creative iteration — whether through drawing, rendering, model making, video or photography — is celebrated on a global stage.\u003c/p\u003e\n\u003cp data-start=\"2454\" data-end=\"2728\"\u003eLibeskind’s presence underscores the Vision Awards’ mission to elevate not only how architecture is built, but how it is imagined, represented, and shared. With his guidance, this year’s jury will recognize submissions that embody bold thinking, narrative depth, and artistic rigor.\u003c/p\u003e\n\u003cp data-start=\"2454\" data-end=\"2728\"\u003e\u003cstrong data-start=\"2735\" data-end=\"2912\"\u003eEnter the 2025 Vision Awards today for the opportunity to have your work seen by Daniel Libeskind and other global design leaders. The Main Entry Deadline is June 6th, 2025.\u003c/strong\u003e\u003c/p\u003e\n\u003cp data-start=\"2735\" data-end=\"3025\"\u003e\u003ca href=\"https://www.architizerproductawards.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003eStart Submission\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-20T15:01:22Z",
  "modifiedTime": "2025-05-19T17:03:48Z"
}
