{
  "id": "732d8fc0-f309-45b6-bd1a-7a23f0a238f9",
  "title": "Architecture historian Joseph Rykwert dies at 98",
  "link": "https://www.archpaper.com/2024/10/architecture-historian-joseph-rykwert-dies/",
  "description": "Joseph Rykwert, a prolific architecture historian, critic, and professor, died on October 18 at age 98. The Architect’s Journal remembered Rykwert as being “gloriously erudite.” The late intellectual is just The post Architecture historian Joseph Rykwert dies at 98 appeared first on The Architect’s Newspaper.",
  "author": "Daniel Jonas Roche",
  "published": "Mon, 21 Oct 2024 20:42:59 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Architecture",
    "Education",
    "International",
    "News",
    "Obituary",
    "Architectural Criticism",
    "Architectural History"
  ],
  "byline": "Daniel Jonas Roche",
  "length": 2866,
  "excerpt": "Joseph Rykwert, a prolific architecture historian, critic, and professor, died on October 18 at age 98. Rykwert wrote several books and had a long career at the University of Pennsylvania.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "1926–2024 Joseph Rykwert, a prolific architecture historian, critic, and professor, died on October 18 at age 98. The Architect’s Journal remembered Rykwert as being “gloriously erudite.” The late intellectual is just one of four architecture critics to have won a RIBA Gold Medal since the prestigious accolade’s creation in 1848. (The others were Nikolaus Pevsner in 1967, John Summerson in 1976, and Colin Rowe in 1995.) Rykwert spent much of his career as Paul Philippe Cret Professor Emeritus of Architecture at the University of Pennsylvania. Rykwert published a number of texts that have been translated into several languages. The Idea of a Town (1963), On Adam’s House in Paradise (1972), The First Moderns (1980), The Dancing Column (1996), and The Seduction of Place (2000) are just a few of his works. In 1926, Rykwert was born in Warsaw, Poland, but moved to the U.K. in 1939 on the heels of World War II. He studied at the Architectural Association and Bartlett School of Architecture, and earned his PhD from the Royal College of Art in 1967. He started teaching at Penn in 1988. Decades later, in 2012, Rykwert published an important essay titled Does Architecture Criticism Matter? In it, he outlined the architecture critic’s precarious position in the age of starchitecture. “Criticism may seem irrelevant to any talk about buildings at this high point of starchitecture,” Rykwert said. “Criticising starchitects may be like making disparaging comments at a pop concert, however, unlike starchitecture, pop music does seem to have bred a culture of shrewd critics though their words, however sharp, seem unable to pierce even the most inflated bubble reputations.” Rykwert continued: “I have always believed that the critic must be a fighter. To do so they must have a base from which to operate, not only the obvious one of a newspaper, periodical, radio or television programme or blog which will make their views public but, more intimately, a clearly articulated notion of what they think society must expect of its builders. This does not mean only architects, but also developers, local and central government, and all those others who frame the programmes on which the architect must operate.” In 2014, RIBA awarded Rykwert its highest honor, the Royal Gold Medal. In an article announcing Rykwert’s recognition, Oliver Wainwright for The Guardian said that “RIBA tried to suppress his audacious teachings in the 1960s” which made his award in 2014 that much sweeter. Wainwright also commended Rykwert for his thoughtfulness; he noted that the late writer’s first ever published book review—Sigfried Giedion’s Mechanization Takes Command—took Rykwert two years to complete. Rykwert’s partner, Anne Engel, passed away in 2015. He is survived by his son, Sebastian Rykwert, and stepdaughter, Marina Engel.",
  "image": "https://www.archpaper.com/wp-content/uploads/2024/10/Joseph_Rykwert.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \u003ch2\u003e1926–2024\u003c/h2\u003e\n        \n          \n  \u003c/div\u003e\u003cdiv\u003e\n            \u003cp\u003eJoseph Rykwert, a prolific architecture \u003ca href=\"https://www.archpaper.com/tag/architectural-history/\"\u003ehistorian\u003c/a\u003e, critic, and professor, \u003ca href=\"https://www.archpaper.com/tag/obituary/\"\u003edied\u003c/a\u003e on October 18 at age 98. \u003cem\u003eThe Architect’s Journal\u003c/em\u003e remembered Rykwert as being “\u003ca href=\"https://www.architectsjournal.co.uk/news/joseph-rykwert-gloriously-erudite-architecture-critic-dies-aged-98\"\u003egloriously erudite\u003c/a\u003e.”\u003c/p\u003e\n\n\u003cp\u003eThe late intellectual is just one of four \u003ca href=\"https://www.archpaper.com/tag/architectural-criticism/\"\u003earchitecture critics\u003c/a\u003e to have won a RIBA Gold Medal since the prestigious accolade’s creation in 1848. (The others were Nikolaus Pevsner in 1967, John Summerson in 1976, and Colin Rowe in 1995.) Rykwert spent much of his career as Paul Philippe Cret Professor Emeritus of Architecture at the University of Pennsylvania.\u003c/p\u003e\n\u003cp\u003eRykwert published a number of texts that have been translated into several languages. \u003cem\u003eThe Idea of a Town \u003c/em\u003e(1963), \u003cem\u003eOn Adam’s House in Paradise\u003c/em\u003e (1972), \u003cem\u003eThe First Moderns\u003c/em\u003e (1980), \u003cem\u003eThe Dancing Column\u003c/em\u003e (1996), and \u003cem\u003eThe Seduction of Place\u003c/em\u003e (2000) are just a few of his works.\u003c/p\u003e\n\u003cp\u003eIn 1926, Rykwert was born in Warsaw, Poland, but moved to the U.K. in 1939 on the heels of World War II. He studied at the Architectural Association and Bartlett School of Architecture, and earned his PhD from the Royal College of Art in 1967. He started teaching at Penn in 1988.\u003c/p\u003e\n\u003cp\u003eDecades later, in 2012, Rykwert published an important essay titled \u003cem\u003e\u003ca href=\"https://www.architectsjournal.co.uk/practice/culture/joseph-rykwert-does-architectural-criticism-matter\"\u003eDoes Architecture Criticism Matter?\u003c/a\u003e \u003c/em\u003eIn it, he outlined the architecture critic’s precarious position in the age of starchitecture.\u003c/p\u003e\n\u003cp\u003e“Criticism may seem irrelevant to any talk about buildings at this high point of starchitecture,” Rykwert said. “Criticising starchitects may be like making disparaging comments at a pop concert, however, unlike starchitecture, pop music does seem to have bred a culture of shrewd critics though their words, however sharp, seem unable to pierce even the most inflated bubble reputations.”\u003c/p\u003e\n\u003cp\u003eRykwert continued: “I have always believed that the critic must be a fighter. To do so they must have a base from which to operate, not only the obvious one of a newspaper, periodical, radio or television programme or blog which will make their views public but, more intimately, a clearly articulated notion of what they think society must expect of its builders. This does not mean only architects, but also developers, local and central government, and all those others who frame the programmes on which the architect must operate.”\u003c/p\u003e\n\u003cp\u003eIn 2014, RIBA awarded Rykwert its highest honor, the Royal Gold Medal. In an article announcing Rykwert’s recognition, Oliver Wainwright for \u003cem\u003eThe Guardian\u003c/em\u003e said that “RIBA tried to suppress his audacious teachings in the 1960s” which made his award in 2014 that much sweeter. Wainwright also commended Rykwert for his thoughtfulness; he noted that the late writer’s first ever published book review—Sigfried Giedion’s \u003cem\u003eMechanization Takes Command—\u003c/em\u003e\u003ca href=\"https://www.theguardian.com/artanddesign/architecture-design-blog/2013/sep/18/riba-gold-medal-joseph-rykwert\"\u003etook Rykwert two years to complete\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eRykwert’s partner, Anne Engel, \u003ca href=\"https://www.cca.qc.ca/en/archives/507341/joseph-rykwert-fonds\"\u003epassed away\u003c/a\u003e in 2015. He is survived by his son, Sebastian Rykwert, and stepdaughter, Marina Engel.\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-21T20:42:59Z",
  "modifiedTime": "2024-10-22T00:16:45Z"
}
