{
  "id": "780b87f8-6804-4bda-a16a-1867b1437b3b",
  "title": "Senyum Design places matte-black Jahten House overlooking jungle in Bali",
  "link": "https://www.dezeen.com/2024/12/06/senyum-design-jahten-house-bali/",
  "description": "Matte-black volumes frame views of the surrounding jungle \"like a natural painting\" at this house in Bali, Indonesia, designed by local architecture studio Senyum Design. Located on a large 3200-square-metre site in the coastal village of Kedungu, Jahten House is divided across two low-slung volumes connected by a ramped corridor that traverses the undulating landscape. The post Senyum Design places matte-black Jahten House overlooking jungle in Bali appeared first on Dezeen.",
  "author": "Jon Astbury",
  "published": "Fri, 06 Dec 2024 11:30:25 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "Residential",
    "Architecture",
    "Residential architecture and interiors",
    "Bali",
    "Indonesia",
    "Black houses",
    "Indonesian houses"
  ],
  "byline": "Jon Astbury",
  "length": 7096,
  "excerpt": "Matte-black volumes frame views of the surrounding jungle \"like a natural painting\" at this house in Bali, Indonesia, designed by Senyum Design.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Matte-black volumes frame views of the surrounding jungle \"like a natural painting\" at this house in Bali, Indonesia, designed by local architecture studio Senyum Design. Located on a large 3200-square-metre site in the coastal village of Kedungu, Jahten House is divided across two low-slung volumes connected by a ramped corridor that traverses the undulating landscape. Senyum Design covered these volumes entirely in textured, black-coloured earth plaster that, depending on the angle of view, either creates a dramatic silhouette or blends in with the dark foliage of the jungle. Senyum Design has completed a matte-black house in Bali\"The project's layout was a reaction to the site itself, with the two volumes of the house being carefully placed with the site's sloping land,\" the studio told Dezeen. \"[The black plaster] represents similar textures and colouring as the river rock gorge system below and, because the house is quite large, this materiality also allowed it, within reason, to be hidden amongst the neighbouring jungle,\" it added. A long path through an area of grass creates an axis that leads directly into a living, dining and kitchen area and out onto a terrace and infinity pool overlooking the jungle beyond. The house is covered in textured black plasterThe home's enclosed ramped corridor leads back towards the site's entrance, where a smaller volume contains two additional ensuite bedrooms that open onto a concrete terrace. At both ends of the site, sculptural seating areas with low benches covered in matching black plaster provide vantage points overlooking the landscape. Views of the surrounding jungle are framed throughout\"This initial sequence for people entering the property shows the size of the land, form of the house, and then hints at the views beyond,\" explained the studio. \"Once entering the house through the front door, the immediacy of the view beyond is the most significant moment in the design.\" \"This beautiful view is framed as much as possible, to feel like a natural painting of sorts that the living area of the house revolves around,\" Senyum Design added. A concrete floor extends seamlessly from the terraces into the home, with gaps made for existing trees on the site to grow through. The bedrooms open onto a concrete terraceMatte-black plaster has also been used to internally line the semi-external terraces of the home, with off-white plaster used to line the living spaces and bedrooms. \"This provides warmth internally, and works within the duality of light and dark, inside and outside, openness and privacy that the house has tried to play with,\" said the studio. Off-white plaster is used for the interiorsElsewhere in Indonesia, Tamara Wibowo Architects recently completed a home in Samarang comprising two charred-timber-clad volumes united by a concrete terrace. In Jakarta, Ismail Solehudin Architecture created a home with an angular clay-tile roof, based on traditional houses in the area. The photography is courtesy of Senyum Design. Read more: Residential architecture and interiors Bali Indonesia Black houses Indonesian houses Residential Architecture Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali-hero_dezeen_2364_col_0-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2134568\" data-article-id=\"2134568\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"Jahten House by Senyum Design\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali-hero_dezeen_2364_col_0-1704x959.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eMatte-black volumes frame views of the surrounding jungle \u0026#34;like a natural painting\u0026#34; at this \u003ca href=\"https://www.dezeen.com/tag/houses/\"\u003ehouse\u003c/a\u003e in \u003ca href=\"https://www.dezeen.com/tag/bali/\"\u003eBali\u003c/a\u003e, Indonesia, designed by local architecture studio Senyum Design.\u003cspan id=\"more-2134568\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eLocated on a large 3200-square-metre site in the coastal village of Kedungu, Jahten House is divided across two low-slung volumes connected by a ramped corridor that traverses the undulating landscape.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://senyumdesign.com/\"\u003eSenyum Design\u003c/a\u003e covered these volumes entirely in textured, black-coloured earth plaster that, depending on the angle of view, either creates a dramatic silhouette or blends in with the dark foliage of the jungle.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2149933\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_1-1.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_1-1-852x568.jpg\" alt=\"Exterior of Jahten House by Senyum Design\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_1-1-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_1-1-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2149933\"\u003eSenyum Design has completed a matte-black house in Bali\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The project\u0026#39;s layout was a reaction to the site itself, with the two volumes of the house being carefully placed with the site\u0026#39;s sloping land,\u0026#34; the studio told Dezeen.\u003c/p\u003e\n\u003cp\u003e\u0026#34;[The black plaster] represents similar textures and colouring as the river rock gorge system below and, because the house is quite large, this materiality also allowed it, within reason, to be hidden amongst the neighbouring jungle,\u0026#34; it added.\u003c/p\u003e\n\n\n\u003cp\u003eA long path through an area of grass creates an axis that leads directly into a living, dining and kitchen area and out onto a terrace and infinity pool overlooking the jungle beyond.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2149936\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_18-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_18-852x1278.jpg\" alt=\"Material of Jahten House by Senyum Design\" width=\"1576\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_18-852x1278.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_18-1704x2556.jpg 2x\" sizes=\"(max-width: 1576px) 100vw, 1576px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2149936\"\u003eThe house is covered in textured black plaster\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe home\u0026#39;s enclosed ramped corridor leads back towards the site\u0026#39;s entrance, where a smaller volume contains two additional ensuite bedrooms that open onto a concrete terrace.\u003c/p\u003e\n\u003cp\u003eAt both ends of the site, sculptural seating areas with low benches covered in matching black plaster provide vantage points overlooking the landscape.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2149938\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_34.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_34-852x568.jpg\" alt=\"Views of Indonesian home with black exterior\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_34-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_34-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2149938\"\u003eViews of the surrounding jungle are framed throughout\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;This initial sequence for people entering the property shows the size of the land, form of the house, and then hints at the views beyond,\u0026#34; explained the studio.\u003c/p\u003e\n\u003cp\u003e\u0026#34;Once entering the house through the front door, the immediacy of the view beyond is the most significant moment in the design.\u0026#34;\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003e\u0026#34;This beautiful view is framed as much as possible, to feel like a natural painting of sorts that the living area of the house revolves around,\u0026#34; Senyum Design added.\u003c/p\u003e\n\u003cp\u003eA concrete floor extends seamlessly from the terraces into the home, with gaps made for existing trees on the site to grow through.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2149965\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_106.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_106-852x568.jpg\" alt=\"Terrace of Jahten House by Senyum Design\" width=\"2364\" height=\"1576\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_106-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_106-1704x1136.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2149965\"\u003eThe bedrooms open onto a concrete terrace\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eMatte-black plaster has also been used to internally line the semi-external terraces of the home, with off-white plaster used to line the living spaces and bedrooms.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This provides warmth internally, and works within the duality of light and dark, inside and outside, openness and privacy that the house has tried to play with,\u0026#34; said the studio.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2149957\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_92.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_92-852x479.jpg\" alt=\"Dining room of Indonesian home\" width=\"2364\" height=\"1330\" srcset=\"https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_92-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/senyum-design-jahten-house-bali_dezeen_2364_col_92-1704x959.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2149957\"\u003eOff-white plaster is used for the interiors\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eElsewhere in Indonesia, Tamara Wibowo Architects recently completed a \u003ca href=\"https://www.dezeen.com/2024/04/05/halo-house-indonesian-home-tamara-wibowo-architects/\"\u003ehome in Samarang comprising two charred-timber-clad volumes united by a concrete terrace\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIn Jakarta, Ismail Solehudin Architecture created \u003ca href=\"https://www.dezeen.com/2023/11/28/ismail-solehudin-architecture-distracted-house-indonesian-architecture-jakarta/\"\u003ea home with an angular clay-tile roof, based on traditional houses\u003c/a\u003e in the area.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is courtesy of Senyum Design.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"273\" href=\"https://www.dezeen.com/tag/residential/\"\u003eResidential architecture and interiors\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"2827\" href=\"https://www.dezeen.com/tag/bali/\"\u003eBali\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"2828\" href=\"https://www.dezeen.com/tag/indonesia/\"\u003eIndonesia\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"8640\" href=\"https://www.dezeen.com/tag/black-houses/\"\u003eBlack houses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"10004\" href=\"https://www.dezeen.com/tag/indonesian-houses/\"\u003eIndonesian houses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"5119\" href=\"https://www.dezeen.com/architecture/residential-architecture/\"\u003eResidential\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#49393b203f282a30092d2c332c2c27672a2624\"\u003e\u003cspan data-cfemail=\"28585a415e494b51684c4d524d4d46064b4745\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-06T11:30:25Z",
  "modifiedTime": "2024-12-06T09:32:25Z"
}
