{
  "id": "8bd9a435-b104-48bc-a9db-b0fee38190a5",
  "title": "‘we all can do more with less’: oshinowo studio brings lagos’ markets to the venice biennale",
  "link": "https://www.designboom.com/architecture/oshinowo-studio-lagos-markets-venice-architecture-biennale-interview-05-30-2025/",
  "description": "tosin oshinowo discusses with designboom how lagos’s informal markets reveal a radical model of circularity. The post ‘we all can do more with less’: oshinowo studio brings lagos’ markets to the venice biennale appeared first on designboom | architecture \u0026 design magazine.",
  "author": "thomai tsimpou I designboom",
  "published": "Fri, 30 May 2025 20:45:16 +0000",
  "source": "https://www.designboom.com/architecture/feed/",
  "categories": [
    "architecture",
    "interviews",
    "architecture in nigeria",
    "architecture interviews",
    "exhibition design",
    "venice architecture biennale 2025"
  ],
  "byline": "thomai tsimpou I designboom",
  "length": 9005,
  "excerpt": "oshinowo studio brings 'alternative urbanism: self-organising markets of lagos' to the venice architecture biennale 2025.",
  "siteName": "designboom | architecture \u0026 design magazine",
  "favicon": "",
  "text": "lagos markets land at the venice architecture biennale 2025Lagos-based architecture practice Oshinowo Studio brings ‘Alternative Urbanism: self-organising markets of Lagos‘ to the 19th International Architecture Exhibition of the Venice Biennale, spotlighting three of the city’s most dynamic informal markets—Ladipo, Computer Village, and Katangua. Invited by curator Carlo Ratti to respond to his circular economy manifesto, the studio explores how these systems repurpose waste from the global north into valuable goods, offering a powerful model of embedded circularity. ‘These markets don’t work just as places of commerce and exchange,’ notes founder Tosin Oshinowo in an exclusive interview with designboom. ‘What is fascinating is the factory-like process that occurs when a source material is re-appropriated and adapted through different sectors in these markets,’ she tells us. Through immersive film, photography, data visualisations, and recycled denim maps crafted in Katangua, the exhibition reframes Lagos’s markets as complex infrastructures of ingenuity, shaped by scarcity and sustained by collective intelligence.Rejecting voyeuristic representations of African spaces, the installation at the Arsenale avoids still images of deprivation and instead offers a technical view into the working mechanics of these markets. ‘It was important that the narrative be optimistic; after all, I live and work in Lagos,’ Oshinowo says. ‘I do not see what happens here as backwards or deprived; I see this as fascinating, innovative, and the other extreme of global capitalism,’ she adds. With her team’s mapping, video documentation, and textile production done within Katangua, the pavilion elevates local material knowledge to an international stage. In doing so, it delivers a clear message to Biennale visitors.‘The biggest lesson and shift in perspective I hope to share and inspire with this global audience is that we all can do more with less,’ Tosin Oshinowo suggests.Alternative Urbanism: self-organising markets of Lagos at the Arsenale | image by Paul RafteryOshinowo Studio offers a blueprint for adaptive urban futuresLadipo Market deals in second-hand car parts; Computer Village in used electronics; and Katangua in recycled fashion. While their contents differ, their shared value lies in how they extend the life of consumer goods through a communal network of reuse, repair, and resale. ‘These specialist markets emerge across the city in white and brown-fill sites, residential zones, and defunct industrial parks,’ Tosin Oshinowo shares with designboom. ‘Through a collective intelligence, the city operates at a sophisticated level outside of orthodox methodologies and functions at scale without the expected industrialized infrastructure.’ Her exhibition doesn’t romanticize the struggle but rather reframes Lagos’s informal urban systems as prototypes for sustainable cities—systems built from adaptation, making them increasingly relevant in a time of global resource scarcity.As Oshinowo explains, these spaces represent ‘a glimpse into an urban condition without imperialism, colonialism, and modernism imposed on the continent.’ Far from being symbols of deprivation, the markets are framed as energetic ecosystems shaped by ‘bottom-up structures and soft-power systems.’ Located in areas ranging from residential zones to defunct industrial parks, each market illustrates the kind of grassroots adaptability often excluded from conventional urban planning. With Nigeria’s currency devalued by 700% since 2005 and most of the population living on under $2 a day, these markets respond with a resilience that blends necessity with aspiration. ‘The majority of Africa is urbanized but not industrialized,’ the Lagos-based architect explains. ‘This situation creates an urban condition that is alternative to conventional expectations of progress and development.’ Read on for our full interview with Tosin Oshinowo.the studio explores how these systems repurpose waste | image by Paul Rafteryinterview with Tosin Oshinowodesignboom (DB): Alternative Urbanism is a powerful title—how does it reflect your view of Lagos’s informal markets, and in what ways do they challenge conventional models of urban planning and sustainability?Tosin Oshinowo (TO): The title is impactful; however, it simply states a reality that occurs as parallel development with the rest of the world. The majority of Africa is urbanized but not industrialized, and this situation creates an urban condition that is alternative to conventional expectations of progress and development. This research project uses the informal market as an entry point to understand this condition. Lagos is a heightened example of this condition because of its critical mass—the city has 0.3% of Nigeria’s surface area and 10% of its population, 26.4 million. With insufficient industrialized infrastructure, it is challenging to manage the city structurally. This density allows us to observe this condition in concentration. These markets happen when bottom-up structures and soft-power systems come to the foreground.Rem Koolhaas’ research in the late 1990s and early 2000s observed that the urban condition in Lagos defied orthodox planning methodologies. Here, I suggest that instead of defying these methodologies, what we observe in the city condition reverts to an evolution from tradition. It could be considered a glimpse into an urban condition without imperialism, colonialism, and modernism imposed on the continent. The informal African market is the most unadulterated urban artifact of our city’s developmental framework. It is the fabric of the commons, a shared space everyone contributes to and shares in its benefits. The markets operate in a capitalist model and outside of it. The markets have evolved from pre-colonial times to their present state in the post-colonial African city. Holding more than just places of commerce and exchange, but also of divine importance. In Yorùbá culture from southwest Nigeria, the market holds divine significance in mythology as it is seen as the point of final departure for the soul from the earth (ilé) as it rightfully returns to the heavens (òrun).recycled denim maps crafted in Katangua | image by Paul RafteryDB: Carlo Ratti’s circular economy manifesto set the tone for this year’s Biennale. How did it resonate with your existing observations of Lagos, and what discoveries emerged from your research into these self-organizing markets?TO: When I first read Carlo Ratti’s manifesto, I was excited that this research resonated with the theme and perfect timing. There is nothing more euphoric than realizing that you are part of a change movement. Circularity has been a long-standing practice in regions that deal with austerity. It is encouraging that there is a growing understanding globally that we all need to embody this methodology. When I started the research on the markets, it was initially out of an interest to understand how global south cities function at scale with inadequate infrastructure.As I developed this narrative, I observed how sophisticated the system of markets and circularity is embedded into commerce and city life. I observed that due to Nigeria’s challenged economic condition and the reality of desires to live in modernity, capital-intensive consumer products are outside of the immediate reach of the average Nigerian consumer, with the Nigerian Naira devalued by 700% since 2005. These markets don’t work just as places of commerce and exchange. Several specialist markets sell second-hand products considered redundant from the global north. What is fascinating is the factory-like process that occurs when a source material is re-appropriated and adapted through different sectors in these markets. These markets effectively take waste from the global north and extend product life while producing less carbon.the exhibition reframes Lagos’s markets as complex infrastructures of ingenuity | image by Andrea AvezzùDB: Ladipo, Computer Village, and Katangua each represent a different kind of circular ingenuity. Why these three, and what do they collectively reveal about resilience and resourcefulness in urban Nigeria?TO: So far, the research has documented 80+ specialist markets, as the convergence of like-for-like across the city’s urban fabric has been fascinating. I selected these three markets for the exhibition because their content deals with circularity. Like all markets, they deal with consumer goods, but these three represent staples of modernity. And the opportunity for people in these regions to afford capital-intensive consumer goods like cars, electronics, and clothes. Where does the hyperconsumerist global north dispose of its waste? Today, two-thirds of Nigerians live on less than $2 a day. These conditions create the fertile ground to harbor this kind of circularity not seen before structural adjustment programs imposed on the global south from the mid-1980s and early 1990s.",
  "image": "https://www.designboom.com/twitterimages/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-1200.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003ch2\u003elagos markets land at the venice architecture biennale 2025\u003c/h2\u003e\u003cp\u003eLagos-based architecture practice Oshinowo Studio brings ‘Alternative Urbanism: self-organising markets of \u003ca href=\"https://www.designboom.com/tag/architecture-in-nigeria/\"\u003e\u003cstrong\u003eLagos\u003c/strong\u003e\u003c/a\u003e‘ to the 19th International Architecture Exhibition of the \u003ca href=\"https://www.designboom.com/tag/venice-architecture-biennale-2025/\"\u003e\u003cstrong\u003eVenice Biennale\u003c/strong\u003e\u003c/a\u003e, spotlighting three of the city’s most dynamic informal markets—Ladipo, Computer Village, and Katangua. Invited by curator \u003ca href=\"https://www.designboom.com/tag/carlo-ratti/\"\u003e\u003cstrong\u003eCarlo Ratti\u003c/strong\u003e\u003c/a\u003e to respond to his circular economy manifesto, the studio explores how these systems repurpose waste from the global north into valuable goods, offering a powerful model of embedded circularity. ‘\u003cem\u003eThese markets don’t work just as places of commerce and exchange,’\u003c/em\u003e \u003cstrong\u003enotes founder Tosin Oshinowo in an exclusive \u003ca href=\"https://www.designboom.com/tag/architecture-interviews/\"\u003einterview\u003c/a\u003e with designboom.\u003c/strong\u003e \u003cem\u003e‘What is fascinating is the factory-like process that occurs when a source material is re-appropriated and adapted through different sectors in these markets,’\u003c/em\u003e \u003cstrong\u003eshe tells us.\u003c/strong\u003e Through immersive film, \u003ca href=\"https://www.designboom.com/tag/photography/\"\u003e\u003cstrong\u003ephotography\u003c/strong\u003e\u003c/a\u003e, data visualisations, and \u003ca href=\"https://www.designboom.com/tag/textile-and-fabric-art/\"\u003e\u003cstrong\u003erecycled denim\u003c/strong\u003e\u003c/a\u003e maps crafted in Katangua, the \u003cstrong\u003e\u003ca href=\"https://www.designboom.com/tag/exhibition-design/\"\u003eexhibition\u003c/a\u003e\u003c/strong\u003e reframes Lagos’s markets as complex infrastructures of ingenuity, shaped by scarcity and sustained by collective intelligence.\u003c/p\u003e\u003cp\u003eRejecting voyeuristic representations of African spaces, the \u003ca href=\"https://www.designboom.com/tag/interactive-installation/\"\u003e\u003cstrong\u003einstallation\u003c/strong\u003e\u003c/a\u003e at the Arsenale avoids still images of deprivation and instead offers a technical view into the working mechanics of these markets. \u003cem\u003e‘It was important that the narrative be optimistic; after all, I live and work in Lagos,’\u003c/em\u003e \u003cstrong\u003eOshinowo says.\u003c/strong\u003e \u003cem\u003e‘I do not see what happens here as backwards or deprived; I see this as fascinating, innovative, and the other extreme of global capitalism,’ \u003c/em\u003e\u003cstrong\u003eshe adds.\u003c/strong\u003e With her team’s mapping, video documentation, and textile production done within Katangua, the pavilion elevates local material knowledge to an international stage. In doing so, it delivers a clear message to Biennale visitors.\u003cem\u003e‘The biggest lesson and shift in perspective I hope to share and inspire with this global audience is that we all can do more with less,’ \u003c/em\u003e\u003cstrong\u003eTosin Oshinowo suggests.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" alt=\"\u0026#39;we all can do more with less\u0026#39;: oshinowo studio brings lagos\u0026#39; markets to the venice biennale\" width=\"818\" height=\"465\" data-src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-03.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-03.jpg\"/\u003e\u003cbr/\u003eAlternative Urbanism: self-organising markets of Lagos at the Arsenale | image by \u003ca href=\"https://www.rafphoto.com/\" target=\"_blank\" rel=\"noopener\"\u003ePaul Raftery\u003c/a\u003e\u003c/p\u003e\u003ch2\u003eOshinowo Studio offers a blueprint for adaptive urban futures\u003c/h2\u003e\u003cp\u003eLadipo Market deals in second-hand car parts; Computer Village in used electronics; and Katangua in recycled fashion. While their contents differ, their shared value lies in how they extend the life of consumer goods through a communal network of reuse, repair, and resale. \u003cem\u003e‘These specialist markets emerge across the city in white and brown-fill sites, residential zones, and defunct industrial parks,’\u003c/em\u003e \u003cstrong\u003eTosin Oshinowo\u003c/strong\u003e\u003cstrong\u003e shares with designboom.\u003c/strong\u003e \u003cem\u003e‘Through a collective intelligence, the city operates at a sophisticated level outside of orthodox methodologies and functions at scale without the expected industrialized infrastructure.’\u003c/em\u003e Her exhibition doesn’t romanticize the struggle but rather reframes Lagos’s informal urban systems as prototypes for sustainable cities—systems built from adaptation, making them increasingly relevant in a time of global resource scarcity.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAs Oshinowo explains, these spaces represent\u003c/strong\u003e \u003cem\u003e‘a glimpse into an urban condition without imperialism, colonialism, and modernism imposed on the continent.’\u003c/em\u003e Far from being symbols of deprivation, the markets are framed as energetic ecosystems shaped by \u003cem\u003e‘bottom-up structures and soft-power systems.’\u003c/em\u003e Located in areas ranging from residential zones to defunct industrial parks, each market illustrates the kind of grassroots adaptability often excluded from conventional urban planning. With Nigeria’s currency devalued by 700% since 2005 and most of the population living on under $2 a day, these markets respond with a resilience that blends necessity with aspiration. \u003cem\u003e‘The majority of Africa is urbanized but not industrialized,’\u003c/em\u003e \u003cstrong\u003ethe \u003ca href=\"https://www.oshinowostudio.com/\" target=\"_blank\" rel=\"noopener\"\u003eLagos-based architect\u003c/a\u003e explains.\u003c/strong\u003e \u003cem\u003e‘This situation creates an urban condition that is alternative to conventional expectations of progress and development.’ \u003c/em\u003e\u003cstrong\u003eRead on for our full interview with Tosin Oshinowo.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"\u0026#39;we all can do more with less\u0026#39;: oshinowo studio brings lagos\u0026#39; markets to the venice biennale\" width=\"818\" height=\"464\" data-src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-01.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-01.jpg\"/\u003e\u003cbr/\u003ethe studio explores how these systems repurpose waste | image by Paul Raftery\u003c/p\u003e\u003ch2\u003einterview with Tosin Oshinowo\u003c/h2\u003e\u003cp\u003e\u003cstrong\u003edesignboom (DB): Alternative Urbanism is a powerful title—how does it reflect your view of Lagos’s informal markets, and in what ways do they challenge conventional models of urban planning and sustainability?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTosin Oshinowo (TO):\u003c/strong\u003e The title is impactful; however, it simply states a reality that occurs as parallel development with the rest of the world. The majority of Africa is urbanized but not industrialized, and this situation creates an urban condition that is alternative to conventional expectations of progress and development. This research project uses the informal market as an entry point to understand this condition. Lagos is a heightened example of this condition because of its critical mass—the city has 0.3% of Nigeria’s surface area and 10% of its population, 26.4 million. With insufficient industrialized infrastructure, it is challenging to manage the city structurally. This density allows us to observe this condition in concentration. These markets happen when bottom-up structures and soft-power systems come to the foreground.\u003c/p\u003e\u003cp\u003eRem Koolhaas’ research in the late 1990s and early 2000s observed that the urban condition in Lagos defied orthodox planning methodologies. Here, I suggest that instead of defying these methodologies, what we observe in the city condition reverts to an evolution from tradition. It could be considered a glimpse into an urban condition without imperialism, colonialism, and modernism imposed on the continent. The informal African market is the most unadulterated urban artifact of our city’s developmental framework. It is the fabric of the commons, a shared space everyone contributes to and shares in its benefits. The markets operate in a capitalist model and outside of it. The markets have evolved from pre-colonial times to their present state in the post-colonial African city. Holding more than just places of commerce and exchange, but also of divine importance. In Yorùbá culture from southwest Nigeria, the market holds divine significance in mythology as it is seen as the point of final departure for the soul from the earth (ilé) as it rightfully returns to the heavens (òrun).\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"\u0026#39;we all can do more with less\u0026#39;: oshinowo studio brings lagos\u0026#39; markets to the venice biennale\" width=\"818\" height=\"546\" data-src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-04.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-04.jpg\"/\u003e\u003cbr/\u003erecycled denim maps crafted in Katangua | image by Paul Raftery\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDB: Carlo Ratti’s circular economy manifesto set the tone for this year’s Biennale. How did it resonate with your existing observations of Lagos, and what discoveries emerged from your research into these self-organizing markets?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTO: \u003c/strong\u003eWhen I first read Carlo Ratti’s manifesto, I was excited that this research resonated with the theme and perfect timing. There is nothing more euphoric than realizing that you are part of a change movement. Circularity has been a long-standing practice in regions that deal with austerity. It is encouraging that there is a growing understanding globally that we all need to embody this methodology. When I started the research on the markets, it was initially out of an interest to understand how global south cities function at scale with inadequate infrastructure.\u003c/p\u003e\u003cp\u003eAs I developed this narrative, I observed how sophisticated the system of markets and circularity is embedded into commerce and city life. I observed that due to Nigeria’s challenged economic condition and the reality of desires to live in modernity, capital-intensive consumer products are outside of the immediate reach of the average Nigerian consumer, with the Nigerian Naira devalued by 700% since 2005. These markets don’t work just as places of commerce and exchange. Several specialist markets sell second-hand products considered redundant from the global north. What is fascinating is the factory-like process that occurs when a source material is re-appropriated and adapted through different sectors in these markets. These markets effectively take waste from the global north and extend product life while producing less carbon.\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"\u0026#39;we all can do more with less\u0026#39;: oshinowo studio brings lagos\u0026#39; markets to the venice biennale\" width=\"818\" height=\"563\" data-src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-06.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2025/05/oshinowo-studio-lagos-circular-markets-venice-architecture-biennale-interview-designboom-06.jpg\"/\u003e\u003cbr/\u003ethe exhibition reframes Lagos’s markets as complex infrastructures of ingenuity | image by \u003ca href=\"https://www.andreaavezzu.com/\" target=\"_blank\" rel=\"noopener\"\u003eAndrea Avezzù\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDB: Ladipo, Computer Village, and Katangua each represent a different kind of circular ingenuity. Why these three, and what do they collectively reveal about resilience and resourcefulness in urban Nigeria?\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTO: \u003c/strong\u003eSo far, the research has documented 80+ specialist markets, as the convergence of like-for-like across the city’s urban fabric has been fascinating. I selected these three markets for the exhibition because their content deals with circularity. Like all markets, they deal with consumer goods, but these three represent staples of modernity. And the opportunity for people in these regions to afford capital-intensive consumer goods like cars, electronics, and clothes. Where does the hyperconsumerist global north dispose of its waste? Today, two-thirds of Nigerians live on less than $2 a day. These conditions create the fertile ground to harbor this kind of circularity not seen before structural adjustment programs imposed on the global south from the mid-1980s and early 1990s.\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-30T20:45:16Z",
  "modifiedTime": null
}
