{
  "id": "906f2ccd-155d-4889-885e-a30acf09483c",
  "title": "Adam Kane Architects banishes colour to create Grey House in Australia",
  "link": "https://www.dezeen.com/2024/12/24/grey-house-adam-kane-architects-australia/",
  "description": "Australian studio Adam Kane Architects has designed an all-grey house in the southeastern state of Victoria, blanketing its surfaces in fog-like polished plaster. Named after its neutral colour palette, Grey House is a holiday home for studio founder Adam Kane's own family, located in a valley an hour from Melbourne in the regional town of The post Adam Kane Architects banishes colour to create Grey House in Australia appeared first on Dezeen.",
  "author": "Ella Jessel",
  "published": "Tue, 24 Dec 2024 11:30:51 +0000",
  "source": "https://www.dezeen.com/architecture/feed/",
  "categories": [
    "all",
    "Architecture",
    "Residential architecture and interiors",
    "Australia",
    "Steel",
    "Houses",
    "Holiday homes",
    "Monochrome",
    "Australian houses",
    "Adam Kane Architects"
  ],
  "byline": "Ella Jessel",
  "length": 7676,
  "excerpt": "Adam Kane Architects has designed an all-grey house in the southeastern state of Victoria, blanketing its surfaces in fog-like polished plaster.",
  "siteName": "Dezeen",
  "favicon": "https://www.dezeen.com/wp-content/themes/2016dezeen/assets/img/favicons/dezeen/apple-touch-icon.png",
  "text": "Australian studio Adam Kane Architects has designed an all-grey house in the southeastern state of Victoria, blanketing its surfaces in fog-like polished plaster. Named after its neutral colour palette, Grey House is a holiday home for studio founder Adam Kane's own family, located in a valley an hour from Melbourne in the regional town of Daylesford. Adam Kane Architects has completed a holiday home for its founderWhen viewed from the front, the large three-bedroom home resembles a modern art gallery, with its monolithic facade and clean lines a stark contrast to the green banks it is nestled in and the forest backdrop behind. According to Kane, working on his own house was a chance to push the boundaries and experiment with materials at which a client might baulk. The residence has an all-grey colour scheme\"The home excels in its purpose of a purist aesthetic without compromise on functionality,\" said Kane. \"Everything is concealed and has a place,\" he continued. \"Removing clutter and an abundance of colours, textures, and materials in combination with a soft polished plaster finish throughout brings an incredible sense of calm\". The all-grey look was achieved by covering the house's walls, doors and wet areas, as well as much of the full-height concealed joinery, in polished plaster. Polished plaster coats the interior and exterior\"There's a softness to this product that could not be achieved with paint – it evolves throughout the day, with the texture intensity changing, as does its mottled sheen,\" said Kane. To add further texture to the monochrome interiors, a second finish of stainless steel was added to some surfaces. In places, the steel was hand-scoured to create a cloud-like aesthetic and allow any future scratches to be quickly buffed out. The neutral aesthetic is carried over into furnishings, with large smoke-coloured sofas, and coal-coloured tables and chairs. Even the bath and sinks are grey. The neutral aesthetic extends to the home's furnishingsGrey House contains three bedrooms and a separate freestanding guesthouse. Its communal spaces are all designed to have their own \"feel and purpose\", while bedrooms are concealed for privacy and to ensure a cleaner aesthetic. As the space the family spends most of its time in, the kitchen is one of the house's focal points with a strong visual connection to its adjoining garden providing an \"everchanging backdrop\". All the rooms have been given \"evergreen\" viewsLocated in the foothills of Victoria's Great Dividing Range, the area's climate is often wet, providing a lush green garden for the house's surroundings. However, the existing site only had three pine trees, leading the studio to plant out banks on three sides of the house to create \"evergreen\" views from all of its rooms. A small creek running through the site was diverted and around three metres of earth was moved to the front of the house site to create level ground, increasing the house's visual impact from the street. Stainless steel is used for a number of interior surfacesKane described the overall effect of Grey House as a \"timeless haven\" that offers a retreat from the chaos of the world. \"This choice of grey paired with stainless steel accents was deliberate, symbolising neutrality, balance, and introspection,\" he said. \"It serves as a canvas upon which the mind can wander freely, devoid of distractions.\" Other monochrome projects on Dezeen include a blue Brooklyn townhouse by LOT Office and the calming Mureli House in Ukraine by Makhno Studio. The photography is by Timothy Kaye. Read more: Residential architecture and interiors Australia Steel Houses Holiday homes Monochrome Australian houses Adam Kane Architects Architecture Subscribe to our newsletters Your email address New! Dezeen Agenda US Sent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events. New! Dezeen Showroom New Releases A quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom.  Dezeen Debate Our most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news.  Dezeen Agenda Sent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events.  Dezeen Daily A daily newsletter containing the latest stories from Dezeen. Dezeen In Depth Sent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design. Dezeen Jobs Daily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Jobs Weekly Weekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news. Dezeen Awards News about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates. Dezeen Events Guide News from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events. Dezeen Awards China News about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates. We will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at [email protected]. For more details, please see our privacy notice. Thank you! You will shortly receive a welcome email so please check your inbox. You can unsubscribe at any time by clicking the link at the bottom of every newsletter.",
  "image": "https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia-hero_dezeen_2364_col_2-600x600.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n        \u003carticle id=\"post-2153612\" data-article-id=\"2153612\"\u003e\n\n            \n            \u003cheader\u003e\n                \n\n\t\t\n    \u003cfigure data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia-hero_dezeen_2364_col_0.jpg\" id=\"preload-hero\"\u003e\n\t\t\u003cimg width=\"852\" height=\"479\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia-hero_dezeen_2364_col_0-852x479.jpg\" alt=\"Grey House by Adam Kane Architects\" decoding=\"async\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia-hero_dezeen_2364_col_0-852x479.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia-hero_dezeen_2364_col_0-1704x958.jpg 2x\" data-pin-nopin=\"true\"/\u003e\t\t    \u003c/figure\u003e\n\t\n                \n\n                \n\n                \n\n            \u003c/header\u003e\n\n            \u003csection\u003e\n                \n\n                \n                \n                \u003cp\u003eAustralian studio \u003ca href=\"https://www.dezeen.com/tag/adam-kane-architects/\"\u003eAdam Kane Architects\u003c/a\u003e has designed an \u003ca href=\"https://www.dezeen.com/tag/monochrome/\"\u003eall-grey\u003c/a\u003e house in the southeastern state of Victoria, blanketing its surfaces in fog-like polished plaster.\u003cspan id=\"more-2153612\"\u003e\u003c/span\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eNamed after its neutral colour palette, Grey House is a \u003ca href=\"https://www.dezeen.com/tag/holiday-homes/\"\u003eholiday home\u003c/a\u003e for studio founder \u003ca href=\"https://adamkane.com.au/\"\u003eAdam Kane\u003c/a\u003e\u0026#39;s own family, located in a valley an hour from \u003ca href=\"https://www.dezeen.com/tag/melbourne/\"\u003eMelbourne\u003c/a\u003e in the regional town of Daylesford.\u003c/p\u003e\n\u003cfigure id=\"preload-0\" aria-describedby=\"caption-attachment-2154305\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_0.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_0-852x568.jpg\" alt=\"Exterior view of Grey House in Australia\" width=\"2364\" height=\"1577\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_0-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_0-1704x1137.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154305\"\u003eAdam Kane Architects has completed a holiday home for its founder\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eWhen viewed from the front, the large three-bedroom home resembles a modern art gallery, with its monolithic facade and clean lines a stark contrast to the green banks it is nestled in and the forest backdrop behind.\u003c/p\u003e\n\u003cp\u003eAccording to Kane, working on his own house was a chance to push the boundaries and experiment with materials at which a client might baulk.\u003c/p\u003e\n\u003cfigure id=\"preload-1\" aria-describedby=\"caption-attachment-2154319\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_13-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_13-852x1372.jpg\" alt=\"Courtyard area within holiday home by Adam Kane Architects\" width=\"1468\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_13-852x1372.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_13-1704x2745.jpg 2x\" sizes=\"(max-width: 1468px) 100vw, 1468px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154319\"\u003eThe residence has an all-grey colour scheme\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;The home excels in its purpose of a purist aesthetic without compromise on functionality,\u0026#34; said Kane.\u003c/p\u003e\n\n\n\u003cp\u003e\u0026#34;Everything is concealed and has a place,\u0026#34; he continued. \u0026#34;Removing clutter and an abundance of colours, textures, and materials in combination with a soft polished plaster finish throughout brings an incredible sense of calm\u0026#34;.\u003c/p\u003e\n\u003cp\u003eThe all-grey look was achieved by covering the house\u0026#39;s walls, doors and wet areas, as well as much of the full-height concealed joinery, in polished plaster.\u003c/p\u003e\n\u003cfigure id=\"preload-2\" aria-describedby=\"caption-attachment-2154306\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_1-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_1-852x1277.jpg\" alt=\"View of kitchen space within Grey House in Australia\" width=\"1577\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_1-852x1277.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_1-1704x2555.jpg 2x\" sizes=\"(max-width: 1577px) 100vw, 1577px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154306\"\u003ePolished plaster coats the interior and exterior\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u0026#34;There\u0026#39;s a softness to this product that could not be achieved with paint – it evolves throughout the day, with the texture intensity changing, as does its mottled sheen,\u0026#34; said Kane.\u003c/p\u003e\n\u003cp\u003eTo add further texture to the monochrome interiors, a second finish of stainless steel was added to some surfaces.\u003c/p\u003e\n\n\t\t\t\t\u003cp\u003eIn places, the steel was hand-scoured to create a cloud-like aesthetic and allow any future scratches to be quickly buffed out.\u003c/p\u003e\n\u003cp\u003eThe neutral aesthetic is carried over into furnishings, with large smoke-coloured sofas, and coal-coloured tables and chairs. Even the bath and sinks are grey.\u003c/p\u003e\n\u003cfigure id=\"preload-3\" aria-describedby=\"caption-attachment-2154311\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_6-scaled.jpg\" data-orientation=\"portrait\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_6-852x1277.jpg\" alt=\"Neutral-coloured dining space within Grey House\" width=\"1577\" height=\"2364\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_6-852x1277.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_6-1704x2555.jpg 2x\" sizes=\"(max-width: 1577px) 100vw, 1577px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154311\"\u003eThe neutral aesthetic extends to the home\u0026#39;s furnishings\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eGrey House contains three bedrooms and a separate freestanding guesthouse. Its communal spaces are all designed to have their own \u0026#34;feel and purpose\u0026#34;, while bedrooms are concealed for privacy and to ensure a cleaner aesthetic.\u003c/p\u003e\n\u003cp\u003eAs the space the family spends most of its time in, the kitchen is one of the house\u0026#39;s focal points with a strong visual connection to its adjoining garden providing an \u0026#34;everchanging backdrop\u0026#34;.\u003c/p\u003e\n\u003cfigure id=\"preload-4\" aria-describedby=\"caption-attachment-2154312\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_7.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_7-852x577.jpg\" alt=\"Living space interior at holiday home by Adam Kane Architects\" width=\"2364\" height=\"1601\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_7-852x577.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_7-1704x1154.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154312\"\u003eAll the rooms have been given \u0026#34;evergreen\u0026#34; views\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eLocated in the foothills of Victoria\u0026#39;s Great Dividing Range, the area\u0026#39;s climate is often wet, providing a lush green garden for the house\u0026#39;s surroundings. However, the existing site only had three pine trees, leading the studio to plant out banks on three sides of the house to create \u0026#34;evergreen\u0026#34; views from all of its rooms.\u003c/p\u003e\n\u003cp\u003eA small creek running through the site was diverted and around three metres of earth was moved to the front of the house site to create level ground, increasing the house\u0026#39;s visual impact from the street.\u003c/p\u003e\n\u003cfigure id=\"preload-5\" aria-describedby=\"caption-attachment-2154308\" data-lightboximage=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_3.jpg\" data-orientation=\"landscape\"\u003e\u003cimg decoding=\"async\" src=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_3-852x568.jpg\" alt=\"Interior view of entirely-grey holiday home by Adam Kane Architects\" width=\"2364\" height=\"1577\" srcset=\"https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_3-852x568.jpg 1x, https://static.dezeen.com/uploads/2024/12/adam-kane-architects-grey-house-australia_dezeen_2364_col_3-1704x1137.jpg 2x\" sizes=\"(max-width: 2364px) 100vw, 2364px\" loading=\"lazy\"/\u003e\u003cfigcaption id=\"caption-attachment-2154308\"\u003eStainless steel is used for a number of interior surfaces\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eKane described the overall effect of Grey House as a \u0026#34;timeless haven\u0026#34; that offers a retreat from the chaos of the world.\u003c/p\u003e\n\u003cp\u003e\u0026#34;This choice of grey paired with stainless steel accents was deliberate, symbolising neutrality, balance, and introspection,\u0026#34; he said. \u0026#34;It serves as a canvas upon which the mind can wander freely, devoid of distractions.\u0026#34;\u003c/p\u003e\n\u003cp\u003eOther monochrome projects on Dezeen include \u003ca href=\"https://www.dezeen.com/2021/02/22/lot-office-for-architecture-blue-house-brooklyn/\"\u003ea blue Brooklyn townhouse by LOT Office\u003c/a\u003e and \u003ca href=\"https://www.dezeen.com/2022/08/30/mureli-house-kozyn-makhno-studio-interiors/\"\u003ethe calming Mureli House in Ukraine by Makhno Studio\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe photography is by \u003ca href=\"https://www.timothykaye.com/\"\u003eTimothy Kaye\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n                \n                \n                \n\u003cdiv\u003e\n\t\t\u003cp\u003e\u003cspan\u003eRead more: \u003c/span\u003e\u003c/p\u003e\u003cul\u003e\n\u003cli\u003e\u003ca data-id=\"273\" href=\"https://www.dezeen.com/tag/residential/\"\u003eResidential architecture and interiors\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"140\" href=\"https://www.dezeen.com/tag/australia/\"\u003eAustralia\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"1003\" href=\"https://www.dezeen.com/tag/steel/\"\u003eSteel\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"3353\" href=\"https://www.dezeen.com/tag/houses/\"\u003eHouses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4652\" href=\"https://www.dezeen.com/tag/holiday-homes/\"\u003eHoliday homes\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4854\" href=\"https://www.dezeen.com/tag/monochrome/\"\u003eMonochrome\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"6498\" href=\"https://www.dezeen.com/tag/australian-houses/\"\u003eAustralian houses\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"12881\" href=\"https://www.dezeen.com/tag/adam-kane-architects/\"\u003eAdam Kane Architects\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca data-id=\"4\" href=\"https://www.dezeen.com/architecture/\"\u003eArchitecture\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\t\u003c/div\u003e\n\n            \u003c/section\u003e\n\n            \n            \u003cdiv id=\"newsletter-form\"\u003e\n\n        \u003cform action=\"\" method=\"POST\"\u003e\n\n            \u003cdiv id=\"newsletter-step-1\"\u003e\n                    \u003ch2\u003eSubscribe to our newsletters\u003c/h2\u003e\n                \u003cp\u003e\u003clabel for=\"subscriber_email_newsletter_form_post\"\u003eYour email address\u003c/label\u003e\n\n                \n                                        \n                    \n\n                \u003c/p\u003e\u003c/div\u003e\n\n            \u003cdiv id=\"newsletter-step-2\"\u003e\n\n                    \u003cp\u003e\u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Agenda US\u003c/strong\u003e\n                \u003cp\u003eSent on alternate Fridays, this US edition of Dezeen Agenda is a fortnightly newsletter rounding up everything you need to know from America, featuring news, projects and interviews with industry figures. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eNew! Dezeen Showroom New Releases\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA quarterly newsletter rounding up a selection of recently launched products by designers and studios, published on Dezeen Showroom. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Debate\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eOur most popular newsletter, formerly known as Dezeen Weekly, is sent every Tuesday and features a selection of the best reader comments and most talked-about stories. Plus occasional updates on Dezeen’s services and breaking news. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Agenda\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eSent every Thursday and containing a selection of the most important news highlights. Plus occasional updates on Dezeen’s services and invitations to Dezeen events. \u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Daily\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eA daily newsletter containing the latest stories from Dezeen.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen In Depth\u003c/strong\u003e\n                \u003cp\u003eSent on the last Friday of every month, Dezeen in Depth features original feature articles, interviews and opinion pieces that delve deeper into the major stories shaping architecture and design.\u003c/p\u003e\n\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eDaily updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Jobs Weekly\u003c/strong\u003e\n                \u003cp\u003e\u003cspan\u003eWeekly updates on the latest design and architecture vacancies advertised on Dezeen Jobs. Plus occasional news.\u003c/span\u003e\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Events Guide\u003c/strong\u003e\n                \u003cp\u003eNews from Dezeen Events Guide, a listings guide covering the leading design-related events taking place around the world. Plus occasional updates and invitations to Dezeen events.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n                    \u003clabel\u003e\n                \u003cstrong\u003eDezeen Awards China\u003c/strong\u003e\n                \u003cp\u003eNews about our Dezeen Awards China programme, including entry deadlines and announcements. Plus occasional updates.\u003c/p\u003e\n                \n                \u003cspan\u003e\u003c/span\u003e\n            \u003c/label\u003e\n            \u003c/p\u003e\n    \u003cp\u003eWe will only use your email address to send you the newsletters you have requested. We will never give your details to anyone else without your consent. You can unsubscribe at any time by clicking on the unsubscribe link at the bottom of every email, or by emailing us at \u003ca href=\"https://www.dezeen.com/cdn-cgi/l/email-protection#b7c7c5dec1d6d4cef7d3d2cdd2d2d999d4d8da\"\u003e\u003cspan data-cfemail=\"0272706b7463617b4266677867676c2c616d6f\"\u003e[email protected]\u003c/span\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor more details, please see our \u003ca href=\"https://www.dezeen.com/privacy-notice\" target=\"_blank\" rel=\"noopener\"\u003eprivacy notice\u003c/a\u003e.\u003c/p\u003e\n\n                \n\n                \n\n                \n\n                \n\n            \u003c/div\u003e\n    \n            \u003cdiv id=\"newsletter-step-3\"\u003e\n                \u003ch2\u003eThank you!\u003c/h2\u003e\n\u003cp\u003eYou will shortly receive a welcome email so please check your inbox.\u003c/p\u003e\n\u003cp\u003eYou can unsubscribe at any time by clicking the link at the bottom of every newsletter.\u003c/p\u003e\n\u003c/div\u003e\n\n        \u003c/form\u003e\n\n    \u003c/div\u003e\n\n            \n\n            \n\n            \n        \u003c/article\u003e\n\n\n    \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2024-12-24T11:30:51Z",
  "modifiedTime": "2024-12-19T12:20:09Z"
}
