{
  "id": "ad0f8550-a8a7-48f7-81e9-8c72e3558a81",
  "title": "Tour a Renovated London Row House That’s Part Art Gallery, Part Family Home",
  "link": "https://www.architecturaldigest.com/story/tour-a-renovated-london-row-house-thats-part-art-gallery-part-family-home",
  "description": "Using bright colors and unexpected materials, an architectural duo turned a brick house into a multifunctional home",
  "author": "Anna-Lena Reith",
  "published": "Sat, 14 Jun 2025 12:00:00 +0000",
  "source": "https://www.architecturaldigest.com/feed/rss",
  "categories": [
    "Architecture + Design",
    "Home Tour"
  ],
  "byline": "Anna-Lena Reith, Stale Eriksen, Jasper Fry",
  "length": 7164,
  "excerpt": "Using bright colors and unexpected materials, an architectural duo turned a brick house into a multifunctional home",
  "siteName": "Architectural Digest",
  "favicon": "",
  "text": "One thing that you can rely on about life, regardless of whatever may happen? That it goes on. In constant change we find unexpected coincidences and memorable finds, which was the case for Tanya Grigoroglou and Rupert Worrall, the creative directors of the London art gallery Raw Editions. In 2019, they came upon a London row house—in their favorite neighborhood, Clapham, nonetheless. As is typical for this part of the city, it was a Victorian terraced house, just over 1500 square feet, with a tall brick façade. Cool and dark, it had hardly any natural light.Grigoroglou and Worrall wanted their home to combine living and work spaces in the best possible way, ideally merging the two seamlessly. Their ideal home would make everyday family life with children easy while allowing them to exhibit the postmodern and contemporary works that are Raw Editions’ focus. This is where the architects O’Sullivan Skoufoglou enter the story. With a keen sense for creating flexible spaces and using a variety of materials, colors, and designer pieces, the London firm, founded in 2016, were able to create a hybrid, multifunctional house where life and work go hand in hand in a remarkably balanced way.Tanya Grigoroglou and Rupert Worrall run the London art gallery Raw Editions—now, largely, from the comfort of their own home. How the architects got to workDynamic, creative, flexible, multifunctional—these were adjectives that O’Sullivan Skoufoglou’s clients used when describing the house they wanted the firm to create for them. It should combine a gallery and a home, family life with a passion for art. This also had to be accomplished largely within the Victorian’s existing footprint, which presented another challenge (extending the building would be costly given the garden’s different height). It quickly became clear to O’Sullivan Skoufoglou that the floor plan would have to be changed to improve the home’s circulation, light, and functionality. The windows would also need to be repositioned.The architects wanted to create distinct spaces while preserving a sense of openness. For example, the nearby study is also fitted with sliding doors, and the newly designed staircase separates the upper floors from the gallery space at ground level. It provides both a necessary separation and a smooth transition at once. “The conversion of the two lower floors and the relocation of the kitchen to the basement was perhaps the most important change to the design concept,” says Amalia Skoufoglou. The new entrance now leads into the gallery area, where floor-to-ceiling windows provide a view of the garden, and sliding doors add the potential for privacy.The study has an oak floor and a view of the garden. The highlight of this space, however, is the red Granby Rock terrazzo strip in the wall. Designed to be the perfect backdrop for the art, the accent ends at the fireplace and is made from 70 percent recycled aggregates. Delicate shades of pink and yellow from Little Greene on the walls nearby enhance its warming effect, as do the furniture’s olive and rust brown tones.By staggering the windows, O’Sullivan Skoufoglou have provided the interior of the home with considerably more natural light. The architects also did a masterful job at creating hidden storage space. Built-in cupboards in pastel shades and a low bench in the dining area double as storage, offering plenty of space for the many items that a family with children accumulates. “We design and create storage space so that it naturally corresponds to the room’s function,” the architects say.Living room and gallery in one: This is one space where Grigoroglou and Worrall exhibit works by artists they represent, along with other pieces. The lamp is by Established and Sons, the oak floor was laid by Chaunceys. Sliding doors allow the creation of separate private spaces at times but also an open circulation at other moments. A palette of pastels: The soft shades of yellow, pink, green, and blue on the walls create a warm atmosphere. A harmonious and colorful mix of materialsThe terrazzo is not the only visually strong material in the row house. A wide variety of surfaces and textures come together to create an exciting mix—one that may not come to mind immediately, but definitely works in practice. “We were interested in robust but also playful materials that could be combined with a reduced, restrained aesthetic designed for the display of art works,” says Skoufoglou. “We experimented a lot with materials to find the ideal combinations with the brick façade.”If you take the aforementioned stairs down from the first floor, you’ll find what is arguably the richest material area of the house: a corridor here leads to the garden, where flamed granite from Portugal was used for the paving. Back inside, in the kitchen and dining area, the same granite tiles were used, albeit a polished version complemented by additional EPD-certified green terrazzo tiles. The mix of materials and colors reaches its peak in the kitchen, where a marble backsplash and worktop are paired with kitchen cabinets in baby blue from Denmark-based Brouns \u0026 Co. The pendant light by Muller Van Severen provides a touch of green, and the dining table is also by the Belgian design duo. The chairs are designs by Arne Jacobsen, reissued by Fritz Hansen. This space centers of family life, as a gathering spot in the evenings.Material-rich and colorful: Wood and marble meet in the kitchen, along with various shades of blue. The pendant light from Muller Van Severen provides a green accent. The combination of calm, muted aesthetics and colorful accents reflects Grigoroglou and Worrall’s aesthetics, and specifically their aspirations at Raw Editions. The couple explains that they love that contemporary art can be expressive and loud, but also restrained and quiet. So how does someone choose the right colors for their home when they are passionate about colors? “We carried out color tests on site until we finally agreed on the right hues,” explain O’Sullivan Skoufoglou. “It also depends a lot on the light, the orientation of the room, and what it is used for. But you should always remember that you can always change the color later if you decide that you made a mistake.” But that’s not necessary here—the family has had no second doubts about the tomato red fixtures, the dark red downpipe on the brick façade, or any other choices, from bright accents to pastel backdrops.Eye-catching kitchen fittings in a bright orange-red stand out against the marble and birch cabinets. The tiles in rust brown and soft pink are from Topcer Tiles. After the architects moved the location of windows on the facade, natural light now penetrates the interior of the brick building. This project illustrates how to live with art according to its owners, gallerists Tanya Grigoroglou and Rupert Worrall. The architects fitted the four bedrooms with stylish built-in wardrobes that offer plenty of storage space. The typical Victorian house with brick facade in Clapham has a whimsical accent in the form of a red downpipe. This London row house project was originally published in AD Germany.",
  "image": "https://media.architecturaldigest.com/photos/68486b65c0605a070944121f/16:9/w_1280,c_limit/RAW-Editions_Tanya_Rupert_Portraits_%C2%A9Jasper_Fry_Web-Res_4.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-testid=\"ArticlePageChunks\"\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eOne thing that you can rely on about life, regardless of whatever may happen? That it goes on. In constant change we find unexpected coincidences and memorable finds, which was the case for Tanya Grigoroglou and Rupert Worrall, the creative directors of the \u003ca href=\"https://www.architecturaldigest.com/topic/london\" target=\"_blank\"\u003eLondon\u003c/a\u003e art gallery \u003ca data-offer-url=\"https://raweditions.com/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://raweditions.com/\u0026#34;}\" href=\"https://raweditions.com/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eRaw Editions\u003c/a\u003e. In 2019, they came upon a London row house—in their favorite neighborhood, Clapham, nonetheless. As is typical for this part of the city, it was a Victorian terraced house, just over 1500 square feet, with a tall brick façade. Cool and dark, it had hardly any natural light.\u003c/p\u003e\u003cp\u003eGrigoroglou and Worrall wanted their home to combine living and work spaces in the best possible way, ideally merging the two seamlessly. Their ideal home would make everyday family life with children easy while allowing them to exhibit the postmodern and contemporary works that are Raw Editions’ focus. This is where the architects \u003ca data-offer-url=\"https://www.osullivanskoufoglou.com/\" data-event-click=\"{\u0026#34;element\u0026#34;:\u0026#34;ExternalLink\u0026#34;,\u0026#34;outgoingURL\u0026#34;:\u0026#34;https://www.osullivanskoufoglou.com/\u0026#34;}\" href=\"https://www.osullivanskoufoglou.com/\" rel=\"nofollow noopener\" target=\"_blank\"\u003eO’Sullivan Skoufoglou\u003c/a\u003e enter the story. With a keen sense for creating flexible spaces and using a variety of materials, colors, and designer pieces, the London firm, founded in 2016, were able to create a hybrid, multifunctional house where life and work go hand in hand in a remarkably balanced way.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eTanya Grigoroglou and Rupert Worrall run the London art gallery Raw Editions—now, largely, from the comfort of their own home.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003ch2\u003eHow the architects got to work\u003c/h2\u003e\u003cp\u003eDynamic, creative, flexible, multifunctional—these were adjectives that O’Sullivan Skoufoglou’s clients used when describing the house they wanted the firm to create for them. It should combine a gallery and a home, family life with a passion for art. This also had to be accomplished largely within the Victorian’s existing footprint, which presented another challenge (extending the building would be costly given the garden’s different height). It quickly became clear to O’Sullivan Skoufoglou that the floor plan would have to be changed to improve the home’s circulation, light, and functionality. The windows would also need to be repositioned.\u003c/p\u003e\u003cp\u003eThe architects wanted to create distinct spaces while preserving a sense of openness. For example, the nearby study is also fitted with sliding doors, and the newly designed staircase separates the upper floors from the gallery space at ground level. It provides both a necessary separation and a smooth transition at once. “The conversion of the two lower floors and the relocation of the kitchen to the basement was perhaps the most important change to the design concept,” says Amalia Skoufoglou. The new entrance now leads into the gallery area, where floor-to-ceiling windows provide a view of the garden, and sliding doors add the potential for privacy.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe study has an oak floor and a view of the garden.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eThe highlight of this space, however, is the red Granby Rock terrazzo strip in the wall. Designed to be the perfect backdrop for the art, the accent ends at the fireplace and is made from 70 percent recycled aggregates. Delicate shades of pink and yellow from Little Greene on the walls nearby enhance its warming effect, as do the furniture’s olive and rust brown tones.\u003c/p\u003e\u003cp\u003eBy staggering the windows, O’Sullivan Skoufoglou have provided the interior of the home with considerably more natural light. The architects also did a masterful job at creating hidden storage space. Built-in cupboards in pastel shades and a low bench in the dining area double as storage, offering plenty of space for the many items that a family with children accumulates. “We design and create storage space so that it naturally corresponds to the room’s function,” the architects say.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eLiving room and gallery in one: This is one space where Grigoroglou and Worrall exhibit works by artists they represent, along with other pieces. The lamp is by Established and Sons, the oak floor was laid by Chaunceys.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eSliding doors allow the creation of separate private spaces at times but also an open circulation at other moments.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eA palette of pastels: The soft shades of yellow, pink, green, and blue on the walls create a warm atmosphere.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003ch2\u003eA harmonious and colorful mix of materials\u003c/h2\u003e\u003cp\u003eThe terrazzo is not the only visually strong material in the row house. A wide variety of surfaces and textures come together to create an exciting mix—one that may not come to mind immediately, but definitely works in practice. “We were interested in robust but also playful materials that could be combined with a reduced, restrained aesthetic designed for the display of art works,” says Skoufoglou. “We experimented a lot with materials to find the ideal combinations with the brick façade.”\u003c/p\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cp\u003eIf you take the aforementioned stairs down from the first floor, you’ll find what is arguably the richest material area of the house: a corridor here leads to the garden, where flamed granite from Portugal was used for the paving. Back inside, in the kitchen and dining area, the same granite tiles were used, albeit a polished version complemented by additional EPD-certified green terrazzo tiles. The mix of materials and colors reaches its peak in the kitchen, where a marble backsplash and worktop are paired with kitchen cabinets in baby blue from Denmark-based Brouns \u0026amp; Co. The pendant light by Muller Van Severen provides a touch of green, and the dining table is also by the Belgian design duo. The chairs are designs by Arne Jacobsen, reissued by Fritz Hansen. This space centers of family life, as a gathering spot in the evenings.\u003c/p\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eMaterial-rich and colorful: Wood and marble meet in the kitchen, along with various shades of blue. The pendant light from Muller Van Severen provides a green accent.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003eThe combination of calm, muted aesthetics and colorful accents reflects Grigoroglou and Worrall’s aesthetics, and specifically their aspirations at Raw Editions. The couple explains that they love that contemporary art can be expressive and loud, but also restrained and quiet. So how does someone choose the right colors for their home when they are passionate about colors? “We carried out color tests on site until we finally agreed on the right hues,” explain O’Sullivan Skoufoglou. “It also depends a lot on the light, the orientation of the room, and what it is used for. But you should always remember that you can always change the color later if you decide that you made a mistake.” But that’s not necessary here—the family has had no second doubts about the tomato red fixtures, the dark red downpipe on the brick façade, or any other choices, from bright accents to pastel backdrops.\u003c/p\u003e\u003cdiv data-testid=\"GroupCalloutWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eEye-catching kitchen fittings in a bright orange-red stand out against the marble and birch cabinets.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe tiles in rust brown and soft pink are from Topcer Tiles.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eAfter the architects moved the location of windows on the facade, natural light now penetrates the interior of the brick building.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003c/div\u003e\u003cdiv data-journey-hook=\"client-content\" data-testid=\"BodyWrapper\"\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThis project illustrates how to live with art according to its owners, gallerists Tanya Grigoroglou and Rupert Worrall.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe architects fitted the four bedrooms with stylish built-in wardrobes that offer plenty of storage space.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cfigure\u003e\u003cp\u003e\u003cspan\u003e\u003cp\u003eThe typical Victorian house with brick facade in Clapham has a whimsical accent in the form of a red downpipe.\u003c/p\u003e\n\u003c/span\u003e\u003c/p\u003e\u003c/figure\u003e\u003cp\u003e\u003cem\u003eThis London row house project was originally published in\u003c/em\u003e AD Germany.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-14T08:00:00-04:00",
  "modifiedTime": "2025-06-14T12:00:00Z"
}
