{
  "id": "bcabac8e-f184-4d01-9b8d-753a5e4b5f08",
  "title": "Los Angeles Business Council’s 54th Architectural Awards honors design projects that celebrate the city’s creative legacy and foster community life",
  "link": "https://www.archpaper.com/2024/10/los-angeles-business-councils-54th-architectural-awards/",
  "description": "The Los Angeles Business Council (LABC) recently announced the winners of its 54th Architectural Awards, celebrating designs that preserve and advance the city’s legacy as a creative capital and foster The post Los Angeles Business Council’s 54th Architectural Awards honors design projects that celebrate the city’s creative legacy and foster community life appeared first on The Architect’s Newspaper.",
  "author": "Paige Davidson",
  "published": "Fri, 25 Oct 2024 20:59:32 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Buzz",
    "Buzz: Announcements",
    "Buzz: West"
  ],
  "byline": "Los Angeles Business Council",
  "length": 5172,
  "excerpt": "The Los Angeles Business Council (LABC) recently announced the winners of its 54th Architectural Awards, celebrating designs that preserve and advance the city’s legacy as a creative capital and foster vibrant, inclusive community life.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "The Los Angeles Business Council (LABC) recently announced the winners of its 54th Architectural Awards, celebrating designs that preserve and advance the city’s legacy as a creative capital and foster vibrant, inclusive community life. Some four dozen innovative projects were recognized, with the Grand Prize going to the Netflix Egyptian Theatre, the Economic Community Impact Award going to companies that are building and modernizing sound stages, and the Chairman’s Award going to new parks across the county.  “This year the LABC is honoring projects whose inspired designs build on L.A.’s heritage and move the city toward a dynamic future, said Mary Leslie, president of the Los Angeles Business Council. “From renewing entertainment venues and creative workspaces to reimagining parks, schools and housing, our honorees exemplify the power of architecture to serve the public good, foster progress, and build community.”  Over 450 leading architects, designers, building owners, developers and city and state officials attended the awards ceremony at the Beverly Hilton Hotel. Winners from a pool of hundreds were selected by a jury panel of industry experts, including architects, construction firms, owners and developers.  (Courtesy LABC) Keynote speaker Annie Chu, founding principal and partner of award-winning architecture and interior firm Chu-Gooding received the Legacy Award. In her four decades in practice, Chu has worked extensively with world-renowned museums and cultural and educational institutions. She champions interior architecture as a distinct and emerging discipline, advancing design excellence through teaching, public speaking, and civic leadership, including serving on the City of Los Angeles Cultural Affairs Commission and the Mayor’s Design Advisory Panel.  “I am deeply grateful and humbled by this great honor,” said Annie Chu. “Throughout my career, I have been motivated not just by the pursuit of architecture excellence as both art and service, but also by the higher calling of architecture to create spaces that lift our spirits and resonate with our values.”  The Grand Prize-winning Netflix Egyptian Theatre in Hollywood does just that thanks to a painstaking restoration that married technology, history, and art. Opened in 1922, the Egyptian hosted the world’s first movie premiere, introduced the red carpet, and became an icon of Hollywood’s Golden Age. Later declared a historical landmark, the venue fell into disrepair until the American Cinematheque renovated and reopened it in 1998.  (Courtesy LABC) In 2020, Netflix purchased the Egyptian and partnered with the American Cinematheque to rehabilitate it again, this time to restore the theater’s original design and grandeur, retrofit the building’s structure, and install state-of-the-art projection and audio technology. Studio 440 Architecture and Gensler led the design and contracted EverGreene Architectural Arts for the two-year project, which involved restoring historic color palettes and decorative motifs. The Egyptian reopened in late 2023.  “The restored Netflix Egyptian Theatre exquisitely evokes the origins and history of Hollywood as well as the enormous creativity and innovation that will extend L.A.’s global leadership in entertainment,” said Ross Brennan of Studio 440. “We’re honored to accept this year’s LABC Grand Prize for architecture and look forward to ever more moviegoers experiencing this world-class venue for themselves.”  The LABC similarly recognized the centrality of entertainment to Los Angeles’s long-term growth by conferring the Economic Community Impact Award to eight projects which invest in sound stages throughout greater L.A. About 155 new and upgraded facilities are in the development pipeline, potentially increasing local production space by 35 percent and supporting tens of thousands of jobs, including writers, actors, set designers, and skilled tradespeople who form the backbone of the creative content market. (Courtesy LABC) Three urban parks won the prestigious Chairman’s Award, underscoring the importance of remediating and designating vacant land for community benefit. The 8.5-acre Wishing Tree Park in West Carson, designed by landscape architects MIG, opened in May after more than 30 years of advocacy to transform a former superfund site into the underserved area’s first park. The Port of Los Angeles Wilmington Waterfront Promenade, designed by Sasaki and Studio MLA, is a landmark park amid the industrial landscape of the busy San Pedro Bay ports. And the George Wolfberg Park at Potrero Canyon stabilized and restored the natural habitat on 46 acres in the Pacific Palisades. The City of L.A.’s architectural and geotechnical engineering divisions collaborated with Marrs Services to design the park.  “These exemplary projects,” said LABC Chair David Nahai, “reflect the bold vision and determined teamwork of residents, civic organizations, and government leaders to enhance their communities by creating vibrant greenspaces.”  For a full list of winners and photos of this year’s winning projects, please visit the Los Angeles Business Council website at labusinesscouncil.org.",
  "image": "https://www.archpaper.com/wp-content/uploads/2023/09/5D4_9929.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n            \u003cp\u003eThe Los Angeles Business Council (\u003ca href=\"https://labusinesscouncil.org/\"\u003eLABC\u003c/a\u003e) recently announced the winners of its \u003ca href=\"https://labusinesscouncil.org/54th-architectural-awards/\"\u003e54th Architectural Awards\u003c/a\u003e, celebrating designs that preserve and advance the city’s legacy as a creative capital and foster vibrant, inclusive community life. Some four dozen innovative projects were recognized, with the Grand Prize going to the Netflix Egyptian Theatre, the Economic Community Impact Award going to companies that are building and modernizing sound stages, and the Chairman’s Award going to new parks across the county.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e“This year the LABC is honoring projects whose inspired designs build on L.A.’s heritage and move the city toward a dynamic future, said Mary Leslie, president of the Los Angeles Business Council. “From renewing entertainment venues and creative workspaces to reimagining parks, schools and housing, our honorees exemplify the power of architecture to serve the public good, foster progress, and build community.”\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eOver 450 leading architects, designers, building owners, developers and city and state officials attended the awards ceremony at the Beverly Hilton Hotel. Winners from a pool of hundreds were selected by a jury panel of industry experts, including architects, construction firms, owners and developers.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_385356\" aria-describedby=\"caption-attachment-385356\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2023/09/6.jpg\" alt=\"Photograph of Netflix Egyptian Theatre from the view of the stage.\" width=\"2000\"/\u003e\u003cfigcaption id=\"caption-attachment-385356\"\u003e(Courtesy LABC)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eKeynote speaker Annie Chu, founding principal and partner of award-winning architecture and interior firm Chu-Gooding received the Legacy Award. In her four decades in practice, Chu has worked extensively with world-renowned museums and cultural and educational institutions. She champions interior architecture as a distinct and emerging discipline, advancing design excellence through teaching, public speaking, and civic leadership, including serving on the City of Los Angeles Cultural Affairs Commission and the Mayor’s Design Advisory Panel.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e“I am deeply grateful and humbled by this great honor,” said Annie Chu. “Throughout my career, I have been motivated not just by the pursuit of architecture excellence as both art and service, but also by the higher calling of architecture to create spaces that lift our spirits and resonate with our values.”\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe Grand Prize-winning Netflix Egyptian Theatre in Hollywood does just that thanks to a painstaking restoration that married technology, history, and art. Opened in 1922, the Egyptian\u003cspan\u003e \u003c/span\u003ehosted the world’s first movie premiere, introduced the red carpet, and became an icon of Hollywood’s Golden Age. Later declared a historical landmark, the venue fell into disrepair until the American Cinematheque renovated and reopened it in 1998.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cfigure id=\"attachment_385355\" aria-describedby=\"caption-attachment-385355\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2023/09/5D4_9954.jpg\" alt=\"Ornate details on the ceiling of the Netflix Egyptian Theatre, the project was recognized by the Los Angeles Business Council\" width=\"2000\" height=\"1333\"/\u003e\u003cfigcaption id=\"caption-attachment-385355\"\u003e(Courtesy LABC)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eIn 2020, Netflix purchased the Egyptian and partnered with the American Cinematheque to rehabilitate it again, this time to restore the theater’s original design and grandeur, retrofit the building’s structure, and install state-of-the-art projection and audio technology. Studio 440 Architecture and Gensler led the design and contracted EverGreene Architectural Arts for the two-year project, which involved restoring historic color palettes and decorative motifs. The Egyptian reopened in late 2023.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\n\u003cp\u003e“The restored Netflix Egyptian Theatre exquisitely evokes the origins and history of Hollywood as well as the enormous creativity and innovation that will extend L.A.’s global leadership in entertainment,” said Ross Brennan of Studio 440. “We’re honored to accept this year’s LABC Grand Prize for architecture and look forward to ever more moviegoers experiencing this world-class venue for themselves.”\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eThe LABC similarly recognized the centrality of entertainment to Los Angeles’s long-term growth by conferring the Economic Community Impact Award to eight projects which invest in sound stages throughout greater L.A. About 155 new and upgraded facilities are in the development pipeline, potentially increasing local production space by 35 percent and supporting tens of thousands of jobs, including writers, actors, set designers, and skilled tradespeople who form the backbone of the creative content market.\u003c/p\u003e\n\u003cfigure id=\"attachment_385357\" aria-describedby=\"caption-attachment-385357\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2023/09/8.jpg\" alt=\"Construction photograph during the renovation of Netflix Egyptian Theatre.\" width=\"1500\"/\u003e\u003cfigcaption id=\"caption-attachment-385357\"\u003e(Courtesy LABC)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eThree urban parks won the prestigious Chairman’s Award, underscoring the importance of remediating and designating vacant land for community benefit. The 8.5-acre Wishing Tree Park in West Carson, designed by landscape architects MIG, opened in May after more than 30 years of advocacy to transform a former superfund site into the underserved area’s first park. The Port of Los Angeles Wilmington Waterfront Promenade, designed by Sasaki and Studio MLA, is a landmark park amid the industrial landscape of the busy San Pedro Bay ports. And the George Wolfberg Park at Potrero Canyon stabilized and restored the natural habitat on 46 acres in the Pacific Palisades. The City of L.A.’s architectural and geotechnical engineering divisions collaborated with Marrs Services to design the park.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e“These exemplary projects,” said LABC Chair David Nahai, “reflect the bold vision and determined teamwork of residents, civic organizations, and government leaders to enhance their communities by creating vibrant greenspaces.”\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003eFor a full list of winners and photos of this year’s winning projects, please visit the Los Angeles\u003cspan\u003e \u003c/span\u003eBusiness Council website at \u003ca href=\"https://labusinesscouncil.org/\"\u003e\u003cspan\u003elabusinesscouncil.org\u003c/span\u003e\u003c/a\u003e.\u003cspan\u003e \u003c/span\u003e\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-10-25T20:59:32Z",
  "modifiedTime": null
}
