{
  "id": "d2a1bbb9-edf3-45b8-8b70-892e2cdbd52d",
  "title": "Liquid Landscapes: 7 Chinese Projects Where Architecture Is Shaped by Water",
  "link": "https://architizer.com/blog/inspiration/collections/liquid-landscapes-chinese-architecture-shaped-by-water/",
  "description": "Water isn't just a backdrop — these projects use water features to enhance light, space and atmosphere in breathtaking ways. The post Liquid Landscapes: 7 Chinese Projects Where Architecture Is Shaped by Water appeared first on Journal.",
  "author": "Serra Utkum Ikiz",
  "published": "Tue, 18 Mar 2025 12:01:22 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Collections",
    "Inspiration"
  ],
  "byline": "Serra Utkum Ikiz",
  "length": 6332,
  "excerpt": "Water isn't just a backdrop — these projects use liquid landscapes and features to enhance light, space, and atmosphere in breathtaking ways.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "The countdown to 13th Annual A+Awards  winners' announcement has begun! Stay updated by subscribing to Architizer's Awards Newsletter. Liquid landscapes have the ability to calm our minds in the rush of modern cities. It also creates a deep sense of peace and balance in our lives. Throughout history, the various connections between water and the human experience have inspired various architectural projects, particularly throughout China, where water bodies are often celebrated as an important element of design. The thoughtful integration and connection of liquid landscapes into architecture, whether it manifests through pools, carefully placed riverside structures or forms inspired by the fluidity of water itself, serve not only to enhance the aesthetic beauty of public and private spaces but also to develop a relaxing environment that can comfort the soul of everyone who experiences it. From the riversides to the dynamic urban environments of China, we invite you to explore eight Chinese projects where architecture is shaped by water. Each of these designs incorporates beautiful water landscapes, showcasing the transformative power of water in shaping our built environments and also influencing our experiences within them. Chengdu Science Fiction Museum By Zaha Hadid Architects, Chengdu, China The museum, located in Chengdu, a city surrounded by mountain ranges and forests, integrates with the natural landscapes along the lakeshore. Its design defines nodes of activity connected by pedestrian routes that extend from the city through the surrounding parkland into the heart of the building, creating a journey of discovery that weaves between indoor and outdoor plazas at multiple levels, linking the museum’s exhibition galleries, educational facilities, cafés and other amenities. Chengdu Tianfu Art Gallery By CSWADI, Chengdu, China The gallery, built-in 2021 in Chengdu, China, includes 13 specialised art exhibition halls to display modern pieces and works by local artists. The building also features art storage, educational rooms, a café, and an art shop. Situated on a peninsula surrounded by water on three sides, the architectural concept showcases a rectangular exhibition hall box supporting a massive curved overhanging roof that extends up to 30 metres. The exterior is characterised by a floating white roof, providing a sculptural appearance. The interior public spaces are adorned with bamboo shavings, creating a cave-like, flowing space and effectively shaping an iconic image for media dissemination. Nine Flow Riverside Art Mall By UUA (United Units Architects), Zhejiang, China The mall is located along the banks of the Jiuliudu River in the Jinghu New District of Shaoxing, Zhejiang Province, China. The architecture and landscaping feature fluid forms that respond to the winding urban layout characteristic of this popular water town in southeastern China. Positioned at the corner of the district and near the financial office area, the project faces the city’s administrative center and library, which are located directly across the river. As a result, the design emphasizes low density, low height, and ample landscaping in terms of building scale, positioning the mall as a medium-to-high-end commercial facility. Four-leaf Clover Hall By Yuanshe One Design, Luqiao District, Taizhou, China The hall, located south of the Yangtze River in Luqiao District, Tazhiou, China, is surrounded by forest and looks like a classical Chinese landscape painting. Built in 2023, the complex includes local stone materials and traditional wooden veneers as windows. It is covered with modern flowing steel roofs and transparent glass, creating a harmonious integration with the liquid landscapes around it. These local touches enable the countryside to accommodate modern new buildings while maintaining a deep connection with the natural environment. Yanzi Memorial Hall By Architectural Design and Research Institution of SCUT, Fengxian District, Shanghai, China The cultural exhibition hall, which serves multiple functions, is situated along the Yangtze River in the center of Fengxian District, Shanghai. The space includes museum exhibitions, teaching areas, and meeting rooms, as well as a cultural garden and an educational hall for citizens. The architectural details are simplified to create a space that emphasizes spatial aesthetics and humanistic care. To convey a sacred humanistic quality, the exhibition is crafted from white marble with an elegant ink texture. The white building and the black water pool combine to form a traditional Chinese painting depicting the Yanzi Memorial Hall nestled in the forest. Haikou Xixiu Park Visitor Center By MUDA-Architects, Haikou, China The Haikou Xixiu Park Visitor Center, completed in 2023, is located in Haikou, China, a coastal city in the southern part of the country. The visitor center is as a landmark within the park, embodying the area’s urban development while honoring its natural and cultural heritage. The structure is shaped like an oval pebble, symbolically positioned at the entrance to integrate with the surrounding landscape and emphasize the park’s natural beauty, creating a dialogue between the built environment and liquid landscapes. Inspired by local traditional roof forms, the design mirrors these elements to protect against the intense tropical climate of sunshine and heavy rainfall. Changsha International Conference Center By Architectural Design and Research Institution of SCUT, Changsha, China The Changsha International Conference Centre is located in the High-speed Railway New Town of Changsha City and covers a land area of approximately 212,700 square metres. It draws on traditional Chinese aesthetics and cultural symbols in an abstract manner. The centre strategically integrates natural, architectural, and cultural elements, such as the contours of mountains, traditional sloped roofs, and the pattern of unfolded Chinese folding fans. Additionally, the building’s façade is inspired by the techniques of Chinese landscape ink paintings and the dynamic scenery depicted in the local guqin masterpiece on the Xiao River and the Xiang River. The countdown to 13th Annual A+Awards  winners' announcement has begun! Stay updated by subscribing to Architizer's Awards Newsletter.",
  "image": "https://blog.architizer.com/wp-content/uploads/168239574459813直译建筑_Archi-Translator-1.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003e\u003cem\u003eThe countdown to\u003ca href=\"https://enter.architizer.com/?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003e 13th Annual A+Awards\u003c/a\u003e  winners\u0026#39; announcement has begun! Stay updated by subscribing to Architizer\u0026#39;s \u003ca href=\"https://awards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003eAwards Newsletter\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eLiquid landscapes have the ability to calm our minds in the rush of modern cities. It also creates a deep sense of peace and balance in our lives. Throughout history, the various connections between water and the human experience have inspired various architectural projects, particularly throughout China, where water bodies are often celebrated as an important element of design.\u003c/p\u003e\n\u003cp\u003eThe thoughtful integration and connection of liquid landscapes into architecture, whether it manifests through pools, carefully placed riverside structures or forms inspired by the fluidity of water itself, serve not only to enhance the aesthetic beauty of public and private spaces but also to develop a relaxing environment that can comfort the soul of everyone who experiences it.\u003c/p\u003e\n\u003cp\u003eFrom the riversides to the dynamic urban environments of \u003ca href=\"https://architizer.com/blog/inspiration/collections/best-architecture-firms-in-china/\" target=\"_blank\" rel=\"noopener\"\u003eChina\u003c/a\u003e, we invite you to explore eight Chinese projects where architecture is shaped by water. Each of these designs incorporates beautiful water landscapes, showcasing the transformative power of water in shaping our built environments and also influencing our experiences within them.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/chengdu-science-fiction-museum/\" target=\"_blank\" rel=\"noopener\"\u003eChengdu Science Fiction Museum \u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/zaha-hadid-architects/\" target=\"_blank\" rel=\"noopener\"\u003eZaha Hadid Architects,\u003c/a\u003e Chengdu, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/17139714202313__Arch-Exist_Photography.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"2000\" height=\"1499\"/\u003e\u003cimg decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/17139714406666__Arch-Exist_Photography.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"2000\" height=\"1333\"/\u003eThe museum, located in Chengdu, a city surrounded by mountain ranges and forests, integrates with the natural landscapes along the lakeshore. Its design defines nodes of activity connected by pedestrian routes that extend from the city through the surrounding parkland into the heart of the building, creating a journey of discovery that weaves between indoor and outdoor plazas at multiple levels, linking the museum’s exhibition galleries, educational facilities, cafés and other amenities.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/chengdu-tianfu-art-gallery/\" target=\"_blank\" rel=\"noopener\"\u003eChengdu Tianfu Art Gallery\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/cswadi-4/\" target=\"_blank\" rel=\"noopener\"\u003eCSWADI\u003c/a\u003e, Chengdu, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171392534847201%E9%A6%96%E5%9B%BE%E5%AD%98%E5%9C%A8%E5%BB%BA%E7%AD%91%E6%91%84%E5%BD%B1%E6%8B%8D%E6%91%84.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"8262\" height=\"4584\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171392538806608%E5%85%AC%E5%85%B1%E5%A4%A7%E5%8E%85%E8%A5%BF%E5%8D%97%E9%99%A2%E6%8B%8D%E6%91%84.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"4608\" height=\"3456\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe gallery, built-in 2021 in Chengdu, China, includes 13 specialised art exhibition halls to display modern pieces and works by local artists. The building also features art storage, educational rooms, a café, and an art shop. Situated on a peninsula surrounded by water on three sides, the architectural concept showcases a rectangular exhibition hall box supporting a massive curved overhanging roof that extends up to 30 metres. The exterior is characterised by a floating white roof, providing a sculptural appearance. The interior public spaces are adorned with bamboo shavings, creating a cave-like, flowing space and effectively shaping an iconic image for media dissemination.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/nine-flow-riverside-art-mall/\" target=\"_blank\" rel=\"noopener\"\u003eNine Flow Riverside Art Mall\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/united-units-architects/\" target=\"_blank\" rel=\"noopener\"\u003eUUA (United Units Architects)\u003c/a\u003e, Zhejiang, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171386106181902.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"2700\" height=\"1800\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171386106677403.jpg\" alt=\"water-inspired architecture, riverfront buildings, urban design, modern Chinese architecture, tranquil environments, architectural aesthetics, public spaces, innovative structures, landscape and architecture, iconic projects\" width=\"2700\" height=\"1800\"/\u003eThe mall is located along the banks of the Jiuliudu River in the Jinghu New District of Shaoxing, Zhejiang Province, China. The architecture and landscaping feature fluid forms that respond to the winding urban layout characteristic of this popular water town in southeastern China. Positioned at the corner of the district and near the financial office area, the project faces the city’s administrative center and library, which are located directly across the river. As a result, the design emphasizes low density, low height, and ample landscaping in terms of building scale, positioning the mall as a medium-to-high-end commercial facility.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/four-leaf-clover-hall/\" target=\"_blank\" rel=\"noopener\"\u003eFour-leaf Clover Hall\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/yuanshe-one-design/\" target=\"_blank\" rel=\"noopener\"\u003eYuanshe One Design\u003c/a\u003e, Luqiao District, Taizhou, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/1713840913797%E5%9B%BE8.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces, Liquid landscapes\" width=\"5464\" height=\"3640\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/1713841051198%E5%9B%BE10.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces, Liquid landscapes\" width=\"8192\" height=\"5464\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe hall, located south of the Yangtze River in Luqiao District, Tazhiou, China, is surrounded by forest and looks like a classical Chinese landscape painting. Built in 2023, the complex includes local stone materials and traditional wooden veneers as windows. It is covered with modern flowing steel roofs and transparent glass, creating a harmonious integration with the liquid landscapes around it. These local touches enable the countryside to accommodate modern new buildings while maintaining a deep connection with the natural environment.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/yanzi-memorial-hall/\" target=\"_blank\" rel=\"noopener\"\u003eYanzi Memorial Hall\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/architectural-design-and-research-institution-of-scut/\" target=\"_blank\" rel=\"noopener\"\u003eArchitectural Design and Research Institution of SCUT\u003c/a\u003e, Fengxian District, Shanghai, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/170023920049513-%E6%9D%A8%E6%BB%A1%E6%80%9D.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces, Liquid landscapes\" width=\"7952\" height=\"4347\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/170023922657129_-%E9%82%B9%E6%9E%97.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces, Liquid landscapes\" width=\"8050\" height=\"5367\"/\u003eThe cultural exhibition hall, which serves multiple functions, is situated along the Yangtze River in the center of Fengxian District, Shanghai. The space includes museum exhibitions, teaching areas, and meeting rooms, as well as a cultural garden and an educational hall for citizens. The architectural details are simplified to create a space that emphasizes spatial aesthetics and humanistic care. To convey a sacred humanistic quality, the exhibition is crafted from white marble with an elegant ink texture. The white building and the black water pool combine to form a traditional Chinese painting depicting the Yanzi Memorial Hall nestled in the forest.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/haikou-west-coast-southern-park-visitor-center/\" target=\"_blank\" rel=\"noopener\"\u003eHaikou Xixiu Park Visitor Center\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/muda-architects/\" target=\"_blank\" rel=\"noopener\"\u003eMUDA-Architects\u003c/a\u003e, Haikou, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/168239574396511%E7%9B%B4%E8%AF%91%E5%BB%BA%E7%AD%91_Archi-Translator.jpg\" alt=\"Liquid landscapes\" width=\"2500\" height=\"1668\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/16823957335072%E7%9B%B4%E8%AF%91%E5%BB%BA%E7%AD%91Archi-Translator.jpg\" width=\"2880\" height=\"1921\"/\u003e\u003c/p\u003e\n\u003cp\u003eThe Haikou Xixiu Park Visitor Center, completed in 2023, is located in Haikou, China, a coastal city in the southern part of the country. The visitor center is as a landmark within the park, embodying the area’s urban development while honoring its natural and cultural heritage. The structure is shaped like an oval pebble, symbolically positioned at the entrance to integrate with the surrounding landscape and emphasize the park’s natural beauty, creating a dialogue between the built environment and liquid landscapes. Inspired by local traditional roof forms, the design mirrors these elements to protect against the intense tropical climate of sunshine and heavy rainfall.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch3\u003e\u003ca href=\"https://architizer.com/projects/changsha-international-conference-center/\" target=\"_blank\" rel=\"noopener\"\u003eChangsha International Conference Center\u003c/a\u003e\u003c/h3\u003e\n\u003ch4\u003eBy \u003ca href=\"https://architizer.com/firms/architectural-design-and-research-institution-of-scut/\" target=\"_blank\" rel=\"noopener\"\u003eArchitectural Design and Research Institution of SCUT\u003c/a\u003e, Changsha, China\u003c/h4\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171410086099613_Waterfront_West_facade__Yao_Li.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces\" width=\"2000\" height=\"1235\"/\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://architizer-prod.imgix.net/media/mediadata/uploads/171410089201803_Aerial_view_of_the_southwest_square__Yao_Li.jpg\" alt=\"water landscapes, architectural design, urban water features, Chinese architecture, landscape integration, waterfront projects, sustainable design, natural elements in architecture, contemporary architecture, cultural spaces\" width=\"2000\" height=\"975\"/\u003eThe Changsha International Conference Centre is located in the High-speed Railway New Town of Changsha City and covers a land area of approximately 212,700 square metres. It draws on traditional Chinese aesthetics and cultural symbols in an abstract manner. The centre strategically integrates natural, architectural, and cultural elements, such as the contours of mountains, traditional sloped roofs, and the pattern of unfolded Chinese folding fans. Additionally, the building’s façade is inspired by the techniques of Chinese landscape ink paintings and the dynamic scenery depicted in the local guqin masterpiece on the Xiao River and the Xiang River.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe countdown to\u003ca href=\"https://enter.architizer.com/?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003e 13th Annual A+Awards\u003c/a\u003e  winners\u0026#39; announcement has begun! Stay updated by subscribing to Architizer\u0026#39;s \u003ca href=\"https://awards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003eAwards Newsletter\u003c/a\u003e.\u003c/em\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-03-18T12:01:22Z",
  "modifiedTime": "2025-03-17T15:20:49Z"
}
