{
  "id": "d799a138-1a49-4d1e-b6c5-63cb69f130ac",
  "title": "Architects Who Draw: The Vision Awards Jury for 2025",
  "link": "https://architizer.com/blog/inside-architizer/updates/architects-who-draw-vision-awards-jury/",
  "description": "This year’s jury elevates the overlooked power of architectural illustration, sketch, and watercolor in shaping design discourse. The post Architects Who Draw: The Vision Awards Jury for 2025 appeared first on Journal.",
  "author": "Architizer Editors",
  "published": "Mon, 14 Jul 2025 15:01:04 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Competitions",
    "Inside Architizer",
    "Updates",
    "Awards",
    "Vision Awards"
  ],
  "byline": "Architizer Editors",
  "length": 7684,
  "excerpt": "This year’s jury elevates the overlooked power of architectural illustration, sketch, and watercolor in shaping design discourse.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "Drawing lies at the heart of architecture — not only as a technical tool, but as a vehicle for ideas, atmosphere, and speculation. The 2025 Architizer Vision Awards jury celebrates that power, assembling a cohort of celebrated architects, illustrators and educators who have each forged a distinct visual language. From conceptual sketching to narrative-driven renderings, their work reminds us that the hand — whether digital, analog or somewhere in between — remains essential in shaping how we imagine space. Through decades of practice and pedagogy, these jurors have helped elevate drawing as a standalone architectural act. They will help select the most compelling visual entries in the 2025 Architizer Vision Awards — works that transcend convention and reveal the poetic, political and personal dimensions of design. Start Vision Award Entry Steven Holl Founding Principal of Steven Holl Architects Steven Holl was born in 1947 in Bremerton, Washington. He graduated from the University of Washington and pursued architecture studies in Rome in 1970. In 1976, he joined the Architectural Association in London and in 1977 established STEVEN HOLL ARCHITECTS. Considered one of America’s most influential architects, he is recognized for his ability to blend space and light with great contextual sensitivity and to utilize the unique qualities of each project to create a concept-driven design. He specializes in seamlessly integrating new projects into contexts with particular cultural and historic importance. Steven Holl has realized projects both in the United States and internationally. He has received the 2016 VELUX Daylight Award in Architecture, the 2014 Praemium Imperiale International Arts Award for Architecture, the 2012 AIA Gold Medal, the 2010 RIBA Jencks Award, and the first ever Arts Award of the BBVA Foundation Frontiers of Knowledge Awards in 2009. Steven Holl is a tenured Professor at Columbia University’s Graduate School of Architecture, Planning and Preservation. He has also taught at the University of Washington, Pratt Institute, and the University of Pennsylvania. Follow Steven Holl Architects on Instagram. Daniel Libeskind Founder and Principal Architect at Studio Libeskind Polish-American architect Daniel Libeskind is a globally recognized figure in architecture and urban design. Guided by a deep passion for music, philosophy, and literature, Libeskind creates architecture that is emotionally resonant, innovative, and sustainable. As Principal Design Architect of Studio Libeskind, he leads a multidisciplinary practice engaged in a wide range of projects worldwide. The studio’s portfolio includes museums, concert halls, convention centers, university campuses, hotels, shopping complexes, and residential towers. Libeskind is also a prominent voice in the field, frequently speaking at universities and professional conferences on the art and impact of architecture. His work and ideas have been featured in numerous exhibitions and publications, shaping contemporary architectural discourse and influencing the evolution of cities and cultural spaces. He has received numerous accolades for his contributions, including the Goethe Medal, the Hiroshima Peace Prize, the Dresden Peace Prize, and the European Union Prize for Civil Rights. Follow Studio Libeskind on Instagram. Sabina Blasiotti Creative Director of Sabi Space Sabina Blasiotti is a London-based architect with roots in Abruzzo, Italy, where she grew up. Sabina graduated from the Bartlett School of Architecture UCL and qualified with the Architectural Association AA in London. Before founding Sabi Space, she worked at Bjarke Ingels Group (BIG) in London and Kengo Kuma \u0026 Associates (KKAA) in Tokyo, contributing to major projects such as CityLife’s Portico in Milan and the Hoshino Resort in Yufuin. Her work at Sabi Space is a testament to her intuition, extensive research and passion for challenging norms to find new ways of living. Her most recent research delves into the role of radical imagination in design to shape innovations that unlock solutions to today’s challenges. Sabina’s work spans education, architecture, furniture design and illustration. She has received awards from Architizer, the RIBA and Azure Magazine, among others. Her work has been exhibited at the Salone del Mobile in Milan, the Royal Academy, the RIBA and Sir John’s Museum in London and published in Architizer, Metropolis, Axis Magazine and the RIBA Journal. Follow Sabina Blasiotti on Instagram. Dan Hogman Architect at SmithGroup As an architect, artist, and educator, Dan has developed the capacity to blend digital and traditional media in developing architectural concepts and has exhibited with the SFMOMA, the AIA, and numerous private galleries. Apart from his multidisciplinary design practice, Dan serves as faculty at the AAU San Francisco, where he teaches design and drawing studios. Follow Dan Hogman on Instagram. Thomas Schaller Artist at Schaller Architectural and Fine Arts Thomas W. Schaller is an internationally acclaimed artist, architect, and author based in New York City. In 2024 he was named the recipient of the Arthur Ross Award in Fine Arts by the Institute of Classical Art and Architecture, the 2024 Raphael Award, winner of the Ogden Pleissner Award by both the American Watercolor Society and the Salmagundi Art Club, and First Place Award winner in Watercolour International. A two-time winner of the prestigious Hugh Ferriss Memorial Prize, he also won the First Place Award in the Architizer One Drawing Competition. He is the author of three books, including the AIA Award-Winning Architecture in Watercolor. His latest, Architect of Light is published by Penguin Random House. His best-selling DVD, The Power of Design is published by Streamline Media. And his interactive online mentorship program “Design and the Power of Imagination” is hosted by Terracotta LLC. Tom is a signature member of many art groups around the world and is represented by Gallery 71 in New York City. Follow Thomas Schaller on Instagram. Natasha Sandmeier Assistant Adjunct Professor at UCLA Natasha Sandmeier is an educator and leads the postgraduate Entertainment Studio at UCLA Architecture \u0026 Urban Design, and is Program Director of the MS.AUD. Her academic work and research straddles the worlds of architecture and visual storytelling. She was the Executive Director of the A+D Museum, Los Angeles from 2022-24. She is the author and editor of Little Worlds (London, 2014); a monograph of projects and essays re-examining the role of the architect within contemporary architectural culture. Natasha is an architect (NL registered) and founding partner of Office UR (OUR). Bless Yee Project Architect at DLR Group Bless Yee was the Non-Student Grand Prize Winner of 2020’s One Drawing Challenge, and was one of the winners of Dezeen’s 2021 Redesign the World competition. She is an architect, artist, and educator based in Washington, D.C. Currently, Bless is an Project Architect in the Cultural \u0026 Performing Arts Sector at DLR Group and is an adjunct professor at Parsons the New School for Design. She has also worked at Snøhetta, Handel Architects, and Pei Cobb Freed \u0026 Partners. In her personal work she is developing methods of layering hand drawing and physical models with digital tools to depict compelling narratives of social issues. Follow Bless Yee on Instagram. From conceptual work to photographs and videos to drawings and more, Architizer's 2025 Vision Awards puts the spotlight on architectural representation. The clock is ticking — submit your work ahead of the Extended Entry Deadline on August 1st.  Start Vision Award Entry",
  "image": "https://blog.architizer.com/wp-content/uploads/architects-who-draw_2.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003eDrawing lies at the heart of architecture — not only as a technical tool, but as a vehicle for ideas, atmosphere, and speculation. The 2025 \u003ca href=\"https://visionawards.architizer.com/a/page/judging/jury?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003eArchitizer Vision Awards jury\u003c/a\u003e celebrates that power, assembling a cohort of celebrated architects, illustrators and educators who have each forged a distinct visual language. From conceptual sketching to narrative-driven renderings, their work reminds us that the hand — whether digital, analog or somewhere in between — remains essential in shaping how we imagine space.\u003c/p\u003e\n\u003cp\u003eThrough decades of practice and pedagogy, these jurors have helped elevate drawing as a standalone architectural act. They will help select the most compelling visual entries in the \u003ca href=\"https://visionawards.architizer.com/a/?utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003e2025 Architizer Vision Awards\u003c/a\u003e — works that transcend convention and reveal the poetic, political and personal dimensions of design.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://visionawards.architizer.com/a/organizations/main/submissions/submissionnotcompleted?solicitationId=24\u0026amp;utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eStart Vision Award Entry\u003c/a\u003e\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eSteven Holl\u003c/h2\u003e\n\u003ch3\u003eFounding Principal of \u003ca href=\"https://www.stevenholl.com/\" target=\"_blank\" rel=\"noopener\"\u003eSteven Holl Architects\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1.jpg\" alt=\"\" width=\"1707\" height=\"1707\" srcset=\"https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1.jpg 1707w, https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1-300x300.jpg 300w, https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1-1024x1024.jpg 1024w, https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1-150x150.jpg 150w, https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1-768x768.jpg 768w, https://blog.architizer.com/wp-content/uploads/Steven-Holl-c-Ramak-Fazel-BW-scaled-1-1536x1536.jpg 1536w\" sizes=\"(max-width: 1707px) 100vw, 1707px\"/\u003eSteven Holl was born in 1947 in Bremerton, Washington. He graduated from the University of Washington and pursued architecture studies in Rome in 1970. In 1976, he joined the Architectural Association in London and in 1977 established STEVEN HOLL ARCHITECTS. Considered one of America’s most influential architects, he is recognized for his ability to blend space and light with great contextual sensitivity and to utilize the unique qualities of each project to create a concept-driven design. He specializes in seamlessly integrating new projects into contexts with particular cultural and historic importance.\u003c/p\u003e\n\u003cp\u003eSteven Holl has realized projects both in the United States and internationally. He has received the 2016 VELUX Daylight Award in Architecture, the 2014 Praemium Imperiale International Arts Award for Architecture, the 2012 AIA Gold Medal, the 2010 RIBA Jencks Award, and the first ever Arts Award of the BBVA Foundation Frontiers of Knowledge Awards in 2009.\u003c/p\u003e\n\u003cp\u003eSteven Holl is a tenured Professor at Columbia University’s Graduate School of Architecture, Planning and Preservation. He has also taught at the University of Washington, Pratt Institute, and the University of Pennsylvania.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"https://www.instagram.com/stevenhollarchitects/\" target=\"_blank\" rel=\"noopener\"\u003eSteven Holl Architects\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eDaniel Libeskind\u003c/h2\u003e\n\u003ch3\u003eFounder and Principal Architect at \u003ca href=\"http://www.libeskind.com\" target=\"_blank\" rel=\"noopener\"\u003eStudio Libeskind\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw.jpg\" alt=\"\" width=\"2357\" height=\"2357\" srcset=\"https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw.jpg 2357w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-300x300.jpg 300w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-1024x1024.jpg 1024w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-150x150.jpg 150w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-768x768.jpg 768w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-1536x1536.jpg 1536w, https://blog.architizer.com/wp-content/uploads/Daniel-Libeskind-8_copyright_StefanRuiz_bw-2048x2048.jpg 2048w\" sizes=\"(max-width: 2357px) 100vw, 2357px\"/\u003ePolish-American architect Daniel Libeskind is a globally recognized figure in architecture and urban design. Guided by a deep passion for music, philosophy, and literature, Libeskind creates architecture that is emotionally resonant, innovative, and sustainable. As Principal Design Architect of Studio Libeskind, he leads a multidisciplinary practice engaged in a wide range of projects worldwide. The studio’s portfolio includes museums, concert halls, convention centers, university campuses, hotels, shopping complexes, and residential towers.\u003c/p\u003e\n\u003cp\u003eLibeskind is also a prominent voice in the field, frequently speaking at universities and professional conferences on the art and impact of architecture. His work and ideas have been featured in numerous exhibitions and publications, shaping contemporary architectural discourse and influencing the evolution of cities and cultural spaces. He has received numerous accolades for his contributions, including the Goethe Medal, the Hiroshima Peace Prize, the Dresden Peace Prize, and the European Union Prize for Civil Rights.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"https://www.instagram.com/daniellibeskind/\" target=\"_blank\" rel=\"noopener\"\u003eStudio Libeskind\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eSabina Blasiotti\u003c/h2\u003e\n\u003ch3\u003eCreative Director of \u003ca href=\"https://www.sabispace.com\" target=\"_blank\" rel=\"noopener\"\u003eSabi Space\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/Sabina_Portrait.jpg\" alt=\"\" width=\"2242\" height=\"2242\" srcset=\"https://blog.architizer.com/wp-content/uploads/Sabina_Portrait.jpg 2242w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-300x300.jpg 300w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-1024x1024.jpg 1024w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-150x150.jpg 150w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-768x768.jpg 768w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-1536x1536.jpg 1536w, https://blog.architizer.com/wp-content/uploads/Sabina_Portrait-2048x2048.jpg 2048w\" sizes=\"(max-width: 2242px) 100vw, 2242px\"/\u003eSabina Blasiotti is a London-based architect with roots in Abruzzo, Italy, where she grew up. Sabina graduated from the Bartlett School of Architecture UCL and qualified with the Architectural Association AA in London. Before founding Sabi Space, she worked at Bjarke Ingels Group (BIG) in London and Kengo Kuma \u0026amp; Associates (KKAA) in Tokyo, contributing to major projects such as CityLife’s Portico in Milan and the Hoshino Resort in Yufuin.\u003c/p\u003e\n\u003cp\u003eHer work at Sabi Space is a testament to her intuition, extensive research and passion for challenging norms to find new ways of living. Her most recent research delves into the role of radical imagination in design to shape innovations that unlock solutions to today’s challenges.\u003c/p\u003e\n\u003cp\u003eSabina’s work spans education, architecture, furniture design and illustration. She has received awards from Architizer, the RIBA and Azure Magazine, among others. Her work has been exhibited at the Salone del Mobile in Milan, the Royal Academy, the RIBA and Sir John’s Museum in London and published in Architizer, Metropolis, Axis Magazine and the RIBA Journal.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"https://www.instagram.com/sabina_blasiotti/\" target=\"_blank\" rel=\"noopener\"\u003eSabina Blasiotti\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eDan Hogman\u003c/h2\u003e\n\u003ch3\u003eArchitect at\u003ca href=\"https://www.smithgroup.com/\" target=\"_blank\" rel=\"noopener\"\u003e SmithGroup\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-scaled.jpeg\" alt=\"\" width=\"2560\" height=\"2560\" srcset=\"https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-scaled.jpeg 2560w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-300x300.jpeg 300w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-1024x1024.jpeg 1024w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-150x150.jpeg 150w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-768x768.jpeg 768w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-1536x1536.jpeg 1536w, https://blog.architizer.com/wp-content/uploads/202011_-_Dan_Hogman-1-2048x2048.jpeg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\"/\u003eAs an architect, artist, and educator, Dan has developed the capacity to blend digital and traditional media in developing architectural concepts and has exhibited with the SFMOMA, the AIA, and numerous private galleries. Apart from his multidisciplinary design practice, Dan serves as faculty at the AAU San Francisco, where he teaches design and drawing studios.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"https://www.instagram.com/danhogman/\" target=\"_blank\" rel=\"noopener\"\u003eDan Hogman\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eThomas Schaller\u003c/h2\u003e\n\u003ch3\u003eArtist at \u003ca href=\"https://www.thomaswschaller.com/\" target=\"_blank\" rel=\"noopener\"\u003eSchaller Architectural and Fine Arts\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014.jpg\" alt=\"\" width=\"2204\" height=\"2204\" srcset=\"https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014.jpg 2204w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-300x300.jpg 300w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-1024x1024.jpg 1024w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-150x150.jpg 150w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-768x768.jpg 768w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-1536x1536.jpg 1536w, https://blog.architizer.com/wp-content/uploads/6.TWS-PHOTO-2014-2048x2048.jpg 2048w\" sizes=\"auto, (max-width: 2204px) 100vw, 2204px\"/\u003eThomas W. Schaller is an internationally acclaimed artist, architect, and author based in New York City. In 2024 he was named the recipient of the Arthur Ross Award in Fine Arts by the Institute of Classical Art and Architecture, the 2024 Raphael Award, winner of the Ogden Pleissner Award by both the American Watercolor Society and the Salmagundi Art Club, and First Place Award winner in Watercolour International. A two-time winner of the prestigious Hugh Ferriss Memorial Prize, he also won the First Place Award in the Architizer One Drawing Competition. He is the author of three books, including the AIA Award-Winning Architecture in Watercolor. His latest, Architect of Light is published by Penguin Random House. His best-selling DVD, The Power of Design is published by Streamline Media. And his interactive online mentorship program “Design and the Power of Imagination” is hosted by Terracotta LLC. Tom is a signature member of many art groups around the world and is represented by Gallery 71 in New York City.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"http://www.instagram.com/thomaswschaller\" target=\"_blank\" rel=\"noopener\"\u003eThomas Schaller\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eNatasha Sandmeier\u003c/h2\u003e\n\u003ch3\u003e\u003ca href=\"https://www.aud.ucla.edu/\" target=\"_blank\" rel=\"noopener\"\u003eAssistant Adjunct Professor at UCLA\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8.jpeg\" alt=\"\" width=\"2535\" height=\"2535\" srcset=\"https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8.jpeg 2535w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-300x300.jpeg 300w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-1024x1024.jpeg 1024w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-150x150.jpeg 150w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-768x768.jpeg 768w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-1536x1536.jpeg 1536w, https://blog.architizer.com/wp-content/uploads/44744A47-AAFA-484E-AC00-F5D641F6E2F8-2048x2048.jpeg 2048w\" sizes=\"auto, (max-width: 2535px) 100vw, 2535px\"/\u003eNatasha Sandmeier is an educator and leads the postgraduate Entertainment Studio at UCLA Architecture \u0026amp; Urban Design, and is Program Director of the MS.AUD. Her academic work and research straddles the worlds of architecture and visual storytelling. She was the Executive Director of the A+D Museum, Los Angeles from 2022-24. She is the author and editor of Little Worlds (London, 2014); a monograph of projects and essays re-examining the role of the architect within contemporary architectural culture. Natasha is an architect (NL registered) and founding partner of Office UR (OUR).\u003c/p\u003e\n\u003chr/\u003e\n\u003ch2\u003eBless Yee\u003c/h2\u003e\n\u003ch3\u003eProject Architect at \u003ca href=\"https://www.dlrgroup.com/\" target=\"_blank\" rel=\"noopener\"\u003eDLR Group\u003c/a\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cimg loading=\"lazy\" decoding=\"async\" src=\"https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped.jpg\" alt=\"\" width=\"2483\" height=\"2483\" srcset=\"https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped.jpg 2483w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-300x300.jpg 300w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-1024x1024.jpg 1024w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-150x150.jpg 150w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-768x768.jpg 768w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-1536x1536.jpg 1536w, https://blog.architizer.com/wp-content/uploads/DLR-Bless-Yee-Casual-0999BW-Cropped-2048x2048.jpg 2048w\" sizes=\"auto, (max-width: 2483px) 100vw, 2483px\"/\u003e\u003ca href=\"https://www.blessyee.com/\" target=\"_blank\" rel=\"noopener\"\u003eBless Yee\u003c/a\u003e was the Non-Student Grand Prize Winner of 2020’s One Drawing Challenge, and was one of the winners of Dezeen’s 2021 Redesign the World competition. She is an architect, artist, and educator based in Washington, D.C. Currently, Bless is an Project Architect in the Cultural \u0026amp; Performing Arts Sector at DLR Group and is an adjunct professor at Parsons the New School for Design. She has also worked at Snøhetta, Handel Architects, and Pei Cobb Freed \u0026amp; Partners. In her personal work she is developing methods of layering hand drawing and physical models with digital tools to depict compelling narratives of social issues.\u003c/p\u003e\n\u003cp\u003eFollow \u003ca href=\"https://www.instagram.com/byee_artwrk/\" target=\"_blank\" rel=\"noopener\"\u003eBless Yee\u003c/a\u003e on Instagram.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cem\u003e\u003ci\u003eFrom conceptual work to photographs and videos to drawings and more, \u003c/i\u003e\u003ci\u003eArchitizer\u0026#39;s \u003c/i\u003e\u003ca href=\"https://info.architizer.com/vision-awards?utm_source=architizer\u0026amp;utm_medium=blog\u0026amp;utm_campaign=nav\" target=\"_blank\" rel=\"noopener\"\u003e\u003ci\u003e\u003cstrong\u003e2025 Vision Awards\u003c/strong\u003e\u003c/i\u003e\u003c/a\u003e puts the spotlight on architectural representation\u003ci\u003e. \u003c/i\u003eThe clock is ticking — \u003ci\u003e\u003ca href=\"https://visionawards.architizer.com/a/organizations/main/submissions/submissionnotcompleted?solicitationId=24\u0026amp;utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener\"\u003esubmit your work\u003c/a\u003e ahead of the \u003cstrong\u003eExtended Entry Deadline\u003c/strong\u003e on \u003cstrong\u003eAugust 1st\u003c/strong\u003e. \u003c/i\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://visionawards.architizer.com/a/organizations/main/submissions/submissionnotcompleted?solicitationId=24\u0026amp;utm_source=architizer\u0026amp;utm_medium=blog\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eStart Vision Award Entry\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-07-14T15:01:04Z",
  "modifiedTime": "2025-07-14T15:22:37Z"
}
