{
  "id": "e3b4fbf0-3387-4a11-9466-7cd7d161d779",
  "title": "From dean to design lead: 15+ leadership-track architecture job opportunities for seasoned professionals",
  "link": "https://archinect.com/news/article/150489689/from-dean-to-design-lead-15-leadership-track-architecture-job-opportunities-for-seasoned-professionals",
  "description": "",
  "author": "Nathaniel Bahadursingh",
  "published": "2025-07-10T16:13:00-04:00",
  "source": "https://archinect.com/feed/1/news",
  "categories": null,
  "byline": "",
  "length": 10232,
  "excerpt": "If you're an experienced professional ready for a new architectural career opportunity, this latest edition of our curated job picks from Archinect Jobs is for you. Look below at this selection of 15 featured employers looking to expand with exciting senior-level...",
  "siteName": "Archinect",
  "favicon": "https://archinect.com/apple-touch-icon.png",
  "text": "If you're an experienced professional ready for a new architectural career opportunity, this latest edition of our curated job picks from Archinect Jobs is for you. Look below at this selection of 15 featured employers looking to expand with exciting senior-level roles. For helpful guidance on how to get that next job, make sure to check out Archinect's Guide to Job Titles series and our Archinect Tips collection. California Practice (formerly GGA+) seeks a Senior Project Architect / Design Lead in Pasadena\"Practice, a mission-driven architecture studio in Pasadena, CA, is hiring a Senior Project Architect / Design Lead to help guide our social justice-driven design across civic, education, and affordable housing projects. This role blends design leadership with technical oversight, offering the opportunity to shape projects holistically while mentoring and supporting others. You'll lead design direction, contribute to project delivery, and collaborate with internal and external teams to ensure clarity, creativity, and care at every stage.\" The firm is also hiring for a Project Architect, a Project Captain, and a Project Designer II. Caltech Student Center by Practice.The City of San Jose seeks a Principal Engineer/Architect\"The Principal Engineer/Architect will support the Library Department (LD) in leading the coordination for the Library Facilities and Customer Experience Planning. This individual will play a key leadership role in driving critical infrastructure initiatives, including supporting the implementation of the California State Library Building Forward Infrastructure Grant projects and managing capital and facilities planning processes in collaboration with the LD and consultants.\" University of California, Berkeley seeks a Dean - College of Environmental Design\"Building on CED’s unique identity and strengths, the next dean will be a strategic leader who excels in fostering collaborations and connections among scholars, practitioners, students, alumni, and other stakeholders to unite the various approaches to environmental design. This leader will need to navigate the complexities and opportunities of a public university, serve as a dynamic advocate for both CED and UC Berkeley, deeply value and uphold the principles of shared governance, and thoughtfully balance the College’s teaching, research, and practice priorities centered in design excellence.\" BCV Architecture + Interiors seeks a Senior Technical Architect in San Francisco\"BCV is opening a position for a Senior Technical Architect with a minimum of 15 years of professional experience to join our firm in San Francisco or New York City.  The successful candidate will be a technically proficient architect with strengths in working drawing production, detailing, code knowledge, and staff mentoring.  Fluency in Revit, AutoCAD and Adobe CC is required, and extensive technical experience is a high priority.\" The firm is also hiring for a Project Manager - Hospitality. The Crow's Nest Residence by BCV Architecture + Interiors.Matter Studio seeks a Senior Project Architect in Los Angeles\"The Senior Architect will lead design and documentation efforts on custom residential projects from concept through construction. This role requires both creative and technical leadership, with a strong grasp of permitting processes, construction documentation, and client coordination. You will work closely with principals, clients, consultants, and city agencies to deliver refined, buildable designs.\" MOCA Systems, Inc. seeks a Principal Project Manager (Owner's Representative/Architect) in Sacramento\"Acting as the owner’s representative, the Principal Project Manager (Owner's Representative/Architect) will lead large, complex construction projects and manage all facets of the project definition, procurement, design, pre-construction, bid/award, and construction phases of work. They will envision, plan, evaluate, and maintain oversight over operations required to successfully deliver the project to meet the client’s goals and objectives. They will manage all project stakeholders and oversee project staff.\" New York CetraRuddy seeks a Technical Architect - Licensed in New York City\"CetraRuddy is seeking a licensed Technical Director for its New York Studio. The successful candidate will be self-motivated and a creative problem-solver that exhibits strong management and design skills. Candidates should be fluent in building technology, documentation, and delivery and should be passionate about design and architecture. The Technical Director will be responsible for firm-wide QA/QC, as well as technical excellence and project delivery.\" The firm is also hiring for an Interior Designer and a Senior Interior Designer. Rose Hill by CetraRuddy.WRNS Studio seeks a Senior Project Architect in New York CityQualifications include a minimum of ten-plus years of experience, excellent Revit skills, proficiency with SketchUp, Rhino, and Adobe Creative Suite, demonstrated experience leading medium to large-scale projects, experience working in all phases of architectural project, including Construction Administration, and excellent written and verbal communication skills. The firm is also hiring for a Senior Interior Designer. Cushman \u0026 Wakefield seeks a Senior Design Manager in New York City\"This role requires a mastering of architectural design principles, Revit software, project management methodologies, and effective team leadership. They are accountable for the quality management of the design deliverables as well as continuing to push innovation. The Senior Design Manager is accountable for optimizing resource allocation to achieve design goals while fostering the professional growth of the design team. This role requires close collaboration with cross-functional teams to deliver high-quality design solutions that align with business objectives and exceed client expectations.\" WXY Architecture + Urban Design seeks a Senior Urban Designer in New York City\"This role requires an ability to manage a full range of urban design, land use, landscape, and master planning portfolios. The candidate should have strong project management skills, demonstrate experience of successfully working within project budgets and with various project teams, and possess strong design skills, passion for innovative design and systems thinking about mobility and public realm challenges, excellent visual and written communication skills, and a strong technical aptitude for learning new tools and techniques.\" PlaNYC Far Rockaway Park Masterplan and Parks Structures by WXY Architecture + Urban Design. Photo: Albert Vecerka/ESTOWendel Companies seeks a Senior Architect - Public Safety in AlbanyQualifications include ten to fifteen years of experience, knowledge of Revit, Bluebeam, Procore, and SketchUp, experience executing project development from concept through construction, the ability to mentor entry-level architects, a comprehensive understanding of architectural specifications, international building codes, life safety code, and ADA requirements, and strong communication and organizational skills. New Jersey Wayne Development seeks an Architect / Design Lead in Jersey City\"We are currently hiring our first in-house architect. This role is ideal for someone with a strong design voice who wants to help shape the culture and creative direction of a growing studio. You will take the lead on both our internal development projects and new client-facing architectural work. This position offers an opportunity to be directly involved in design decisions, zoning and permitting strategy, and construction execution. You’ll work side by side with the founder, contributing to active projects while helping to grow a full-service architecture and development practice.\" Texas DAHLIN seeks a Design Manager - Planning in Houston\"We are seeking an experienced DESIGN MANAGER - PLANNING to lead and deliver a variety of project types and sizes, primarily from front-end design, planning \u0026 entitlement through schematic design. This individual will serve as the primary point of contact for the client, recognizing the importance of active listening while collaborating with and guiding internal teams to ensure the successful execution of project deliverables.\" The firm is also hiring for a number of roles. McGraw Square at Queen Anne by DAHLIN.Virginia Wendel Companies seeks a Senior Project Architect in AlexandriaQualifications include ten-plus years of experience, a knowledge of Revit, Bluebeam, Procore, and SketchUp, experience executing project development from concept through construction, a proven record of strong technical design and detailing skills for both interior and exterior aspects of new build and renovation projects, the ability to lead project and client meetings, and strong communication and organizational skills. West Virginia Pickering Associates seeks a Sector Director - Educational Design in Parkersburg\"This role is ideal for someone with a background in design, construction or facilities management for educational buildings who also thrives on building relationships, driving business development, and representing our firm externally. We are looking for a client-focused professional who understands the unique requirements of educational facilities—from capital project planning to ongoing maintenance—and can partner closely with school districts, higher ed institutions, and public agencies to shape their built environments.\" The firm is also hiring for a Registered Architect. Wisconsin Continuum Architects + Planners seeks a Senior Project Architect in Milwaukee\"We are currently looking for a Registered Senior Project Architect with 8-10 years of experience working in this industry to join our team. The ideal candidate will be a self-driven, motivated individual with experience in multifamily/mixed use housing and/or higher education project types.\" Qualifications include proficiency with Revit, AutoCAD, SketchUp, and Adobe Creative Suite. If you don't already, follow Archinect on Instagram, Facebook, X, Pinterest, LinkedIn, Threads, and BlueSky, as well as on our dedicated Archinect Jobs Instagram, Facebook, X, and Threads feeds.",
  "image": "https://archinect.gumlet.io/uploads/cf/cf2d7d46f92e62bd341a7c39a6850343.jpg?fit=crop\u0026auto=compress%2Cformat\u0026enlarge=true\u0026crop=faces\u0026w=1200\u0026h=707",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\t\t\t\t\u003cp\u003eIf you\u0026#39;re an experienced professional ready for a new architectural career opportunity, this latest edition of our \u003ca href=\"https://archinect.com/news/tag/1069128/curated-job-picks\" target=\"_blank\"\u003ecurated job picks\u003c/a\u003e from \u003ca href=\"https://archinect.com/jobs\" target=\"_blank\"\u003eArchinect Jobs\u003c/a\u003e is for you. Look below at this selection of 15 featured employers looking to expand with exciting senior-level roles.\u003c/p\u003e\n\u003cp\u003eFor helpful guidance on how to get that next job, make sure to check out \u003ca href=\"https://archinect.com/features/tag/1467624/archinect-s-guide-to-job-titles\" target=\"_blank\"\u003eArchinect\u0026#39;s Guide to Job Titles\u003c/a\u003e series and our \u003ca href=\"https://archinect.com/news/tag/1448002/archinect-tips\" target=\"_blank\"\u003eArchinect Tips\u003c/a\u003e collection.\u003cbr/\u003e\u003c/p\u003e\n\u003ch3\u003eCalifornia\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/practice\" target=\"_blank\"\u003ePractice (formerly GGA+)\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150488544/senior-project-architect-design-lead\" target=\"_blank\"\u003eSenior Project Architect / Design Lead\u003c/a\u003e in Pasadena\u003cbr/\u003e\u003c/strong\u003e\u0026#34;Practice, a mission-driven architecture studio in Pasadena, CA, is hiring a Senior Project Architect / Design Lead to help guide our social justice-driven design across civic, education, and affordable housing projects. This role blends design leadership with technical oversight, offering the opportunity to shape projects holistically while mentoring and supporting others. You\u0026#39;ll lead design direction, contribute to project delivery, and collaborate with internal and external teams to ensure clarity, creativity, and care at every stage.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for a \u003ca href=\"https://archinect.com/jobs/entry/150477674/project-architect\" target=\"_blank\"\u003eProject Architect\u003c/a\u003e, a \u003ca href=\"https://archinect.com/jobs/entry/150477680/project-captain\" target=\"_blank\"\u003eProject Captain\u003c/a\u003e, and a \u003ca href=\"https://archinect.com/jobs/entry/150477682/project-designer-ii\" target=\"_blank\"\u003eProject Designer II\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ca href=\"https://archinect.gumlet.io/uploads/e2/e2cca8e4de9fb44dbe5ea8d573c3184b.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=1028\" data-size=\"1028x685\" target=\"_blank\"\u003e\u003cimg src=\"https://archinect.gumlet.io/uploads/e2/e2cca8e4de9fb44dbe5ea8d573c3184b.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\" srcset=\"https://archinect.gumlet.io/uploads/e2/e2cca8e4de9fb44dbe5ea8d573c3184b.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514 1x,https://archinect.gumlet.io/uploads/e2/e2cca8e4de9fb44dbe5ea8d573c3184b.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=2 2x, https://archinect.gumlet.io/uploads/e2/e2cca8e4de9fb44dbe5ea8d573c3184b.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=3 3x\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cfigcaption\u003eCaltech Student Center by Practice.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003eThe City of San Jose seeks a \u003ca href=\"https://archinect.com/jobs/entry/150488033/principal-engineer-architect\" target=\"_blank\"\u003ePrincipal Engineer/Architect\u003c/a\u003e\u003cbr/\u003e\u003c/strong\u003e\u0026#34;The Principal Engineer/Architect will support the Library Department (LD) in leading the coordination for the Library Facilities and Customer Experience Planning. This individual will play a key leadership role in driving critical infrastructure initiatives, including supporting the implementation of the California State Library Building Forward Infrastructure Grant projects and managing capital and facilities planning processes in collaboration with the LD and consultants.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/UCBerkeley\" target=\"_blank\"\u003eUniversity of California, Berkeley\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150487907/dean-college-of-environmental-design\" target=\"_blank\"\u003eDean - College of Environmental Design\u003cbr/\u003e\u003c/a\u003e\u003c/strong\u003e\u0026#34;Building on CED’s unique identity and strengths, the next dean will be a strategic leader who excels in fostering collaborations and connections among scholars, practitioners, students, alumni, and other stakeholders to unite the various approaches to environmental design. This leader will need to navigate the complexities and opportunities of a public university, serve as a dynamic advocate for both CED and UC Berkeley, deeply value and uphold the principles of shared governance, and thoughtfully balance the College’s teaching, research, and practice priorities centered in design excellence.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/40505227/bcv-architecture-interiors\" target=\"_blank\"\u003eBCV Architecture + Interiors\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150485545/senior-technical-architect\" target=\"_blank\"\u003eSenior Technical Architect\u003c/a\u003e in San Francisco\u003c/strong\u003e\u003cbr/\u003e\u0026#34;BCV is opening a position for a Senior Technical Architect with a minimum of 15 years of professional experience to join our firm in San Francisco or New York City.  The successful candidate will be a technically proficient architect with strengths in working drawing production, detailing, code knowledge, and staff mentoring.  Fluency in Revit, AutoCAD and Adobe CC is required, and extensive technical experience is a high priority.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for a \u003ca href=\"https://archinect.com/jobs/entry/150488511/project-manager-hospitality\" target=\"_blank\"\u003eProject Manager - Hospitality\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ca href=\"https://archinect.gumlet.io/uploads/8d/8df6a1076e19da370f047681897864e1.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=1028\" data-size=\"1028x1371\" target=\"_blank\"\u003e\u003cimg src=\"https://archinect.gumlet.io/uploads/8d/8df6a1076e19da370f047681897864e1.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\" srcset=\"https://archinect.gumlet.io/uploads/8d/8df6a1076e19da370f047681897864e1.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514 1x,https://archinect.gumlet.io/uploads/8d/8df6a1076e19da370f047681897864e1.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=2 2x, https://archinect.gumlet.io/uploads/8d/8df6a1076e19da370f047681897864e1.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=3 3x\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cfigcaption\u003eThe Crow\u0026#39;s Nest Residence by BCV Architecture + Interiors.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/matterstudio\" target=\"_blank\"\u003eMatter Studio\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150487569/senior-project-architect\" target=\"_blank\"\u003eSenior Project Architect\u003c/a\u003e in Los Angeles\u003cbr/\u003e\u003c/strong\u003e\u0026#34;The Senior Architect will lead design and documentation efforts on custom residential projects from concept through construction. This role requires both creative and technical leadership, with a strong grasp of permitting processes, construction documentation, and client coordination. You will work closely with principals, clients, consultants, and city agencies to deliver refined, buildable designs.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/150486334/moca-systems-inc\" target=\"_blank\"\u003eMOCA Systems, Inc.\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150486335/principal-project-manager-owner-s-representative-architect\" target=\"_blank\"\u003ePrincipal Project Manager (Owner\u0026#39;s Representative/Architect)\u003c/a\u003e in Sacramento\u003cbr/\u003e\u003c/strong\u003e\u0026#34;Acting as the owner’s representative, the Principal Project Manager (Owner\u0026#39;s Representative/Architect) will lead large, complex construction projects and manage all facets of the project definition, procurement, design, pre-construction, bid/award, and construction phases of work. They will envision, plan, evaluate, and maintain oversight over operations required to successfully deliver the project to meet the client’s goals and objectives. They will manage all project stakeholders and oversee project staff.\u0026#34;\u003c/p\u003e\n\u003ch3\u003eNew York\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/4259383/cetraruddy\" target=\"_blank\"\u003eCetraRuddy\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150488029/technical-architect-licensed\" target=\"_blank\"\u003eTechnical Architect - Licensed\u003c/a\u003e in New York City\u003cbr/\u003e\u003c/strong\u003e\u0026#34;CetraRuddy is seeking a licensed Technical Director for its New York Studio. The successful candidate will be self-motivated and a creative problem-solver that exhibits strong management and design skills. Candidates should be fluent in building technology, documentation, and delivery and should be passionate about design and architecture. The Technical Director will be responsible for firm-wide QA/QC, as well as technical excellence and project delivery.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for an \u003ca href=\"https://archinect.com/jobs/entry/150481867/interior-designer\" target=\"_blank\"\u003eInterior Designer\u003c/a\u003e and a \u003ca href=\"https://archinect.com/jobs/entry/150481861/senior-interior-designer\" target=\"_blank\"\u003eSenior Interior Designer\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ca href=\"https://archinect.gumlet.io/uploads/c9/c9d636ec59d0d385a03a728acc655d98.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=1028\" data-size=\"1028x1542\" target=\"_blank\"\u003e\u003cimg src=\"https://archinect.gumlet.io/uploads/c9/c9d636ec59d0d385a03a728acc655d98.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\" srcset=\"https://archinect.gumlet.io/uploads/c9/c9d636ec59d0d385a03a728acc655d98.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514 1x,https://archinect.gumlet.io/uploads/c9/c9d636ec59d0d385a03a728acc655d98.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=2 2x, https://archinect.gumlet.io/uploads/c9/c9d636ec59d0d385a03a728acc655d98.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=3 3x\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cfigcaption\u003eRose Hill by CetraRuddy.\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/23558296/wrns-studio\" target=\"_blank\"\u003eWRNS Studio\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150485307/senior-project-architect\" target=\"_blank\"\u003eSenior Project Architect\u003c/a\u003e in New York City\u003cbr/\u003e\u003c/strong\u003eQualifications include a minimum of ten-plus years of experience, excellent Revit skills, proficiency with SketchUp, Rhino, and Adobe Creative Suite, demonstrated experience leading medium to large-scale projects, experience working in all phases of architectural project, including Construction Administration, and excellent written and verbal communication skills.\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for a \u003ca href=\"https://archinect.com/jobs/entry/150489557/senior-interior-designer\" target=\"_blank\"\u003eSenior Interior Designer\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/66359091/cushman-wakefield\" target=\"_blank\"\u003eCushman \u0026amp; Wakefield\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150486489/senior-design-manager\" target=\"_blank\"\u003eSenior Design Manager\u003c/a\u003e in New York City\u003cbr/\u003e\u003c/strong\u003e\u0026#34;This role requires a mastering of architectural design principles, Revit software, project management methodologies, and effective team leadership. They are accountable for the quality management of the design deliverables as well as continuing to push innovation. The Senior Design Manager is accountable for optimizing resource allocation to achieve design goals while fostering the professional growth of the design team. This role requires close collaboration with cross-functional teams to deliver high-quality design solutions that align with business objectives and exceed client expectations.\u0026#34;\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/wxystudio\" target=\"_blank\"\u003eWXY Architecture + Urban Design\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150488812/senior-urban-designer\" target=\"_blank\"\u003eSenior Urban Designer\u003c/a\u003e in New York City\u003c/strong\u003e\u003cbr/\u003e\u0026#34;This role requires an ability to manage a full range of urban design, land use, landscape, and master planning portfolios. The candidate should have strong project management skills, demonstrate experience of successfully working within project budgets and with various project teams, and possess strong design skills, passion for innovative design and systems thinking about mobility and public realm challenges, excellent visual and written communication skills, and a strong technical aptitude for learning new tools and techniques.\u0026#34;\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ca href=\"https://archinect.gumlet.io/uploads/43/438d692a0f8aab33fe6cbd93537dd1a9.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=1028\" data-size=\"1028x678\" target=\"_blank\"\u003e\u003cimg src=\"https://archinect.gumlet.io/uploads/43/438d692a0f8aab33fe6cbd93537dd1a9.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\" srcset=\"https://archinect.gumlet.io/uploads/43/438d692a0f8aab33fe6cbd93537dd1a9.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514 1x,https://archinect.gumlet.io/uploads/43/438d692a0f8aab33fe6cbd93537dd1a9.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=2 2x, https://archinect.gumlet.io/uploads/43/438d692a0f8aab33fe6cbd93537dd1a9.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=3 3x\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cfigcaption\u003ePlaNYC Far Rockaway Park Masterplan and Parks Structures by WXY Architecture + Urban Design. Photo: Albert Vecerka/ESTO\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/74165593/wendel-companies\" target=\"_blank\"\u003eWendel Companies\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150487028/senior-architect-public-safety\" target=\"_blank\"\u003eSenior Architect - Public Safety\u003c/a\u003e in Albany\u003cbr/\u003e\u003c/strong\u003eQualifications include ten to fifteen years of experience, knowledge of Revit, Bluebeam, Procore, and SketchUp, experience executing project development from concept through construction, the ability to mentor entry-level architects, a comprehensive understanding of architectural specifications, international building codes, life safety code, and ADA requirements, and strong communication and organizational skills.\u003c/p\u003e\n\u003ch3\u003eNew Jersey\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/150486803/wayne-development\" target=\"_blank\"\u003eWayne Development\u003c/a\u003e seeks an \u003ca href=\"https://archinect.com/jobs/entry/150486804/architect-design-lead-help-build-a-new-kind-of-development-studio\" target=\"_blank\"\u003eArchitect / Design Lead\u003c/a\u003e in Jersey City\u003cbr/\u003e\u003c/strong\u003e\u0026#34;We are currently hiring our first in-house architect. This role is ideal for someone with a strong design voice who wants to help shape the culture and creative direction of a growing studio. You will take the lead on both our internal development projects and new client-facing architectural work. This position offers an opportunity to be directly involved in design decisions, zoning and permitting strategy, and construction execution. You’ll work side by side with the founder, contributing to active projects while helping to grow a full-service architecture and development practice.\u0026#34;\u003c/p\u003e\n\u003ch3\u003eTexas\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/dahlingroup\" target=\"_blank\"\u003eDAHLIN\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150485634/design-manager-planning\" target=\"_blank\"\u003eDesign Manager - Planning\u003c/a\u003e in Houston\u003cbr/\u003e\u003c/strong\u003e\u0026#34;We are seeking an experienced DESIGN MANAGER - PLANNING to lead and deliver a variety of project types and sizes, primarily from front-end design, planning \u0026amp; entitlement through schematic design. This individual will serve as the primary point of contact for the client, recognizing the importance of active listening while collaborating with and guiding internal teams to ensure the successful execution of project deliverables.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for \u003ca href=\"https://archinect.com/dahlingroup/jobs\" target=\"_blank\"\u003ea number of roles\u003c/a\u003e.\u003c/p\u003e\n\u003cfigure\u003e\u003cp\u003e\u003ca href=\"https://archinect.gumlet.io/uploads/96/9635ee2e5d0c8b3fb0f69b429d73ad46.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=1028\" data-size=\"1028x578\" target=\"_blank\"\u003e\u003cimg src=\"https://archinect.gumlet.io/uploads/96/9635ee2e5d0c8b3fb0f69b429d73ad46.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\" srcset=\"https://archinect.gumlet.io/uploads/96/9635ee2e5d0c8b3fb0f69b429d73ad46.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514 1x,https://archinect.gumlet.io/uploads/96/9635ee2e5d0c8b3fb0f69b429d73ad46.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=2 2x, https://archinect.gumlet.io/uploads/96/9635ee2e5d0c8b3fb0f69b429d73ad46.jpg?auto=compress%2Cformat\u0026amp;enlarge=true\u0026amp;w=514\u0026amp;dpr=3 3x\"/\u003e\u003c/a\u003e\u003c/p\u003e\u003cfigcaption\u003eMcGraw Square at Queen Anne by DAHLIN.\u003c/figcaption\u003e\u003c/figure\u003e\u003ch3\u003eVirginia\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/74165593/wendel-companies\" target=\"_blank\"\u003eWendel Companies\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150487030/senior-project-architect\" target=\"_blank\"\u003eSenior Project Architect\u003c/a\u003e in Alexandria\u003cbr/\u003e\u003c/strong\u003eQualifications include ten-plus years of experience, a knowledge of Revit, Bluebeam, Procore, and SketchUp, experience executing project development from concept through construction, a proven record of strong technical design and detailing skills for both interior and exterior aspects of new build and renovation projects, the ability to lead project and client meetings, and strong communication and organizational skills.\u003cbr/\u003e\u003c/p\u003e\n\u003ch3\u003eWest Virginia\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/firms/cover/102172993/pickering-associates\" target=\"_blank\"\u003ePickering Associates\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150486709/sector-director-educational-design\" target=\"_blank\"\u003eSector Director - Educational Design\u003c/a\u003e in Parkersburg\u003cbr/\u003e\u003c/strong\u003e\u0026#34;This role is ideal for someone with a background in design, construction or facilities management for educational buildings who also thrives on building relationships, driving business development, and representing our firm externally. We are looking for a client-focused professional who understands the unique requirements of educational facilities—from capital project planning to ongoing maintenance—and can partner closely with school districts, higher ed institutions, and public agencies to shape their built environments.\u0026#34;\u003c/p\u003e\n\u003cp\u003eThe firm is also hiring for a \u003ca href=\"https://archinect.com/jobs/entry/150486716/registered-architect\" target=\"_blank\"\u003eRegistered Architect\u003c/a\u003e.\u003c/p\u003e\n\u003ch3\u003eWisconsin\u003c/h3\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://archinect.com/continuumarchitects\" target=\"_blank\"\u003eContinuum Architects + Planners\u003c/a\u003e seeks a \u003ca href=\"https://archinect.com/jobs/entry/150482318/senior-project-architect\" target=\"_blank\"\u003eSenior Project Architect\u003c/a\u003e in Milwaukee\u003cbr/\u003e\u003c/strong\u003e\u0026#34;We are currently looking for a Registered Senior Project Architect with 8-10 years of experience working in this industry to join our team. The ideal candidate will be a self-driven, motivated individual with experience in multifamily/mixed use housing and/or higher education project types.\u0026#34; Qualifications include proficiency with Revit, AutoCAD, SketchUp, and Adobe Creative Suite.\u003c/p\u003e\n\u003cp\u003eIf you don\u0026#39;t already, follow Archinect on \u003ca href=\"https://www.instagram.com/archinect/\" target=\"_blank\"\u003eInstagram\u003c/a\u003e, \u003ca href=\"https://www.facebook.com/Archinect\" target=\"_blank\"\u003eFacebook\u003c/a\u003e, \u003ca href=\"https://twitter.com/archinect\" target=\"_blank\"\u003eX\u003c/a\u003e, \u003ca href=\"https://www.pinterest.com/archinect/employer-of-the-day/\" target=\"_blank\"\u003ePinterest\u003c/a\u003e, \u003ca href=\"https://www.linkedin.com/company/archinect/\" target=\"_blank\"\u003eLinkedIn\u003c/a\u003e, \u003ca href=\"https://www.threads.net/@archinect\" target=\"_blank\"\u003eThreads\u003c/a\u003e, and \u003ca href=\"https://bsky.app/profile/archinect.bsky.social\" target=\"_blank\"\u003eBlueSky\u003c/a\u003e, as well as on our dedicated Archinect Jobs \u003ca href=\"https://www.instagram.com/archinectjobs/\" target=\"_blank\"\u003eInstagram\u003c/a\u003e, \u003ca href=\"https://www.facebook.com/pg/archinectjobs/photos/\" target=\"_blank\"\u003eFacebook\u003c/a\u003e, \u003ca href=\"https://twitter.com/archinectjobs\" target=\"_blank\"\u003eX\u003c/a\u003e, and \u003ca href=\"https://www.threads.net/@archinectjobs\" target=\"_blank\"\u003eThreads\u003c/a\u003e feeds.\u003c/p\u003e\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": null,
  "modifiedTime": null
}
