{
  "id": "e8adee1c-0403-4b78-b247-69eb8d035ce8",
  "title": "Peter Zumthor–designed David Geffen Galleries at LACMA to open in April 2026",
  "link": "https://www.archpaper.com/2024/10/peter-zumthor-david-geffen-galleries-lacma-april-2026/",
  "description": "Los Angeles County Museum of Art (LACMA) officials have announced a completion date for the David Geffen Galleries designed by Peter Zumthor. The highly anticipated project will open to the The post Peter Zumthor–designed David Geffen Galleries at LACMA to open in April 2026 appeared first on The Architect’s Newspaper.",
  "author": "Daniel Jonas Roche",
  "published": "Tue, 29 Oct 2024 20:02:54 +0000",
  "source": "https://archpaper.com/feed",
  "categories": [
    "Architecture",
    "Art",
    "News",
    "West",
    "LACMA",
    "Los Angeles",
    "Peter Zumthor"
  ],
  "byline": "Daniel Jonas Roche",
  "length": 2696,
  "excerpt": "LACMA’s long-awaited expansion by Peter Zumthor has an opening date. David Geffen Galleries at LACMA will open in April 2026.",
  "siteName": "The Architect’s Newspaper",
  "favicon": "https://www.archpaper.com/images/AN_favicon_64.png",
  "text": "Are We There Yet? By •October 29, 2024 • Architecture, Art, News, West Los Angeles County Museum of Art (LACMA) officials have announced a completion date for the David Geffen Galleries designed by Peter Zumthor. The highly anticipated project will open to the public in April 2026. The announcement comes after four years of construction on the addition that runs parallel to Wilshire Boulevard. This week scaffolding is being removed from David Geffen Galleries, giving the public a first look at the 900-foot-long horizontal form. About 90 percent of construction has been finished, LACMA officials noted in a press statement. Major construction is expected to conclude by the end of 2024, and LACMA will begin moving key operational functions and artworks into the Zumthor-designed building in early 2025. Construction is well underway on the project (©Museum Associates/LACMA) Building LACMA has been a long series of trials and tribulations, and the project has faced stiff opposition from the start. Save LACMA, a local 501(c)3 nonprofit organization established in 2019, tried hard to save the original LACMA designed by William Pereira from demolition, but those efforts were fruitless, and the Perreira-design building was demolished that same year. In an op-ed for AN, Antonio Pacheco called the Zumthor design “an affront to L.A.’s architectural and cultural heritage.” Final renderings for the project were issued in 2020, as reported by AN. When David Geffen Galleries opens in April 2026, it will mark the culmination of a two-decade-long campus transformation project. Past phases delivered the Broad Contemporary Art Museum (2008) and the Lynda and Stewart Resnick Exhibition Pavilion (2010). Both of those additions were by Renzo Piano Building Workshop. “Being so close to opening our new galleries and to having so much more art on view is incredibly exciting,” shared Michael Govan, LACMA CEO and Wallis Annenberg Director. “So many people have contributed to making this vision for LACMA and Los Angeles a reality, and we are grateful to each and every one.” Upon completion, the multiphase transformation will give LACMA 220,000 square feet of gallery space—a huge boost from the mere 130,000 square feet it had in 2007. “When the scaffolding comes down,” Govan continued, “[Los Angeles] will finally see 360 degrees of Peter Zumthor’s amazing architectural achievement and begin to sense how wonderful this building is going to be inside. We can’t wait to open to the public in April 2026.”",
  "image": "https://www.archpaper.com/wp-content/uploads/2024/10/2.-The-David-Geffen-Galleries-at-LACMA-photo-©-Museum-Associates_LACMA.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n                    \u003ch2\u003eAre We There Yet?\u003c/h2\u003e\n        \n          \u003cdiv\u003e\n                  \u003cp\u003e\u003cspan\u003eBy\u003c/span\u003e\n                      \u003cspan\u003e•\u003c/span\u003e\u003c/p\u003e\u003cdate\u003e\u003ctime datetime=\"2024-10-29T16:02:54-04:00\"\u003eOctober 29, 2024\u003c/time\u003e\u003c/date\u003e\n          \u003cp\u003e\u003cspan\u003e•\u003c/span\u003e\n          \n          \n                      \u003cspan\u003e\n                    \u003ca href=\"https://www.archpaper.com/category/subject/architecture/\"\u003eArchitecture\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/category/subject/art/\"\u003eArt\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/category/type/news/\"\u003eNews\u003c/a\u003e, \u003ca href=\"https://www.archpaper.com/category/region/west/\"\u003eWest\u003c/a\u003e                \u003c/span\u003e\n            \u003c/p\u003e\u003c/div\u003e\n  \u003c/div\u003e\u003cdiv\u003e\n            \u003cp\u003eLos Angeles County Museum of Art (\u003ca href=\"https://www.archpaper.com/tag/lacma/\"\u003eLACMA\u003c/a\u003e) officials have announced a completion date for the David Geffen Galleries designed by \u003ca href=\"https://www.archpaper.com/tag/peter-zumthor/\"\u003ePeter Zumthor\u003c/a\u003e. The highly anticipated project will open to the public in April 2026.\u003c/p\u003e\n\n\u003cp\u003eThe announcement comes after four years of construction on the addition that runs parallel to Wilshire Boulevard. This week scaffolding is being removed from David Geffen Galleries, giving the public a first look at the 900-foot-long horizontal form.\u003c/p\u003e\n\u003cp\u003eAbout 90 percent of construction has been finished, LACMA officials noted in a press statement. Major construction is expected to conclude by the end of 2024, and LACMA will begin moving key operational functions and artworks into the Zumthor-designed building in early 2025.\u003c/p\u003e\n\u003cfigure id=\"attachment_385546\" aria-describedby=\"caption-attachment-385546\"\u003e\u003cimg decoding=\"async\" src=\"https://www.archpaper.com/wp-content/uploads/2024/10/1.-The-David-Geffen-Galleries-at-LACMA-photo-©-Museum-Associates_LACMA.jpg\" alt=\"LACMA progress\" width=\"1700\" height=\"846\"/\u003e\u003cfigcaption id=\"caption-attachment-385546\"\u003eConstruction is well underway on the project (©Museum Associates/LACMA)\u003c/figcaption\u003e\u003c/figure\u003e\n\u003cp\u003eBuilding LACMA has been a long series of trials and tribulations, and the project has \u003ca href=\"https://www.archpaper.com/2019/04/lacma-proposal-moves-forward/\"\u003efaced stiff opposition\u003c/a\u003e from the start. \u003ca href=\"https://ourlacma.org/\"\u003eSave LACMA\u003c/a\u003e, a local 501(c)3 nonprofit organization established in 2019, \u003ca href=\"https://www.archpaper.com/2019/12/lacma-redesign-nonprofit-pushback/\"\u003etried hard to save the original LACMA\u003c/a\u003e designed by William Pereira from demolition, but those efforts were fruitless, and \u003ca href=\"https://www.archpaper.com/2020/04/demolition-lacma-first-buildings-underway/\"\u003ethe Perreira-design building was demolished\u003c/a\u003e that same year. In an op-ed for \u003cem\u003eAN\u003c/em\u003e, Antonio Pacheco called the Zumthor design “\u003ca href=\"https://www.archpaper.com/2019/04/zumthor-lacma-proposal-op-ed/\"\u003ean affront to L.A.’s architectural and cultural heritage\u003c/a\u003e.”\u003c/p\u003e\n\n\u003cp\u003eFinal renderings for the project were issued in 2020, as \u003ca href=\"https://www.archpaper.com/2020/09/updated-lacma-plans-renderings-reveal-the-shape-of-the-museums-galleries-first-time/\"\u003ereported\u003c/a\u003e by \u003cem\u003eAN\u003c/em\u003e. When David Geffen Galleries opens in April 2026, it will mark the culmination of a two-decade-long campus transformation project. Past phases delivered the Broad Contemporary Art Museum (2008) and the Lynda and Stewart Resnick Exhibition Pavilion (2010). Both of those additions were by Renzo Piano Building Workshop.\u003c/p\u003e\n\u003cp\u003e“Being so close to opening our new galleries and to having so much more art on view is incredibly exciting,” shared Michael Govan, LACMA CEO and Wallis Annenberg Director. “So many people have contributed to making this vision for LACMA and Los Angeles a reality, and we are grateful to each and every one.”\u003c/p\u003e\n\n\u003cp\u003eUpon completion, the multiphase transformation will give LACMA 220,000 square feet of gallery space—a huge boost from the mere 130,000 square feet it had in 2007. “When the scaffolding comes down,” Govan continued, “[Los Angeles] will finally see 360 degrees of Peter Zumthor’s amazing architectural achievement and begin to sense how wonderful this building is going to be inside. We can’t wait to open to the public in April 2026.”\u003c/p\u003e\n\n        \u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-10-29T20:02:54Z",
  "modifiedTime": "2024-10-29T21:05:17Z"
}
