{
  "id": "ed9c3d91-f7cc-4bde-ade3-492ae3e8610f",
  "title": "We’re Hiring: Architizer Is Looking for a Talented Partnerships Coordinator to Join Our Team!",
  "link": "https://architizer.com/blog/inside-architizer/updates/partnerships-coordinator/",
  "description": "Are you looking to progress your career at the intersection of architecture, media, and sales? If so, we might have the perfect position for you. The post We’re Hiring: Architizer Is Looking for a Talented Partnerships Coordinator to Join Our Team! appeared first on Journal.",
  "author": "Paul Keskeys",
  "published": "Mon, 24 Feb 2025 16:01:36 +0000",
  "source": "https://architizer.wpengine.com/feed/",
  "categories": [
    "Competitions",
    "Inside Architizer",
    "Updates"
  ],
  "byline": "Paul Keskeys",
  "length": 5797,
  "excerpt": "Are you looking to progress your career at the intersection of architecture, media, and sales? If so, we might have the perfect position for you.",
  "siteName": "Journal",
  "favicon": "https://blog.architizer.com/wp-content/uploads/favicon.df2618023937.png",
  "text": "Are you looking to progress your career at the intersection of architecture, media, and sales? If so, we might have the perfect position for you: Architizer is on the hunt for a talented Partnerships Coordinator to join our growing team! The Partnerships Coordinator will be responsible for driving revenue growth by selling digital advertising solutions to new and existing clients. You will identify and cultivate relationships with businesses, understand their advertising needs, and present tailored solutions that deliver value and achieve their marketing objectives.  The ideal candidate is adept at researching and qualifying inbound and outbound leads and coordinating with existing clients to ensure their projects are executed. You will act as primary point person to grow and maintain relationships with partners and sponsors, including building product manufacturers, technology brands, and other companies that align with Architizer’s focus on cutting-edge design and innovation. Working closely with Architizer’s Editors and Publisher, you will continually nurture prospects from initial contact through closing deals and fulfillment of client placements. Positioned within a small, dynamic team, this role has room for expansion based on skill set and interest. About You You are dedicated to operational excellence and attentive customer service. You have a high EQ and are a conscientious listener. You are meticulous in your attention to detail and communicate clearly. You are autonomous yet collaborative. Main Responsibilities Research and support lead generation initiatives that surface successful new prospects. Convert qualified leads to opportunities through conscientious and timely follow-ups. Introduce prospects to Architizer, educating them about the opportunities of connecting with our global community of professional architects and designers. Coordinate and facilitate existing client communications, assets, and deliverables; ensuring their advertising campaigns are effectively implemented and monitored. Provide excellent customer service and support to clients, addressing any concerns or issues promptly. Continuously learn about challenges and opportunities for brands looking to connect with the global architecture community to enhance partner offerings. Leverage Hubspot, Airtable and other workflow tools to operate more efficiently. Requirements Excellent written and verbal communication, negotiation and presentation skills. Ability to build and maintain relationships with clients and stakeholders. Self-motivated, goal-oriented and able to work independently. A persistent and proactive approach, coupled with a “do-what-it-takes” mentality to achieve outcomes. A deadline-driven work ethic, yet adaptable enough to seize new opportunities as they arise. Proficient in CRM software and Microsoft Office Suite. Extremely organized and detail-oriented. Ability to multi-task and balance priorities. Proactive and persistent when working leads — not afraid of outreach. Adaptable and eager to learn and implement new processes and technologies. +Points Passionate about architecture and design. Experience marketing or selling B2B products or services. Experience with the specifying process or architectural products. Presence on and familiarity with LinkedIn as a business tool. Proficient in Hubspot, Airtable, Salesforce or other sales and workflow tools Details Location: Remote Employment: Full-time Hours: 9.00am – 5.00pm ET (working hours can become more flexible over time) Salary: $50k to $80k plus generous commissions, commensurate with experience. Benefits include PTO, healthcare, 401k match, and more. To apply, please email the following to jobs@architizer.com with the email subject line “Partnerships Coordinator Application: [YOUR NAME]”: An up-to-date resume (attached as a pdf). Cover letter (attached as a pdf). In the cover letter, tell us why you are the right person for this job. Please share relevant experience, insight, and motivation. LinkedIn profile – please include a link to your LI profile in the email. If your application is shortlisted, you will then be given a short assignment to complete in order to demonstrate your skills. Deadline for applications is Friday March 14, 2025 at 11:59 PST. About Architizer Architizer is the largest and fastest growing network for high-end residential, commercial and institutional architecture online. We’re the go-to site for the world’s leading architects and designers to showcase their work. We are looking to further enhance the site to empower architecture \u0026 design professionals to operate in a networked world, source products, find work and ultimately build better buildings. We’re a small but dynamic team of thinkers, creatives, technologists, writers, architects and doers. In the spirit of the architecture field, we approach our objectives with equal parts analysis and creativity. We’re involved both online and offline with architecture and design and collaborate regularly with friends at respected cultural organizations both in New York and globally. Apply for This Position Paul Keskeys is Editor in Chief at Architizer. An architect-trained editor, writer and content creator, Paul graduated from UCL and the University of Edinburgh, gaining an MArch in Architectural Design with distinction. Paul has spoken about the art of architecture and storytelling at many national industry events, including AIANY, NeoCon, KBIS, the Future NOW Symposium, the Young Architect Conference and NYCxDesign. As well as hundreds of editorial publications on Architizer, Paul has also had features published in Architectural Digest, PIN—UP Magazine, Archinect, Aesthetica Magazine and PUBLIC Journal.",
  "image": "https://blog.architizer.com/wp-content/uploads/Architizer-Jobs-Hero-Image.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\u003cp\u003eAre you looking to progress your career at the intersection of architecture, media, and sales? If so, we might have the perfect position for you: Architizer is on the hunt for a talented \u003cstrong\u003ePartnerships Coordinator\u003c/strong\u003e to join our growing team!\u003c/p\u003e\n\u003cp\u003eThe Partnerships Coordinator will be responsible for driving revenue growth by selling digital advertising solutions to new and existing clients. You will identify and cultivate relationships with businesses, understand their advertising needs, and present tailored solutions that deliver value and achieve their marketing objectives.  The ideal candidate is adept at researching and qualifying inbound and outbound leads and coordinating with existing clients to ensure their projects are executed.\u003c/p\u003e\n\u003cp\u003eYou will act as primary point person to grow and maintain relationships with partners and sponsors, including building product manufacturers, technology brands, and other companies that align with Architizer’s focus on cutting-edge design and innovation. Working closely with Architizer’s Editors and Publisher, you will continually nurture prospects from initial contact through closing deals and fulfillment of client placements. Positioned within a small, dynamic team, this role has room for expansion based on skill set and interest.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou are dedicated to operational excellence and attentive customer service. You have a high EQ and are a conscientious listener. You are meticulous in your attention to detail and communicate clearly. You are autonomous yet collaborative.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMain Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResearch and support lead generation initiatives that surface successful new prospects.\u003c/li\u003e\n\u003cli\u003eConvert qualified leads to opportunities through conscientious and timely follow-ups.\u003c/li\u003e\n\u003cli\u003eIntroduce prospects to Architizer, educating them about the opportunities of connecting with our global community of professional architects and designers.\u003c/li\u003e\n\u003cli\u003eCoordinate and facilitate existing client communications, assets, and deliverables; ensuring their advertising campaigns are effectively implemented and monitored.\u003c/li\u003e\n\u003cli\u003eProvide excellent customer service and support to clients, addressing any concerns or issues promptly.\u003c/li\u003e\n\u003cli\u003eContinuously learn about challenges and opportunities for brands looking to connect with the global architecture community to enhance partner offerings.\u003c/li\u003e\n\u003cli\u003eLeverage Hubspot, Airtable and other workflow tools to operate more efficiently.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExcellent written and verbal communication, negotiation and presentation skills.\u003c/li\u003e\n\u003cli\u003eAbility to build and maintain relationships with clients and stakeholders.\u003c/li\u003e\n\u003cli\u003eSelf-motivated, goal-oriented and able to work independently.\u003c/li\u003e\n\u003cli\u003eA persistent and proactive approach, coupled with a “do-what-it-takes” mentality to achieve outcomes.\u003c/li\u003e\n\u003cli\u003eA deadline-driven work ethic, yet adaptable enough to seize new opportunities as they arise.\u003c/li\u003e\n\u003cli\u003eProficient in CRM software and Microsoft Office Suite.\u003c/li\u003e\n\u003cli\u003eExtremely organized and detail-oriented. Ability to multi-task and balance priorities.\u003c/li\u003e\n\u003cli\u003eProactive and persistent when working leads — not afraid of outreach.\u003c/li\u003e\n\u003cli\u003eAdaptable and eager to learn and implement new processes and technologies.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003e+Points\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassionate about architecture and design.\u003c/li\u003e\n\u003cli\u003eExperience marketing or selling B2B products or services.\u003c/li\u003e\n\u003cli\u003eExperience with the specifying process or architectural products.\u003c/li\u003e\n\u003cli\u003ePresence on and familiarity with LinkedIn as a business tool.\u003c/li\u003e\n\u003cli\u003eProficient in Hubspot, Airtable, Salesforce or other sales and workflow tools\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDetails\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLocation: Remote\u003c/li\u003e\n\u003cli\u003eEmployment: Full-time\u003c/li\u003e\n\u003cli\u003eHours: 9.00am – 5.00pm ET (working hours can become more flexible over time)\u003c/li\u003e\n\u003cli\u003eSalary: $50k to $80k plus generous commissions, commensurate with experience.\u003c/li\u003e\n\u003cli\u003eBenefits include PTO, healthcare, 401k match, and more.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cb\u003eTo apply, please email the following to \u003c/b\u003e\u003ca href=\"mailto:jobs@architizer.com\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e\u003cb\u003ejobs@architizer.com\u003c/b\u003e\u003c/a\u003e \u003cstrong\u003ewith the email subject line “Partnerships Coordinator Application: [YOUR NAME]”\u003c/strong\u003e\u003cb\u003e:\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003e\u003cstrong\u003eAn up-to-date resume\u003c/strong\u003e (attached as a pdf).\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cspan\u003e\u003cstrong\u003eCover letter\u003c/strong\u003e (attached as a pdf). In the cover letter, tell us why you are the right person for this job. Please share relevant experience, insight, and motivation.\u003c/span\u003e\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eLinkedIn profile \u003c/strong\u003e– please include a link to your LI profile in the email.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cspan\u003eIf your application is shortlisted, you will then be given a short assignment to complete in order to demonstrate your skills.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeadline for applications is Friday March 14, 2025 at 11:59 PST\u003c/strong\u003e.\u003c/p\u003e\n\u003chr/\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Architizer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eArchitizer is the largest and fastest growing network for high-end residential, commercial and institutional architecture online. We’re the go-to site for the world’s leading architects and designers to showcase their work. We are looking to further enhance the site to empower architecture \u0026amp; design professionals to operate in a networked world, source products, find work and ultimately build better buildings.\u003c/p\u003e\n\u003cp\u003eWe’re a small but dynamic team of thinkers, creatives, technologists, writers, architects and doers. In the spirit of the architecture field, we approach our objectives with equal parts analysis and creativity. We’re involved both online and offline with architecture and design and collaborate regularly with friends at respected cultural organizations both in New York and globally.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"mailto:jobs@architizer.com\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eApply for This Position\u003c/a\u003e\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\n        \u003cp\u003e\u003ca href=\"https://architizer.com/blog/author/paul-keskeys/\"\u003e\n        \u003cspan\u003e\n            \u003cimg src=\"https://secure.gravatar.com/avatar/f6a6c8b159673d66ae40054c17b6714d?s=96\u0026amp;d=https%3A%2F%2Fblog.architizer.com%2Fwp-content%2Fuploads%2Flogo-600x600-1.jpg\u0026amp;r=g\" data-src=\"https://secure.gravatar.com/avatar/f6a6c8b159673d66ae40054c17b6714d?s=96\u0026amp;d=https%3A%2F%2Fblog.architizer.com%2Fwp-content%2Fuploads%2Flogo-600x600-1.jpg\u0026amp;r=g\" alt=\"Paul Keskeys\"/\u003e\n        \u003c/span\u003e\n        \n    \u003c/a\u003e\u003c/p\u003e\u003cp\u003e\n\t\tPaul Keskeys is Editor in Chief at Architizer. An architect-trained editor, writer and content creator, Paul graduated from UCL and the University of Edinburgh, gaining an MArch in Architectural Design with distinction. Paul has spoken about the art of architecture and storytelling at many national industry events, including AIANY, NeoCon, KBIS, the Future NOW Symposium, the Young Architect Conference and NYCxDesign. As well as hundreds of editorial publications on Architizer, Paul has also had features published in Architectural Digest, PIN—UP Magazine, Archinect, Aesthetica Magazine and PUBLIC Journal.\t\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-02-24T16:01:36Z",
  "modifiedTime": "2025-02-21T17:48:11Z"
}
