{
  "id": "f3f181aa-5e8b-46d3-ac10-3d2fb4a5da77",
  "title": "slender steel bridge with integrated net seating expands over foša port in croatia",
  "link": "https://www.designboom.com/architecture/slender-steel-bridge-integrated-net-seating-fosa-port-croatia-prostorne-taktike-06-27-2025/",
  "description": "the structure by prostorne taktike follows an asymmetric hyperbolic paraboloid geometry. The post slender steel bridge with integrated net seating expands over foša port in croatia appeared first on designboom | architecture \u0026 design magazine.",
  "author": "Antonia Cvitan",
  "published": "Fri, 27 Jun 2025 10:50:55 +0000",
  "source": "https://www.designboom.com/architecture/feed/",
  "categories": [
    "architecture",
    "readers",
    "architecture in croatia",
    "bridge architecture and design",
    "steel architecture and design"
  ],
  "byline": "Antonia Cvitan",
  "length": 3113,
  "excerpt": "bridge over foša by prostorne taktike is a pedestrian structure connecting the city’s historic core with fortin park across the sea channel.",
  "siteName": "designboom | architecture \u0026 design magazine",
  "favicon": "",
  "text": "steel Bridge over Foša Links Heritage and Public SpaceLocated within the UNESCO World Heritage Site of Trogir, Croatia, the Bridge over Foša is a contemporary pedestrian structure that connects the city’s historic core with Fortin Park across the sea channel. Designed by Prostorne Taktike, the bridge serves both infrastructural and social functions while responding to the site’s maritime and urban context.The bridge’s form follows an asymmetric hyperbolic paraboloid geometry, resulting in a slender steel shell structure with variable cross-sections. This shape minimizes visual obstruction, preserving views of the city’s heritage landmarks. Its highest point acts as an unobtrusive threshold, maintaining the visual integrity of the old town.all images by Darko ŠkrobonjaProstorne taktike draws from Trogir’s shipbuilding heritageFor the bridge’s structure, the design team at Prostorne taktike draws from Trogir’s shipbuilding heritage. The internal caisson system, made from flat steel plates, echoes the double-bottom construction method commonly used in shipbuilding. Prefabricated as a single unit in a nearby shipyard, the entire bridge was transported by barge and installed onto pre-prepared abutments within one day. This off-site fabrication approach reduced disruption in the dense urban area while showcasing local industrial expertise.Material selection and finishes were guided by considerations of durability and contextual relevance. The exterior is coated with a three-component system containing metal powder, allowing the surface to gradually develop a rust-like patina similar to Corten steel. This finish offers both aesthetic consistency and long-term protection.the Bridge over Foša connects Trogir’s historic core with Fortin ParkBridge over Foša integrates Seating, Movement, and ViewsThe pedestrian experience was carefully considered in the design. A staircase follows the bridge’s gentlest gradient, with tread materials selected to ensure safety and comfort. A combination of rubber and fine stone aggregate provides a stable walking surface in the stair zones, while softer rubber is used elsewhere for added comfort. On the north side, informal seating zones are integrated into the steeper sections, encouraging use beyond circulation. Facing Fortin Park, the bridge incorporates perforated steel panels fitted with a net. This intervention creates spaces for sitting and gathering, while visually connecting the upper and lower areas of the site. The perforation reduces visual weight and enhances the spatial relationship between the bridge and its surroundings.The design and execution of the Bridge over Foša prioritize structural efficiency, environmental responsibility, and urban sensitivity. The use of locally sourced and recycled materials, combined with efficient fabrication and installation methods, helps reduce the project’s ecological impact. As a result, the bridge integrates contemporary engineering with historical awareness, contributing a new layer to Trogir’s evolving urban landscape.the structure follows an asymmetric hyperbolic paraboloid geometry",
  "image": "https://www.designboom.com/twitterimages/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-1200.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003ch2\u003esteel Bridge over Foša Links Heritage and Public Space\u003c/h2\u003e\u003cp\u003eLocated within the UNESCO World Heritage Site of Trogir, \u003cstrong\u003e\u003ca href=\"https://www.designboom.com/tag/architecture-in-croatia/\"\u003eCroatia\u003c/a\u003e\u003c/strong\u003e, the Bridge over Foša is a contemporary pedestrian structure that connects the city’s historic core with Fortin Park across the sea channel. Designed by Prostorne Taktike, the \u003cstrong\u003e\u003ca href=\"https://www.designboom.com/tag/bridge-architecture-and-design/\"\u003ebridge\u003c/a\u003e\u003c/strong\u003e serves both infrastructural and social functions while responding to the site’s maritime and urban context.\u003c/p\u003e\u003cp\u003eThe bridge’s form follows an asymmetric hyperbolic paraboloid geometry, resulting in a slender \u003cstrong\u003e\u003ca href=\"https://www.designboom.com/tag/steel/\"\u003esteel\u003c/a\u003e\u003c/strong\u003e shell structure with variable cross-sections. This shape minimizes visual obstruction, preserving views of the city’s heritage landmarks. Its highest point acts as an unobtrusive threshold, maintaining the visual integrity of the old town.\u003c/p\u003e\u003cp\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" alt=\"slender steel bridge with integrated net seating expands over foša port in croatia\" width=\"818\" height=\"614\" data-src=\"https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4.jpg\" data-srcset=\"https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4.jpg 818w, https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4-768x576.jpg 768w\" data-sizes=\"auto\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4.jpg\" srcset=\"https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4.jpg 818w, https://static.designboom.com/wp-content/uploads/2025/06/trogir-croatia-bridge-over-fosa-prostorne-taktike-designboom-818-4-768x576.jpg 768w\"/\u003e\u003cbr/\u003eall images by Darko Škrobonja\u003c/p\u003e\u003ch2\u003eProstorne taktike draws from Trogir’s shipbuilding heritage\u003c/h2\u003e\u003cp\u003eFor the bridge’s structure, the \u003cstrong\u003e\u003ca href=\"https://prostornetaktike.com/\" target=\"_blank\" rel=\"noopener\"\u003edesign team\u003c/a\u003e\u003c/strong\u003e at Prostorne taktike draws from Trogir’s shipbuilding heritage. The internal caisson system, made from flat steel plates, echoes the double-bottom construction method commonly used in shipbuilding. Prefabricated as a single unit in a nearby shipyard, the entire bridge was transported by barge and installed onto pre-prepared abutments within one day. This off-site fabrication approach reduced disruption in the dense urban area while showcasing local industrial expertise.\u003c/p\u003e\u003cp\u003eMaterial selection and finishes were guided by considerations of durability and contextual relevance. The exterior is coated with a three-component system containing metal powder, allowing the surface to gradually develop a rust-like patina similar to Corten steel. This finish offers both aesthetic consistency and long-term protection.\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"slender steel bridge with integrated net seating expands over foša port in croatia\" width=\"818\" height=\"614\" data-src=\"https://static.designboom.com/wp-content/dbsub/462064/2025-06-24/bridge-over-fosa-10-685aa5adb7be6.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/462064/2025-06-24/bridge-over-fosa-10-685aa5adb7be6.jpg\"/\u003e\u003cbr/\u003ethe Bridge over Foša connects Trogir’s historic core with Fortin Park\u003c/p\u003e\u003ch2\u003eBridge over Foša integrates Seating, Movement, and Views\u003c/h2\u003e\u003cp\u003eThe pedestrian experience was carefully considered in the design. A staircase follows the bridge’s gentlest gradient, with tread materials selected to ensure safety and comfort. A combination of rubber and fine stone aggregate provides a stable walking surface in the stair zones, while softer rubber is used elsewhere for added comfort. On the north side, informal seating zones are integrated into the steeper sections, encouraging use beyond circulation. Facing Fortin Park, the bridge incorporates perforated steel panels fitted with a net. This intervention creates spaces for sitting and gathering, while visually connecting the upper and lower areas of the site. The perforation reduces visual weight and enhances the spatial relationship between the bridge and its surroundings.\u003c/p\u003e\u003cp\u003eThe design and execution of the Bridge over Foša prioritize structural efficiency, environmental responsibility, and urban sensitivity. The use of locally sourced and recycled materials, combined with efficient fabrication and installation methods, helps reduce the project’s ecological impact. As a result, the bridge integrates contemporary engineering with historical awareness, contributing a new layer to Trogir’s evolving urban landscape.\u003c/p\u003e\u003cp\u003e\u003cimg decoding=\"async\" alt=\"slender steel bridge with integrated net seating expands over foša port in croatia\" width=\"818\" height=\"614\" data-src=\"https://static.designboom.com/wp-content/dbsub/462064/2025-06-24/bridge-over-fosa-3-685aa5adb78d8.jpg\" loading=\"lazy\" src=\"https://static.designboom.com/wp-content/dbsub/462064/2025-06-24/bridge-over-fosa-3-685aa5adb78d8.jpg\"/\u003e\u003cbr/\u003ethe structure follows an asymmetric hyperbolic paraboloid geometry\u003c/p\u003e\u003c/article\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-06-27T10:50:55Z",
  "modifiedTime": "2025-06-27T20:04:18Z"
}
