{
  "id": "09bd005e-aa88-4473-9d58-74ed6e795e1f",
  "title": "Sols 4507-4508: “Just Keep Driving”",
  "link": "https://science.nasa.gov/blog/sols-4507-4508-just-keep-driving/",
  "description": "Written by Natalie Moore, Mission Operations Specialist at Malin Space Science Systems Earth planning date: Wednesday, April 9, 2025 Our drive from Monday’s plan was mostly successful, putting us ~22 meters down the “road” out of an expected 30 meters. A steering command halted the drive a little short when we tried to turn-in-place but […]",
  "author": "",
  "published": "Fri, 11 Apr 2025 23:27:17 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Blogs"
  ],
  "byline": "agreicius",
  "length": 2081,
  "excerpt": "Written by Natalie Moore, Mission Operations Specialist at Malin Space Science Systems",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Mars Science Laboratory Mission Team MembersApr 11, 2025 Written by Natalie Moore, Mission Operations Specialist at Malin Space Science Systems Earth planning date: Wednesday, April 9, 2025 Our drive from Monday’s plan was mostly successful, putting us ~22 meters down the “road” out of an expected 30 meters. A steering command halted the drive a little short when we tried to turn-in-place but instead turned into a rock, which also had the effect of making our position too unstable for arm activities. Oh well! APXS data has been showing the recent terrain as being pretty similar in composition, so the team isn’t complaining about trying again after another drive. Plus, keeping the arm stowed should give us a little more power to play with in the coming sols (an ongoing struggle this Martian winter). Recently, my job on Mastcam has been to make sure our science imaging is as concurrent as possible with required rover activities. This strategy helps save rover awake time, AKA power consumption. Today we did a pretty good job with this, only increasing the total awake time by ~2 minutes even though we planned 52 images! Our imaging today included a mosaic of the “Devil's Gate” ridge including some nodular bedrock and distant “Torote Bowl,” a mosaic of a close-by vein network named “Moonstone Beach,” and several sandy troughs surrounding the bedrock blocks we see here.  ChemCam is planning a LIBS raster on a vertical vein in our workspace named “Jackrabbit Flat,” and a distant RMI mosaic of “Condor Peak” (a butte to the north we’re losing view of). Our drive will happen in the 1400 hour on the first sol, hopefully landing us successfully 53 meters further into this new valley on our way to the boxwork structures to the west! Post-drive, we’re including a test of a “Post Traverse Autonav Terrain Observation” AKA PoTATO - an easy drop-in activity for ground analysis of a rover-built navigation map of our new terrain. Plus we get to say PoTATO a lot. Explore More Keep Exploring Discover More Topics From NASA",
  "image": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/april/https___mars.nasa.gov_msl-raw-images_msss_04505_mhli_4505MH0001900011602747C00_DXXX.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-495831\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003eMars Science Laboratory Mission Team Members\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eApr 11, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\u003cp\u003eWritten by Natalie Moore, Mission Operations Specialist at Malin Space Science Systems\u003c/p\u003e\n\n\n\n\u003cp\u003eEarth planning date: Wednesday, April 9, 2025\u003c/p\u003e\n\n\n\n\u003cp\u003eOur drive from Monday’s plan was mostly successful, putting us ~22 meters down the “road” out of an expected 30 meters. A steering command halted the drive a little short when we tried to turn-in-place but instead turned into a rock, which also had the effect of making our position too unstable for arm activities. Oh well! APXS data has been showing the recent terrain as being pretty similar in composition, so the team isn’t complaining about trying again after another drive. Plus, keeping the arm stowed should give us a little more power to play with in the coming sols (an ongoing struggle this Martian winter).\u003c/p\u003e\n\n\n\n\u003cp\u003eRecently, my job on Mastcam has been to make sure our science imaging is as concurrent as possible with required rover activities. This strategy helps save rover awake time, AKA power consumption. Today we did a pretty good job with this, only increasing the total awake time by ~2 minutes even though we planned 52 images! Our imaging today included a mosaic of the “Devil\u0026#39;s Gate” ridge including some nodular bedrock and distant “Torote Bowl,” a mosaic of a close-by vein network named “Moonstone Beach,” and several sandy troughs surrounding the bedrock blocks we see here. \u003c/p\u003e\n\n\n\n\u003cp\u003eChemCam is planning a LIBS raster on a vertical vein in our workspace named “Jackrabbit Flat,” and a distant RMI mosaic of “Condor Peak” (a butte to the north we’re losing view of). Our drive will happen in the 1400 hour on the first sol, hopefully landing us successfully 53 meters further into this new valley on our way to the boxwork structures to the west! Post-drive, we’re including a test of a “Post Traverse Autonav Terrain Observation” AKA PoTATO - an easy drop-in activity for ground analysis of a rover-built navigation map of our new terrain. Plus we get to say PoTATO a lot.\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\t\t\u003cp\u003e\u003ch2\u003eExplore More\u003c/h2\u003e\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\n\n\n\n\u003cdiv id=\"\"\u003e\n\t\t\t\t\t\u003cp\u003eKeep Exploring\u003c/p\u003e\n\t\t\t\t\t\u003ch2\u003eDiscover More Topics From NASA\u003c/h2\u003e\n\t\t\t\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-04-11T19:27:17-04:00",
  "modifiedTime": "2025-04-11T19:27:19-04:00"
}
