{
  "id": "2a63327f-049f-4f42-85d3-86d91a9d2585",
  "title": "Reasons to be hopeful: five ways science is making the world better",
  "link": "https://www.theguardian.com/world/2024/nov/09/reasons-to-be-hopeful-five-ways-science-is-making-the-world-better",
  "description": "If Trump’s re-election is getting you down, these innovations in medicine and technology should cheer you upIan Sample Continue reading...",
  "author": "Guardian Staff",
  "published": "Sat, 09 Nov 2024 10:00:46 GMT",
  "source": "https://www.theguardian.com/science/space/rss",
  "categories": [
    "World news",
    "Medical research",
    "Health",
    "Science",
    "Society",
    "Vaccines and immunisation",
    "Diabetes",
    "Stem cells",
    "Artificial intelligence (AI)",
    "Computing",
    "Cancer",
    "Astronomy",
    "Renewable energy",
    "Environment",
    "Energy",
    "Space",
    "Technology",
    "Biology"
  ],
  "byline": "",
  "length": 5196,
  "excerpt": "If Trump’s re-election is getting you down, these innovations in medicine and technology should cheer you up",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "Stem cell transplants could reverse diabetesIan SampleHalf a billion people worldwide live with diabetes. There are different types with different causes, but all lead people to have too much sugar in their blood. If not well controlled, this excess glucose can inflict damage throughout the body, putting people at risk of gum disease, nerve damage, kidney disease, blindness, amputations, heart attack, stroke and cancer.For now, patients manage the condition with medicines, insulin and lifestyle changes, but a new generation of treatments could reverse the disease. Details of the first woman treated for type 1 diabetes with stem cells taken from her own body were announced last month. Beforehand, the 25-year-old needed substantial amounts of insulin. Now she produces her own.In April, a similar cell transplant allowed a 59-year-old man with type 2 diabetes to come off insulin. It’s early days and challenges remain, not least around scaling the treatment, but the results so far are exciting.Cancer vaccinesIan SampleVaccines were one of the remarkable success stories of the pandemic. Now scientists hope the same mRNA technology that underpinned the Moderna and Pfizer-BioNTech Covid-19 jabs can be used to train the immune system to recognise and attack cancer.These jabs work by providing an instruction to the patient’s cells to churn out a particular protein that acts as a flag for the immune system to target. In this case, scientists are tailoring the vaccine design to proteins on the surface of a patient’s cancer cells.In August, hundreds of patients entered the world’s first personalised mRNA cancer vaccine trial for melanoma and trials are under way for pancreatic, bowel and other cancers. And since the protection afforded by vaccines can be long-lasting, it may be possible to use the approach as a preventive measure, for those with high genetic risk of breast or ovarian cancer, and to stop cancer returning.AI will help catch cancers more quicklyRobert BoothThe next four years are set to see rapid progress in the use of artificial intelligence to better diagnose serious illnesses like lung cancers and brain tumours, which should mean longer lives.The tech is being rolled out in hospitals, including several in the north of England, to catch cancers quicker and prolong lives. The system, which scans x-rays and prioritises cases where it spots something suspicious that the human clinician may have missed, has been shown to improve diagnostic accuracy by 45% and diagnostic efficiency by 12%, according to the South Tyneside and Sunderland NHS Foundation Trust.Hannah DevlinIn the two years since its launch, the James Webb space telescope has revealed the night sky in a series of images that are technicolour masterpieces. It is also enabling unprecedented discoveries about the origins of stars, black holes, the evolution of the universe and the likelihood of life existing elsewhere in the cosmos.The telescope is so powerful that it has observed galaxies that existed when the universe was less than 300m years old, whose light has travelled for 14bn years – almost the age of the universe itself – to reach us. Capturing light from the first stars to light up the sky – long viewed as a holy grail in astronomy – now appears within reach. Some of these discoveries are upending conventional theories, with the earliest galaxies appearing far brighter or bigger than expected and the first blackholes appearing to have snowballed more quickly than can be explained by current models.In science, weird and unexpected findings are not viewed with disappointment – they are the fuel that powers the next revolution. This telescope promises to do just that for our understanding of the history of the universe and whether we humans are alone in it.Renewable energy is gaining paceJillian AmbroseThe world’s transition to green energy is gaining pace. A recent report by the International Energy Agency (IEA), the world’s energy watchdog, found that over the next six years renewable energy projects are on track to roll out at three times the pace of the previous six years. This would put the world on course to outpace the 2030 goals set by governments to create a total global renewable energy capacity roughly equal to the existing power systems in China, the EU, India and the US combined.In Europe, the boom in solar power caused market prices to turn negative for a record number of hours this summer. Wind developers are preparing to launch a new generation of floating offshore wind turbines to better capture the more powerful wind speeds further from the shore.The green electricity surge will be led by the clean energy programmes of China and India, which would help to displace the fossil fuel consumption of two of the most polluting countries in the world.China will have more than half of the world’s renewables by the end of the decade, according to the IEA, which is already thought to have slowed China’s pipeline of future coal power plants. The number of new permits for coal plants in China has fallen from 100GW in 2022 and 2023 to only 12 new projects totaling 9.1GW in the first half of 2024, according to Global Energy Monitor.",
  "image": "https://i.guim.co.uk/img/media/46b60a3fdb56a8783c16f4a4dc79b013fd5f3b85/0_143_5419_3251/master/5419.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=537e20e11b4b3a7b2fbf601394e7db9d",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003ch2 id=\"stem-cell-transplants-could-reverse-diabetes\"\u003eStem cell transplants could reverse diabetes\u003c/h2\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.theguardian.com/profile/iansample\" data-link-name=\"in body link\"\u003eIan Sample\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eHalf a billion people worldwide live with diabetes. There are different types with different causes, but all lead people to have too much sugar in their blood. If not well controlled, this excess glucose can inflict damage throughout the body, putting people at risk of gum disease, nerve damage, kidney disease, blindness, amputations, heart attack, stroke and cancer.\u003c/p\u003e\u003cp\u003eFor now, patients manage the condition with medicines, insulin and lifestyle changes, but a new generation of treatments could reverse the disease. Details of the first woman treated for type 1 diabetes with \u003ca href=\"https://www.sciencedirect.com/science/article/pii/S0092867424010225\" data-link-name=\"in body link\"\u003estem cells taken from her own body\u003c/a\u003e were announced last month. Beforehand, the 25-year-old needed substantial amounts of insulin. Now she produces her own.\u003c/p\u003e\u003cp\u003eIn April, a \u003ca href=\"https://www.nature.com/articles/s41421-024-00662-3\" data-link-name=\"in body link\"\u003esimilar cell transplant\u003c/a\u003e allowed a 59-year-old man with type 2 diabetes to come off insulin. It’s early days and challenges remain, not least around scaling the treatment, but the results so far are exciting.\u003c/p\u003e\u003ch2 id=\"cancer-vaccines\"\u003eCancer vaccines\u003c/h2\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.theguardian.com/profile/iansample\" data-link-name=\"in body link\"\u003eIan Sample\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eVaccines were one of the remarkable success stories of the pandemic. Now scientists hope the same mRNA technology that underpinned the Moderna and Pfizer-BioNTech Covid-19 jabs can be used to train the immune system to recognise and attack cancer.\u003c/p\u003e\u003cp\u003eThese jabs work by providing an instruction to the patient’s cells to churn out a particular protein that acts as a flag for the immune system to target. In this case, scientists are tailoring the vaccine design to proteins on the surface of a patient’s cancer cells.\u003c/p\u003e\u003cp\u003eIn August, hundreds of patients entered the world’s first personalised mRNA cancer \u003ca href=\"https://www.theguardian.com/society/2024/apr/26/cancer-mrna-vaccine-melanoma-trial\" data-link-name=\"in body link\"\u003evaccine trial for melanoma\u003c/a\u003e and \u003ca href=\"https://www.birmingham.ac.uk/news/2024/birmingham-opens-first-pancreatic-cancer-mrna-vaccine-trial-in-europe\" data-link-name=\"in body link\"\u003etrials are under way for pancreatic\u003c/a\u003e, bowel and \u003ca href=\"https://news.cancerresearchuk.org/2024/05/31/patients-to-access-trials-of-personalised-cancer-vaccines/\" data-link-name=\"in body link\"\u003eother cancers\u003c/a\u003e. And since the protection afforded by vaccines can be long-lasting, it may be possible to use the approach as a preventive measure, for those with high genetic risk of breast or ovarian cancer, and to stop cancer returning.\u003c/p\u003e\u003ch2 id=\"ai-will-help-catch-cancers-more-quickly\"\u003eAI will help catch cancers more quickly\u003c/h2\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.theguardian.com/profile/robertbooth\" data-link-name=\"in body link\"\u003eRobert Booth\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe next four years are set to see rapid progress in the use of artificial intelligence to better diagnose serious illnesses like lung cancers and brain tumours, which should mean longer lives.\u003c/p\u003e\u003cp\u003eThe tech is being rolled out in hospitals, including several in the north of England, to catch cancers quicker and prolong lives. The system, which scans x-rays and prioritises cases where it spots something suspicious that the human clinician may have missed, has been shown to improve diagnostic accuracy by 45% and diagnostic efficiency by 12%, \u003ca href=\"https://www.stsft.nhs.uk/news/latest-news/region-leads-national-roll-out-new-artificial-intelligence-ai-solution-help-diagnose-lung-cancer-quicker\" data-link-name=\"in body link\"\u003eaccording to\u003c/a\u003e the South Tyneside and Sunderland NHS Foundation Trust.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.theguardian.com/profile/hannah-devlin\" data-link-name=\"in body link\"\u003eHannah Devlin\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eIn the two years since its launch, the James Webb space telescope has revealed the night sky in a series of images that are technicolour masterpieces. It is also enabling unprecedented discoveries about the origins of stars, black holes, the evolution of the universe and the likelihood of life existing elsewhere in the cosmos.\u003c/p\u003e\u003cp\u003eThe telescope is so powerful that it has \u003ca href=\"https://www.theguardian.com/science/article/2024/may/31/james-webb-space-telescope-photographs-most-distant-known-galaxy\" data-link-name=\"in body link\"\u003eobserved galaxies that existed when the universe was less than 300m years old\u003c/a\u003e, whose light has travelled for 14bn years – almost the age of the universe itself – to reach us. Capturing light from the first stars to light up the sky – long viewed as a holy grail in astronomy – now appears within reach. Some of these discoveries are upending conventional theories, with the earliest galaxies appearing far brighter or bigger than expected and the first blackholes appearing to have snowballed more quickly than can be explained by current models.\u003c/p\u003e\u003cp\u003eIn science, weird and unexpected findings are not viewed with disappointment – they are the fuel that powers the next revolution. This telescope promises to do just that for our understanding of the history of the universe and whether we humans are alone in it.\u003c/p\u003e\u003ch2 id=\"renewable-energy-is-gaining-pace\"\u003eRenewable energy is gaining pace\u003c/h2\u003e\u003cp\u003e\u003cem\u003e\u003ca href=\"https://www.theguardian.com/profile/jillian-ambrose\" data-link-name=\"in body link\"\u003eJillian Ambrose\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\u003cp\u003eThe world’s transition to green energy is gaining pace. A recent report by the International \u003ca href=\"https://www.theguardian.com/environment/energy\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\"\u003eEnergy\u003c/a\u003e Agency (IEA), the world’s energy watchdog, found that over the next six years renewable energy projects are on track to roll out at three times the pace of the previous six years. This would put the world on course to outpace the 2030 goals set by governments to create a total global renewable energy capacity roughly equal to the existing power systems in China, the EU, India and the US combined.\u003c/p\u003e\u003cp\u003eIn Europe, the boom in solar power caused market prices to turn negative for a record number of hours this summer. Wind developers are preparing to launch a new generation of floating offshore wind turbines to better capture the more powerful wind speeds further from the shore.\u003c/p\u003e\u003cp\u003eThe green electricity surge will be led by the clean energy programmes of China and India, which would help to displace the fossil fuel consumption of two of the most polluting countries in the world.\u003c/p\u003e\u003cp\u003eChina will have more than half of the world’s renewables by the end of the decade, according to the IEA, which is already thought to have slowed China’s pipeline of future coal power plants. The number of new permits for coal plants in China has fallen from 100GW in 2022 and 2023 to only 12 new projects totaling 9.1GW in the first half of 2024, according to Global Energy Monitor.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-09T10:00:46Z",
  "modifiedTime": "2024-11-09T10:00:46Z"
}
