{
  "id": "527ba383-8db9-450a-860d-e7386abc4090",
  "title": "Scientists discover simpler way to achieve Einstein's 'spooky action at a distance' thanks to AI breakthrough — bringing quantum internet closer to reality",
  "link": "https://www.space.com/space-exploration/tech/scientists-discover-simpler-way-to-achieve-einsteins-spooky-action-at-a-distance-thanks-to-ai-breakthrough-bringing-quantum-internet-closer-to-reality",
  "description": "AI has helped physicists discover a simpler way of achieving quantum entanglement. This finding could make it easier to develop quantum communication technologies.",
  "author": "",
  "published": "Sun, 09 Mar 2025 14:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Tech",
    "Space Exploration"
  ],
  "byline": "Peter Ray Allison",
  "length": 5348,
  "excerpt": "AI has helped physicists discover a simpler way of achieving quantum entanglement. This finding could make it easier to develop quantum communication technologies.",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1201310/apple-touch-icon.png",
  "text": "(Image credit: Johan Jarnestad/ The Royal Swedish Academy of Sciences) Scientists have used AI to discover an easier method to form quantum entanglement between subatomic particles, paving the way for simpler quantum technologies.When particles such as photons become entangled, they can share quantum properties — including information — regardless of the distance between them. This phenomenon is important in quantum physics and is one of the features that makes quantum computers so powerful.But the bonds of quantum entanglement have typically proven challenging for scientists to form. This is because it requires the preparation of two separate entangled pairs, then measuring the strength of entanglement — called a Bell-state measurement — on a photon from each of the pairs.These measurements cause the quantum system to collapse and leave the two unmeasured photons entangled, despite them never having directly interacted with one another. This process of \"entanglement swapping\" could be used for quantum teleportation. You may like Scientists find 'spooky' quantum entanglement on incredibly tiny scales — within individual protons Scientists discover new, 3rd form of magnetism that may be the 'missing link' in the quest for superconductivity In a new study, published Dec. 2, 2024 in the journal Physical Review Letters, scientists used PyTheus, an AI tool that has been specifically created for designing quantum-optic experiments. The authors of the paper initially set out to reproduce established protocols for entanglement swapping in quantum communications. However, the AI tool kept producing a much simpler method to achieve quantum entanglement of photons.\"The authors were able to train a neural network on a set of complex data that describes how you set up this kind of experiment in many different conditions, and the network actually learned the physics behind it,\" Sofia Vallecorsa, a research physicist for the quantum technology initiative at CERN, who was not involved in the new research, told Live Science.Related: Quantum data beamed alongside 'classical data' in the same fiber-optic connection for the 1st timeBreaking space news, the latest updates on rocket launches, skywatching events and more!Tapping into AI to simplify quantum entanglementThe AI tool proposed that entanglement could emerge because the paths of photons were indistinguishable: when there are several possible sources the photons could have come from, and if their origins become indistinguishable from one another, then entanglement can be produced between them when none existed before.Although the scientists were initially skeptical of the results, the tool kept returning the same solution, so they tested the theory. By adjusting the photon sources and ensuring they were indistinguishable, the physicists created conditions where detecting photons at certain paths guaranteed that two others emerged entangled.This breakthrough in quantum physics has simplified the process by which quantum entanglement can be formed. In future, it could have implications for the quantum networks used for secure messaging, making these technologies much more feasible.\"The more we can rely on simple technology, the more we can increase the range of applications,\" Vallecorsa said. \"The possibility to build more complex networks that could branch out in different geometries could have a big impact with respect to the single end-to-end case.\"Whether it is practical to scale the technology into a commercially viable process remains to be seen, however, as environmental noise and device imperfections could cause instability in the quantum system.The new study has also provided a convincing argument for the use of AI as a research tool by physicists. \"We are looking more into introducing AI, but there is still a little bit of scepticism, mostly due to what the role of the physicist is going to be once we start going that way,\" Vallecorsa said. \"It is an opportunity for getting a very interesting result and shows in a very compelling way how this can be a tool that physicists use.\" Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Peter is a degree-qualified engineer and experienced freelance journalist, specializing in science, technology and culture. He writes for a variety of publications, including the BBC, Computer Weekly, IT Pro, the Guardian and the Independent. He has worked as a technology journalist for over ten years. Peter has a degree in computer-aided engineering from Sheffield Hallam University. He has worked in both the engineering and architecture sectors, with various companies, including Rolls-Royce and Arup. It was while working in a team of consulting engineers that he became fascinated with journalism. Peter first wrote part-time, but soon became a full-time freelance journalist.  In pursuit of his writing, Peter has interviewed Professor Freeman Dyson, stuck his head inside a fusion reactor and asked awkward questions of several government ministerial departments. He has discussed his articles on national radio, been quoted on television, had his articles translated into other languages and appeared on a New Zealand breakfast television show.",
  "image": "https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1200-80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1920-80.jpg.webp 1920w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1200-80.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-320-80.jpg.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1200-80.jpg\" alt=\"Quantum entanglement enables a range of futuristic technologies.\" srcset=\"https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1920-80.jpg 1920w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1200-80.jpg 1200w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS-320-80.jpg 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/HD5YvLou3pppAA4BHSrsuS.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003e(Image credit: Johan Jarnestad/ The Royal Swedish Academy of Sciences)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eScientists have used AI to discover an easier method to form quantum entanglement between subatomic particles, paving the way for simpler quantum technologies.\u003c/p\u003e\u003cp\u003eWhen particles such as photons become entangled, they can share quantum properties — including information — regardless of the distance between them. This phenomenon is important in\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/quantum-physics-things-you-should-know\" data-before-rewrite-localise=\"https://www.space.com/quantum-physics-things-you-should-know\"\u003e \u003cu\u003equantum physics\u003c/u\u003e\u003c/a\u003e and is one of the features that makes\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/new-quantum-computer-smashes-quantum-supremacy-record\" data-before-rewrite-localise=\"https://www.space.com/new-quantum-computer-smashes-quantum-supremacy-record\"\u003e \u003cu\u003equantum computers\u003c/u\u003e\u003c/a\u003e so powerful.\u003c/p\u003e\u003cp\u003eBut the bonds of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/31933-quantum-entanglement-action-at-a-distance.html\" data-before-rewrite-localise=\"https://www.space.com/31933-quantum-entanglement-action-at-a-distance.html\"\u003equantum entanglement\u003c/a\u003e have typically proven challenging for scientists to form. This is because it requires the preparation of two separate entangled pairs, then measuring the strength of entanglement — called a Bell-state measurement — on a photon from each of the pairs.\u003c/p\u003e\u003cp\u003eThese measurements cause the quantum system to collapse and leave the two unmeasured photons entangled, despite them never having directly interacted with one another. This process of \u0026#34;entanglement swapping\u0026#34; could be used for quantum teleportation.\u003c/p\u003e\u003cdiv data-component-name=\"Recirculation:ArticleRiver\"\u003e\n\u003cp\u003e\u003cspan\u003e\nYou may like\n\u003c/span\u003e\u003c/p\u003e\u003cul data-analytics-id=\"more-about-inline\"\u003e\n\u003cli name=\"more-about-inline\" data-analytics-id=\"more-about-inline-0\"\u003e\n\u003ca href=\"https://www.space.com/spooky-action-small-distance-entanglement-quarks-gluons\" data-before-rewrite-localise=\"https://www.space.com/spooky-action-small-distance-entanglement-quarks-gluons\"\u003e\nScientists find \u0026#39;spooky\u0026#39; quantum entanglement on incredibly tiny scales — within individual protons\n\u003c/a\u003e\n\u003c/li\u003e\n\u003cli name=\"more-about-inline\" data-analytics-id=\"more-about-inline-1\"\u003e\n\u003ca href=\"https://www.space.com/space-exploration/tech/scientists-discover-new-3rd-form-of-magnetism-that-may-be-the-missing-link-in-the-quest-for-superconductivity\" data-before-rewrite-localise=\"https://www.space.com/space-exploration/tech/scientists-discover-new-3rd-form-of-magnetism-that-may-be-the-missing-link-in-the-quest-for-superconductivity\"\u003e\nScientists discover new, 3rd form of magnetism that may be the \u0026#39;missing link\u0026#39; in the quest for superconductivity\n\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003cp\u003eIn a new study, published Dec. 2, 2024 in the journal \u003ca data-analytics-id=\"inline-link\" href=\"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.133.233601\" target=\"_blank\" rel=\"nofollow\" data-url=\"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.133.233601\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003ePhysical Review Letters\u003c/u\u003e\u003c/a\u003e, scientists used\u003ca data-analytics-id=\"inline-link\" href=\"https://github.com/artificial-scientist-lab/PyTheus\" target=\"_blank\" rel=\"nofollow\" data-url=\"https://github.com/artificial-scientist-lab/PyTheus\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e \u003cu\u003ePyTheus\u003c/u\u003e\u003c/a\u003e, an AI tool that has been specifically created for designing quantum-optic experiments. The authors of the paper initially set out to reproduce established protocols for entanglement swapping in quantum communications. However, the AI tool kept producing a much simpler method to achieve quantum entanglement of photons.\u003c/p\u003e\u003cp\u003e\u0026#34;The authors were able to train a neural network on a set of complex data that describes how you set up this kind of experiment in many different conditions, and the network actually learned the physics behind it,\u0026#34; \u003ca data-analytics-id=\"inline-link\" href=\"https://sparks.cern/vallecorsa-sofia\" target=\"_blank\" rel=\"nofollow\" data-url=\"https://sparks.cern/vallecorsa-sofia\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003eSofia Vallecorsa\u003c/u\u003e\u003c/a\u003e, a research physicist for the quantum technology initiative at\u003ca data-analytics-id=\"inline-link\" href=\"https://home.cern/\" target=\"_blank\" rel=\"nofollow\" data-url=\"https://home.cern/\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e \u003cu\u003eCERN\u003c/u\u003e\u003c/a\u003e, who was not involved in the new research, told Live Science.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRelated: \u003c/strong\u003e\u003ca data-analytics-id=\"inline-link\" href=\"https://www.livescience.com/technology/communications/quantum-data-beamed-alongside-classical-data-in-a-single-fiber-optic-connection-for-the-1st-time\" data-url=\"https://www.livescience.com/technology/communications/quantum-data-beamed-alongside-classical-data-in-a-single-fiber-optic-connection-for-the-1st-time\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003e\u003cstrong\u003eQuantum data beamed alongside \u0026#39;classical data\u0026#39; in the same fiber-optic connection for the 1st time\u003c/strong\u003e\u003c/u\u003e\u003c/a\u003e\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-vNo8AJXDgHK6wBHZN4wstM\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003ch2 id=\"tapping-into-ai-to-simplify-quantum-entanglement-3\"\u003eTapping into AI to simplify quantum entanglement\u003c/h2\u003e\u003cp\u003eThe AI tool proposed that entanglement could emerge because the paths of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/what-is-the-electromagnetic-spectrum\" data-before-rewrite-localise=\"https://www.space.com/what-is-the-electromagnetic-spectrum\"\u003ephotons\u003c/a\u003e were indistinguishable: when there are several possible sources the photons could have come from, and if their origins become indistinguishable from one another, then entanglement can be produced between them when none existed before.\u003c/p\u003e\u003cp\u003eAlthough the scientists were initially skeptical of the results, the tool kept returning the same solution, so they tested the theory. By adjusting the photon sources and ensuring they were indistinguishable, the physicists created conditions where detecting photons at certain paths guaranteed that two others emerged entangled.\u003c/p\u003e\u003cp\u003eThis breakthrough in quantum physics has simplified the process by which quantum entanglement can be formed. In future, it could have implications for the quantum networks used for secure messaging, making these technologies much more feasible.\u003c/p\u003e\u003cp\u003e\u0026#34;The more we can rely on simple technology, the more we can increase the range of applications,\u0026#34; Vallecorsa said. \u0026#34;The possibility to build more complex networks that could branch out in different geometries could have a big impact with respect to the single end-to-end case.\u0026#34;\u003c/p\u003e\u003cp\u003eWhether it is practical to scale the technology into a commercially viable process remains to be seen, however, as environmental noise and device imperfections could cause instability in the quantum system.\u003c/p\u003e\u003cp\u003eThe new study has also provided a convincing argument for the use of AI as a research tool by physicists. \u0026#34;We are looking more into introducing AI, but there is still a little bit of scepticism, mostly due to what the role of the physicist is going to be once we start going that way,\u0026#34; Vallecorsa said. \u0026#34;It is an opportunity for getting a very interesting result and shows in a very compelling way how this can be a tool that physicists use.\u0026#34;\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\u003cdiv id=\"slice-container-authorBio-vNo8AJXDgHK6wBHZN4wstM\"\u003e\u003cp\u003ePeter is a degree-qualified engineer and experienced freelance journalist, specializing in science, technology and culture. He writes for a variety of publications, including the BBC, Computer Weekly, IT Pro, the Guardian and the Independent. He has worked as a technology journalist for over ten years.\u003c/p\u003e\n\n\u003cp\u003ePeter has a degree in computer-aided engineering from Sheffield Hallam University. He has worked in both the engineering and architecture sectors, with various companies, including Rolls-Royce and Arup. It was while working in a team of consulting engineers that he became fascinated with journalism. Peter first wrote part-time, but soon became a full-time freelance journalist. \u003c/p\u003e\n\n\u003cp\u003eIn pursuit of his writing, Peter has interviewed Professor Freeman Dyson, stuck his head inside a fusion reactor and asked awkward questions of several government ministerial departments. He has discussed his articles on national radio, been quoted on television, had his articles translated into other languages and appeared on a New Zealand breakfast television show.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-09T14:00:00Z",
  "modifiedTime": "2025-03-09T14:00:00Z"
}
