{
  "id": "54e0b172-344a-4014-be84-d4c282e220b3",
  "title": "Curiosity Blog, Sols 4577-4579: Watch the Skies",
  "link": "https://science.nasa.gov/blog/curiosity-blog-sols-4577-4579-watch-the-skies/",
  "description": "Written by Deborah Padgett, OPGS Task Lead at NASA’s Jet Propulsion Laboratory Earth planning date: Friday, June 20, 2025 During the plan covering Sols 4575-4576, Curiosity continued our investigation of mysterious boxwork structures on the shoulders of Mount Sharp. After a successful 56-meter drive (about 184 feet), Curiosity is now parked in a trough cutting […]",
  "author": "",
  "published": "Sat, 21 Jun 2025 02:29:45 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Blogs"
  ],
  "byline": "Stephen Carney",
  "length": 4074,
  "excerpt": "Written by Deborah Padgett, OPGS Task Lead at NASA's Jet Propulsion Laboratory",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Mars Science Laboratory Mission Team MembersJun 20, 2025 Written by Deborah Padgett, OPGS Task Lead at NASA's Jet Propulsion Laboratory Earth planning date: Friday, June 20, 2025 During the plan covering Sols 4575-4576, Curiosity continued our investigation of mysterious boxwork structures on the shoulders of Mount Sharp. After a successful 56-meter drive (about 184 feet), Curiosity is now parked in a trough cutting through a highly fractured region covered by linear features thought to be evidence of groundwater flow in the distant past of Mars. With all six wheels firmly planted on solid ground, our rover is ready for contact science! Unfortunately, a repeat of the frost-detection experiment expected for the weekend plan is postponed for a few days due to a well-understood ChemCam issue. In the meantime, our atmospheric investigations have a chance to shine, as they received additional time to observe the Martian sky. In the early afternoon of Sol 4577, Curiosity’s navigation cameras will take a movie of the upper reaches of Aeolis Mons (Mount Sharp), hoping to see moving cloud shadows. This observation enables the team to calculate the altitude of clouds drifting over the peak. Next, Navcam will point straight up, to image cloud motion at the zenith and determine wind direction at their altitude. Mastcam will then do a series of small mosaics to study the rover workspace and features of the trough that Curiosity has entered. First is a 6x4 stereo mosaic of the workspace and the contact science targets “Copacabana” and “Copiapo.” The first target is a representative sample of the trough bedrock, and its name celebrates a town in Bolivia located on the shores of Lake Titicaca. The second target is a section of lighter-toned material, which may be associated with stripes or “veins” filling the many crosscutting fractures in the local stones. These are the deposits potentially left by groundwater intrusion long ago. The name “Copiapo” honors a silver mining city in the extremely dry Atacama desert of northern Chile. A second 6x3 Mastcam stereo mosaic will look at active cracks in the trough. Two additional 5x1 Mastcam stereo mosaics target “Ardamarca,” a ridge parallel to the trough walls, and a cliff exposing layers of rock at the base of “Mishe Mokwa” butte. At our current location, all the Curiosity target names are taken from the Uyuni geologic quadrangle named after the otherworldly lake bed and ephemeral lake high on the Bolivian altiplano, but the Mishe Mokwa butte is back in the Altadena quad, named for a popular hiking trail in the Santa Monica Mountains. After this lengthy science block, Curiosity will deploy its arm, brush the dust from Copacabana with the DRT, then image both it and Copiapo with the MAHLI microscopic imager. Overnight, APXS will determine the composition of these two targets.  Early in the morning of Sol 4578, Mastcam will take large 27x5 and 18x3 stereo mosaics of different parts of the trough, using morning light to highlight the terrain shadows. Later in the day, Navcam will do a 360 sky survey, determining phase function across the entire sky. A 25-meter drive (about 82 feet) will follow, and the post-drive imaging includes both a 360-degree Navcam panorama of our new location and an image of the ground under the rover with MARDI in the evening twilight. The next sol is all atmospheric science, with an extensive set of afternoon suprahorizon movies and a dust-devil survey for Navcam, as well as a Mastcam dust opacity observation. The final set of observations in this plan happens on the morning of Sol 4580 with more Navcam suprahorizon and zenith movies to observe clouds, a Navcam dust opacity measurement across Gale Crater, and a last Mastcam tau. On Monday, we expect to plan another drive and hope to return to the frost-detection experiment soon as we explore the boxwork canyons of Mars. Share Details Explore More Keep Exploring Discover More Topics From NASA",
  "image": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/june/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04575_opgs_edr_ncam_NRB_803647451EDR_F1170000NCAM00274M_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-873310\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003ch3\u003eMars Science Laboratory Mission Team Members\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eJun 20, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\n\n\n\n\n\n\u003cp\u003eWritten by Deborah Padgett, OPGS Task Lead at NASA\u0026#39;s Jet Propulsion Laboratory\u003c/p\u003e\n\n\n\n\u003cp\u003eEarth planning date: Friday, June 20, 2025\u003c/p\u003e\n\n\n\n\u003cp\u003eDuring the plan covering Sols 4575-4576, Curiosity continued our investigation of mysterious boxwork structures on the shoulders of Mount Sharp. After a successful 56-meter drive (about 184 feet), Curiosity is now parked in a trough cutting through a highly fractured region covered by linear features thought to be evidence of groundwater flow in the distant past of Mars. With all six wheels firmly planted on solid ground, our rover is ready for contact science! Unfortunately, a repeat of the frost-detection experiment expected for the weekend plan is postponed for a few days due to a well-understood ChemCam issue. In the meantime, our atmospheric investigations have a chance to shine, as they received additional time to observe the Martian sky.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the early afternoon of Sol 4577, Curiosity’s navigation cameras will take a movie of the upper reaches of Aeolis Mons (Mount Sharp), hoping to see moving cloud shadows. This observation enables the team to calculate the altitude of clouds drifting over the peak. Next, Navcam will point straight up, to image cloud motion at the zenith and determine wind direction at their altitude. Mastcam will then do a series of small mosaics to study the rover workspace and features of the trough that Curiosity has entered. First is a 6x4 stereo mosaic of the workspace and the contact science targets “Copacabana” and “Copiapo.” The first target is a representative sample of the trough bedrock, and its name celebrates a town in Bolivia located on the shores of Lake Titicaca. The second target is a section of lighter-toned material, which may be associated with stripes or “veins” filling the many crosscutting fractures in the local stones. These are the deposits potentially left by groundwater intrusion long ago. The name “Copiapo” honors a silver mining city in the extremely dry Atacama desert of northern Chile. A second 6x3 Mastcam stereo mosaic will look at active cracks in the trough. Two additional 5x1 Mastcam stereo mosaics target “Ardamarca,” a ridge parallel to the trough walls, and a cliff exposing layers of rock at the base of “Mishe Mokwa” butte. At our current location, all the Curiosity target names are taken from the Uyuni geologic quadrangle named after the otherworldly lake bed and ephemeral lake high on the Bolivian altiplano, but the Mishe Mokwa butte is back in the Altadena quad, named for a popular hiking trail in the Santa Monica Mountains. After this lengthy science block, Curiosity will deploy its arm, brush the dust from Copacabana with the DRT, then image both it and Copiapo with the MAHLI microscopic imager. Overnight, APXS will determine the composition of these two targets. \u003c/p\u003e\n\n\n\n\u003cp\u003eEarly in the morning of Sol 4578, Mastcam will take large 27x5 and 18x3 stereo mosaics of different parts of the trough, using morning light to highlight the terrain shadows. Later in the day, Navcam will do a 360 sky survey, determining phase function across the entire sky. A 25-meter drive (about 82 feet) will follow, and the post-drive imaging includes both a 360-degree Navcam panorama of our new location and an image of the ground under the rover with MARDI in the evening twilight. The next sol is all atmospheric science, with an extensive set of afternoon suprahorizon movies and a dust-devil survey for Navcam, as well as a Mastcam dust opacity observation. The final set of observations in this plan happens on the morning of Sol 4580 with more Navcam suprahorizon and zenith movies to observe clouds, a Navcam dust opacity measurement across Gale Crater, and a last Mastcam tau. On Monday, we expect to plan another drive and hope to return to the frost-detection experiment soon as we explore the boxwork canyons of Mars.\u003c/p\u003e\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\n\n\u003cdiv id=\"\"\u003e\n\t\t\t\t\u003cp\u003e\u003ch2\u003eExplore More\u003c/h2\u003e\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\u003cdiv id=\"\"\u003e\n\t\t\t\t\t\u003cp\u003eKeep Exploring\u003c/p\u003e\n\t\t\t\t\t\u003ch2\u003eDiscover More Topics From NASA\u003c/h2\u003e\n\t\t\t\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-06-20T22:29:45-04:00",
  "modifiedTime": "2025-06-20T22:29:48-04:00"
}
