{
  "id": "6374185d-5280-4b66-9629-19204219f724",
  "title": "'Cosmic miracle!' James Webb Space Telescope discovers the earliest galaxy ever seen",
  "link": "https://www.space.com/astronomy/cosmic-miracle-james-webb-space-telescope-discovers-the-earliest-galaxy-ever-seen",
  "description": "The James Webb Space Telescope has done it again, discovering the \"mother of all early galaxies,\" a record-breaking distant object that existed just 280 billion years after the Big Bang.",
  "author": "Robert Lea",
  "published": "Fri, 30 May 2025 21:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Astronomy"
  ],
  "byline": "Robert Lea",
  "length": 6386,
  "excerpt": "\"This is the most distant object known to humanity.\"",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1283061/apple-touch-icon.png",
  "text": "(Main) An illustration of a highly redshifted early galaxy. (Inset) the earliest galaxy ever detected MoM z14, as seen by the JWST (Image credit: Robert Lea (created with Canva)/ Naidu et al (2025)) The James Webb Space Telescope (JWST) excels at a lot of things, but there are two things it does better than any other scientific instrument in human history: spotting early galaxies and breaking its own records!Now, the $10 billion NASA space telescope has done both things again, detecting a galaxy that existed just 280 million years after the Big Bang, a feat that the team behind this research has dubbed a \"cosmic miracle.\"Currently, as the earliest and most distant galaxy ever detected, this \"the mother of all early galaxies,\" this new JWST discovery has been fittingly designated \"MoM z14.\"\"First and foremost, at the moment, this is the most distant object known to humanity. That title changes every so often, but I find it is always cause for pause and reflection,\" team member and Yale University professor of Astronomy and Physics Pieter van Dokkum told Space.com. \"MoM z14 existed when the universe was about 280 million years old - we're getting quite close to the Big Bang.\"Just to put that in context, sharks have been around on Earth for a longer timespan!\"The JWST is seeing red againSince it began sending data back to Earth in the summer of 2022, the JWST has excelled in detecting galaxies at so-called \"high redshifts.\" Redshift refers to the phenomenon of the wavelength of light from distant and thus early sources being stretched and shifted toward the \"red end\" of the electromagnetic spectrum as it traverses expanding space. The earlier and thus further away an object is, the greater the redshift.The galaxy JADES-GS-z14-0 as seen by the James Webb Space Telescope is the most distant and earliest galaxy ever spotted existing just 300 million years (Image credit: NASA, ESA, CSA, STScI, B. Robertson (UC Santa Cruz), B. Johnson (CfA), S. Tacchella (Cambridge), P. Cargile (CfA).)Prior to the discovery of MoM z14, the galaxy holding the title of earliest and distant was JADES-GS-z14-0, which existed just 300 million years after the Big Bang, or around 13.5 billion years ago. This previous record galaxy has a redshift of z =14.32, while MoM z14 has a redshift of z = 14.44.What do we know about the mother of all early galaxies?There is a wider context to the observation of MoM z14 than the fact that it has broken the record for earliest known galaxy by 20 million years, though, as van Dokkum explained.\"The broader story here is that JWST was not expected to find any galaxies this early in the history of the universe, at least not at this stage of the mission,\" van Dokkum said. \"There are, very roughly, over 100 more relatively bright galaxies in the very early universe than were expected based on pre-JWST observations.\"Also, in addition to detecting this new, earliest, and most distant galaxy, the team was able to determine some of its characteristics using the JWST.Breaking space news, the latest updates on rocket launches, skywatching events and more!MoM z14 as seen by the JWST as it existed just 280 million years after the Big Bang. (Image credit: Naidu et al (2025))The researchers were able to determine that MoM z14 is around 50 times smaller than the Milky Way. The team also measured emission lines from the galaxy, indicating the presence of elements like nitrogen and carbon.\"The emission lines are unusual; it indicates that the galaxy is very young, with a rapidly increasing rate of forming new stars,\" van Dokkum said. \"There are also indications that there is not much neutral hydrogen gas surrounding the galaxy, which would be surprising: the very early universe is expected to be filled with neutral hydrogen. \"That needs even better spectra and more galaxies, to investigate more fully.\"An illustration of the James Webb Space Telescope in action. (Image credit: NASA)The presence of carbon and nitrogen in MoM z14 indicates that there are earlier galaxies to be discovered than this 13.52 billion-year-old example.That is because the very earliest galaxies in the universe and their stars were filled with the simplest elements in the cosmos, hydrogen and helium.Later galaxies would be populated by these heavier elements, which astronomers somewhat confusingly call \"metal,\" as their stars forged them and then dispersed them in supernova explosions.\"MoM z14 is not one of the very first objects that formed in the universe, as the stars in those galaxies are composed of hydrogen and helium only - we would not see carbon or nitrogen,\" van Dokkum said. \"It could be part of the first wave of formation of 'normal' galaxies, that is, the first galaxies that have elements like nitrogen and carbon - but we've thought that before!\"As for finding even earlier galaxies than MoM z14 and perhaps even detecting that first generation, van Dokkum is confident that the JWST is up to the task.He explained: \"The JWST continues to push the boundary beyond where we thought it was, and at this point I would not be surprised if we find galaxies at z =15 or z =16!\"For now, van Dokkum and the rest of this team, led by Rohan Naidu of MIT's Kavli Institute for Astrophysics and Space Research, can celebrate breaking new ground in our understanding of the early cosmos.\"In a program like this, the whole team is always hoping for a 'miracle,' that is, that some of the candidate extremely early galaxies actually pan out and are not 'mirages,' objects whose colors look like extremely early objects,\" van Dokkum concluded. \"While we were hoping for some very early objects, I don't think any of us expected to break the redshift record!\"A pre-peer-reviewed version of the team's research is published on the paper repository site arXiv. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Robert Lea is a science journalist in the U.K. whose articles have been published in Physics World, New Scientist, Astronomy Magazine, All About Space, Newsweek and ZME Science. He also writes about science communication for Elsevier and the European Journal of Physics. Rob holds a bachelor of science degree in physics and astronomy from the U.K.’s Open University. Follow him on Twitter @sciencef1rst.",
  "image": "https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1600-80.png.webp 1920w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1200-80.png.webp 1200w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1024-80.png.webp 1024w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-970-80.png.webp 970w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-650-80.png.webp 650w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-480-80.png.webp 480w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-320-80.png.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL.png\" alt=\"(Main) an illustration of a highly redshifted early galaxy (Inset) the earliest galaxy ever detected MoM z14\" srcset=\"https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1600-80.png 1920w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1200-80.png 1200w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-1024-80.png 1024w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-970-80.png 970w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-650-80.png 650w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-480-80.png 480w, https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL-320-80.png 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL.png\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/rRzkAXFXLWy6XDm2kWjUSL.png\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003e(Main) An illustration of a highly redshifted early galaxy. (Inset) the earliest galaxy ever detected MoM z14, as seen by the JWST\u003c/span\u003e\n\u003cspan\u003e(Image credit: Robert Lea (created with Canva)/ Naidu et al (2025))\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cdiv\u003e\u003cp\u003eThe James Webb Space Telescope (JWST) excels at a lot of things, but there are two things it does better than any other scientific instrument in human history: spotting early galaxies and breaking its own records!\u003c/p\u003e\u003cp\u003eNow, the $10 billion NASA space telescope has done both things again, detecting a galaxy that existed just 280 million years after \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/25126-big-bang-theory.html\" data-before-rewrite-localise=\"https://www.space.com/25126-big-bang-theory.html\"\u003ethe Big Bang, \u003c/a\u003ea feat that the team behind this research has dubbed a \u0026#34;cosmic miracle.\u0026#34;\u003c/p\u003e\u003cp\u003eCurrently, as the earliest and most distant galaxy ever detected, this \u0026#34;the mother of all early galaxies,\u0026#34; this new\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/21925-james-webb-space-telescope-jwst.html\" data-before-rewrite-localise=\"https://www.space.com/21925-james-webb-space-telescope-jwst.html\"\u003e JWST \u003c/a\u003ediscovery has been fittingly designated \u0026#34;MoM z14.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u0026#34;First and foremost, at the moment, this is the most distant object known to humanity. That title changes every so often, but I find it is always cause for pause and reflection,\u0026#34; team member and Yale University professor of Astronomy and Physics Pieter van Dokkum told Space.com. \u0026#34;MoM z14 existed when the universe was about 280 million years old - we\u0026#39;re getting quite close to the Big Bang.\u003c/p\u003e\u003cp\u003e\u0026#34;Just to put that in context, sharks have been around on Earth for a longer timespan!\u0026#34;\u003c/p\u003e\u003ch2 id=\"the-jwst-is-seeing-red-again-3\"\u003eThe JWST is seeing red again\u003c/h2\u003e\u003cdiv\u003e\u003cp\u003eSince it began sending data back to Earth in the summer of 2022, the JWST has excelled in detecting galaxies at so-called \u0026#34;high redshifts.\u0026#34; \u003c/p\u003e\u003cp\u003e\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/25732-redshift-blueshift.html\" data-before-rewrite-localise=\"https://www.space.com/25732-redshift-blueshift.html\"\u003eRedshift \u003c/a\u003erefers to the phenomenon of the wavelength of light from distant and thus early sources being stretched and shifted toward the \u0026#34;red end\u0026#34; of the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/what-is-the-electromagnetic-spectrum\" data-before-rewrite-localise=\"https://www.space.com/what-is-the-electromagnetic-spectrum\"\u003eelectromagnetic spectrum\u003c/a\u003e as it traverses expanding space. \u003c/p\u003e\u003cp\u003eThe earlier and thus further away an object is, the greater the redshift.\u003c/p\u003e\u003c/div\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG.jpg\" alt=\"The galaxy JADES-GS-z14-0 as seen by the James Webb Space Telescope is the most distant and earliest galaxy ever spotted existing just 300 million years\" srcset=\"https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/UbJdeBq66ar8fukSnYx6CG.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eThe galaxy JADES-GS-z14-0 as seen by the James Webb Space Telescope is the most distant and earliest galaxy ever spotted existing just 300 million years \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: NASA, ESA, CSA, STScI, B. Robertson (UC Santa Cruz), B. Johnson (CfA), S. Tacchella (Cambridge), P. Cargile (CfA).)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePrior to the discovery of MoM z14, the galaxy holding the title of earliest and distant was \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/james-webb-space-telescope-two-oldest-most-distant-galaxies\" data-before-rewrite-localise=\"https://www.space.com/james-webb-space-telescope-two-oldest-most-distant-galaxies\"\u003eJADES-GS-z14-0\u003c/a\u003e, which existed just 300 million years after the Big Bang, or around 13.5 billion years ago. \u003c/p\u003e\u003cp\u003eThis previous record galaxy has a redshift of \u003cem\u003ez \u003c/em\u003e=14.32, while MoM z14 has a redshift of z = 14.44.\u003c/p\u003e\u003c/div\u003e\u003ch2 id=\"what-do-we-know-about-the-mother-of-all-early-galaxies-3\"\u003eWhat do we know about the mother of all early galaxies?\u003c/h2\u003e\u003cp\u003eThere is a wider context to the observation of MoM z14 than the fact that it has broken the record for earliest known galaxy by 20 million years, though, as van Dokkum explained.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;The broader story here is that JWST was not expected to find any galaxies this early in the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/13320-big-bang-universe-10-steps-explainer.html\" data-before-rewrite-localise=\"https://www.space.com/13320-big-bang-universe-10-steps-explainer.html\"\u003ehistory of the universe\u003c/a\u003e, at least not at this stage of the mission,\u0026#34; van Dokkum said. \u0026#34;There are, very roughly, over 100 more relatively bright galaxies in the very early universe than were expected based on pre-JWST observations.\u0026#34;\u003c/p\u003e\u003cp\u003eAlso, in addition to detecting this new, earliest, and most distant galaxy, the team was able to determine some of its characteristics using the JWST.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-NwgqMLugM46xd7VHwfZAV5\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-320-80.png.webp 320w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-480-80.png.webp 480w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-650-80.png.webp 650w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-970-80.png.webp 970w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-1024-80.png.webp 1024w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-1200-80.png.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM.png\" alt=\"A pixelated red dot against a black and blue background\" srcset=\"https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-320-80.png 320w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-480-80.png 480w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-650-80.png 650w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-970-80.png 970w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-1024-80.png 1024w, https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM-1200-80.png 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM.png\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/PVHZVUHoMazfocizvRDyiM.png\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eMoM z14 as seen by the JWST as it existed just 280 million years after the Big Bang. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Naidu et al (2025))\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe researchers were able to determine that MoM z14 is around 50 times smaller than \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/19915-milky-way-galaxy.html\" data-before-rewrite-localise=\"https://www.space.com/19915-milky-way-galaxy.html\"\u003ethe Milky Way\u003c/a\u003e. The team also measured emission lines from the galaxy, indicating the presence of elements like nitrogen and carbon.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u0026#34;The emission lines are unusual; it indicates that the galaxy is very young, with a rapidly increasing rate of forming new stars,\u0026#34; van Dokkum said. \u0026#34;There are also indications that there is not much neutral hydrogen gas surrounding the galaxy, which would be surprising: the very early universe is expected to be filled with neutral hydrogen. \u003c/p\u003e\u003cp\u003e\u0026#34;That needs even better spectra and more galaxies, to investigate more fully.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN.jpg\" alt=\"a spacecraft floats in space. it consists of a roughly triangular body beneath a hexagonal mirror made of smaller gold hexagonal mirrors\" srcset=\"https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/eaDsw8wD7rBnt6atStmRFN.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eAn illustration of the James Webb Space Telescope in action. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: NASA)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe presence of carbon and nitrogen in MoM z14 indicates that there are earlier galaxies to be discovered than this 13.52 billion-year-old example.\u003c/p\u003e\u003cp\u003eThat is because the very earliest galaxies in the universe and their stars were filled with the simplest elements in the cosmos, hydrogen and helium.\u003c/p\u003e\u003cp\u003eLater galaxies would be populated by these heavier elements, which astronomers somewhat confusingly call \u0026#34;metal,\u0026#34; as their stars forged them and then dispersed them in supernova explosions.\u003c/p\u003e\u003cp\u003e\u0026#34;MoM z14 is not one of the very first objects that formed in the universe, as the stars in those galaxies are composed of hydrogen and helium only - we would not see carbon or nitrogen,\u0026#34; van Dokkum said. \u0026#34;It \u003cem\u003ecould\u003c/em\u003e be part of the first wave of formation of \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/30010-ancient-lopsided-galaxy-assembly-first-view.html\" data-before-rewrite-localise=\"https://www.space.com/30010-ancient-lopsided-galaxy-assembly-first-view.html\"\u003e\u0026#39;normal\u0026#39; galaxies\u003c/a\u003e, that is, the first galaxies that have elements like nitrogen and carbon - but we\u0026#39;ve thought that before!\u0026#34;\u003c/p\u003e\u003cp\u003eAs for finding even earlier galaxies than MoM z14 and perhaps even detecting that first generation, van Dokkum is confident that the JWST is up to the task.\u003c/p\u003e\u003cp\u003eHe explained: \u0026#34;The JWST continues to push the boundary beyond where we thought it was, and at this point I would not be surprised if we find galaxies at \u003cem\u003ez\u003c/em\u003e =15 or \u003cem\u003ez\u003c/em\u003e =16!\u0026#34;\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eFor now, van Dokkum and the rest of this team, led by Rohan Naidu of MIT\u0026#39;s Kavli Institute for Astrophysics and Space Research, can celebrate breaking new ground in our understanding of the early cosmos.\u003c/p\u003e\u003cp\u003e\u0026#34;In a program like this, the whole team is always hoping for a \u0026#39;miracle,\u0026#39; that is, that some of the candidate extremely early galaxies actually pan out and are not \u0026#39;mirages,\u0026#39; objects whose colors look like extremely early objects,\u0026#34; van Dokkum concluded. \u0026#34;While we were hoping for some very early objects, I don\u0026#39;t think any of us expected to break the redshift record!\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cp\u003eA pre-peer-reviewed version of the team\u0026#39;s research is published on the paper repository site \u003ca data-analytics-id=\"inline-link\" href=\"https://arxiv.org/pdf/2505.11263\" target=\"_blank\" data-url=\"https://arxiv.org/pdf/2505.11263\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003earXiv.\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-NwgqMLugM46xd7VHwfZAV5\"\u003e\u003cp\u003eRobert Lea is a science journalist in the U.K. whose articles have been published in Physics World, New Scientist, Astronomy Magazine, All About Space, Newsweek and ZME Science. He also writes about science communication for Elsevier and the European Journal of Physics. Rob holds a bachelor of science degree in physics and astronomy from the U.K.’s Open University. Follow him on Twitter @sciencef1rst.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-05-30T21:00:00Z",
  "modifiedTime": null
}
