{
  "id": "6db39e27-b878-4ab1-9c85-b3d5e5c558a7",
  "title": "NASA Astronaut to Answer Questions from Students in Washington State",
  "link": "https://www.nasa.gov/news-release/nasa-astronaut-to-answer-questions-from-students-in-washington-state/",
  "description": "NASA astronaut and Spokane, Washington, native Anne McClain will participate in an event with students from the Mobius Discovery Center located in her hometown. McClain will answer prerecorded questions submitted by students from aboard the International Space Station. Watch the 20-minute Earth-to-space call on the NASA STEM YouTube Channel. The event will take place at […]",
  "author": "Gerelle Q. Dodson",
  "published": "Thu, 22 May 2025 19:00:16 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Humans in Space",
    "In-flight Education Downlinks",
    "International Space Station (ISS)",
    "Johnson Space Center",
    "Learning Resources",
    "NASA Headquarters"
  ],
  "byline": "",
  "length": 2086,
  "excerpt": "NASA astronaut and Spokane, Washington, native Anne McClain will participate in an event with students from the Mobius Discovery Center located in her",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Gerelle Q. DodsonMay 22, 2025 NASA astronaut and Spokane, Washington, native Anne McClain will participate in an event with students from the Mobius Discovery Center located in her hometown. McClain will answer prerecorded questions submitted by students from aboard the International Space Station. Watch the 20-minute Earth-to-space call on the NASA STEM YouTube Channel. The event will take place at 1:25 p.m. EDT on Tuesday, May 27. Media interested in covering the event must RSVP no later than 5 p.m. EDT on Friday, May 23, to Karen Hudson at 509-321-7125 or via email at: mkhudson@mobiusspokane.org. The Mobius Discovery Center will host the event for elementary, middle, and high school students from various schools across the region, nonprofit organizations, and the Kalispel Tribe. This event is designed to foster imagination among students through exploration of hands-on exhibits and science, technology, engineering, art, and mathematics learning opportunities while inspiring students to consider McClain’s career path. For more than 24 years, astronauts have continuously lived and worked aboard the space station, testing technologies, performing science, and developing skills needed to explore farther from Earth. Astronauts aboard the orbiting laboratory communicate with NASA’s Mission Control Center in Houston 24 hours a day through SCaN’s (Space Communications and Navigation) Near Space Network. Important research and technology investigations taking place aboard the space station benefit people on Earth and lays the groundwork for other agency missions. As part of NASA’s Artemis campaign, the agency will send astronauts to the Moon to prepare for future human exploration of Mars, inspiring Artemis Generation explorers, and ensuring the United States continues to lead in space exploration and discovery. See videos of astronauts aboard the space station at: https://www.nasa.gov/stemonstation -end- Gerelle DodsonHeadquarters, Washington202-358-1600gerelle.q.dodson@nasa.gov Sandra JonesJohnson Space Center, Houston281-483-5111sandra.p.jones@nasa.gov",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/05/may-27-downlink-in-washington-image.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-868849\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/4e7fbc664d1fec4396a060e9a95a60c1?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Gerelle Q. Dodson\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eGerelle Q. Dodson\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMay 22, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eNASA astronaut and Spokane, Washington, native Anne McClain will participate in an event with students from the Mobius Discovery Center located in her hometown. McClain will answer prerecorded questions submitted by students from aboard the International Space Station.\u003c/p\u003e\n\u003cp\u003eWatch the 20-minute Earth-to-space call on the \u003ca href=\"https://www.youtube.com/@NASASTEM/live\" rel=\"noopener\"\u003eNASA STEM YouTube Channel\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe event will take place at 1:25 p.m. EDT on Tuesday, May 27. Media interested in covering the event must RSVP no later than 5 p.m. EDT on Friday, May 23, to Karen Hudson at 509-321-7125 or via email at: \u003ca href=\"mailto:mkhudson@mobiusspokane.org\"\u003emkhudson@mobiusspokane.org\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe Mobius Discovery Center will host the event for elementary, middle, and high school students from various schools across the region, nonprofit organizations, and the Kalispel Tribe. This event is designed to foster imagination among students through exploration of hands-on exhibits and science, technology, engineering, art, and mathematics learning opportunities while inspiring students to consider McClain’s career path.\u003c/p\u003e\n\u003cp\u003eFor more than 24 years, astronauts have continuously lived and worked aboard the space station, testing technologies, performing science, and developing skills needed to explore farther from Earth. Astronauts aboard the orbiting laboratory communicate with NASA’s Mission Control Center in Houston 24 hours a day through \u003ca href=\"https://www.nasa.gov/directorates/heo/scan/index.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSCaN\u003c/a\u003e’s (Space Communications and Navigation) Near Space Network.\u003c/p\u003e\n\u003cp\u003eImportant research and technology investigations taking place aboard the space station benefit people on Earth and lays the groundwork for other agency missions. As part of NASA’s \u003ca href=\"http://www.nasa.gov/artemis\"\u003eArtemis\u003c/a\u003e campaign, the agency will send astronauts to the Moon to prepare for future human exploration of Mars, inspiring Artemis Generation explorers, and ensuring the United States continues to lead in space exploration and discovery.\u003c/p\u003e\n\u003cp\u003eSee videos of astronauts aboard the space station at:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/stemonstation\"\u003e\u003cstrong\u003ehttps://www.nasa.gov/stemonstation\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eGerelle Dodson\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:gerelle.q.dodson@nasa.gov\"\u003egerelle.q.dodson@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSandra Jones\u003cbr/\u003eJohnson Space Center, Houston\u003cbr/\u003e281-483-5111\u003cbr/\u003e\u003ca href=\"mailto:sandra.p.jones@nasa.gov\"\u003esandra.p.jones@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
