{
  "id": "7a767860-7578-47e9-aec2-ee0da6b9917f",
  "title": "NASA to Test Technology for X-59’s Unique Shock Wave Measurements",
  "link": "https://www.nasa.gov/image-article/nasa-to-test-technology-for-x-59s-unique-shock-wave-measurements/",
  "description": "NASA will soon test advancements made on a key tool for measuring the unique “sonic thumps” that its quiet supersonic X-59 research aircraft will make while flying. A shock-sensing probe is a cone-shaped air data probe developed with specific features to capture the unique shock waves the X-59 will produce. Researchers at NASA’s Armstrong Flight […]",
  "author": "Dede Dinius",
  "published": "Thu, 05 Dec 2024 22:49:29 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Advanced Air Vehicles Program",
    "Aeronautics",
    "Aeronautics Research Mission Directorate",
    "Armstrong Flight Research Center",
    "Commercial Supersonic Technology",
    "Integrated Aviation Systems Program",
    "Low Boom Flight Demonstrator",
    "Quesst (X-59)",
    "Supersonic Flight"
  ],
  "byline": "",
  "length": 3581,
  "excerpt": "NASA will soon test advancements made on a key tool for measuring the unique “sonic thumps” that its quiet supersonic X-59 research aircraft will make while",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "NASA will soon test advancements made on a key tool for measuring the unique “sonic thumps” that its quiet supersonic X-59 research aircraft will make while flying. A shock-sensing probe is a cone-shaped air data probe developed with specific features to capture the unique shock waves the X-59 will produce. Researchers at NASA’s Armstrong Flight Research Center in Edwards, California developed two versions of the probe to collect precise pressure data during supersonic flight. One probe is optimized for near-field measurements, capturing shock waves that occur very close to where the X-59 will generate them. The second shock-sensing probe will measure the mid-field, collecting data at altitudes between 5,000 to 20,000 feet below the aircraft. When an aircraft flies supersonic, it generates shockwaves that travel through the surrounding air, producing loud sonic booms. The X-59 is designed to divert those shock waves, reducing the loud sonic booms to quieter sonic thumps. During test flights, an F-15B aircraft with a shock-sensing probe attached to its nose will fly with the X-59. The roughly 6-foot probe will continuously collect thousands of pressure samples per second, capturing air pressure changes as it flies through shock waves. Data from the sensors will be vital for validating computer models that predict the strength of the shock waves produced by the X-59, the centerpiece of NASA’s Quesst mission. “A shock-sensing probe acts as the truth source, comparing the predicted data with the real-world measurements,” said Mike Frederick, NASA principal investigator for the probe. For the near-field probe, the F-15B will fly close behind the X-59 at its cruising altitude of approximately 55,000 feet, utilizing a “follow-the-leader” setup allowing researchers to analyze shock waves in real time. The mid-field probe, intended for separate missions, will collect more useful data as the shock waves travel closer to the ground. The probes’ ability to capture small pressure changes is especially important for the X-59, as its shock waves are expected to be much weaker than those of most supersonic aircraft. By comparing the probes’ data to predictions from advanced computer models, researchers can better evaluate their accuracy. “The probes have five pressure ports, one at the tip and four around the cone,” said Frederick. “These ports measure static pressure changes as the aircraft flies through shock waves, helping us understand the shock characteristics of a particular aircraft.” The ports combine their measurements to calculate the local pressure, speed, and direction of airflow. Researchers will soon evaluate upgrades to the near-field shock-sensing probe through test flights, where the probe, mounted on one F-15B, will collect data by chasing a second F-15 during supersonic flight. The upgrades include having the probe’s pressure transducers – devices that measure the air pressure on the cone – just 5 inches from its ports. Previous designs placed those transducers nearly 12 feet away, delaying recording time and distorting measurements. Temperature sensitivity on previous designs also presented a challenge, causing fluctuations in accuracy with changing conditions. To solve this, the team designed a heating system to maintain the pressure transducers at a consistent temperature during flight. “The probe will meet the resolution and accuracy requirements from the Quesst mission,” Frederick said. “This project shows how NASA can take existing technology and adapt it to solve new challenges.”",
  "image": "https://images-assets.nasa.gov/image/AFRC2024-0110-13/AFRC2024-0110-13~large.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\u003cp\u003eNASA will soon test advancements made on a key tool for measuring the unique “sonic thumps” that its quiet supersonic X-59 research aircraft will make while flying.\u003c/p\u003e\n\n\n\n\u003cp\u003eA shock-sensing probe is a cone-shaped air data probe developed with specific features to capture the unique shock waves the X-59 will produce. Researchers at NASA’s Armstrong Flight Research Center in Edwards, California developed two versions of the probe to collect precise pressure data during supersonic flight. One probe is optimized for near-field measurements, capturing shock waves that occur very close to where the X-59 will generate them. The second shock-sensing probe will measure the mid-field, collecting data at altitudes between 5,000 to 20,000 feet below the aircraft.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhen an aircraft flies supersonic, it generates shockwaves that travel through the surrounding air, producing loud sonic booms. The X-59 is designed to divert those shock waves, reducing the loud sonic booms to quieter sonic thumps. During test flights, an F-15B aircraft with a shock-sensing probe attached to its nose will fly with the X-59. The roughly 6-foot probe will continuously collect thousands of pressure samples per second, capturing air pressure changes as it flies through shock waves. Data from the sensors will be vital for validating computer models that predict the strength of the shock waves produced by the X-59, the centerpiece of NASA’s Quesst mission.\u003c/p\u003e\n\n\n\n\u003cp\u003e“A shock-sensing probe acts as the truth source, comparing the predicted data with the real-world measurements,” said Mike Frederick, NASA principal investigator for the probe.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor the near-field probe, the F-15B will fly close behind the X-59 at its cruising altitude of approximately 55,000 feet, utilizing a “follow-the-leader” setup allowing researchers to analyze shock waves in real time. The mid-field probe, intended for separate missions, will collect more useful data as the shock waves travel closer to the ground.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe probes’ ability to capture small pressure changes is especially important for the X-59, as its shock waves are expected to be much weaker than those of most supersonic aircraft. By comparing the probes’ data to predictions from advanced computer models, researchers can better evaluate their accuracy.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The probes have five pressure ports, one at the tip and four around the cone,” said Frederick. “These ports measure static pressure changes as the aircraft flies through shock waves, helping us understand the shock characteristics of a particular aircraft.” The ports combine their measurements to calculate the local pressure, speed, and direction of airflow.\u003c/p\u003e\n\n\n\n\u003cp\u003eResearchers will soon evaluate upgrades to the near-field shock-sensing probe through test flights, where the probe, mounted on one F-15B, will collect data by chasing a second F-15 during supersonic flight. The upgrades include having the probe’s pressure transducers – devices that measure the air pressure on the cone – just 5 inches from its ports. Previous designs placed those transducers nearly 12 feet away, delaying recording time and distorting measurements.\u003c/p\u003e\n\n\n\n\u003cp\u003eTemperature sensitivity on previous designs also presented a challenge, causing fluctuations in accuracy with changing conditions. To solve this, the team designed a heating system to maintain the pressure transducers at a consistent temperature during flight.\u003c/p\u003e\n\n\n\n\u003cp\u003e“The probe will meet the resolution and accuracy requirements from the Quesst mission,” Frederick said. “This project shows how NASA can take existing technology and adapt it to solve new challenges.”\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": null,
  "modifiedTime": null
}
