{
  "id": "81123b68-e0e7-4aae-a43e-d39d560068c0",
  "title": "NASA Welcomes Norway as 55th Nation to Sign Artemis Accords",
  "link": "https://www.nasa.gov/news-release/nasa-welcomes-norway-as-55th-nation-to-sign-artemis-accords/",
  "description": "Following an international signing ceremony Thursday, NASA congratulated Norway on becoming the latest country to join the Artemis Accords, committing to the peaceful, transparent, and responsible exploration of space. “We’re grateful for the strong and meaningful collaboration we’ve already had with the Norwegian Space Agency,” said acting NASA Administrator Janet Petro. “Now, by signing the […]",
  "author": "Jessica Taveau",
  "published": "Thu, 15 May 2025 20:01:50 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Artemis Accords",
    "Office of International and Interagency Relations (OIIR)"
  ],
  "byline": "",
  "length": 2041,
  "excerpt": "Following an international signing ceremony Thursday, NASA congratulated Norway on becoming the latest country to join the Artemis Accords, committing to the",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Jessica TaveauMay 15, 2025 Following an international signing ceremony Thursday, NASA congratulated Norway on becoming the latest country to join the Artemis Accords, committing to the peaceful, transparent, and responsible exploration of space. “We’re grateful for the strong and meaningful collaboration we’ve already had with the Norwegian Space Agency,” said acting NASA Administrator Janet Petro. “Now, by signing the Artemis Accords, Norway is not only supporting the future of exploration, but also helping us define it with all our partners for the Moon, Mars, and beyond.” Norway’s Minster of Trade and Industry Cecilie Myrseth signed the Artemis Accords on behalf of the country during an event at the Norwegian Space Agency (NOSA) in Oslo. Christian Hauglie-Hanssen, director general of NOSA, and Robert Needham, U.S. Embassy Chargé d’Affaires for Norway, participated in the event. Petro contributed remarks in a pre-recorded video message. “We are pleased to be a part of the Artemis Accords,” said Myrseth. “This is an important step for enabling Norway to contribute to broader international cooperation to ensure the peaceful exploration and use of outer space.” In 2020, the United States, led by NASA and the U.S. Department of State, and seven other initial signatory nations established the Artemis Accords, the first set of practical guidelines for nations to increase safety of operations and reduce risk and uncertainty in their civil exploration activities. The Artemis Accords are grounded in the Outer Space Treaty and other agreements including the Registration Convention and the Rescue and Return Agreement, as well as best practices for responsible behavior that NASA and its partners have supported, including the public release of scientific data.  Learn more about the Artemis Accords at: https://www.nasa.gov/artemis-accords -end- Amber Jacobson / Elizabeth ShawHeadquarters, Washington202-358-1600amber.c.jacobson@nasa.gov / elizabeth.a.shaw@nasa.gov Share Details",
  "image": "https://www.nasa.gov/wp-content/uploads/2025/05/artemis-accords-norway-55-051525-cropped.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-863853\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/e7cb47608b3ad8baa3af5c64d7ba6065?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Jessica Taveau\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eJessica Taveau\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMay 15, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eFollowing an international signing ceremony Thursday, NASA congratulated Norway on becoming the latest country to join the Artemis Accords, committing to the peaceful, transparent, and responsible exploration of space.\u003c/p\u003e\n\u003cp\u003e“We’re grateful for the strong and meaningful collaboration we’ve already had with the Norwegian Space Agency,” said acting NASA Administrator Janet Petro. “Now, by signing the Artemis Accords, Norway is not only supporting the future of exploration, but also helping us define it with all our partners for the Moon, Mars, and beyond.”\u003c/p\u003e\n\u003cp\u003eNorway’s Minster of Trade and Industry Cecilie Myrseth signed the Artemis Accords on behalf of the country during an event at the Norwegian Space Agency (NOSA) in Oslo. Christian Hauglie-Hanssen, director general of NOSA, and Robert Needham, U.S. Embassy Chargé d’Affaires for Norway, participated in the event. Petro contributed remarks in a pre-recorded video message.\u003c/p\u003e\n\u003cp\u003e“We are pleased to be a part of the Artemis Accords,” said Myrseth. “This is an important step for enabling Norway to contribute to broader international cooperation to ensure the peaceful exploration and use of outer space.”\u003c/p\u003e\n\u003cp\u003eIn 2020, the United States, led by NASA and the U.S. Department of State, and seven other initial signatory nations established the Artemis Accords, the first set of practical guidelines for nations to increase safety of operations and reduce risk and uncertainty in their civil exploration activities.\u003c/p\u003e\n\u003cp\u003eThe Artemis Accords are grounded in the Outer Space Treaty and other agreements including the Registration Convention and the Rescue and Return Agreement, as well as best practices for responsible behavior that NASA and its partners have supported, including the public release of scientific data. \u003c/p\u003e\n\u003cp\u003eLearn more about the Artemis Accords at:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/artemis-accords\"\u003e\u003cstrong\u003ehttps://www.nasa.gov/artemis-accords\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e-end-\u003c/p\u003e\n\u003cp\u003eAmber Jacobson / Elizabeth Shaw\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:amber.c.jacobson@nasa.gov\"\u003eamber.c.jacobson@nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:elizabeth.a.shaw@nasa.gov\"\u003eelizabeth.a.shaw@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003cdiv id=\"\"\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eShare\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\u003c/div\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\n\t\t\t\t\t\u003ch2\u003eDetails\u003c/h2\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\t\t\u003c/div\u003e\n\t\n\t\u003c/div\u003e\u003c/section\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
