{
  "id": "83ba7d7e-0c13-4ff3-b3de-c691dbda9745",
  "title": "The rare 'black moon' of December 30 rises next week",
  "link": "https://www.space.com/stargazing/the-rare-black-moon-of-december-30-rises-next-week",
  "description": "December 2024 will see a rare \"black moon,\" a term for the second new moon in a calendar month.",
  "author": "",
  "published": "Fri, 27 Dec 2024 20:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "Stargazing"
  ],
  "byline": "Jesse Emspak",
  "length": 10535,
  "excerpt": "December 2024 will see a rare \"black moon,\" a term for the second new moon in a calendar month.",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1139254/apple-touch-icon.png",
  "text": "An illustration of the sun and moon in the sky as they will appear on Dec. 30, 2024. (Image credit: Chris Vaughan/Starry Night) December 2024 will see a rare \"black moon,\" a term for the second new moon in a calendar month.The second new moon of December will occur at 5:27 p.m. ET (2227 GMT) on Dec. 30, according to the U.S. Naval Observatory, two days after the waning moon passes by Mercury in the predawn sky.A second new moon is sometimes called a \"black moon,\" just as two full moons in a month is sometimes called a \"blue moon\"  — though neither is a true astronomical term.New moons happen when the sun and the moon share the same celestial longitude, a position also called conjunction. You can't see the moon during this phase from Earth because the illuminated side is facing away from us; only during solar eclipses do new moons make themselves visible.New moon nights are a boon to astronomers both professional and amateur; the lack of a bright moon means that fainter objects are easier to see in the sky. This can be especially true in the winter in much of North America when in addition to having no interference from the moon, the air tends to be drier and offer better seeing through telescopes.A Mercury conjunctionOn Dec. 28 at 11:24 p.m. Eastern Time, the moon will be in conjunction with Mercury; the two will appear about 6 degrees apart. The event itself won't be visible from the United States. However, in New York City Mercury will rise at 5:38 a.m. on Dec. 28, and the sun follows at 6:48 a.m. The moon, meanwhile, rises at 5:26 a.m. If one looks towards the eastern horizon by 6:15 a.m. one can spot Mercury and the moon, both about 6 degrees high; the moon will be a thin crescent and to the right of Mercury. The closeness to the horizon makes spotting the two a challenge, but one can use the moon to orient.To see the conjunction one must go eastward; in Cairo, for example, the conjunction is at 6:24 a.m. local time on Dec. 29, according to In-the-sky.org. Sunrise is at 6:50 a.m. but Mercury rises at 5:13 a.m. and the moon at 5:33 a.m. At the time of conjunction (6:24 a.m.) the moon is 8 degrees high in the southeast and Mercury is at 13 degrees.Breaking space news, the latest updates on rocket launches, skywatching events and more!From Cape Town, the viewing is little better because the austral summer means that the sun rises earlier, at 5:36 a.m., so the conjunction happens after sunrise. Mercury rises there at 4:12 a.m. local time and the moon at 3:48 a.m. The pair will be about 10 degrees high by 5:00 a.m. with the moon above and to the right of Mercury.Visible Planets On the night of the new moon itself, Mercury will be just visible in the dawn skies on Dec. 31, rising at 5:45 a.m. in New York. Sunrise isn't until 7:20 a.m. By 6:45 a,m. Mercury will be about 9 degrees high in the southeast – difficult to see but not impossible with a flat horizon and clear conditions.In the evening, by about 6 p.m., Venus and Saturn will be in the southwestern sky, at 22 degrees and 35 degrees respectively. In New York Venus sets at 8:27 p.m. and Saturn at 9:57 p.m. Jupiter, meanwhile, is in the east about halfway to the zenith from the horizon at 43 degrees; the planet will be situated to the left of Aldebaran, the brightest star in Taurus and the contrast between the two – Aldebaran is much redder than Jupiter – makes them easy to spot. Jupiter sets on Dec. 31 at 5:26 a.m. Mars rises at 6:07 p.m. and by 8 p.m. is 20 degrees above the eastern horizon; it is visible until sunrise.In the Southern Hemisphere, the days are long – at the latitude of Buenos Aires the sky doesn't get dark until about 9 p.m. (sunset there on Dec. 30 is at 8:09 p.m.) and sunrise is early; at 5:43 a.m. a.m. in Buenos Aires. In the predawn hours of Dec. 31 Mercury rises at 4:18 a.m., and as in the Northern Hemisphere is only about 7 degrees high by 5 a.m.On Dec. 30, as in the Northern Hemisphere, one will see Venus and Saturn in the west, with Venus closer to the horizon and Saturn above and to the right (northwards). In Buenos Aires Venus sets at 10:54 p.m., Saturn at 11:44 p.m. Turning northeast one will see Jupiter; from mid-southern latitudes the planet appears to be below Aldebaran; Jupiter sets at 4:00 a.m. Dec. 31. In Buenos Aires Mars rises at 9:42 p.m. and takes some time to get high enough to see easily; by 11:30 p.m. the red planet is only 18 degrees high in the northeast.Stars and constellations Winter constellations are in full swing for Northern Hemisphere observers in January. By about 6 p.m. Orion, the Hunter, is just above the Eastern horizon, and one can watch its stars appear as the sky darkens. Orion faces Taurus, which early in the evening is above the Hunter (the constellation is actually to the west and north). One can see the Hyades, a cluster of bright stars that is the \"face\" of the bull.Looking left, above Orion's head, one sees Auriga, the Charioteer. To find it, look for Orion's Belt, then for Betelgeuse, the Hunter's right shoulder (his left from the perspective of a ground-based observer). Betelgeuse is recognizable as it is visibly reddish-orange.Looking almost straight upwards from Betelgeuse one will see Aldebaran, another orange-colored star that will be to the right of Jupiter, which will be slightly brighter and emit a steady light; if you can see stars twinkle you will notice that Jupiter does not; marking it as a planet. Draw a line straight from Aldebaran through Jupiter and you will reach the middle of Auriga, eventually hitting a fainter star called Menkalinan, or Beta Aurigae. Above Menkalinan is Capella, noticeably brighter and yellowish white.By about 9 p.m. on Dec. 30, Canis Major and Canis Minor, the \"hunting dogs\" of Orion, have both cleared the horizon and are in the southeast. Canis Major is below Orion (to its south and east) while Canis Minor is to the east (on Orion's right, the observer's left). Canis Major, the Big Dog, contains Sirius, the brightest star in the sky. Looking left and above Sirius one will see Procyon, the brightest star in the Little Dog. Procyon, Sirius and Betelgeuse in Orion form the Winter Triangle asterism that is easy to see even from light-polluted locations in cities and suburbs.By 11 p.m. Leo the Lion has fully risen; one can spot it by looking for Sirius which by that point is in the south-southeast. Turn to the left (eastwards) and upwards; one will see Procyon. Continue left from Procyon and downwards slightly until one is facing nearly due east; one should be able to see Regulus, or Alpha Leonis, also called Cor Leonis, the Heart of the Lion. Regulus is at the bottom of a sickle-shaped group of stars that is Leo's head and mane. Look towards the horizon and to the left and one encounters Denebola, the Lion's tail. By this time of night Orion is fully \"upright\" with the Belt stars making a line from east to west angled slightly upwards; it's much easier to see the shape that forms Orion's shoulders and legs. To the right and below the Belt is a bright blue-white star; that's Rigel, the foot of Orion.If local city lights are not too bright one can spot a fainter star just above and to the right of Rigel; this is the start of Eridanus, the River, and the star is called Cursa or Beta Eridani, as it is the second-brightest star in the constellation. Eridanus' brightest star, Achernar, isn't visible at all north of 33 degrees latitude. In the continental U.S. that means one must be in one of the states along the Gulf Coast, the southern half of Arizona or New Mexico, or San Diego.For Southern Hemisphere observers, January is when Puppis, Carina and Vela, the three constellations that make up the ship (connected to the Argo, the famous ship of Jason and the Argonauts) are prominent, rising in the southeast as the sky gets dark. As it is the austral summer the sky takes until about 9 p.m. to get fully dark (in Buenos Aires civil twilight ends at 8:38 p.m.) At that point in the northeastern sky one would see an \"upside down\" Orion, with the Belt stars above Betelgeuse, which is below the Belt and to the right.Rigel, meanwhile, is upwards and to the left, and this time when one follows the River from Cursa, one goes across the sky through the zenith to a point a full 64 degrees high in the southeast, to Achernar. If one uses Betelgeuse and Sirius as \"pointers\" one can draw a line between them southwards (this will be to the right) and above that line is the bright Canopus, the brightest star in Carina, the Ship's Keel, about 47 degrees high in the southeast. Between Canopus and Sirius is a group of seven fainter stars that forms a long shape something like a foot; that's Puppis, the Poop Deck. Look just south (to the right) and one can see the ring-shaped group of stars that is Vela, the Sail.Turning a bit further south – it will be to the right – one can see Crux, the Southern Cross, which covers an area between 6 and 12 degrees high in the south-southeast. From the latitude of Buenos Aires Crux never sets; at this point it is rising from its low point just above the southern horizon.Want to use new moons to see or photograph incredible sights in the night sky? Be sure to check out our best telescopes for viewing planets guide and our more general guides for the best binoculars and the best telescopes. If you're interested in taking your own impressive night sky images, we have a guide on how to photograph the night sky, how to photograph the planets as well as recommendations for the best cameras for astrophotography and the best lenses for astrophotography. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Jesse Emspak is a freelance journalist who has contributed to several publications, including Space.com, Scientific American, New Scientist, Smithsonian.com and Undark. He focuses on physics and cool technologies but has been known to write about the odder stories of human health and science as it relates to culture. Jesse has a Master of Arts from the University of California, Berkeley School of Journalism, and a Bachelor of Arts from the University of Rochester. Jesse spent years covering finance and cut his teeth at local newspapers, working local politics and police beats. Jesse likes to stay active and holds a fourth degree black belt in Karate, which just means he now knows how much he has to learn and the importance of good teaching. Most Popular",
  "image": "https://cdn.mos.cms.futurecdn.net/AEiE4mJn39z2dAgXb4SDeJ-1200-80.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv itemprop=\"image\" itemscope=\"\" itemtype=\"https://schema.org/ImageObject\"\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:320/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:480/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:650/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:970/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1024/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1200/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 1200w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1910/AEiE4mJn39z2dAgXb4SDeJ.jpg.webp 1920w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:320/AEiE4mJn39z2dAgXb4SDeJ.jpg\" alt=\"an illustration of the sky showing a dark moon near the sun\" srcset=\"https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:320/AEiE4mJn39z2dAgXb4SDeJ.jpg 320w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:480/AEiE4mJn39z2dAgXb4SDeJ.jpg 480w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:650/AEiE4mJn39z2dAgXb4SDeJ.jpg 650w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:970/AEiE4mJn39z2dAgXb4SDeJ.jpg 970w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1024/AEiE4mJn39z2dAgXb4SDeJ.jpg 1024w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1200/AEiE4mJn39z2dAgXb4SDeJ.jpg 1200w, https://cdn.mos.cms.futurecdn.net/v2/t:0,l:0,cw:0,ch:0,q:80,w:1910/AEiE4mJn39z2dAgXb4SDeJ.jpg 1920w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/AEiE4mJn39z2dAgXb4SDeJ.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/AEiE4mJn39z2dAgXb4SDeJ.jpg\" data-pin-nopin=\"true\" fetchpriority=\"high\" crossorigin=\"anonymous\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cmeta itemprop=\"url\" content=\"https://cdn.mos.cms.futurecdn.net/AEiE4mJn39z2dAgXb4SDeJ.jpg\"/\u003e\n\u003cmeta itemprop=\"height\" content=\"600\"/\u003e\n\u003cmeta itemprop=\"width\" content=\"338\"/\u003e\n\u003cfigcaption itemprop=\"caption description\"\u003e\n\u003cspan\u003eAn illustration of the sun and moon in the sky as they will appear on Dec. 30, 2024.\u003c/span\u003e\n\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: Chris Vaughan/Starry Night)\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eDecember 2024 will see a rare \u0026#34;black moon,\u0026#34; a term for the second new moon in a calendar month.\u003c/p\u003e\u003cp\u003eThe second \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/17561-new-moon-explained-lunar-phases.html\" data-before-rewrite-localise=\"https://www.space.com/17561-new-moon-explained-lunar-phases.html\"\u003enew moon\u003c/a\u003e of December will occur at 5:27 p.m. ET (2227 GMT) on Dec. 30, according to the \u003ca data-analytics-id=\"inline-link\" href=\"https://aa.usno.navy.mil/calculated/moon/phases?date=2024-12-01\u0026amp;nump=6\u0026amp;format=p\u0026amp;submit=Get+Data\" target=\"_blank\" data-url=\"https://aa.usno.navy.mil/calculated/moon/phases?date=2024-12-01\u0026amp;nump=6\u0026amp;format=p\u0026amp;submit=Get+Data\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003e\u003cu\u003eU.S. Naval Observatory\u003c/u\u003e\u003c/a\u003e, two days after the waning moon passes by \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/36-mercury-the-suns-closest-planetary-neighbor.html\" data-before-rewrite-localise=\"https://www.space.com/36-mercury-the-suns-closest-planetary-neighbor.html\"\u003eMercury\u003c/a\u003e in the predawn sky.\u003c/p\u003e\u003cp\u003eA second new moon is sometimes called a \u0026#34;\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/34162-black-moon-guide.html\" data-before-rewrite-localise=\"https://www.space.com/34162-black-moon-guide.html\"\u003eblack moon\u003c/a\u003e,\u0026#34; just as two full moons in a month is sometimes called a \u0026#34;\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/15455-blue-moon.html\" data-before-rewrite-localise=\"https://www.space.com/15455-blue-moon.html\"\u003eblue moon\u003c/a\u003e\u0026#34;  — though neither is a true astronomical term.\u003c/p\u003e\u003cp\u003eNew moons happen when \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/58-the-sun-formation-facts-and-characteristics.html\" data-before-rewrite-localise=\"https://www.space.com/58-the-sun-formation-facts-and-characteristics.html\"\u003ethe sun\u003c/a\u003e and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\" data-before-rewrite-localise=\"https://www.space.com/55-earths-moon-formation-composition-and-orbit.html\"\u003ethe moon\u003c/a\u003e share the same celestial longitude, a position also called conjunction. You can\u0026#39;t see the moon during this phase from Earth because the illuminated side is facing away from us; only during solar eclipses do new moons make themselves visible.\u003c/p\u003e\u003cp\u003eNew moon nights are a boon to astronomers both professional and amateur; the lack of a bright moon means that fainter objects are easier to see in the sky. This can be especially true in the winter in much of North America when in addition to having no interference from the moon, the air tends to be drier and offer better seeing through telescopes.\u003c/p\u003e\u003ch2 id=\"a-mercury-conjunction-3\"\u003eA Mercury conjunction\u003c/h2\u003e\u003cp\u003eOn Dec. 28 at 11:24 p.m. Eastern Time, the moon will be in conjunction with Mercury; the two will appear about 6 degrees apart. The event itself won\u0026#39;t be visible from the United States. However, in New York City Mercury will rise at 5:38 a.m. on Dec. 28, and the sun follows at 6:48 a.m. The moon, meanwhile, rises at 5:26 a.m. If one looks towards the eastern horizon by 6:15 a.m. one can spot Mercury and the moon, both about 6 degrees high; the moon will be a thin crescent and to the right of Mercury. The closeness to the horizon makes spotting the two a challenge, but one can use the moon to orient.\u003c/p\u003e\u003cp\u003eTo see the conjunction one must go eastward; in Cairo, for example, the conjunction is at 6:24 a.m. local time on Dec. 29, \u003ca data-analytics-id=\"inline-link\" href=\"https://in-the-sky.org/news.php?id=20241229_20_100\u0026amp;town=360630\" target=\"_blank\" data-url=\"https://in-the-sky.org/news.php?id=20241229_20_100\u0026amp;town=360630\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003eaccording to In-the-sky.org\u003c/a\u003e. Sunrise is at 6:50 a.m. but Mercury rises at 5:13 a.m. and the moon at 5:33 a.m. At the time of conjunction (6:24 a.m.) the moon is 8 degrees high in the southeast and Mercury is at 13 degrees.\u003c/p\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-sgBoMmprakH9hBHrg5wNMf\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003eFrom Cape Town, the viewing is little better because the austral summer means that the sun rises earlier, at 5:36 a.m., so the conjunction happens after sunrise. Mercury rises there at 4:12 a.m. local time and the moon at 3:48 a.m. The pair will be about 10 degrees high by 5:00 a.m. with the moon above and to the right of Mercury.\u003c/p\u003e\u003ch2 id=\"visible-planets-3\"\u003eVisible Planets \u003c/h2\u003e\u003cp\u003eOn the night of the new moon itself, Mercury will be just visible in the dawn skies on Dec. 31, rising at 5:45 a.m. in New York. Sunrise isn\u0026#39;t until 7:20 a.m. By 6:45 a,m. Mercury will be about 9 degrees high in the southeast – difficult to see but not impossible with a flat horizon and clear conditions.\u003c/p\u003e\u003cp\u003eIn the evening, by about 6 p.m., \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html\" data-before-rewrite-localise=\"https://www.space.com/44-venus-second-planet-from-the-sun-brightest-planet-in-solar-system.html\"\u003eVenus\u003c/a\u003e and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/48-saturn-the-solar-systems-major-ring-bearer.html\" data-before-rewrite-localise=\"https://www.space.com/48-saturn-the-solar-systems-major-ring-bearer.html\"\u003eSaturn\u003c/a\u003e will be in the southwestern sky, at 22 degrees and 35 degrees respectively. In New York Venus sets at 8:27 p.m. and Saturn at 9:57 p.m. Jupiter, meanwhile, is in the east about halfway to the zenith from the horizon at 43 degrees; the planet will be situated to the left of Aldebaran, the brightest star in Taurus and the contrast between the two – Aldebaran is much redder than \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\" data-before-rewrite-localise=\"https://www.space.com/7-jupiter-largest-planet-solar-system.html\"\u003eJupiter\u003c/a\u003e – makes them easy to spot. Jupiter sets on Dec. 31 at 5:26 a.m. Mars rises at 6:07 p.m. and by 8 p.m. is 20 degrees above the eastern horizon; it is visible until sunrise.\u003c/p\u003e\u003cp\u003eIn the Southern Hemisphere, the days are long – at the latitude of Buenos Aires the sky doesn\u0026#39;t get dark until about 9 p.m. (sunset there on Dec. 30 is at 8:09 p.m.) and sunrise is early; at 5:43 a.m. a.m. in Buenos Aires. In the predawn hours of Dec. 31 Mercury rises at 4:18 a.m., and as in the Northern Hemisphere is only about 7 degrees high by 5 a.m.\u003c/p\u003e\u003cp\u003eOn Dec. 30, as in the Northern Hemisphere, one will see Venus and Saturn in the west, with Venus closer to the horizon and Saturn above and to the right (northwards). In Buenos Aires Venus sets at 10:54 p.m., Saturn at 11:44 p.m. Turning northeast one will see Jupiter; from mid-southern latitudes the planet appears to be below Aldebaran; Jupiter sets at 4:00 a.m. Dec. 31. In Buenos Aires Mars rises at 9:42 p.m. and takes some time to get high enough to see easily; by 11:30 p.m. the red planet is only 18 degrees high in the northeast.\u003c/p\u003e\u003ch2 id=\"stars-and-constellations-3\"\u003eStars and constellations \u003c/h2\u003e\u003cp\u003eWinter constellations are in full swing for Northern Hemisphere observers in January. By about 6 p.m. \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/16659-constellation-orion.html\" data-before-rewrite-localise=\"https://www.space.com/16659-constellation-orion.html\"\u003eOrion\u003c/a\u003e, the Hunter, is just above the Eastern horizon, and one can watch its stars appear as the sky darkens. Orion faces \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/17101-taurus-constellation.html\" data-before-rewrite-localise=\"https://www.space.com/17101-taurus-constellation.html\"\u003eTaurus\u003c/a\u003e, which early in the evening is above the Hunter (the constellation is actually to the west and north). One can see the Hyades, a cluster of bright stars that is the \u0026#34;face\u0026#34; of the bull.\u003c/p\u003e\u003cp\u003eLooking left, above Orion\u0026#39;s head, one sees Auriga, the Charioteer. To find it, look for Orion\u0026#39;s Belt, then for Betelgeuse, the Hunter\u0026#39;s right shoulder (his left from the perspective of a ground-based observer). Betelgeuse is recognizable as it is visibly reddish-orange.\u003c/p\u003e\u003cp\u003eLooking almost straight upwards from Betelgeuse one will see Aldebaran, another orange-colored star that will be to the right of Jupiter, which will be slightly brighter and emit a steady light; if you can see stars twinkle you will notice that Jupiter does not; marking it as a planet. Draw a line straight from Aldebaran through Jupiter and you will reach the middle of Auriga, eventually hitting a fainter star called Menkalinan, or Beta Aurigae. Above Menkalinan is Capella, noticeably brighter and yellowish white.\u003c/p\u003e\u003cp\u003eBy about 9 p.m. on Dec. 30, Canis Major and Canis Minor, the \u0026#34;hunting dogs\u0026#34; of Orion, have both cleared the horizon and are in the southeast. Canis Major is below Orion (to its south and east) while Canis Minor is to the east (on Orion\u0026#39;s right, the observer\u0026#39;s left). Canis Major, the Big Dog, contains Sirius, the brightest star in the sky. Looking left and above Sirius one will see Procyon, the brightest star in the Little Dog. Procyon, Sirius and Betelgeuse in Orion form the Winter Triangle asterism that is easy to see even from light-polluted locations in cities and suburbs.\u003c/p\u003e\u003cp\u003eBy 11 p.m. Leo the Lion has fully risen; one can spot it by looking for Sirius which by that point is in the south-southeast. Turn to the left (eastwards) and upwards; one will see Procyon. Continue left from Procyon and downwards slightly until one is facing nearly due east; one should be able to see Regulus, or Alpha Leonis, also called Cor Leonis, the Heart of the Lion. Regulus is at the bottom of a sickle-shaped group of stars that is Leo\u0026#39;s head and mane. Look towards the horizon and to the left and one encounters Denebola, the Lion\u0026#39;s tail. By this time of night Orion is fully \u0026#34;upright\u0026#34; with the Belt stars making a line from east to west angled slightly upwards; it\u0026#39;s much easier to see the shape that forms Orion\u0026#39;s shoulders and legs. To the right and below the Belt is a bright blue-white star; that\u0026#39;s Rigel, the foot of Orion.\u003c/p\u003e\u003cp\u003eIf local city lights are not too bright one can spot a fainter star just above and to the right of Rigel; this is the start of Eridanus, the River, and the star is called Cursa or Beta Eridani, as it is the second-brightest star in the constellation. Eridanus\u0026#39; brightest star, Achernar, isn\u0026#39;t visible at all north of 33 degrees latitude. In the continental U.S. that means one must be in one of the states along the Gulf Coast, the southern half of Arizona or New Mexico, or San Diego.\u003c/p\u003e\u003cp\u003eFor Southern Hemisphere observers, January is when Puppis, Carina and Vela, the three constellations that make up the ship (connected to the Argo, the famous ship of Jason and the Argonauts) are prominent, rising in the southeast as the sky gets dark. As it is the austral summer the sky takes until about 9 p.m. to get fully dark (in Buenos Aires civil twilight ends at 8:38 p.m.) At that point in the northeastern sky one would see an \u0026#34;upside down\u0026#34; Orion, with the Belt stars above Betelgeuse, which is below the Belt and to the right.\u003c/p\u003e\u003cp\u003eRigel, meanwhile, is upwards and to the left, and this time when one follows the River from Cursa, one goes across the sky through the zenith to a point a full 64 degrees high in the southeast, to Achernar. If one uses \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/22009-betelgeuse.html\" data-before-rewrite-localise=\"https://www.space.com/22009-betelgeuse.html\"\u003eBetelgeuse\u003c/a\u003e and \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/21702-sirius-brightest-star.html\" data-before-rewrite-localise=\"https://www.space.com/21702-sirius-brightest-star.html\"\u003eSirius\u003c/a\u003e as \u0026#34;pointers\u0026#34; one can draw a line between them southwards (this will be to the right) and above that line is the bright Canopus, the brightest star in Carina, the Ship\u0026#39;s Keel, about 47 degrees high in the southeast. Between Canopus and Sirius is a group of seven fainter stars that forms a long shape something like a foot; that\u0026#39;s Puppis, the Poop Deck. Look just south (to the right) and one can see the ring-shaped group of stars that is Vela, the Sail.\u003c/p\u003e\u003cp\u003eTurning a bit further south – it will be to the right – one can see Crux, the Southern Cross, which covers an area between 6 and 12 degrees high in the south-southeast. From the latitude of Buenos Aires Crux never sets; at this point it is rising from its low point just above the southern horizon.\u003c/p\u003e\u003cp\u003eWant to use new moons to see or photograph incredible sights in the night sky? Be sure to check out our \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/best-telescopes-for-seeing-planets\" data-before-rewrite-localise=\"https://www.space.com/best-telescopes-for-seeing-planets\"\u003ebest telescopes for viewing planets guide\u003c/a\u003e and our more general guides for the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/26021-best-binoculars.html\" data-before-rewrite-localise=\"https://www.space.com/26021-best-binoculars.html\"\u003ebest binoculars\u003c/a\u003e and the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/15693-telescopes-beginners-telescope-reviews-buying-guide.html\" data-before-rewrite-localise=\"https://www.space.com/15693-telescopes-beginners-telescope-reviews-buying-guide.html\"\u003ebest telescopes\u003c/a\u003e. If you\u0026#39;re interested in taking your own impressive night sky images, we have a guide on \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/astrophotography-for-beginners-guide\" data-before-rewrite-localise=\"https://www.space.com/astrophotography-for-beginners-guide\"\u003ehow to photograph the night sky\u003c/a\u003e, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/what-equipment-do-you-need-to-see-and-photograph-the-planets\" data-before-rewrite-localise=\"https://www.space.com/what-equipment-do-you-need-to-see-and-photograph-the-planets\"\u003ehow to photograph the planets\u003c/a\u003e as well as recommendations for the best \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/best-cameras-for-astrophotography\" data-before-rewrite-localise=\"https://www.space.com/best-cameras-for-astrophotography\"\u003ecameras for astrophotography\u003c/a\u003e and the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/best-lenses-for-astrophotography\" data-before-rewrite-localise=\"https://www.space.com/best-lenses-for-astrophotography\"\u003ebest lenses for astrophotography\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\u003cdiv id=\"slice-container-authorBio-sgBoMmprakH9hBHrg5wNMf\"\u003e\u003cp\u003eJesse Emspak is a freelance journalist who has contributed to several publications, including Space.com, Scientific American, New Scientist, Smithsonian.com and Undark. He focuses on physics and cool technologies but has been known to write about the odder stories of human health and science as it relates to culture. Jesse has a Master of Arts from the University of California, Berkeley School of Journalism, and a Bachelor of Arts from the University of Rochester. Jesse spent years covering finance and cut his teeth at local newspapers, working local politics and police beats. Jesse likes to stay active and holds a fourth degree black belt in Karate, which just means he now knows how much he has to learn and the importance of good teaching.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv id=\"slice-container-relatedArticles\"\u003e\u003cp\u003e\u003ch5\u003eMost Popular\u003c/h5\u003e\u003c/p\u003e\u003c/div\u003e\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "12 min read",
  "publishedTime": "2024-12-27T20:00:00Z",
  "modifiedTime": "2024-12-27T20:00:00Z"
}
