{
  "id": "a65f27ab-433b-4af2-b652-cd7cb888ecdb",
  "title": "‘Space travel is queer’: the unstoppable film-maker skewering Bezos and Musk’s macho fantasies",
  "link": "https://www.theguardian.com/film/2025/may/29/space-travel-bezos-musk-macho-fantasies-nelly-ben-hayoun-stepanian",
  "description": "She founded Nasa’s orchestra and has bounced heartbeats off the moon. Now Nelly Ben Hayoun-Stépanian has made a hilarious film taking issue with the tech bros’ dreams of celestial conquest‘She’s a great inspiration,” says Nelly Ben Hayoun-Stépanian, picking up a photo she keeps in her wildly decorated office of the scientist Marie Curie, the first woman to win a Nobel prize and also the first person to win one twice. “I pick people that really inspire me. Partners in crime. When a project is difficult, I think, ‘What would Marie Curie have done? What would Hannah Arendt have done?’ Hahaha.”She talks mile-a-minute, finishing sentences with a laugh as she speaks to me in her office, which could well be the best one in London: an old, graffiti-covered tube carriage plonked on top of the roof of a Shoreditch nightclub, with views over the city. Its interior is loud and colourful: posters and flyers plaster the walls, while the floor is a trippy swirl of purples and pinks. And, propped up on her desk, is that photo of Curie. Continue reading...",
  "author": "Cath Clarke",
  "published": "Thu, 29 May 2025 04:00:19 GMT",
  "source": "https://www.theguardian.com/science/space/rss",
  "categories": [
    "Film",
    "Culture",
    "Performance art",
    "Space",
    "Art and design"
  ],
  "byline": "Cath Clarke",
  "length": 9181,
  "excerpt": "She founded Nasa’s orchestra and has bounced heartbeats off the moon. Now Nelly Ben Hayoun-Stépanian has made a hilarious film taking issue with the tech bros’ dreams of celestial conquest",
  "siteName": "the Guardian",
  "favicon": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon-512.png",
  "text": "‘She’s a great inspiration,” says Nelly Ben Hayoun-Stépanian, picking up a photo she keeps in her wildly decorated office of the scientist Marie Curie, the first woman to win a Nobel prize and also the first person to win one twice. “I pick people that really inspire me. Partners in crime. When a project is difficult, I think, ‘What would Marie Curie have done? What would Hannah Arendt have done?’ Hahaha.”She talks mile-a-minute, finishing sentences with a laugh as she speaks to me in her office, which could well be the best one in London: an old, graffiti-covered tube carriage plonked on top of the roof of a Shoreditch nightclub, with views over the city. Its interior is loud and colourful: posters and flyers plaster the walls, while the floor is a trippy swirl of purples and pinks. And, propped up on her desk, is that photo of Curie.Having done projects for Nasa, Porsche, Lego and Nike, Ben Hayoun-Stépanian’s role is artist, activist and creative director all rolled into one. Not that she cares for labels: at a push, she will describe herself as a “designer of experiences”. In March, she installed a “cosmic playground” in London’s West End, placing asteroid-shaped rocks in Piccadilly Circus as well as giant inflatable fluorescent cats (not any old cats, but Schrödinger’s cats, for students of quantum physics). She has also sent heartbeats into space, bouncing them off the moon.Ben Hayoun-Stépanian is fascinated by space and in 2012 founded an orchestra of scientists at Nasa. The International Space Orchestra has performed with Sigur Rós, Beck and Damon Albarn. The idea behind it is typical of her mantra of “challenging power structures” and inspiring people to think differently. “The orchestra created a counterculture in Nasa. You have the head of Nasa playing the gong and a new astronaut playing percussion. They can speak about what went wrong in the space programme. Suddenly, they are having a conversation about why we are doing what we are doing.”And don’t get her started on the education system. In 2017, frustrated with the status quo, she set up the University of the Underground. It’s a non-tuition-fee-paying university run from the basements of nightclubs (past lecturers include Pussy Riot and Noam Chomsky). She has also directed five feature films – the latest, Doppelgängers³, is being shown next week as part of the London incarnation of the SXSW (South by Southwest) festival. It may be difficult to pin down exactly what she does, but she does a lot.Films do loom large, though. Ben Hayoun-Stépanian’s tube carriage is also an Aladdin’s cave of props from her films and projects. There’s a giant foam strawberry on one shelf, a comedy oversized telephone on another. And is that Barbie above the desk? “Yeah! That is me!” The Barbie is indeed a mini Ben Hayoun-Stépanian, wearing her trademark boilersuit and red lipstick. The toy manufacturer Mattel made her the doll after she consulted on its I Can Be range of Barbies which gave the toys proper jobs. “This was way before Barbie was considered cool, way before the Barbie film. These big companies – sometimes it’s hard for them to agitate from within. So they invite people like me. My whole work is also about representation, making sure voices are being heard.”‘Dangerous’ … the cave scene in Doppelgängers³. Photograph: Nick BallónBen Hayoun-Stépanian is entertaining company. But we are meant to be talking about Doppelgängers³, which explores the future of space. After working in the space industry, she has come to believe that we have learned nothing from history, that humans may be doomed to repeat the mistakes we made on Earth in space: the same old western exploitation, the same old colonialism. Take the billionaire space race. Elon Musk’s mission is to populate Mars with a human colony, while Jeff Bezos wants to move heavy polluting industries to space. “These two, their visions are getting the most media space. But I find they are problematic. And I find they are lacking originality.”If space exploration is now the preserve of the 1%, Doppelgängers³ imagines a new vision: less heteronormative, less patriarchal. It’s a film pinging with so many ideas, I don’t know where to start, I say. She nods vigorously. “It’s polyphonic. That’s really the way my brain functions. It’s the way I do things. The idea that you could compartmentalise knowledge just doesn’t make sense to me. You can’t dissociate biology from physics or from literature or culture. All are parts of the same ecosystem, which is the cosmos!”She adds: “Space, to me, is not a luxury. It’s not entertainment. It is a critical experiment – the ultimate test of what kinds of societies we are capable of imagining.”Her film is very funny, funnier than it sounds on paper. Ben Hayoun-Stépanian travels the world talking to experts: she interviews pioneering astronomer Jill Tarter, a neurogeneticist, an economist, a transgender activist and a quantum physicist. Some conversations reach Louis Theroux heights of randomness. When she visits the political theorist Uday Singh Mehta, he rolls her up like a burrito in a massive rug on the floor. Nothing is scripted. “I don’t want to come with a preconceived idea of how things are going to go,” she explains. Besides, she can always tell when it’s time to leave: “I know when someone is going to throw me out.”Made jewellery for Yakuza gangsters … outside her tube-train office. Photograph: David Levene/The GuardianThe film gets its name from the two doppelgangers Ben Hayoun-Stépanian hires to accompany her on an “analogue mission”, a practice run for space travel here on Earth. Her doppelgangers are Lucia, an Armenian, and Myriam, an Algerian. The three women travel to a cave in Spain to take part in a simulation of a space mission. Wearing cumbersome astronaut suits, gripping a rope handrail, they descend into the cave. The whole thing looks terrifying. “I’m so glad you could see that! I genuinely thought that was the most dangerous thing I’ve done in my life.”The idea behind hiring doppelgangers was partly inspired by Ben Hayoun-Stépanian’s fascination with quantum physics. She is also interested in intergenerational trauma – how emotional pain can be transmitted from parent to child. Ben Hayoun-Stépanian is French, of Armenian and Algerian heritage; both countries have painful colonial histories. Her project resulted in the first academic paper on intergenerational trauma and decolonial futures in space.Ben Hayoun-Stépanian grew up in Valence in south-eastern France. Her grandfather was a member of the committee of French Armenians who lobbied the French government to formally recognise the Armenian genocide of 1915-16. “I was maybe 13 or 14. I remember [the campaign] quite well.” It was only in recent years that she thought of her grandfather as an activist. She wonders if she was politicised by him. Growing up, the family had a textile business and her first degree (among many) was in textile design. She then moved to Tokyo, designing kimonos and making jewellery (a hit with Yakuza gangsters).In Ben Hayoun-Stépanian’s mind, space exploration forces us to reimagine everything. “It’s queer. It’s decolonial. It’s pluralistic.” We need to let go of the binaries and borders, she says. Since her film premiered at SXSW last year, Donald Trump ordered Nasa to close its diversity, equity and inclusion initiatives. “It’s devastating. You can’t just think of people as minorities. Actually, there is a direct value in bringing them into the room because, in space mission design, they bring a different way of functioning and thinking. I am making a case, which is a scientific case, for it.”Triple threat … the doppelgangers prepare for space. Photograph: Nick BallónPussy Riot contributed music to the film, and Ben Hayoun-Stépanian is friends with the band’s co-founder Nadya Tolokonnikova. They met when they were both speaking at a conference. “These diplomat dudes were running after Nadya, like, ‘Oh my god, we want to take your picture.’ I was sitting next to her in my big black bomber jacket. They all thought I was her security. Nadya is a force to be reckoned with. For me, she is the definition of courage. Me, I risk power structures. I annoy them. But I never get to a point where I’m going to go in jail. I always work with lawyers. I know what I can do, what I cannot do. Nadya has been put in jail. It’s another level. I wouldn’t go that far, you know?”I ask Ben Hayoun-Stépanian if she gets resistance walking into institutions such as Nasa looking as she does? “Always!” she says cheerily. “There is always a moment where when I arrive in the room and people are like, ‘What is this?’” Her look today is head-to-toe snakeskin print, huge hoop earrings and neon green nails. Is she comfortable with conflict? A nod. “There is always conflict, but conflict is part of the process. Conflict is never a state that remains.”I ask her if there’s anything else I should ask. “I am turning 40 on 27 May. Haha. My mom told me to tell you this.” OK. And what about your next film? “Ha! My next film is even more mad.” Doppelgängers³ screens on 2 and 7 June at Rich Mix, London, as part of SXSW.",
  "image": "https://i.guim.co.uk/img/media/6940e75e81a6bd6184632bb3bd824519c082815c/904_0_6830_5464/master/6830.jpg?width=1200\u0026height=630\u0026quality=85\u0026auto=format\u0026fit=crop\u0026overlay-align=bottom%2Cleft\u0026overlay-width=100p\u0026overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc\u0026enable=upscale\u0026s=2028689261b1681f8a706b9baac62568",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"maincontent\"\u003e\u003cp\u003e\u003cspan\u003e‘S\u003c/span\u003ehe’s a great inspiration,” says Nelly Ben Hayoun-Stépanian, picking up a photo she keeps in her wildly decorated office of the scientist Marie Curie, the first woman to win a Nobel prize and also the first person to win one twice. “I pick people that really inspire me. Partners in crime. When a project is difficult, I think, ‘What would Marie Curie have done? What would \u003ca href=\"https://www.theguardian.com/books/2024/feb/04/we-are-free-to-change-the-world-hannah-arendt-lessons-in-love-disobedience-review-lyndsey-stonebridge\" data-link-name=\"in body link\"\u003eHannah Arendt\u003c/a\u003e have done?’ Hahaha.”\u003c/p\u003e\u003cp\u003eShe talks mile-a-minute, finishing sentences with a laugh as she speaks to me in her office, which could well be the best one in London: an old, graffiti-covered tube carriage plonked on top of the roof of a Shoreditch nightclub, with views over the city. Its interior is loud and colourful: posters and flyers plaster the walls, while the floor is a trippy swirl of purples and pinks. And, propped up on her desk, is that photo of Curie.\u003c/p\u003e\u003cp\u003eHaving done projects for Nasa, Porsche, Lego and Nike, \u003ca href=\"https://www.theguardian.com/artanddesign/architecture-design-blog/2013/jun/03/international-space-orchestra-nasa\" data-link-name=\"in body link\"\u003eBen Hayoun-Stépanian’s role is artist, activist and creative director\u003c/a\u003e all rolled into one. Not that she cares for labels: at a push, she will describe herself as a “designer of experiences”. In March, she installed a “cosmic playground” in London’s West End, placing asteroid-shaped rocks in Piccadilly Circus as well as giant inflatable fluorescent cats (not any old cats, but Schrödinger’s cats, for students of quantum physics). She has also sent heartbeats into space, bouncing them off the moon.\u003c/p\u003e\u003cp\u003eBen Hayoun-Stépanian is fascinated by space and in 2012 founded an orchestra of scientists at Nasa. The International \u003ca href=\"https://www.theguardian.com/science/space\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\"\u003eSpace\u003c/a\u003e Orchestra has performed with Sigur Rós, Beck and Damon Albarn. The idea behind it is typical of her mantra of “challenging power structures” and inspiring people to think differently. “The orchestra created a counterculture in Nasa. You have the head of Nasa playing the gong and a new astronaut playing percussion. They can speak about what went wrong in the space programme. Suddenly, they are having a conversation about why we are doing what we are doing.”\u003c/p\u003e\u003cfigure id=\"50275aaa-af6a-4be5-9cf8-d027c7cb56ab\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.VideoYoutubeBlockElement\"\u003e\u003cdiv data-component=\"youtube-embed\"\u003e\u003cp\u003e\u003ciframe src=\"https://www.youtube-nocookie.com/embed/iua9BhR3pAE?wmode=opaque\" height=\"480\" width=\"854\" allowfullscreen=\"\"\u003e\u003c/iframe\u003e\u003c/p\u003e\u003c/div\u003e\u003c/figure\u003e\u003cp\u003eAnd don’t get her started on the education system. In 2017, frustrated with the status quo, she set up the University of the Underground. It’s a non-tuition-fee-paying university run from the basements of nightclubs (past lecturers include Pussy Riot and Noam Chomsky). She has also directed five feature films – the latest, Doppelgängers³, is being shown next week as part of the London incarnation of the SXSW (South by Southwest) festival. It may be difficult to pin down exactly what she does, but she does a lot.\u003c/p\u003e\u003cp\u003eFilms do loom large, though. Ben Hayoun-Stépanian’s tube carriage is also an Aladdin’s cave of props from her films and projects. There’s a giant foam strawberry on one shelf, a comedy oversized telephone on another. And is that Barbie above the desk? “Yeah! That is me!” The Barbie is indeed a mini Ben Hayoun-Stépanian, wearing her trademark boilersuit and red lipstick. The toy manufacturer Mattel made her the doll after she consulted on its \u003ca href=\"https://www.marketingweek.com/mattel-to-introduce-career-barbie-range/\" data-link-name=\"in body link\"\u003eI Can Be range of Barbies\u003c/a\u003e which gave the toys proper jobs. “This was \u003cem\u003eway\u003c/em\u003e before Barbie was considered cool, \u003cem\u003eway\u003c/em\u003e before the Barbie film. These big companies – sometimes it’s hard for them to agitate from within. So they invite people like me. My whole work is also about representation, making sure voices are being heard.”\u003c/p\u003e\u003cfigure id=\"e69c711a-ddce-4ab4-bb3a-30e1b1636aef\" data-spacefinder-role=\"showcase\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-2\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=880\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=880\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=800\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1140px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=800\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1140px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=640\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=640\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"‘Dangerous’ … the cave scene in Doppelgängers³.\" src=\"https://i.guim.co.uk/img/media/27518ae932dc5f2214ba9d4ff4d55d89b29dda5e/0_0_3000_2250/master/3000.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.75\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003e‘Dangerous’ … the cave scene in Doppelgängers³.\u003c/span\u003e Photograph: Nick Ballón\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBen Hayoun-Stépanian is entertaining company. But we are meant to be talking about Doppelgängers³, which explores the future of space. After working in the space industry, she has come to believe that we have learned nothing from history, that humans may be doomed to repeat the mistakes we made on Earth in space: the same old western exploitation, the same old colonialism. Take the billionaire space race. Elon Musk’s mission is to populate Mars with a human colony, while Jeff Bezos wants to move heavy polluting industries to space. “These two, their visions are getting the most media space. But I find they are problematic. And I find they are lacking originality.”\u003c/p\u003e\u003cp\u003eIf space exploration is now the preserve of the 1%, Doppelgängers³ imagines a new vision: less heteronormative, less patriarchal. It’s a film pinging with so many ideas, I don’t know where to start, I say. She nods vigorously. “It’s polyphonic. That’s really the way my brain functions. It’s the way I do things. The idea that you could compartmentalise knowledge just doesn’t make sense to me. You can’t dissociate biology from physics or from literature or culture. All are parts of the same ecosystem, which is the cosmos!”\u003c/p\u003e\u003cp\u003eShe adds: “Space, to me, is not a luxury. It’s not entertainment. It is a critical experiment – the ultimate test of what kinds of societies we are capable of imagining.”\u003c/p\u003e\u003cp\u003eHer film is very funny, funnier than it sounds on paper. Ben Hayoun-Stépanian travels the world talking to experts: she interviews pioneering astronomer Jill Tarter, a neurogeneticist, an economist, a transgender activist and a quantum physicist. Some conversations reach Louis Theroux heights of randomness. When she visits the political theorist Uday Singh Mehta, he rolls her up like a burrito in a massive rug on the floor. Nothing is scripted. “I don’t want to come with a preconceived idea of how things are going to go,” she explains. Besides, she can always tell when it’s time to leave: “I know when someone is going to throw me out.”\u003c/p\u003e\u003cfigure id=\"0648225f-1104-4a8c-bfa2-e68dd8d37313\" data-spacefinder-role=\"supporting\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-3\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=380\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 1300px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=380\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 1300px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=300\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 980px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=300\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 980px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Made jewellery for Yakuza gangsters … outside her tube-train office.\" src=\"https://i.guim.co.uk/img/media/a5affe535fed75a11801006d55400b23bb9b45cd/0_0_5464_8192/master/5464.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"667.1742313323573\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eMade jewellery for Yakuza gangsters … outside her tube-train office.\u003c/span\u003e Photograph: David Levene/The Guardian\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eThe film gets its name from the two doppelgangers Ben Hayoun-Stépanian hires to accompany her on an “analogue mission”, a practice run for space travel here on Earth. Her doppelgangers are Lucia, an Armenian, and Myriam, an Algerian. The three women travel to a cave in Spain to take part in a simulation of a space mission. Wearing cumbersome astronaut suits, gripping a rope handrail, they descend into the cave. The whole thing looks terrifying. “I’m so glad you could see that! I genuinely thought that was the most dangerous thing I’ve done in my life.”\u003c/p\u003e\u003cp\u003eThe idea behind hiring doppelgangers was partly inspired by Ben Hayoun-Stépanian’s fascination with quantum physics. She is also interested in intergenerational trauma – how emotional pain can be transmitted from parent to child. Ben Hayoun-Stépanian is French, of Armenian and Algerian heritage; both countries have painful colonial histories. Her project resulted in the first academic paper on intergenerational trauma and decolonial futures in space.\u003c/p\u003e\u003cp\u003eBen Hayoun-Stépanian grew up in Valence in south-eastern France. Her grandfather was a member of the committee of French Armenians who lobbied the French government to formally recognise the \u003ca href=\"https://www.theguardian.com/world/on-the-middle-east/2015/apr/23/britain-sidesteps-armenian-genocide-recognition-a-century-after-killings\" data-link-name=\"in body link\"\u003eArmenian genocide of 1915-16. “I was \u003c/a\u003emaybe 13 or 14. I remember [the campaign] quite well.” It was only in recent years that she thought of her grandfather as an activist. She wonders if she was politicised by him. Growing up, the family had a textile business and her first degree (among many) was in textile design. She then moved to Tokyo, designing kimonos and making jewellery (a hit with Yakuza gangsters).\u003c/p\u003e\u003cp\u003eIn Ben Hayoun-Stépanian’s mind, space exploration forces us to reimagine everything. “It’s queer. It’s decolonial. It’s pluralistic.” We need to let go of the binaries and borders, she says. Since her film premiered at SXSW last year, Donald Trump ordered Nasa to close its diversity, equity and inclusion initiatives. “It’s devastating. You can’t just think of people as minorities. Actually, there is a direct value in bringing them into the room because, in space mission design, they bring a different way of functioning and thinking. I am making a case, which is a scientific case, for it.”\u003c/p\u003e\u003cfigure id=\"b3659922-e0d9-4c12-8fe1-27dc84a4a595\" data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.ImageBlockElement\"\u003e\u003cdiv id=\"img-4\"\u003e\u003cpicture\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=620\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=620\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 660px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=605\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=605\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 480px)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=445\u0026amp;dpr=2\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"/\u003e\u003csource srcset=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" media=\"(min-width: 320px)\"/\u003e\u003cimg alt=\"Triple threat … the doppelgangers prepare for space.\" src=\"https://i.guim.co.uk/img/media/fb545462027f0bfa8f2502c0dd8147ea39a03a8f/0_0_11648_8736/master/11648.jpg?width=445\u0026amp;dpr=1\u0026amp;s=none\u0026amp;crop=none\" width=\"445\" height=\"333.75\" loading=\"lazy\"/\u003e\u003c/picture\u003e\u003c/div\u003e\u003cfigcaption data-spacefinder-role=\"inline\"\u003e\u003cspan\u003e\u003csvg width=\"18\" height=\"13\" viewBox=\"0 0 18 13\"\u003e\u003cpath d=\"M18 3.5v8l-1.5 1.5h-15l-1.5-1.5v-8l1.5-1.5h3.5l2-2h4l2 2h3.5l1.5 1.5zm-9 7.5c1.9 0 3.5-1.6 3.5-3.5s-1.6-3.5-3.5-3.5-3.5 1.6-3.5 3.5 1.6 3.5 3.5 3.5z\"\u003e\u003c/path\u003e\u003c/svg\u003e\u003c/span\u003e\u003cspan\u003eTriple threat … the doppelgangers prepare for space.\u003c/span\u003e Photograph: Nick Ballón\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003ePussy Riot contributed music to the film, and Ben Hayoun-Stépanian is friends with the band’s co-founder \u003ca href=\"https://www.theguardian.com/lifeandstyle/2019/apr/20/this-much-i-know-nadya-tolokonnikova-pussy-riot\" data-link-name=\"in body link\"\u003eNadya Tolokonnikova\u003c/a\u003e. They met when they were both speaking at a conference. “These diplomat dudes were running after Nadya, like, ‘\u003cem\u003eOh my god\u003c/em\u003e, we want to take your picture.’ I was sitting next to her in my big black bomber jacket. They all thought I was her security. Nadya is a force to be reckoned with. For me, she is the definition of courage. Me, I risk power structures. I annoy them. But I never get to a point where I’m going to go in jail. I always work with lawyers. I know what I can do, what I cannot do. Nadya has been put in jail. It’s another level. I wouldn’t go that far, you know?”\u003c/p\u003e\u003cp\u003eI ask Ben Hayoun-Stépanian if she gets resistance walking into institutions such as Nasa looking as she does? “Always!” she says cheerily. “There is always a moment where when I arrive in the room and people are like, ‘\u003cem\u003eWhat\u003c/em\u003e is this?’” Her look today is head-to-toe snakeskin print, huge hoop earrings and neon green nails. Is she comfortable with conflict? A nod. “There is always conflict, but conflict is part of the process. Conflict is never a state that remains.”\u003c/p\u003e\u003cp\u003eI ask her if there’s anything else I should ask. “I am turning 40 on 27 May. Haha. My mom told me to tell you this.” OK. And what about your next film? “Ha! My next film is even more mad.”\u003c/p\u003e\u003cp\u003e\u003cspan data-dcr-style=\"bullet\"\u003e\u003c/span\u003e Doppelgängers³ screens on 2 and 7 June at Rich Mix, London, as part of SXSW.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "10 min read",
  "publishedTime": "2025-05-29T04:00:19Z",
  "modifiedTime": "2025-05-29T22:03:16Z"
}
