{
  "id": "b575d473-00e6-4f0f-8404-dddf2414f8fe",
  "title": "NASA’s Commercial Partners Make Progress on Low Earth Orbit Projects",
  "link": "https://www.nasa.gov/general/nasas-commercial-partners-make-progress-on-low-earth-orbit-projects/",
  "description": "NASA and its commercial partners continue to drive innovation in space exploration, achieving milestones that will ultimately benefit human spaceflight and commercial low Earth orbit efforts. These recent achievements from NASA’s industry partners include completed safety milestones, successful flight tests, and major technological advancements. “Our commercial partners’ growing capabilities in low Earth orbit underscore NASA’s […]",
  "author": "Roger Weiss",
  "published": "Mon, 25 Nov 2024 21:18:18 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "General",
    "Commercial Space",
    "Low Earth Orbit Economy"
  ],
  "byline": "Roger Weiss",
  "length": 7857,
  "excerpt": "NASA and its commercial partners continue to drive innovation in space exploration, achieving milestones that will ultimately benefit human spaceflight and",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "NASA and its commercial partners continue to drive innovation in space exploration, achieving milestones that will ultimately benefit human spaceflight and commercial low Earth orbit efforts. These recent achievements from NASA’s industry partners include completed safety milestones, successful flight tests, and major technological advancements. “Our commercial partners’ growing capabilities in low Earth orbit underscore NASA’s commitment to advance scientific discovery, pioneering space technology, and support future deep space exploration,” said Angela Hart, manager of the Commercial Low Earth Orbit Development Program at NASA’s Johnson Space Center in Houston. As NASA expands opportunities in low Earth orbit, the agency is working with seven U.S. companies to meet future commercial and government needs through the second Collaborations for Commercial Space Capabilities initiative. Blue Origin continues to make progress in the development of an integrated commercial space transportation capability that ensures safe, affordable, and high-frequency U.S. access to orbit for crew and other missions. Northrop Grumman is evolving the company’s Cygnus spacecraft as a foundational logistics and research platform to support NASA’s next generation of low Earth orbit ventures. The company recently completed a project management review with NASA, presenting the roadmap and enhancements to commercialize the spacecraft. Northrop Grumman also continues to make progress toward the implementation of docking capability through a partnership with Starlab Space. Sierra Space recently completed two full-scale ultimate burst pressure tests of its LIFE (Large Integrated Flexible Environment) habitat structure, an element of a NASA-funded commercial space station for new destinations in low Earth orbit. The company also has selected and tested materials for the habitat’s air barrier, focusing on permeability and flammability testing to meet the recommended safety standards. The inflatable habitat is designed to expand in orbit, creating a versatile living and working area for astronauts with a flexible, durable structure that allows for compact launch and significant expansion upon deployment. Sierra Space also has advanced in high velocity impact testing and micro-meteoroid and orbital debris configuration and material selection, crucial for ensuring the safety and durability of the company’s space structures, along with advancing radiator designs to optimize thermal management for long-duration missions. SpaceX continues developing the company’s Starship spacecraft, a fully reusable transportation system designed for missions to low Earth orbit, the Moon, Mars, and beyond. SpaceX completed multiple flight tests, launching the spacecraft on the Super Heavy, the launch system’s booster, from the company’s Starbase facility in Boca Chica, Texas. During the tests, SpaceX demonstrated key capabilities needed for the system’s reusability, including landing burns and reentry from hypersonic velocities. SpaceX is preparing to launch newer generations of the Starship system, powered by upgraded versions of its reusable methane-oxygen staged-combustion Raptor engines, as it works to operationalize the system ahead of the first crewed lunar landing missions under the agency’s Artemis campaign. Special Aerospace Services is developing an Autonomous Maneuvering Unit that incorporates in-space servicing, propulsion, and robotic technologies. The company is evaluating customer needs and establishing the details and features for the initial flight unit. Special Aerospace Services also is working on a prototype unit at its Special Projects Research Facility in Arvada, Colorado, and has started construction of a new campus and final assembly facility in Huntsville, Alabama. The application of these technologies is intended for the safer assembly of commercial destinations, servicing, retrieval, and inspection of in-space systems. ThinkOrbital recently demonstrated autonomous welding in space, validated by NASA and ESA (European Space Agency). The company will further test in-space welding, cutting, and X-ray inspection technologies on another mission later this year. ThinkOrbital’s third mission, scheduled for late 2025, will focus on developing commercially viable products, including a robotic arm with advanced end-effector solutions and standalone X-ray inspection capabilities. In-space welding technologies could enable building larger structures for future commercial space stations. Vast continues development progress on the Haven-1 commercial space station, targeted to launch in 2025. The company recently completed several technical milestones, including fabricating key components such as the primary structure pathfinder, hatch, battery module, and control moment gyroscope. Vast also completed a solar array deployment test and the station’s preliminary design review with NASA’s support. While collaborating with the agency on developing and testing the commercial station’s dome-shaped window, Vast performed rigorous pressure testing to meet safety requirements. In addition to these efforts, NASA also is collaborating with two businesses through its Small Business Innovation Research Ignite initiative, which focuses on commercially viable technology ideas aligned with the agency’s mission needs. Both companies are developing technologies for potential use on the International Space Station and future commercial space stations. Canopy Aerospace is developing a new manufacturing system aimed at improving the production of ceramic heat shields, also known as thermal protection systems. The company recently validated the material properties of a low-density ceramic insulator using an alumina-enhanced thermal barrier formulation. Canopy Aerospace also continues development of a 3D-printed, low-density ablator designed to provide thermal protection during extreme heating. The company also worked on other 3D-printed materials, such as aluminum nitride and oxide ceramic products, which could be useful in various applications across the energy, space, aerospace, and industrial sectors, including electromagnetic thrusters for satellites. Canopy Aerospace also developed standard layups of fiber-reinforced composites and integrated cork onto composite panels. Outpost Technologies completed a high-altitude flight test of its Cargo Ferry, a reusable cargo transportation vehicle. The company dropped a full-scale prototype from 82,000 feet via weather balloon to test its recovery system and range capabilities. The key innovation is a robotic paraglider that guides the vehicle to a precise landing. The paraglider deployed at a record-setting altitude of 65,000 feet, marking the highest flight ever for such a system. During the test, the vehicle autonomously flew 165 miles before it was safely recovered at the landing site, demonstrating the system’s reliability. The company’s low-mass re-entry system can protect payload mass and volume for future space cargo return missions and point-to-point delivery. NASA’s low Earth orbit microgravity strategy builds on the agency’s extensive human spaceflight experience to advance future scientific and exploration goals. As the International Space Station nears the end of operations, NASA plans to transition to a new low Earth orbit model to continue leveraging microgravity benefits. Through commercial partnerships, NASA aims to maintain its leadership in microgravity research and ensure continued benefits for humanity. Learn more about NASA’s low Earth orbit microgravity strategy at: https://www.nasa.gov/leomicrogravitystrategy News Media Contacts Claire O’SheaHeadquarters, Washington202-358-1100claire.a.o’shea@nasa.gov Anna SchneiderJohnson Space Center, Houston281-483-5111anna.c.schneider@nasa.gov",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/11/milkyway-and-iss.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\u003cp\u003eNASA and its commercial partners continue to drive innovation in space exploration, achieving milestones that will ultimately benefit human spaceflight and commercial low Earth orbit efforts. These recent achievements from NASA’s industry partners include completed safety milestones, successful flight tests, and major technological advancements.\u003c/p\u003e\n\u003cp\u003e“Our commercial partners’ growing capabilities in low Earth orbit underscore NASA’s commitment to advance scientific discovery, pioneering space technology, and support future deep space exploration,” said Angela Hart, manager of the Commercial Low Earth Orbit Development Program at NASA’s Johnson Space Center in Houston. \u003c/p\u003e\n\u003cp\u003eAs NASA expands opportunities in low Earth orbit, the agency is working with seven U.S. companies to meet future commercial and government needs through the second \u003ca href=\"https://www.nasa.gov/news-release/seven-us-companies-collaborate-with-nasa-to-advance-space-capabilities/\"\u003eCollaborations for Commercial Space Capabilities\u003c/a\u003e initiative.\u003c/p\u003e\n\n\n\u003cp\u003eBlue Origin continues to make progress in the development of an integrated commercial space transportation capability that ensures safe, affordable, and high-frequency U.S. access to orbit for crew and other missions.\u003c/p\u003e\n\n\n\n\u003cp\u003eNorthrop Grumman is evolving the company’s Cygnus spacecraft as a foundational logistics and research platform to support NASA’s next generation of low Earth orbit ventures. The company recently completed a project management review with NASA, presenting the roadmap and enhancements to commercialize the spacecraft. Northrop Grumman also continues to make progress toward the implementation of docking capability through a partnership with Starlab Space.\u003c/p\u003e\n\n\n\n\u003cp\u003eSierra Space recently completed two full-scale ultimate burst pressure tests of its LIFE (Large Integrated Flexible Environment) habitat structure, an element of a NASA-funded commercial space station for new destinations in low Earth orbit. The company also has selected and tested materials for the habitat’s air barrier, focusing on permeability and flammability testing to meet the recommended safety standards. The inflatable habitat is designed to expand in orbit, creating a versatile living and working area for astronauts with a flexible, durable structure that allows for compact launch and significant expansion upon deployment.\u003c/p\u003e\n\u003cp\u003eSierra Space also has advanced in high velocity impact testing and micro-meteoroid and orbital debris configuration and material selection, crucial for ensuring the safety and durability of the company’s space structures, along with advancing radiator designs to optimize thermal management for long-duration missions.\u003c/p\u003e\n\n\n\u003cp\u003eSpaceX continues developing the company’s Starship spacecraft, a fully reusable transportation system designed for missions to low Earth orbit, the Moon, Mars, and beyond. SpaceX completed multiple flight tests, launching the spacecraft on the Super Heavy, the launch system’s booster, from the company’s Starbase facility in Boca Chica, Texas. During the tests, SpaceX demonstrated key capabilities needed for the system’s reusability, including landing burns and reentry from hypersonic velocities.\u003c/p\u003e\n\u003cp\u003eSpaceX is preparing to launch newer generations of the Starship system, powered by upgraded versions of its reusable methane-oxygen staged-combustion Raptor engines, as it works to operationalize the system ahead of the first crewed lunar landing missions under the agency’s Artemis campaign.\u003c/p\u003e\n\n\n\u003cp\u003eSpecial Aerospace Services is developing an Autonomous Maneuvering Unit that incorporates in-space servicing, propulsion, and robotic technologies. The company is evaluating customer needs and establishing the details and features for the initial flight unit. Special Aerospace Services also is working on a prototype unit at its Special Projects Research Facility in Arvada, Colorado, and has started construction of a new campus and final assembly facility in Huntsville, Alabama. The application of these technologies is intended for the safer assembly of commercial destinations, servicing, retrieval, and inspection of in-space systems.\u003c/p\u003e\n\n\n\u003cp\u003eThinkOrbital recently demonstrated autonomous welding in space, validated by NASA and ESA (European Space Agency). The company will further test in-space welding, cutting, and X-ray inspection technologies on another mission later this year. ThinkOrbital’s third mission, scheduled for late 2025, will focus on developing commercially viable products, including a robotic arm with advanced end-effector solutions and standalone X-ray inspection capabilities. In-space welding technologies could enable building larger structures for future commercial space stations.\u003c/p\u003e\n\n\n\u003cp\u003eVast continues development progress on the Haven-1 commercial space station, targeted to launch in 2025. The company recently completed several technical milestones, including fabricating key components such as the primary structure pathfinder, hatch, battery module, and control moment gyroscope.\u003c/p\u003e\n\u003cp\u003eVast also completed a solar array deployment test and the station’s preliminary design review with NASA’s support. While collaborating with the agency on developing and testing the commercial station’s dome-shaped window, Vast performed rigorous pressure testing to meet safety requirements.\u003c/p\u003e\n\u003cp\u003eIn addition to these efforts, NASA also is collaborating with two businesses through its \u003ca href=\"https://www.nasa.gov/humans-in-space/commercial-space/leo-economy/nasa-small-companies-eye-new-cargo-delivery-heat-shield-technologies/\"\u003eSmall Business Innovation Research Ignite\u003c/a\u003e initiative, which focuses on commercially viable technology ideas aligned with the agency’s mission needs. Both companies are developing technologies for potential use on the International Space Station and future commercial space stations.\u003c/p\u003e\n\n\n\u003cp\u003eCanopy Aerospace is developing a new manufacturing system aimed at improving the production of ceramic heat shields, also known as thermal protection systems. The company recently validated the material properties of a low-density ceramic insulator using an alumina-enhanced thermal barrier formulation.\u003c/p\u003e\n\u003cp\u003eCanopy Aerospace also continues development of a 3D-printed, low-density ablator designed to provide thermal protection during extreme heating. The company also worked on other 3D-printed materials, such as aluminum nitride and oxide ceramic products, which could be useful in various applications across the energy, space, aerospace, and industrial sectors, including electromagnetic thrusters for satellites. Canopy Aerospace also developed standard layups of fiber-reinforced composites and integrated cork onto composite panels.\u003c/p\u003e\n\n\n\u003cp\u003eOutpost Technologies completed a high-altitude flight test of its Cargo Ferry, a reusable cargo transportation vehicle. The company dropped a full-scale prototype from 82,000 feet via weather balloon to test its recovery system and range capabilities. The key innovation is a robotic paraglider that guides the vehicle to a precise landing. The paraglider deployed at a record-setting altitude of 65,000 feet, marking the highest flight ever for such a system.\u003c/p\u003e\n\u003cp\u003eDuring the test, the vehicle autonomously flew 165 miles before it was safely recovered at the landing site, demonstrating the system’s reliability. The company’s low-mass re-entry system can protect payload mass and volume for future space cargo return missions and point-to-point delivery.\u003c/p\u003e\n\u003cp\u003eNASA’s low Earth orbit microgravity strategy builds on the agency’s extensive human spaceflight experience to advance future scientific and exploration goals. As the International Space Station nears the end of operations, NASA plans to transition to a new low Earth orbit model to continue leveraging microgravity benefits. Through commercial partnerships, NASA aims to maintain its leadership in microgravity research and ensure continued benefits for humanity.\u003c/p\u003e\n\u003cp\u003eLearn more about NASA’s low Earth orbit microgravity strategy at:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/leomicrogravitystrategy\"\u003e\u003cstrong\u003ehttps://www.nasa.gov/leomicrogravitystrategy\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\n\n\u003cp\u003e\u003cstrong\u003eNews Media Contacts\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClaire O’Shea\u003cbr/\u003eHeadquarters, Washington\u003cbr/\u003e202-358-1100\u003cbr/\u003eclaire.a.o’shea@nasa.gov\u003c/p\u003e\n\u003cp\u003eAnna Schneider\u003cbr/\u003eJohnson Space Center, Houston\u003cbr/\u003e281-483-5111\u003cbr/\u003eanna.c.schneider@nasa.gov\u003c/p\u003e\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2024-11-25T16:18:18-05:00",
  "modifiedTime": "2024-11-25T16:18:19-05:00"
}
