{
  "id": "c58df686-48e4-4170-898f-89e8ddb02f58",
  "title": "NASA’s Juno Back to Normal Operations After Entering Safe Mode",
  "link": "https://science.nasa.gov/missions/juno/nasas-juno-back-to-normal-operations-after-entering-safe-mode/",
  "description": "The spacecraft was making its 71st close approach to Jupiter when it unexpectedly entered into a precautionary status. Data received from NASA’s Juno mission indicates the solar-powered spacecraft went into safe mode twice on April 4 while the spacecraft was flying by Jupiter. Safe mode is a precautionary status that a spacecraft enters when it […]",
  "author": "",
  "published": "Wed, 09 Apr 2025 21:38:21 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Juno"
  ],
  "byline": "agreicius",
  "length": 3194,
  "excerpt": "The spacecraft was making its 71st close approach to Jupiter when it unexpectedly entered into a precautionary status.",
  "siteName": "NASA Science",
  "favicon": "https://science.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "The spacecraft was making its 71st close approach to Jupiter when it unexpectedly entered into a precautionary status. Data received from NASA’s Juno mission indicates the solar-powered spacecraft went into safe mode twice on April 4 while the spacecraft was flying by Jupiter. Safe mode is a precautionary status that a spacecraft enters when it detects an anomaly. Nonessential functions are suspended, and the spacecraft focuses on essential tasks like communication and power management. Upon entering safe mode, Juno’s science instruments were powered down, as designed, for the remainder of the flyby. The mission operations team has reestablished high-rate data transmission with Juno, and the spacecraft is currently conducting flight software diagnostics.The team will work in the ensuing days to transmit the engineering and science data collected before and after the safe-mode events to Earth. Juno first entered safe mode at 5:17 a.m. EDT, about an hour before its 71st close passage of Jupiter — called perijove. It went into safe mode again 45 minutes after perijove. During both safe-mode events, the spacecraft performed exactly as designed, rebooting its computer, turning off nonessential functions, and pointing its antenna toward Earth for communication. Of all the planets in our solar system, Jupiter is home to the most hostile environment, with the radiation belts closest to the planet being the most intense. Early indications suggest the two Perijove 71 safe-mode events occurred as the spacecraft flew through these belts. To block high-energy particles from impacting sensitive electronics and mitigate the harmful effects of the radiation, Juno features a titanium radiation vault. Including the Perijove 71 events, Juno has unexpectedly entered spacecraft-induced safe mode four times since arriving at Jupiter in July 2016: first, in 2016 during its second orbit, then in 2022 during its 39th orbit. In all four cases, the spacecraft performed as expected and recovered full capability. Juno’s next perijove will occur on May 7 and include a flyby of the Jovian moon Io at a distance of about 55,300 miles (89,000 kilometers). NASA’s Jet Propulsion Laboratory, a division of Caltech in Pasadena, California, manages the Juno mission for the principal investigator, Scott Bolton, of the Southwest Research Institute in San Antonio. Juno is part of NASA’s New Frontiers Program, which is managed at NASA’s Marshall Space Flight Center in Huntsville, Alabama, for the agency’s Science Mission Directorate in Washington. The Italian Space Agency (ASI) funded the Jovian InfraRed Auroral Mapper. Lockheed Martin Space in Denver built and operates the spacecraft. Various other institutions around the U.S. provided several of the other scientific instruments on Juno. More information about Juno is available at: https://www.nasa.gov/juno DC AgleJet Propulsion Laboratory, Pasadena, Calif.818-393-9011agle@jpl.nasa.gov Karen Fox / Molly WasserNASA Headquarters, Washington202-358-1600karen.c.fox@nasa.gov / molly.l.wasser@nasa.gov Deb SchmidSouthwest Research Institute, San Antonio210-522-2254dschmid@swri.org 2025-049",
  "image": "https://science.nasa.gov/wp-content/uploads/2024/03/pia21770large.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\n\n\n\u003cp\u003e\u003cem\u003eThe spacecraft was making its 71st close approach to Jupiter when it unexpectedly entered into a precautionary status.\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eData received from NASA’s Juno mission indicates the solar-powered spacecraft went into safe mode twice on April 4 while the spacecraft was flying by Jupiter. Safe mode is a precautionary status that a spacecraft enters when it detects an anomaly. Nonessential functions are suspended, and the spacecraft focuses on essential tasks like communication and power management. Upon entering safe mode, Juno’s science instruments were powered down, as designed, for the remainder of the flyby.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe mission operations team has reestablished high-rate data transmission with Juno, and the spacecraft is currently conducting flight software diagnostics.The team will work in the ensuing days to transmit the engineering and science data collected before and after the safe-mode events to Earth.\u003c/p\u003e\n\n\n\n\u003cp\u003eJuno first entered safe mode at 5:17 a.m. EDT, about an hour before its 71st close passage of Jupiter — called perijove. It went into safe mode again 45 minutes after perijove. During both safe-mode events, the spacecraft performed exactly as designed, rebooting its computer, turning off nonessential functions, and pointing its antenna toward Earth for communication.\u003c/p\u003e\n\n\n\n\u003cp\u003eOf all the planets in our solar system, Jupiter is home to the most hostile environment, with the radiation belts closest to the planet being the most intense. Early indications suggest the two Perijove 71 safe-mode events occurred as the spacecraft flew through these belts. To block high-energy particles from impacting sensitive electronics and mitigate the harmful effects of the radiation, Juno features a \u003ca href=\"https://www.jpl.nasa.gov/images/pia13260-setting-up-junos-radiation-vault/\"\u003etitanium radiation vault\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003cp\u003eIncluding the Perijove 71 events, Juno has unexpectedly entered spacecraft-induced safe mode four times since \u003ca href=\"https://www.jpl.nasa.gov/news/nasas-juno-spacecraft-launches-to-jupiter/\"\u003earriving\u003c/a\u003e at Jupiter in July 2016: first, in \u003ca href=\"https://www.jpl.nasa.gov/news/nasas-juno-mission-exits-safe-mode-performs-trim-maneuver/\"\u003e2016 during its second orbit\u003c/a\u003e, then in \u003ca href=\"https://www.jpl.nasa.gov/news/juno-spacecraft-recovering-memory-after-47th-flyby-of-jupiter/\"\u003e2022 during its 39th orbit\u003c/a\u003e. In all four cases, the spacecraft performed as expected and recovered full capability.\u003c/p\u003e\n\n\n\n\u003cp\u003eJuno’s next perijove will occur on May 7 and include a flyby of the Jovian moon Io at a distance of about 55,300 miles (89,000 kilometers).\u003cem\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eNASA’s Jet Propulsion Laboratory, a division of Caltech in Pasadena, California, manages the Juno mission for the principal investigator, Scott Bolton, of the Southwest Research Institute in San Antonio. Juno is part of NASA’s New Frontiers Program, which is managed at NASA’s Marshall Space Flight Center in Huntsville, Alabama, for the agency’s Science Mission Directorate in Washington. The Italian Space Agency (ASI) funded the Jovian InfraRed Auroral Mapper. Lockheed Martin Space in Denver built and operates the spacecraft. Various other institutions around the U.S. provided several of the other scientific instruments on Juno.\u003c/p\u003e\n\n\n\n\u003cp\u003eMore information about Juno is available at:\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca href=\"https://www.nasa.gov/juno\"\u003ehttps://www.nasa.gov/juno\u003c/a\u003e\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eDC Agle\u003cbr/\u003eJet Propulsion Laboratory, Pasadena, Calif.\u003cbr/\u003e818-393-9011\u003cbr/\u003e\u003ca href=\"mailto:agle@jpl.nasa.gov\"\u003eagle@jpl.nasa.gov\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eKaren Fox / Molly Wasser\u003cbr/\u003eNASA Headquarters, Washington\u003cbr/\u003e202-358-1600\u003cbr/\u003e\u003ca href=\"mailto:karen.c.fox@nasa.gov\"\u003ekaren.c.fox@nasa.gov\u003c/a\u003e / \u003ca href=\"mailto:molly.l.wasser@nasa.gov\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emolly.l.wasser@nasa.gov\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eDeb Schmid\u003cbr/\u003eSouthwest Research Institute, San Antonio\u003cbr/\u003e210-522-2254\u003cbr/\u003e\u003ca href=\"mailto:dschmid@swri.org\"\u003edschmid@swri.org\u003c/a\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003e2025-049\u003c/p\u003e\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2025-04-09T17:38:21-04:00",
  "modifiedTime": "2025-04-09T17:38:23-04:00"
}
