{
  "id": "d2384615-c2ea-46cf-9dc9-260ac44608db",
  "title": "Matter-spewing 'singularities' could eliminate the need for dark energy and dark matter",
  "link": "https://www.space.com/the-universe/matter-spewing-singularities-could-eliminate-the-need-for-dark-energy-and-dark-matter",
  "description": "A new cosmic model suggests that singularities could briefly pop into existence, spewing matter and energy into the cosmos, negating the need for dark energy and dark matter.",
  "author": "",
  "published": "Tue, 15 Apr 2025 20:00:00 +0000",
  "source": "https://www.space.com/feeds/all",
  "categories": [
    "The Universe"
  ],
  "byline": "Robert Lea",
  "length": 6486,
  "excerpt": "\"The new model can account for both structure formation and stability, and the key observational properties of the expansion of the universe at large.\"",
  "siteName": "Space",
  "favicon": "https://vanilla.futurecdn.net/space/1241688/apple-touch-icon.png",
  "text": "An illustration shows a multitude of singulaties spitting matter in the universe around Earth. Could such phenomena account for dark energy? (Image credit: Robert Lea (created with Canva)) A new model of the cosmos does away with the universe's two most troubling and mysterious elements, dark energy and dark matter, collectively referred to as the dark universe. Here's the idea.The new concept replaces the dark universe with a multitude of step-like bursts called \"transient temporal singularities\" that erupt throughout the entire cosmos.It's possible, scientists say, that these transient temporal singularities could open to flood the universe with matter and energy, causing the very fabric of space to expand. Those rifts would close so quickly they would remain undetectable, leaving us to see the expansion of the cosmos we credit to dark energy, and the gravitational influence we attribute to dark matter.\"The new model can account for both structure formation and stability, and the key observational properties of the expansion of the universe at large, by enlisting density singularities in time that uniformly affect all space to replace conventional dark matter and dark energy,\" research author Richard Lieu, a physics professor at The University of Alabama in Huntsville, said in a statement.The dark universe under pressureThe dark universe is poses such a huge conundrum for scientists because it suggests that only 5% of the matter and energy in the cosmos comprises what we see around us on a day-to-day basis in stars, planets, moons, our bodies — and everything else, really.In other words, we have no idea what the other 95% of the cosmos is.Of this enormous slice of the universe's matter and energy budget, dark energy — the placeholder name for the force causing the expansion of the universe to accelerate — accounts for around 70%. Dark matter, on the other hand, helped the first galaxies gather through its gravitational influence — but it remains effectively invisible because it doesn't interact with light. Yet, dark matter accounts for the remaining around 25% of that matter budget.Breaking space news, the latest updates on rocket launches, skywatching events and more!The ubiquity of dark matter and dark energy and their importance in our models of cosmic evolution make the dark universe a double mystery that scientists would love to resolve.A diagram showing estimated contributions to the universe's energy-matter budget demonstrating the dominance of dark energy (Image credit: ESA)Building upon prior research in which he suggested that gravity could exist without the presence of mass, Lieu does away with the need for dark matter and dark energy.Unlike previous attempts, however, Lieu's model doesn't need an exotic addition to current cosmological models, such as \"negative mass\" or \"negative density,\" to negate the dark universe.\"Sir Fred Hoyle opposed Big Bang cosmology and postulated a 'steady state' model of the universe in which matter and energy were constantly being created as the universe expands,\" Lieu explained. \"But that hypothesis violates the law of mass-energy conservation.\"Lieu instead suggests that via transient temporal singularities, matter and energy can appear and disappear in sudden bursts. This doesn't violate the current conservation laws of physics.\"These singularities are unobservable because they occur rarely in time and are unresolvedly fast, and that could be the reason why dark matter and dark energy have not been found,\" Lieu added. \"The origin of these temporal singularities is unknown – safe to say that the same is true of the moment of the Big Bang itself.\"A timeline of the universe since the Big Bang around 13.7 billion years ago. (Image credit: NASA/WMAP Science Team)Lieu's model sees these singularities as generating a \"negative pressure\" with an anti-gravity-like effect serving to push the universe apart at an accelerating rate, just as dark energy is proposed to do.\"An example is the negative pressure exerted by a magnetic field along a field line,\" Lieu said. \"Einstein also postulated negative pressure in his 1917 paper on the Cosmological Constant. When positive mass-energy density is combined with negative pressure, there are some restrictions which ensure the mass-energy density remains positive with respect to any uniformly moving observer, so the negative density assumption is avoided in the new model.\"Lieu's ultimate conclusion is that the dark universe and its constituents may not be an omnipresent factor in the cosmos.\"They only appear in brief instances during which the matter and energy do fill the entire universe uniformly, apart from random spatial density variations which grow to form bound structures like galaxies,\" he continued. \"In between which, they are not to be found anywhere.\"The only difference between this work and the standard model is that the temporal singularity occurred only once in the latter, but more than once in the former.\"In the future, Lieu intends to try validating his theory by turning to ground-based telescopes to look for \"jumps\" in redshift — in reference to the stretching of light coming from distant objects as they recede away from us due to the expansion of space.\"The best way to look for the proposed effect is actually to use a large ground-based telescope – like the Keck Observatory [located in Hawaii], or the Isaac Newton Group of Telescopes in La Palma, Spain – to perform deep field observations, the data of which would be ‘sliced’ according to redshift,” he said. “Given sufficient redshift (or, equivalently, time) resolution effected by the redshift slicing, one might just find that the Hubble diagram exhibits jumps in the redshift distance relation, which would be very revealing.\"Lieu's research was published on March 21 in the journal Classical and Quantum Gravity. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Robert Lea is a science journalist in the U.K. whose articles have been published in Physics World, New Scientist, Astronomy Magazine, All About Space, Newsweek and ZME Science. He also writes about science communication for Elsevier and the European Journal of Physics. Rob holds a bachelor of science degree in physics and astronomy from the U.K.’s Open University. Follow him on Twitter @sciencef1rst. More about science astronomy",
  "image": "https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-widget-type=\"contentparsed\" id=\"content\"\u003e\n\n\u003csection\u003e\n\u003cdiv\u003e\n\u003cdiv\u003e\n\u003cpicture data-new-v2-image=\"true\"\u003e\n\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1920-80.png.webp 1920w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1200-80.png.webp 1200w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1024-80.png.webp 1024w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-970-80.png.webp 970w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-650-80.png.webp 650w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-480-80.png.webp 480w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-320-80.png.webp 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\"/\u003e\n\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn.png\" alt=\"An illustration shows a multitude of singulaties spitting matter in the universe around Earth. Could such phenomena account for dark energy?\" srcset=\"https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1920-80.png 1920w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1200-80.png 1200w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-1024-80.png 1024w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-970-80.png 970w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-650-80.png 650w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-480-80.png 480w, https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn-320-80.png 320w\" sizes=\"(min-width: 1000px) 600px, calc(100vw - 40px)\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn.png\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/DbmtcmebyUkdhPrSyosaQn.png\" data-pin-nopin=\"true\" fetchpriority=\"high\"/\u003e\n\u003c/picture\u003e\n\u003c/div\u003e\n\u003cfigcaption\u003e\n\u003cspan\u003eAn illustration shows a multitude of singulaties spitting matter in the universe around Earth. Could such phenomena account for dark energy?\u003c/span\u003e\n\u003cspan\u003e(Image credit: Robert Lea (created with Canva))\u003c/span\u003e\n\u003c/figcaption\u003e\n\u003c/div\u003e\n\n\u003cdiv id=\"article-body\"\u003e\n\u003cp\u003eA new model of the cosmos does away with the universe\u0026#39;s two most troubling and mysterious elements, dark energy and dark matter, collectively referred to as the dark universe. Here\u0026#39;s the idea.\u003c/p\u003e\u003cp\u003eThe new concept replaces the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/dark-universe-rubin-observatory-mysteries\" data-before-rewrite-localise=\"https://www.space.com/dark-universe-rubin-observatory-mysteries\"\u003edark universe \u003c/a\u003ewith a multitude of step-like bursts called \u0026#34;transient temporal singularities\u0026#34; that erupt throughout the entire cosmos.\u003c/p\u003e\u003cp\u003eIt\u0026#39;s possible, scientists say, that these transient temporal singularities could open to flood the universe with matter and energy, causing the very fabric of space to expand. Those rifts would close so quickly they would remain undetectable, leaving us to see the expansion of the cosmos we credit to dark energy, and the gravitational influence we attribute to \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/20930-dark-matter.html\" data-before-rewrite-localise=\"https://www.space.com/20930-dark-matter.html\"\u003edark matter\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u0026#34;The new model can account for both structure formation and stability, and the key observational properties of the expansion of the universe at large, by enlisting density singularities in time that uniformly affect all space to replace conventional dark matter and dark energy,\u0026#34; research author Richard Lieu, a physics professor at The University of Alabama in Huntsville, \u003ca data-analytics-id=\"inline-link\" href=\"https://www.uah.edu/news/items/uah-physics-researcher-proposes-first-time-model-replaces-dark-energy-and-dark-matter-explaining-nature-of-universe\" target=\"_blank\" data-url=\"https://www.uah.edu/news/items/uah-physics-researcher-proposes-first-time-model-replaces-dark-energy-and-dark-matter-explaining-nature-of-universe\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003esaid in a statement.\u003c/a\u003e\u003c/p\u003e\u003ch2 id=\"the-dark-universe-under-pressure-3\"\u003eThe dark universe under pressure\u003c/h2\u003e\u003cp\u003eThe dark universe is poses such a huge conundrum for scientists because it suggests that only 5% of the matter and energy in the cosmos comprises what we see around us on a day-to-day basis in \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/57-stars-formation-classification-and-constellations.html\" data-before-rewrite-localise=\"https://www.space.com/57-stars-formation-classification-and-constellations.html\"\u003estars\u003c/a\u003e, planets, moons, our bodies — and everything else, really.\u003c/p\u003e\u003cp\u003eIn other words, we have no idea what the other 95% of the cosmos is.\u003c/p\u003e\u003cdiv\u003e\u003cp\u003eOf this enormous slice of the universe\u0026#39;s matter and energy budget,\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/dark-energy-explains-different-expansion-rates.html?utm_source=sdc-newsletter\u0026amp;utm_medium=email\u0026amp;utm_campaign=20190705-sdc\" data-before-rewrite-localise=\"https://www.space.com/dark-energy-explains-different-expansion-rates.html?utm_source=sdc-newsletter\u0026amp;utm_medium=email\u0026amp;utm_campaign=20190705-sdc\"\u003e dark energy \u003c/a\u003e— the placeholder name for the force causing the expansion of the universe to accelerate — accounts for around 70%. \u003c/p\u003e\u003cp\u003e\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/self-interacting-dark-matter-higher-dimensional-universe\" data-before-rewrite-localise=\"https://www.space.com/self-interacting-dark-matter-higher-dimensional-universe\"\u003eDark matter\u003c/a\u003e, on the other hand, helped the first galaxies gather through its gravitational influence — but it remains effectively invisible because it doesn\u0026#39;t interact with light. Yet, dark matter accounts for the remaining around 25% of that matter budget.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-hydrate=\"true\" id=\"slice-container-newsletterForm-articleInbodyContent-cQY25xrX8avmAi42GNtbgh\"\u003e\u003csection\u003e\u003cp\u003eBreaking space news, the latest updates on rocket launches, skywatching events and more!\u003c/p\u003e\u003c/section\u003e\u003c/div\u003e\u003cp\u003eThe ubiquity of dark matter and dark energy and their importance in our models of cosmic evolution make the dark universe a double mystery that scientists would love to resolve.\u003c/p\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM.jpg\" alt=\"A black circle divided into three sections against a white background\" srcset=\"https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/cZySEqCfhcnMt2zsfMh9KM.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eA diagram showing estimated contributions to the universe\u0026#39;s energy-matter budget demonstrating the dominance of dark energy \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: ESA)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eBuilding upon prior research in which he suggested that gravity could exist without the presence of mass, Lieu does away with the need for dark matter and dark energy.\u003c/p\u003e\u003cp\u003eUnlike previous attempts, however, Lieu\u0026#39;s model doesn\u0026#39;t need an exotic addition to current cosmological models, such as \u0026#34;negative mass\u0026#34; or \u0026#34;negative density,\u0026#34; to negate the dark universe.\u003c/p\u003e\u003cp\u003e\u0026#34;Sir \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/21191-brilliant-blunders-science-mario-livio.html\" data-before-rewrite-localise=\"https://www.space.com/21191-brilliant-blunders-science-mario-livio.html\"\u003eFred Hoyle\u003c/a\u003e opposed \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/25126-big-bang-theory.html\" data-before-rewrite-localise=\"https://www.space.com/25126-big-bang-theory.html\"\u003eBig Bang \u003c/a\u003ecosmology and postulated a \u0026#39;steady state\u0026#39; model of the universe in which matter and energy were constantly being created as the universe expands,\u0026#34; Lieu explained. \u0026#34;But that hypothesis violates the law of mass-energy conservation.\u0026#34;\u003c/p\u003e\u003cp\u003eLieu instead suggests that via transient temporal singularities, matter and energy can appear and disappear in sudden bursts. This doesn\u0026#39;t violate the current conservation laws of physics.\u003c/p\u003e\u003cp\u003e\u0026#34;These\u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/new-research-does-away-with-singularities-defy-physics\" data-before-rewrite-localise=\"https://www.space.com/new-research-does-away-with-singularities-defy-physics\"\u003e singularities \u003c/a\u003eare unobservable because they occur rarely in time and are unresolvedly fast, and that could be the reason why dark matter and dark energy have not been found,\u0026#34; Lieu added. \u0026#34;The origin of these temporal singularities is unknown – safe to say that the same is true of the moment of the Big Bang itself.\u0026#34;\u003c/p\u003e\u003cfigure data-bordeaux-image-check=\"\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cpicture\u003e\u003csource type=\"image/webp\" srcset=\"https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-320-80.jpg.webp 320w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-480-80.jpg.webp 480w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-650-80.jpg.webp 650w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-970-80.jpg.webp 970w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-1024-80.jpg.webp 1024w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-1200-80.jpg.webp 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\"/\u003e\u003cimg src=\"https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG.jpg\" alt=\"A funnel-shaped white grid against a black background.\" srcset=\"https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-320-80.jpg 320w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-480-80.jpg 480w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-650-80.jpg 650w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-970-80.jpg 970w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-1024-80.jpg 1024w, https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG-1200-80.jpg 1200w\" sizes=\"(min-width: 1000px) 970px, calc(100vw - 40px)\" loading=\"lazy\" data-original-mos=\"https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG.jpg\" data-pin-media=\"https://cdn.mos.cms.futurecdn.net/9dJFpmaBvH9tgXLFSJqLNG.jpg\"/\u003e\u003c/picture\u003e\u003c/p\u003e\u003c/div\u003e\u003cfigcaption itemprop=\"caption description\"\u003e\u003cspan\u003eA timeline of the universe since the Big Bang around 13.7 billion years ago. \u003c/span\u003e\u003cspan itemprop=\"copyrightHolder\"\u003e(Image credit: NASA/WMAP Science Team)\u003c/span\u003e\u003c/figcaption\u003e\u003c/figure\u003e\u003cp\u003eLieu\u0026#39;s model sees these singularities as generating a \u0026#34;negative pressure\u0026#34; with an anti-gravity-like effect serving to push the universe apart at an accelerating rate, just as dark energy is proposed to do.\u003c/p\u003e\u003cp\u003e\u0026#34;An example is the negative pressure exerted by a magnetic field along a field line,\u0026#34; Lieu said. \u0026#34;Einstein also postulated negative pressure in his 1917 paper on the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/cosmological-constant\" data-before-rewrite-localise=\"https://www.space.com/cosmological-constant\"\u003eCosmological Constant.\u003c/a\u003e When positive mass-energy density is combined with negative pressure, there are some restrictions which ensure the mass-energy density remains positive with respect to any uniformly moving observer, so the negative density assumption is avoided in the new model.\u0026#34;\u003c/p\u003e\u003cp\u003eLieu\u0026#39;s ultimate conclusion is that the dark universe and its constituents may not be an omnipresent factor in the cosmos.\u003c/p\u003e\u003cp\u003e\u0026#34;They only appear in brief instances during which the matter and energy do fill the entire universe uniformly, apart from random spatial density variations which grow to form bound structures like galaxies,\u0026#34; he continued. \u0026#34;In between which, they are not to be found anywhere.\u003c/p\u003e\u003cp\u003e\u0026#34;The only difference between this work and the standard model is that the temporal singularity occurred only once in the latter, but more than once in the former.\u0026#34;\u003c/p\u003e\u003cp\u003eIn the future, Lieu intends to try validating his theory by turning to ground-based telescopes to look for \u0026#34;jumps\u0026#34; in redshift — in reference to the stretching of light coming from distant objects as they recede away from us due to the expansion of space.\u003c/p\u003e\u003cp\u003e\u0026#34;The best way to look for the proposed effect is actually to use a large ground-based telescope – like the \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/26385-keck-observatory.html\" data-before-rewrite-localise=\"https://www.space.com/26385-keck-observatory.html\"\u003eKeck Observatory\u003c/a\u003e [located in Hawaii], or the Isaac Newton Group of Telescopes in La Palma, Spain – to perform \u003ca data-analytics-id=\"inline-link\" href=\"https://www.space.com/the-universe/euclid-space-telescopes-1st-results-reveal-a-goldmine-of-data-in-search-for-dark-matter-and-dark-energy-images-video\" data-before-rewrite-localise=\"https://www.space.com/the-universe/euclid-space-telescopes-1st-results-reveal-a-goldmine-of-data-in-search-for-dark-matter-and-dark-energy-images-video\"\u003edeep field observations\u003c/a\u003e, the data of which would be ‘sliced’ according to redshift,” he said. “Given sufficient redshift (or, equivalently, time) resolution effected by the redshift slicing, one might just find that the Hubble diagram exhibits jumps in the redshift distance relation, which would be very revealing.\u0026#34;\u003c/p\u003e\u003cp\u003eLieu\u0026#39;s research was published on March 21 in the journal \u003ca data-analytics-id=\"inline-link\" href=\"https://iopscience.iop.org/article/10.1088/1361-6382/adbed1#:~:text=Since%20the%20moments%20of%20finite,so%20hard%20to%20find%20them.\u0026amp;text=the%20sound%20speed-,.,released%20uniformly%20throughout%20space%2C%20i.e.\" data-url=\"https://iopscience.iop.org/article/10.1088/1361-6382/adbed1#:~:text=Since%20the%20moments%20of%20finite,so%20hard%20to%20find%20them.\u0026amp;text=the%20sound%20speed-,.,released%20uniformly%20throughout%20space%2C%20i.e.\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"\u003eClassical and Quantum Gravity.\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https://forums.space.com/\"\u003eJoin our Space Forums\u003c/a\u003e to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: \u003ca href=\"mailto:community@space.com\"\u003ecommunity@space.com.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"slice-container-authorBio-cQY25xrX8avmAi42GNtbgh\"\u003e\u003cp\u003eRobert Lea is a science journalist in the U.K. whose articles have been published in Physics World, New Scientist, Astronomy Magazine, All About Space, Newsweek and ZME Science. He also writes about science communication for Elsevier and the European Journal of Physics. Rob holds a bachelor of science degree in physics and astronomy from the U.K.’s Open University. Follow him on Twitter @sciencef1rst.\u003c/p\u003e\u003c/div\u003e\n\n\u003c/section\u003e\n\n\n\n\n\n\u003cdiv data-test-id=\"more-about\"\u003e\n\u003cp\u003eMore about science astronomy\u003c/p\u003e\n\n\n\u003c/div\u003e\n\n\n\n\n\n\n\n\n\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-04-15T20:00:00Z",
  "modifiedTime": null
}
