{
  "id": "f1f44822-d9fd-4d86-a87c-d0e0b10d4336",
  "title": "NASA Plane Supported Innovative Microgravity Research in ‘90s",
  "link": "https://www.nasa.gov/general/nasa-plane-supported-innovative-microgravity-research-in-90s/",
  "description": "A bell rings and a strobe light flashes as a pilot pulls the nose of the DC-9 aircraft up sharply. The blood quickly drains from researchers’ heads as they are pulled to the cabin floor by a force twice that of normal gravity. Once the acceleration slows to the desired level, and the NASA aircraft […]",
  "author": "Robert S. Arrighi",
  "published": "Wed, 27 Nov 2024 16:34:36 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "General",
    "Glenn History",
    "Glenn Research Center"
  ],
  "byline": "Robert S. Arrighi",
  "length": 4963,
  "excerpt": "In the ‘90s, NASA Lewis (today, NASA Glenn) used a DC-9 plane to help scientists study the behavior of fluids, combustion, and materials in a microgravity environment.",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "A bell rings and a strobe light flashes as a pilot pulls the nose of the DC-9 aircraft up sharply. The blood quickly drains from researchers’ heads as they are pulled to the cabin floor by a force twice that of normal gravity. Once the acceleration slows to the desired level, and the NASA aircraft crests over its arc, the flight test director declares, “We’re over the top!” The pressure drops as the aircraft plummets forward in freefall. For the next 20 to 25 seconds, everybody and everything not tied down begins to float. The researchers quickly tend to their experiments before the bell rings again as the pilot brings the aircraft back to level flight and normal Earth gravity. By flying in a series of up-and-down parabolas, aircraft can simulate weightlessness. Flights like this in the DC-9, conducted by NASA’s Lewis Research Center (today, NASA Glenn) in the 1990s, provided scientists with a unique way to study the behavior of fluids, combustion, and materials in a microgravity environment. In the 1960s, NASA Lewis used a North American AJ-2 to fly parabolas to study the behavior of liquid propellants in low-gravity conditions. The center subsequently expanded its microgravity research to include combustion and materials testing. So, when the introduction of the space shuttle in the early 1980s led to an increase in microgravity research, NASA Lewis was poised to be a leader in the agency’s microgravity science efforts. To help scientists test experiments on Earth before they flew for extended durations on the shuttle, Lewis engineers modified a Learjet aircraft to fly microgravity test flights with a single strapped-down experiment and researcher. In 1990, NASA officials decided that Lewis needed a larger aircraft to accommodate more experiments, including free-floating tests. Officials determined the McDonnell Douglas DC-9 would be the most economical option and decided to assume responsibility for a DC-9 being leased by the U.S. Department of Energy. In the fall of 1993, 50 potential users of the aircraft visited the center to discuss the modifications that would be necessary to perform their research. In October 1994, the DC-9 arrived at Lewis in its normal passenger configuration. Over the next three months, Lewis technicians removed nearly all the seats; bolstered the floor and ceiling; and installed new power, communications, and guidance systems. A 6.5-by-11-foot cargo door was also installed to allow for the transfer of large equipment. The DC-9 was the final element making NASA Lewis the nation’s premier microgravity institution. The center’s Space Experiments Division had been recently expanded, the 2.2-Second Drop Tower and the Zero Gravity Facility had been upgraded, and the Space Experiments Laboratory had recently been constructed to centralize microgravity activities. Lewis researchers partnered with industry and universities to design and test experiments that could fly on the space shuttle or the future space station. The DC-9 could accommodate up to eight experiments and 20 research personnel on each flight. The experiments involved space acceleration measurements, capillary pump loops, bubble behavior, thin film liquid rupture, materials flammability, and flame spread. It was a highly interactive experience, with researchers accompanying their tests to gain additional information through direct observation. The researchers were often so focused on their work that they hardly noticed the levitation of their bodies. The DC-9 flew every other week to allow time for installation of experiments and aircraft maintenance. The flights, which were based out of Cleveland Hopkins International Airport, were flown in restricted air space over northern Michigan. The aircraft sometimes flew up to 40 parabolas in a single mission. When the aircraft’s lease expired in the late 1990s, NASA returned the DC-9 to its owner. From May 18, 1995, to July 11, 1997, the Lewis microgravity flight team had used the DC-9 to fly over 400 hours, perform 70-plus trajectories, and conduct 73 research projects, helping scientists conduct hands-on microgravity research on Earth as well as test and prepare experiments designed to fly in space. The aircraft served as a unique and important tool, overall contributing to the body of knowledge around microgravity science and the center’s expertise in this research area. NASA Glenn’s microgravity work continues. The center has supported experiments on the International Space Station that could improve crew health as well as spacecraft fire safety, propulsion, and propellants. Glenn is also home to two microgravity drop towers, including the Zero Gravity Research Facility, NASA’s premier ground-based microgravity research lab. Additional Resources: Learn more about why NASA researchers simulate microgravity Take a virtual tour of NASA Glenn’s Zero Gravity Research Facility Discover more about Glenn’s expertise in space technology",
  "image": "https://www.nasa.gov/wp-content/uploads/2024/11/grc-1997-c-02184-e1732721530755.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eA bell rings and a strobe light flashes as a pilot pulls the nose of the DC-9 aircraft up sharply. The blood quickly drains from researchers’ heads as they are pulled to the cabin floor by a force twice that of normal gravity. Once the acceleration slows to the desired level, and the NASA aircraft crests over its arc, the flight test director declares, “We’re over the top!”\u003c/p\u003e\n\u003cp\u003eThe pressure drops as the aircraft plummets forward in freefall. For the next 20 to 25 seconds, everybody and everything not tied down begins to float. The researchers quickly tend to their experiments before the bell rings again as the pilot brings the aircraft back to level flight and normal Earth gravity.\u003c/p\u003e\n\u003cp\u003eBy flying in a series of up-and-down parabolas, aircraft can simulate weightlessness. Flights like this in the DC-9, conducted by NASA’s Lewis Research Center (today, NASA Glenn) in the 1990s, provided scientists with a unique way to study the behavior of fluids, combustion, and materials in a microgravity environment.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn the 1960s, NASA Lewis used a North American AJ-2 to fly parabolas to study the behavior of liquid propellants in low-gravity conditions. The center subsequently expanded its microgravity research to include combustion and materials testing. \u003ca\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSo, when the introduction of the space shuttle in the early 1980s led to an increase in microgravity research, NASA Lewis was poised to be a leader in the agency’s microgravity science efforts. To help scientists test experiments on Earth before they flew for extended durations on the shuttle, Lewis engineers modified a Learjet aircraft to fly microgravity test flights with a single strapped-down experiment and researcher.\u003c/p\u003e\n\n\n\u003cp\u003eIn 1990, NASA officials decided that Lewis needed a larger aircraft to accommodate more experiments, including free-floating tests. Officials determined the McDonnell Douglas DC-9 would be the most economical option and decided to assume responsibility for a DC-9 being leased by the U.S. Department of Energy.\u003c/p\u003e\n\u003cp\u003eIn the fall of 1993, 50 potential users of the aircraft visited the center to discuss the modifications that would be necessary to perform their research. In October 1994, the DC-9 arrived at Lewis in its normal passenger configuration. Over the next three months, Lewis technicians removed nearly all the seats; bolstered the floor and ceiling; and installed new power, communications, and guidance systems. A 6.5-by-11-foot cargo door was also installed to allow for the transfer of large equipment.\u003c/p\u003e\n\u003cp\u003eThe DC-9 was the final element making NASA Lewis the nation’s premier microgravity institution. The center’s Space Experiments Division had been recently expanded, the \u003ca href=\"https://www1.grc.nasa.gov/facilities/drop/\" rel=\"noopener\"\u003e2.2-Second Drop Tower\u003c/a\u003e and the \u003ca\u003e\u003c/a\u003e\u003ca href=\"https://www1.grc.nasa.gov/facilities/zero-g/\" rel=\"noopener\"\u003eZero Gravity Facility\u003c/a\u003e had been upgraded, and the Space Experiments Laboratory had recently been constructed to centralize microgravity activities.\u003c/p\u003e\n\n\n\u003cp\u003eLewis researchers partnered with industry and universities to design and test experiments that could fly on the space shuttle or the future space station. The DC-9 could accommodate up to eight experiments and 20 research personnel on each flight.\u003c/p\u003e\n\u003cp\u003eThe experiments involved space acceleration measurements, capillary pump loops, bubble behavior, thin film liquid rupture, materials flammability, and flame spread. It was a highly interactive experience, with researchers accompanying their tests to gain additional information through direct observation. The researchers were often so focused on their work that they hardly noticed the levitation of their bodies.\u003c/p\u003e\n\u003cp\u003eThe DC-9 flew every other week to allow time for installation of experiments and aircraft maintenance. The flights, which were based out of Cleveland Hopkins International Airport, were flown in restricted air space over northern Michigan. The aircraft sometimes flew up to 40 parabolas in a single mission.\u003c/p\u003e\n\n\n\u003cp\u003eWhen the aircraft’s lease expired in the late 1990s, NASA returned the DC-9 to its owner. From May 18, 1995, to July 11, 1997, the Lewis microgravity flight team had used the DC-9 to fly over 400 hours, perform 70-plus trajectories, and conduct 73 research projects, helping scientists conduct hands-on microgravity research on Earth as well as test and prepare experiments designed to fly in space. The aircraft served as a unique and important tool, overall contributing to the body of knowledge around microgravity science and the center’s expertise in this research area.\u003c/p\u003e\n\u003cp\u003eNASA Glenn’s microgravity work continues. The center has supported experiments on the International Space Station that could improve crew health as well as spacecraft fire safety, propulsion, and propellants. Glenn is also home to two microgravity drop towers, including the Zero Gravity Research Facility, NASA’s premier ground-based microgravity research lab.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional Resources:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLearn more about \u003ca href=\"https://science.nasa.gov/biological-physical/stories/how-and-why-do-nasa-researchers-simulate-microgravity-on-earth/\" rel=\"noopener\"\u003ewhy NASA researchers simulate microgravity\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eTake a \u003ca href=\"https://www3.nasa.gov/specials/zero-g/\" rel=\"noopener\"\u003evirtual tour\u003c/a\u003e of NASA Glenn’s Zero Gravity Research Facility\u003c/li\u003e\n\u003cli\u003eDiscover more about Glenn’s \u003ca href=\"https://www.nasa.gov/glenn/glenn-expertise-space-exploration/\"\u003eexpertise in space technology\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-11-27T11:34:36-05:00",
  "modifiedTime": "2024-11-27T12:47:18-05:00"
}
