{
  "id": "f5d6e6c7-087f-4904-bc35-ce629d275b7f",
  "title": "New Bridge Ready to Serve NASA, America’s Space Interests",
  "link": "https://www.nasa.gov/image-article/new-bridge-ready-to-serve-nasa-americas-space-interests/",
  "description": "The high-rise bridge that serves as the primary access point for employees and visitors to NASA’s Kennedy Space Center in Florida is fully operational. In the late hours of March 18, 2025, the Florida Department of Transportation (FDOT) opened the westbound portion of the NASA Causeway Bridge, which spans the Indian River Lagoon and connects […]",
  "author": "Messod C. Bendayan",
  "published": "Wed, 19 Mar 2025 20:28:20 +0000",
  "source": "https://www.nasa.gov/rss/dyn/breaking_news.rss",
  "categories": [
    "Kennedy Space Center"
  ],
  "byline": "",
  "length": 2138,
  "excerpt": "The high-rise bridge that serves as the primary access point for employees and visitors to NASA’s Kennedy Space Center in Florida is fully operational. In the",
  "siteName": "NASA",
  "favicon": "https://www.nasa.gov/wp-content/plugins/nasa-hds-core-setup/assets/favicons/favicon-228x228.png",
  "text": "Messod C. BendayanMar 19, 2025 The high-rise bridge that serves as the primary access point for employees and visitors to NASA’s Kennedy Space Center in Florida is fully operational. In the late hours of March 18, 2025, the Florida Department of Transportation (FDOT) opened the westbound portion of the NASA Causeway Bridge, which spans the Indian River Lagoon and connects NASA Kennedy and Cape Canaveral Space Force Station to the mainland. This new bridge span (right side of photo) sits alongside its twin on the eastbound side, which has accommodated traffic in both directions since FDOT opened it on June 9, 2023. The new structure replaces the old two-lane drawbridge which operated at that location for nearly 60 years. “The old drawbridge served us well, witnessing decades of spaceflights since the Apollo era and supporting Kennedy’s transition to a multi-user spaceport,” said Kennedy’s Acting Director Kelvin Manning. “The new bridge will see NASA send American astronauts back to the Moon and on to Mars, and it will support the continued rapid growth of America’s commercial space industry here at Earth’s premier spaceport.” At 4,025 feet long, the new NASA Causeway Bridge is about 35% longer than its predecessor, featuring a 65-foot waterway clearance and a channel wide enough to handle larger vessels carrying cargo necessary for Kennedy to continue launching humanity’s future. The bridge sits on over 1,000 concrete pilings which total more than 22 miles in length. Nearly 270 concrete I-beams, each weighing hundreds of thousands of pounds, support the bridge, along with over 40,000 cubic yards of concrete and over 8.7 million pounds of steel. All 110 spans of the old drawbridge were demolished during the construction, with much of the material recycled for future projects. A $90 million federal infrastructure grant secured in July 2019 by Space Florida via the U.S. Department of Transportation funded nearly 50% of the drawbridge replacement as well the widening of nearby Space Commerce Way. NASA and the state of Florida provided the remaining funding for the upgrades. Photo credit: NASA/Glenn Benson",
  "image": "https://images-assets.nasa.gov/image/KSC-20250319-PH-GEB01_0026/KSC-20250319-PH-GEB01_0026~large.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\u003carticle id=\"post-837820\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cimg src=\"https://secure.gravatar.com/avatar/ac149fa9e6a408a4e07fb3316aa5eae6?s=300\u0026amp;d=blank\u0026amp;r=g\" alt=\"The headshot image of Messod C. Bendayan\"/\u003e\u003c/p\u003e\u003cp\u003e\u003ch3\u003eMessod C. Bendayan\u003c/h3\u003e\u003c/p\u003e\u003c/div\u003e\u003cp\u003e\u003cspan\u003eMar 19, 2025\u003c/span\u003e\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\n\u003cp\u003eThe high-rise bridge that serves as the primary access point for employees and visitors to NASA’s Kennedy Space Center in Florida is fully operational. In the late hours of March 18, 2025, the Florida Department of Transportation (FDOT) opened the westbound portion of the NASA Causeway Bridge, which spans the Indian River Lagoon and connects NASA Kennedy and Cape Canaveral Space Force Station to the mainland.\u003c/p\u003e\n\u003cp\u003eThis new bridge span (right side of photo) sits alongside its twin on the eastbound side, which has accommodated traffic in both directions since \u003ca href=\"https://www.nasa.gov/image-article/americas-new-space-bridge-now-open/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eFDOT opened it\u003c/a\u003e on June 9, 2023. The new structure replaces the old two-lane drawbridge which operated at that location for nearly 60 years.\u003c/p\u003e\n\u003cp\u003e“The old drawbridge served us well, witnessing decades of spaceflights since the Apollo era and supporting Kennedy’s transition to a multi-user spaceport,” said Kennedy’s Acting Director Kelvin Manning. “The new bridge will see NASA send American astronauts back to the Moon and on to Mars, and it will support the continued rapid growth of America’s commercial space industry here at Earth’s premier spaceport.”\u003c/p\u003e\n\u003cp\u003eAt 4,025 feet long, the new NASA Causeway Bridge is about 35% longer than its predecessor, featuring a 65-foot waterway clearance and a channel wide enough to handle larger vessels carrying cargo necessary for Kennedy to continue launching humanity’s future.\u003c/p\u003e\n\u003cp\u003eThe bridge sits on over 1,000 concrete pilings which total more than 22 miles in length. Nearly 270 concrete I-beams, each weighing hundreds of thousands of pounds, support the bridge, along with over 40,000 cubic yards of concrete and over 8.7 million pounds of steel. All 110 spans of the old drawbridge were demolished during the construction, with much of the material recycled for future projects.\u003c/p\u003e\n\u003cp\u003eA $90 million federal infrastructure grant secured in July 2019 by Space Florida via the U.S. Department of Transportation funded nearly 50% of the drawbridge replacement as well the widening of nearby Space Commerce Way. NASA and the state of Florida provided the remaining funding for the upgrades.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cstrong\u003ePhoto credit: NASA/Glenn Benson\u003c/strong\u003e\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": null,
  "modifiedTime": null
}
