{
  "id": "1b9c8f38-96ad-4816-a363-a7389a53ebac",
  "title": "Daniel Martin’s Sojourn To Shanghai",
  "link": "https://intothegloss.com/2024/10/daniel-martin-shanghai-beauty/",
  "description": "The celebrity makeup artist stocked up on the “Mario Dedivanovic of China’s” beauty line and so much coffee",
  "author": "",
  "published": "Mon, 21 Oct 2024 10:30:00 -0400",
  "source": "https://feeds.feedburner.com/intothegloss/oqoU",
  "categories": null,
  "byline": "Into The Gloss",
  "length": 4274,
  "excerpt": "The celebrity makeup artist stocked up on the “Mario Dedivanovic of China’s beauty line\" and lots of coffee.",
  "siteName": "Into The Gloss",
  "favicon": "https://assets2.intothegloss.com/assets/misc/favicon-c5289286f05468868b306868af5d5003.png",
  "text": "You might know Daniel Martin as the makeup artist to Meghan Markle, Nicola Coughlan, and Ali Wong. He’s also the Global Director of Artistry for Tatcha, the Japanese-inspired brand known for its 23k gold-flecked blotting papers. As the summer came to a close, Martin flew to Shanghai, where Tatcha launched two years ago, and spent a week discovering the city. Here, he tells us about his jet lag hack, the moisturizer that can withstand a 20-hour flight, and the “Mario Dedivanovic of China.” Dear ITG, In August I got to spend a week in Shanghai, where I checked in on Tatcha’s first ever shop and spa. It’s located at Intime, the largest luxury department store in China that reminds me of Bergdorf’s a lot. Not only was it exciting to see the store and spa in person, but I had also never been to China. The flight to Shanghai was a whopping 20 hours, but luckily I found an app called Timeshifter that helped to prevent jet lag. You put your itinerary in the app and it tells you what times to stay up, when to look at light to activate your circadian rhythm, when to drink coffee, when to eat, when to take melatonin, when to sleep, everything. I used it when I traveled to Australia, and I had zero jet lag then, too. Makes sense that it was created by an astronaut, right? Since I have very sensitive skin, I can’t use your typical ’in-flight’ beauty products like sheet masks, which tend to make my skin itchy. I make sure to load up on moisturizer before I get on planes instead and leave it at that. Tatcha’s Indigo Calming Cream is perfect for sensitive, inflamed skin. I use it whenever my skin’s stressed out, not just for flights. Once I landed, the heat in Shanghai was like something I had never felt before. The humidity was insane, too. During the day, I was constantly reapplying Tatcha’s Silk SPF 50, which is one of the few sunscreens I can wear with my skin sensitivities. At night, I used our Indigo Cleansing Balm to make sure I got every trace off. It lifts makeup so easily, too. The beauty brands here are really interesting because so much of their storytelling is based on balancing science with local ingredients—a lot of which, I noticed, are based in the water—sort of in the same way that Tacha uses seaweed. I also discovered Maogeping, this great makeup artist brand that makes mostly color cosmetics. The founder, Mao Geping, is kind of like the Mario Dedivanovic of China. Michelle, who is on our marketing team, discovered his really cool moisturizer-primer hybrid. It goes on like a serum but dries town to this tacky primer that grips your makeup. His products also have a lot of embossing, which is pretty common here. I got this beautiful blush that opens up to a beautiful scene. It reminded me of Florasis, a C beauty brand that’s in the U.S. now. A lot of their makeup has beautiful visuals on it, too. Outside of beauty, the food was insane. We went to Shu Yan Ge, which is this incredible restaurant on a historical site in West Lake Park that’s about an hour and a half away from Shanghai on the bullet train. You have to book a reservation months ahead because they only serve two tables at night. It was one of the most amazing and memorable meals I’ve ever had. Everything was incredibly fresh and the setting was so intimate. It felt like being in someone’s house. China has a very big coffee culture, which I didn’t expect but loved being from Seattle. I remember thinking, ‘Am I going to get an oat milk latte?’ And boom, they had five different nut milks. Shanghai actually has the second-largest Starbucks Reserve in the world, but of course, there are all sorts of local coffee brands. I walked by one called Stay Woke, which I thought was hilarious. Oh, and Shanghai loves KFC. They’re literally everywhere—the Colonel is his own thing. The chains serve rice and you can get different kinds of sauces. What’s also cool is that KFC has these coffee shops called Kcoffee. Shanghai was simply fascinating. I felt like I stepped into Blade Runner. There’s this modernity to a lot of the architecture, but then you have these incredibly traditional places tucked away and hidden from the streets. I can’t wait to go back. Love, Daniel Martin —As told to Daise Bedolla Photographs courtesy of Daniel Martin",
  "image": "https://images.ctfassets.net/g8qtv9gzg47d/St91LQVN48zGY2RJxcBID/ee90a94db54272e1d237884895e65627/IMG_1309.JPG",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eYou might know \u003ca href=\"https://intothegloss.com/2019/04/daniel-martin-makeup-interview/\" rel=\"nofollow\" target=\"_blank\"\u003eDaniel Martin\u003c/a\u003e as the makeup artist to Meghan Markle, Nicola Coughlan, and \u003ca href=\"https://intothegloss.com/2019/12/ali-wong-beauty-routine/\" rel=\"nofollow\" target=\"_blank\"\u003eAli Wong\u003c/a\u003e. He’s also the Global Director of Artistry for Tatcha, the Japanese-inspired brand known for its 23k gold-flecked blotting papers. As the summer came to a close, Martin flew to Shanghai, where Tatcha launched two years ago, and spent a week discovering the city. Here, he tells us about his jet lag hack, the moisturizer that can withstand a 20-hour flight, and the “\u003ca href=\"https://intothegloss.com/2015/04/how-to-contour-with-makeup-by-mario/\" rel=\"nofollow\" target=\"_blank\"\u003eMario Dedivanovic\u003c/a\u003e of China.”\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eDear ITG,\u003c/p\u003e\n\n\u003cp\u003eIn August I got to spend a week in Shanghai, where I checked in on Tatcha’s first ever shop and spa. It’s located at Intime, the largest luxury department store in China that reminds me of Bergdorf’s a lot. Not only was it exciting to see the store and spa in person, but I had also never been to China.\u003c/p\u003e\n\n\u003cp\u003eThe flight to Shanghai was a whopping 20 hours, but luckily I found an app called \u003ca href=\"https://www.timeshifter.com/\" rel=\"nofollow\" target=\"_blank\"\u003eTimeshifter\u003c/a\u003e that helped to prevent jet lag. You put your itinerary in the app and it tells you what times to stay up, when to look at light to activate your circadian rhythm, when to drink coffee, when to eat, when to take melatonin, when to sleep, everything. I used it when I traveled to Australia, and I had zero jet lag then, too. Makes sense that it was created by an astronaut, right?\u003c/p\u003e\n\n\u003cp\u003eSince I have very sensitive skin, I can’t use your typical ’in-flight’ beauty products like sheet masks, which tend to make my skin itchy. I make sure to load up on moisturizer before I get on planes instead and leave it at that. \u003ca href=\"https://www.tatcha.com/product/indigo-calming-cream/CA04210T.html\" rel=\"nofollow\" target=\"_blank\"\u003eTatcha’s Indigo Calming Cream\u003c/a\u003e is perfect for sensitive, inflamed skin. I use it whenever my skin’s stressed out, not just for flights. \u003c/p\u003e\n\n\u003cp\u003eOnce I landed, the heat in Shanghai was like something I had never felt before. The humidity was insane, too. During the day, I was constantly reapplying \u003ca href=\"https://www.tatcha.com/product/the-silk-sunscreen-spf-50/CK02011T.html\" rel=\"nofollow\" target=\"_blank\"\u003eTatcha’s Silk SPF 50\u003c/a\u003e, which is one of the few sunscreens I can wear with my skin sensitivities. At night, I used our \u003ca href=\"https://www.tatcha.com/product/indigo-cleansing-balm/CC04010T.html\" rel=\"nofollow\" target=\"_blank\"\u003eIndigo Cleansing Balm\u003c/a\u003e to make sure I got every trace off. It lifts makeup so easily, too. \u003c/p\u003e\n\n\u003cp\u003eThe beauty brands here are really interesting because so much of their storytelling is based on balancing science with local ingredients—a lot of which, I noticed, are based in the water—sort of in the same way that Tacha uses seaweed. I also discovered Maogeping, this great makeup artist brand that makes mostly color cosmetics. The founder, Mao Geping, is kind of like the Mario Dedivanovic of China. Michelle, who is on our marketing team, discovered his really cool \u003ca href=\"https://www.beautymonster.store/collections/maogeping/products/maogeping-perfecting-transparent-cream-foundation-serum-mate-%E6%AF%9B%E6%88%88%E5%B9%B3%E7%93%B7%E8%82%8C%E8%8E%B9%E9%80%8F%E7%B2%89%E8%86%8F%E4%BC%B4%E4%BE%A3-15ml\" rel=\"nofollow\" target=\"_blank\"\u003emoisturizer-primer hybrid\u003c/a\u003e. It goes on like a serum but dries town to this tacky primer that grips your makeup. His products also have a lot of embossing, which is pretty common here. I got this \u003ca href=\"https://www.cutehart.com/products/maogeping-forbidden-city-5th-butterfly-in-flowers-series-blusher-palette-4-5g-%E6%AF%9B%E6%88%88%E5%B9%B3%E6%95%85%E5%AE%AB%E7%AC%AC%E4%BA%94%E5%AD%A3%E8%9D%B6%E6%88%8F%E6%BC%AB%E5%BD%A9%E8%85%AE%E7%BA%A2?_pos=29\u0026amp;_sid=a24608637\u0026amp;_ss=r\" rel=\"nofollow\" target=\"_blank\"\u003ebeautiful blush\u003c/a\u003e that opens up to a beautiful scene. It reminded me of Florasis, a C beauty brand that’s in the U.S. now. A lot of their makeup has beautiful visuals on it, too.\u003c/p\u003e\n\n\u003cp\u003eOutside of beauty, the food was insane. We went to Shu Yan Ge, which is this incredible restaurant on a historical site in West Lake Park that’s about an hour and a half away from Shanghai on the bullet train. You have to book a reservation months ahead because they only serve two tables at night. It was one of the most amazing and memorable meals I’ve ever had. Everything was incredibly fresh and the setting was so intimate. It felt like being in someone’s house.\u003c/p\u003e\n\n\u003cp\u003eChina has a very big coffee culture, which I didn’t expect but loved being from Seattle. I remember thinking, ‘Am I going to get an oat milk latte?’ And boom, they had five different nut milks. Shanghai actually has the second-largest Starbucks Reserve in the world, but of course, there are all sorts of local coffee brands. I walked by one called Stay Woke, which I thought was hilarious. Oh, and Shanghai loves KFC. They’re literally everywhere—the Colonel is his own thing. The chains serve rice and you can get different kinds of sauces. What’s also cool is that KFC has these coffee shops called Kcoffee.\u003c/p\u003e\n\n\u003cp\u003eShanghai was simply fascinating. I felt like I stepped into \u003cem\u003eBlade Runner\u003c/em\u003e. There’s this modernity to a lot of the architecture, but then you have these incredibly traditional places tucked away and hidden from the streets. I can’t wait to go back. \u003c/p\u003e\n\n\u003cp\u003eLove,\u003cbr/\u003e\nDaniel Martin\u003c/p\u003e\n\n\u003cp\u003e—As told to Daise Bedolla\u003c/p\u003e\n\n\u003cp\u003ePhotographs courtesy of Daniel Martin\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-10-21T10:30:00-04:00",
  "modifiedTime": null
}
