{
  "id": "3297af93-7651-4e63-81e8-f89bac6746c6",
  "title": "This Skin Gadget Zapped Away My Acne Overnight",
  "link": "https://www.refinery29.com/en-us/ziip-dot-review?utm_source=feed\u0026utm_medium=rss",
  "description": "From pimple patches to spot treatments to lasers, there’s little I haven’t tried in the name of clear skin. And when it comes to beauty tech specifically, I’m hardly a novice, either — LED masks, sleek hair stylers, high frequency wands, cleansing tools…I use ‘em all! But, if I had to use only one for the rest of my life, it would easily be the ZIIP.  Microcurrent is perhaps most popular for its “snatching” abilities (aka the ability to sculpt and tone facial muscles), but I’ve personally noticed the most dramatic improvements with my acne. Microcurrent is an effective treatment for acne because it draws out acne-causing bacteria and reduces inflammation, sometimes before it even has a chance to come to a head. ZIIP, co-founded by facialist Melanie Simon, is perhaps best known for the Halo — a small, computer-mouse-shaped device that treats myriad skin concerns, from wrinkles to puffiness to yes, acne.  I’m 31, and genetically blessed with few wrinkles and good bone structure, so while I loved the Halo (truly, it was a cornerstone of my wedding skin prep), I almost exclusively used it to ward off breakouts. At $399, the Halo is far from cheap — and if you’re only interested in it for acne treatment, I might not have recommended it. But here’s where the ZIIP Dot comes in. ZIIP Dot, $199.99 As if the beauty gods themselves heard me, an acne-focused ZIIP device finally arrived. Unlike the Halo, the Dot doesn’t require a companion app to select which treatment to load. It arrives preset with a 90-second spot treatment routine (60 seconds of Treat mode, followed by 30 seconds of Calm to reduce inflammation) and a six-minute full-face routine (four minutes of Treat mode and two minutes of Calm). It looks like a mini doughnut and has two thin, slightly curved electrical nodes on the underside of the device. In the box was a bottle of Clear Gel (one of the various conductive gels the brand makes), along with a charging cable and manual. It’s super lightweight and fits comfortably in my hand. After cleansing and patting my skin dry, I applied a few pumps of gel all over my face. Pressing and holding the Dot’s power button activated the full-face routine, and I slowly glided the device over my face. I tend to notice a slight warming sensation when the microcurrent “finds” the active acne — this is totally normal! Depending on how severe the breakout is, things can get a little tingly, but nothing unbearable. (Compared to other devices I’ve tried, I find that ZIIP’s are not only the most effective but also the most gentle.) I tend to break out most on my chin and jawline, but occasionally get acne in congested areas like my nose. The Dot is small enough to get into hard-to-reach spots, and I liked that you can start your treatment right away without having to pull up and sync the device with the app. After use, I wiped the Dot clean with a towel, rinsed off any excess gel, and proceeded with the rest of my nighttime skincare routine.  The following morning, I swear that the early rumblings of a cystic pimple were gone. (Formerly, I’d only seen results that fast with a dermatologist appointment and cortisone injection.) The one-two punch of microcurrent to kill bacteria and nanocurrent to quell inflammation — at its core, that’s what acne is, after all —  is a pimple’s worst nightmare, and my new best friend.  The brand recommends using the Dot two to three times a week, which is perfect for keeping breakouts at bay. The full-face routine has really helped maintain clear skin, but I’ve also used the spot treatment for a quick zippity-zap if I’m in a rush. Depending on the stage my acne is at, that’s been enough to reduce the lifespan and severity of the breakout dramatically. (In my aforementioned example, I was able to “catch” the pimple before it had a chance to wreak havoc; since I tend to scar easily, this was still a great tool to have to reduce hyperpigmentation.)  If acne is your primary skin concern, then at $200 (half the price of the Halo) the Dot is an amazing addition to any acne-haver’s routine. I love that it’s compact enough to easily travel with — great news if your skin tends to flare up after a long flight. With this sleek new skin gadget as part of my acne routine, I feel like I’m truly taking care of my skin — and that’s a very, very good thing. Like what you see? How about some more R29 goodness, right here?Jordan Chiles Swears By Those $13 Acne Patches TooRich Moisturizers Always Broke Me Out — Until ThisThe Ordinary Just Launched Another Acne Serum",
  "author": "Karina Hoshikawa",
  "published": "Thu, 17 Jul 2025 22:31:10 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 4197,
  "excerpt": "Can you zap your zits away? I tried ZIIP's new Dot device, which uses microcurrent and nanocurrent to treat acne.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Photo: Courtesy of Karina Hoshikawa.Microcurrent is perhaps most popular for its “snatching” abilities (aka the ability to sculpt and tone facial muscles), but I’ve personally noticed the most dramatic improvements with my acne. Microcurrent is an effective treatment for acne because it draws out acne-causing bacteria and reduces inflammation, sometimes before it even has a chance to come to a head. ZIIP, co-founded by facialist Melanie Simon, is perhaps best known for the Halo — a small, computer-mouse-shaped device that treats myriad skin concerns, from wrinkles to puffiness to yes, acne. AdvertisementADVERTISEMENTI’m 31, and genetically blessed with few wrinkles and good bone structure, so while I loved the Halo (truly, it was a cornerstone of my wedding skin prep), I almost exclusively used it to ward off breakouts. At $399, the Halo is far from cheap — and if you’re only interested in it for acne treatment, I might not have recommended it. But here’s where the ZIIP Dot comes in.As if the beauty gods themselves heard me, an acne-focused ZIIP device finally arrived. Unlike the Halo, the Dot doesn’t require a companion app to select which treatment to load. It arrives preset with a 90-second spot treatment routine (60 seconds of Treat mode, followed by 30 seconds of Calm to reduce inflammation) and a six-minute full-face routine (four minutes of Treat mode and two minutes of Calm). It looks like a mini doughnut and has two thin, slightly curved electrical nodes on the underside of the device. In the box was a bottle of Clear Gel (one of the various conductive gels the brand makes), along with a charging cable and manual. It’s super lightweight and fits comfortably in my hand. After cleansing and patting my skin dry, I applied a few pumps of gel all over my face. Pressing and holding the Dot’s power button activated the full-face routine, and I slowly glided the device over my face. I tend to notice a slight warming sensation when the microcurrent “finds” the active acne — this is totally normal! Depending on how severe the breakout is, things can get a little tingly, but nothing unbearable. (Compared to other devices I’ve tried, I find that ZIIP’s are not only the most effective but also the most gentle.)AdvertisementADVERTISEMENTI tend to break out most on my chin and jawline, but occasionally get acne in congested areas like my nose. The Dot is small enough to get into hard-to-reach spots, and I liked that you can start your treatment right away without having to pull up and sync the device with the app. After use, I wiped the Dot clean with a towel, rinsed off any excess gel, and proceeded with the rest of my nighttime skincare routine. The following morning, I swear that the early rumblings of a cystic pimple were gone. (Formerly, I’d only seen results that fast with a dermatologist appointment and cortisone injection.) The one-two punch of microcurrent to kill bacteria and nanocurrent to quell inflammation — at its core, that’s what acne is, after all —  is a pimple’s worst nightmare, and my new best friend. The brand recommends using the Dot two to three times a week, which is perfect for keeping breakouts at bay. The full-face routine has really helped maintain clear skin, but I’ve also used the spot treatment for a quick zippity-zap if I’m in a rush. Depending on the stage my acne is at, that’s been enough to reduce the lifespan and severity of the breakout dramatically. (In my aforementioned example, I was able to “catch” the pimple before it had a chance to wreak havoc; since I tend to scar easily, this was still a great tool to have to reduce hyperpigmentation.) If acne is your primary skin concern, then at $200 (half the price of the Halo) the Dot is an amazing addition to any acne-haver’s routine. I love that it’s compact enough to easily travel with — great news if your skin tends to flare up after a long flight. With this sleek new skin gadget as part of my acne routine, I feel like I’m truly taking care of my skin — and that’s a very, very good thing.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11918806.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Karina Hoshikawa.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/microcurrent-facial\"\u003eMicrocurrent\u003c/a\u003e is perhaps most popular for its “snatching” abilities (aka the ability to sculpt and tone facial muscles), but I’ve personally noticed the most dramatic improvements with my acne. Microcurrent is an \u003ca href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC8910224/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eeffective treatment for acne\u003c/a\u003e because it draws out acne-causing bacteria and reduces inflammation, sometimes before it even has a chance to come to a head. ZIIP, co-founded by facialist \u003ca href=\"https://ziipbeauty.com/pages/our-story\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eMelanie Simon\u003c/a\u003e, is perhaps best known for the \u003ca href=\"https://ziipbeauty.com/products/ziip-halo-microcurrent-device\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eHalo\u003c/a\u003e — a small, computer-mouse-shaped device that treats myriad skin concerns, from wrinkles to puffiness to yes, acne. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI’m 31, and genetically blessed with few wrinkles and good bone structure, so while I loved the Halo (truly, it was a cornerstone of my \u003ca href=\"https://www.refinery29.com/en-us/doing-own-wedding-bridal-makeup-advice\"\u003ewedding skin prep\u003c/a\u003e), I almost exclusively used it to ward off breakouts. At $399, the Halo is far from cheap — and if you’re only interested in it for acne treatment, I might not have recommended it. But here’s where the \u003ca href=\"https://ziipbeauty.com/products/ziip-dot-blemish-treatment-device?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eZIIP Dot\u003c/a\u003e comes in.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs if the beauty gods themselves heard me, an acne-focused ZIIP device finally arrived. Unlike the Halo, the \u003ca href=\"https://ziipbeauty.com/products/ziip-dot-blemish-treatment-device?\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eDot\u003c/a\u003e doesn’t require a companion app to select which treatment to load. It arrives preset with a 90-second spot treatment routine (60 seconds of Treat mode, followed by 30 seconds of Calm to reduce inflammation) and a six-minute full-face routine (four minutes of Treat mode and two minutes of Calm). \u003c/p\u003e\u003cp\u003eIt looks like a mini doughnut and has two thin, slightly curved electrical nodes on the underside of the device. In the box was a bottle of \u003ca href=\"https://ziipbeauty.com/products/clear-gel\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eClear Gel\u003c/a\u003e (one of the various conductive gels the brand makes), along with a charging cable and manual. It’s super lightweight and fits comfortably in my hand. After cleansing and patting my skin dry, I applied a few pumps of gel all over my face. Pressing and holding the Dot’s power button activated the full-face routine, and I slowly glided the device over my face. I tend to notice a slight warming sensation when the microcurrent “finds” the active acne — this is totally normal! Depending on how severe the breakout is, things can get a little tingly, but nothing unbearable. (Compared to other devices I’ve tried, I find that ZIIP’s are not only the most effective but also the most gentle.)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eI tend to break out most on my chin and jawline, but occasionally get acne in congested areas like my nose. The Dot is small enough to get into hard-to-reach spots, and I liked that you can start your treatment right away without having to pull up and sync the device with the app. After use, I wiped the Dot clean with a towel, rinsed off any excess gel, and proceeded with the rest of my nighttime skincare routine. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe following morning, I swear that the early rumblings of a cystic pimple were gone. (Formerly, I’d only seen results that fast with a dermatologist appointment and cortisone injection.) The one-two punch of microcurrent to kill bacteria and nanocurrent to quell inflammation — at its core, that’s what acne is, after all —  is a pimple’s worst nightmare, and my new best friend. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe brand recommends using the Dot two to three times a week, which is perfect for keeping breakouts at bay. The full-face routine has really helped maintain clear skin, but I’ve also used the spot treatment for a quick zippity-zap if I’m in a rush. Depending on the stage my acne is at, that’s been enough to reduce the lifespan and severity of the breakout dramatically. (In my aforementioned example, I was able to “catch” the pimple before it had a chance to wreak havoc; since I tend to scar easily, this was still a great tool to have to reduce hyperpigmentation.) \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf acne is your primary skin concern, then at $200 (half the price of the Halo) the Dot is an amazing addition to any acne-haver’s routine. I love that it’s compact enough to easily travel with — great news if your skin tends to flare up after a long flight. With this sleek new skin gadget as part of \u003ca href=\"https://www.refinery29.com/en-us/acne-skincare-routine-products\"\u003emy acne routine\u003c/a\u003e, I feel like I’m truly taking care of my skin — and that’s a very, \u003cem\u003every\u003c/em\u003e good thing.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-07-17T22:31:10Z",
  "modifiedTime": null
}
