{
  "id": "339f3017-32fa-4c53-a507-b749d44f4458",
  "title": "This Serum Gives Me A Post-Laser Glow — Without The Downtime",
  "link": "https://www.refinery29.com/en-us/lenox-and-sixteenth-serum-review?utm_source=feed\u0026utm_medium=rss",
  "description": "It all started a couple of months ago at a beauty event during Art Basel. I was milling about the room when a beauty founder friend of mine told me I couldn’t leave without meeting Amy Peterson. I’d heard of her before — she’s a celebrity medical aesthetician with a confidential list of high-profile clients. As it turns out, she’s been working on launching her own line of products, inspired by the treatments she provides in her clinic located at the cross-streets of — you guessed it — Lenox and Sixteenth in Miami Beach. As someone who has had acne for nearly half her life (I’m 31), I loved the concept — and could see why it was the talk of the party. A quick intro later, and Peterson herself handed me lab samples of one of her soon-to-be hero products, The Laser Serum, right then and there as we sipped on our club sodas. The name is a nod to the product’s brightening, resurfacing benefits — not unlike the in-clinic laser treatments Peterson is known for. Powered by a trifecta of lactic, glycolic, and mandelic acids, The Laser Serum gently exfoliates skin for a visibly brighter, even-textured complexion. “I loved seeing patients’ skin change when I did a laser treatment or microneedling, but didn’t feel like there were products on the market that offered similar results without substantial downtime,” Peterson tells me. “For example, a lot of people have issues with retinol. So I felt like if I could create [something better]…” And so, Peterson’s dream product was born.” The Laser Serum, $219 After I got home, I took the tiny, nondescript sample from my purse and immediately added it to my nighttime routine. Plain bottle or not, the stuff inside was liquid gold. Within a week, I was noticing touchably smoother skin and fewer breakouts (“It’s amazing for acne as well,” she says). After I finished my second lab sample (she generously included two, so I had more than enough time to experience the product), I was convinced that this could be the next big name in luxury skincare — not something I throw around lightly. At $219, it’s expensive. But compared to other similarly priced serums, I have to say — it’s worth every penny. “In office treatments and at-home care go hand in hand,” Peterson explains. “And I actually think in-office treatments inspire better at-home care because you’re trying to protect your investment.” The serum’s texture is lightweight, but absorbs quickly,  with just a hint of tingle. After two months of nightly use, the stubborn texture around my chin and jawline had dramatically improved, and the acne hyperpigmentation on my cheeks was barely noticeable. Following The Laser Serum, Lenox and Sixteenth is also launching The Preservationist — a vitamin C serum-cream hybrid. “I wanted to create a one-stop shop vitamin C,” Peterson shares. “The texture and the glow you get is incredible.” Along with vitamin C, The Preservationist includes peptides and vegan exosomes to plump, firm, and strengthen the skin barrier. “I believe people come into the clinic and they’re either put in two different categories: corrective or maintenance,” Peterson says, adding that she’s noticed an uptick in clients looking to “pre-juvenate” — aka, get ahead of visible signs of aging with smart, savvy treatments and products that keep skin looking its best.At $249 (or bundled with The Laser Serum for $398), the decadent, creamy texture is a dream to use. I’ve been dabbing it on at night, since it’s a bit rich for my oily skin during the day. (The exception: using it as skin prep on makeup days, since it creates a glowy, hydrating base.) My skin has always tolerated vitamin C well — even in high concentrations — and I loved layering this after The Laser Serum as a moisturizer, then locking in all the goodness with an oil or additional cream, depending on how my skin was feeling. (BTW, the dark brown glass doesn’t just look luxe — it helps block sunlight and heat that can compromise the integrity of notoriously fickle vitamin C.) “I joke with my team [that] I wish they could package me in every bottle so I could show up at your house and see how you’re doing,” Peterson tells me. “The reason we have a successful practice is because I’m all over it. I want to make a difference. I want to see change. I want that to happen, and I care a lot.” Like what you see? How about some more R29 goodness, right here?",
  "author": "Karina Hoshikawa",
  "published": "Wed, 14 May 2025 19:12:25 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Karina Hoshikawa",
  "length": 4511,
  "excerpt": "Read our review of Lenox and Sixteenth, a luxury skincare brand inspired by founder (and medical esthetician) Amy Peterson's in-office treatments and results-driven approach to beauty.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Karina Hoshikawa.It all started a couple of months ago at a beauty event during Art Basel. I was milling about the room when a beauty founder friend of mine told me I couldn’t leave without meeting Amy Peterson. I’d heard of her before — she’s a celebrity medical aesthetician with a confidential list of high-profile clients. As it turns out, she’s been working on launching her own line of products, inspired by the treatments she provides in her clinic located at the cross-streets of — you guessed it — Lenox and Sixteenth in Miami Beach.As someone who has had acne for nearly half her life (I’m 31), I loved the concept — and could see why it was the talk of the party. A quick intro later, and Peterson herself handed me lab samples of one of her soon-to-be hero products, The Laser Serum, right then and there as we sipped on our club sodas. The name is a nod to the product’s brightening, resurfacing benefits — not unlike the in-clinic laser treatments Peterson is known for. Powered by a trifecta of lactic, glycolic, and mandelic acids, The Laser Serum gently exfoliates skin for a visibly brighter, even-textured complexion. “I loved seeing patients’ skin change when I did a laser treatment or microneedling, but didn't feel like there were products on the market that offered similar results without substantial downtime,” Peterson tells me. “For example, a lot of people have issues with retinol. So I felt like if I could create [something better]...” And so, Peterson’s dream product was born.\"AdvertisementADVERTISEMENTPhoto: Courtesy of Lenox and SixteenthAfter I got home, I took the tiny, nondescript sample from my purse and immediately added it to my nighttime routine. Plain bottle or not, the stuff inside was liquid gold. Within a week, I was noticing touchably smoother skin and fewer breakouts (“It’s amazing for acne as well,” she says). After I finished my second lab sample (she generously included two, so I had more than enough time to experience the product), I was convinced that this could be the next big name in luxury skincare — not something I throw around lightly.At $219, it’s expensive. But compared to other similarly priced serums, I have to say — it’s worth every penny. “In office treatments and at-home care go hand in hand,” Peterson explains. “And I actually think in-office treatments inspire better at-home care because you're trying to protect your investment.” The serum’s texture is lightweight, but absorbs quickly,  with just a hint of tingle. After two months of nightly use, the stubborn texture around my chin and jawline had dramatically improved, and the acne hyperpigmentation on my cheeks was barely noticeable.Photo: Courtesy of Lenox and SixteenthAmy Peterson, medical aesthetician and founder of Lenox and SixteenthFollowing The Laser Serum, Lenox and Sixteenth is also launching The Preservationist — a vitamin C serum-cream hybrid. “I wanted to create a one-stop shop vitamin C,” Peterson shares. “The texture and the glow you get is incredible.” Along with vitamin C, The Preservationist includes peptides and vegan exosomes to plump, firm, and strengthen the skin barrier. “I believe people come into the clinic and they're either put in two different categories: corrective or maintenance,” Peterson says, adding that she’s noticed an uptick in clients looking to “pre-juvenate” — aka, get ahead of visible signs of aging with smart, savvy treatments and products that keep skin looking its best.At $249 (or bundled with The Laser Serum for $398), the decadent, creamy texture is a dream to use. I’ve been dabbing it on at night, since it’s a bit rich for my oily skin during the day. (The exception: using it as skin prep on makeup days, since it creates a glowy, hydrating base.) My skin has always tolerated vitamin C well — even in high concentrations — and I loved layering this after The Laser Serum as a moisturizer, then locking in all the goodness with an oil or additional cream, depending on how my skin was feeling. (BTW, the dark brown glass doesn’t just look luxe — it helps block sunlight and heat that can compromise the integrity of notoriously fickle vitamin C.)“I joke with my team [that] I wish they could package me in every bottle so I could show up at your house and see how you're doing,” Peterson tells me. “The reason we have a successful practice is because I'm all over it. I want to make a difference. I want to see change. I want that to happen, and I care a lot.”AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11893239.jpg?crop=2000%2C1050%2Cx0%2Cy384",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Karina Hoshikawa.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIt all started a couple of months ago at a beauty event during Art Basel. I was milling about the room when a beauty founder friend of mine told me I couldn’t leave without meeting Amy Peterson. I’d heard of her before — she’s a celebrity medical aesthetician with a confidential list of high-profile clients. As it turns out, she’s been working on launching her own line of products, inspired by the treatments she provides in her clinic located at the cross-streets of — you guessed it — Lenox and Sixteenth in Miami Beach.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAs someone who has had acne for nearly half her life (I’m 31), I loved the concept — and could see why it was the talk of the party. A quick intro later, and Peterson herself handed me lab samples of one of her soon-to-be hero products, \u003ca href=\"https://lenoxandsixteenth.com/products/the-laser-serum-triple-acid-concentrate\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eThe Laser Serum\u003c/a\u003e, right then and there as we sipped on our club sodas. The name is a nod to the product’s brightening, resurfacing benefits — not unlike the in-clinic laser treatments Peterson is known for. Powered by a trifecta of lactic, glycolic, and mandelic acids, The Laser Serum gently exfoliates skin for a visibly brighter, even-textured complexion. \u003c/p\u003e\u003cp\u003e“I loved seeing patients’ skin change when I did a laser treatment or microneedling, but didn\u0026#39;t feel like there were products on the market that offered similar results without substantial downtime,” Peterson tells me. “For example, a lot of people have issues with retinol. So I felt like if I could create [something better]...” And so, Peterson’s dream product was born.\u0026#34;\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Lenox and Sixteenth\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAfter I got home, I took the tiny, nondescript sample from my purse and immediately added it to my nighttime routine. Plain bottle or not, the stuff inside was liquid gold. Within a week, I was noticing touchably smoother skin and fewer breakouts (“It’s amazing for acne as well,” she says). After I finished my second lab sample (she generously included two, so I had more than enough time to experience the product), I was convinced that this could be the next big name in luxury skincare —\u003cem\u003e not\u003c/em\u003e something I throw around lightly.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAt $219, it’s expensive. But compared to other similarly priced serums, I have to say — it’s worth every penny. “In office treatments and at-home care go hand in hand,” Peterson explains. “And I actually think in-office treatments inspire better at-home care because you\u0026#39;re trying to protect your investment.” \u003c/p\u003e\u003cp\u003eThe serum’s texture is lightweight, but absorbs quickly,  with just a hint of tingle. After two months of nightly use, the stubborn texture around my chin and jawline had dramatically improved, and the acne hyperpigmentation on my cheeks was barely noticeable.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Lenox and Sixteenth\u003c/p\u003e\u003cp\u003eAmy Peterson, medical aesthetician and founder of Lenox and Sixteenth\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFollowing The Laser Serum, Lenox and Sixteenth is also launching \u003ca href=\"https://lenoxandsixteenth.com/products/the-preservationist-vitamin-c-cream-serum\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Preservationist (opens in a new tab)\"\u003eThe Preservationist\u003c/a\u003e — a vitamin C serum-cream hybrid. “I wanted to create a one-stop shop vitamin C,” Peterson shares. “The texture and the glow you get is incredible.” Along with vitamin C, The Preservationist includes peptides and vegan exosomes to plump, firm, and strengthen the skin barrier. “I believe people come into the clinic and they\u0026#39;re either put in two different categories: corrective or maintenance,” Peterson says, adding that she’s noticed an uptick in clients looking to “pre-juvenate” — aka, get ahead of visible signs of aging with smart, savvy treatments and products that keep skin looking its best.\u003c/p\u003e\u003cp\u003eAt $249 (or bundled with The Laser Serum for $398), the decadent, creamy texture is a dream to use. I’ve been dabbing it on at night, since it’s a bit rich for my oily skin during the day. (The exception: using it as skin prep on makeup days, since it creates a glowy, hydrating base.) My skin has always tolerated vitamin C well — even in high concentrations — and I loved layering this after The Laser Serum as a moisturizer, then locking in all the goodness with an oil or additional cream, depending on how my skin was feeling. (BTW, the dark brown glass doesn’t just look luxe — it helps block sunlight and heat that can compromise the integrity of notoriously fickle vitamin C.)\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I joke with my team [that] I wish they could package me in every bottle so I could show up at your house and see how you\u0026#39;re doing,” Peterson tells me. “The reason we have a successful practice is because I\u0026#39;m all over it. I want to make a difference. I want to see change. I want that to happen, and I care a lot.”\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-14T19:12:25Z",
  "modifiedTime": null
}
