{
  "id": "4752d328-6747-4587-9c5a-f9766d53f9e4",
  "title": "I Tried Pat McGrath’s Viral Glass Skin Mask — \u0026 Felt Like a Walking Work Of Art",
  "link": "https://www.refinery29.com/en-us/pat-mcgrath-glass-skin-fetish-mask-review?utm_source=feed\u0026utm_medium=rss",
  "description": "When it comes to makeup artistry, few names carry the weight of Pat McGrath. Dubbed “Mother” by the fashion and beauty worlds alike, McGrath has cemented her legacy as one of the most influential and prolific figures in the industry. From creating dazzling, avant-garde looks for runway shows to redefining what luxury beauty means with her eponymous brand, Pat McGrath Labs, her work has always been about breaking boundaries. The viral Glass Skin Mask is no exception. Inspired by her iconic designs for Maison Margiela’s haute couture shows, where models graced the runway with ethereal, glass-like complexions, the mask promises to deliver McGrath’s signature high-shine, dewy finish in just one application. But how wearable is it off the runway? To find out, I visited Pat McGrath Labs in NYC to experience the product firsthand and uncover whether this viral sensation is worth the hype — or just another fleeting beauty trend. With McGrath’s brilliance rooted in her ability to marry high fashion and everyday glamour, I had to ask: Can this mask truly make glass skin a reality for everyone, including Black women with specific skincare needs? Here’s what I learned from trying the mask out myself:  First of all, the mask is nothing short of stunning. Formulated with glycerin, rose flower water, and a mix of antioxidants, it’s designed to support skin renewal while delivering that glass-like glow. What’s unique about this mask is that it’s applied on top of your makeup — not underneath. Initially, I was skeptical since I’d never used a mask over a full face, but to my surprise, nothing budged or lifted during the process. How to apply the Pat McGrath Skin Fetish Mask Applying the mask is a multi-step ritual. It involves three layers with drying time in between each. To speed things up we used a blowdryer, but the entire process — starting with doing my makeup — took about two hours in total. It’s definitely not a quick fix but more of a special-occasion beauty moment. Lastly, there is a bit of a catch: Once the mask is on, you can’t talk, eat, or drink. Any movement risks cracking or peeling, making it impractical for everyday wear — but it’s undeniably fun. After an hour of wear, I can confirm the mask is an absolute showstopper. While it’s not designed for durability, it’s perfect for making a statement. Walking through the streets of New York City, I turned heads and even received a few compliments from strangers. The next day, my skin looked flawless, as promised. McGrath mentioned the mask’s nourishing ingredients would leave a lasting glow, and she wasn’t lying. @refinery29 Stay tuned. 👀 @Pat McGrath Labs just launched the product to get the viral makeup look from last year’s @Maison Margiela haute couture runway show. #glassskin #glassskinmask #makeup ♬ Sunrise – Official Sound Studio So, is the mask worth the hype? For beauty enthusiasts and makeup lovers who enjoy trying unique artistry products, it’s a playful indulgence at $38 a tube. For the average person, it’s less practical, but for one day, it was thrilling to channel my inner Pat McGrath muse. Next time, I’d opt to use the mask more sparingly as a highlighter or treatment mask, which McGrath mentioned are some of her favorite alternate uses for the product. If you’re still curious about the mask, here’s more details straight from Mother’s mouth…  DashDividers_1_500x100 R29: What inspired you to create the glass skin mask? Pat McGrath: This is my love letter to Margiela and to beauty lovers everywhere. The glass skin look was an unforgettable moment, and I wanted to make that radiance accessible for everyone to recreate effortlessly at home. R29: Can you tell us about the hero ingredients in the mask and their benefits? What gives it the glassy shine? McGrath: The mask is powered by glycerin, rose flower water, allantoin, and black tulip extract, a potent antioxidant that supports skin renewal. These ingredients work together to hydrate, soothe, and smooth the skin. The glassy shine comes from a specially formulated reflective layer that delivers the signature glow. R29: Is this mask suitable for all skin types, including sensitive skin? McGrath: Yes! The formula was designed with all skin types in mind, including sensitive skin. It’s gentle yet effective, delivering hydration and radiance without irritation. R29: Are there any specific techniques or tools that enhance the product’s effectiveness? McGrath: Oh it’s so easy! You just need to use any tapered brush with soft bristles to apply a thin, even layer. Always start with a clean, dry face and work in thin layers for the best results. However many layers you’d like to use is up to you. R29: Have you always wanted to create a mask like this or was it purely because of the virality of the Margiela show? McGrath: It’s a bit of both. I’ve always dreamed of creating something that captures the brilliance of glass skin, but the response to the Margiela show was the catalyst to bring it to life. R29: Is there a difference between this version of the mask and the version seen on the models? McGrath: This mask will get you the results from the Maison Margiela show in a third of the time, and with some added skincare benefits. I really was very purposeful in creating something that would give you the glass skin effect while making your skin look and feel glowing once you take it off. R29: How does this product ensure a radiant finish without looking ashy on deeper skin tones? McGrath:I designed the formula to enhance every skin tone, leaving a clear, radiant glow with no white cast or ashy residue. R29: Hydration is key for melanated skin. Does the mask target hydration to enhance the natural dewiness of darker skin tones? McGrath: Yes! Hydration is a core focus of the formula, ensuring the skin feels plump, refreshed, and radiant, enhancing its natural luminosity. R29: Was the mask tested on a diverse range of skin tones to ensure inclusivity? McGrath: Absolutely. Inclusivity is at the heart of everything we do. The mask was tested across a wide spectrum of skin tones — including my own face — to ensure it performs beautifully for everyone. Like what you see? How about some more R29 goodness, right here?I Tried Every Clinique Black Honey Makeup Product7 Cute \u0026 Wearable Makeup Trends To Try In 2025How I’m Carving Out A Beauty Space For Black Women",
  "author": "Cortni Spearman",
  "published": "Thu, 30 Jan 2025 17:13:55 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Cortni Spearman",
  "length": 6089,
  "excerpt": "Pat McGrath's glass skin mask is nothing short of stunning — but is it practical?",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Photo: Courtesy of Cortni Spearman.When it comes to makeup artistry, few names carry the weight of Pat McGrath. Dubbed “Mother” by the fashion and beauty worlds alike, McGrath has cemented her legacy as one of the most influential and prolific figures in the industry. From creating dazzling, avant-garde looks for runway shows to redefining what luxury beauty means with her eponymous brand, Pat McGrath Labs, her work has always been about breaking boundaries.The viral Glass Skin Mask is no exception. Inspired by her iconic designs for Maison Margiela's haute couture shows, where models graced the runway with ethereal, glass-like complexions, the mask promises to deliver McGrath’s signature high-shine, dewy finish in just one application. But how wearable is it off the runway? To find out, I visited Pat McGrath Labs in NYC to experience the product firsthand and uncover whether this viral sensation is worth the hype — or just another fleeting beauty trend.AdvertisementADVERTISEMENTWith McGrath’s brilliance rooted in her ability to marry high fashion and everyday glamour, I had to ask: Can this mask truly make glass skin a reality for everyone, including Black women with specific skincare needs? Here's what I learned from trying the mask out myself: First of all, the mask is nothing short of stunning. Formulated with glycerin, rose flower water, and a mix of antioxidants, it’s designed to support skin renewal while delivering that glass-like glow. What’s unique about this mask is that it’s applied on top of your makeup — not underneath. Initially, I was skeptical since I’d never used a mask over a full face, but to my surprise, nothing budged or lifted during the process.Photo: Courtesy of Cortni Spearman.How to apply the Pat McGrath Skin Fetish MaskApplying the mask is a multi-step ritual. It involves three layers with drying time in between each. To speed things up we used a blowdryer, but the entire process — starting with doing my makeup — took about two hours in total. It’s definitely not a quick fix but more of a special-occasion beauty moment.Lastly, there is a bit of a catch: Once the mask is on, you can’t talk, eat, or drink. Any movement risks cracking or peeling, making it impractical for everyday wear — but it’s undeniably fun. After an hour of wear, I can confirm the mask is an absolute showstopper. While it’s not designed for durability, it’s perfect for making a statement. Walking through the streets of New York City, I turned heads and even received a few compliments from strangers. The next day, my skin looked flawless, as promised. McGrath mentioned the mask’s nourishing ingredients would leave a lasting glow, and she wasn’t lying.AdvertisementADVERTISEMENTSo, is the mask worth the hype? For beauty enthusiasts and makeup lovers who enjoy trying unique artistry products, it’s a playful indulgence at $38 a tube. For the average person, it’s less practical, but for one day, it was thrilling to channel my inner Pat McGrath muse. Next time, I’d opt to use the mask more sparingly as a highlighter or treatment mask, which McGrath mentioned are some of her favorite alternate uses for the product.If you’re still curious about the mask, here’s more details straight from Mother’s mouth… Photo: Courtesy of Cortni Spearman.R29: What inspired you to create the glass skin mask?Pat McGrath: This is my love letter to Margiela and to beauty lovers everywhere. The glass skin look was an unforgettable moment, and I wanted to make that radiance accessible for everyone to recreate effortlessly at home.R29: Can you tell us about the hero ingredients in the mask and their benefits? What gives it the glassy shine?McGrath: The mask is powered by glycerin, rose flower water, allantoin, and black tulip extract, a potent antioxidant that supports skin renewal. These ingredients work together to hydrate, soothe, and smooth the skin. The glassy shine comes from a specially formulated reflective layer that delivers the signature glow.R29: Is this mask suitable for all skin types, including sensitive skin?McGrath: Yes! The formula was designed with all skin types in mind, including sensitive skin. It’s gentle yet effective, delivering hydration and radiance without irritation.R29: Are there any specific techniques or tools that enhance the product's effectiveness?AdvertisementADVERTISEMENTMcGrath: Oh it’s so easy! You just need to use any tapered brush with soft bristles to apply a thin, even layer. Always start with a clean, dry face and work in thin layers for the best results. However many layers you’d like to use is up to you.R29: Have you always wanted to create a mask like this or was it purely because of the virality of the Margiela show?McGrath: It’s a bit of both. I’ve always dreamed of creating something that captures the brilliance of glass skin, but the response to the Margiela show was the catalyst to bring it to life.R29: Is there a difference between this version of the mask and the version seen on the models?McGrath: This mask will get you the results from the Maison Margiela show in a third of the time, and with some added skincare benefits. I really was very purposeful in creating something that would give you the glass skin effect while making your skin look and feel glowing once you take it off.R29: How does this product ensure a radiant finish without looking ashy on deeper skin tones?McGrath:I designed the formula to enhance every skin tone, leaving a clear, radiant glow with no white cast or ashy residue.R29: Hydration is key for melanated skin. Does the mask target hydration to enhance the natural dewiness of darker skin tones?McGrath: Yes! Hydration is a core focus of the formula, ensuring the skin feels plump, refreshed, and radiant, enhancing its natural luminosity.R29: Was the mask tested on a diverse range of skin tones to ensure inclusivity?McGrath: Absolutely. Inclusivity is at the heart of everything we do. The mask was tested across a wide spectrum of skin tones — including my own face — to ensure it performs beautifully for everyone.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11849074.jpg?crop=2000%2C1050%2Cx0%2Cy600",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Cortni Spearman.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhen it comes to makeup artistry, few names carry the weight of \u003ca href=\"https://www.refinery29.com/en-us/naomi-campbell-pat-mcgrath-skincare-interview\"\u003ePat McGrath\u003c/a\u003e. Dubbed “Mother” by the fashion and beauty worlds alike, McGrath has cemented her legacy as one of the most influential and prolific figures in the industry. From creating dazzling, avant-garde looks for runway shows to redefining what luxury beauty means with her eponymous brand, \u003ca href=\"https://www.instagram.com/patmcgrathreal/?hl=en\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Pat McGrath Labs (opens in a new tab)\"\u003ePat McGrath Labs\u003c/a\u003e, her work has always been about breaking boundaries.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe viral \u003ca href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.patmcgrath.com%2Fproducts%2Fskin-fetish-glass-001-artistry-mask\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eGlass Skin Mask\u003c/a\u003e is no exception. Inspired by her iconic designs for Maison Margiela\u0026#39;s haute couture shows, where models graced the runway with ethereal, glass-like complexions, the mask promises to deliver McGrath’s signature high-shine, dewy finish in just one application. But how wearable is it off the runway? To find out, I visited Pat McGrath Labs in NYC to experience the product firsthand and uncover whether this viral sensation is worth the hype — or just another fleeting beauty trend.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWith McGrath’s brilliance rooted in her ability to marry high fashion and everyday glamour, I had to ask: Can this mask truly make glass skin a reality for everyone, including Black women with specific skincare needs? Here\u0026#39;s what I learned from trying the mask out myself: \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eFirst of all, the mask is nothing short of stunning. Formulated with glycerin, rose flower water, and a mix of antioxidants, it’s designed to support skin renewal while delivering that glass-like glow. What’s unique about this mask is that it’s applied on top of your makeup — not underneath. Initially, I was skeptical since I’d never used a mask over a full face, but to my surprise, nothing budged or lifted during the process.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Cortni Spearman.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003ch2\u003eHow to apply the Pat McGrath Skin Fetish Mask\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eApplying the mask is a multi-step ritual. It involves three layers with drying time in between each. To speed things up we used a blowdryer, but the entire process — starting with doing my makeup — took about two hours in total. It’s definitely not a quick fix but more of a special-occasion beauty moment.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLastly, there is a bit of a catch: Once the mask is on, you can’t talk, eat, or drink. Any movement risks cracking or peeling, making it impractical for everyday wear — but it’s undeniably fun. After an hour of wear, I can confirm the mask is an absolute showstopper. While it’s not designed for durability, it’s perfect for making a statement. Walking through the streets of New York City, I turned heads and even received a few compliments from strangers. The next day, my skin looked flawless, as promised. McGrath mentioned the mask’s nourishing ingredients would leave a lasting glow, and she wasn’t lying.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eSo, is the mask worth the hype? For beauty enthusiasts and makeup lovers who enjoy trying unique artistry products, it’s a playful indulgence at $38 a tube. For the average person, it’s less practical, but for one day, it was thrilling to channel my inner Pat McGrath muse. Next time, I’d opt to use the mask more sparingly as a highlighter or treatment mask, which McGrath mentioned are some of her favorite alternate uses for the product.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’re still curious about the mask, here’s more details straight from Mother’s mouth… \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003ePhoto: Courtesy of Cortni Spearman.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: What inspired you to create the glass skin mask?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003ePat McGrath: \u003c/strong\u003eThis is my love letter to Margiela and to beauty lovers everywhere. The glass skin look was an unforgettable moment, and I wanted to make that radiance accessible for everyone to recreate effortlessly at home.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29:\u003c/strong\u003e \u003cstrong\u003eCan you tell us about the hero ingredients in the mask and their benefits? What gives it the glassy shine?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eThe mask is powered by glycerin, rose flower water, allantoin, and black tulip extract, a potent antioxidant that supports skin renewal. These ingredients work together to hydrate, soothe, and smooth the skin. The glassy shine comes from a specially formulated reflective layer that delivers the signature glow.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Is this mask suitable for all skin types, including sensitive skin?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eYes! The formula was designed with all skin types in mind, including sensitive skin. It’s gentle yet effective, delivering hydration and radiance without irritation.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Are there any specific techniques or tools that enhance the product\u0026#39;s effectiveness?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eOh it’s so easy! You just need to use any tapered brush with soft bristles to apply a thin, even layer. Always start with a clean, dry face and work in thin layers for the best results. However many layers you’d like to use is up to you.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Have you always wanted to create a mask like this or was it purely because of the virality of the Margiela show?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eIt’s a bit of both. I’ve always dreamed of creating something that captures the brilliance of glass skin, but the response to the Margiela show was the catalyst to bring it to life.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Is there a difference between this version of the mask and the version seen on the models?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eThis mask will get you the results from the Maison Margiela show in a third of the time, and with some added skincare benefits. I really was very purposeful in creating something that would give you the glass skin effect while making your skin look and feel glowing once you take it off.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: How does this product ensure a radiant finish without looking ashy on deeper skin tones?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath:\u003c/strong\u003eI designed the formula to enhance \u003cem\u003eevery\u003c/em\u003e skin tone, leaving a clear, radiant glow with no white cast or ashy residue.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Hydration is key for melanated skin. Does the mask target hydration to enhance the natural dewiness of darker skin tones?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath: \u003c/strong\u003eYes! Hydration is a core focus of the formula, ensuring the skin feels plump, refreshed, and radiant, enhancing its natural luminosity.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eR29: Was the mask tested on a diverse range of skin tones to ensure inclusivity?\u003c/strong\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cstrong\u003eMcGrath\u003c/strong\u003e: Absolutely. Inclusivity is at the heart of everything we do. The mask was tested across a wide spectrum of skin tones — including my own face — to ensure it performs beautifully for everyone.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2025-01-30T17:13:55Z",
  "modifiedTime": null
}
