{
  "id": "4958cbd3-6406-4508-ac01-879b6d53165e",
  "title": "The Best Haircut Trends From London Fashion Week Street Style",
  "link": "https://www.refinery29.com/en-us/london-fashion-week-haircut-trends-fall-winter-2025?utm_source=feed\u0026utm_medium=rss",
  "description": "From The Hair Bros to Charlotte Mensah’s Hairlounge, London is home to some truly excellent hair salons — something that becomes especially evident at London Fashion Week when the city’s most stylish descend on the streets. Last season, we spotted street stylers with choppy bobs, mid-length chops, and long layers aplenty. This time around, the cuts are proving just as cool and effortless. Whether you’re keen for a total hair refresh or prefer something subtle, let the best haircut trends from London Fashion Week street style inspire you. All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.This story was originally published on Refinery29 UK.We've lost count of the straight-across fringes seen at London Fashion Week, proving the style is well on its way to dethroning curtain bangs.Photographed by Emma Rahmani.Hairstylists agree: Choppy pixie cuts are poised to dominate in the coming months. This style boasts a textured fringe and edges for an accidentally perfect finish. Photographed by Emma Rahmani.The best way to show off curls and ringlets? A towering updo, of course.Photographed by Emma Rahmani.Brushed-out natural textures are reigning supreme on and off the catwalk this season. Photographed by Emma Rahmani.Introducing the “mixie” — a mullet and pixie hybrid. “It’s essentially an outgrown pixie with soft edges around the hairline,” Anita Rice, hairstylist and cofounder of Buller + Rice told R29 recently. “The length at the back can be kept longer to create a wolf cut variation,” she added.Photographed by Emma Rahmani.Speaking of the “wolf” cut, this style features choppy layers, flicked-out ends, and a textured fringe.Photographed by Emma Rahmani.Hairstylists predicted that the modern curly mullet would dominate 2025 — and it seems they were right. We’re obsessed with the chocolate cherry color here, too. Photographed by Emma Rahmani.The micro fringe, sharp blunt ends, and painterly auburn highlights made a statement this weekend.Photographed by Emma Rahmani.These “bottleneck” bangs, essentially a fringe that occupies a cozy space between a curtain fringe and a fuller fringe, complement this guest’s layered, mid-length cut perfectly. Photographed by Emma Rahmani.Isabella Charlotta Poppius showcases how face-framing layers and caramel highlights can add dimension and elegance to long hair. Photographed by Emma Rahmani.Mid-length styles are back. These curly micro braids spotted on a guest this weekend are beautiful. Photographed by Emma Rahmani.Ask your hairstylist for “invisible” layers — a subtle cutting technique that adds volume and movement without compromising length. It involves strategically placing a few shorter layers underneath while keeping the top section the same for a seamless, natural look.Photographed by Emma Rahmani.Meet the “boxie”, a cross between the bob and pixie haircut. The choppy fringe and ‘90s highlights are the cherry on top of this unique style. Photographed by Emma Rahmani.The beveled bob is so back. It’s a sharp jaw-length cut tucked under either using a straightener (try ghd Chronos Max, $349) or a heated round brush. It’s the ultimate style to pair with an oversized collar. Photographed by Emma Rahmani.Hip-grazing goddess braids were spotted at New York Fashion Week — and now in London. If you want to head in the complete opposite direction, consider the goddess braid bob. Photographed by Emma Rahmani.The “mod” bob, the “mushroom” bob, the bowl cut… Whatever you call this spherical style, there’s an air of the ‘60s to it — but the slightly parted, straight-across fringe lends this particular chop a modern edge. Photographed by Emma Rahmani.This is picture proof that side fringes are versatile. We love the soft, piecey texture of this look combined with the bold red highlights.Photographed by Emma Rahmani.Natural hair is taking center stage on London’s streets and runways this week, making waves at Fashion East, Harris Reed, and Richard Quinn.Photographed by Emma Rahmani.Protective styles, like these stunning Koroba braids, have been turning heads both on and off the runways this season.Photographed by Emma Rahmani.We love this choppy fringe and the even edgier, textured layers.Photographed by Emma Rahmani.We're obsessed with this cut, dubbed the \"boyfriend” bob by stylists. It's short, sharp, and effortlessly undone, with shorter front pieces adding a touch of ‘90s boyband floppiness.Photographed by Emma Rahmani.Like what you see? How about some more R29 goodness, right here?The Best Haircuts From NYFW Street StyleI Got The Kicked Bob \u0026 Found My Own Personal Style12 Cool Mid-Length Haircuts To Suit Everyone",
  "author": "Jacqueline Kilikita",
  "published": "Sun, 23 Feb 2025 17:31:29 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Jacqueline Kilikita",
  "length": 3487,
  "excerpt": "From the \"mushroom\" bob to invisible layers, these London Fashion Week haircut trends are sure to inspire your next appointment.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "Story from BeautyJacqueline KilikitaLast Updated February 23, 2025, 5:31 PMADVERTISEMENTSee All SlidesBegin SlideshowPhotographed by Emma Rahmani.From The Hair Bros to Charlotte Mensah’s Hairlounge, London is home to some truly excellent hair salons — something that becomes especially evident at London Fashion Week when the city’s most stylish descend on the streets. Last season, we spotted street stylers with choppy bobs, mid-length chops, and long layers aplenty. This time around, the cuts are proving just as cool and effortless. Whether you’re keen for a total hair refresh or prefer something subtle, let the best haircut trends from London Fashion Week street style inspire you. All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.This story was originally published on Refinery29 UK.ADVERTISEMENTMore from HairBeautyThe Best Haircut Trends From London Fashion Week Street Styleby Jacqueline KilikitaHairI Thought Hair Growth Products Were A Scam — Until I Discovered T...All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. As a beauty director, it’by Jacqueline KilikitaBeautyThe Best Haircut Trends From New York Fashion Week Street Styleby Jacqueline KilikitaBeautyI Got The “Kicked” Bob Haircut \u0026 Found Confidence In My Personal ...While I firmly believe that you can reinvent yourself at any time, I’ve always welcomed a new year transformation. It’s the perfect way to blow off theby Jazzria HarrisUnbotheredI Got The Viral “Goddess Braid Bob” \u0026 It’s A Game-Changing ...All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Shortly after my big chop, by Lauren GordonUnbotheredBlack Women Are Planning Their Hairstyles For The Entire Year. He...It’s the beginning of the year, a time when most people map out their plans for the next few months. This means organizing holidays, birthdays, and hen-dby Habiba KatshaBeauty“Cowlick Bangs” Are Kind Of GeniusIf you were to text your best friend and ask if they have a cowlick, there is a high likelihood they would reply “Oh, let me tell you about it.”by Megan DeckerBeautySerious Question: Why Does My Hair Look Greasy Right After I Wash...All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Few things get under my skiby Jacqueline KilikitaBeauty5 Pixie Cuts That Will Inspire You To Go Shorter This YearPrepare for the pixie wave. Search for ‘pixie haircuts’ spiked after the Golden Globes where Emma Stone debuted a new “defined” pixie, and since thby Megan DeckerBeauty6 Tips That Helped Me Grow Longer, Stronger Hair (\u0026 No Trims In-B...All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. In April 2021, when most coby Jacqueline KilikitaBeautyThese Mid-Length Haircuts Are Anything But Boring, Say London Sty...All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. From the bob to the bixie, by Jacqueline KilikitaBeautySerious Question: Why Does Dirty Hair Feel Like It Hurts?All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. For the most part, my TikToby Jacqueline KilikitaADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11858622.jpg?crop=2000%2C1050%2Cx0%2Cy63",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"r29-container\"\u003e\u003cdiv\u003e\u003carticle\u003e\u003cdiv\u003e\u003cp\u003e\u003ca href=\"https://www.refinery29.com/en-us/beauty\"\u003e\u003cspan\u003e\u003cspan\u003eStory from \u003cspan\u003eBeauty\u003c/span\u003e\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e\u003ca href=\"https://www.refinery29.com/en-us/author/jacqueline-kilikita\"\u003eJacqueline Kilikita\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eLast Updated \u003ca rel=\"nofollow\" href=\"https://www.refinery29.com/en-us/archives/2025/02/23\"\u003e\u003cspan\u003e\u003cspan\u003eFebruary 23, 2025\u003c/span\u003e, \u003cspan\u003e5:31 PM\u003c/span\u003e\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv id=\"article-main-content\"\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ca title=\"See All Slides\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eSee All Slides\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/a\u003e\u003ca title=\"Begin Slideshow\" href=\"https://www.refinery29.com/en-us/london-fashion-week-haircut-trends-fall-winter-2025?utm_medium=rss\u0026amp;utm_source=feed#slide-1\"\u003e\u003cp\u003e\u003cspan\u003eBegin Slideshow\u003c/span\u003e\u003c/p\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003cfigure\u003e\u003ca href=\"https://www.refinery29.com/en-us/london-fashion-week-haircut-trends-fall-winter-2025?utm_medium=rss\u0026amp;utm_source=feed#slide-1\"\u003e\u003c/a\u003e\u003c/figure\u003e\u003cdiv\u003e\u003cp\u003ePhotographed by Emma Rahmani.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\u003cp\u003eFrom \u003ca rel=\"noreferrer noopener\" aria-label=\"The Hair Bros (opens in a new tab)\" href=\"https://www.instagram.com/thehairbros/?hl=en\" target=\"_blank\"\u003eThe Hair Bros\u003c/a\u003e to \u003ca aria-label=\"Charlotte Mensah’s Hairlounge (opens in a new tab)\" rel=\"noreferrer noopener\" href=\"https://www.charlottemensah.com/hairlounge/thesalon\" target=\"_blank\"\u003eCharlotte Mensah’s Hairlounge\u003c/a\u003e, London is home to some truly excellent \u003ca href=\"https://www.refinery29.com/en-us/haircut-energy-stylist-advice\"\u003ehair salons\u003c/a\u003e — something that becomes especially evident at \u003ca href=\"https://www.refinery29.com/en-us/london-fashion-week-haircut-trends-fall-winter-2024\"\u003eLondon Fashion Week\u003c/a\u003e when the city’s most stylish descend on the streets. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eLast season, we \u003ca href=\"https://www.refinery29.com/en-us/new-york-fashion-week-haircut-trends-fall-winter-2025\"\u003espotted street stylers \u003c/a\u003ewith \u003ca href=\"https://www.refinery29.com/en-us/bob-haircut-trends-2025\"\u003echoppy bobs\u003c/a\u003e, \u003ca href=\"https://www.refinery29.com/en-us/mid-length-haircut-trends\"\u003emid-length chops\u003c/a\u003e, and \u003ca href=\"https://www.refinery29.com/en-us/oval-layer-haircut-trend\"\u003elong layers\u003c/a\u003e aplenty. This time around, the cuts are proving just as cool and effortless. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eWhether you’re keen for a total hair refresh or prefer something subtle, let the best \u003ca href=\"https://www.refinery29.com/en-us/haircut-trends-2025\"\u003ehaircut trends\u003c/a\u003e from London Fashion Week street style inspire you. \u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eThis story was originally published on Refinery29 UK.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/article\u003e\u003c/div\u003e\u003cdiv id=\"below-the-fold-modules\"\u003e\u003cdiv\u003e\u003cheader\u003e\u003cp\u003e\u003ch2\u003eMore from Hair\u003c/h2\u003e\u003c/p\u003e\u003c/header\u003e\u003cdiv\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/london-fashion-week-haircut-trends-fall-winter-2025\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe Best Haircut Trends From London Fashion Week Street Style\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/typebea-hair-growth-products-review\"\u003e\u003cdiv\u003e\u003cp\u003eHair\u003c/p\u003e\u003cp\u003e\u003cspan\u003eI Thought Hair Growth Products Were A Scam — Until I Discovered T...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. As a beauty director, it’\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/new-york-fashion-week-haircut-trends-fall-winter-2025\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThe Best Haircut Trends From New York Fashion Week Street Style\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/kicked-bob-haircut-trend\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eI Got The “Kicked” Bob Haircut \u0026amp; Found Confidence In My Personal ...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eWhile I firmly believe that you can reinvent yourself at any time, I’ve always welcomed a new year transformation. It’s the perfect way to blow off the\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJazzria Harris\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/goddess-box-braids-bob-trend-protective-hairstyle\"\u003e\u003cdiv\u003e\u003cp\u003eUnbothered\u003c/p\u003e\u003cp\u003e\u003cspan\u003eI Got The Viral “Goddess Braid Bob” \u0026amp; It’s A Game-Changing ...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Shortly after my big chop, \u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eLauren Gordon\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/black-haircare-calendar-salon-appointments\"\u003e\u003cdiv\u003e\u003cp\u003eUnbothered\u003c/p\u003e\u003cp\u003e\u003cspan\u003eBlack Women Are Planning Their Hairstyles For The Entire Year. He...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIt’s the beginning of the year, a time when most people map out their plans for the next few months. This means organizing holidays, birthdays, and hen-d\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eHabiba Katsha\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/2025/01/11847992/cowlick-bangs-hair-cut\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003e“Cowlick Bangs” Are Kind Of Genius\u003c/span\u003e\u003c/p\u003e\u003cp\u003eIf you were to text your best friend and ask if they have a cowlick, there is a high likelihood they would reply “Oh, let me tell you about it.”\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eMegan Decker\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/greasy-oily-hair-after-washing\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSerious Question: Why Does My Hair Look Greasy Right After I Wash...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. Few things get under my ski\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/2025/01/11843952/pixie-haircut-trends-2025\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003e5 Pixie Cuts That Will Inspire You To Go Shorter This Year\u003c/span\u003e\u003c/p\u003e\u003cp\u003ePrepare for the pixie wave. Search for ‘pixie haircuts’ spiked after the Golden Globes where Emma Stone debuted a new “defined” pixie, and since th\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eMegan Decker\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/grow-out-bob-hair-care-expert-advice\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003e6 Tips That Helped Me Grow Longer, Stronger Hair (\u0026amp; No Trims In-B...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. In April 2021, when most co\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/mid-length-haircut-trends\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eThese Mid-Length Haircuts Are Anything But Boring, Say London Sty...\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. From the bob to the bixie, \u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003cdiv\u003e\u003ca href=\"https://www.refinery29.com/en-us/dirty-hair-scalp-sensitivity-soreness\"\u003e\u003cdiv\u003e\u003cp\u003eBeauty\u003c/p\u003e\u003cp\u003e\u003cspan\u003eSerious Question: Why Does Dirty Hair Feel Like It Hurts?\u003c/span\u003e\u003c/p\u003e\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. For the most part, my TikTo\u003c/p\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eby \u003cspan\u003eJacqueline Kilikita\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/a\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-23T17:31:29Z",
  "modifiedTime": null
}
