{
  "id": "5c3f6ee2-39c2-49c2-8995-9874d4e97124",
  "title": "I Tried Skinvive, the Buzzy New \"No-Filler\" Filler",
  "link": "https://www.popsugar.com/beauty/skinvive-editor-experiment-49315450",
  "description": "As somebody with skin that has a predisposition to dryness, I'm always in search of the next great thing that will quench my complexion's never-ending thirst. I'm also sensitive and prone to acne (just call me a triple threat), which makes that hydration trial and error somewhat tricky. \"Slugging\" tends to clog my pores, and consistent HydraFacial treatments just don't fit into the budget these days. So when celebrity injector and skin educator Vanessa Lee, RN, of the Los Angeles med spa The Things We Do began documenting her experience with Skinvive, a hyaluronic acid injectable filler that gives a post-facial glow for up to nine months without volume, I devoured every Instagram Stories development. According to Lee, Skinvive by Juvederm offers a low risk of unintended outcomes when compared to other injectables (see: Botox's \"Spock\" brows), with a wider pool of candidacy - and amazing results. \"If you are 25 and up and have skin, this is for you,\" Lee says. \"With other treatments, it really depends on your needs and aesthetic style that determines whether or not you are a good candidate. But if you want to have hydrated, glowing, and overall healthier skin, Skinvive is a great option for you.\" I obviously wanted all of the above, so I immediately booked an appointment for myself. Keep reading for my full Skinvive review, including information on how much Skinvive costs and photos after the treatment. Experts Featured in This Article Vanessa Lee, RN, is a celebrity injector and skin educator at the Los Angeles med spa The Things We Do. Skinvive Appointment Prep Prior to my Skinvive appointment, I completed a quick virtual medical clearance to chat through any medications I was taking and recent aesthetic treatments. Then, we went over a minimal prep guide for my upcoming treatment. I didn't need to adjust my skin-care routine beforehand, but I was advised that I may want to avoid blood-thinning agents (like fish oil, aspirin, or Advil) for five to seven days beforehand to minimize bruising. It wasn't a requirement, but just a suggestion, because I have a history of easily bruising. The only other thing you'll want to factor into your appointment is timing. \"If you have a big event coming up, then plan to book your appointment three to four weeks out,\" Lee says, adding that \"it takes that amount of time for you to see Skinvive at its true potential.\" During My Skinvive Appointment I sat in a comfy treatment chair while Lee and I discussed my skin goals: hydrated skin that I could feel so comfortable in I wouldn't reach for foundation. Lee then cleaned off my face and began to draw a grid \"guide\" over my cheeks, which is a bit different from the usual injection points that are typically drawn onto skin during filler treatments. \"We draw out grids on the face that help us make half-centimeter to one-centimeter boxes where we will inject one or two little droplets of Skinvive superficially into the skin,\" Lee says. She began working quickly to inject each square on my grid with an extremely fine and precise needle that allows for a more comfortable patient experience. A few areas had a sensitive or \"spicy\" feeling, but the majority of pokes (and there were about 40 of them) were relatively painless. \"It's completely tolerable. I am a total baby when it comes to pain, and this was a three out of 10 on the pain scale for me. Not fun, but not bad at all, and it is quick,\" Lee says. Lee followed the pokes with a light arnica massage (to help with bruising), and after 15 minutes, I was all done. In fact, the appointment was so fast I had plenty of time left on my parking meter to leisurely grab a coffee before heading back to work. However, if you've got more time on your hands, many patients opt to stack treatments like microinfusions and gentle peels. \"We have a combo treatment at The Things We Do called The ReDew that includes a microinfusion cocktail that's microneedled into the skin with skin vitamins and glutathione, a Skinvive injection, and a light chemical peel. It's the ultimate treatment to address dullness, uneven texture, discoloration, and textural issues,\" Lee says. While a combo of treatments wasn't on the docket for me that day, I put it on my bucket list for future treatments. Day 1 After My Skinvive Appointment Immediately after the treatment, I was told to keep my skin clean (no makeup, workouts, or dusty hikes) and avoid touching my face for the remainder of the day. And if I wanted to continue to minimize my risk of bruising, I was told to steer clear of blood thinners for another three to five days. (Considering I reached for a cold brew right after my appointment, I clearly let my caffeine needs usurp my bruising worries.) After a day, two light bruises began to set in (one on each cheek) that lasted for about a week before fading completely. Luckily, the bruises weren't too noticeable and were easily covered up with a touch of concealer for outings. Skinvive Cost Although the cost will vary depending on where you live as well as the provider you choose to visit, Skinvive is typically $650-$750 for two syringes. How many syringes you need to complete your treatment will be determined by your provider. My Skinvive Results It's important to remember that this treatment is a slow build of skin hydration and results are subtle compared to the instant gratification of traditional fillers. Though I was told that results wouldn't appear for at least two weeks, I felt a teensy bit more hydrated almost immediately - which is apparently common. \"My patients have reported that they can already notice a difference within the first few days and that in two weeks, they notice an amplified result. But we tell patients to expect full results in four weeks because there is a degree of neocollagenesis that occurs with this treatment,\" Lee explains. In case you were curious, neocollagenesis is the process of your skin being stimulated to form new collagen. I carried on as usual for the next few weeks and began noticing that I was having \"good skin days\" essentially every day. Makeup was gliding on like butter, the small crepey lines at the tops of my cheeks were plumped, and nary a zit was to be found. But it wasn't until I was on set for a shoot and both the makeup artist and the photographer made comments about my skin that I realized just how much the Skinvive glow had set in. Lee tells me this is another commonly shared sentiment, adding that it's because of the work happening on the cellular level. \"A group of patients that were involved in a Skinvive study had it injected into their forearms, and a biopsy of skin was taken before and after treatment. What was shown was an increase in skin hydration intracellularly and extracellularly, as well as collagen production and increased skin elasticity,\" she says. If you're looking for a minimally invasive, comfortable treatment with basically no downtime that creates compliment-worthy skin, I can't recommend Skinvive enough. Hannah Cassidy is a PS contributor.",
  "author": "Hannah Cassidy",
  "published": "Wed, 26 Feb 2025 14:35:02 -0800",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Product Reviews",
    "Skin Care",
    "Hype Check",
    "Injectables",
    "Editor Experiments"
  ],
  "byline": "Hannah Cassidy",
  "length": 7025,
  "excerpt": "Skinvive is a new filler treatment that promises to smooth uneven skin texture. One writer speaks with an expert and tries it for herself. Read more here.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "As somebody with skin that has a predisposition to dryness, I'm always in search of the next great thing that will quench my complexion's never-ending thirst. I'm also sensitive and prone to acne (just call me a triple threat), which makes that hydration trial and error somewhat tricky. \"Slugging\" tends to clog my pores, and consistent HydraFacial treatments just don't fit into the budget these days. So when celebrity injector and skin educator Vanessa Lee, RN, of the Los Angeles med spa The Things We Do began documenting her experience with Skinvive, a hyaluronic acid injectable filler that gives a post-facial glow for up to nine months without volume, I devoured every Instagram Stories development.According to Lee, Skinvive by Juvederm offers a low risk of unintended outcomes when compared to other injectables (see: Botox's \"Spock\" brows), with a wider pool of candidacy — and amazing results. \"If you are 25 and up and have skin, this is for you,\" Lee says. \"With other treatments, it really depends on your needs and aesthetic style that determines whether or not you are a good candidate. But if you want to have hydrated, glowing, and overall healthier skin, Skinvive is a great option for you.\" I obviously wanted all of the above, so I immediately booked an appointment for myself.Keep reading for my full Skinvive review, including information on how much Skinvive costs and photos after the treatment.Experts Featured in This Article Vanessa Lee, RN, is a celebrity injector and skin educator at the Los Angeles med spa The Things We Do. Skinvive Appointment PrepPrior to my Skinvive appointment, I completed a quick virtual medical clearance to chat through any medications I was taking and recent aesthetic treatments. Then, we went over a minimal prep guide for my upcoming treatment. I didn't need to adjust my skin-care routine beforehand, but I was advised that I may want to avoid blood-thinning agents (like fish oil, aspirin, or Advil) for five to seven days beforehand to minimize bruising. It wasn't a requirement, but just a suggestion, because I have a history of easily bruising. The only other thing you'll want to factor into your appointment is timing. \"If you have a big event coming up, then plan to book your appointment three to four weeks out,\" Lee says, adding that \"it takes that amount of time for you to see Skinvive at its true potential.\"During My Skinvive AppointmentI sat in a comfy treatment chair while Lee and I discussed my skin goals: hydrated skin that I could feel so comfortable in I wouldn't reach for foundation. Lee then cleaned off my face and began to draw a grid \"guide\" over my cheeks, which is a bit different from the usual injection points that are typically drawn onto skin during filler treatments. \"We draw out grids on the face that help us make half-centimeter to one-centimeter boxes where we will inject one or two little droplets of Skinvive superficially into the skin,\" Lee says.She began working quickly to inject each square on my grid with an extremely fine and precise needle that allows for a more comfortable patient experience. A few areas had a sensitive or \"spicy\" feeling, but the majority of pokes (and there were about 40 of them) were relatively painless. \"It's completely tolerable. I am a total baby when it comes to pain, and this was a three out of 10 on the pain scale for me. Not fun, but not bad at all, and it is quick,\" Lee says. Lee followed the pokes with a light arnica massage (to help with bruising), and after 15 minutes, I was all done. In fact, the appointment was so fast I had plenty of time left on my parking meter to leisurely grab a coffee before heading back to work. However, if you've got more time on your hands, many patients opt to stack treatments like microinfusions and gentle peels. \"We have a combo treatment at The Things We Do called The ReDew that includes a microinfusion cocktail that's microneedled into the skin with skin vitamins and glutathione, a Skinvive injection, and a light chemical peel. It's the ultimate treatment to address dullness, uneven texture, discoloration, and textural issues,\" Lee says. While a combo of treatments wasn't on the docket for me that day, I put it on my bucket list for future treatments.Day 1 After My Skinvive AppointmentImmediately after the treatment, I was told to keep my skin clean (no makeup, workouts, or dusty hikes) and avoid touching my face for the remainder of the day. And if I wanted to continue to minimize my risk of bruising, I was told to steer clear of blood thinners for another three to five days. (Considering I reached for a cold brew right after my appointment, I clearly let my caffeine needs usurp my bruising worries.)After a day, two light bruises began to set in (one on each cheek) that lasted for about a week before fading completely. Luckily, the bruises weren't too noticeable and were easily covered up with a touch of concealer for outings. Skinvive CostAlthough the cost will vary depending on where you live as well as the provider you choose to visit, Skinvive is typically $650-$750 for two syringes. How many syringes you need to complete your treatment will be determined by your provider. My Skinvive ResultsIt's important to remember that this treatment is a slow build of skin hydration and results are subtle compared to the instant gratification of traditional fillers. Though I was told that results wouldn't appear for at least two weeks, I felt a teensy bit more hydrated almost immediately — which is apparently common. \"My patients have reported that they can already notice a difference within the first few days and that in two weeks, they notice an amplified result. But we tell patients to expect full results in four weeks because there is a degree of neocollagenesis that occurs with this treatment,\" Lee explains. In case you were curious, neocollagenesis is the process of your skin being stimulated to form new collagen.I carried on as usual for the next few weeks and began noticing that I was having \"good skin days\" essentially every day. Makeup was gliding on like butter, the small crepey lines at the tops of my cheeks were plumped, and nary a zit was to be found. But it wasn't until I was on set for a shoot and both the makeup artist and the photographer made comments about my skin that I realized just how much the Skinvive glow had set in. Lee tells me this is another commonly shared sentiment, adding that it's because of the work happening on the cellular level. \"A group of patients that were involved in a Skinvive study had it injected into their forearms, and a biopsy of skin was taken before and after treatment. What was shown was an increase in skin hydration intracellularly and extracellularly, as well as collagen production and increased skin elasticity,\" she says. If you're looking for a minimally invasive, comfortable treatment with basically no downtime that creates compliment-worthy skin, I can't recommend Skinvive enough.Hannah Cassidy is a PS contributor.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/eKRlnxc-jd9rYSmycnNHaB99Ngg=/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2023/11/13/784/n/1922153/02a61284655261ac118475.27949672_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003cp data-element-index=\"0\"\u003eAs somebody with skin that has a \u003ca href=\"https://www.popsugar.com/beauty/best-skin-care-routine-dry-skin-48460351\"\u003epredisposition to dryness\u003c/a\u003e, I\u0026#39;m always in search of the next great thing that will quench my complexion\u0026#39;s never-ending thirst. I\u0026#39;m also sensitive and prone to acne (just call me a triple threat), which makes that hydration trial and error somewhat tricky. \u003ca href=\"https://www.popsugar.com/beauty/skin-slugging-48785543\"\u003e\u0026#34;Slugging\u0026#34;\u003c/a\u003e tends to clog my pores, and consistent \u003ca href=\"https://www.popsugar.com/beauty/What-HydraFacial-44796155\"\u003eHydraFacial treatments\u003c/a\u003e just don\u0026#39;t fit into the budget these days. So when celebrity injector and skin educator Vanessa Lee, RN, of the Los Angeles med spa The Things We Do began documenting her experience with Skinvive, a \u003ca href=\"https://www.popsugar.com/beauty/skinvive-filler-49178868\"\u003ehyaluronic acid injectable filler\u003c/a\u003e that gives a post-facial glow for up to nine months \u003cem\u003ewithout\u003c/em\u003e volume, I devoured every Instagram Stories development.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eAccording to Lee, Skinvive by Juvederm offers a low risk of unintended outcomes when compared to other injectables (see: \u003ca href=\"https://www.popsugar.com/beauty/spock-eye-botox-49310009\"\u003eBotox\u0026#39;s \u0026#34;Spock\u0026#34; brows\u003c/a\u003e), with a wider pool of candidacy — and amazing results. \u0026#34;If you are 25 and up and have skin, this is for you,\u0026#34; Lee says. \u0026#34;With other treatments, it really depends on your needs and aesthetic style that determines whether or not you are a good candidate. But if you want to have hydrated, glowing, and overall healthier skin, Skinvive is a great option for you.\u0026#34; I obviously wanted all of the above, so I immediately booked an appointment for myself.\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eKeep reading for my full Skinvive review, including information on how much Skinvive costs and photos after the treatment.\u003c/p\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch3\u003eExperts Featured in This Article\u003c/h3\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003e \u003ca href=\"https://www.instagram.com/vanessalee_rn/?ref=popsugar.com\u0026amp;=___psv__p_49315450__t_w_\" target=\"_blank\"\u003eVanessa Lee\u003c/a\u003e, RN, is a celebrity injector and skin educator at the Los Angeles med spa The Things We Do.\u003cbr/\u003e\n\u003c/p\u003e\u003cp data-element-index=\"7\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eSkinvive Appointment Prep\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"8\"\u003ePrior to my Skinvive appointment, I completed a quick virtual medical clearance to chat through any medications I was taking and recent aesthetic treatments. Then, we went over a minimal prep guide for my upcoming treatment. I didn\u0026#39;t need to adjust my skin-care routine beforehand, but I was advised that I may want to avoid blood-thinning agents (like fish oil, aspirin, or Advil) for five to seven days beforehand to minimize bruising. It wasn\u0026#39;t a requirement, but just a suggestion, because I have a history of easily bruising. \u003c/p\u003e\u003cp data-element-index=\"9\"\u003eThe only other thing you\u0026#39;ll want to factor into your appointment is timing. \u0026#34;If you have a big event coming up, then plan to book your appointment three to four weeks out,\u0026#34; Lee says, adding that \u0026#34;it takes that amount of time for you to see Skinvive at its true potential.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"10\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eDuring My Skinvive Appointment\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"11\"\u003eI sat in a comfy treatment chair while Lee and I discussed my skin goals: hydrated skin that I could feel so comfortable in I wouldn\u0026#39;t reach for foundation. Lee then cleaned off my face and began to draw a grid \u0026#34;guide\u0026#34; over my cheeks, which is a bit different from the usual injection points that are typically drawn onto skin during filler treatments. \u0026#34;We draw out grids on the face that help us make half-centimeter to one-centimeter boxes where we will inject one or two little droplets of Skinvive superficially into the skin,\u0026#34; Lee says.\u003c/p\u003e\u003cp data-element-index=\"12\"\u003eShe began working quickly to inject each square on my grid with an extremely fine and precise needle that allows for a more comfortable patient experience. A few areas had a sensitive or \u0026#34;spicy\u0026#34; feeling, but the majority of pokes (and there were about 40 of them) were relatively painless. \u0026#34;It\u0026#39;s completely tolerable. I am a total baby when it comes to pain, and this was a three out of 10 on the pain scale for me. Not fun, but not bad at all, and it is quick,\u0026#34; Lee says. \u003c/p\u003e\u003cp data-element-index=\"13\"\u003eLee followed the pokes with a light arnica massage (to help with bruising), and after 15 minutes, I was all done. In fact, the appointment was so fast I had plenty of time left on my parking meter to leisurely grab a coffee before heading back to work. However, if you\u0026#39;ve got more time on your hands, many patients opt to stack treatments like microinfusions and gentle peels. \u0026#34;We have a combo treatment at The Things We Do called The ReDew that includes a microinfusion cocktail that\u0026#39;s microneedled into the skin with skin vitamins and glutathione, a Skinvive injection, and a \u003ca href=\"https://www.popsugar.com/beauty/what-is-chemical-peel-48461402\"\u003elight chemical peel\u003c/a\u003e. It\u0026#39;s the ultimate treatment to address dullness, uneven texture, discoloration, and textural issues,\u0026#34; Lee says. While a combo of treatments wasn\u0026#39;t on the docket for me that day, I put it on my bucket list for future treatments.\u003c/p\u003e\u003cp data-element-index=\"14\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eDay 1 After My Skinvive Appointment\u003c/h2\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\"\u003e\u003cp data-element-index=\"0\"\u003eImmediately after the treatment, I was told to keep my skin clean (no makeup, workouts, or dusty hikes) and avoid touching my face for the remainder of the day. And if I wanted to continue to minimize my risk of bruising, I was told to steer clear of blood thinners for another three to five days. (Considering I reached for a cold brew right after my appointment, I clearly let my caffeine needs usurp my bruising worries.)\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eAfter a day, two light bruises began to set in (one on each cheek) that lasted for about a week before fading completely. Luckily, the bruises weren\u0026#39;t too noticeable and were easily covered up with a touch of concealer for outings. \u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eSkinvive Cost\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eAlthough the cost will vary depending on where you live as well as the provider you choose to visit, Skinvive is typically $650-$750 for two syringes. How many syringes you need to complete your treatment will be determined by your provider.\n\u003c/p\u003e\u003cp data-element-index=\"4\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eMy Skinvive Results\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"5\"\u003eIt\u0026#39;s important to remember that this treatment is a slow build of skin hydration and results are subtle compared to the instant gratification of traditional fillers. Though I was told that results wouldn\u0026#39;t appear for at least two weeks, I felt a teensy bit more hydrated almost immediately — which is apparently common. \u0026#34;My patients have reported that they can already notice a difference within the first few days and that in two weeks, they notice an amplified result. But we tell patients to expect full results in four weeks because there is a degree of neocollagenesis that occurs with this treatment,\u0026#34; Lee explains. In case you were curious, neocollagenesis is the process of your skin being stimulated to form new collagen.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"7\"\u003e\u003cp data-element-index=\"0\"\u003eI carried on as usual for the next few weeks and began noticing that I was having \u0026#34;good skin days\u0026#34; essentially \u003cem\u003eevery\u003c/em\u003e day. Makeup was gliding on like butter, the small crepey lines at the tops of my cheeks were plumped, and nary a zit was to be found. But it wasn\u0026#39;t until I was on set for a shoot and both the makeup artist and the photographer made comments about my skin that I realized just how much the Skinvive glow had set in. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eLee tells me this is another commonly shared sentiment, adding that it\u0026#39;s because of the work happening on the cellular level. \u0026#34;A group of patients that were involved in a Skinvive study had it injected into their forearms, and a biopsy of skin was taken before and after treatment. What was shown was an increase in skin hydration intracellularly and extracellularly, as well as collagen production and increased skin elasticity,\u0026#34; she says. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eIf you\u0026#39;re looking for a minimally invasive, comfortable treatment with basically no downtime that creates compliment-worthy skin, I can\u0026#39;t recommend Skinvive enough.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/hannah-cassidy\"\u003eHannah Cassidy\u003c/a\u003e is a PS contributor. \u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2023-11-13T18:20:03Z",
  "modifiedTime": "2025-02-26T22:35:02Z"
}
