{
  "id": "7eacd110-9258-4a9b-8c9c-83dbfc651b69",
  "title": "It's About Time Beauty Brands Recognize the Influence of OnlyFans Stars",
  "link": "https://www.popsugar.com/beauty/urban-decay-ari-kytsya-partnership-opinion-49452773",
  "description": "The viral yet polarizing \"clean girl\" era is over - it's time for beauty to get a little dirty again, and Urban Decay tapped OnlyFans star and content creator Ari Kytsya to make it happen. On Thursday, July 17, the makeup brand launched \"Battle the Bland,\" a campaign fronted by the 24-year-old model. Known on social media for her comedic GRWMs, candid takes on plastic surgery, and overt sexuality, Kytsya's casting disrupts traditional ideas of who gets to be a beauty ambassador in 2025 - and it's about time. While often reduced to its adult content, OnlyFans has become a major force in creator culture, giving women, in particular, a direct line to visibility, income, and independence. Kytsya is one of the platform's biggest stars, but her influence extends far beyond it. On TikTok, she's racked up 4.6 million followers, many of them women drawn to her blunt transparency. In GRWMs, she talks openly about the cosmetic procedures she's undergone. \"That's why I try to be real open about the surgeries and everything that I've had done,\" she says in one video. \"Because I don't want anyone to look at me and be like, 'Oh, I wish I looked like that,' because I don't even look like that.\" She's equally honest about the realities of sex work - calling herself a \"bop\" or \"mattress actress\" - and explains how the industry affects her self-image. She doesn't glamorize it, but she doesn't hide it either. That kind of candid energy resonates deeply with her audience, and it's exactly what Urban Decay is tapping into. The brand's rollout began with a series of faux-censored Instagram teasers stamped with mock warnings like \"may contain boring or bland content.\" The following day came the reveal: a series of social videos where Kytsya, clad in a leather bustier, declares, \"Breaking news: we are in a blandemic,\" before asking, \"Wasn't makeup meant to perform on stage, on camera, and yes, on mattresses?\" The message was loud and clear - and so was the reception. Comments poured in: \"First brand to work with a SW model, such a disruptive move,\" one wrote. \"This is honestly groundbreaking.\" It's a return to form for Urban Decay, a brand that built its identity on provocation, with product names like \"Naked,\" \"Get Baked,\" \"Druggie,\" and \"Vice.\" With \"Battle the Bland,\" the brand reclaims its spot as beauty's rebellious older sister, this time choosing a lead not in spite of her sex work, but because of how unapologetically she owns it. \"In a space that often plays it safe - especially when it comes to who gets a seat at the table - this moment feels not only bold, but historic,\" the brand said in a press release. \"While most beauty brands shy away from creators who are 'too much' for mainstream standards, Urban Decay is leaning all the way in - embracing Ari's uncensored main character energy.\" That embrace marks a turning point. Until recently, being a sex worker came with a huge stigma. But the cultural tides are shifting. Platforms like OnlyFans have given sex workers visibility and reach society can no longer ignore. What was once deemed \"too explicit\" is now seen as culturally fluent and commercially valuable. And in many ways, Kytsya's role brings beauty full circle. For centuries, makeup wasn't considered glamorous, but rather taboo. In the 19th and early 20th centuries, it was associated with sex work and deception, only later becoming mainstream through actresses and celebrities. Kytsya represents a lineage of women who've always shaped how we see beauty, even when they weren't invited into the room. Now, she's not just in the room, she's the face of the entire campaign. It's not Urban Decay's first time partnering with someone whose background subverts the industry's expectations. In 2022, the brand tapped \"Euphoria\" breakout Chloe Cherry - a former porn actress turned mainstream star - to lead its Vice Lip Bond campaigns. Like Kytsya, Cherry's casting marked another example of Urban Decay recognizing the power of provocative creators who defy traditional industry standards. With Battle the Bland, Urban Decay sets the tone for a new era of beauty marketing; one where creators like Kytsya aren't sidelined but centered. It's a bold campaign, yes, but it's also a long-overdue acknowledgment of sex work's impact on mainstream culture, and of the women who've been shaping beauty all along. And that's something we feel really good about. Olivia Tauber is a freelance writer based in New York, passionate about crafting authentic stories through personal essays and profiles. Her career began in corporate publicity at Showtime and Paramount, followed by production for \"The Pivot,\" an Emmy-nominated series.",
  "author": "Olivia Tauber",
  "published": "Tue, 22 Jul 2025 13:20:02 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Beauty News",
    "Urban Decay",
    "Makeup",
    "Personal Essay"
  ],
  "byline": "Olivia Tauber",
  "length": 4661,
  "excerpt": "Urban Decay cast Ari Kytsya, a viral OnlyFans star, to lead its loudest beauty campaign yet — and we’re here for it.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "The viral yet polarizing \"clean girl\" era is over — it's time for beauty to get a little dirty again, and Urban Decay tapped OnlyFans star and content creator Ari Kytsya to make it happen. On Thursday, July 17, the makeup brand launched \"Battle the Bland,\" a campaign fronted by the 24-year-old model. Known on social media for her comedic GRWMs, candid takes on plastic surgery, and overt sexuality, Kytsya's casting disrupts traditional ideas of who gets to be a beauty ambassador in 2025 — and it's about time. While often reduced to its adult content, OnlyFans has become a major force in creator culture, giving women, in particular, a direct line to visibility, income, and independence. Kytsya is one of the platform's biggest stars, but her influence extends far beyond it. On TikTok, she's racked up 4.6 million followers, many of them women drawn to her blunt transparency. In GRWMs, she talks openly about the cosmetic procedures she's undergone. \"That's why I try to be real open about the surgeries and everything that I've had done,\" she says in one video. \"Because I don't want anyone to look at me and be like, 'Oh, I wish I looked like that,' because I don't even look like that.\"She's equally honest about the realities of sex work — calling herself a \"bop\" or \"mattress actress\" — and explains how the industry affects her self-image. She doesn't glamorize it, but she doesn't hide it either. That kind of candid energy resonates deeply with her audience, and it's exactly what Urban Decay is tapping into.The brand's rollout began with a series of faux-censored Instagram teasers stamped with mock warnings like \"may contain boring or bland content.\" The following day came the reveal: a series of social videos where Kytsya, clad in a leather bustier, declares, \"Breaking news: we are in a blandemic,\" before asking, \"Wasn't makeup meant to perform on stage, on camera, and yes, on mattresses?\" The message was loud and clear — and so was the reception. Comments poured in: \"First brand to work with a SW model, such a disruptive move,\" one wrote. \"This is honestly groundbreaking.\"It's a return to form for Urban Decay, a brand that built its identity on provocation, with product names like \"Naked,\" \"Get Baked,\" \"Druggie,\" and \"Vice.\" With \"Battle the Bland,\" the brand reclaims its spot as beauty's rebellious older sister, this time choosing a lead not in spite of her sex work, but because of how unapologetically she owns it.\"In a space that often plays it safe — especially when it comes to who gets a seat at the table — this moment feels not only bold, but historic,\" the brand said in a press release. \"While most beauty brands shy away from creators who are 'too much' for mainstream standards, Urban Decay is leaning all the way in — embracing Ari's uncensored main character energy.\"That embrace marks a turning point. Until recently, being a sex worker came with a huge stigma. But the cultural tides are shifting. Platforms like OnlyFans have given sex workers visibility and reach society can no longer ignore. What was once deemed \"too explicit\" is now seen as culturally fluent and commercially valuable.And in many ways, Kytsya's role brings beauty full circle. For centuries, makeup wasn't considered glamorous, but rather taboo. In the 19th and early 20th centuries, it was associated with sex work and deception, only later becoming mainstream through actresses and celebrities. Kytsya represents a lineage of women who've always shaped how we see beauty, even when they weren't invited into the room. Now, she's not just in the room, she's the face of the entire campaign.It's not Urban Decay's first time partnering with someone whose background subverts the industry's expectations. In 2022, the brand tapped \"Euphoria\" breakout Chloe Cherry — a former porn actress turned mainstream star — to lead its Vice Lip Bond campaigns. Like Kytsya, Cherry's casting marked another example of Urban Decay recognizing the power of provocative creators who defy traditional industry standards.With Battle the Bland, Urban Decay sets the tone for a new era of beauty marketing; one where creators like Kytsya aren't sidelined but centered. It's a bold campaign, yes, but it's also a long-overdue acknowledgment of sex work's impact on mainstream culture, and of the women who've been shaping beauty all along. And that's something we feel really good about.Olivia Tauber is a freelance writer based in New York, passionate about crafting authentic stories through personal essays and profiles. Her career began in corporate publicity at Showtime and Paramount, followed by production for \"The Pivot,\" an Emmy-nominated series.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/rrjsWNxlBF7rEZEBAjbAAYuvsck=/0x663:1531x1467/fit-in/1536x2304/filters:format_auto():quality(85):upscale()/2025/07/22/839/n/1922153/15bcffcf687fe1eb27b8e2.51048261_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eThe viral yet polarizing \u003ca href=\"https://www.popsugar.com/beauty/clean-girl-aesthetic-problematic-personal-essay-49436355\"\u003e\u0026#34;clean girl\u0026#34; era\u003c/a\u003e is over — it\u0026#39;s time for beauty to get a little \u003cem\u003edirty \u003c/em\u003eagain, and Urban Decay tapped OnlyFans star and content creator \u003ca href=\"http://www.instagram.com/arikytsya/?ref=popsugar.com\u0026amp;=___psv__p_49452773__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003eAri Kytsya\u003c/a\u003e to make it happen. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eOn Thursday, July 17, the makeup brand launched \u0026#34;\u003ca href=\"https://www.instagram.com/reel/DMOZC0Bhd8g/embed?ref=popsugar.com\u0026amp;=___psv__p_49452773__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003eBattle the Bland\u003c/a\u003e,\u0026#34; a campaign fronted by the 24-year-old model. Known on social media for her comedic GRWMs, candid takes on plastic surgery, and overt sexuality, Kytsya\u0026#39;s casting disrupts traditional ideas of who gets to be a beauty ambassador in 2025 — and it\u0026#39;s about time. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eWhile often reduced to its adult content, OnlyFans has become a major force in creator culture, giving women, in particular, a direct line to visibility, income, and independence. Kytsya is one of the platform\u0026#39;s biggest stars, but her influence extends far beyond it. On \u003ca href=\"https://www.tiktok.com/@notburnttoasthehe?lang=en\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49452773__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003eTikTok\u003c/a\u003e, she\u0026#39;s racked up 4.6 million followers, many of them women drawn to her blunt transparency. In GRWMs, she talks openly about the cosmetic procedures she\u0026#39;s undergone. \u0026#34;That\u0026#39;s why I try to be real open about the surgeries and everything that I\u0026#39;ve had done,\u0026#34; she says in one \u003cstrong\u003e\u003c/strong\u003e\u003ca href=\"https://www.tiktok.com/@notburnttoasthehe/video/7464273842823843114?ref=popsugar.com\u0026amp;=___psv__p_49452773__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003evideo\u003c/a\u003e. \u0026#34;Because I don\u0026#39;t want anyone to look at me and be like, \u0026#39;Oh, I wish I looked like that,\u0026#39; because I don\u0026#39;t even look like that.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eShe\u0026#39;s equally honest about the realities of sex work — calling herself a \u0026#34;bop\u0026#34; or \u0026#34;mattress actress\u0026#34; — and explains how the industry affects her self-image. She doesn\u0026#39;t glamorize it, but she doesn\u0026#39;t hide it either. That kind of candid energy resonates deeply with her audience, and it\u0026#39;s exactly what Urban Decay is tapping into.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eThe brand\u0026#39;s rollout began with a series of faux-censored Instagram teasers stamped with mock warnings like \u0026#34;may contain boring or bland content.\u0026#34; The following day came the reveal: a series of social videos where Kytsya, clad in a leather bustier, declares, \u0026#34;Breaking news: we are in a blandemic,\u0026#34; before asking, \u0026#34;Wasn\u0026#39;t makeup meant to perform on stage, on camera, and yes, on mattresses?\u0026#34; The message was loud and clear — and so was the reception. Comments poured in: \u0026#34;First brand to work with a SW model, such a disruptive move,\u0026#34; one wrote. \u0026#34;This is honestly groundbreaking.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"5\"\u003eIt\u0026#39;s a return to form for Urban Decay, a brand that built its identity on provocation, with product names like \u0026#34;Naked,\u0026#34; \u0026#34;Get Baked,\u0026#34; \u0026#34;Druggie,\u0026#34; and \u0026#34;Vice.\u0026#34; With \u0026#34;Battle the Bland,\u0026#34; the brand reclaims its spot as beauty\u0026#39;s rebellious older sister, this time choosing a lead not in spite of her sex work, but because of how unapologetically she owns it.\u003c/p\u003e\u003cp data-element-index=\"6\"\u003e\u0026#34;In a space that often plays it safe — especially when it comes to who gets a seat at the table — this moment feels not only bold, but historic,\u0026#34; the brand said in a press release. \u0026#34;While most beauty brands shy away from creators who are \u0026#39;too much\u0026#39; for mainstream standards, Urban Decay is leaning all the way in — embracing Ari\u0026#39;s uncensored main character energy.\u0026#34;\u003c/p\u003e\u003cp data-element-index=\"7\"\u003eThat embrace marks a turning point. Until recently, being a sex worker came with a huge stigma. But the cultural tides are shifting. Platforms like OnlyFans have given sex workers visibility and reach society can no longer ignore. What was once deemed \u0026#34;too explicit\u0026#34; is now seen as culturally fluent and commercially valuable.\u003c/p\u003e\u003cp data-element-index=\"8\"\u003eAnd in many ways, Kytsya\u0026#39;s role brings beauty full circle. For centuries, makeup wasn\u0026#39;t considered glamorous, but rather taboo. In the 19th and early 20th centuries, it was \u003ca href=\"https://www.popsugar.com/beauty/blue-eyeshadow-history-49442548\"\u003eassociated with sex work\u003c/a\u003e and deception, only later becoming mainstream through actresses and celebrities. Kytsya represents a lineage of women who\u0026#39;ve always shaped how we see beauty, even when they weren\u0026#39;t invited into the room. Now, she\u0026#39;s not just in the room, she\u0026#39;s the face of the entire campaign.\u003c/p\u003e\u003cp data-element-index=\"9\"\u003eIt\u0026#39;s not Urban Decay\u0026#39;s first time partnering with someone whose background subverts the industry\u0026#39;s expectations. In 2022, the brand tapped \u003ca href=\"https://www.popsugar.com/beauty/chloe-cherry-beauty-interview-49232209\"\u003e\u0026#34;Euphoria\u0026#34; breakout Chloe Cherry\u003c/a\u003e — a former porn actress turned mainstream star — to lead its Vice Lip Bond campaigns. Like Kytsya, Cherry\u0026#39;s casting marked another example of Urban Decay recognizing the power of provocative creators who defy traditional industry standards.\u003c/p\u003e\u003cp data-element-index=\"10\"\u003eWith Battle the Bland, Urban Decay sets the tone for a new era of beauty marketing; one where creators like Kytsya aren\u0026#39;t sidelined but centered. It\u0026#39;s a bold campaign, yes, but it\u0026#39;s also a long-overdue acknowledgment of sex work\u0026#39;s impact on mainstream culture, and of the women who\u0026#39;ve been shaping beauty all along. And that\u0026#39;s something we feel really good about.\u003c/p\u003e\u003cp data-element-index=\"12\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/Olivia-Tauber\"\u003eOlivia Tauber\u003c/a\u003e is a freelance writer based in New York, passionate about crafting authentic stories through personal essays and profiles. Her career began in corporate publicity at Showtime and Paramount, followed by production for \u0026#34;The Pivot,\u0026#34; an Emmy-nominated series.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-07-22T20:20:02Z",
  "modifiedTime": "2025-07-22T20:20:02Z"
}
