{
  "id": "9619d7df-4625-47d4-8fb2-62721d1a67b3",
  "title": "Black Women Deserve Better Than the Carcinogens Found in Braiding Hair",
  "link": "https://www.popsugar.com/beauty/carcinogens-braiding-hair-49430501",
  "description": "Although significant progress has been made, the Black experience in America has always been limited - and the options for hair care are no exception. Before the rise of the natural hair movement, there were very few brands that catered to a Black woman's natural texture. Many were using methods like hair relaxers and straighteners to feel beautiful, but these practices were soon linked to uterine cancer. And though beauty companies have since elevated their offerings to include cleaner formulations that serve as an alternative to toxic chemical treatments, the trend of products made for our community being harmful is far from over. The proof is in Consumer Reports' latest discovery, which found carcinogens in synthetic braiding hair. On Feb. 27, the company's researchers published a new study that revealed carcinogens (agents that can increase the risk of cancer) are present in 10 popular synthetic hair-braiding brands, including X-Pression, Sassy Collection, and Sensationnel. Scientists tested each brand for heavy metals and volatile organic compounds (VOCs) and revealed they were found in 100 percent of the samples. Lead, an ingredient that causes skin irritation, was also found in nine of the 10 products, which explains why many users (myself included) have experienced an itchy scalp after getting fresh braids. Three of the products tested also contained benzene, a known agent that causes acute myeloid leukemia. \"It is strictly regulated and discouraged to use in laboratories because of its potential to cause cancer,\" Dr. James E. Rogers, PhD, Consumer Reports' director and head of product safety testing, said in a statement. All the samples also contained a probable carcinogen, methylene chloride, which is recognized by the Occupational Safety and Health Administration (OSHA) as a certified hazard that can lead to cancer of the lung and liver as well as non-Hodgkin's lymphoma. @consumerreports Could “protective hairstyles” like synthetic braids do more harm than good? Our latest investigation revealed surprising findings in some hair available today. Learn more through the link in our bio. #hairtok #braidinghair #blackhairtiktok #protectivestyles ♬ original sound - Consumer Reports These discoveries have created an uproar, especially on TikTok, but the CR team conducted these tests for good reason. According to a statement, when Dr. Rogers and his team began the research in 2024, he had three goals: to determine whether the chemicals were present, whether you could measure them and how much of each one was present, and to find out if there was a way to determine the possible risk to consumers who use these products. He also has two daughters who use extensions to get their hair braided. \"I know firsthand that getting braids is part of the culture, and alternatives to synthetic hair aren't always accessible or affordable,\" he said. He accomplished his mission, but I can't lie that hearing this news is disheartening - especially as a Black woman who wears braids. And though it's not entirely shocking, it brings up many questions: Why aren't there more regulations around hair extension products? Why are Black people put on the back burner in beauty? More importantly, why isn't this being discussed more so there can be a resolution? Under CR's post on TikTok revealing the news, many users expressed their disappointment, commenting, \"the attack on black women through hair products \u0026 extensions is crazy,\" and \"this is a form of racism.\" There's some truth to these statements. Hair extensions are primarily used by Black people and sold in Black neighborhoods, making our people the target market for these products and heightening our exposure to such harmful toxins. It also makes it even clearer how little care there is for our demographic. With these products being (most times) the only affordable option at a local beauty supply, that speaks volumes. Even in 2025, Black people are still not a priority in beauty. This void in the market is unacceptable, especially with Black consumers representing 70 percent of the hair extension industry, according to market data. We use braids as forms of self-expression, creativity, and connection - and we shouldn't have to risk our health to get them. It's time to hold companies more accountable for delivering the high-quality hair we deserve. Our lives, quite frankly, depend on it. Naomi Parris is a New York-based fashion and beauty writer with over seven years of experience. She served as an editorial operations associate at PS, specializing in all things fashion. Her work has also been seen in Elle, Essence Girls United, Bustle, and Elite Daily. Obsessed with telling stories that merge fashion and Black culture, her areas of expertise include Fashion Week coverage, high-profile interviews, shopping roundups, op-eds, and beauty stories.",
  "author": "Naomi Parris",
  "published": "Fri, 28 Feb 2025 13:50:00 -0800",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Beauty News",
    "Braids",
    "Personal Essay",
    "Natural Hair",
    "All The Range",
    "Crowned"
  ],
  "byline": "Naomi Parris",
  "length": 4549,
  "excerpt": "Braiding is a staple hairstyle for Black women, but new studies show cancer-causing chemicals found in hair extensions. Here, we examine the issue.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "Although significant progress has been made, the Black experience in America has always been limited — and the options for hair care are no exception. Before the rise of the natural hair movement, there were very few brands that catered to a Black woman's natural texture. Many were using methods like hair relaxers and straighteners to feel beautiful, but these practices were soon linked to uterine cancer. And though beauty companies have since elevated their offerings to include cleaner formulations that serve as an alternative to toxic chemical treatments, the trend of products made for our community being harmful is far from over. The proof is in Consumer Reports' latest discovery, which found carcinogens in synthetic braiding hair.On Feb. 27, the company's researchers published a new study that revealed carcinogens (agents that can increase the risk of cancer) are present in 10 popular synthetic hair-braiding brands, including X-Pression, Sassy Collection, and Sensationnel. Scientists tested each brand for heavy metals and volatile organic compounds (VOCs) and revealed they were found in 100 percent of the samples. Lead, an ingredient that causes skin irritation, was also found in nine of the 10 products, which explains why many users (myself included) have experienced an itchy scalp after getting fresh braids. Three of the products tested also contained benzene, a known agent that causes acute myeloid leukemia. \"It is strictly regulated and discouraged to use in laboratories because of its potential to cause cancer,\" Dr. James E. Rogers, PhD, Consumer Reports' director and head of product safety testing, said in a statement. All the samples also contained a probable carcinogen, methylene chloride, which is recognized by the Occupational Safety and Health Administration (OSHA) as a certified hazard that can lead to cancer of the lung and liver as well as non-Hodgkin's lymphoma.These discoveries have created an uproar, especially on TikTok, but the CR team conducted these tests for good reason. According to a statement, when Dr. Rogers and his team began the research in 2024, he had three goals: to determine whether the chemicals were present, whether you could measure them and how much of each one was present, and to find out if there was a way to determine the possible risk to consumers who use these products. He also has two daughters who use extensions to get their hair braided. \"I know firsthand that getting braids is part of the culture, and alternatives to synthetic hair aren't always accessible or affordable,\" he said. He accomplished his mission, but I can't lie that hearing this news is disheartening — especially as a Black woman who wears braids. And though it's not entirely shocking, it brings up many questions: Why aren't there more regulations around hair extension products? Why are Black people put on the back burner in beauty? More importantly, why isn't this being discussed more so there can be a resolution? Under CR's post on TikTok revealing the news, many users expressed their disappointment, commenting, \"the attack on black women through hair products \u0026 extensions is crazy,\" and \"this is a form of racism.\" There's some truth to these statements. Hair extensions are primarily used by Black people and sold in Black neighborhoods, making our people the target market for these products and heightening our exposure to such harmful toxins. It also makes it even clearer how little care there is for our demographic. With these products being (most times) the only affordable option at a local beauty supply, that speaks volumes. Even in 2025, Black people are still not a priority in beauty. This void in the market is unacceptable, especially with Black consumers representing 70 percent of the hair extension industry, according to market data. We use braids as forms of self-expression, creativity, and connection — and we shouldn't have to risk our health to get them. It's time to hold companies more accountable for delivering the high-quality hair we deserve. Our lives, quite frankly, depend on it.Naomi Parris is a New York-based fashion and beauty writer with over seven years of experience. She served as an editorial operations associate at PS, specializing in all things fashion. Her work has also been seen in Elle, Essence Girls United, Bustle, and Elite Daily. Obsessed with telling stories that merge fashion and Black culture, her areas of expertise include Fashion Week coverage, high-profile interviews, shopping roundups, op-eds, and beauty stories.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/kKEehhXvurM5n2g_5aYxuBD6mno=/13x9:4996x2625/fit-in/5000x3333/top/filters:format_auto():quality(85):upscale()/2025/02/28/798/n/1922153/3fc29cc367c1fbf3ad3780.49586588_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eAlthough significant progress has been made, the Black experience in America has always been limited — and the options for hair care are no exception. Before the rise of the \u003ca href=\"https://www.popsugar.com/beauty/curly-hair-tips-49316241\"\u003enatural hair\u003c/a\u003e movement, there were very few brands that catered to a Black woman\u0026#39;s natural texture. Many were using methods like \u003ca href=\"https://www.popsugar.com/beauty/sneaking-relaxer-non-black-salons-49063691\"\u003ehair relaxers\u003c/a\u003e and straighteners to feel beautiful, but these practices were soon \u003ca href=\"https://www.popsugar.com/beauty/chemical-hair-straightener-uterine-cancer-48983686\"\u003elinked to uterine cancer\u003c/a\u003e. And though beauty companies have since elevated their offerings to include cleaner formulations that serve as an alternative to toxic chemical treatments, the trend of products made for our community being harmful is far from over. The proof is in \u003ca href=\"http://www.consumerreports.org/health/wigs-hair-extensions/dangerous-chemicals-detected-in-braiding-hair-cr-tested-a4850978424/?ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003eConsumer Reports\u0026#39; latest discovery\u003c/a\u003e, which found carcinogens in synthetic braiding hair.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eOn Feb. 27, the company\u0026#39;s researchers published a \u003ca href=\"http://article.images.consumerreports.org/image/upload/v1740508146/prod/content/dam/CRO-Images-2025/Misc/Consumer-Reports-Test-Methodology-Synthetic-Braiding-Hair.pdf?ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003enew study\u003c/a\u003e that revealed carcinogens (agents that can increase the risk of cancer) are present in 10 popular synthetic hair-braiding brands, including X-Pression, Sassy Collection, and Sensationnel. Scientists tested each brand for heavy metals and volatile organic compounds (VOCs) and revealed they were found in 100 percent of the samples. Lead, an ingredient that causes skin irritation, was also found in nine of the 10 products, which explains why many users (myself included) have experienced an itchy scalp after getting fresh braids. \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eThree of the products tested also contained benzene, a known agent that causes acute myeloid leukemia. \u0026#34;It is strictly regulated and discouraged to use in laboratories because of its potential to cause cancer,\u0026#34; \u003ca href=\"http://www.consumerreports.org/about-us/our-people/our-experts/james-roger/?ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003eDr. James E. Rogers, PhD\u003c/a\u003e, Consumer Reports\u0026#39; director and head of product safety testing, said in a statement. All the samples also contained a probable carcinogen, \u003ca href=\"http://www.osha.gov/methylene-chloride/hazards?ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003emethylene chloride,\u003c/a\u003e which is recognized by the Occupational Safety and Health Administration (OSHA) as a certified hazard that can lead to cancer of the lung and liver as well as non-Hodgkin\u0026#39;s lymphoma.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"4\"\u003e\u003cp data-element-index=\"0\"\u003eThese discoveries have created an uproar, especially on TikTok, but the CR team conducted these tests for good reason. According to a statement, when Dr. Rogers and his team began the research in 2024, he had three goals: to determine whether the chemicals were present, whether you could measure them and how much of each one was present, and to find out if there was a way to determine the possible risk to consumers who use these products. He also has two daughters who use extensions to get their hair braided. \u0026#34;I know firsthand that getting braids is part of the culture, and alternatives to synthetic hair aren\u0026#39;t always accessible or affordable,\u0026#34; he said. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eHe accomplished his mission, but I can\u0026#39;t lie that hearing this news is disheartening — especially as a Black woman \u003ca href=\"https://www.popsugar.com/beauty/basket-spiral-braids-hairstyle-49405894\"\u003ewho wears braids\u003c/a\u003e. And though it\u0026#39;s not entirely shocking, it brings up many questions: Why aren\u0026#39;t there more regulations around hair extension products? Why are Black people put on the back burner in beauty? More importantly, why isn\u0026#39;t this being discussed more so there can be a resolution? \u003c/p\u003e\u003cp data-element-index=\"2\"\u003eUnder CR\u0026#39;s \u003ca href=\"https://www.tiktok.com/@consumerreports/video/7476100806672944430?refer=embed\u0026amp;ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003epost on TikTok\u003c/a\u003e revealing the news, many users expressed their disappointment, commenting, \u0026#34;the attack on black women through hair products \u0026amp; extensions is crazy,\u0026#34; and \u0026#34;this is a form of racism.\u0026#34; \u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThere\u0026#39;s some truth to these statements. Hair extensions are primarily used by Black people and sold in Black neighborhoods, making our people the target market for these products and heightening our exposure to such harmful toxins. It also makes it even clearer how little care there is for our demographic. With these products being (most times) the only affordable option at a local beauty supply, that speaks volumes. Even in 2025, Black people are still \u003ca href=\"https://www.popsugar.com/beauty/diversity-inclusion-beauty-important-49424628\"\u003enot a priority in beauty\u003c/a\u003e. \u003c/p\u003e\u003cp data-element-index=\"4\"\u003eThis void in the market is unacceptable, especially with Black consumers representing 70 percent of the hair extension industry, according to \u003ca href=\"https://dimensionmarketresearch.com/report/black-hair-care-market/?ref=popsugar.com\u0026amp;=___psv__p_49430501__t_w__r_www.google.com%2F_\" target=\"_blank\"\u003emarket data\u003c/a\u003e. We use braids as \u003ca href=\"https://www.popsugar.com/beauty/editors-letter-crowned-our-roots-49426504\"\u003eforms of self-expression, creativity, and connection\u003c/a\u003e — and we shouldn\u0026#39;t have to risk our health to get them. It\u0026#39;s time to hold companies more accountable for delivering the high-quality hair we deserve. Our lives, quite frankly, depend on it.\u003c/p\u003e\u003cp data-element-index=\"6\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/naomi-parris\"\u003eNaomi Parris\u003c/a\u003e is a New York-based fashion and beauty writer with over seven years of experience. She served as an editorial operations associate at PS, specializing in all things fashion. Her work has also been seen in Elle, Essence Girls United, Bustle, and Elite Daily. Obsessed with telling stories that merge fashion and Black culture, her areas of expertise include Fashion Week coverage, high-profile interviews, shopping roundups, op-eds, and beauty stories.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-02-28T21:50:02Z",
  "modifiedTime": "2025-02-28T21:50:02Z"
}
