{
  "id": "9c0225e4-8b3b-4e0f-96b8-de65c8f38dec",
  "title": "8 Latina-Owned Skincare Products That Are Making My Skin Thrive This Winter",
  "link": "https://www.popsugar.com/beauty/latina-owned-winter-skincare-products-49425779",
  "description": "People often ask me how I keep my skin so radiant and firm in my 30s. The secret? A mix of healthy lifestyle choices, clean and conscious eating habits, and a skincare routine I've perfected over the years. But just like the seasons change, so does my regimen. To combat winter dryness, as a New Yorker who ironically hates the cold, I rely on moisture-rich products that keep my skin soft and hydrated. Lately, I've also been more intentional about where I spend my money, prioritizing clean, inclusive brands - especially Latina-owned beauty products that meet all my skincare needs. Latinas are powerhouse consumers, driving significant growth in the beauty industry and making a major impact on the US economy. Last year, the industry experienced a 12% growth in Latina-owned brands, highlighting the need for more inclusive and WOC-owned beauty lines. From nourishing face oils to ultra-hydrating serums and moisturizers, these are my go-to products for a radiant, baby-soft complexion that will keep your skin thriving through the harsh winter. Johanna Ferreira is the content director for PS Juntos. With more than 10 years of experience, Johanna focuses on how intersectional identities are a central part of Latine culture. Previously, she spent close to three years as the deputy editor at HipLatina, and she has freelanced for numerous outlets including Refinery29, Oprah magazine, Allure, InStyle, and Well+Good. She has also moderated and spoken on numerous panels on Latine identity.",
  "author": "Johanna Ferreira",
  "published": "Fri, 31 Jan 2025 14:56:44 -0800",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Identity",
    "Beauty Products",
    "Shopping",
    "Juntos"
  ],
  "byline": "Johanna Ferreira",
  "length": 1712,
  "excerpt": "Johanna Fereira, PS Juntos Content Director shares her top Latina-owned beauty products to get her skin thriving during the winter.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.People often ask me how I keep my skin so radiant and firm in my 30s. The secret? A mix of healthy lifestyle choices, clean and conscious eating habits, and a skincare routine I've perfected over the years. But just like the seasons change, so does my regimen. To combat winter dryness, as a New Yorker who ironically hates the cold, I rely on moisture-rich products that keep my skin soft and hydrated. Lately, I've also been more intentional about where I spend my money, prioritizing clean, inclusive brands — especially Latina-owned beauty products that meet all my skincare needs.Latinas are powerhouse consumers, driving significant growth in the beauty industry and making a major impact on the US economy. Last year, the industry experienced a 12% growth in Latina-owned brands, highlighting the need for more inclusive and WOC-owned beauty lines. From nourishing face oils to ultra-hydrating serums and moisturizers, these are my go-to products for a radiant, baby-soft complexion that will keep your skin thriving through the harsh winter.Johanna Ferreira is the content director for PS Juntos. With more than 10 years of experience, Johanna focuses on how intersectional identities are a central part of Latine culture. Previously, she spent close to three years as the deputy editor at HipLatina, and she has freelanced for numerous outlets including Refinery29, Oprah magazine, Allure, InStyle, and Well+Good. She has also moderated and spoken on numerous panels on Latine identity.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/aL96TaBf5jYf3qF6smi-do3S-Dc=/0x0:1200x630/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/01/31/983/n/1922153/c12a76c4679d5054aa4767.84987901_.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003ePeople often ask me how I keep my skin so radiant and firm in my 30s. The secret?  A mix of healthy lifestyle choices, clean and conscious eating habits, and a skincare routine I\u0026#39;ve perfected over the years. But just like the seasons change, so does my regimen. To combat winter dryness, as a New Yorker who ironically hates the cold, I rely on moisture-rich products that keep my skin soft and hydrated. Lately, I\u0026#39;ve also been more intentional about where I spend my money, prioritizing clean, inclusive brands — especially Latina-owned beauty products that meet all my skincare needs.\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eLatinas are powerhouse consumers, driving significant growth in the beauty industry and making a major impact on the US economy. Last year, the \u003ca href=\"http://latinasinbeauty.org/blogs/news/2024-latinas-in-beauty-benchmark-report-equity-and-representation-in-the-beauty-industry?ref=popsugar.com\u0026amp;=___psv__p_49425779__t_w_\" target=\"_blank\"\u003eindustry experienced a 12% growth in Latina-owned brands\u003c/a\u003e, highlighting the need for more inclusive and WOC-owned beauty lines. From nourishing face oils to ultra-hydrating serums and moisturizers, these are my go-to products for a radiant, baby-soft complexion that will keep your skin thriving through the harsh winter.\u003c/p\u003e\u003cp data-element-index=\"3\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/johanna-ferreira\"\u003eJohanna Ferreira\u003c/a\u003e is the content director for PS Juntos. With more than 10 years of experience, Johanna focuses on how intersectional identities are a central part of Latine culture. Previously, she spent close to three years as the deputy editor at HipLatina, and she has freelanced for numerous outlets including Refinery29, Oprah magazine, Allure, InStyle, and Well+Good. She has also moderated and spoken on numerous panels on Latine identity.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "2 min read",
  "publishedTime": "2025-01-31T22:56:44Z",
  "modifiedTime": "2025-01-31T22:56:44Z"
}
