{
  "id": "a1638e13-a4b4-4373-93c2-077cd5edd098",
  "title": "I Forgot My Makeup on a First Date, But This Glowy Serum Was All I Needed",
  "link": "https://www.popsugar.com/beauty/merit-great-skin-instant-glow-serum-review-49432521",
  "description": "I'm no rookie when it comes to getting ready for a first date. Trust me, I've navigated my fair share of those butterflies-in-stomach moments and pre-date rituals. But flying to another city for a date? And somehow managing to forget my entire makeup bag? That was definitely not in my dating playbook. The whole thing happened in that frantic blur of airport security lines and rushed packing. But here's the thing: even in my most scattered moments, my skin-care routine is sacred. As a beauty editor (and skin-care devotee), I'd sooner forget my phone than my holy grail products. And thank goodness for that because Merit Beauty's Great Skin Instant Glow Serum ($38) became my unexpected hero in this whole adventure. The application process was effortless; I applied two pumps of the golden elixir and gently patted it on my skin. I allowed it to fully absorb into my skin for about a minute before following up with moisturizer, ensuring maximum effectiveness. This simple yet powerful step completed my entire routine, leaving my face feeling pampered and protected. The Merit Beauty serum's positive effects must have been noticeable during my date, as he continuously complimented my skin. He was so impressed that he even asked me to accompany him to Sephora the next day to purchase it for himself. A win is definitely a win. For my full review of the Great Skin Instant Glow Serum, keep reading. About Merit Beauty's Great Skin Instant Glow Serum It's a bi-phase serum with a lightweight texture that plumps and hydrates the skin, addresses uneven skin tone, and adds a noticeable glow to your complexion. It's suitable for normal, dry, and combination skin types. It contains hyaluronic acid for hydration, niacinamide to brighten, and cacao seed extract for antioxidants. It's vegan, gluten-free, and cruelty-free. What I Like About Merit Beauty's Great Skin Instant Glow Serum This serum is a sleek and chic multitasker that truly delivers on its promises. On days when I'm going makeup-free, I apply it underneath sunscreen to give me that coveted lit-from-within glow. It's become essential to my pre-makeup routine, serving as the base that ensures my foundation and other products melt seamlessly into my skin. It prevents that dreaded makeup mask effect. Instead of sitting heavily on the face, makeup melds with your natural complexion, creating that enviable your-skin-but-better finish. The serum's versatility in enhancing both bare-faced and full-glam days makes it a game-changer. The science behind its effectiveness lies in its powerful formulation: four types of hyaluronic acid are designed to deeply hydrate different skin layers, while niacinamide helps achieve an even, plump complexion. This combination of ingredients also gently smooths, hydrates, and brightens skin over time. How to Use Merit Beauty's Great Skin Instant Glow Serum Merit Beauty's approach to using the Great Skin Serum is refreshingly straightforward - a quick \"shake to wake\" activation, followed by two to three pumps that I pat evenly across my face. After testing different applications, I've found it works best as the third step in my routine, right after my core products but before moisturizer. This placement lets the formula absorb properly while complementing the rest of my skin-care lineup. What to Consider Before Trying Merit Beauty's Great Skin Instant Glow Serum The serum's texture is quite thin and watery, which may catch some off guard. After trying this serum for quite some time, I've found that its water-like texture is actually a blessing. Initially, I was worried it might be too thin, but it absorbs beautifully into my skin. I've learned through daily use to build up the layers if I need more coverage, but honestly, two to three pumps are sufficient. $38 might seem like a lot for a serum. But here's the thing: your skin is worth every penny. Trust me, when you use just the correct number of pumps (like recommended), you'll be amazed at how long this bottle lasts. Where Is Merit Beauty's Great Skin Instant Glow Serum Available? Merit Beauty's Great Skin Instant Glow Serum is available at Amazon, Sephora, and the brand's website. Rating: Stixx Mathews is a New York City-based freelance beauty writer with 11 years of experience who is passionate about telling stories that merge beauty and pop culture. He enjoys sharing his expert insights about the latest trends and must-have products, with a particular focus on lipstick and fragrance.",
  "author": "Stixx Mathews",
  "published": "Wed, 12 Mar 2025 12:50:01 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Product Reviews",
    "Beauty Shopping",
    "Skin Care",
    "Editor's Pick",
    "Serum"
  ],
  "byline": "Stixx Mathews",
  "length": 4691,
  "excerpt": "A beauty writer reviews the Merit Beauty Great Skin Instant Glow Serum with photos, after forgetting their makeup for a first date.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.I'm no rookie when it comes to getting ready for a first date. Trust me, I've navigated my fair share of those butterflies-in-stomach moments and pre-date rituals. But flying to another city for a date? And somehow managing to forget my entire makeup bag? That was definitely not in my dating playbook. The whole thing happened in that frantic blur of airport security lines and rushed packing. But here's the thing: even in my most scattered moments, my skin-care routine is sacred. As a beauty editor (and skin-care devotee), I'd sooner forget my phone than my holy grail products. And thank goodness for that because Merit Beauty's Great Skin Instant Glow Serum ($38) became my unexpected hero in this whole adventure.The application process was effortless; I applied two pumps of the golden elixir and gently patted it on my skin. I allowed it to fully absorb into my skin for about a minute before following up with moisturizer, ensuring maximum effectiveness. This simple yet powerful step completed my entire routine, leaving my face feeling pampered and protected.The Merit Beauty serum's positive effects must have been noticeable during my date, as he continuously complimented my skin. He was so impressed that he even asked me to accompany him to Sephora the next day to purchase it for himself.A win is definitely a win. For my full review of the Great Skin Instant Glow Serum, keep reading. About Merit Beauty's Great Skin Instant Glow Serum It's a bi-phase serum with a lightweight texture that plumps and hydrates the skin, addresses uneven skin tone, and adds a noticeable glow to your complexion. It's suitable for normal, dry, and combination skin types. It contains hyaluronic acid for hydration, niacinamide to brighten, and cacao seed extract for antioxidants. It's vegan, gluten-free, and cruelty-free. What I Like About Merit Beauty's Great Skin Instant Glow SerumThis serum is a sleek and chic multitasker that truly delivers on its promises. On days when I'm going makeup-free, I apply it underneath sunscreen to give me that coveted lit-from-within glow. It's become essential to my pre-makeup routine, serving as the base that ensures my foundation and other products melt seamlessly into my skin.It prevents that dreaded makeup mask effect. Instead of sitting heavily on the face, makeup melds with your natural complexion, creating that enviable your-skin-but-better finish. The serum's versatility in enhancing both bare-faced and full-glam days makes it a game-changer.The science behind its effectiveness lies in its powerful formulation: four types of hyaluronic acid are designed to deeply hydrate different skin layers, while niacinamide helps achieve an even, plump complexion. This combination of ingredients also gently smooths, hydrates, and brightens skin over time.How to Use Merit Beauty's Great Skin Instant Glow SerumMerit Beauty's approach to using the Great Skin Serum is refreshingly straightforward — a quick \"shake to wake\" activation, followed by two to three pumps that I pat evenly across my face. After testing different applications, I've found it works best as the third step in my routine, right after my core products but before moisturizer. This placement lets the formula absorb properly while complementing the rest of my skin-care lineup.What to Consider Before Trying Merit Beauty's Great Skin Instant Glow SerumThe serum's texture is quite thin and watery, which may catch some off guard. After trying this serum for quite some time, I've found that its water-like texture is actually a blessing. Initially, I was worried it might be too thin, but it absorbs beautifully into my skin. I've learned through daily use to build up the layers if I need more coverage, but honestly, two to three pumps are sufficient.$38 might seem like a lot for a serum. But here's the thing: your skin is worth every penny. Trust me, when you use just the correct number of pumps (like recommended), you'll be amazed at how long this bottle lasts.Where Is Merit Beauty's Great Skin Instant Glow Serum Available?Merit Beauty's Great Skin Instant Glow Serum is available at Amazon, Sephora, and the brand's website.Rating: ★★★★★Stixx Mathews is a New York City-based freelance beauty writer with 11 years of experience who is passionate about telling stories that merge beauty and pop culture. He enjoys sharing his expert insights about the latest trends and must-have products, with a particular focus on lipstick and fragrance.",
  "image": "https://media1.popsugar-assets.com/files/thumbor/AeKdF7ThKrl7nMBY3XLel57aWMM=/0x0:1200x630/fit-in/1200x630/top/filters:format_auto():quality(85):upscale()/2025/03/11/917/n/1922153/338805a567d0a4b062d9a6.02458178_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eI\u0026#39;m no rookie when it comes to \u003ca href=\"https://www.popsugar.com/beauty/How-Do-My-Hair-Makeup-Date-44130667\"\u003egetting ready for a first date\u003c/a\u003e. Trust me, I\u0026#39;ve navigated my fair share of those butterflies-in-stomach moments and pre-date rituals. But flying to another city for a date? And somehow managing to forget \u003ca href=\"https://www.popsugar.com/beauty/makeup-queer-black-man-personal-essay-49430327\"\u003emy entire makeup bag?\u003c/a\u003e That was definitely not in my dating playbook. \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eThe whole thing happened in that frantic blur of airport security lines and rushed packing. But here\u0026#39;s the thing: even in my most scattered moments, my \u003ca href=\"https://www.popsugar.com/beauty/Best-Skin-Care-Routine-25977852\"\u003eskin-care routine\u003c/a\u003e is sacred. As a beauty editor (and skin-care devotee), I\u0026#39;d sooner forget my phone than my holy grail products. And thank goodness for that because \u003ca href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fmerit-great-skin-instant-glow-serum-with-niacinamide-hyaluronic-acid-P502966%3Fcountry_switch%3Dus%26lang%3Den%26skuId%3D2512788\u0026amp;u1=___psv__p_49432521__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eMerit Beauty\u0026#39;s Great Skin Instant Glow Serum\u003c/a\u003e ($38) became my unexpected hero in this whole adventure.\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eThe application process was effortless; I applied two pumps of the golden elixir and gently patted it on my skin. I allowed it to fully absorb into my skin for about a minute before following up with moisturizer, ensuring maximum effectiveness. This simple yet powerful step completed my entire routine, leaving my face feeling pampered and protected.\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThe Merit Beauty serum\u0026#39;s positive effects must have been noticeable during my date, as he continuously complimented my skin. He was so impressed that he even asked me to accompany him to Sephora the next day to purchase it for himself.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eA win is definitely a win. For my full review of the Great Skin Instant Glow Serum, keep reading. \u003c/p\u003e\u003cp data-element-index=\"5\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eAbout Merit Beauty\u0026#39;s Great Skin Instant Glow Serum\u003c/h2\u003e\u003c/p\u003e\u003cdiv data-element-index=\"6\" data-element-has-ending-title=\"false\"\u003e\u003cul\u003e\n\u003cli\u003eIt\u0026#39;s a bi-phase serum with a lightweight texture that plumps and hydrates the skin, addresses uneven skin tone, and adds a noticeable glow to your complexion. \u003c/li\u003e\n\u003cli\u003eIt\u0026#39;s suitable for normal, dry, and combination skin types. \u003c/li\u003e\n\u003cli\u003eIt contains hyaluronic acid for hydration, niacinamide to brighten, and cacao seed extract for antioxidants.\u003c/li\u003e\n\u003cli\u003eIt\u0026#39;s vegan, gluten-free, and cruelty-free.\u003c/li\u003e\n\u003c/ul\u003e\u003c/div\u003e\u003cp data-element-index=\"7\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat I Like About Merit Beauty\u0026#39;s Great Skin Instant Glow Serum\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"8\"\u003eThis serum is a sleek and chic multitasker that truly delivers on its promises. On days when I\u0026#39;m going makeup-free, I apply it underneath sunscreen to give me that coveted lit-from-within glow. It\u0026#39;s become essential to my pre-makeup routine, serving as the base that ensures my foundation and other products melt seamlessly into my skin.\u003c/p\u003e\u003cp data-element-index=\"9\"\u003eIt prevents that dreaded makeup mask effect. Instead of sitting heavily on the face, makeup melds with your natural complexion, creating that enviable your-skin-but-better finish. The serum\u0026#39;s versatility in enhancing both bare-faced and full-glam days makes it a game-changer.\u003c/p\u003e\u003cp data-element-index=\"10\"\u003eThe science behind its effectiveness lies in its powerful formulation: four types of \u003ca href=\"https://www.popsugar.com/beauty/What-Hyaluronic-Acid-46039637\"\u003ehyaluronic acid\u003c/a\u003e are designed to deeply hydrate different skin layers, while \u003ca href=\"https://www.popsugar.com/beauty/what-is-niacinamide-48462618\"\u003eniacinamide\u003c/a\u003e helps achieve an even, plump complexion. This combination of ingredients also gently smooths, hydrates, and brightens skin over time.\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\" data-element-has-beginning-title=\"true\"\u003e\u003cp data-element-index=\"0\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eHow to Use Merit Beauty\u0026#39;s Great Skin Instant Glow Serum\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eMerit Beauty\u0026#39;s approach to using the Great Skin Serum is refreshingly straightforward — a quick \u0026#34;shake to wake\u0026#34; activation, followed by two to three pumps that I pat evenly across my face. After testing different applications, I\u0026#39;ve found it works best as the third step in my routine, right after my core products but before moisturizer. This placement lets the formula absorb properly while complementing the rest of my skin-care lineup.\u003c/p\u003e\u003cp data-element-index=\"2\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhat to Consider Before Trying Merit Beauty\u0026#39;s Great Skin Instant Glow Serum\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThe serum\u0026#39;s texture is quite thin and watery, which may catch some off guard. After trying this serum for quite some time, I\u0026#39;ve found that its water-like texture is actually a blessing. Initially, I was worried it might be too thin, but it absorbs beautifully into my skin. I\u0026#39;ve learned through daily use to build up the layers if I need more coverage, but honestly, two to three pumps are sufficient.\u003c/p\u003e\u003cp data-element-index=\"4\"\u003e$38 might seem like a lot for a \u003ca href=\"https://www.popsugar.com/beauty/best-serums-46781724\"\u003eserum\u003c/a\u003e. But here\u0026#39;s the thing: your skin is worth every penny. Trust me, when you use just the correct number of pumps (like recommended), you\u0026#39;ll be amazed at how long this bottle lasts.\u003c/p\u003e\u003cp data-element-index=\"5\" data-element-has-ending-title=\"true\"\u003e\u003ch2\u003eWhere Is Merit Beauty\u0026#39;s Great Skin Instant Glow Serum Available?\u003c/h2\u003e\u003c/p\u003e\u003cp data-element-index=\"6\"\u003eMerit Beauty\u0026#39;s Great Skin Instant Glow Serum is available at \u003ca href=\"https://www.amazon.com/MERIT-Great-Instant-Niacinamide-Hyaluronic/dp/B0C4PKLKFS/?tag=popsugarshopx-20\u0026amp;asc_source=post\u0026amp;asc_campaign=family\u0026amp;asc_refurl=https://www.popsugar.com/beauty/merit-great-skin-instant-glow-serum-review-49432521\u0026amp;ascsubtag=___psv__p_49432521__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eAmazon\u003c/a\u003e, \u003ca href=\"https://click.linksynergy.com/deeplink?id=OHlcvPYhHQM\u0026amp;mid=2417\u0026amp;murl=https%3A%2F%2Fwww.sephora.com%2Fproduct%2Fmerit-great-skin-instant-glow-serum-with-niacinamide-hyaluronic-acid-P502966%3FskuId%3D2512788\u0026amp;u1=___psv__p_49432521__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eSephora\u003c/a\u003e, and the brand\u0026#39;s \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.meritbeauty.com%2Fproducts%2Fgreat-skin-serum\u0026amp;xcust=___psv__p_49432521__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003ewebsite\u003c/a\u003e.\u003c/p\u003e\u003cp data-element-index=\"7\"\u003e\u003cstrong\u003eRating:\u003c/strong\u003e ★★★★★\u003c/p\u003e\u003cp data-element-index=\"9\"\u003e\u003cem\u003e\u003ca href=\"https://www.popsugar.com/author/stixx-mathews\"\u003eStixx Mathews\u003c/a\u003e is a New York City-based freelance beauty writer with 11 years of experience who is passionate about telling stories that merge beauty and pop culture. He enjoys sharing his expert insights about the latest trends and must-have products, with a particular focus on lipstick and fragrance.\u003c/em\u003e\u003cbr/\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-03-12T19:50:01Z",
  "modifiedTime": "2025-03-12T19:50:01Z"
}
