{
  "id": "bbf80353-8250-4f48-9f2e-ce3812f5c88d",
  "title": "Melissa Barrera, Actor",
  "link": "https://intothegloss.com/2024/12/melissa-barrera-your-monster-beauty-routine/",
  "description": "The mascara on every telenovela's actor's lids, a NAD+ skincare routine, and the fruity fragrance she just can't quit",
  "author": "",
  "published": "Thu, 19 Dec 2024 10:30:00 -0500",
  "source": "https://feeds.feedburner.com/intothegloss/oqoU",
  "categories": null,
  "byline": "Into The Gloss",
  "length": 4662,
  "excerpt": "Vida's Melissa Barrera on the mascara she brings to every shoot, her NAD+ skincare routine, and fruity fragrance that she just can't quit.",
  "siteName": "Into The Gloss",
  "favicon": "https://assets2.intothegloss.com/assets/misc/favicon-c5289286f05468868b306868af5d5003.png",
  "text": "“I wanted to be a pop star growing up, but that dream was always tied to acting because there was a show in Mexico called Código F.A.M.A. that was a big deal. It was a kid’s singing competition, and afterwards, the kids would be put in a musical soap opera. They would get to record albums and tour the country. My neighbor got on the show’s first season. I remember thinking, ‘Damn, he got in? That means that I can get in, too.’ Except that I didn’t, and so I started taking voice lessons and going to acting camps and I’ve come a long way since. [Laughs] I’ve landed roles in Vida, In The Heights, Scream, and Your Monster, which is probably my favorite movie that I’ve done. Even though I was not involved when Caroline Lindy, the director, was writing it, the role felt like it was written for me. It was a very ambitious shoot—we shot everything in 20 days and I was in almost every scene. It premiered at the Sundance Film Festival in January, and it’s been incredible to see people’s reactions. It’s given me a new hunger for indie films, so there really is a before and after Your Monster for me. BEAUTY I take very good care of my skin. I’ve been going to a dermatologist since I was either 13 or 14, and since then, I’ve been diligent about wearing sunscreen, moisturizing, and washing my face well. I’ve actually been using the same Dexeryl cleansing cream for over a decade—if it ain’t broke, don’t fix it. I use it both morning and night, and I travel with it everywhere. If the brand ever discontinues it, trust that I will buy every bottle that I can find on the Internet, in the world, and in the universe. I recently discovered a brand called Intuisse. I love their face serum, eye serum, cleansing lotion, and essential cream. All of the products have NAD+, which my dermatologist told me about. The only thing about the products is that you have to refrigerate them, so I keep them in a little fridge in my bathroom. I love Mad Hippie’s vitamin C serum and RoC’s Retinol Correxion night cream, too. Right now, I’m using Clinique’s Moisture Surge SPF 28 for sunscreen. I had a contract with Clinique for a while, and I just fell in love with the Moisture Surge line because the products have aloe vera, which I grew up using—it was our home remedy for everything, from face masks to scrapes. At night, sometimes I use the Moisture Surge 100H hydrator as a face mask to wake up nice and dewy. As far as makeup goes, I usually skip foundation altogether and just use the Nars Radiant Creamy concealer in Custard. I love Benetint for my cheeks and lips. It gives you a beautiful sun-kissed look. I learned recently that it was created because strippers wanted to make their nipples look pink. When I’m not feeling Benetint though, I go for Armani’s Luminous Silk cheek tint in 50.5, a rosy peach. Sometimes I use it as eyeshadow, but I’m obsessed with Armani’s actual eye tints, too. They’re so easy to use, like lip glosses but for your eyes basically. I have a few, but I especially love 10S, a chestnut, to create depth. And if I want to contour, I go for Simihaze’s Skin Suede bronze balm in Cedar. It’s amazing. I’ve recently started using the Chāmpo Longer Lashes serum, so the jury’s still out on that one, but I’ve been using IM’s mascara since I discovered it when I was 21, when I started doing soap operas—It was the mascara of telenovelas. Back then, a bottle cost 20 pesos, which is a dollar. It has mamey oil, which is supposed to help your lashes grow. It’s not waterproof, but it looks so natural. Every time I shoot a new project, I take a new bottle with me and give it to the makeup artist. I just know what works for me. When it comes to hair, all of my sisters have luscious manes, but I’m like a wet Afghan Hound. I have like three pieces of very fine hair with no volume. But I try to take really good care of it. I use Chāmpo’s Pitta shampoo, conditioner, and serum, which are all supposed to help with thickening and volume, and I can really see the difference when I use them. Before discovering Chāmpo, I was using Color Wow’s Dream Cocktail leave-in. It’s magic, too. It gives you so much volume, it’s ridiculous. And I love the Elixir Ultime oil from Kératase to keep my ends from splitting. I’ve been using it for years. Oh, and I’ve worn Be Delicious from DKNY since I was 15. It must work really well with my pH because people always tell me that I smell good. And since I’ve been wearing it so long, even someone who I haven’t seen in years will recognize me in the scent. They’ll say, ‘You still smell like you.’” —As told to Daise Bedolla Photographed by Ashlee Huff in New York on November 18, 2024",
  "image": "https://images.ctfassets.net/g8qtv9gzg47d/R1t1EVbcie3uu2DirxQRY/17cc1dfd715d79cc70e37f30e94db86f/INTOTHEGLOSS_THEFACE_MELISSABARRERA_FINALS_ASHLEEHUFF_F_4.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e“I wanted to be a pop star growing up, but that dream was always tied to acting because there was a show in Mexico called \u003cem\u003eCódigo F.A.M.A.\u003c/em\u003e that was a big deal. It was a kid’s singing competition, and afterwards, the kids would be put in a musical soap opera. They would get to record albums and tour the country. My neighbor got on the show’s first season. I remember thinking, ‘Damn, he got in? That means that I can get in, too.’ Except that I didn’t, and so I started taking voice lessons and going to acting camps and I’ve come a long way since. [Laughs] I’ve landed roles in \u003cem\u003eVida\u003c/em\u003e, \u003cem\u003eIn The Heights\u003c/em\u003e, \u003cem\u003eScream\u003c/em\u003e, and \u003cem\u003eYour Monster\u003c/em\u003e, which is probably my favorite movie that I’ve done. Even though I was not involved when Caroline Lindy, the director, was writing it, the role felt like it was written for me. It was a very ambitious shoot—we shot everything in 20 days and I was in almost every scene. It premiered at the Sundance Film Festival in January, and it’s been incredible to see people’s reactions. It’s given me a new hunger for indie films, so there really is a before and after \u003cem\u003eYour Monster\u003c/em\u003e for me.\u003c/p\u003e\n\n\u003cp\u003eBEAUTY\u003cbr/\u003e\nI take very good care of my skin. I’ve been going to a dermatologist since I was either 13 or 14, and since then, I’ve been diligent about wearing sunscreen, moisturizing, and washing my face well. I’ve actually been using the same \u003ca href=\"https://www.amazon.com/Dexeryl-Cleansing-Cream-Cleanser-500ml/dp/B06ZZBH8TY\" rel=\"nofollow\" target=\"_blank\"\u003eDexeryl cleansing cream\u003c/a\u003e for over a decade—if it ain’t broke, don’t fix it. I use it both morning and night, and I travel with it everywhere. If the brand ever discontinues it, trust that I will buy every bottle that I can find on the Internet, in the world, and in the universe.\u003c/p\u003e\n\n\u003cp\u003eI recently discovered a brand called \u003ca href=\"https://intuisse.com/\" rel=\"nofollow\" target=\"_blank\"\u003eIntuisse\u003c/a\u003e. I love their \u003ca href=\"https://intuisse.com/products/active-nad-face-serum-20ml\" rel=\"nofollow\" target=\"_blank\"\u003eface serum\u003c/a\u003e, \u003ca href=\"https://intuisse.com/products/intuisse-active-nad-eye-serum-10ml\" rel=\"nofollow\" target=\"_blank\"\u003eeye serum\u003c/a\u003e, \u003ca href=\"https://intuisse.com/products/intuisse-active-nad-cleansing-lotion-100ml\" rel=\"nofollow\" target=\"_blank\"\u003ecleansing lotion\u003c/a\u003e, and \u003ca href=\"https://intuisse.com/products/intuisse-active-nad-essential-cream-30ml\" rel=\"nofollow\" target=\"_blank\"\u003eessential cream\u003c/a\u003e. All of the products have NAD+, which my dermatologist told me about. The only thing about the products is that you have to refrigerate them, so I keep them in a little fridge in my bathroom. I love \u003ca href=\"https://www.ulta.com/p/vitamin-c-serum-xlsImpprod18731235?sku=2530015\" rel=\"nofollow\" target=\"_blank\"\u003eMad Hippie’s vitamin C serum\u003c/a\u003e and \u003ca href=\"https://www.amazon.com/RoC-Correxion-Anti-Aging-Oil-Free-Non-Comedogenic/dp/B00027DMI8\" rel=\"nofollow\" target=\"_blank\"\u003eRoC’s Retinol Correxion night cream\u003c/a\u003e, too. \u003c/p\u003e\n\n\u003cp\u003eRight now, I’m using Clinique’s \u003ca href=\"https://www.ulta.com/p/moisture-surge-broad-spectrum-spf-28-sheer-hydrator-moisturizer-pimprod2038272\" rel=\"nofollow\" target=\"_blank\"\u003eMoisture Surge SPF 28\u003c/a\u003e for sunscreen. I had a contract with Clinique for a while, and I just fell in love with the Moisture Surge line because the products have aloe vera, which I grew up using—it was our home remedy for everything, from face masks to scrapes. At night, sometimes I use the \u003ca href=\"https://www.ulta.com/p/moisture-surge-100h-auto-replenishing-hydrator-gel-moisturizer-with-hyaluronic-acid-pimprod2021615?sku=2576544\" rel=\"nofollow\" target=\"_blank\"\u003eMoisture Surge 100H hydrator\u003c/a\u003e as a face mask to wake up nice and dewy.\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://images.ctfassets.net/g8qtv9gzg47d/1hO9RkrnwmdMG9opSYZ06R/e2689ac5cc53e6192c67866a51153dfc/INTOTHEGLOSS_THEFACE_MELISSABARRERA_FINALS_ASHLEEHUFF_F_9.png\" alt=\"INTOTHEGLOSS THEFACE MELISSABARRERA FINALS ASHLEEHUFF F 9\"/\u003e\u003c/p\u003e\n\n\u003cp\u003eAs far as makeup goes, I usually skip foundation altogether and just use the \u003ca href=\"https://www.sephora.com/product/radiant-creamy-concealer-P377873\" rel=\"nofollow\" target=\"_blank\"\u003eNars Radiant Creamy concealer\u003c/a\u003e in \u003cem\u003eCustard\u003c/em\u003e. I love \u003ca href=\"https://www.sephora.com/product/benetint-cheek-lip-stain-P1272\" rel=\"nofollow\" target=\"_blank\"\u003eBenetint\u003c/a\u003e for my cheeks and lips. It gives you a beautiful sun-kissed look. I learned recently that it was created because strippers wanted to make their nipples look pink. When I’m not feeling Benetint though, I go for \u003ca href=\"https://www.sephora.com/product/giorgio-armani-beauty-luminous-silk-cheek-tint-P511567\" rel=\"nofollow\" target=\"_blank\"\u003eArmani’s Luminous Silk cheek tint\u003c/a\u003e in \u003cem\u003e50.5\u003c/em\u003e, a rosy peach. Sometimes I use it as eyeshadow, but I’m obsessed with Armani’s actual \u003ca href=\"https://www.sephora.com/product/eye-tint-P393434\" rel=\"nofollow\" target=\"_blank\"\u003eeye tints\u003c/a\u003e, too. They’re so easy to use, like lip glosses but for your eyes basically. I have a few, but I especially love 10S, a chestnut, to create depth. And if I want to contour, I go for \u003ca href=\"https://www.sephora.com/product/skin-suede-melting-bronze-balm-P508289\" rel=\"nofollow\" target=\"_blank\"\u003eSimihaze’s Skin Suede bronze balm\u003c/a\u003e in \u003cem\u003eCedar\u003c/em\u003e. It’s amazing.\u003c/p\u003e\n\n\u003cp\u003eI’ve recently started using the \u003ca href=\"https://us.champohaircare.com/products/lash-serum\" rel=\"nofollow\" target=\"_blank\"\u003eChāmpo Longer Lashes serum\u003c/a\u003e, so the jury’s still out on that one, but I’ve been using \u003ca href=\"https://www.amazon.com/Mascara-Mamey-Seed-Oil-Aceite/dp/B00LCSUAEK\" rel=\"nofollow\" target=\"_blank\"\u003eIM’s mascara\u003c/a\u003e since I discovered it when I was 21, when I started doing soap operas—It was the mascara of telenovelas. Back then, a bottle cost 20 pesos, which is a dollar. It has mamey oil, which is supposed to help your lashes grow. It’s not waterproof, but it looks so natural. Every time I shoot a new project, I take a new bottle with me and give it to the makeup artist. I just know what works for me.\u003c/p\u003e\n\n\u003cp\u003eWhen it comes to hair, all of my sisters have luscious manes, but I’m like a wet Afghan Hound. I have like three pieces of very fine hair with no volume. But I try to take really good care of it. I use \u003ca href=\"https://us.champohaircare.com/products/volumizing-collection\" rel=\"nofollow\" target=\"_blank\"\u003eChāmpo’s Pitta shampoo\u003c/a\u003e, \u003ca href=\"https://us.champohaircare.com/products/volumizing-collection\" rel=\"nofollow\" target=\"_blank\"\u003econditioner\u003c/a\u003e, and \u003ca href=\"https://us.champohaircare.com/products/growth-serum\" rel=\"nofollow\" target=\"_blank\"\u003eserum\u003c/a\u003e, which are all supposed to help with thickening and volume, and I can really see the difference when I use them. Before discovering Chāmpo, I was using \u003ca href=\"https://www.ulta.com/p/dream-cocktail-coconut-infused-leave-in-treatment-xlsImpprod14021219?sku=2301947\" rel=\"nofollow\" target=\"_blank\"\u003eColor Wow’s Dream Cocktail leave-in\u003c/a\u003e. It’s magic, too. It gives you so much volume, it’s ridiculous. And I love the \u003ca href=\"https://www.sephora.com/product/kerastase-elixir-ultime-refillable-hydrating-hair-oil-P511702\" rel=\"nofollow\" target=\"_blank\"\u003eElixir Ultime oil\u003c/a\u003e from Kératase to keep my ends from splitting. I’ve been using it for years.\u003c/p\u003e\n\n\u003cp\u003eOh, and I’ve worn \u003ca href=\"https://www.dkny.com/products/95002c000?srsltid=AfmBOooJrErfUWIVUUgg7X4zK4GdVIYGjUa0wWM9Cwbe6KNh2SVfjvL2\u0026amp;country=US\" rel=\"nofollow\" target=\"_blank\"\u003eBe Delicious\u003c/a\u003e from DKNY since I was 15. It must work really well with my pH because people always tell me that I smell good. And since I’ve been wearing it so long, even someone who I haven’t seen in years will recognize me in the scent. They’ll say, ‘You still smell like you.’”\u003c/p\u003e\n\n\u003cp\u003e—As told to Daise Bedolla\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003ePhotographed by Ashlee Huff in New York on November 18, 2024\u003c/em\u003e\u003c/p\u003e\n\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2024-12-19T10:30:00-05:00",
  "modifiedTime": null
}
