{
  "id": "d1d2a1b5-efef-4bf4-9f3c-2c45458fd773",
  "title": "COS Just Unveiled A Perfume Collection \u0026 It’s Like Nothing We’ve Worn Before",
  "link": "https://www.refinery29.com/en-us/cos-perfumery-fragrance-collection-review?utm_source=feed\u0026utm_medium=rss",
  "description": "If you’re anything like us, your wardrobe is probably anchored by a handful of staples from COS. The brand is known for its minimalist aesthetic — think crisp button-down shirts and flowy maxi dresses — that makes getting dressed feel effortless. Now it’s aiming to bring that same signature touch to your dressing table with its first-ever fragrance launch. The COS Perfumery collection features four gender-neutral scents formulated in Grasse, France — also known as the perfume capital of the world, with its abundant supply of fragrant flowers, including peonies, rose, jasmine, and lavender. At $99, they’re steeper than your average perfume from the likes of Zara or \u0026 Other Stories — but there’s a reason for that. All four fragrances contain 20% perfume oil, the highest end of the spectrum for eaux de parfum (most hover between a 7% to 15% concentration). This higher concentration guarantees much better staying power, so you’re certainly getting your money’s worth. What’s more, the collection is housed in tall, sculptural bottles that whisper good taste. Ahead, two fragrance-obsessed Refinery29 editors spritzed their way through the buzzy collection. Keep reading for our honest thoughts and which scents we’re most keen to add to our daily rotation. DashDividers_1_500x100 COS Perfumery Auburn Eau de Parfum, $99 “If you’re into gourmand perfumes with sweet, edible notes like vanilla, you’ll love this. Although the brand describes it as a woody scent, I’d argue otherwise. It leans rich rather than clean, with bold hits of coffee, peppery resin, and aromatic clove that easily overpower the sandalwood. That’s no bad thing — quite the opposite. It’s warm, enveloping, and conjures the image of someone swathed in vintage fur coats. As it dries down, the sweetness fades and a hint of tobacco comes through, giving it a more grown-up edge, like stepping into a smoky whiskey bar. Of all the scents, Auburn has the most staying power. I sprayed it on my jacket days ago, and it’s still lingering on the sleeves.” — Jacqueline Kilikita, beauty director Shop COS DashDividers_1_500x100 COS Perfumery Fleuriste Eau de Parfum, $99 “I caught a whiff of Fleuriste at a press preview event and couldn’t wait to get my hands on it. Master perfumer Nathalie Lorson likened it to ‘walking into a florist, where floral bouquets intertwine with the air’, and it’s absolutely spot on. A bundle of magnolia, rose, and peonies immediately hits the nose, but thanks to refreshing pink pepper, bergamot, and mandarin in the top notes, there’s an element of dewiness that reminds me more of freshly cut blooms rather than a stuffy floral perfume. Sandalwood and musk form the grounding base, resembling the stems and leaves of a plant. This is one of the most interesting interpretations of fresh flowers in perfumery, and the impressive longevity really adds to the appeal.” — Venus Wong, senior writer Shop COS DashDividers_1_500x100 COS Perfumery Solaire Eau de Parfum, $99 “I have to admit, Solaire is my least favorite of the collection — but it’s still a beautiful scent, which says a lot about how luxurious this range is. Though black pepper and incense are the headline notes, it leans more floral to my nose, thanks to styrax, a heady white flower. It smells clean and airy, like diving into a pile of fresh laundry or using an expensive hand wash in a members-only New York hotel. The musk adds a soft, skin-like warmth that feels like a deep, comforting hug. I prefer this layered with Fleuriste, which is my top pick, but at $99 each, I’d think twice about buying both. The price feels steep for a clothing brand, especially when Zara and \u0026 Other Stories offer perfumes that are just as good.” — Jacqueline Kilikita, beauty director Shop COS DashDividers_1_500x100 COS Perfumery Mythe Eau de Parfum, $99 “I’m not a big fan of earthy perfumes, but smelling Mythe on my wrists has made me question my longstanding belief. It’s nothing like the overpowering, musty scent you typically associate with the genre. The vetiver note does make a deep, root-like first impression, but invigorating ginger and leafy cardamom immediately add a fresh and mysterious edge. As Mythe settles on the skin, it transforms into a soft tree bark-like finish, thanks to violet and amyris (a woody note derived from incense). To my nose, this smells like clean, freshly showered skin. I’ve been spending a lot of time in hot and humid places recently, and I’ve been spritzing this on repeat as it’s one of the very few smells I can handle in the heat. It layers beautifully with Fleuriste.” — Venus Wong, senior writer Shop COS This story was originally published on Refinery29 UK. Like what you see? How about some more R29 goodness, right here?The Cool-Girl Perfume Brand Our Editors LoveCan Spraying Perfume Really Disrupt Your Hormones?This New Perfume Will Be The Scent Of The Summer",
  "author": "Venus Wong",
  "published": "Mon, 12 May 2025 15:11:11 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Venus Wong",
  "length": 4606,
  "excerpt": "Our editors share their honest thoughts on the newest perfume collection from clothing brand COS.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission. If you’re anything like us, your wardrobe is probably anchored by a handful of staples from COS. The brand is known for its minimalist aesthetic — think crisp button-down shirts and flowy maxi dresses — that makes getting dressed feel effortless. Now it’s aiming to bring that same signature touch to your dressing table with its first-ever fragrance launch.The COS Perfumery collection features four gender-neutral scents formulated in Grasse, France — also known as the perfume capital of the world, with its abundant supply of fragrant flowers, including peonies, rose, jasmine, and lavender. At $99, they're steeper than your average perfume from the likes of Zara or \u0026 Other Stories — but there's a reason for that. All four fragrances contain 20% perfume oil, the highest end of the spectrum for eaux de parfum (most hover between a 7% to 15% concentration). This higher concentration guarantees much better staying power, so you're certainly getting your money's worth. What's more, the collection is housed in tall, sculptural bottles that whisper good taste.AdvertisementADVERTISEMENTAhead, two fragrance-obsessed Refinery29 editors spritzed their way through the buzzy collection. Keep reading for our honest thoughts and which scents we’re most keen to add to our daily rotation.“If you’re into gourmand perfumes with sweet, edible notes like vanilla, you’ll love this. Although the brand describes it as a woody scent, I’d argue otherwise. It leans rich rather than clean, with bold hits of coffee, peppery resin, and aromatic clove that easily overpower the sandalwood. That’s no bad thing — quite the opposite. It’s warm, enveloping, and conjures the image of someone swathed in vintage fur coats. As it dries down, the sweetness fades and a hint of tobacco comes through, giving it a more grown-up edge, like stepping into a smoky whiskey bar. Of all the scents, Auburn has the most staying power. I sprayed it on my jacket days ago, and it’s still lingering on the sleeves.” — Jacqueline Kilikita, beauty director“I caught a whiff of Fleuriste at a press preview event and couldn’t wait to get my hands on it. Master perfumer Nathalie Lorson likened it to ‘walking into a florist, where floral bouquets intertwine with the air’, and it’s absolutely spot on. A bundle of magnolia, rose, and peonies immediately hits the nose, but thanks to refreshing pink pepper, bergamot, and mandarin in the top notes, there’s an element of dewiness that reminds me more of freshly cut blooms rather than a stuffy floral perfume. Sandalwood and musk form the grounding base, resembling the stems and leaves of a plant. This is one of the most interesting interpretations of fresh flowers in perfumery, and the impressive longevity really adds to the appeal.” — Venus Wong, senior writerAdvertisementADVERTISEMENT“I have to admit, Solaire is my least favorite of the collection — but it’s still a beautiful scent, which says a lot about how luxurious this range is. Though black pepper and incense are the headline notes, it leans more floral to my nose, thanks to styrax, a heady white flower. It smells clean and airy, like diving into a pile of fresh laundry or using an expensive hand wash in a members-only New York hotel. The musk adds a soft, skin-like warmth that feels like a deep, comforting hug. I prefer this layered with Fleuriste, which is my top pick, but at $99 each, I’d think twice about buying both. The price feels steep for a clothing brand, especially when Zara and \u0026 Other Stories offer perfumes that are just as good.” — Jacqueline Kilikita, beauty director“I’m not a big fan of earthy perfumes, but smelling Mythe on my wrists has made me question my longstanding belief. It's nothing like the overpowering, musty scent you typically associate with the genre. The vetiver note does make a deep, root-like first impression, but invigorating ginger and leafy cardamom immediately add a fresh and mysterious edge. As Mythe settles on the skin, it transforms into a soft tree bark-like finish, thanks to violet and amyris (a woody note derived from incense). To my nose, this smells like clean, freshly showered skin. I’ve been spending a lot of time in hot and humid places recently, and I’ve been spritzing this on repeat as it’s one of the very few smells I can handle in the heat. It layers beautifully with Fleuriste.” — Venus Wong, senior writerAdvertisementADVERTISEMENTThis story was originally published on Refinery29 UK.AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11889965.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003csection id=\"editorial-content\"\u003e\u003cdiv\u003e\n\n\u003cp\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/p\u003e\n\n\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eIf you’re anything like us, your wardrobe is probably anchored by a handful of \u003ca aria-label=\"staples from COS (opens in a new tab)\" rel=\"noreferrer noopener\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.cos.com%2Fen_usd%2Findex.html\" target=\"_blank\"\u003estaples from COS\u003c/a\u003e. The brand is known for its minimalist aesthetic — think crisp \u003ca href=\"https://www.refinery29.com/en-us/best-white-button-down-shirts\"\u003ebutton-down shirts\u003c/a\u003e and \u003ca href=\"https://www.refinery29.com/en-us/milkmaid-dresses-trend-shop\"\u003eflowy maxi dresses\u003c/a\u003e — that makes getting dressed feel effortless. Now it’s aiming to bring that same signature touch to your dressing table with its first-ever fragrance launch.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eThe \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.cos.com%2Fen_usd%2Ffragrance-and-candles.html%23shop-fragrances\" target=\"_blank\"\u003eCOS Perfumery collection\u003c/a\u003e features four gender-neutral scents formulated in Grasse, France — also known as the perfume capital of the world, with its abundant supply of fragrant flowers, including peonies, rose, jasmine, and lavender. At $99, they\u0026#39;re steeper than your average perfume from the \u003ca rel=\"noreferrer noopener\" aria-label=\"likes of Zara (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.zara.com%2F\" target=\"_blank\"\u003elikes of Zara\u003c/a\u003e or \u003ca href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.stories.com%2Fen_usd%2Findex.html\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"\u0026amp; Other Stories (opens in a new tab)\"\u003e\u0026amp; Other Stories\u003c/a\u003e — but there\u0026#39;s a reason for that. All four fragrances contain 20% perfume oil, the highest end of the spectrum for eaux de parfum (most hover between a 7% to 15% concentration). This higher concentration guarantees much better staying power, so you\u0026#39;re certainly getting your money\u0026#39;s worth. What\u0026#39;s more, the collection is housed in tall, sculptural bottles that whisper good taste.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eAhead, two fragrance-obsessed Refinery29 editors spritzed their way through the buzzy collection. Keep reading for our honest thoughts and which scents we’re most keen to add to our daily rotation.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“If you’re into gourmand perfumes with sweet, edible notes like vanilla, you’ll love this. Although the brand describes it as a woody scent, I’d argue otherwise. It leans rich rather than clean, with bold hits of coffee, peppery resin, and aromatic clove that easily overpower the sandalwood. That’s no bad thing — quite the opposite. It’s warm, enveloping, and conjures the image of someone swathed in vintage fur coats. As it dries down, the sweetness fades and a hint of tobacco comes through, giving it a more grown-up edge, like stepping into a smoky whiskey bar. Of all the scents, Auburn has the most staying power. I sprayed it on my jacket days ago, and it’s still lingering on the sleeves.” \u003cem\u003e— Jacqueline Kilikita, beauty director\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I caught a whiff of \u003ca rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.cos.com%2Fen_usd%2Fcos-unisex-us%2Fproduct.cos-perfumery-eau-de-parfum%2C-100ml-white.1252849004.html\" target=\"_blank\"\u003eFleuriste\u003c/a\u003e at a press preview event and couldn’t wait to get my hands on it. Master perfumer Nathalie Lorson likened it to ‘walking into a florist, where floral bouquets intertwine with the air’, and it’s absolutely spot on. A bundle of magnolia, rose, and peonies immediately hits the nose, but thanks to refreshing pink pepper, bergamot, and mandarin in the top notes, there’s an element of dewiness that reminds me more of freshly cut blooms rather than a stuffy floral perfume. Sandalwood and musk form the grounding base, resembling the stems and leaves of a plant. This is one of the most interesting interpretations of fresh flowers in perfumery, and the impressive longevity really adds to the appeal.” \u003cem\u003e— Venus Wong, senior writer\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I have to admit, \u003ca href=\"https://www.cos.com/en-gb/unisex/solaire-perfume/product/cos-perfumery-eau-de-parfum-100ml-solaire-1252849003\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSolaire\u003c/a\u003e is my least favorite of the collection — but it’s still a beautiful scent, which says a lot about how luxurious this range is. Though black pepper and incense are the headline notes, it leans more floral to my nose, thanks to styrax, a heady white flower. It smells clean and airy, like diving into a pile of fresh laundry or using an expensive hand wash in a members-only New York hotel. The musk adds a soft, skin-like warmth that feels like a deep, comforting hug. I prefer this layered with Fleuriste, which is my top pick, but at $99 each, I’d think twice about buying both. The price feels steep for a clothing brand, especially when Zara and \u0026amp; Other Stories offer perfumes that are just as good.” \u003cem\u003e— Jacqueline Kilikita, beauty director\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e“I’m not a big fan of earthy perfumes, but \u003ca rel=\"noreferrer noopener\" aria-label=\"smelling Mythe (opens in a new tab)\" href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.cos.com%2Fen_usd%2Fcos-unisex-us%2Fproduct.cos-perfumery-eau-de-parfum%2C-100ml-orange.1252849002.html\" target=\"_blank\"\u003esmelling Mythe\u003c/a\u003e on my wrists has made me question my longstanding belief. It\u0026#39;s nothing like the overpowering, musty scent you typically associate with the genre. The vetiver note does make a deep, root-like first impression, but invigorating ginger and leafy cardamom immediately add a fresh and mysterious edge. As Mythe settles on the skin, it transforms into a soft tree bark-like finish, thanks to violet and amyris (a woody note derived from incense). To my nose, this smells like clean, freshly showered skin. I’ve been spending a lot of time in hot and humid places recently, and I’ve been spritzing this on repeat as it’s one of the very few smells I can handle in the heat. It layers beautifully with Fleuriste.” \u003cem\u003e— Venus Wong, senior writer\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eThis story was originally published on Refinery29 UK.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e",
  "readingTime": "6 min read",
  "publishedTime": "2025-05-12T15:11:11Z",
  "modifiedTime": null
}
