{
  "id": "ecf0ab89-78ad-49e3-82c7-5ecaa06c2c9e",
  "title": "It’s Official: Meghan Markle Just Revived This Classic Sheer Nail Trend",
  "link": "https://www.popsugar.com/beauty/meghan-markle-milk-bath-nails-48846501",
  "description": "If you're as obsessed with royal beauty as we are, you're probably aware that it involves a lot of pared down, neutral shades. (Except for the rare occasion when someone breaks protocol.) Although Meghan Markle is no longer officially a working royal, it seems as though she's opted to continue following royal rules, at least when it comes to her nails - but with a slight twist. In the past, Markle has been seen embracing the \"bubble-bath nails\" trend, donning a sheer pink tone: most likely Essie's Ballet Slippers, which is the same shade that is rumored to be favored by Queen Elizabeth II. However, in her new Netflix series, \"With Love, Meghan,\" Markle can be seen sporting a different type of manicure: milk-bath nails. The trend has been spotted on celebrities like Jennifer Lopez, Nicola Peltz Beckham, and even Selena Gomez. It's so popular even some of our own editors have tried it. The name comes from the milk bath beauty treatment, which typically features a lukewarm tub consisting of milk, water, and dried flowers. (It's more luxurious than the water temperature makes it sound, we promise.) The original form of the trend consists of a milky-white acrylic nail with dried flowers encased in it, but the most updated version of the look usually involves a sheer white base that looks similar to a watered down glass of milk. (Again, it looks better than it sounds.) It's a fan favorite because it's customizable, and it's perfect for fans of white nail polish who are looking for something a little more relaxed than a sharp, stark white. The trend is so popular that there have been tons of spin-offs to come out of it, including \"strawberry milk\" nails and \"blueberry milk\" nails, just to name a couple. Image Source: Courtesy of Netflix If you're in the mood to recreate Markle's manicure at home or at the nail salon, the good news is it's easy to do. The look works well on all nail lengths and shapes, whether you're a fan of something short like Markle is, or something longer like an elongated almond. Our favorite gel nail polish to get the perfect shade is OPI Funny Bunny ($21). If you want it less white, have your nail technician add in a little of the OPI Super Gloss Top Coat ($21) to thin it out a bit. If you're looking for the perfect tone in a regular polish, we're fans of Essie Marshmallow ($11).",
  "author": "Renee Rodriguez",
  "published": "Tue, 11 Mar 2025 17:30:01 -0700",
  "source": "https://www.popsugar.com/beauty/feed",
  "categories": [
    "Meghan Markle",
    "Beauty News",
    "Nails",
    "Celebrity Beauty",
    "Nail Trends",
    "Celebrity Nails"
  ],
  "byline": "Renee Rodriguez",
  "length": 2525,
  "excerpt": "Meghan Markle has been seen sporting a milk-bath manicure in her new Netflix series, \"With Love, Meghan.\" Get a close up look at her nails here.",
  "siteName": "Popsugar",
  "favicon": "",
  "text": "While each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our Product Review Guidelines here.If you're as obsessed with royal beauty as we are, you're probably aware that it involves a lot of pared down, neutral shades. (Except for the rare occasion when someone breaks protocol.) Although Meghan Markle is no longer officially a working royal, it seems as though she's opted to continue following royal rules, at least when it comes to her nails — but with a slight twist. In the past, Markle has been seen embracing the \"bubble-bath nails\" trend, donning a sheer pink tone: most likely Essie's Ballet Slippers, which is the same shade that is rumored to be favored by Queen Elizabeth II. However, in her new Netflix series, \"With Love, Meghan,\" Markle can be seen sporting a different type of manicure: milk-bath nails. The trend has been spotted on celebrities like Jennifer Lopez, Nicola Peltz Beckham, and even Selena Gomez. It's so popular even some of our own editors have tried it. The name comes from the milk bath beauty treatment, which typically features a lukewarm tub consisting of milk, water, and dried flowers. (It's more luxurious than the water temperature makes it sound, we promise.) The original form of the trend consists of a milky-white acrylic nail with dried flowers encased in it, but the most updated version of the look usually involves a sheer white base that looks similar to a watered down glass of milk. (Again, it looks better than it sounds.) It's a fan favorite because it's customizable, and it's perfect for fans of white nail polish who are looking for something a little more relaxed than a sharp, stark white. The trend is so popular that there have been tons of spin-offs to come out of it, including \"strawberry milk\" nails and \"blueberry milk\" nails, just to name a couple. If you're in the mood to recreate Markle's manicure at home or at the nail salon, the good news is it's easy to do. The look works well on all nail lengths and shapes, whether you're a fan of something short like Markle is, or something longer like an elongated almond. Our favorite gel nail polish to get the perfect shade is OPI Funny Bunny ($21). If you want it less white, have your nail technician add in a little of the OPI Super Gloss Top Coat ($21) to thin it out a bit. If you're looking for the perfect tone in a regular polish, we're fans of Essie Marshmallow ($11).",
  "image": "https://media1.popsugar-assets.com/files/thumbor/y5lDfBM-q5yjObO84iqZn-js6Ds=/1x18:1456x782/fit-in/1456x970/top/filters:format_auto():quality(85):upscale()/2025/03/11/034/n/1922153/2d2e63c567d0cc04d4abd6.11200800_.png",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cp\u003eWhile each product featured is independently selected by our editors, we may include paid promotion. If you buy something through our links, we may earn commission. Read more about our \u003ca href=\"https://www.popsugar.com/ps-product-review-guidelines-disclosures\" target=\"_blank\"\u003eProduct Review Guidelines here\u003c/a\u003e.\u003c/p\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"2\"\u003e\u003cp data-element-index=\"0\"\u003eIf you\u0026#39;re as obsessed with royal beauty as we are, you\u0026#39;re probably aware that it involves a lot of pared down, neutral shades. (Except for the rare occasion when someone \u003ca href=\"https://www.popsugar.com/beauty/kate-middleton-breaking-royal-beauty-rules-49150029\"\u003ebreaks protocol\u003c/a\u003e.) Although Meghan Markle is no longer officially a working royal, it seems as though she\u0026#39;s opted to continue following royal rules, at least when it comes to her nails — but with a slight twist. \n\u003c/p\u003e\u003cp data-element-index=\"1\"\u003eIn the past, Markle has been seen embracing the \u003ca href=\"https://www.popsugar.com/beauty/bubble-bath-nails-49258195\"\u003e\u0026#34;bubble-bath nails\u0026#34;\u003c/a\u003e trend, donning a sheer pink tone: most likely Essie\u0026#39;s Ballet Slippers, which is the same shade that is rumored to be favored by Queen Elizabeth II. However, in her new Netflix series, \u0026#34;With Love, Meghan,\u0026#34; Markle can be seen sporting a different type of manicure: milk-bath nails. \n\u003c/p\u003e\u003cp data-element-index=\"2\"\u003eThe trend has been spotted on celebrities like Jennifer Lopez, Nicola Peltz Beckham, and even Selena Gomez. It\u0026#39;s so popular even some of our own editors \u003ca href=\"https://www.popsugar.com/beauty/milk-bath-manicure-editor-experiment-48873311\"\u003ehave tried it\u003c/a\u003e. \n\u003c/p\u003e\u003cp data-element-index=\"3\"\u003eThe name comes from the milk bath beauty treatment, which typically features a lukewarm tub consisting of milk, water, and dried flowers. (It\u0026#39;s more luxurious than the water temperature makes it sound, we promise.) The original form of the trend consists of a milky-white acrylic nail with dried flowers encased in it, but the most updated version of the look usually involves a sheer white base that looks similar to a watered down glass of milk. (Again, it looks better than it sounds.) \n\u003c/p\u003e\u003cp data-element-index=\"4\"\u003eIt\u0026#39;s a fan favorite because it\u0026#39;s customizable, and it\u0026#39;s perfect for fans of white nail polish who are looking for something a little more relaxed than a sharp, stark white. The trend is so popular that there have been tons of spin-offs to come out of it, including \u003ca href=\"https://www.popsugar.com/beauty/strawberry-milk-nails-49147993\"\u003e\u0026#34;strawberry milk\u0026#34;\u003c/a\u003e nails and \u003ca href=\"https://www.popsugar.com/beauty/blueberry-milk-nails-49214034\"\u003e\u0026#34;blueberry milk\u0026#34;\u003c/a\u003e nails, just to name a couple. \n\u003c/p\u003e\u003c/div\u003e\u003cdiv data-element-type=\"ParagraphBodyText\" data-element-index=\"5\"\u003e\u003cp data-element-index=\"0\"\u003eIf you\u0026#39;re in the mood to recreate Markle\u0026#39;s manicure at home or at the nail salon, the good news is it\u0026#39;s easy to do. The look works well on all nail lengths and shapes, whether you\u0026#39;re a fan of something short like Markle is, or something longer like an elongated almond. Our favorite gel nail polish to get the perfect shade is \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.beyondpolish.com%2Fproducts%2Fopi-gelcolor-intelli-gel-funny-bunny-0-5-oz%3Fvariant%3D42591862620211\u0026amp;xcust=___psv__p_48846501__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eOPI Funny Bunny\u003c/a\u003e ($21). If you want it less white, have your nail technician add in a little of the \u003ca href=\"https://go.skimresources.com/?id=1025X1701743\u0026amp;url=https%3A%2F%2Fwww.beyondpolish.com%2Fproducts%2Fopi-super-gloss-top-coat\u0026amp;xcust=___psv__p_48846501__t_w_\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eOPI Super Gloss Top Coat\u003c/a\u003e ($21) to thin it out a bit.  \u003c/p\u003e\u003cp data-element-index=\"1\"\u003eIf you\u0026#39;re looking for the perfect tone in a regular polish, we\u0026#39;re fans of \u003ca href=\"https://goto.target.com/c/1141873/520943/2092?u=https%3A%2F%2Fwww.target.com%2Fp%2Fessie-nail-polish-marshmallow-0-46-fl-oz%2F-%2FA-13249369\u0026amp;subId1=___psv__p_48846501__t_w_\u0026amp;subId3=product\" target=\"_blank\" rel=\"noreferrer sponsored\"\u003eEssie Marshmallow\u003c/a\u003e ($11).\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2022-06-03T16:05:04Z",
  "modifiedTime": "2025-03-12T00:30:01Z"
}
