{
  "id": "eeef067e-b8fc-41eb-8f6f-51b8b5620380",
  "title": "7 Beauty Editors Share Their Signature Nail Polish Shades For Summer",
  "link": "https://www.refinery29.com/en-us/summer-nail-polish-colors-editors-picks?utm_source=feed\u0026utm_medium=rss",
  "description": "As soon as the first sign of summer appears on the forecast, our nails practically beg for a polish refresh. There’s just something about the season that makes us want to swap our go-to collection of pink and nude polishes with something a bit louder and more unapologetically fun. Think punchy corals, highlighter yellows, and vacation-ready beach nails. It certainly helps that every hot weather outfit can be instantly elevated with a pop of color on the hands and feet.To help narrow down the literal rainbow of summer manicure trends out there, we’ve tapped a group of in-the-know beauty editors to share their favorite nail polish shades. Whether you're looking for pedicure ideas or just want your fingers to match your iced matcha, these editor-approved picks are worth adding to your nail polish rotation this summer.All linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.For more can't-miss shopping stories delivered straight to your inbox, sign up for our Most Wanted newsletter.Nails. INC Sun Street Passage Neon Nail Polish“No one does neon nail polish quite like Nails.INC — the shades are seriously eye-catching. I love wearing them on my toes in summer; there’s something so satisfying about seeing this bright pink polish peeking out of the sand. I honestly think Nails.INC is underrated when it comes to staying power. Its formulas last on my toes for weeks (don’t tell my pedicurist!) without fading or dulling. Even better, the wide brush makes application a breeze — it only takes two swipes to coat each nail perfectly.” — Jacqueline Kilikita, beauty director, Refinery29Nails Inc. Sun Street Passage Neon Nail Polish, $, available at Nails Inc.Manucurist Green Natural Nail Polish in Ultramarine“When it comes to summer nails, my mantra is always ‘go flashy or go home’, and this electric blue really is that girl for turning heads and attracting compliments. I love pairing it with matching blue mascara and eyeliner because it really makes all the blues pop. It’s not always easy to find vibrant, punchy shades in regular polish, but Manucurist offers a fantastic option for just $14.” — Vanese Maddix, contributing beauty writer, Refinery29Manucurist Green Natural Nail Polish in Ultramarine, $, available at ManucuristChanel Le Vernis Longwear Nail Colour in Poète“Nothing feels more summery to me than biting into a perfectly ripe peach. Poète, a blush orange hue from Chanel’s spring-summer lineup, perfectly captures this juicy, sweet fruit. I like that it’s not the kind of highly saturated neon orange that commands too much attention and makes it difficult to match my outfit. It’s the ideal crossover between orange and pink, and looks so lovely with the friendship bracelets and jade bangles I like to wear in the summer.” — Venus Wong, senior writer, Refinery29Chanel Le Vernis Longwear Nail Colour in Poète, $, available at UltaMooncat Nail Polish in Mermaid Bait “I am obsessed with the dynamic finishes in Mooncat's collection, and this chromatic turquoise has been my favorite, especially for beach season. It's so shiny that every time I wear it, people think it's gel and ask how my manicurist achieved the effect. I love how the chrome shifts between pink to gold and even lime green depending on how the light hits, and the lacquer itself has serious staying power. I can go almost two weeks with minimal wear.” — Marianne Mychaskiw, beauty writer and TV hostMooncat Nail Polish in Mermaid Bait, $, available at MooncatMavala Mini Color in Jaipur“This is the juiciest orange shade, and I actually love that the bottle is only 0.17 fl.oz. so it’s easy to slip into your luggage and perfect for quick top-ups if you get any chips. Even better, I never have to worry about it drying out, since I get through it much faster than larger bottles. It looks great on fingers and toes, but I prefer it on my feet — it really livens up my mostly black sandal collection!” — Jacqueline Kilikita, beauty director, Refinery29Mavala Mini Color in Jaipur, $, available at WalmartEssie Expressie Quick Dry Nail Color in Ahead of the Gam(er)“While I’m a bit of a creature of habit when it comes to my go-to nail polish colors, seeing so many incredible green manicures trending this year has me itching to switch up my reliable reds and trusty neutrals for something a little more fun. Enter: Essie Expressie Quick Dry Nail Color in Ahead of the Gam(er). Punchier than the more pared-back matcha shades that we’ve been seeing for spring, this is a vibrant lime green that feels fresh, fun, and perfect for summer. While it isn’t quite as neon as some of the Day Glo-inspired brights that I’ve seen taking off for the season ahead, it’s undeniably joy-inducing. Plus, this fast-drying formula from Essie is perfect if you have no patience to sit still and wait for your nails to dry like me.” — Mica Ricketts, freelance beauty journalistEssie expressie Quick Dry Nail Color, $, available at AmazonOPI Infinite Shine Nail Lacquer In Alpine Snow“A crisp white polish is my default pedicure color when I go on an extended summer holiday. It’s a no-brainer shade that goes with everything and looks so good peeping out of brown leather sandals. One thing I will say is that white polish tends to scratch and chip quite easily, and can look streaky if you’re not careful enough. That’s why the OPI Infinite Shine range is my favorite: the gel-like formula stays put for up to 11 days without chipping, and the brush design is very beginner-friendly. It’s practically foolproof.” — Venus Wong, senior writerOPI Infinite Shine Alpine Snow, $, available at UltaDazzle Dry Nail Polish in Sail Away“I love a pastel blue year-round, but there’s something about Dazzle Dry’s Sail Away that feels so right for summer. Photos don’t do this gorgeous periwinkle justice. It’s a truly unique hue that’s equal parts blue and lilac, and really pops without being a bright, loud color. My favorite way to wear it is with a breezy linen white button down, denim shorts, and a crisp glass of rosé.” — Karina Hoshikawa, senior writer, Refinery29Dazzle Dry Dazzle Dry Nail Polish in Sail Away, $, available at Dazzle DryNails.INC Super Dew 4-Piece Nail Polish Set“After flirting with all the colors of the rainbow with my manicures over the years, I've settled into a groove with my nail color of choice — and it’s very much in the minimal, clean vibe. Nails.INC is always on top of the trends, but where they excel, in my opinion, is with this fresh, clean manicure that always looks well put together. The brand’s Super Dew combo, $22, is an ideal foursome that features a sheer pink and bright sheer white polish that can be topped with a glow-enhancing sheer pop of pink and contains a nourishing cuticle oil for soft, supple cuticles. I’ve been applying two layers of Knightsbridge Nights Out (the peach pink on the bottom left) on my fingers and toes, and the effect is chic, clean, and goes-with-anything.” — Emma Guns, podcaster, beauty editor, and presenterNails Inc. Super Dew 4-Piece Nail Polish Set, $, available at Nails Inc.Olive \u0026 June Long-Lasting Polish in Lava“I really only wear bright red nail polish from July through September, and Essie’s Clambake is my all-time favorite. This shade was recently resurrected from the vault but is (sadly) already sold out. Olive \u0026 June’s Lava is a close match. There’s something about this spicy shade of red that reminds me of outdoor summer festivities (like seafood bakes), and to me, it’s as summery as it gets.” — Karina Hoshikawa, senior writer, Refinery29Olive \u0026 June Long-Lasting Polish in Lava, $, available at Olive \u0026 JuneLike what you see? How about some more R29 goodness, right here?Princess Nails Are Summer's Most Low-Key ManicureSummer’s 9 Hottest Pedicure Colors Are SurprisingBeach Nails Are Summer’s Most Playful Mani Trend",
  "author": "Venus Wong",
  "published": "Wed, 11 Jun 2025 15:00:27 +0000",
  "source": "https://www.refinery29.com/beauty/rss.xml",
  "categories": null,
  "byline": "Venus Wong",
  "length": 7068,
  "excerpt": "We’ve tapped a group of in-the-know beauty editors to share their favorite nail polish shades for summer.",
  "siteName": "Refinery29",
  "favicon": "",
  "text": "As soon as the first sign of summer appears on the forecast, our nails practically beg for a polish refresh. There’s just something about the season that makes us want to swap our go-to collection of pink and nude polishes with something a bit louder and more unapologetically fun. Think punchy corals, highlighter yellows, and vacation-ready beach nails. It certainly helps that every hot weather outfit can be instantly elevated with a pop of color on the hands and feet.To help narrow down the literal rainbow of summer manicure trends out there, we’ve tapped a group of in-the-know beauty editors to share their favorite nail polish shades. Whether you're looking for pedicure ideas or just want your fingers to match your iced matcha, these editor-approved picks are worth adding to your nail polish rotation this summer.AdvertisementADVERTISEMENTAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.1 of 10Nails. INC Sun Street Passage Neon Nail Polish“No one does neon nail polish quite like Nails.INC — the shades are seriously eye-catching. I love wearing them on my toes in summer; there’s something so satisfying about seeing this bright pink polish peeking out of the sand. I honestly think Nails.INC is underrated when it comes to staying power. Its formulas last on my toes for weeks (don’t tell my pedicurist!) without fading or dulling. Even better, the wide brush makes application a breeze — it only takes two swipes to coat each nail perfectly.” — Jacqueline Kilikita, beauty director, Refinery292 of 10Manucurist Green Natural Nail Polish in Ultramarine“When it comes to summer nails, my mantra is always ‘go flashy or go home’, and this electric blue really is that girl for turning heads and attracting compliments. I love pairing it with matching blue mascara and eyeliner because it really makes all the blues pop. It’s not always easy to find vibrant, punchy shades in regular polish, but Manucurist offers a fantastic option for just $14.” — Vanese Maddix, contributing beauty writer, Refinery29AdvertisementADVERTISEMENT3 of 10Chanel Le Vernis Longwear Nail Colour in Poète“Nothing feels more summery to me than biting into a perfectly ripe peach. Poète, a blush orange hue from Chanel’s spring-summer lineup, perfectly captures this juicy, sweet fruit. I like that it’s not the kind of highly saturated neon orange that commands too much attention and makes it difficult to match my outfit. It’s the ideal crossover between orange and pink, and looks so lovely with the friendship bracelets and jade bangles I like to wear in the summer.” — Venus Wong, senior writer, Refinery294 of 10Mooncat Nail Polish in Mermaid Bait “I am obsessed with the dynamic finishes in Mooncat's collection, and this chromatic turquoise has been my favorite, especially for beach season. It's so shiny that every time I wear it, people think it's gel and ask how my manicurist achieved the effect. I love how the chrome shifts between pink to gold and even lime green depending on how the light hits, and the lacquer itself has serious staying power. I can go almost two weeks with minimal wear.” — Marianne Mychaskiw, beauty writer and TV host5 of 10Mavala Mini Color in Jaipur“This is the juiciest orange shade, and I actually love that the bottle is only 0.17 fl.oz. so it’s easy to slip into your luggage and perfect for quick top-ups if you get any chips. Even better, I never have to worry about it drying out, since I get through it much faster than larger bottles. It looks great on fingers and toes, but I prefer it on my feet — it really livens up my mostly black sandal collection!” — Jacqueline Kilikita, beauty director, Refinery296 of 10Essie Expressie Quick Dry Nail Color in Ahead of the Gam(er)“While I’m a bit of a creature of habit when it comes to my go-to nail polish colors, seeing so many incredible green manicures trending this year has me itching to switch up my reliable reds and trusty neutrals for something a little more fun. Enter: Essie Expressie Quick Dry Nail Color in Ahead of the Gam(er). Punchier than the more pared-back matcha shades that we’ve been seeing for spring, this is a vibrant lime green that feels fresh, fun, and perfect for summer. While it isn’t quite as neon as some of the Day Glo-inspired brights that I’ve seen taking off for the season ahead, it’s undeniably joy-inducing. Plus, this fast-drying formula from Essie is perfect if you have no patience to sit still and wait for your nails to dry like me.” — Mica Ricketts, freelance beauty journalist7 of 10OPI Infinite Shine Nail Lacquer In Alpine Snow“A crisp white polish is my default pedicure color when I go on an extended summer holiday. It’s a no-brainer shade that goes with everything and looks so good peeping out of brown leather sandals. One thing I will say is that white polish tends to scratch and chip quite easily, and can look streaky if you’re not careful enough. That’s why the OPI Infinite Shine range is my favorite: the gel-like formula stays put for up to 11 days without chipping, and the brush design is very beginner-friendly. It’s practically foolproof.” — Venus Wong, senior writerAdvertisementADVERTISEMENT8 of 10Dazzle Dry Nail Polish in Sail Away“I love a pastel blue year-round, but there’s something about Dazzle Dry’s Sail Away that feels so right for summer. Photos don’t do this gorgeous periwinkle justice. It’s a truly unique hue that’s equal parts blue and lilac, and really pops without being a bright, loud color. My favorite way to wear it is with a breezy linen white button down, denim shorts, and a crisp glass of rosé.” — Karina Hoshikawa, senior writer, Refinery299 of 10Nails.INC Super Dew 4-Piece Nail Polish Set“After flirting with all the colors of the rainbow with my manicures over the years, I've settled into a groove with my nail color of choice — and it’s very much in the minimal, clean vibe. Nails.INC is always on top of the trends, but where they excel, in my opinion, is with this fresh, clean manicure that always looks well put together. The brand’s Super Dew combo, $22, is an ideal foursome that features a sheer pink and bright sheer white polish that can be topped with a glow-enhancing sheer pop of pink and contains a nourishing cuticle oil for soft, supple cuticles. I’ve been applying two layers of Knightsbridge Nights Out (the peach pink on the bottom left) on my fingers and toes, and the effect is chic, clean, and goes-with-anything.” — Emma Guns, podcaster, beauty editor, and presenter10 of 10Olive \u0026 June Long-Lasting Polish in Lava“I really only wear bright red nail polish from July through September, and Essie’s Clambake is my all-time favorite. This shade was recently resurrected from the vault but is (sadly) already sold out. Olive \u0026 June’s Lava is a close match. There’s something about this spicy shade of red that reminds me of outdoor summer festivities (like seafood bakes), and to me, it’s as summery as it gets.” — Karina Hoshikawa, senior writer, Refinery29AdvertisementADVERTISEMENT",
  "image": "https://www.refinery29.com/images/11902886.jpg?crop=40%3A21",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"editorial-content\"\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003eAs soon as the \u003ca href=\"https://www.refinery29.com/en-us/summer-nail-manicure-trends-2025\"\u003efirst sign of summer\u003c/a\u003e appears on the forecast, our nails practically beg for a \u003ca href=\"https://www.refinery29.com/en-us/how-often-to-get-a-pedicure\"\u003epolish refresh\u003c/a\u003e. There’s just something about the season that makes us want to swap our go-to collection of pink and \u003ca href=\"https://www.refinery29.com/en-us/best-nude-nail-polish\"\u003enude polishes\u003c/a\u003e with something a bit louder and more unapologetically fun. Think punchy corals, highlighter yellows, and vacation-ready \u003ca href=\"https://www.refinery29.com/en-us/beach-nails-manicure-trend\"\u003ebeach nails\u003c/a\u003e. It certainly helps that every \u003ca href=\"https://www.refinery29.com/en-us/vacation-outfit-ideas-summer-style\"\u003ehot weather outfit\u003c/a\u003e can be instantly elevated with a pop of color on the hands and feet.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003eTo help narrow down the literal rainbow of \u003ca href=\"https://www.refinery29.com/en-us/summer-nail-manicure-trends-2025\"\u003esummer manicure trends\u003c/a\u003e out there, we’ve tapped a group of in-the-know beauty editors to share their favorite nail polish shades. Whether you\u0026#39;re looking for \u003ca href=\"https://www.refinery29.com/en-us/summer-pedicure-color-trends-2025\"\u003epedicure ideas\u003c/a\u003e or just want your fingers to match your iced matcha, these editor-approved picks are worth adding to your nail polish rotation this summer.\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cem\u003eAll linked products are independently selected by our editors. If you purchase any of these products, we may earn a commission.\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003csection\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e1 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eNails. INC Sun Street Passage Neon Nail Polish\u003c/h2\u003e\u003cp\u003e“No one does neon nail polish quite like Nails.INC — the shades are seriously eye-catching. I love wearing them on my toes in summer; there’s something so satisfying about seeing \u003ca href=\"https://nailsinc.com/products/sun-street-passage-neon-nail-polish-us\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ethis bright pink polish\u003c/a\u003e peeking out of the sand. I honestly think Nails.INC is underrated when it comes to staying power. Its formulas last on my toes for weeks (don’t tell my pedicurist!) without fading or dulling. Even better, the wide brush makes application a breeze — it only takes two swipes to coat each nail perfectly.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/jacqueline_kilikita/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eJacqueline Kilikita\u003c/a\u003e, beauty director, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e2 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eManucurist Green Natural Nail Polish in Ultramarine\u003c/h2\u003e\u003cp\u003e“When it comes to summer nails, my mantra is always ‘go flashy or go home’, and \u003ca href=\"https://us.manucurist.com/products/green-nail-polish-ultramarine\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ethis electric blue\u003c/a\u003e really is that girl for turning heads and attracting compliments. I love pairing it with matching blue mascara and eyeliner because it really makes all the blues pop. It’s not always easy to find vibrant, punchy shades in regular polish, but Manucurist offers a fantastic option for just $14.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/itsvanesem\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eVanese Maddix\u003c/a\u003e, contributing beauty writer, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e3 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eChanel Le Vernis Longwear Nail Colour in Poète\u003c/h2\u003e\u003cp\u003e“Nothing feels more summery to me than biting into a perfectly ripe peach. \u003ca href=\"https://www.ulta.com/p/le-vernis-longwear-nail-colour-pimprod2039949?sku=2633767\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003ePoète\u003c/a\u003e, a blush orange hue from Chanel’s spring-summer lineup, perfectly captures this juicy, sweet fruit. I like that it’s not the kind of highly saturated neon orange that commands too much attention and makes it difficult to match my outfit. It’s the ideal crossover between orange and pink, and looks so lovely with the friendship bracelets and jade bangles I like to wear in the summer.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/venus.onthego/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eVenus Wong\u003c/a\u003e, senior writer, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e4 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eMooncat Nail Polish in Mermaid Bait\u003c/h2\u003e \u003cp\u003e“I am obsessed with the dynamic finishes in Mooncat\u0026#39;s collection, and this \u003ca href=\"https://www.mooncat.com/products/mermaid-bait\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003echromatic turquoise\u003c/a\u003e has been my favorite, especially for beach season. It\u0026#39;s so shiny that every time I wear it, people think it\u0026#39;s gel and ask how my manicurist achieved the effect. I love how the chrome shifts between pink to gold and even lime green depending on how the light hits, and the lacquer itself has serious staying power. I can go almost two weeks with minimal wear.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/mariannemychaskiw/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eMarianne Mychaskiw\u003c/a\u003e, beauty writer and TV host\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e5 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eMavala Mini Color in Jaipur\u003c/h2\u003e\u003cp\u003e“This is the juiciest orange shade, and I actually love that the bottle is only 0.17 fl.oz. so it’s easy to slip into your luggage and perfect for quick top-ups if you get any chips. Even better, I never have to worry about it drying out, since I get through it much faster than larger bottles. It looks great on fingers and toes, but I prefer it on my feet — it really livens up my mostly black sandal collection!” \u003cem\u003e— Jacqueline Kilikita, beauty director, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e6 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eEssie Expressie Quick Dry Nail Color in Ahead of the Gam(er)\u003c/h2\u003e\u003cp\u003e“While I’m a bit of a creature of habit when it comes to my go-to nail polish colors, seeing so many incredible green manicures trending this year has me itching to switch up my reliable reds and trusty neutrals for something a little more fun. Enter: \u003ca href=\"https://amzn.to/4jM70MV\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eEssie Expressie Quick Dry Nail Color in Ahead of the Gam(er)\u003c/a\u003e. Punchier than the more pared-back matcha shades that we’ve been seeing for spring, this is a vibrant lime green that feels fresh, fun, and perfect for summer. While it isn’t quite as neon as some of the Day Glo-inspired brights that I’ve seen taking off for the season ahead, it’s undeniably joy-inducing. Plus, this fast-drying formula from Essie is perfect if you have no patience to sit still and wait for your nails to dry like me.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/micaricketts\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eMica Ricketts\u003c/a\u003e, freelance beauty journalist\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e7 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eOPI Infinite Shine Nail Lacquer In Alpine Snow\u003c/h2\u003e\u003cp\u003e“A crisp white polish is my default pedicure color when I go on an extended summer holiday. It’s a no-brainer shade that goes with everything and looks so good peeping out of brown leather sandals. One thing I will say is that white polish tends to scratch and chip quite easily, and can look streaky if you’re not careful enough. That’s why the \u003ca href=\"https://go.skimresources.com?id=30283X879131\u0026amp;xs=1\u0026amp;url=https%3A%2F%2Fwww.ulta.com%2Fp%2Finfinite-shine-long-wear-nail-polish-blackswhitesgrays-pimprod2008868%3Fsku%3D2500260\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eOPI Infinite Shine\u003c/a\u003e range is my favorite: the gel-like formula stays put for up to 11 days without chipping, and the brush design is very beginner-friendly. It’s practically foolproof.” \u003cem\u003e— Venus Wong, senior writer\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e8 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eDazzle Dry Nail Polish in Sail Away\u003c/h2\u003e\u003cp\u003e“I love a pastel blue year-round, but there’s something about Dazzle Dry’s Sail Away that feels so right for summer. Photos don’t do this gorgeous periwinkle justice. It’s a truly unique hue that’s equal parts blue and lilac, and really pops without being a bright, loud color. My favorite way to wear it is with a breezy linen white button down, denim shorts, and a crisp glass of rosé.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/karihoshi/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eKarina Hoshikawa\u003c/a\u003e, senior writer, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e9 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eNails.INC Super Dew 4-Piece Nail Polish Set\u003cbr/\u003e\u003c/h2\u003e\u003cp\u003e“After flirting with all the colors of the rainbow with my manicures over the years, I\u0026#39;ve settled into a groove with my nail color of choice — and it’s very much in the minimal, clean vibe. Nails.INC is always on top of the trends, but where they excel, in my opinion, is with this fresh, clean manicure that always looks well put together. The brand’s \u003ca href=\"https://nailsinc.com/products/super-dew-nail-polish-4-piece-nail-polish-set-us\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eSuper Dew combo, $22\u003c/a\u003e, is an ideal foursome that features a sheer pink and bright sheer white polish that can be topped with a glow-enhancing sheer pop of pink and contains a nourishing cuticle oil for soft, supple cuticles. I’ve been applying two layers of Knightsbridge Nights Out (the peach pink on the bottom left) on my fingers and toes, and the effect is chic, clean, and goes-with-anything.” \u003cem\u003e— \u003ca href=\"https://www.instagram.com/emmaguns\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eEmma Guns\u003c/a\u003e, podcaster, beauty editor, and presenter\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003e10 of 10\u003c/span\u003e\u003c/p\u003e\u003cdiv\u003e\u003ch2\u003eOlive \u0026amp; June Long-Lasting Polish in Lava\u003c/h2\u003e\u003cp\u003e“I really only wear bright red nail polish from July through September, and \u003ca href=\"https://www.essie.com/nail-polish/enamel/corals/clambake\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eEssie’s Clambake\u003c/a\u003e is my all-time favorite. This shade was recently resurrected from the vault but is (sadly) already sold out. \u003ca href=\"https://oliveandjune.com/products/lava\" rel=\"noopener noreferrer nofollow\" target=\"_blank\"\u003eOlive \u0026amp; June’s Lava\u003c/a\u003e is a close match. There’s something about this spicy shade of red that reminds me of outdoor summer festivities (like seafood bakes), and to me, it’s as summery as it gets.” \u003cem\u003e— Karina Hoshikawa, senior writer, Refinery29\u003c/em\u003e\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eAdvertisement\u003c/span\u003e\u003cspan\u003eADVERTISEMENT\u003c/span\u003e\u003c/p\u003e\u003c/div\u003e\u003c/section\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-06-11T15:00:27Z",
  "modifiedTime": null
}
