{
  "id": "15a53fa9-2a3d-4e61-91d5-2b3d2ef5d808",
  "title": "Supergiant Games battles back accusations it is working around SAG-AFTRA strike",
  "link": "https://venturebeat.com/games/supergiant-games-battles-back-accusations-it-is-working-around-sag-aftra-strike/",
  "description": "After a public callout, the developers of Hades took to social media to clarify that they are not intending to recast union voice actors.",
  "author": "Imran Khan",
  "published": "Fri, 21 Feb 2025 21:35:45 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Game Development",
    "GamesBeat",
    "Gaming Business",
    "Supergiant Games"
  ],
  "byline": "Imran Khan",
  "length": 2579,
  "excerpt": "After a public callout, the developers of Hades took to social media to clarify that they are not intending to recast union voice actors.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "February 21, 2025 1:35 PM Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Supergiant Games— developers of titles like Bastion, Transistor, and the Hades series — has long taken pride in narrative-rich game development. Voice actors are responsive and involved with ongoing changes and get to know their characters for a prolonged period of time. This is why it came as such a shock when one of those voice actors publicly implied that the developer was recasting voices to avoid having to work with SAG-AFTRA on strike protocol. Marin M. Miller, a voice actor that plays several roles in the Hades series, took to social media on Wednesday to encourage fans to email an unnamed studio, heavily implied to be Supergiant, to ask them to sign an interim contract allowing Miller to voice their characters. Under current SAG-AFTRA rules, studios can work with union talent by signing an interim contract that include AI protections despite the strike not officially ending. SAG-AFTRA is seeking stronger, more permanent protections against AI, both in terms of its uses for voice acting and training on existing voice acting. This strike, and the protections demanded from it, are largely focused on video games and has been ongoing since August. Miller believes that the lack of this interim contract is why they have not been contacted to reprise their role and might have been recast for it altogether. While not replying to Miller directly, Supergiant put out their own statement on social media denying that they will be recasting any roles and that the studio is against using AI to replace voice actors. In a response to Game Developer posted publicly, Miller states that they have asked Supergiant for flexibility to bring them back years ago. Supergiant has not responded publicly since and presumably any negotiations between the studio and Miller would be conducted privately. This does serve as a reminder that the SAG-AFTRA strike is still ongoing and does not seem like it will reach a conclusion any time soon. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/02/hadesII.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-02-21T21:35:45+00:00\" datetime=\"2025-02-21T21:35:45+00:00\"\u003eFebruary 21, 2025 1:35 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"400\" height=\"225\" src=\"https://venturebeat.com/wp-content/uploads/2025/02/hadesII.jpg?w=400\" alt=\"Hades II from Supergiant Games\"/\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eSupergiant Games— developers of titles like Bastion, Transistor, and the Hades series — has long taken pride in narrative-rich game development. Voice actors are responsive and involved with ongoing changes and get to know their characters for a prolonged period of time. This is why it came as such a shock when one of those voice actors publicly implied that the developer was recasting voices to avoid having to work with SAG-AFTRA on strike protocol.\u003c/p\u003e\n\n\n\n\u003cp\u003eMarin M. Miller, a voice actor that plays several roles in the Hades series, \u003ca href=\"https://bsky.app/profile/marinmmiller.com/post/3likgdz5k722f\"\u003etook to social media on Wednesday\u003c/a\u003e to encourage fans to email an unnamed studio, heavily implied to be Supergiant, to ask them to sign an interim contract allowing Miller to voice their characters. Under current SAG-AFTRA rules, studios can work with union talent by signing an interim contract that include AI protections despite the strike not officially ending.\u003c/p\u003e\n\n\n\n\u003cp\u003eSAG-AFTRA is seeking stronger, more permanent protections against AI, both in terms of its uses for voice acting and training on existing voice acting. This strike, and the protections demanded from it, are largely focused on video games and has been ongoing since August. Miller believes that the lack of this interim contract is why they have not been contacted to reprise their role and might have been recast for it altogether. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhile not replying to Miller directly, \u003ca href=\"https://bsky.app/profile/supergiantgames.bsky.social/post/3lin7soibi22o\"\u003eSupergiant put out their own statement on social media\u003c/a\u003e denying that they will be recasting any roles and that the studio is against using AI to replace voice actors.\u003ca href=\"https://bsky.app/profile/marinmmiller.com/post/3lipgt5fv6225\"\u003e In a response to Game Developer\u003c/a\u003e posted publicly, Miller states that they have asked Supergiant for flexibility to bring them back years ago. \u003c/p\u003e\n\n\n\n\u003cp\u003eSupergiant has not responded publicly since and presumably any negotiations between the studio and Miller would be conducted privately. This does serve as a reminder that the SAG-AFTRA strike is still ongoing and does not seem like it will reach a conclusion any time soon.\u003c/p\u003e\n\n\n\n\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "3 min read",
  "publishedTime": "2025-02-21T21:35:45Z",
  "modifiedTime": "2025-02-21T21:42:35Z"
}
