{
  "id": "250f0a87-66b8-44e4-a37d-6486186768dd",
  "title": "ChatGPT’s second birthday: What will gen AI (and the world) look like in another 2 years?",
  "link": "https://venturebeat.com/ai/chatgpts-second-birthday-what-will-gen-ai-and-the-world-look-like-in-another-2-years/",
  "description": "We've come a long way in 2 years. Gen AI is the future, but how is it reshaping enterprise? And when will we reach AGI and superintelligence?",
  "author": "Gary Grossman, Edelman",
  "published": "Sun, 08 Dec 2024 20:15:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI, ML and Deep Learning",
    "category-/News",
    "ChatGPT",
    "Conversational AI",
    "Edelman",
    "Gartner Hype Cycle",
    "Generative AI",
    "large language models",
    "NLP",
    "peak of inflated expectations"
  ],
  "byline": "Gary Grossman, Edelman",
  "length": 9995,
  "excerpt": "We've come a long way in 2 years. Gen AI is the future, but how is it reshaping enterprise? And when will we reach AGI and superintelligence?",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "December 8, 2024 12:15 PM Grossman/Dall-E Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More It is now just over two years since the first appearance of ChatGPT on November 30, 2022. At the time of its launch, OpenAI viewed ChatGPT as a demonstration project designed to learn how people would make use of the tool and the underlying GPT 3.5 large language model (LLM). A LLM is a model based on the transformer architecture first introduced by Google in 2017, which uses self-attention mechanisms to process and generate human-like text across tasks like natural language understanding. It was more than a successful demonstration project! OpenAI was as surprised as anyone by the rapid uptake of ChatGPT, which reached one hundred million users within two months. Although perhaps they should not have been so surprised. Futurist Kevin Kelly, also the co-founder of Wired, advised in 2014 that “the business plans of the next 10,000 startups are easy to forecast: Take X and add AI. This is a big deal, and now it’s here.” Kelly said this several years before ChatGPT. Yet, this is exactly what has happened. Equally remarkable is his prediction in the same Wired article that: “By 2024, Google’s main product will not be search but AI.” It could be debated if this is true, but it might soon be. Gemini is Google’s flagship AI chat product, but AI pervades its search and likely every other one of its products, including YouTube, TensorFlow and AI features in Google Workspace. The bot heard around the world The headlong rush of AI startups that Kelly foresaw really gained momentum after the ChatGPT launch. You could call it the AI big bang moment, or the bot heard around the world. And it jumpstarted the field of generative AI — the broad category of LLMs for text and diffusion models for image creation. This reached the heights of hype, or what Gartner calls “The Peak of Inflated Expectations” in 2023. The hype of 2023 may have diminished, but only by a little. By some estimates, there are as many as 70,000 AI companies worldwide, representing a 100% increase since 2017. This is a veritable Cambrian explosion of companies pursuing novel uses for AI technology. Kelly’s 2014 foresight about AI startups proved prophetic. If anything, huge venture capital investments continue to flow into startup companies looking to harness AI. The New York Times reported that investors poured $27.1 billion into AI start-ups in the U.S. in the second quarter of 2024 alone, “accounting for nearly half of all U.S. start-up funding in that period.” Statista added: “In the first nine months of 2024, AI-related investments accounted for 33% of total investments in VC-backed companies headquartered in the U.S. That is up from 14% in 2020 and could go even higher in the years ahead.” The large potential market is a lure for both the startups and established companies. A recent Reuters Institute survey of consumers indicated individual usage of ChatGPT was low across six countries, including the U.S. and U.K. Just 1% used it daily in Japan, rising to 2% in France and the UK, and 7% in the U.S. This slow uptake might be attributed to several factors, ranging from a lack of awareness to concerns about the safety of personal information. Does this mean AI’s impact is overestimated? Hardly, as most of the survey respondents expected gen AI to have a significant impact on every sector of society in the next five years. The enterprise sector tells quite a different story. As reported by VentureBeat, industry analyst firm GAI Insights estimates that 33% of enterprises will have gen AI applications in production next year. Enterprises often have clearer use cases, such as improving customer service, automating workflows and augmenting decision-making, which drive faster adoption than among individual consumers. For example, the healthcare industry is using AI for capturing notes and financial services is using the technology for enhanced fraud detection. GAI further reported that gen AI is the leading 2025 budget priority for CIOs and CTOs. What’s next? From gen AI to the dawn of superintelligence The uneven rollout of gen AI raises questions about what lies ahead for adoption in 2025 and beyond. Both Anthropic CEO Dario Amodei and OpenAI CEO Sam Altman suggest that artificial general intelligence (AGI) — or even superintelligence — could appear within the next two to 10 years, potentially reshaping our world. AGI is thought to be the ability for AI to understand, learn and perform any intellectual task that a human being can, thereby emulating human cognitive abilities across a wide range of domains. Sparks of AGI in 2025 As reported by Variety, Altman said that we could see the first glimmers of AGI as soon as 2025. Likely he was talking about AI agents, in which you can give an AI system a complicated task and it will autonomously use different tools to complete it. For example, Anthropic recently introduced a Computer Use feature that enables developers to direct the Claude chatbot “to use computers the way people do — by looking at a screen, moving a cursor, clicking buttons and typing text.” This feature allows developers to delegate tasks to Claude, such as scheduling meetings, responding to emails or analyzing data, with the bot interacting with computer interfaces as if it were a human user. In a demonstration, Anthropic showcased how Claude could autonomously plan a day trip by interacting with computer interfaces — an early glimpse of how AI agents may oversee complex tasks. Caption: Anthropic shows how its Claude chatbot can autonomously plan tasks like a day trip. Source: https://www.youtube.com/watch?v=jqx18KgIzAE  In September, Salesforce said it “is ushering in the third wave of the AI revolution, helping businesses deploy AI agents alongside human workers.” They see agents focusing on repetitive, lower-value tasks, freeing people to focus on more strategic priorities. These agents could enable human workers to focus on innovation, complex problem-solving or customer relationship management.  With features like Computer Use capabilities from Anthropic and AI agent integration by Salesforce and others, the emergence of AI agents is becoming one of the most anticipated innovations in the field. According to Gartner, 33% of enterprise software applications will include agentic AI by 2028, up from less than 1% in 2024, enabling 15% of day-to-day work decisions to be made autonomously. While enterprises stand to gain significantly from agentic AI, the concept of “ambient intelligence” suggests an even broader transformation, where interconnected technologies seamlessly enhance daily life. In 2016, I wrote in TechCrunch about ambient intelligence, as a “digital interconnectedness to produce information and services that enhance our lives. This is enabled by the dynamic combination of mobile computing platforms, cloud and big data, neural networks and deep learning using graphics processing units (GPUs) to produce artificial intelligence (AI).” At that time, I said that connecting these technologies and crossing the boundaries necessary to provide seamless, transparent and persistent experiences in context will take time to realize. It is fair to say that eight years later, this vision is on the cusp of being realized.  The five levels of AGI Based on OpenAI’s roadmap, the journey to AGI involves progression through increasingly capable systems, with AI agents (level 3 out of 5) marking a significant leap toward autonomy.  Caption: OpenAI’s roadmap illustrates the progression to AGI, from basic chatbots to autonomous systems managing complex tasks. Altman stated that the initial impact of these agents will be minimal. Although eventually AGI will “be more intense than people think.” This suggests we should expect substantial changes soon that will require rapid societal adjustments to ensure fair and ethical integration.  How will AGI advances reshape industries, economies, the workforce and our personal experience of AI in the years to come? We can surmise that the near-term future driven by further AI advances will be both exciting and tumultuous, leading to both breakthroughs and crises. Balancing breakthroughs and disruptions Breakthroughs could span AI-enabled drug discovery, precision agriculture and practical humanoid robots. While breakthroughs promise transformative benefits, the path forward is not without risks. The rapid adoption of AI could also lead to significant disruptions, notably job displacement. This displacement could be large, especially if the economy enters a recession, when companies look to shed payroll but remain efficient. If this were to occur, social pushbacks on AI including mass protests are possible. As the AI revolution progresses from generative tools to autonomous agents and beyond, humanity stands on the cusp of a new era. Will these advancements elevate human potential, or will they present challenges we are not yet prepared to face? Likely, there will be both. In time, AI will not just be part of our tools — it will seamlessly integrate into the fabric of life itself, becoming ambient and reshaping how we work, connect and experience the world. Gary Grossman is EVP of technology practice at Edelman and global lead of the Edelman AI Center of Excellence. DataDecisionMakers Welcome to the VentureBeat community! DataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation. If you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers. You might even consider contributing an article of your own! Read More From DataDecisionMakers",
  "image": "https://venturebeat.com/wp-content/uploads/2024/12/image1.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-12-08T20:15:00+00:00\" datetime=\"2024-12-08T20:15:00+00:00\"\u003eDecember 8, 2024 12:15 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"429\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/image1.png?w=750\" alt=\"Grossman/Dall-E\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGrossman/Dall-E\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eIt is now just over two years since the first appearance of ChatGPT on November 30, 2022. At the time of its launch, OpenAI viewed ChatGPT as a demonstration project designed to learn how people would make use of the tool and the underlying GPT 3.5 \u003ca href=\"https://venturebeat.com/ai/heres-the-one-thing-you-should-never-outsource-to-an-ai-model/\"\u003elarge language model\u003c/a\u003e (LLM).\u003c/p\u003e\n\n\n\n\u003cp\u003eA LLM is a model based on the \u003ca href=\"https://arxiv.org/abs/1706.03762\" target=\"_blank\" rel=\"noreferrer noopener\"\u003etransformer architecture\u003c/a\u003e first introduced by Google in 2017, which uses self-attention mechanisms to process and generate human-like text across tasks like natural language understanding. It was more than a successful demonstration project! OpenAI was as surprised as anyone by the rapid uptake of ChatGPT, which reached one hundred million users within two months.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough perhaps they should not have been so surprised. Futurist Kevin Kelly, also the co-founder of \u003cem\u003eWired\u003c/em\u003e, \u003ca href=\"https://www.wired.com/2014/10/future-of-artificial-intelligence/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eadvised\u003c/a\u003e in 2014 that “the business plans of the next 10,000 startups are easy to forecast: Take X and add AI. This is a big deal, and now it’s here.”\u003c/p\u003e\n\n\n\n\u003cp\u003eKelly said this several years before ChatGPT. Yet, this is exactly what has happened. Equally remarkable is his prediction in the same \u003cem\u003eWired \u003c/em\u003earticle that: “By 2024, Google’s main product will not be search but AI.” It could be debated if this is true, but it might soon be. Gemini is Google’s flagship AI chat product, but AI pervades its search and likely every other one of its products, including YouTube, TensorFlow and AI features in Google Workspace.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-bot-heard-around-the-world\"\u003eThe bot heard around the world\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe headlong rush of AI startups that Kelly foresaw really gained momentum after the ChatGPT launch. You could call it the AI big bang moment, or the bot heard around the world. And it jumpstarted the field of generative AI — the broad category of LLMs for text and diffusion models for image creation. This reached the heights of hype, or what Gartner calls “The Peak of Inflated Expectations” in 2023.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe hype of 2023 may have diminished, but only by a little. By some \u003ca href=\"https://explodingtopics.com/blog/number-ai-companies\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eestimates\u003c/a\u003e, there are as many as 70,000 AI companies worldwide, representing a 100% increase since 2017. This is a veritable Cambrian explosion of companies pursuing novel uses for \u003ca href=\"https://venturebeat.com/ai/the-end-of-ai-scaling-may-not-be-nigh-heres-whats-next/\"\u003eAI technology\u003c/a\u003e. Kelly’s 2014 foresight about AI startups proved prophetic.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf anything, huge venture capital investments continue to flow into startup companies looking to harness AI.\u003cem\u003e The New York Times \u003c/em\u003ereported that \u003ca href=\"https://www.nytimes.com/2024/07/03/technology/ai-startups-funding.html\" target=\"_blank\" rel=\"noreferrer noopener\"\u003einvestors poured\u003c/a\u003e $27.1 billion into AI start-ups in the U.S. in the second quarter of 2024 alone, “accounting for nearly half of all U.S. start-up funding in that period.” Statista \u003ca href=\"https://www.statista.com/chart/33346/ai-share-of-vc-investments-in-the-us/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eadded\u003c/a\u003e: “In the first nine months of 2024, AI-related investments accounted for 33% of total investments in VC-backed companies headquartered in the U.S. That is up from 14% in 2020 and could go even higher in the years ahead.” The large potential market is a lure for both the startups and established companies.\u003c/p\u003e\n\n\n\n\n\n\n\n\u003cp\u003eA recent Reuters Institute \u003ca href=\"https://reutersinstitute.politics.ox.ac.uk/what-does-public-six-countries-think-generative-ai-news#header--1\" target=\"_blank\" rel=\"noreferrer noopener\"\u003esurvey\u003c/a\u003e of consumers indicated individual usage of ChatGPT was low across six countries, including the U.S. and U.K. Just 1% used it daily in Japan, rising to 2% in France and the UK, and 7% in the U.S. This slow uptake might be attributed to several factors, ranging from a lack of awareness to concerns about the safety of personal information. Does this mean AI’s impact is overestimated? Hardly, as most of the survey respondents expected gen AI to have a significant impact on every sector of society in the next five years.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe enterprise sector tells quite a different story. As reported by \u003ca href=\"https://venturebeat.com/ai/what-ai-vendor-should-you-choose-here-are-the-top-7-openai-still-leads/\"\u003eVentureBeat\u003c/a\u003e, industry analyst firm \u003ca href=\"https://gaiinsights.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eGAI Insights\u003c/a\u003e estimates that 33% of enterprises will have gen AI applications in production next year. Enterprises often have clearer use cases, such as improving customer service, automating workflows and augmenting decision-making, which drive faster adoption than among individual consumers. For example, the healthcare industry is using AI for capturing notes and financial services is using the technology for enhanced fraud detection. GAI further reported that gen AI is the leading 2025 budget priority for CIOs and CTOs.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-s-next-from-gen-ai-to-the-dawn-of-superintelligence\"\u003eWhat’s next? From gen AI to the dawn of superintelligence\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe uneven rollout of gen AI raises questions about what lies ahead for adoption in 2025 and beyond. Both Anthropic CEO Dario Amodei and OpenAI CEO Sam Altman suggest that artificial general intelligence (AGI) — or even superintelligence — could appear within the next two to 10 years, potentially reshaping our world. AGI is thought to be the ability for AI to understand, learn and perform any intellectual task that a human being can, thereby emulating human cognitive abilities across a wide range of domains.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-sparks-of-agi-in-2025\"\u003eSparks of AGI in 2025\u003c/h2\u003e\n\n\n\n\u003cp\u003eAs \u003ca href=\"https://variety.com/2024/biz/news/openai-sam-altman-superintelligence-dealbook-1236234815/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ereported\u003c/a\u003e by \u003cem\u003eVariety\u003c/em\u003e, Altman said that we could see the first glimmers of AGI as soon as 2025. Likely he was talking about AI agents, in which you can give an AI system a complicated task and it will autonomously use different tools to complete it.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, Anthropic recently introduced a \u003ca href=\"https://venturebeat.com/ai/anthropics-agentic-computer-use-is-giving-people-superpowers/\"\u003eComputer Use feature\u003c/a\u003e that enables developers to direct the Claude chatbot “to use computers the way people do — by looking at a screen, moving a cursor, clicking buttons and typing text.” This feature allows developers to delegate tasks to Claude, such as scheduling meetings, responding to emails or analyzing data, with the bot interacting with computer interfaces as if it were a human user.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn a demonstration, Anthropic showcased how Claude could autonomously plan a day trip by interacting with computer interfaces — an early glimpse of how AI agents may oversee complex tasks.\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" width=\"480\" height=\"360\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/image3.jpg\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/12/image3.jpg 480w, https://venturebeat.com/wp-content/uploads/2024/12/image3.jpg?resize=300,225 300w, https://venturebeat.com/wp-content/uploads/2024/12/image3.jpg?resize=400,300 400w\" sizes=\"(max-width: 480px) 100vw, 480px\"/\u003e\u003cfigcaption\u003e\u003cem\u003eCaption: Anthropic shows how its Claude chatbot can autonomously plan tasks like a day trip. Source: \u003c/em\u003e\u003ca href=\"https://www.youtube.com/watch?v=jqx18KgIzAE\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003ehttps://www.youtube.com/watch?v=jqx18KgIzAE\u003c/em\u003e\u003c/a\u003e\u003cem\u003e \u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eIn September, \u003ca href=\"https://www.salesforce.com/news/stories/building-business-ai-agents/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eSalesforce said\u003c/a\u003e it “is ushering in the third wave of the AI revolution, helping businesses deploy AI agents alongside human workers.” They see agents focusing on repetitive, lower-value tasks, freeing people to focus on more strategic priorities. These agents could enable human workers to focus on innovation, complex problem-solving or customer relationship management. \u003c/p\u003e\n\n\n\n\u003cp\u003eWith features like Computer Use capabilities from Anthropic and AI agent integration by Salesforce and others, the emergence of AI agents is becoming one of the most anticipated innovations in the field. \u003ca href=\"https://www.gartner.com/en/articles/intelligent-agent-in-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eAccording to Gartner\u003c/a\u003e, 33% of enterprise software applications will include agentic AI by 2028, up from less than 1% in 2024, enabling 15% of day-to-day work decisions to be made autonomously.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile enterprises stand to gain significantly from agentic AI, the concept of “ambient intelligence” suggests an even broader transformation, where interconnected technologies seamlessly enhance daily life.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2016, I \u003ca href=\"https://techcrunch.com/2016/05/07/the-next-stop-on-the-road-to-revolution-is-ambient-intelligence/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ewrote in TechCrunch\u003c/a\u003e about ambient intelligence, as a “digital interconnectedness to produce information and services that enhance our lives. This is enabled by the dynamic combination of mobile computing platforms, cloud and big data, neural networks and deep learning using graphics processing units (GPUs) to produce artificial intelligence (AI).” \u003c/p\u003e\n\n\n\n\u003cp\u003eAt that time, I said that connecting these technologies and crossing the boundaries necessary to provide seamless, transparent and persistent experiences in context will take time to realize. It is fair to say that eight years later, this vision is on the cusp of being realized. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-the-five-levels-of-agi\"\u003eThe five levels of AGI\u003c/h2\u003e\n\n\n\n\u003cp\u003eBased on OpenAI’s roadmap, the journey to AGI involves progression through increasingly capable systems, with AI agents (level 3 out of 5) marking a significant leap toward autonomy. \u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" width=\"805\" height=\"507\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg 805w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=285,180 285w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=300,189 300w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=768,484 768w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=800,504 800w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=400,252 400w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=750,472 750w, https://venturebeat.com/wp-content/uploads/2024/12/image2.jpg?resize=578,364 578w\" sizes=\"(max-width: 805px) 100vw, 805px\"/\u003e\u003cfigcaption\u003e\u003cem\u003eCaption:\u003c/em\u003e \u003cem\u003eOpenAI’s roadmap illustrates the progression to AGI, from basic chatbots to autonomous systems managing complex tasks.\u003c/em\u003e\u003c/figcaption\u003e\u003c/figure\u003e\n\n\n\n\u003cp\u003eAltman \u003ca href=\"https://variety.com/2024/biz/news/openai-sam-altman-superintelligence-dealbook-1236234815/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003estated\u003c/a\u003e that the initial impact of these agents will be minimal. Although eventually AGI will “be more intense than people think.” This suggests we should expect substantial changes soon that will require rapid societal adjustments to ensure fair and ethical integration. \u003c/p\u003e\n\n\n\n\u003cp\u003eHow will AGI advances reshape industries, economies, the workforce and our personal experience of AI in the years to come? We can surmise that the near-term future driven by further AI advances will be both exciting and tumultuous, leading to both breakthroughs and crises.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-balancing-breakthroughs-and-disruptions\"\u003eBalancing breakthroughs and disruptions\u003c/h2\u003e\n\n\n\n\u003cp\u003eBreakthroughs could span AI-enabled drug discovery, precision agriculture and practical humanoid robots. While breakthroughs promise transformative benefits, the path forward is not without risks. The rapid adoption of AI could also lead to significant disruptions, notably job displacement. This displacement could be large, especially if the economy \u003ca href=\"https://www.informationweek.com/machine-learning-ai/ai-and-the-next-recession\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eenters a recession\u003c/a\u003e, when companies look to shed payroll but remain efficient. If this were to occur, social pushbacks on AI including mass protests are possible.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs the AI revolution progresses from generative tools to autonomous agents and beyond, humanity stands on the cusp of a new era. Will these advancements elevate human potential, or will they present challenges we are not yet prepared to face? Likely, there will be both. In time, AI will not just be part of our tools — it will seamlessly integrate into the fabric of life itself, becoming ambient and reshaping how we work, connect and experience the world.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eGary Grossman is EVP of technology practice at \u003ca href=\"https://www.edelman.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eEdelman\u003c/a\u003e and global lead of the Edelman AI Center of Excellence.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2736392\"\u003e\n\u003cp\u003e\u003cstrong\u003eDataDecisionMakers\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWelcome to the VentureBeat community!\u003c/p\u003e\n\n\n\n\u003cp\u003eDataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou might even consider \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://venturebeat.com/guest-posts/\"\u003econtributing an article\u003c/a\u003e of your own!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noreferrer noopener\" href=\"https://venturebeat.com/category/DataDecisionMakers/\" target=\"_blank\"\u003eRead More From DataDecisionMakers\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "11 min read",
  "publishedTime": "2024-12-08T20:15:00Z",
  "modifiedTime": "2024-12-07T21:24:18Z"
}
