{
  "id": "283bc727-2449-46d0-838e-d62e8fdfab36",
  "title": "Meeting Minutes FAQs",
  "link": "https://smallbiztrends.com/meeting-minutes-faqs/",
  "description": "Properly documenting meeting minutes is a critical compliance requirement for corporations and some LLCs, helping protect the company and its owners from legal and financial risks.",
  "author": "Nellie Akalp",
  "published": "Mon, 23 Dec 2024 22:01:18 +0000",
  "source": "https://feeds2.feedburner.com/SmallBusinessTrends",
  "categories": [
    "Small Business Operations"
  ],
  "byline": "Nellie Akalp",
  "length": 4150,
  "excerpt": "Properly documenting meeting minutes is a critical compliance requirement for corporations and some LLCs, helping protect the company and its owners from legal and financial risks.",
  "siteName": "Small Business Trends",
  "favicon": "",
  "text": "If you are a business owner, you are most likely aware of the many compliance obligations outlined by state and federal law. One of the most important is the requirement to keep meeting minutes.In most states, businesses structured as C or S Corporations are required to hold shareholder meetings each year, as well as meetings of their boards of directors. In some cases, limited liability corporations (LLCs) must do so as well.Holding these meetings is essential for keeping the company compliant. But it’s not enough to simply have a meeting — the meeting must also be documented properly.Meeting minutes are an official record of what occurred during a meeting. They document actions taken and discussions held on internal topics, such as changes to governance, financial projects, business strategies, and personnel issues, among others. Although some may erroneously believe minutes are a basic administrative task, they are an important compliance requirement and should be taken seriously.With all the other tasks involved in running a business, meeting minutes can easily get relegated to the bottom of the priority list. I get many questions from clients about their obligations regarding meeting minutes — how to take them, when to take them, and what to do with them. Following are some of my most frequently asked questions.Do I Need to Take Meeting Minutes?If your business is a C Corp or an S Corp, you are required to hold annual meetings of both shareholders and boards of directors. Most corporations hold their annual meeting soon after the company’s fiscal year has ended. Minutes must be taken at these meetings.Generally speaking, LLCs aren’t typically required to hold annual meetings for members. However, if the LLC Operating Agreement requires meetings, then minutes must be recorded. Regardless, holding meetings and recording minutes is highly recommended, as they serve as important legal documentation and can protect owners should problems arise.What Do I Include in My Meeting Minutes?For C Corps or S Corps, shareholder meeting minutes (held annually) and board of director meeting minutes (held quarterly) typically include the following:Date, time, and location of the meetingWho attended and who was absent from the meetingWho recorded the minutesMeeting agenda items with a brief description of eachDetails about what was discussed during the meetingResults of any voting actions takenThe time when the meeting adjournedAlthough LLCs aren’t always required to hold annual meetings and keep minutes, it’s considered a best practice because it reaffirms that the business owner is treating the LLC as a separate legal entity. LLC meeting minutes should include the same information as corporation minutes.What Do I Do With the Meeting Minutes I Take?Meeting minutes should be stored with other important documents related to your business, such as articles of incorporation, bylaws, and resolutions. It is recommended to keep them for at least seven years. They do not have to be filed with the state, but should be made part of a business’s permanent record.What Happens If I Fail to Record Minutes?Failing to abide by compliance regulations can jeopardize a company’s standing as separate from its owners. In other words, it can lead to the piercing of the corporate veil. This could put the owner personally liable for actions taken against the company. Should the company be deemed to be operating as a partnership or individual rather than a corporation, they could face a less desirable tax rate. It can also lead to a loss of good standing and financial penalties in some states.Whether a corporation or an LLC, keeping accurate meeting minutes is more than just a formality — it’s a best practice to remain compliant and protect yourself. Understanding your legal and regulatory obligations with regards to meeting minutes is the first step in creating a culture of accountability.CorpNet offers business formations, filings, state tax registrations, and corporate compliance services in all 50 states. Express and 24 hour rush filing services available upon request. Click here to learn more.Image: Envato",
  "image": "https://smallbiztrends.com/wp-content/themes/sahifa/images/logo-full.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003e\u003cspan\u003eIf you are a business owner, you are most likely aware of the many compliance obligations outlined by state and federal law. One of the most important is the requirement to keep meeting minutes.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eIn most states, businesses structured as C or S Corporations are required to hold shareholder meetings each year, as well as meetings of their boards of directors. In some cases, limited liability corporations (LLCs) must do so as well.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eHolding these meetings is essential for keeping the company compliant. But it’s not enough to simply have a meeting — the meeting must also be documented properly.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eMeeting minutes are an official record of what occurred during a meeting. They document actions taken and discussions held on internal topics, such as changes to governance, financial projects, business strategies, and personnel issues, among others. Although some may erroneously believe minutes are a basic administrative task, they are an important compliance requirement and should be taken seriously.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWith all the other tasks involved in running a business, meeting minutes can easily get relegated to the bottom of the priority list. I get many questions from clients about their obligations regarding meeting minutes — how to take them, when to take them, and what to do with them. Following are some of my most frequently asked questions.\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eDo I Need to Take Meeting Minutes?\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eIf your business is a C Corp or an S Corp, you are required to hold annual meetings of both shareholders and boards of directors. Most corporations hold their annual meeting soon after the company’s fiscal year has ended. Minutes must be taken at these meetings.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eGenerally speaking, LLCs aren’t typically required to hold annual meetings for members. However, if the LLC Operating Agreement requires meetings, then minutes must be recorded. Regardless, holding meetings and recording minutes is highly recommended, as they serve as important legal documentation and can protect owners should problems arise.\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eWhat Do I Include in My Meeting Minutes?\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eFor C Corps or S Corps, shareholder meeting minutes (held annually) and board of director meeting minutes (held quarterly) typically include the following:\u003c/span\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cspan\u003eDate, time, and location of the meeting\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eWho attended and who was absent from the meeting\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eWho recorded the minutes\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eMeeting agenda items with a brief description of each\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eDetails about what was discussed during the meeting\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eResults of any voting actions taken\u003c/span\u003e\u003c/li\u003e\u003cli\u003e\u003cspan\u003eThe time when the meeting adjourned\u003c/span\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cspan\u003eAlthough LLCs aren’t always required to hold annual meetings and keep minutes, it’s considered a best practice because it reaffirms that the business owner is treating the LLC as a separate legal entity. LLC meeting minutes should include the same information as corporation minutes.\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eWhat Do I Do With the Meeting Minutes I Take?\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eMeeting minutes should be stored with other important documents related to your business, such as articles of incorporation, bylaws, and resolutions. It is recommended to keep them for at least seven years. They do not have to be filed with the state, but should be made part of a business’s permanent record.\u003c/span\u003e\u003c/p\u003e\u003ch3\u003e\u003cspan\u003eWhat Happens If I Fail to Record Minutes?\u003c/span\u003e\u003c/h3\u003e\u003cp\u003e\u003cspan\u003eFailing to abide by compliance regulations can jeopardize a company’s standing as separate from its owners. In other words, it can lead to the piercing of the \u003ca href=\"https://www.corpnet.com/blog/do-you-need-a-corporate-veil/\" rel=\"nofollow noopener noreferrer\"\u003e\u003cspan\u003e\u003cb\u003ecorporate veil\u003c/b\u003e\u003c/span\u003e\u003c/a\u003e\u003c/span\u003e\u003cspan\u003e. This could put the owner personally liable for actions taken against the company. Should the company be deemed to be operating as a partnership or individual rather than a corporation, they could face a less desirable tax rate. It can also lead to a loss of good standing and financial penalties in some states.\u003c/span\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eWhether a corporation or an LLC, keeping accurate meeting minutes is more than just a formality — it’s a best practice to remain compliant and protect yourself. Understanding your legal and regulatory obligations with regards to meeting minutes is the first step in creating a culture of accountability.\u003c/span\u003e\u003c/p\u003e\u003cp\u003eCorpNet offers business formations, filings, state tax registrations, and corporate compliance services in all 50 states. Express and 24 hour rush filing services available upon request. \u003ca href=\"https://smallbiztrends.com/business-filings\" rel=\"noopener noreferrer\" target=\"_blank\"\u003eClick here to learn more\u003c/a\u003e.\u003c/p\u003e\u003cp\u003e\u003cem\u003e\u003csmall\u003eImage: Envato\u003c/small\u003e\u003c/em\u003e\u003c/p\u003e\u003chr/\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-23T22:01:18Z",
  "modifiedTime": null
}
