{
  "id": "435cb293-fc28-4bb9-86c0-e2e6f00c1884",
  "title": "CTGT wins Best Presentation Style award at VB Transform 2025",
  "link": "https://venturebeat.com/ai/ctgt-wins-best-presentation-style-award-at-vb-transform-2025/",
  "description": "San Francisco-based CTGT, a startup focused on making AI more trustworthy through feature-level model customization, won the Best Presentation Style award at VB Transform 2025 in San Francisco. Founded by 23-year-old Cyril Gorlla, the company showcased how its technology helps enterprises overcome AI trust barriers by directly modifying model features instead of using traditional fine-tuning […]",
  "author": "James Thomason",
  "published": "Sat, 28 Jun 2025 00:48:46 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Data Infrastructure",
    "AI, ML and Deep Learning",
    "startup",
    "VB Transform 2025",
    "winners"
  ],
  "byline": "James Thomason",
  "length": 8365,
  "excerpt": "Join the event trusted by enterprise leaders for nearly two decades. VB Transform brings together the people building real enterprise AI strategy. Learn more San Francisco-based CTGT, a startup focused on making AI more trustworthy through feature-level model customization, won the Best Presentation Style award at VB Transform 2025 in San Francisco. Founded by 23-year-old Cyril […]",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "June 27, 2025 5:48 PM CTGT won best presentation at VB Transform's Innovation Showcase in SF on June 25, 2025. Photo: Michael O'Donnell Photography Join the event trusted by enterprise leaders for nearly two decades. VB Transform brings together the people building real enterprise AI strategy. Learn more San Francisco-based CTGT, a startup focused on making AI more trustworthy through feature-level model customization, won the Best Presentation Style award at VB Transform 2025 in San Francisco. Founded by 23-year-old Cyril Gorlla, the company showcased how its technology helps enterprises overcome AI trust barriers by directly modifying model features instead of using traditional fine-tuning or prompt engineering methods. During his presentation, Gorlla highlighted the “AI Doom Loop” faced by many enterprises: 54% of businesses cite AI as their highest tech risk according to Deloitte, while McKinsey reports 44% of organizations have experienced negative consequences from AI implementation. “A large part of this conference has been about the AI doom loop” Gorlla explained during his presentation. “Unfortunately, a lot of these [AI investments] don’t pan out. J\u0026J just canceled hundreds of AI pilots because they didn’t really deliver ROI due to no fundamental trust in these systems.” Breaking the AI compute wall CTGT’s approach represents a significant departure from conventional AI customization techniques. The company was founded on research Gorlla conducted while holding an endowed chair at the University of California San Diego. In 2023, Gorlla published a paper at the International Conference on Learning Representations (ICLR) describing a method for evaluating and training AI models that was up to 500 times faster than existing approaches while achieving “three nines” (99.9%) of accuracy. Rather than relying on brute-force scaling or traditional deep learning methods, CTGT has developed what it calls an “entirely new AI stack” that fundamentally reimagines how neural networks learn. The company’s innovation focuses on understanding and intervening at the feature level of AI models. The company’s approach differs fundamentally from standard interpretability solutions that rely on secondary AI systems for monitoring. Instead, CTGT offers mathematically verifiable interpretability capabilities that eliminate the need for supplemental models, significantly lowering computational requirements in the process. The technology works by identifying specific latent variables (neurons or directions in the feature space) that drive behaviors like censorship or hallucinations, then dynamically modifying these variables at inference time without altering the model’s weights. This approach allows companies to customize model behavior on the fly without taking systems offline for retraining. Real-world applications During his Transform presentation, Gorlla demonstrated two enterprise applications already deployed at a Fortune 20 financial institution: An email compliance workflow that trains models to understand company-specific acceptable content, allowing analysts to check their emails against compliance standards in real-time. The system highlights potentially problematic content and provides specific explanations. A brand alignment tool that helps marketers develop copy consistent with brand values. The system can suggest personalized advice on why certain phrases work well for a specific brand and how to improve content that doesn’t align. “If a company has 900 use cases, they no longer have to fine-tune 900 models,” Gorlla explained. “We’re model-agnostic, so they can just plug us in.” A real-world example of CTGT’s technology in action was its work with DeepSeek models, where it successfully identified and modified the features responsible for censorship behaviors. By isolating and adjusting these specific activation patterns, CTGT was able to achieve a 100% response rate on sensitive queries without degrading the model’s performance on neutral tasks like reasoning, mathematics and coding. Images: CTGT presentation at VB Transform 2025 Demonstrated ROI CTGT’s technology appears to be delivering measurable results. During the Q\u0026A session, Gorlla noted that in the first week of deployment with “one of the leading AI-powered insurers, we saved $5 million of liability from them.” Another early customer, Ebrada Financial, has used CTGT to improve the factual accuracy of customer service chatbots. “Previously, hallucinations and other errors in chatbot responses drove a high volume of requests for live support agents as customers sought to clarify responses,” said Ley Ebrada, Founder and Tax Strategist. “CTGT has helped improve chatbot accuracy tremendously, eliminating most of those agent requests.” In another case study, CTGT worked with an unnamed Fortune 10 company to enhance on-device AI capabilities in computationally constrained environments. The company also helped a leading computer vision firm achieve 10x faster model performance while maintaining comparable accuracy. The company claims its technology can reduce hallucinations by 80-90% and enable AI deployments with 99.9% reliability, a critical factor for enterprises in regulated industries like healthcare and finance. From Hyderabad to Silicon Valley Gorlla’s journey is itself remarkable. Born in Hyderabad, India, he mastered coding at age 11 and was disassembling laptops in high school to squeeze out more performance for training AI models. He came to the United States to study at the University of California, San Diego, where he received the Endowed Chair’s Fellowship. His research there focused on understanding the fundamental mechanisms of how neural networks learn, which led to his ICLR paper and eventually CTGT. In late 2024, Gorlla and co-founder Trevor Tuttle, an expert in hyperscalable ML systems, were selected for Y Combinator’s Fall 2024 batch. The startup has attracted notable investors beyond its institutional backers, including Mark Cuban and other prominent technology leaders drawn to its vision of making AI more efficient and trustworthy. Funding and future Founded in mid-2024 by Gorlla and Tuttle, CTGT raised $7.2 million in February 2025 in an oversubscribed seed round led by Gradient, Google’s early-stage AI fund. Other investors include General Catalyst, Y Combinator, Liquid 2, Deepwater, and notable angels such as François Chollet (creator of Keras), Michael Seibel (Y Combinator, co-founder of Twitch), and Paul Graham (Y Combinator). “CTGT’s launch is timely as the industry struggles with how to scale AI within the current confines of computing limits,” said Darian Shirazi, Managing Partner at Gradient. “CTGT removes those limits, enabling companies to rapidly scale their AI deployments and run advanced AI models on devices like smartphones. This technology is critical to the success of high-stakes AI deployments at large enterprises.” With AI model size outpacing Moore’s Law and advances in AI training chips, CTGT aims to focus on a more foundational understanding of AI that can cope with both inefficiency and increasingly complex model decisions. The company plans to use its seed funding to expand its engineering team and refine its platform. Each finalist presented to an audience of 600 industry decision-makers and received feedback from a panel of venture capital judges from Salesforce Ventures, Menlo Ventures, and Amex Ventures. Read about the other winners Catio and Solo.io. The other finalists were Kumo, Superduper.io, Sutro and Qdrant. Editor’s note: As a thank-you to our readers, we’ve opened up early bird registration for VB Transform 2026 — just $200. This is where AI ambition meets operational reality, and you’re going to want to be in the room. Reserve your spot now. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/06/VBTRANSFORM25-0736.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-06-28T00:48:46+00:00\" datetime=\"2025-06-28T00:48:46+00:00\"\u003eJune 27, 2025 5:48 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"500\" src=\"https://venturebeat.com/wp-content/uploads/2025/06/VBTRANSFORM25-0736.jpg?w=750\" alt=\"CTGT won best presentation at VB Transform\u0026#39;s Innovation Showcase in SF on June 25, 2025. Photo: \"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCTGT won best presentation at VB Transform\u0026#39;s Innovation Showcase in SF on June 25, 2025. Photo: Michael O\u0026#39;Donnell Photography\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin the event trusted by enterprise leaders for nearly two decades. VB Transform brings together the people building real enterprise AI strategy. \u003ca href=\"http://vbtransform.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eLearn more\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eSan Francisco-based \u003ca href=\"https://www.ctgt.ai/\"\u003eCTGT\u003c/a\u003e, a startup focused on making AI more trustworthy through feature-level model customization, won the Best Presentation Style award at \u003ca href=\"https://vbtransform.com\"\u003eVB Transform 2025\u003c/a\u003e in San Francisco. Founded by 23-year-old Cyril Gorlla, the company showcased how its technology helps enterprises overcome AI trust barriers by directly modifying model features instead of using traditional fine-tuning or prompt engineering methods.\u003c/p\u003e\n\n\n\n\u003cp\u003eDuring his presentation, Gorlla highlighted the “AI Doom Loop” faced by many enterprises: 54% of businesses cite AI as their highest tech risk according to Deloitte, while McKinsey reports 44% of organizations have experienced negative consequences from AI implementation.\u003c/p\u003e\n\n\n\n\u003cp\u003e“A large part of this conference has been about the AI doom loop” Gorlla explained during his presentation. “Unfortunately, a lot of these [AI investments] don’t pan out. \u003ca href=\"https://www.wsj.com/articles/johnson-johnson-pivots-its-ai-strategy-a9d0631f\"\u003eJ\u0026amp;J just canceled\u003c/a\u003e hundreds of AI pilots because they didn’t really deliver ROI due to no fundamental trust in these systems.”\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-breaking-the-ai-compute-wall\"\u003e\u003cstrong\u003eBreaking the AI compute wall\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eCTGT’s approach represents a significant departure from conventional AI customization techniques. The company was founded on research Gorlla conducted while holding an endowed chair at the University of California San Diego.\u003c/p\u003e\n\n\n\n\u003cp\u003eIn 2023, Gorlla \u003ca href=\"https://openreview.net/forum?id=8WiNDyXgj6\"\u003epublished a paper\u003c/a\u003e at the International Conference on Learning Representations (ICLR) describing a method for evaluating and training AI models that was up to 500 times faster than existing approaches while achieving “three nines” (99.9%) of accuracy.\u003c/p\u003e\n\n\n\n\u003cp\u003eRather than relying on brute-force scaling or traditional deep learning methods, CTGT has developed what it calls an “entirely new AI stack” that fundamentally reimagines how neural networks learn. The company’s innovation focuses on understanding and intervening at the feature level of AI models.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company’s approach differs fundamentally from standard interpretability solutions that rely on secondary AI systems for monitoring. Instead, CTGT offers mathematically verifiable interpretability capabilities that eliminate the need for supplemental models, significantly lowering computational requirements in the process.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe technology works by identifying specific latent variables (neurons or directions in the feature space) that drive behaviors like censorship or hallucinations, then dynamically modifying these variables at inference time without altering the model’s weights. This approach allows companies to customize model behavior on the fly without taking systems offline for retraining.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-real-world-applications\"\u003e\u003cstrong\u003eReal-world applications\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eDuring his Transform presentation, Gorlla demonstrated two enterprise applications already deployed at a Fortune 20 financial institution:\u003c/p\u003e\n\n\n\n\u003cp\u003eAn email compliance workflow that trains models to understand company-specific acceptable content, allowing analysts to check their emails against compliance standards in real-time. The system highlights potentially problematic content and provides specific explanations.\u003c/p\u003e\n\n\n\n\u003cp\u003eA brand alignment tool that helps marketers develop copy consistent with brand values. The system can suggest personalized advice on why certain phrases work well for a specific brand and how to improve content that doesn’t align.\u003c/p\u003e\n\n\n\n\u003cp\u003e“If a company has 900 use cases, they no longer have to fine-tune 900 models,” Gorlla explained. “We’re model-agnostic, so they can just plug us in.”\u003c/p\u003e\n\n\n\n\u003cp\u003eA real-world example of CTGT’s technology in action was its work with \u003ca href=\"https://www.ctgt.ai/blogs/a-feature-level-approach-to-mitigating-bias-and-censorship-in-deepseek-r1\"\u003eDeepSeek models\u003c/a\u003e, where it successfully identified and modified the features responsible for censorship behaviors. By isolating and adjusting these specific activation patterns, CTGT was able to achieve a 100% response rate on sensitive queries without degrading the model’s performance on neutral tasks like reasoning, mathematics and coding.\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cstrong\u003eImages:  CTGT presentation at VB Transform 2025\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cfigure\u003e\u003cimg fetchpriority=\"high\" decoding=\"async\" height=\"428\" width=\"800\" src=\"https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png 2228w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=300,161 300w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=768,411 768w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=800,428 800w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=1536,822 1536w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=2048,1096 2048w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=400,214 400w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=750,401 750w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=578,309 578w, https://venturebeat.com/wp-content/uploads/2025/06/image_d957d0.png?resize=930,498 930w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003cfigure\u003e\u003cimg decoding=\"async\" height=\"528\" width=\"800\" src=\"https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?w=800\" alt=\"\" srcset=\"https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png 2380w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=300,198 300w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=768,507 768w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=800,528 800w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=1536,1015 1536w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=2048,1353 2048w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=400,264 400w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=750,495 750w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=578,382 578w, https://venturebeat.com/wp-content/uploads/2025/06/image_4a1a1a.png?resize=930,614 930w\" sizes=\"(max-width: 800px) 100vw, 800px\"/\u003e\u003c/figure\u003e\n\n\n\n\u003ch3 id=\"h-demonstrated-roi\"\u003e\u003cstrong\u003eDemonstrated ROI\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eCTGT’s technology appears to be delivering measurable results. During the Q\u0026amp;A session, Gorlla noted that in the first week of deployment with “one of the leading AI-powered insurers, we saved $5 million of liability from them.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAnother early customer, Ebrada Financial, has used CTGT to improve the factual accuracy of customer service chatbots. “Previously, hallucinations and other errors in chatbot responses drove a high volume of requests for live support agents as customers sought to clarify responses,” said Ley Ebrada, Founder and Tax Strategist. “CTGT has helped improve chatbot accuracy tremendously, eliminating most of those agent requests.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn another case study, CTGT worked with an unnamed Fortune 10 company to enhance on-device AI capabilities in computationally constrained environments. The company also helped a leading computer vision firm achieve 10x faster model performance while maintaining comparable accuracy.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company claims its technology can reduce hallucinations by 80-90% and enable AI deployments with 99.9% reliability, a critical factor for enterprises in regulated industries like healthcare and finance.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-from-hyderabad-to-silicon-valley\"\u003e\u003cstrong\u003eFrom Hyderabad to Silicon Valley\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eGorlla’s journey is itself remarkable. Born in Hyderabad, India, he \u003ca href=\"https://analyticsindiamag.com/ai-trends/how-this-hyderabadi-founder-won-over-mark-cuban-to-solve-ai-hallucination/\"\u003emastered coding\u003c/a\u003e at age 11 and was disassembling laptops in high school to squeeze out more performance for training AI models. He came to the United States to study at the University of California, San Diego, where he received the Endowed Chair’s Fellowship.\u003c/p\u003e\n\n\n\n\u003cp\u003eHis research there focused on understanding the fundamental mechanisms of how neural networks learn, which led to his ICLR paper and eventually CTGT. In late 2024, Gorlla and co-founder Trevor Tuttle, an expert in hyperscalable ML systems, were selected for Y Combinator’s Fall 2024 batch.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe startup has attracted notable investors beyond its institutional backers, including Mark Cuban and other prominent technology leaders drawn to its vision of making AI more efficient and trustworthy.\u003c/p\u003e\n\n\n\n\u003ch3 id=\"h-funding-and-future\"\u003e\u003cstrong\u003eFunding and future\u003c/strong\u003e\u003c/h3\u003e\n\n\n\n\u003cp\u003eFounded in mid-2024 by Gorlla and Tuttle, CTGT \u003ca href=\"https://www.ctgt.ai/ctgt-raises-7m-to-help-enterprises-break-through-the-limits-of-ai-compute\"\u003eraised $7.2 million\u003c/a\u003e in February 2025 in an oversubscribed seed round led by Gradient, Google’s early-stage AI fund. Other investors include General Catalyst, Y Combinator, Liquid 2, Deepwater, and notable angels such as François Chollet (creator of Keras), Michael Seibel (Y Combinator, co-founder of Twitch), and Paul Graham (Y Combinator).\u003c/p\u003e\n\n\n\n\u003cp\u003e“CTGT’s launch is timely as the industry struggles with how to scale AI within the current confines of computing limits,” said Darian Shirazi, Managing Partner at Gradient. “CTGT removes those limits, enabling companies to rapidly scale their AI deployments and run advanced AI models on devices like smartphones. This technology is critical to the success of high-stakes AI deployments at large enterprises.”\u003c/p\u003e\n\n\n\n\u003cp\u003eWith AI model size outpacing Moore’s Law and advances in AI training chips, CTGT aims to focus on a more foundational understanding of AI that can cope with both inefficiency and increasingly complex model decisions. The company plans to use its seed funding to expand its engineering team and refine its platform.\u003c/p\u003e\n\n\n\n\u003cp\u003eEach finalist presented to an audience of 600 industry decision-makers and received feedback from a panel of venture capital judges from Salesforce Ventures, Menlo Ventures, and Amex Ventures.\u003c/p\u003e\n\n\n\n\u003cp\u003eRead about the other winners \u003ca href=\"https://venturebeat.com/ai/catio-wins-coolest-tech-award-at-vb-transform-2025/\"\u003eCatio\u003c/a\u003e and Solo.io. The other finalists were \u003ca href=\"https://kumo.ai/\"\u003eKumo\u003c/a\u003e, \u003ca href=\"http://superduper.io\"\u003eSuperduper.io\u003c/a\u003e, \u003ca href=\"https://withsutro.com/\"\u003eSutro\u003c/a\u003e and \u003ca href=\"https://qdrant.tech/\"\u003eQdrant\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eEditor’s note: As a thank-you to our readers, we’ve opened up early bird registration for VB Transform 2026 — just $200. This is where AI ambition meets operational reality, and you’re going to want to be in the room. \u003ca href=\"https://lu.ma/92nbdnnx\"\u003eReserve your spot now\u003c/a\u003e. \u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "9 min read",
  "publishedTime": "2025-06-28T00:48:46Z",
  "modifiedTime": "2025-06-28T00:48:58Z"
}
