{
  "id": "51fd46ca-cc25-472d-b2c8-46dd3f452e8a",
  "title": "In a Surprise, the SBA Grants Four New SBLC Licenses",
  "link": "https://www.inc.com/melissa-angell/in-a-surprise-the-sba-grants-four-new-sblc-licenses/91070035",
  "description": "It’s the second year in a row that the agency has expanded its roster of small business lenders.",
  "author": "Melissa Angell",
  "published": "Mon, 23 Dec 2024 17:34:38 -0500",
  "source": "https://www.inc.com/rss/",
  "categories": [
    "Money"
  ],
  "byline": "Melissa Angell",
  "length": 3655,
  "excerpt": "It's the second year in a row that the agency has expanded its roster of small business lenders.",
  "siteName": "Inc",
  "favicon": "https://www.inc.com/_public/icons/apple-icon.png",
  "text": "The Small Business Administration on Monday again expanded its lending pool by awarding small-business lending company licenses to four new institutions, as the Biden Administration expands access to government-backed loans. That’s the second year in a row the Small Business Lending Company network has been expanded. Until last year, no new lenders had been added in four decades. The move can’t likely be undone by the incoming Trump Administration. Once a license is awarded, it can’t be walked back unless a lender is engaged in fraudulent activity, is non-compliant, or is not financially sound.The agency announced that Cooperative Business Services, in Cincinnati, Ohio; At10 Capital, in Boise, Idaho; Lafayette Square in Washington D.C., and Stonehenge Capital in Baton Rouge, Louisiana are the recipients of the SBLC licenses. SBLC licenses allow lenders to issue government-backed loans, which aim to boost access to capital by shouldering some of the risk when lending to borrowers deemed more risky, like many small businesses. Skeptics of the SBA’s recent actions argue that the agency should be more cautious as charge-offs begin to tick up within its 7(a) loan program. “As a result of all these changes at the same time it’s very difficult to pinpoint the primary drivers of early stage defaults increasing considerably — but this is not a healthy sign for the program,” says Ami Kassar, the co-founder of MultiFunding. The SBA’s charge-off rate for 7(a) loans clocked in at 0.56 percent in 2024, which is higher compared with the last four years. That’s still in line with the portfolio’s pre-pandemic performance, but critics such as Kassar think the agency is going too far too fast. “The SBA should be slowing down now to get a handle on the data and make some tough decisions,” Kassar adds. “This decision to add four more licenses now compounds this challenge, and will make it more difficult for the next SBA administration team to make decisions and take appropriate action.”The number of SBLC licenses had been capped at 14 since 1982. But all that changed last year when a new SBA rule lifted a 40-year moratorium that prevented it from inviting any new lenders into the fold for the flagship 7(a) and 504 programs. The agency awarded three new licenses last year.Controversy struck earlier this year when a 2023 SBLC license recipient, the Denver-based small business lending platform Funding Circle, became the subject of Congressional discussion. Lawmakers claimed that Funding Circle planned to sell its SBLC license and that it had an active Chinese investor. Funding Circle denied both claims, but lawmakers continued to cast doubt when learning that Funding Circle’s parent company, the United Kingdom-based Funding Circle Holdings, was exploring a sale of its Denver arm. That happened. Funding Circle relinquished its SBLC license this past June after it was purchased by iBusiness Funding, another small business lender that already had an SBLC license. While many thought that there was just one SBLC license up for grabs, Monday’s news reveals that actually, in the SBA’s eyes, there were four. All four SBLC recipients celebrated the news in statements on Monday, with all pledging to increase access to capital for the country’s entrepreneurs.“With private markets playing an increasingly important role in small business lending, this expansion delivers against the Biden-Harris Administration’s unwavering commitment to providing affordable financing to the incredible entrepreneurs and new business starts revitalizing Main Streets across America,” outgoing SBA Administrator Isabel Guzman said in a statement.",
  "image": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2024/12/sba-sblc-license-inc-1374489013.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\u003cp\u003eThe Small Business Administration on Monday again expanded its lending pool \u003ca href=\"https://www.inc.com/melissa-angell/sba-expands-its-lending-network-to-spur-access-to-capital-for-underrepresented-founders.html\"\u003eby awarding small-business lending company licenses\u003c/a\u003e to four new institutions, as the Biden Administration expands access to government-backed loans. \u003c/p\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eThat’s the second year in a row the Small Business Lending Company network has been expanded. Until last year, no new lenders had been added in four decades. The move can’t likely be undone by the incoming Trump Administration. Once a license is awarded, it can’t be walked back unless a lender is engaged in fraudulent activity, is non-compliant, or is not financially sound.\u003c/p\u003e\u003cp\u003eThe agency announced that Cooperative Business Services, in Cincinnati, Ohio; At10 Capital, in Boise, Idaho; Lafayette Square in Washington D.C., and Stonehenge Capital in Baton Rouge, Louisiana are the recipients of the SBLC licenses. SBLC licenses allow lenders to issue government-backed loans, which aim to boost access to capital by shouldering some of the risk when lending to borrowers deemed more risky, like many small businesses.\u003c/p\u003e\u003cp\u003e Skeptics of the SBA’s recent actions argue that the agency should be more cautious as charge-offs begin to tick up within its 7(a) loan program. “As a result of all these changes at the same time it’s very difficult to pinpoint the primary drivers of early stage defaults increasing considerably — but this is not a healthy sign for the program,” says Ami Kassar, the co-founder of MultiFunding. The SBA’s charge-off rate for 7(a) loans clocked in at 0.56 percent in 2024, which is higher compared with the last four years. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eThat’s still in line with the portfolio’s pre-pandemic performance, but critics such as Kassar think the agency is going too far too fast. “The SBA should be slowing down now to get a handle on the data and make some tough decisions,” Kassar adds. “This decision to add four more licenses now compounds this challenge, and will make it more difficult for the next SBA administration team to make decisions and take appropriate action.”\u003c/p\u003e\u003cp\u003eThe number of SBLC licenses had been capped at 14 since 1982. But all that changed last year when a new SBA rule  lifted a 40-year moratorium that prevented it from inviting any new lenders into the fold for the flagship 7(a) and 504 programs. The agency awarded three new licenses last year.\u003c/p\u003e\u003cp\u003eControversy struck earlier this year when a 2023 SBLC license recipient, the Denver-based small business lending platform Funding Circle,\u003ca href=\"https://www.inc.com/melissa-angell/a-small-business-lender-fires-back-at-gop-over-claims-its-tied-to-china.html\"\u003e became the subject of Congressional discussion\u003c/a\u003e. Lawmakers claimed that Funding Circle planned to sell its SBLC license and that it had an active Chinese investor. \u003c/p\u003e\u003c/div\u003e\u003cdiv data-testid=\"content-chunk\"\u003e\u003cp\u003eFunding Circle denied both claims, but lawmakers continued to cast doubt when learning that Funding Circle’s parent company, the United Kingdom-based Funding Circle Holdings, was exploring a sale of its Denver arm. That happened. Funding Circle relinquished its SBLC license\u003ca href=\"https://www.inc.com/melissa-angell/funding-circle-exits-us-surrendering-its-sblc-license.html\"\u003e this past June\u003c/a\u003e after it was purchased by iBusiness Funding, another small business lender that already had an SBLC license. \u003c/p\u003e\u003cp\u003eWhile many thought that there was just one SBLC license up for grabs, Monday’s news reveals that actually, in the SBA’s eyes, there were four. All four SBLC recipients celebrated the news in statements on Monday, with all pledging to increase access to capital for the country’s entrepreneurs.\u003c/p\u003e\u003cp\u003e“With private markets playing an increasingly important role in small business lending, this expansion delivers against the Biden-Harris Administration’s unwavering commitment to providing affordable financing to the incredible entrepreneurs and new business starts revitalizing Main Streets across America,” outgoing SBA Administrator Isabel Guzman said in a statement.\u003c/p\u003e\u003c/div\u003e\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-23T22:34:38Z",
  "modifiedTime": "2024-12-23T22:38:38Z"
}
