{
  "id": "5da09f83-58f0-4cef-aa3a-ac78d138f580",
  "title": "Adopting agentic AI? Build AI fluency, redesign workflows, don’t neglect supervision",
  "link": "https://venturebeat.com/ai/adopting-agentic-ai-build-ai-fluency-redesign-workflows-dont-neglect-supervision/",
  "description": "How can organizations decide how to use human-in-the-loop mechanisms and collaborative frameworks with AI agents?",
  "author": "Imran Aftab, 10Pearls",
  "published": "Sat, 17 May 2025 19:05:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI agents",
    "AI, ML and Deep Learning",
    "Conversational AI",
    "Generative AI",
    "large language models"
  ],
  "byline": "Imran Aftab, 10Pearls",
  "length": 7005,
  "excerpt": "How can organizations decide how to use human-in-the-loop mechanisms and collaborative frameworks with AI agents?",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More The work ecosystem as we know it is about to change, with agents — the “next frontier of generative AI” — set to augment human decision-making for good. At the beginning of the year, the BCG AI Radar global survey said two-thirds of companies are already exploring AI agents.  We’re approaching a new norm where AI systems can process our natural-language prompts and autonomously make decisions, much like a responsible employee. They have the potential to provide solutions to highly complex use cases across industries and business domains, taking over labor-intensive tasks or qualitative and quantitative analysis. But don’t be consumed by the dystopian thinkers, humans and machines can have a symbiotic relationship.  Agentic AI could act as a competent virtual assistant, sifting through data, working across platforms, learning from processes and producing real-time insights or predictions. But, similar to onboarding new recruits, AI agents demand considerable testing, training and guidance before they can operate effectively. So, humans will act as custodians, arguably occupying a more supervisory role. For example, we must ensure adherence to a central governance framework, maintain ethical and security standards, foster a proactive risk response and align decisions with wider company strategic goals.  AI systems are prone to errors and misuse which warrants the need for “human-in-the-loop” control mechanisms. This human accountability for agentic systems is necessary to balance autonomy with risk mitigation. So, how can organizations decide how to use these mechanisms and which collaborative frameworks to put in place? As a founder of an AI-powered digital transformation and product development company helping businesses innovate, automate and scale, here’s a short guide.  1: Empower your workforce with AI fluency AI upskilling is still majorly under-prioritized across organizations. Did you know that less than one-third of companies have trained even a quarter of their staff to use AI? How do leaders expect employees to feel empowered to use AI if education isn’t presented as the priority?  Maintaining a nimble and knowledgeable workforce is critical, fostering a culture that embraces technological change. Team collaboration in this sense could take the form of regular training about agentic AI, highlighting its strengths and weaknesses and focusing on successful human-AI collaborations. For more established companies, role-based training courses could successfully show employees in different capacities and roles to use generative AI appropriately.  Executives should make sure a feedback mechanism is in place to optimize this human-AI collaboration. By having employees actively participate in error identification and mitigation, they can develop an attitude of appreciation toward evolving technologies while also seeing the importance of continuous learning. AI fluency also comes from collaboration across departments and specialists; for example, between engineers, AI specialists and developers. They must share knowledge and concerns to effectively integrate agentic AI into workflows. For your workforce to feel empowered, there must be a mindset change: We don’t need to compete with AI, we (and our cognitive abilities) are evolving with it.  2. Redesign your workflows around agentic AI According to a recent McKinsey survey, redesigning workflows when implementing generative AI has had the most significant impact on earnings before interest and tax (EBIT) in organizations of all sizes. In other words: AI’s true value comes when companies rewire how they run. For example, executives whose companies have successfully generated significant value from AI projects often adopt quite a targeted approach. The VPs of product or engineering usually concentrate on a limited number of key AI initiatives at any given time, rather than spreading resources thinly. The strategy involves a dedication to upskilling, as well as a complete overhaul of core business processes and aggressive scaling, keeping a keen eye on financial and operational performance. Although machines can’t be left entirely unattended and humans can’t stay on top of processing data in real-time, constant human-AI collaboration may not be the answer to everything when redesigning workflows. Researchers at the MIT Center for Collective Intelligence, for instance, found that sometimes a combination is most effective; or sometimes, just humans – or just AI – on their own. The co-authors found a clear division of labor: Humans excel in subtasks requiring “contextual understanding and emotional intelligence,” whereas AI systems thrive when subtasks are “repetitive, high-volume or data-driven.”  3. Develop new ‘supervising’ AI roles Although gen AI will not substantially affect organizations’ workforce sizes in the short-term, we should still expect an evolution of role titles and responsibilities. For example, from service operations and product development to AI ethics and AI model validation positions.  For this shift to successfully happen, executive-level buy-in is paramount. Senior leaders need a clearly-defined organization-wide strategy, including a dedicated team to drive gen AI adoption. We’ve seen that when senior leaders delegate AI integration solely to IT or digital technology teams, the business context can be neglected. So, business leaders must be more actively engaged; for example, they can occupy roles like AI governance oversight to guarantee ethical and strategic alignment.  When recruiting, business leaders should seek candidates who are: 1) Adept at testing for model bias to ensure accuracy and identification of problems early in AI development; and 2) Experienced in cross-departmental collaboration, to ensure that AI solutions are meeting all the team’s needs. If you are an SVP or CTO — and unsure where to start — you may need a strategic partner to gain access to quality talent. This is table stakes to build enterprise-grade, AI-powered technology products to de-risk AI adoption. Conclusion Looking ahead, successful organizations will be defined by their ability to present a vision of a workplace where humans and AI co-create. Leaders must prioritize building collaborative frameworks that leverage AI’s strengths while empowering human creativity and judgment.  Imran Aftab is co-Founder and CEO of 10Pearls. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/05/handshake.webp?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eThe work ecosystem as we know it is about to change, with agents — the “\u003ca href=\"https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/why-agents-are-the-next-frontier-of-generative-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003enext frontier of generative AI\u003c/a\u003e” — set to augment human decision-making for good. At the beginning of the year, the \u003ca href=\"https://www.bcg.com/publications/2025/closing-the-ai-impact-gap\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eBCG AI Radar global survey\u003c/a\u003e said two-thirds of companies are already exploring AI agents. \u003c/p\u003e\n\n\n\n\u003cp\u003eWe’re approaching a new norm where AI systems can process our natural-language prompts and autonomously make decisions, much like a responsible employee. They have the potential to provide solutions to highly complex use cases across industries and business domains, taking over labor-intensive tasks or qualitative and quantitative analysis. But don’t be consumed by the dystopian thinkers, humans and machines can have a \u003ca href=\"http://v\"\u003esymbiotic relationship\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eAgentic AI could act as a competent virtual assistant, sifting through data, working across platforms, learning from processes and producing real-time insights or predictions. But, similar to onboarding new recruits, AI agents demand considerable testing, training and guidance before they can operate effectively. So, humans will act as custodians, arguably occupying a more supervisory role. For example, we must ensure adherence to a central governance framework, maintain ethical and security standards, foster a proactive risk response and align decisions with wider company strategic goals.\u003cstrong\u003e \u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eAI systems are prone to errors and misuse which warrants the need for “human-in-the-loop” control mechanisms. This human accountability for \u003ca href=\"https://venturebeat.com/ai/not-everything-needs-an-llm-a-framework-for-evaluating-when-ai-makes-sense/\"\u003eagentic systems\u003c/a\u003e is necessary to balance autonomy with risk mitigation. So, how can organizations decide how to use these mechanisms and which collaborative frameworks to put in place? As a founder of an AI-powered digital transformation and product development company helping businesses innovate, automate and scale, here’s a short guide. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-1-empower-your-workforce-with-ai-fluency\"\u003e1: Empower your workforce with AI fluency\u003c/h2\u003e\n\n\n\n\u003cp\u003eAI upskilling is still majorly under-prioritized across organizations. Did you know that less than one-third of companies have trained even a quarter of their staff to use AI? How do leaders expect employees to feel empowered to use AI if education isn’t presented as the priority? \u003c/p\u003e\n\n\n\n\u003cp\u003eMaintaining a nimble and knowledgeable workforce is critical, fostering a culture that embraces technological change. Team collaboration in this sense could take the form of regular training about agentic AI, highlighting its strengths and weaknesses and focusing on successful human-AI collaborations. For more established companies, role-based training courses could successfully show employees in different capacities and roles to use \u003ca href=\"https://venturebeat.com/ai/mcp-and-the-innovation-paradox-why-open-standards-will-save-ai-from-itself/\"\u003egenerative AI appropriately\u003c/a\u003e. \u003c/p\u003e\n\n\n\n\u003cp\u003eExecutives should make sure a feedback mechanism is in place to optimize this human-AI collaboration. By having employees actively participate in error identification and mitigation, they can develop an attitude of appreciation toward evolving technologies while also seeing the importance of continuous learning.\u003c/p\u003e\n\n\n\n\u003cp\u003eAI fluency also comes from collaboration across departments and specialists; for example, between engineers, AI specialists and developers. They must share knowledge and concerns to effectively integrate agentic AI into workflows. For your workforce to feel empowered, there must be a mindset change: We don’t need to compete with AI, we (and our cognitive abilities) are evolving with it. \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-2-redesign-your-workflows-around-agentic-ai\"\u003e2. Redesign your workflows around agentic AI\u003c/h2\u003e\n\n\n\n\u003cp\u003eAccording to a recent \u003ca href=\"https://www.mckinsey.com/capabilities/quantumblack/our-insights/the-state-of-ai\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMcKinsey survey\u003c/a\u003e, redesigning workflows when implementing generative AI has had the most significant impact on earnings before interest and tax (EBIT) in organizations of all sizes. In other words: AI’s true value comes when companies rewire how they run.\u003c/p\u003e\n\n\n\n\u003cp\u003eFor example, executives whose companies have successfully generated significant value from AI projects often adopt quite a targeted approach. The VPs of product or engineering usually concentrate on a limited number of \u003ca href=\"https://venturebeat.com/ai/is-your-ai-product-actually-working-how-to-develop-the-right-metric-system/\"\u003ekey AI initiatives\u003c/a\u003e at any given time, rather than spreading resources thinly. The strategy involves a dedication to upskilling, as well as a complete overhaul of core business processes and aggressive scaling, keeping a keen eye on financial and operational performance.\u003c/p\u003e\n\n\n\n\u003cp\u003eAlthough machines can’t be left entirely unattended and humans can’t stay on top of processing data in real-time, constant human-AI collaboration may not be the answer to everything when redesigning workflows. Researchers at the MIT Center for Collective Intelligence, for instance, found that sometimes a combination is most effective; or sometimes, just \u003ca href=\"https://mitsloan.mit.edu/ideas-made-to-matter/when-humans-and-ai-work-best-together-and-when-each-better-alone\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ehumans – or just AI – on their own\u003c/a\u003e. The co-authors found a clear division of labor: Humans excel in subtasks requiring “contextual understanding and emotional intelligence,” whereas AI systems thrive when subtasks are “repetitive, high-volume or data-driven.” \u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-3-develop-new-supervising-ai-roles\"\u003e3. Develop new ‘supervising’ AI roles\u003c/h2\u003e\n\n\n\n\u003cp\u003eAlthough gen AI will not substantially affect organizations’ workforce sizes in the short-term, we should still expect an evolution of role titles and responsibilities. For example, from service operations and product development to AI ethics and AI model validation positions. \u003c/p\u003e\n\n\n\n\u003cp\u003eFor this shift to successfully happen, executive-level buy-in is paramount. Senior leaders need a clearly-defined organization-wide strategy, including a dedicated team to drive gen AI adoption. We’ve seen that when senior leaders delegate AI integration solely to IT or digital technology teams, the business context can be neglected. So, business leaders must be more actively engaged; for example, they can occupy roles like AI governance oversight to guarantee ethical and strategic alignment. \u003c/p\u003e\n\n\n\n\u003cp\u003eWhen recruiting, business leaders should seek candidates who are: 1) Adept at testing for model bias to ensure accuracy and identification of problems early in AI development; and 2) Experienced in cross-departmental collaboration, to ensure that AI solutions are meeting all the team’s needs. If you are an SVP or CTO — and unsure where to start — you may need a strategic partner to gain access to quality talent. This is table stakes to build enterprise-grade, AI-powered technology products to de-risk AI adoption.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-conclusion\"\u003eConclusion\u003c/h2\u003e\n\n\n\n\u003cp\u003eLooking ahead, successful organizations will be defined by their ability to present a vision of a workplace where humans and AI co-create. Leaders must prioritize building collaborative frameworks that leverage AI’s strengths while empowering human creativity and judgment. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eImran Aftab is co-Founder and CEO of \u003c/em\u003e\u003ca href=\"https://10pearls.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003e10Pearls\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "8 min read",
  "publishedTime": "2025-05-17T19:05:00Z",
  "modifiedTime": "2025-05-16T20:33:36Z"
}
