{
  "id": "6ad57787-2576-4552-81e5-25b5ddfee049",
  "title": "How advanced foundation models will expand what AI can do (and other predictions for 2025)",
  "link": "https://venturebeat.com/ai/how-advanced-foundation-models-will-expand-what-ai-can-do-and-other-predictions-for-2025/",
  "description": "Foundation models will be brand DNA, hands-free will be redefined and we'll hit the AI trust tipping point (among other developments).",
  "author": "Martina Lauchengco, Costanoa Venture Capital",
  "published": "Sat, 28 Dec 2024 21:25:00 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "DataDecisionMakers",
    "AI, ML and Deep Learning",
    "category-/News",
    "Conversational AI",
    "foundation models",
    "Generative AI",
    "large language models",
    "NLP"
  ],
  "byline": "Martina Lauchengco, Costanoa Venture Capital",
  "length": 5911,
  "excerpt": "Foundation models will be brand DNA, hands-free will be redefined and we'll hit the AI trust tipping point (among other developments).",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "December 28, 2024 1:25 PM VentureBeat/Ideogram Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More Why read AI predictions from not-Sam-Altman and not-AI-PhD? Well, early stage VCs spend their days working with people far smarter than us who use AI at the bleeding edge of what’s possible. This allows us to see a version of what the future could hold.  In my 30-plus years in tech, I have never seen a technology — specifically the advancements in and around foundation models — have this much impact in this many ways, this quickly. It’s reframed my expectations of how teams build and how companies deliver value.  That in mind, here are my predictions for 2025. We attempt AI containment I love Mustafa Suleyman’s digital species corollary for AI because it properly frames the question of containment. Much of present-day AI in products suggests courses of action. But increasingly, AI will take actions on our behalf. We must frame what we don’t want it to do.  Expect a lot of loud cage rattling in this area. If we use California’s failed SB1047 legislation as a bellwether, Elon Musk’s pro-regulation and Trump’s anti-regulation stances will be offsetting penalties. Look for things like Anthropic’s constitution model on steroids as the industry attempts “self-regulation” for foundation model safety to avoid government regulation. Likewise, expect a flourishing of AI security startups to help with forms of cyber containment. Foundation models as brand DNA Some of you may remember the days of “Intel Inside” as a big campaign. Foundation models will accrue brand power to products building on them. This goes beyond tone of voice, which, according to Claude, looks like this today:  GPT-4: The premium, measured consultant. Claude: The careful, ethical advisor. Llama: The scrappy, flexible generalist. Tone is tunable. How understanding and recall is applied in a model is not. Models will inevitably shape how products “feel.” AI for the Nobel Not quite, but the ability to iterate in scientific discovery will increase massively. Today, AI enables breakthroughs together with humans. I agree with Vinod Khosla on this: AI scientists — AI agents that are hyper-specialists — will soon regularly best their human counterparts in discovering insights.  This is because AI scientists don’t need breaks. They have infinite patience for iteration. They have perfect memory for data. And they can work 24/7. Look to see the first glimpses of this relentless work ethic in medical discovery and healthcare breakthroughs, with a slew of startups helping companies take advantage of them. Audio interfaces redefine ‘hands-free’ If Alexa, Siri and Google Assistant were all v1.0 audio interfaces, audio — with the additional context of visuals and text — will spin up whole new product experiences that recalibrate our standards.  Specialized audio-only foundation models are racing with the larger foundation models to push what’s possible here. We’re already seeing huge progress in Meta’s Smart Glasses and how far they’ve come from Google Glass. ‘Hands-free’ operation will have a whole new meaning — and expectations. We cross the trust tipping point with gen AI I have a good sense of direction. It only took getting stuck in a few traffic jams I didn’t know about — but my mapping app did — before I capitulated, finally trusting that mapping apps know routes better than I do.  The same will happen with generative AI outputs. Right now, experts still eke out superior results. That gap will close, and we’ll capitulate to more of gen AI’s outputs, assuming they’re at least on par and sometimes better than even experts. They’ll get credit in the same way we cite those we quote. Case in point: See the brand section of this article. We pay a premium for hand-craftsmanship With the threshold for creation being lower — Dall-E and a slew of other tools create new designs in seconds — non-digital goods with evidence of human creation will increase in value. Think of original photography or visual design, but also that ceramic mug crafted by an artist, not stamped out by a robot in a factory. My adult kids marvel at VCRs and love vinyl, but this is beyond vintage being cool. In a world that is so digital, analog and physical become meaningful in ways that will surprise, especially for the Gen Z and Gen Alpha set. ‘Humans found here’ A lot of my friends love Waymo because it doesn’t require them to talk to anyone. But when push comes to shove, the ability to interact with a human who can exercise judgment not based on black-box logic is important. Which approach — AI or human-forward — has more value will become a dividing line. Expect to see backlash in areas like customer service where the rush to AI will frustrate many. Humans-in-the-loop will be viewed as preferable to fully autonomous systems. Companies (and consumers) will promote and value the distinction. What a year… I’m ending 2024 humbled and expecting a lot of chaos in 2025. But I’m an optimist and take heart in the fact that I remain surrounded by really smart people trying to build great companies and make things better. Wishing you humility, joy and a whole lot of grace in the year to come.  Martina Lauchengco is a partner at Costanoa Ventures. DataDecisionMakers Welcome to the VentureBeat community! DataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation. If you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers. You might even consider contributing an article of your own! Read More From DataDecisionMakers",
  "image": "https://venturebeat.com/wp-content/uploads/2024/12/a-photo-of-a-sophisticated-ai-robot-with_9dCTKAKeTna32rjVUok6ww_yXyDUsDKRQKTVP8ucm99dw-transformed.jpeg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-12-28T21:25:00+00:00\" datetime=\"2024-12-28T21:25:00+00:00\"\u003eDecember 28, 2024 1:25 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"421\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/a-photo-of-a-sophisticated-ai-robot-with_9dCTKAKeTna32rjVUok6ww_yXyDUsDKRQKTVP8ucm99dw-transformed.jpeg?w=750\" alt=\"VentureBeat/Ideogram\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eVentureBeat/Ideogram\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003eWhy read \u003ca href=\"https://venturebeat.com/ai/unintended-consequences-u-s-election-results-herald-reckless-ai-development/\"\u003eAI predictions\u003c/a\u003e from not-Sam-Altman and not-AI-PhD? Well, early stage VCs spend their days working with people far smarter than us who use AI at the bleeding edge of what’s possible. This allows us to see a version of what the future could hold. \u003c/p\u003e\n\n\n\n\u003cp\u003eIn my 30-plus years in tech, I have never seen a technology — specifically the advancements in and around foundation models — have this much impact in this many ways, this quickly. It’s reframed my expectations of how teams build and how companies deliver value. \u003c/p\u003e\n\n\n\n\u003cp\u003eThat in mind, here are my predictions for 2025.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-we-attempt-ai-containment\"\u003eWe attempt AI containment\u003c/h2\u003e\n\n\n\n\u003cp\u003eI love Mustafa Suleyman’s \u003ca href=\"https://mastersofscale.com/is-ai-a-new-species-microsofts-mustafa-suleyman-thinks-so/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003edigital species corollary\u003c/a\u003e for AI because it properly frames the question of containment. Much of present-day AI in products suggests courses of action. But increasingly, AI will take actions on our behalf. We must frame what we \u003cem\u003edon’t\u003c/em\u003e want it to do. \u003c/p\u003e\n\n\n\n\u003cp\u003eExpect a lot of loud cage rattling in this area. If we use California’s failed SB1047 legislation as a bellwether, Elon Musk’s pro-regulation and Trump’s anti-regulation stances will be offsetting penalties. Look for things like \u003ca href=\"https://venturebeat.com/ai/anthropics-agentic-computer-use-is-giving-people-superpowers/\"\u003eAnthropic’s\u003c/a\u003e constitution model on steroids as the industry attempts “self-regulation” for foundation model safety to avoid government regulation. Likewise, expect a flourishing of AI security startups to help with forms of cyber containment.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-foundation-models-as-brand-dna\"\u003eFoundation models as brand DNA\u003c/h2\u003e\n\n\n\n\u003cp\u003eSome of you may remember the days of “Intel Inside” as a big campaign. \u003ca href=\"https://venturebeat.com/ai/large-language-overkill-how-slms-can-beat-their-bigger-resource-intensive-cousins/\"\u003eFoundation models\u003c/a\u003e will accrue brand power to products building on them. This goes beyond tone of voice, which, according to Claude, looks like this today: \u003c/p\u003e\n\n\n\n\u003cul\u003e\n\u003cli\u003eGPT-4: The premium, measured consultant.\u003c/li\u003e\n\n\n\n\u003cli\u003eClaude: The careful, ethical advisor.\u003c/li\u003e\n\n\n\n\u003cli\u003eLlama: The scrappy, flexible generalist.\u003c/li\u003e\n\u003c/ul\u003e\n\n\n\n\u003cp\u003eTone is tunable. How understanding and recall is applied in a model is not. Models will inevitably shape how products “feel.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-ai-for-the-nobel\"\u003eAI for the Nobel\u003c/h2\u003e\n\n\n\n\u003cp\u003eNot quite, but the ability to iterate in scientific discovery will increase massively. Today, AI enables breakthroughs together with humans. I agree with \u003ca href=\"https://www.linkedin.com/in/vinod-khosla-65387416/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eVinod Khosla\u003c/a\u003e on this: AI scientists — AI agents that are hyper-specialists — will soon regularly best their human counterparts in discovering insights. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis is because AI scientists don’t need breaks. They have infinite patience for iteration. They have perfect memory for data. And they can work 24/7. Look to see the first glimpses of this relentless work ethic in medical discovery and healthcare breakthroughs, with a slew of startups helping companies take advantage of them.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-audio-interfaces-redefine-hands-free\"\u003eAudio interfaces redefine ‘hands-free’\u003c/h2\u003e\n\n\n\n\u003cp\u003eIf Alexa, Siri and Google Assistant were all v1.0 audio interfaces, audio — with the additional context of visuals and text — will spin up whole new product experiences that recalibrate our standards. \u003c/p\u003e\n\n\n\n\u003cp\u003eSpecialized audio-only \u003ca href=\"https://venturebeat.com/ai/weve-come-a-long-way-from-rpa-how-ai-agents-are-revolutionizing-automation/\"\u003efoundation models\u003c/a\u003e are racing with the larger foundation models to push what’s possible here. We’re already seeing huge progress in Meta’s Smart Glasses and how far they’ve come from Google Glass. ‘Hands-free’ operation will have a whole new meaning — and expectations.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-we-cross-the-trust-tipping-point-with-gen-ai\"\u003eWe cross the trust tipping point with gen AI\u003c/h2\u003e\n\n\n\n\u003cp\u003eI have a good sense of direction. It only took getting stuck in a few traffic jams I didn’t know about — but my mapping app did — before I capitulated, finally trusting that mapping apps know routes better than I do. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe same will happen with generative AI outputs. Right now, experts still eke out superior results. That gap will close, and we’ll capitulate to more of gen AI’s outputs, assuming they’re at least on par and sometimes better than even experts. They’ll get credit in the same way we cite those we quote. Case in point: See the brand section of this article.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-we-pay-a-premium-for-hand-craftsmanship\"\u003eWe pay a premium for hand-craftsmanship\u003c/h2\u003e\n\n\n\n\u003cp\u003eWith the threshold for creation being lower — Dall-E and a slew of other tools create new designs in seconds — non-digital goods with evidence of human creation will increase in value. Think of original photography or visual design, but also that ceramic mug crafted by an artist, not stamped out by a robot in a factory.\u003c/p\u003e\n\n\n\n\u003cp\u003eMy adult kids marvel at VCRs and love vinyl, but this is beyond vintage being cool. In a world that is so digital, analog and physical become meaningful in ways that will surprise, especially for the Gen Z and Gen Alpha set.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-humans-found-here\"\u003e‘Humans found here’\u003c/h2\u003e\n\n\n\n\u003cp\u003eA lot of my friends love Waymo because it doesn’t require them to talk to anyone. But when push comes to shove, the ability to interact with a human who can exercise judgment not based on black-box logic is important. Which approach — AI or human-forward — has more value will become a dividing line.\u003c/p\u003e\n\n\n\n\u003cp\u003eExpect to see backlash in areas like customer service where the rush to AI will frustrate many. Humans-in-the-loop will be viewed as preferable to fully autonomous systems. Companies (and consumers) will promote and value the distinction.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-a-year\"\u003eWhat a year…\u003c/h2\u003e\n\n\n\n\u003cp\u003eI’m ending 2024 humbled and expecting a lot of chaos in 2025. But I’m an optimist and take heart in the fact that I remain surrounded by really smart people trying to build great companies and make things better. Wishing you humility, joy and a whole lot of grace in the year to come. \u003c/p\u003e\n\n\n\n\u003cp\u003e\u003cem\u003eMartina Lauchengco is a partner at \u003c/em\u003e\u003ca href=\"https://costanoa.vc/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003e\u003cem\u003eCostanoa Ventures\u003c/em\u003e\u003c/a\u003e\u003cem\u003e.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2736392\"\u003e\n\u003cp\u003e\u003cstrong\u003eDataDecisionMakers\u003c/strong\u003e\u003c/p\u003e\n\n\n\n\u003cp\u003eWelcome to the VentureBeat community!\u003c/p\u003e\n\n\n\n\u003cp\u003eDataDecisionMakers is where experts, including the technical people doing data work, can share data-related insights and innovation.\u003c/p\u003e\n\n\n\n\u003cp\u003eIf you want to read about cutting-edge ideas and up-to-date information, best practices, and the future of data and data tech, join us at DataDecisionMakers.\u003c/p\u003e\n\n\n\n\u003cp\u003eYou might even consider \u003ca rel=\"noreferrer noopener\" target=\"_blank\" href=\"https://venturebeat.com/guest-posts/\"\u003econtributing an article\u003c/a\u003e of your own!\u003c/p\u003e\n\n\n\n\u003cp\u003e\u003ca rel=\"noreferrer noopener\" href=\"https://venturebeat.com/category/DataDecisionMakers/\" target=\"_blank\"\u003eRead More From DataDecisionMakers\u003c/a\u003e\u003c/p\u003e\n\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "7 min read",
  "publishedTime": "2024-12-28T21:25:00Z",
  "modifiedTime": "2024-12-28T21:26:07Z"
}
