{
  "id": "79be4160-f229-480e-ae47-b8ba8d1e41c9",
  "title": "Making mapping software user-friendly",
  "link": "https://springwise.com/innovation/computing-tech/making-mapping-and-geospatial-analysis-affordable-and-accessible/",
  "description": "The platform is more affordable and accessible than traditional tools",
  "author": "Matthew Hempstead",
  "published": "Fri, 06 Dec 2024 05:55:00 +0000",
  "source": "https://www.springwise.com/feed",
  "categories": null,
  "byline": "",
  "length": 2758,
  "excerpt": "The platform is more affordable and accessible than traditional tools",
  "siteName": "Springwise",
  "favicon": "",
  "text": "| Photo source Atlas.co Innovation Computing \u0026 Tech Making mapping software user-friendly Computing \u0026 Tech The platform is more affordable and accessible than traditional tools Spotted: Companies across virtually every industry will, at some point, need to make sense of complex location-based data. However, traditional Geographic Information System (GIS) software – which integrates relevant information onto digital maps to help users visualise the data – can be expensive and inaccessible, compromising an organisation’s ability to act on information and make decisions effectively. Now, Atlas.co wants to change that. The Norwegian startup, which was founded back in 2021 by a group of then-university students, wants to make geospatial analysis simple and accessible with its browser-based platform. Technical GIS tools may be powerful, but they tend to be too cumbersome and complicated for non-experts to install and use. Atlas.co, on the other hand, is user-friendly and requires no specialised hardware or software installation. The cleanly designed interface features a builder tool where users can easily drag and build spatial maps and interactive dashboards. Users can then upload and layer on the data they want to visualise and style it accordingly. As Co-founder Vegard Løwe explained to Springwise: “We wanted to build a solution that anyone could use to unlock the potential of geospatial data, enabling impactful outcomes like improved infrastructure planning and sustainability efforts.” And as well as being easier to use, Atlas.co was also built with collaboration in mind: multiple users can create, share, and update maps together in real time. This kind of approach could transform the way teams and individuals tackle various challenges, including resource optimisation, disaster response, and sustainable planning. It’s also applicable across industries, whether that’s helping retailers better understand their customers in a specific location, speeding up the development of renewable energy projects, or helping to predict potential habitats for endangered species. The company recently completed a $2 million pre-seed funding round, and Løwe shared that Atlas.co next plans to expand integrations with popular tools and refine its AI-driven features to make mapping even smarter and faster. Written By: Matilda Cox 6th December 2024 Email: help@atlas.co Website: atlas.co",
  "image": "https://springwise.com/wp-content/uploads/2024/12/innovationcomputing-techmaking-mapping-and-geospatial-analysis-affordable-and-accessible.jpg",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003carticle\u003e\n\n    \n    \u003cfigure\u003e\n        \u003cimg src=\"https://springwise.com/wp-content/uploads/2024/12/innovationcomputing-techmaking-mapping-and-geospatial-analysis-affordable-and-accessible.jpg\" alt=\"\"/\u003e\n        \u003cfigcaption\u003e \n            | Photo source \u003ca href=\"https://atlas.co/\" target=\"_blank\"\u003eAtlas.co\u003c/a\u003e\n        \u003c/figcaption\u003e\n    \u003c/figure\u003e\n\n     \u003cul\u003e\n        \u003cli\u003e\n            \u003ca href=\"https://springwise.com/search?type=innovation\"\u003eInnovation\u003c/a\u003e\n        \u003c/li\u003e\n        \u003cli\u003e\n            \u003ca href=\"https://springwise.com/search?type=innovation\u0026amp;sector=computing\"\u003eComputing \u0026amp; Tech\u003c/a\u003e\n        \u003c/li\u003e\n        \u003cli\u003e\n            \u003cp\u003eMaking mapping software user-friendly\u003c/p\u003e\n        \u003c/li\u003e\n    \u003c/ul\u003e\n\n    \u003csection\u003e\n\n        \u003cheader\u003e\n            \n            \u003cul\u003e\n                \u003cli\u003e\n                    \u003cimg src=\"https://springwise.com/wp-content/uploads/2018/05/norway.png\" alt=\"\"/\u003e\n                \u003c/li\u003e\n            \u003c/ul\u003e\n            \u003cp\u003eComputing \u0026amp; Tech\u003c/p\u003e\n        \u003c/header\u003e\n\n        \u003ch3\u003eThe platform is more affordable and accessible than traditional tools\u003c/h3\u003e\n        \u003cdiv\u003e\n            \u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eSpotted: \u003c/strong\u003eCompanies across virtually every industry will, at some point, need to make sense of complex location-based data. However, traditional Geographic Information System (GIS) software – which integrates relevant information onto digital maps to help users visualise the data – can be expensive and inaccessible, compromising an organisation’s ability to act on information and make decisions effectively. Now, Atlas.co wants to change that.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe Norwegian startup, which was founded back in 2021 by a group of then-university students, wants to make geospatial analysis simple and accessible with its browser-based platform. Technical GIS tools may be powerful, but they tend to be too cumbersome and complicated for non-experts to install and use. Atlas.co, on the other hand, is user-friendly and requires no specialised hardware or software installation.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe cleanly designed interface features a builder tool where users can easily drag and build spatial maps and interactive dashboards. Users can then upload and layer on the data they want to visualise and style it accordingly. As Co-founder Vegard Løwe explained to Springwise: “We wanted to build a solution that anyone could use to unlock the potential of geospatial data, enabling impactful outcomes like improved infrastructure planning and sustainability efforts.”\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd as well as being easier to use, Atlas.co was also built with collaboration in mind: multiple users can create, share, and update maps together in real time. This kind of approach could transform the way teams and individuals tackle various challenges, including resource optimisation, disaster response, and sustainable planning. It’s also applicable across industries, whether that’s helping retailers better understand their customers in a specific location, speeding up the development of renewable energy projects, or helping to predict potential habitats for endangered species.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe company recently completed a $2 million pre-seed funding round, and Løwe shared that Atlas.co next plans to expand integrations with popular tools and refine its AI-driven features to make mapping even smarter and faster.\u003c/p\u003e\n\n\n\n\u003cp\u003eWritten By: Matilda Cox\u003c/p\u003e\n\u003c/div\u003e\n            \u003csection\u003e\n                \u003cp\u003e6th December 2024\u003c/p\u003e\n                \u003cp\u003eEmail: \u003ca target=\"_blank\" href=\"mailto:help@atlas.co\"\u003ehelp@atlas.co\u003c/a\u003e\u003c/p\u003e\n                \u003cp\u003eWebsite: \u003ca target=\"_blank\" href=\"https://atlas.co/\"\u003eatlas.co\u003c/a\u003e\u003c/p\u003e\n            \u003c/section\u003e\n        \u003c/div\u003e\n\n    \u003c/section\u003e\n    \n    \n\n    \n    \n\n\n          \n\n\n\u003c/article\u003e\u003c/div\u003e",
  "readingTime": "4 min read",
  "publishedTime": "2024-12-06T05:55:00Z",
  "modifiedTime": "2024-12-05T17:53:10Z"
}
