{
  "id": "92b370f0-e5c7-4122-85cf-943d6ec1ed50",
  "title": "MidJourney adds Pinterest-like ‘moodboards’ and support for multiple custom AI image models",
  "link": "https://venturebeat.com/ai/midjourney-adds-pinterest-like-moodboards-and-support-for-multiple-custom-ai-image-models/",
  "description": "Moodboards enable users to upload curated collections of images that act as inspiration for generating new art.",
  "author": "Carl Franzen",
  "published": "Mon, 16 Dec 2024 22:16:15 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "AI",
    "Business",
    "AI art",
    "ai art generators",
    "ai artwork",
    "ai image generation",
    "AI, ML and Deep Learning",
    "Conversational AI",
    "Midjourney",
    "midjourney ai",
    "NLP"
  ],
  "byline": "Carl Franzen",
  "length": 3984,
  "excerpt": "Moodboards enable users to upload curated collections of images that act as inspiration for generating new art.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "December 16, 2024 2:16 PM Credit: VentureBeat made with Midjourney Join our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. Learn More MidJourney, the popular AI image generator with more than 19 million users (including several of us at VentureBeat), has introduced new features to enhance user customization. Today, the small company launched Pinterest-inspired “Moodboards” and support for multiple personalization profiles — meaning users can now create and switch between multiple custom versions of Midjourney’s latest image generator AI model, version 6.1, that are tailored to their unique aesthetics. The updates aim to streamline the creative process for individuals and teams, making it easier to integrate personalized styles across various projects. What are Midjourney’s new moodboards? The standout feature, Moodboards, enables users to upload curated collections of images that act as inspiration for generating new art. The AI model adapts to the diversity and complexity of the uploaded images, creating a unique style profile that remixes the visual elements. This addition is complemented by the ability to create multiple personalization profiles, allowing users to organize and deploy their different styles seamlessly. Setting up a custom model has also become significantly faster, with the company claiming a fivefold improvement in image ranking speed. The “ranking” system is how Midjourney trains a custom model on behalf of you, the user. You need to navigate to Midjourney’s image ranker and pick which of a pair of random images you like best, then continue rating pairs of images until you’ve reached a certain threshold where the model understands what kinds of images and aesthetics you like. Users now need just 40 ratings to begin creating a profile, with optimal stability achieved at 200. Previously, you needed 200 to personalize the model. While heavy users may still prefer contributing thousands of ratings for maximum precision, the streamlined process lowers the barrier to entry for new users. Users can begin rating pairs of images over at midjourney.com/personalize. Better organization features The updates also introduce organizational improvements. Users can now name their profiles, designate one or multiple profiles as defaults, and track all images associated with specific profiles. MidJourney emphasizes that these features are particularly beneficial for those juggling multiple projects or collaborating with others. David Holz, founder of MidJourney, shared the announcement on the company’s Discord server earlier today. He explained the motivation behind the updates, expressing a desire to make personalization accessible for a broader range of creative workflows. Holz highlighted that the new tools allow users to take control of their projects while maintaining the flexibility to work with diverse creative teams. As MidJourney continues to refine its personalization infrastructure, the company is soliciting user feedback through its “ideas-and-features” channel. These developments highlight the platform’s commitment to empowering creators with tools that are both intuitive and powerful, marking another step forward in the evolution of AI-assisted creativity. The additions come as expected following Midjourney’s announcement last week of an experimental new collaborative image making whiteboard feature called Patchwork. Daily insights on business use cases with VB Daily If you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI. Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2024/12/cfr0z3n_golden_age_sci-fi_painting_showing_retro_futuristic_wom_b79c69e9-7a3c-4189-885b-27a7a4e416bd.png?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2024-12-16T22:16:15+00:00\" datetime=\"2024-12-16T22:16:15+00:00\"\u003eDecember 16, 2024 2:16 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"420\" src=\"https://venturebeat.com/wp-content/uploads/2024/12/cfr0z3n_golden_age_sci-fi_painting_showing_retro_futuristic_wom_b79c69e9-7a3c-4189-885b-27a7a4e416bd.png?w=750\" alt=\"golden age sci-fi painting showing retro futuristic woman in spacesuit standing in control room beside robot gazing at giant display of numerous abstract artworks\"/\u003e\u003c/p\u003e\u003cp\u003e\u003cspan\u003eCredit: VentureBeat made with Midjourney\u003c/span\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cdiv id=\"boilerplate_2682874\"\u003e\n\u003cp\u003e\u003cem\u003eJoin our daily and weekly newsletters for the latest updates and exclusive content on industry-leading AI coverage. \u003ca href=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\" data-type=\"link\" data-id=\"https://venturebeat.com/newsletters/?utm_source=VBsite\u0026amp;utm_medium=desktopNav\"\u003eLearn More\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n\n\n\n\u003chr/\u003e\n\u003c/div\u003e\u003cp\u003e\u003ca href=\"https://www.midjourney.com/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003eMidJourney\u003c/a\u003e, the popular AI image generator with \u003ca href=\"https://socialcapitalmarkets.net/crypto-trading/discord-statistics/\"\u003emore than 19 million users\u003c/a\u003e (including several of us at VentureBeat), has introduced new features to enhance user customization. \u003c/p\u003e\n\n\n\n\u003cp\u003eToday, the small company launched Pinterest-inspired “Moodboards” and support for multiple personalization profiles — meaning users can now create and switch between multiple custom versions of \u003ca href=\"https://venturebeat.com/ai/midjourney-v6-is-here-with-in-image-text-and-completely-overhauled-prompting/\"\u003eMidjourney’s latest image generator AI model, version 6.1\u003c/a\u003e,  that are tailored to their unique aesthetics.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe updates aim to streamline the creative process for individuals and teams, making it easier to integrate personalized styles across various projects.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-what-are-midjourney-s-new-moodboards\"\u003eWhat are Midjourney’s new moodboards?\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe standout feature, Moodboards, enables users to upload curated collections of images that act as inspiration for generating new art. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe AI model adapts to the diversity and complexity of the uploaded images, creating a unique style profile that remixes the visual elements. \u003c/p\u003e\n\n\n\n\u003cp\u003eThis addition is complemented by the ability to create multiple personalization profiles, allowing users to organize and deploy their different styles seamlessly.\u003c/p\u003e\n\n\n\n\u003cp\u003eSetting up a custom model has also become significantly faster, with the company claiming a fivefold improvement in image ranking speed. \u003c/p\u003e\n\n\n\n\u003cp\u003eThe “ranking” system is how Midjourney trains a custom model on behalf of you, the user. You need to navigate to Midjourney’s image ranker and pick which of a pair of random images you like best, then continue rating pairs of images until you’ve reached a certain threshold where the model understands what kinds of images and aesthetics you like. \u003c/p\u003e\n\n\n\n\u003cp\u003eUsers now need just 40 ratings to begin creating a profile, with optimal stability achieved at 200. Previously, you needed 200 to personalize the model.\u003c/p\u003e\n\n\n\n\u003cp\u003eWhile heavy users may still prefer contributing thousands of ratings for maximum precision, the streamlined process lowers the barrier to entry for new users.\u003c/p\u003e\n\n\n\n\u003cp\u003eUsers can begin rating pairs of images over at \u003ca href=\"https://www.midjourney.com/personalize\" target=\"_blank\" rel=\"noreferrer noopener\"\u003emidjourney.com/personalize\u003c/a\u003e.\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-better-organization-features\"\u003eBetter organization features\u003c/h2\u003e\n\n\n\n\u003cp\u003eThe updates also introduce organizational improvements. \u003c/p\u003e\n\n\n\n\u003cp\u003eUsers can now name their profiles, designate one or multiple profiles as defaults, and track all images associated with specific profiles. \u003c/p\u003e\n\n\n\n\u003cp\u003eMidJourney emphasizes that these features are particularly beneficial for those juggling multiple projects or collaborating with others.\u003c/p\u003e\n\n\n\n\u003cp\u003eDavid Holz, founder of MidJourney, shared the announcement on the company’s Discord server earlier today. He explained the motivation behind the updates, expressing a desire to make personalization accessible for a broader range of creative workflows. \u003c/p\u003e\n\n\n\n\u003cp\u003eHolz highlighted that the new tools allow users to take control of their projects while maintaining the flexibility to work with diverse creative teams.\u003c/p\u003e\n\n\n\n\u003cp\u003eAs MidJourney continues to refine its personalization infrastructure, the company is soliciting user feedback through its “ideas-and-features” channel. These developments highlight the platform’s commitment to empowering creators with tools that are both intuitive and powerful, marking another step forward in the evolution of AI-assisted creativity.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe additions come as expected following Midjourney’s announcement last week of an experimental new collaborative image making whiteboard feature called \u003ca href=\"https://venturebeat.com/ai/midjourney-is-launching-a-multiplayer-collaborative-worldbuilding-tool/\" target=\"_blank\" rel=\"noreferrer noopener\"\u003ePatchwork\u003c/a\u003e. \u003c/p\u003e\n\u003cdiv id=\"boilerplate_2660155\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eDaily insights on business use cases with VB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\u003cp\u003e\u003cimg src=\"https://venturebeat.com/wp-content/themes/vb-news/brand/img/vb-daily-phone.png\" alt=\"\"/\u003e\n\t\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2024-12-16T22:16:15Z",
  "modifiedTime": "2024-12-16T22:16:24Z"
}
