{
  "id": "997f37df-8625-445a-af3a-c99dd7669474",
  "title": "The games industry’s growth potential is shrinking | MIDiA",
  "link": "https://venturebeat.com/games/the-games-industrys-growth-potential-is-shrinking-midia/",
  "description": "The games industry's days of double-digit growth are behind it, according to MIDiA's sobering new Global Forecast report for 2025.",
  "author": "Rachel Kaser",
  "published": "Fri, 14 Feb 2025 23:39:40 +0000",
  "source": "https://feeds.feedburner.com/venturebeat/SZYF",
  "categories": [
    "GamesBeat",
    "Gaming Business",
    "category-/Games/Computer \u0026 Video Games",
    "Game Monetization",
    "Game Publishing",
    "Grand Theft Auto VI",
    "MIDiA",
    "Switch 2"
  ],
  "byline": "Rachel Kaser",
  "length": 4218,
  "excerpt": "The games industry's days of double-digit growth are behind it, according to MIDiA's sobering new Global Forecast report for 2025.",
  "siteName": "VentureBeat",
  "favicon": "",
  "text": "February 14, 2025 3:39 PM Research firm MIDiA recently launched its Global Games Forecast report for 2025 through 2031, in which it predicts certain trends in the gaming industry. And in this report, the forecast foresees that the games industry’s day of high growth might well be behind it. Specifically, it predicts that double-digit growth is not likely to continue and that publishers should temper their expectations if they don’t wish to face disappointment in their lack of gains — and that “Survive until ’25” is not enough. The report predicts software revenues of $203.2 billion in 2025 and $237.0 billion in 2031 — which will bring gaming in line with the International Monetary Fund’s predicted inflation rate of 4% and essentially render growth flat for the year. It also predicts the launch of the Switch 2 will bring hardware revenue up 8.4% to $20.6 billion in 2025, following 2024’s sharp decline; and that while the global number of gamers will grow, the average revenue per paying user will go down thanks to growing numbers in emerging markets. The gist of the report is a counter to more sunny predictions of an industry-wide return to pandemic-era growth — the era of double-digit growth is “over,” it says bluntly. While it does acknowledge that gaming will get some juice from the launch of GTA VI and the Switch 2, it notes that this will not necessarily be a good thing for anyone besides the companies that create those products. Rhys Elliott, MIDiA’s games analyst, said in a statement, “Make no mistake: GTA and the Switch 2 – and other premium releases – will help add more revenues for the market (+6.4% year-on-year growth for console in 2025). But Nintendo and Take-Two will be the big winners here. GTA 6 will be take up all the attention, having a negative impact on other developers’ games.” Live-service games and other dead ends MIDiA’s report also notes that growth vectors such as live-service games and subscription services are not going to be the money-makers that many believed, and that’s already being reflected in the former case. Multiple live-service games have been shut down or shortly will be shut down due to a lack of user interest and revenue flowing back to the companies. Gaming subscriptions, such as PlayStation Plus and Xbox Game Pass, might also see a significant slow-down in growth as users’ attention is so divided. The report notes: “The live-service gold rush already had its winners.” Elliott said in a follow-up interview with GamesBeat, “Many executives thought – and were led to believe by some consultancy firms and leading games analytics companies – that double-digit growth would continue [after the pandemic], greenlighting risky projects and strategies. Many of the resulting moves ultimately did not – or will not – pan out. And some have been canceled after years of development – and a week after launch in Concord’s case. The games market has reached its maturity phase, and it’s been this way for a while.” In short, there simply isn’t enough gamer attention to go around for all of these projects, meaning that games publishers will have to find other ways of sustaining themselves. The Switch 2, which could potentially support any kind of game from mobile to PC (if the rumors about the new mouse-like functionality are true), is likely to offer publishers a way of extending the life of their back catalogues. Developers can also target underserved markets. And if there is one benefit to gamers, it’s that the games industry is likely to quit its obsession with live-service titles and get back to creating the single-player premium titles that gamers will actually purchase and play, as evidenced by the success of games like Black Myth Wukong and Baldur’s Gate 3. To quote Elliott: “My recommendation: less waste, less trend-chasing, more innovation, and more data-backed segmentation. The market can’t keep catering to the same gamers and expect the pie to grow.” GB Daily Stay in the know! Get the latest news in your inbox daily Read our Privacy Policy Thanks for subscribing. Check out more VB newsletters here. An error occured.",
  "image": "https://venturebeat.com/wp-content/uploads/2025/02/Midia-2025-Report.jpg?w=1024?w=1200\u0026strip=all",
  "html": "\u003cdiv id=\"readability-page-1\" class=\"page\"\u003e\u003cdiv\u003e\n\t\t\n\t\t\u003csection\u003e\n\t\t\t\n\t\t\t\u003cp\u003e\u003ctime title=\"2025-02-14T23:39:40+00:00\" datetime=\"2025-02-14T23:39:40+00:00\"\u003eFebruary 14, 2025 3:39 PM\u003c/time\u003e\n\t\t\t\u003c/p\u003e\n\t\t\t\n\t\t\u003c/section\u003e\n\t\t\u003cdiv\u003e\n\t\t\t\t\t\u003cp\u003e\u003cimg width=\"750\" height=\"422\" src=\"https://venturebeat.com/wp-content/uploads/2025/02/Midia-2025-Report.jpg?w=750\" alt=\"\"/\u003e\u003c/p\u003e\t\t\u003c/div\u003e\n\t\u003c/div\u003e\u003cdiv id=\"primary\"\u003e\n\n\t\t\u003carticle id=\"content\"\u003e\n\t\t\t\u003cdiv\u003e\n\t\t\t\t\u003cp\u003eResearch firm MIDiA recently launched its Global Games Forecast report for 2025 through 2031, in which it predicts certain trends in the gaming industry. And in this report, the forecast foresees that the games industry’s day of high growth might well be behind it. Specifically, it predicts that double-digit growth is not likely to continue and that publishers should temper their expectations if they don’t wish to face disappointment in their lack of gains — and that “\u003ca href=\"https://venturebeat.com/games/survive-until-25-were-off-to-a-rough-start-the-deanbeat/\"\u003eSurvive until ’25\u003c/a\u003e” is not enough.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe report predicts software revenues of $203.2 billion in 2025 and $237.0 billion in 2031 — which will bring gaming in line with the International Monetary Fund’s predicted inflation rate of 4% and essentially render growth flat for the year. It also predicts the launch of the Switch 2 will bring hardware revenue up 8.4% to $20.6 billion in 2025, following 2024’s sharp decline; and that while the global number of gamers will grow, the average revenue per paying user will go down thanks to growing numbers in emerging markets.\u003c/p\u003e\n\n\n\n\u003cp\u003eThe gist of the report is a counter to more sunny predictions of an industry-wide return to pandemic-era growth — the era of double-digit growth is “over,” it says bluntly. While it does acknowledge that gaming will get some juice from the launch of GTA VI and the Switch 2, it notes that this will not necessarily be a good thing for anyone besides the companies that create those products.\u003c/p\u003e\n\n\n\n\u003cp\u003eRhys Elliott, MIDiA’s games analyst, said in a statement, “Make no mistake: GTA and the Switch 2 – and other premium releases – will help add more revenues for the market (+6.4% year-on-year growth for console in 2025). But Nintendo and Take-Two will be the big winners here. GTA 6 will be take up all the attention, having a negative impact on other developers’ games.”\u003c/p\u003e\n\n\n\n\u003ch2 id=\"h-live-service-games-and-other-dead-ends\"\u003eLive-service games and other dead ends\u003c/h2\u003e\n\n\n\n\u003cp\u003eMIDiA’s report also notes that growth vectors such as live-service games and subscription services are not going to be the money-makers that many believed, and that’s already being reflected in the former case. \u003ca href=\"https://venturebeat.com/games/player-first-euthanizes-multiversus-amid-ongoing-live-service-purge/\"\u003eMultiple live-service games\u003c/a\u003e have been shut down or shortly will be shut down due to a lack of user interest and revenue flowing back to the companies. Gaming subscriptions, such as PlayStation Plus and Xbox Game Pass, might also see a significant slow-down in growth as users’ attention is so divided. The report notes: “The live-service gold rush already had its winners.”\u003c/p\u003e\n\n\n\n\u003cp\u003eElliott said in a follow-up interview with GamesBeat, “Many executives thought – and were led to believe by some consultancy firms and leading games analytics companies – that double-digit growth would continue [after the pandemic], greenlighting risky projects and strategies. Many of the resulting moves ultimately did not – or will not – pan out. And some have been canceled after years of development – and a week after launch in Concord’s case. The games market has reached its maturity phase, and it’s been this way for a while.”\u003c/p\u003e\n\n\n\n\u003cp\u003eIn short, there simply isn’t enough gamer attention to go around for all of these projects, meaning that games publishers will have to find other ways of sustaining themselves. The Switch 2, which could potentially support any kind of game from mobile to PC (if the rumors about the new mouse-like functionality are true), is likely to offer publishers a way of extending the life of their back catalogues. Developers can also target underserved markets.\u003c/p\u003e\n\n\n\n\u003cp\u003eAnd if there is one benefit to gamers, it’s that the games industry is likely to quit its obsession with live-service titles and get back to creating the single-player premium titles that gamers will actually purchase and play, as evidenced by the success of games like Black Myth Wukong and Baldur’s Gate 3. To quote Elliott: “My recommendation: less waste, less trend-chasing, more innovation, and more data-backed segmentation. The market can’t keep catering to the same gamers and expect the pie to grow.”\u003c/p\u003e\n\u003cdiv id=\"boilerplate_2663995\"\u003e\n\t\t\t\t\u003cp\u003e\u003cstrong\u003eGB Daily\u003c/strong\u003e\u003c/p\u003e\n\t\t\t\t\u003cp\u003eStay in the know! Get the latest news in your inbox daily\u003c/p\u003e\n\t\t\t\t\n\t\t\t\t\u003cp\u003eRead our \u003ca href=\"https://venturebeat.com/terms-of-service/\"\u003ePrivacy Policy\u003c/a\u003e\u003c/p\u003e\n\t\t\t\t\u003cp id=\"boilerplateNewsletterConfirmation\"\u003e\n\t\t\t\t\tThanks for subscribing. Check out more \u003ca href=\"https://venturebeat.com/newsletters/\"\u003eVB newsletters here\u003c/a\u003e.\n\t\t\t\t\u003c/p\u003e\n\t\t\t\t\u003cp\u003eAn error occured.\u003c/p\u003e\n\t\t\t\u003c/div\u003e\t\t\t\u003c/div\u003e\n\n\t\t\t\t\t\t\t\n\t\t\t\n\t\t\u003c/article\u003e\n\n\t\u003c/div\u003e\u003c/div\u003e",
  "readingTime": "5 min read",
  "publishedTime": "2025-02-14T23:39:40Z",
  "modifiedTime": "2025-02-14T23:39:46Z"
}
